{
  "post": {
    "title": "Samsung could soon put some Galaxy Watch features behind a paywall",
    "author": "diacewrb",
    "id": "1lf7uoa",
    "score": 1064,
    "created_utc": 1750330529.0,
    "selftext": "",
    "num_comments": 188,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lf7uoa/samsung_could_soon_put_some_galaxy_watch_features/"
  },
  "comments": [
    {
      "id": "mym1h8z",
      "author": "TwistingEcho",
      "body": "Everytime basic features get pay walled, a not insignificant number of people turn away from the brand. Drives prices up  so profits must come from the pool of customers still paying. Also, this is shit.",
      "score": 750,
      "created_utc": 1750331387.0,
      "replies": [
        {
          "id": "myo5nc6",
          "author": "fuqdisshite",
          "body": "my wife got me [*Atari 50*](https://www.nintendo.com/us/store/products/atari-50-the-anniversary-celebration-switch) for the Switch for Father's Day.\n\ni put it in and went flipping through the collection of games and there are multiple games that are greyed out and need to be purchased.  \n\nwhat the fuck, like, i don't mind that there is DLC but the way the games are already showing on the menu is just dumb.  it makes you feel like completing the set and is a shitty way to do it.",
          "score": 86,
          "created_utc": 1750355985.0,
          "replies": [
            {
              "id": "myol3cu",
              "author": "matsis01",
              "body": "Just looked up the description for that game on the Nintendo Store: \n>A complete package for any video game fan",
              "score": 57,
              "created_utc": 1750360934.0,
              "replies": [
                {
                  "id": "myoo5rq",
                  "author": "fuqdisshite",
                  "body": "[LIES!!!](https://www.reddit.com/r/lordhelpme/comments/1lfjwl9/lies)\n\nif you click on either of the grey icons it opens the eShop and wants money.",
                  "score": 27,
                  "created_utc": 1750361845.0,
                  "replies": [
                    {
                      "id": "myts0a8",
                      "author": "ForTheBread",
                      "body": "It looks like its expansion content that released 2 years after the initial release. At least from what I'm seeing on Steam. I don't see an issue with that if it's true.\n\nEdit: checked on the eshop and yeah its expansion content released years after release. I dont see how this is worth getting angry over.",
                      "score": -4,
                      "created_utc": 1750433219.0,
                      "replies": [
                        {
                          "id": "mytw4an",
                          "author": "fuqdisshite",
                          "body": "if it released later then why is it greyed out on my console physical edition?\n\nto be clear, when i put my physical chip that we paid retail for i was required to download an update for before i could play it?\n\ndoes that not make sense?\n\nif the game was complete when i bought it and the DLC was up to me to purchase, then why am i required to look at the games i did not agree to pay for every time i turn the game on?\n\ni think you are missing the entire point.",
                          "score": 1,
                          "created_utc": 1750434396.0,
                          "replies": [
                            {
                              "id": "mytxcmk",
                              "author": "ForTheBread",
                              "body": "I do get your point. I'm just pointing out that it looks like it might be DLC content. Plenty of games advertise their DLC within their games. I dont really see any harm in it personally.\n\nYou had to download an update likely cause of some update for the game. Not sure what relevance that has to do with anything. Plenty of physical games have updates. Generally a good thing cause if the disc had a bug or something its good to fix that bug. \n\nYou say chip too which confuses me. It looks you're playing on an ultrawide? Does the Switch (I'm assuming Switch cause that's the only chip-like game system I know of) support ultrawide?",
                              "score": 0,
                              "created_utc": 1750434747.0,
                              "replies": [
                                {
                                  "id": "mytyupl",
                                  "author": "fuqdisshite",
                                  "body": "well, the original comment was that I do find that shitty.\n\nif a 10 year old was handed the game and then when he put it in and jumped through the hoops with the Day One Supplement he sees all the new games but a handful are greyed out and asking for more money, wouldn't that be a bit disappointing?\n\nlike, hey, here's a box of LEGO, go ahead and build it, but, you have to download the instructions first, AND, when you download the instructions you will see 7 distinct pieces that the company chose to add years later and they will remind you EVERY SINGLE TIME you play with the LEGO that you need to spend more to complete your set.\n\nwith how digital downloads work there is exactly zero reason that the DLC has to be visible when i turn my game on.  it is a petty cash grab that uses shame and FOMO to get that extra 13$.\n\nlike i said, we have no issue buying the new games.  the issue is with forcing the games on to my dashboard for no reason other than reminding me i have not bought them yet.  \n\nthat is shitty.",
                                  "score": -1,
                                  "created_utc": 1750435182.0,
                                  "replies": [
                                    {
                                      "id": "mytza47",
                                      "author": "ForTheBread",
                                      "body": "Idk why you are mentioning day one DLC. I didn't mention that. Yeah, day one DLC sucks.\n\nYou can just ignore it. I don't see the harm. The game updating years later with extra optional content is pretty nice. If they didn't advertise it idk if I'd ever have noticed personally.",
                                      "score": 1,
                                      "created_utc": 1750435308.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "myrs8j5",
                  "author": "tfrules",
                  "body": "Nintendo are very scummy as gaming companies go",
                  "score": 6,
                  "created_utc": 1750402961.0,
                  "replies": [
                    {
                      "id": "mys5r4x",
                      "author": "Extreme-Tactician",
                      "body": "They had nothing to do with this, this is all Atari.",
                      "score": 6,
                      "created_utc": 1750410856.0,
                      "replies": [
                        {
                          "id": "mysh0z3",
                          "author": "IceBreak",
                          "body": "Both can be true.",
                          "score": -2,
                          "created_utc": 1750416953.0,
                          "replies": [
                            {
                              "id": "myt8zwa",
                              "author": "fireowlzol",
                              "body": "The hate boner this sub has for Nintendo is ridiculous",
                              "score": 4,
                              "created_utc": 1750427612.0,
                              "replies": [
                                {
                                  "id": "myuwvr8",
                                  "author": "IceBreak",
                                  "body": "I like Nintendo. They are also scummy. Both are true.",
                                  "score": -1,
                                  "created_utc": 1750444972.0,
                                  "replies": [
                                    {
                                      "id": "myzczs2",
                                      "author": "Extreme-Tactician",
                                      "body": "Why are they scummy for something they didn't do?",
                                      "score": 2,
                                      "created_utc": 1750511845.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mytidiy",
                              "author": "BigTonyT30",
                              "body": "Both *can* be true but when someone is calling Nintendo out for something they didn’t do then ya’ll just look foolish",
                              "score": 3,
                              "created_utc": 1750430434.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "myrub0c",
                  "author": "UnlimitedDeep",
                  "body": "Sounds like something I’d be reporting to consumer affairs",
                  "score": 1,
                  "created_utc": 1750404136.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myra1hl",
              "author": "jert3",
              "body": "For 40 year old games as well. That's so lame.",
              "score": 9,
              "created_utc": 1750393781.0,
              "replies": []
            },
            {
              "id": "myskbjk",
              "author": "MangoAtrocity",
              "body": "If I understand correctly, the initial release had 100 ish games. Then, the did 2 DLCs with 20 ish games each.",
              "score": 4,
              "created_utc": 1750418474.0,
              "replies": [
                {
                  "id": "mytgfl9",
                  "author": "gbonic",
                  "body": "Yeah, it’s this. The entire thing felt like a nice complete package on release. While the way they integrated the DLC into the full release is really nice, I wish they’d not integrated it like that for people who HAVEN’T bought the DLC. The way it’s designed makes you feel like you’re missing an integral part of the whole, instead of optional DLC that wasn’t originally part of the package. Feels shitty to new users instead of feeling like bonus content as it does to me having had it since launch.",
                  "score": 1,
                  "created_utc": 1750429864.0,
                  "replies": []
                },
                {
                  "id": "mysl5ot",
                  "author": "fuqdisshite",
                  "body": "19 games each on the two different DLC.\n\n100+ on the initial release.\n\nmy wife paid 30ish$ for the physical games set and they want 7.99$ each for the two different downloads, or, 13.99$? for both.  \n\nsope, .30c a game for the initial release and then .36c a game if you purchase the bundled DLC.\n\nthe new games are nothing special either.",
                  "score": 0,
                  "created_utc": 1750418849.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myrn1uj",
              "author": "Cin77",
              "body": "Theres a sega one on steam that is the same >.<",
              "score": 1,
              "created_utc": 1750400124.0,
              "replies": []
            },
            {
              "id": "mysgsyf",
              "author": "None",
              "body": "I have Atari 50 also and had not noticed that. That’s pretty shitty",
              "score": 1,
              "created_utc": 1750416850.0,
              "replies": [
                {
                  "id": "mysjqo6",
                  "author": "fuqdisshite",
                  "body": "yup.\n\ni was really digging the look and feel of the collection, was fine with Day One (for me) Updates, knew they had DLC, fine with that...\n\nbut, then i go flipping through the games knowing four would be greyed out as \"unlockable\" but then started noticing the other games that were greyed out too.  \n\n'hmm?  what's this?' *clicks game* \"***GIVE ME MORE FUCKING MONEY!!!***\"\n\nreally shitty way to guilt people in to spending another 15$.\n\nwhy not just sell the game for 45$ instead of 30$ and many of us older gamers would have agreed with no issue.  i buy 2 to 3 games a year, both physical and digital...  my budget isn't super heavy, but, we like to change it up sometimes.  \n\nhaving to be guilt tripped in to spending 50% more is far worse than just pricing the game 50% higher.",
                  "score": 3,
                  "created_utc": 1750418212.0,
                  "replies": [
                    {
                      "id": "mysm6nr",
                      "author": "None",
                      "body": "Yeah and it’s not like it’s actual work for them. They’re basically flipping a 0 to a 1 and then letting you access a 50 year old ROM. Pretty lame",
                      "score": 2,
                      "created_utc": 1750419300.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "myo95k6",
          "author": "ShockRampage",
          "body": "Enshitification.",
          "score": 20,
          "created_utc": 1750357089.0,
          "replies": []
        },
        {
          "id": "mynrj9l",
          "author": "TheITMan19",
          "body": "This is why I fucked off Strava - was a useful tool to begin with but I’m not that desperate to read detailed stats on my exercise so they can do one as well. I killed it off. Sad to hear about Galaxy but all vendors are at it. Fustrating. I’ve even given up on my smart watch and back to analog when not exercising. Tbh, I don’t even need a smart watch - it offers such a small benefit it doesn’t matter if I use it or not. This shit grates on me, ngl.",
          "score": 13,
          "created_utc": 1750351796.0,
          "replies": [
            {
              "id": "myrtq7l",
              "author": "speculatrix",
              "body": "If this enshittification continues, then if my ageing galaxy watch 4 dies, I'll go back to a dumb watch.\n\nOr consider the pine64 watch and go r/selfhosted\n\nhttps://pine64eu.com/product/pinetime-smartwatch-sealed/",
              "score": 6,
              "created_utc": 1750403805.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mym1sft",
          "author": "AntiDECA",
          "body": "Realistically, the galaxy watch was already shit so it doesn't make much difference. People only get them as combo deals/free with their phone. ",
          "score": 93,
          "created_utc": 1750331530.0,
          "replies": [
            {
              "id": "mymkts9",
              "author": "kerbaal",
              "body": "meh I really like my Galaxy Watch 3. I bought it without ever having owned a samsung phone because it looked like the best smart watch on the market. Mostly because I didn't want a lot of crazy features and apps; I just wanted the heart monitor and for it to be an auxiliary notification for my phone; maybe use it for presence detection.\n\nHonestly getting older and thinking a heart monitor was a good idea was my only reason for wanting to go back to allowing a device on my wrist (I stopped wearing a watch when I started carrying a cell phone) .\n\nI wanted something simple. That said, pretty sure I wouldn't have bought another samsung anyway, now its off the table.",
              "score": 52,
              "created_utc": 1750338974.0,
              "replies": [
                {
                  "id": "mymno7u",
                  "author": "-HeyThatsPrettyNeat-",
                  "body": "Sounds like the Garmin Instinct might be for you",
                  "score": 20,
                  "created_utc": 1750339930.0,
                  "replies": [
                    {
                      "id": "mymqcf6",
                      "author": "kerbaal",
                      "body": "The GW3 I am using is only 4 years old and the battery still can make it multiple days on a single charge. Unless some other annoyance pops up first, I am unlikely to think of upgrading for another 4 years when the battery just doesn't have more than a day and a half or so.\n\nat that point I will likely spend about 30 seconds considering the possibility of sourcing a lithium polymer cell to replace it myself, and then buying a new watch. \n\nedit: thinking a bit more, my wife and I got the same watch, but she got the smaller one with a smaller battery, I will likely actually upgrade sooner when hers stops being viable, just so we can stay in sync and I am not supporting two different technologies.",
                      "score": 10,
                      "created_utc": 1750340827.0,
                      "replies": []
                    },
                    {
                      "id": "myrpf6z",
                      "author": "_Dreamer_Deceiver_",
                      "body": "Garmin has also gone down the forcing useless ai for subs route",
                      "score": 1,
                      "created_utc": 1750401415.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "myntv7d",
                  "author": "Polymersion",
                  "body": "Yeah, mine is literally primarily a \"put my phone away\" device.\n\nTime and notifications are all I really wanted. Step counter is a bonus.\n\nAlso, ironically, I prefer having something on my wrist to having something in my pocket.",
                  "score": 4,
                  "created_utc": 1750352470.0,
                  "replies": []
                },
                {
                  "id": "mynpe0x",
                  "author": "polopolo05",
                  "body": "My dad got one for fall detection. he has fell twice. it didnt work.",
                  "score": 5,
                  "created_utc": 1750351177.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myntrwi",
              "author": "Lawdie123",
              "body": "The problem is all the brand locking, certain features not working if your using a different brand to the phone its connected to.\n\nI would love to use an Apple Watch for example but it's locked the Apple eco system, half the Samsung watch features are locked to Samsung phones",
              "score": 4,
              "created_utc": 1750352443.0,
              "replies": []
            },
            {
              "id": "myn4x8l",
              "author": "axefjord",
              "body": "After having owned the Garmin Venu 1 and Venu 2, I just converted to the Samsung GW6 (some days ago).\n\nThe GW6 is much faster, better interface, is more customizeable and have loads of features (shortcuts, gestures, apps, etc.)\n\nNow, the Garmin Venu 2 (more expensive) has better battery life, and probably better training-features. The body battery function was reliable for me. But that's it. The day-to-day smart features are shit. The google assistant stopped working half a year ago, and even when it worked most of the time, it took like 6-10 seconds to active. No useful apps, the flashlight was weak and hidden in the training menu. Even the alarms were not reliable. And nothing sync'ed with the phone. Not alarms, not silent mode, not even the phone contacts. You had to choose a few contacts to import, that you could call from the watch...",
              "score": 11,
              "created_utc": 1750345231.0,
              "replies": [
                {
                  "id": "myq7pyc",
                  "author": "materialvoid",
                  "body": "To be fair some aspects would be better, those are watches from \\~2019 and \\~2021 compared to 2023 for the GW6. A fairer comparison might be the Venu 3.\n\nThat said, it sounds like you needed a smartwatch more so than a fitness focused one and that's totally fair.\n\nAs a counterpoint, I was in the smartwatch eco-system, earlier with the GW3, then AW6, AW SE2, Garmin 255, AW9, then back to my 255. I found I wasn't using any of the smartwatch features even though it was cool for a while, and I found most smartwatches weren't really good at showing comprehensive health like Garmin does (mind you, it's not perfect and I'm wary after they announced a paywall too, ugh).\n\nSomeone needs to make a smartwatch that can legit last a week. I have no doubt that Android and Apple health will get better, but I don't feel that they're there yet",
                  "score": 2,
                  "created_utc": 1750379428.0,
                  "replies": [
                    {
                      "id": "mys8tqr",
                      "author": "axefjord",
                      "body": "I got the Venu 2 plus (2022). It has pricetag of about $350-400, with some offers going down to $250-300. The Venu 3 is MUCH more expensive at around $500 around here, with few options of getting it for less.\n\nThe galaxy watch 6 is from 2023, costs around $250-300 here, and can often be found be bought new-in-box for $150, as it is bundles with phones.\n\nTherefore, I would say the venu2 plus should be able to be compared to the GW6.\n\nAnd yes, you are right that I use the smart functions more than the health features. But mainly I just use the assistant to make timers and notifications to myself. This really helps during hectic days with many work- and family activities. This functionality was advertised for the venu 2 plus, but Garmin hasn't even bothered to maintain that basic functionalty.",
                      "score": 3,
                      "created_utc": 1750412646.0,
                      "replies": [
                        {
                          "id": "mywymfy",
                          "author": "materialvoid",
                          "body": "Yeah that’s totally fair. Canada here and the prices are robbery. I only got the 255 through points reducing the price and it was an older model. Smartwatch focus features, you’ll get more power from a Samsung/apple price equivalent.",
                          "score": 1,
                          "created_utc": 1750469189.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "myr67g9",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1750392114.0,
                      "replies": [
                        {
                          "id": "mywygno",
                          "author": "materialvoid",
                          "body": "Ah sorry, I was referring to the Apple and Galaxy SW with battery life. That one main thing I love about Garmins and you’ll have to pry the MIP screen from my cold, dead hands. My 255 goes about 9-10 days on a charge",
                          "score": 2,
                          "created_utc": 1750469129.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "myo0uu2",
              "author": "Kevino_007",
              "body": "Disagree,  great watch.",
              "score": 10,
              "created_utc": 1750354534.0,
              "replies": [
                {
                  "id": "myp2x22",
                  "author": "LordOzmodeus",
                  "body": "I think its a great watch as well. When my fitbit versa lite died I went for the base model galaxy watch 5. I've had it for 2 years now and its been fantastic. Just as smooth as my phone, battery lasts for about 3 days before needing a charge.\n\nHowever, if this is true about pay walling features ill be moving to another brand. The enshitification of goods and services has been unreal lately.",
                  "score": 5,
                  "created_utc": 1750366115.0,
                  "replies": [
                    {
                      "id": "mypcnwy",
                      "author": "Kevino_007",
                      "body": "I doubt it, like what? Heartrate sensor paywalled or o2 sensor, ecg ? Alarmclock, mediaplayer, time? I dont think so. And that's really all I want it to do\nMaybe it's going to be some kind of ai summary and insight in your overall health or whatever.  It has long been known ai will be paywalled so whatever ai is going to the watch will be too probably.  Don't care",
                      "score": 7,
                      "created_utc": 1750369038.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "myntccg",
              "author": "AverageLiberalJoe",
              "body": "Its nice to have but I dont use most of it.",
              "score": 3,
              "created_utc": 1750352315.0,
              "replies": []
            },
            {
              "id": "mynuuug",
              "author": "_northernlights_",
              "body": "\\[citation needed\\]\n\nI don't know, i've owned 2, still using the 2nd one, and love them.",
              "score": 2,
              "created_utc": 1750352763.0,
              "replies": []
            },
            {
              "id": "mynzya1",
              "author": "bent_my_wookie",
              "body": "I switched back and forth for the last couple versions of the Apple Watch and Samsung. Samsung was straight up infuriating because nothing just “worked”. \n\nHowever, the Apple Watch shelved their blood oxygen feature after being sued, so they drop features just the same.",
              "score": 2,
              "created_utc": 1750354263.0,
              "replies": []
            },
            {
              "id": "myou7wd",
              "author": "tempest_87",
              "body": "Got mine to replace my pebble steel for free by getting a new phone.\n\nAll I can say is I'm excited that pebbles are [coming back](https://ericmigi.com/blog/why-were-bringing-pebble-back) (maybe).",
              "score": 2,
              "created_utc": 1750363617.0,
              "replies": [
                {
                  "id": "myr78z0",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1750392558.0,
                  "replies": [
                    {
                      "id": "myr9j9k",
                      "author": "tempest_87",
                      "body": "I just want a normal steel. Silver metal is just the style I prefer.",
                      "score": 1,
                      "created_utc": 1750393556.0,
                      "replies": []
                    },
                    {
                      "id": "mysgu0f",
                      "author": "DutchSuperHero",
                      "body": "It's a bummer they didn't include a heart rate monitor in the cheaper one.",
                      "score": 1,
                      "created_utc": 1750416864.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "myme4l0",
              "author": "PsyJak",
              "body": "I was going to say I bought it but then I did use my work spend account to pay for it",
              "score": 1,
              "created_utc": 1750336615.0,
              "replies": []
            },
            {
              "id": "mynazvv",
              "author": "d_e_g_m",
              "body": "As an owner, you are right in the money",
              "score": 1,
              "created_utc": 1750347001.0,
              "replies": []
            },
            {
              "id": "mym53p4",
              "author": "Indie89",
              "body": "Yeah I have two unopened from when I bought phones ",
              "score": -3,
              "created_utc": 1750333019.0,
              "replies": [
                {
                  "id": "myn8p79",
                  "author": "Muslim_Wookie",
                  "body": "Can I have one please? Serious question",
                  "score": 8,
                  "created_utc": 1750346333.0,
                  "replies": []
                },
                {
                  "id": "mymgw73",
                  "author": "Hvarfa-Bragi",
                  "body": "My buddy gave me the one that came bundled with his phone and it is indeed, shit.\n\nI miss the original android wear watches.",
                  "score": -1,
                  "created_utc": 1750337615.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myn9bx4",
              "author": "MaleficentEngine2355",
              "body": "Samsung is a shit brand anymore.",
              "score": -7,
              "created_utc": 1750346520.0,
              "replies": []
            }
          ]
        },
        {
          "id": "myn6xaf",
          "author": "Dramatic_Explosion",
          "body": "I believe the google AI features on their phones are getting paywalled at the end of the year, the ones where you can have it erase things from a picture for you.\n\nMore and more features are leaving their phones to make them the true android version of the iPhone",
          "score": 3,
          "created_utc": 1750345813.0,
          "replies": [
            {
              "id": "mynxft4",
              "author": "EatsFiber2RedditMore",
              "body": "I wish they had asked before putting them on in the first place.",
              "score": 3,
              "created_utc": 1750353522.0,
              "replies": []
            }
          ]
        },
        {
          "id": "myofk3h",
          "author": "ExplosiveDisassembly",
          "body": "It's even funnier when you realize getting a yearly blood panel would be better and cheaper than a watch telling you approximate figures without proper medical guidance.",
          "score": 1,
          "created_utc": 1750359160.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymgizi",
      "author": "Proximity",
      "body": "I've owned a Galaxy watch 1, 4, and now a 6 and I've adored them. The *second* they try to charge me a subscription fee to use features on the thing I already paid for, it's getting tossed into a box.",
      "score": 193,
      "created_utc": 1750337485.0,
      "replies": [
        {
          "id": "myonmmr",
          "author": "FacepalmFullONapalm",
          "body": "Changing the terms of the sale, gotta love rapey mindsets from these companies",
          "score": 30,
          "created_utc": 1750361686.0,
          "replies": []
        },
        {
          "id": "mymikjw",
          "author": "Herkfixer",
          "body": "Geez... Read the articles\n\n>Back at the company’s July 2024 Unpacked event, Samsung noted *that “currently available” Samsung Health features won’t require a paid subscription*, but cautioned that “different terms may apply” for *future features*",
          "score": -77,
          "created_utc": 1750338199.0,
          "replies": [
            {
              "id": "mymnma1",
              "author": "salter77",
              "body": "Remember when Samsung mocked Apple about the aux jack? Probably also about the lack of charger, implying that they won’t do the same.\n\nThen they did it anyway, so I won’t trust what they say.",
              "score": 82,
              "created_utc": 1750339911.0,
              "replies": [
                {
                  "id": "myo4vx2",
                  "author": "QuaternionsRoll",
                  "body": "https://youtu.be/0hIoyb9L5g0",
                  "score": 2,
                  "created_utc": 1750355752.0,
                  "replies": []
                },
                {
                  "id": "myn59cj",
                  "author": "ABetterKamahl1234",
                  "body": "> Remember when Samsung mocked Apple about the aux jack?\n\nTBF, once they realized consumers as a whole didn't really give a shit, they probably stopped giving a shit either. The mocking is a decent test on consumer reactions to another brand taking the risk instead..",
                  "score": -28,
                  "created_utc": 1750345329.0,
                  "replies": [
                    {
                      "id": "myn7hw1",
                      "author": "Mmm_bloodfarts",
                      "body": "What consumer reaction would have told them not to take out the jack? Samsung users were mocking apple, should they have made a parade about it?",
                      "score": 23,
                      "created_utc": 1750345980.0,
                      "replies": [
                        {
                          "id": "myo7qa2",
                          "author": "-_Jason_-",
                          "body": "Guess they didn't convert enough Apple users. So clearly the people only bought an iPhone because he didn't have a headphone jack /s",
                          "score": 1,
                          "created_utc": 1750356635.0,
                          "replies": []
                        },
                        {
                          "id": "myobbzn",
                          "author": "flight_recorder",
                          "body": "Apple users were also complaining but Apple sales never changed.  That tells all manufacturers that complaints don’t mean much",
                          "score": 0,
                          "created_utc": 1750357788.0,
                          "replies": [
                            {
                              "id": "myp4woj",
                              "author": "Mmm_bloodfarts",
                              "body": "Hinestly if they weren't the only ones capable of making a phone with an s-pen, i would have jumped ship right there and then, same with many note users",
                              "score": 1,
                              "created_utc": 1750366694.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mym8g3c",
      "author": "nslenders",
      "body": "![gif](giphy|fXnRObM8Q0RkOmR5nf)",
      "score": 130,
      "created_utc": 1750334416.0,
      "replies": []
    },
    {
      "id": "mym4r3u",
      "author": "themikker",
      "body": "The health tracking was the single useful thing that the smartwatch had that it can do better than a phone. If they make that a subscription service (i.e. remove the feature entirely b.c. who would pay for that), then there is literally 0 (zero! zilch!) reasons to ever get one.",
      "score": 127,
      "created_utc": 1750332867.0,
      "replies": [
        {
          "id": "mynbg4v",
          "author": "Wakkit1988",
          "body": "The reason they're doing this is to try and get people to buy their smart ring *and* a watch, which will no doubt be cheaper than paying the subscription over time. However, it's still just a giant cash grab.",
          "score": 24,
          "created_utc": 1750347130.0,
          "replies": [
            {
              "id": "mynpr3s",
              "author": "polopolo05",
              "body": "I hate rings. I will never wear one.",
              "score": 13,
              "created_utc": 1750351282.0,
              "replies": [
                {
                  "id": "mynwpbn",
                  "author": "PaulR79",
                  "body": "Me either. They make it difficult to pee.",
                  "score": 25,
                  "created_utc": 1750353306.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "myssh0v",
          "author": "lexievv",
          "body": "I mean, you'd be surprised how brand loyal people can be.",
          "score": 2,
          "created_utc": 1750421852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymq21m",
      "author": "graffiksguru",
      "body": "I've had 4 galaxy watches through the years. I love my 7, but will stop getting them if they ever introduce a subscription.",
      "score": 19,
      "created_utc": 1750340733.0,
      "replies": []
    },
    {
      "id": "myngnpj",
      "author": "Msk-XX",
      "body": "Ah well, let's see what happens.\n\nI'm happy with my Samsung phone, watch and buds. But if any functionality on any one of those devices moves to a subscription, then I'm out. I'm sick to death of subscriptions. I would sell all 3 and move to other brands. \n\nI half hope they do, it might be nice to try something different after so many years with Samsung.",
      "score": 16,
      "created_utc": 1750348627.0,
      "replies": []
    },
    {
      "id": "mymi23h",
      "author": "demomagic",
      "body": "Ask Logitech how that worked out for them when the CEO intimated the ‘Forever Mouse’ could be a subscription",
      "score": 48,
      "created_utc": 1750338020.0,
      "replies": [
        {
          "id": "myob17r",
          "author": "Northern23",
          "body": "That'd solve their double click issue once and for all though",
          "score": -5,
          "created_utc": 1750357690.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymce4d",
      "author": "None",
      "body": "It’s because people keep paying for this slop. Refuse to pay for their bullshit.",
      "score": 40,
      "created_utc": 1750335955.0,
      "replies": [
        {
          "id": "myo68u6",
          "author": "ashvy",
          "body": "Own the means of consumption ☭",
          "score": 8,
          "created_utc": 1750356171.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myo8g0z",
      "author": "jspurlin03",
      "body": "Man, executives chasing constant profit squeezing _suck_.",
      "score": 10,
      "created_utc": 1750356861.0,
      "replies": []
    },
    {
      "id": "mymh47h",
      "author": "tignasse",
      "body": "It would be my last Samsung watch. \n\nDon't really need a smartwatch anyway",
      "score": 32,
      "created_utc": 1750337691.0,
      "replies": [
        {
          "id": "myxzb0d",
          "author": "PM_Me-Your_Freckles",
          "body": "I love being able to see who is ringing me and control my music from my watch while working, but I'll happily go back to my dumb watch, which tells time just as effectively.\n\nHell, the only reason I bought the thing was because it came with a free pair of Buds3 Pro.",
          "score": 1,
          "created_utc": 1750485049.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymnaj6",
      "author": "kurisu7885",
      "body": "IF they do this then I'll look at other smartwatch brands. I want to upgrade to a newer Galaxy watch but this will have me looking elsewhere.",
      "score": 6,
      "created_utc": 1750339801.0,
      "replies": []
    },
    {
      "id": "mynuo4x",
      "author": "Aware-Feed3227",
      "body": "They collected enough of your health data. Now you gotta pay.",
      "score": 6,
      "created_utc": 1750352708.0,
      "replies": []
    },
    {
      "id": "mynw8dh",
      "author": "kimjong_unsbarber",
      "body": "It's bad enough they took the heart rate monitor off their newer phones to try to force people to buy these damn things. Might as well buy a Garmin or something.",
      "score": 5,
      "created_utc": 1750353168.0,
      "replies": [
        {
          "id": "myoodx9",
          "author": "Vabla",
          "body": "No, Garmin is doing the same subscription shit too.",
          "score": 6,
          "created_utc": 1750361914.0,
          "replies": [
            {
              "id": "myqj74v",
              "author": "kimjong_unsbarber",
              "body": "I guess I don't need a smart watch",
              "score": 4,
              "created_utc": 1750383504.0,
              "replies": []
            },
            {
              "id": "myrplwx",
              "author": "_Dreamer_Deceiver_",
              "body": "So far normal stuff is still free its the ai bloat that's subbed. So that's fine by me...for now",
              "score": 1,
              "created_utc": 1750401516.0,
              "replies": [
                {
                  "id": "mzafpeb",
                  "author": "Vabla",
                  "body": "Show me a single company that introduced a subscription and then didn't neglect the free version to shit. And in this case we're talking about a company selling the most expensive devices of all competition.",
                  "score": 2,
                  "created_utc": 1750662268.0,
                  "replies": [
                    {
                      "id": "mzbfv6a",
                      "author": "_Dreamer_Deceiver_",
                      "body": "> so far",
                      "score": 1,
                      "created_utc": 1750681495.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mymjnws",
      "author": "slothson",
      "body": "Bullshit.",
      "score": 5,
      "created_utc": 1750338577.0,
      "replies": []
    },
    {
      "id": "mynesal",
      "author": "fronl",
      "body": "Can’t wait for all lightbulbs to be “smart bulbs” and require a subscription else they get wirelessly bricked.",
      "score": 5,
      "created_utc": 1750348088.0,
      "replies": []
    },
    {
      "id": "mynixfh",
      "author": "Slipguard",
      "body": "Just in time for Pebble to relaunch.",
      "score": 5,
      "created_utc": 1750349289.0,
      "replies": []
    },
    {
      "id": "mynm11v",
      "author": "thornset",
      "body": "I guess i can just put my next few hundred bucks into an analogue watch. Seems like that's what they really want",
      "score": 4,
      "created_utc": 1750350196.0,
      "replies": []
    },
    {
      "id": "myskc4k",
      "author": "im-cringing-rightnow",
      "body": "Look, as soon as my watch starts requiring a subscription for basic functions - I'm gonna find another watch.",
      "score": 4,
      "created_utc": 1750418481.0,
      "replies": []
    },
    {
      "id": "mymu80i",
      "author": "howdyzach",
      "body": "I have not found that samsungs health tracking is particularly accurate or useful.  The \"stress meter\" and even the heart rate tracker has never worked consistently and I have a hard time believing that a blood glucose monitor will be able to provide meaningful information.",
      "score": 4,
      "created_utc": 1750342069.0,
      "replies": []
    },
    {
      "id": "mynse27",
      "author": "LQTPharmD",
      "body": "The heart rhythm monitor saved my life a few weeks ago. I got an alert saying my heart was out of rhythm while I was in vegas for a work retreat. Panicked I called the front desk and they sent an for emergency services. Afib was confirmed and I was wheeled to the hospital.",
      "score": 3,
      "created_utc": 1750352041.0,
      "replies": []
    },
    {
      "id": "mymfgiw",
      "author": "Novemberai",
      "body": "Do it, Samsung, and I'll buy one of those Xiaomi or Huawei devices",
      "score": 8,
      "created_utc": 1750337100.0,
      "replies": [
        {
          "id": "myqaji0",
          "author": "m__a__s",
          "body": "My wife loves her Xiaomi Smart Band 9.  And it was $50.\n\nI wear a regular watch.  They cannot paywall that.",
          "score": 4,
          "created_utc": 1750380450.0,
          "replies": []
        },
        {
          "id": "myr2bh5",
          "author": "OutlyingPlasma",
          "body": "Or the pebble. It's back baby!",
          "score": 2,
          "created_utc": 1750390486.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymkeir",
      "author": "KuroOni",
      "body": "As a person who only used high end samsung profucts in high-tech for the past 10 years, and in the case of watches and phones the Galaxy series, I only stuck with the brand because they offered what they promised without any strings attached, high quality products that you know you can trust. That includes phones and smartwatches even though they have done nothing for the battery life when other watches have way better batteries, are cheaper and come with about the same features because I believed in samsung. Now if they start paywalling things in their watches, it is only a matter of time before they do the same to other products. And I refuse to pay even 1 dime out of principle, if they do that I am finding another brand.",
      "score": 7,
      "created_utc": 1750338830.0,
      "replies": []
    },
    {
      "id": "mym41mg",
      "author": "Grahamr1234",
      "body": "I've have an Amazfit T Rex and my wife's just got an Amazfit Active 2 premium, and they are both really great for the money. \n\nLoads of features and genuinely exceptional battery life.",
      "score": 16,
      "created_utc": 1750332557.0,
      "replies": [
        {
          "id": "mymd7ia",
          "author": "5WattBulb",
          "body": "Garmin Instinct 2 for me and love it!",
          "score": 4,
          "created_utc": 1750336268.0,
          "replies": [
            {
              "id": "mymwqw9",
              "author": "Bdr1983",
              "body": "Isn't Garmin doing the same shit?\n\nEdit: here it is \nhttps://www.reddit.com/r/Garmin/s/g4cllTNOuM",
              "score": 14,
              "created_utc": 1750342826.0,
              "replies": [
                {
                  "id": "mymx3nr",
                  "author": "5WattBulb",
                  "body": "I haven't heard that yet, but anything is possible certainly. Id hate to abandon that brand if they do something like this but im not paying a subscription for it.",
                  "score": 3,
                  "created_utc": 1750342931.0,
                  "replies": []
                },
                {
                  "id": "mymyrh8",
                  "author": "bugmush",
                  "body": "I remember hearing that, too, but not sure.\n\nEverything's going to a subscription model it seems 😞",
                  "score": 2,
                  "created_utc": 1750343425.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mymg4le",
          "author": "Twitch84",
          "body": "I used the cheap Xiaomi mi bands for years. The battery life was amazing and step counter seemed more accurate than my current Galaxy watch 6.\nCurrently happy with the GW6 though. Pretty sure Samsung is already harvesting health data. I'll be mad if they start pay-walling features.",
          "score": 3,
          "created_utc": 1750337342.0,
          "replies": []
        },
        {
          "id": "mym4fuu",
          "author": "CorrodedLollypop",
          "body": "GTS2e owner here, absolutely faultless performance and battery life.",
          "score": 4,
          "created_utc": 1750332731.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myn2loy",
      "author": "MusicalScientist206",
      "body": "Get a G Shock and be done with it all.",
      "score": 6,
      "created_utc": 1750344555.0,
      "replies": [
        {
          "id": "myoiynp",
          "author": "dupz88",
          "body": "This needs to be higher. If you have a small wrist, get one of the GA2100 versions, many colours to choose from, and no need to charge anymore. \n\nI still have my galaxy active 1 which I take to the gym when I remember, but the battery is crap so it sucks as a watch. Not really missing anything when I forget the smartwatch",
          "score": 2,
          "created_utc": 1750360290.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mynbzr9",
      "author": "OK_TimeForPlan_L",
      "body": "Line must go up!\n\nI genuinely don't see what 'new' features they could possibly think would be worth a subscription fee, do they think we're all stupid? \n\nAs soon as Samsung health gets features paywalled my watch is getting sold.",
      "score": 3,
      "created_utc": 1750347289.0,
      "replies": []
    },
    {
      "id": "myni1s0",
      "author": "igotabridgetosell",
      "body": "got galaxy 7 watch, the health monitoring is kind of a joke anyways.  Like I just start walking without turning on activity, my heart bpm sits at 80s for like first half of the walk, i start walking with activity on bpm jumps to 100s soon after start, ok buddy.\n\nall i am really using it for is to trigger my smart home to turn off if I fall asleep on the couch anyways.  and home assistant voice on my wrist.\n\nI thought i can open my door w my watch to act as nfc card, can't do that in the USA.",
      "score": 3,
      "created_utc": 1750349031.0,
      "replies": []
    },
    {
      "id": "mynjior",
      "author": "S-192",
      "body": "So their product is no longer worth it.",
      "score": 3,
      "created_utc": 1750349463.0,
      "replies": []
    },
    {
      "id": "mypmglk",
      "author": "Verilance",
      "body": "Samsung health has been shit for years. It went from a feature I used every day to one I barely touch.",
      "score": 3,
      "created_utc": 1750372146.0,
      "replies": []
    },
    {
      "id": "mysgyiu",
      "author": "lantz83",
      "body": "I'll just put my money behind a feature-wall. No feature no money.",
      "score": 3,
      "created_utc": 1750416921.0,
      "replies": []
    },
    {
      "id": "mz19200",
      "author": "niksunorz66",
      "body": "I could soon stop buying Samsung products. I mean, it's their choice.",
      "score": 3,
      "created_utc": 1750534080.0,
      "replies": []
    },
    {
      "id": "mymab8o",
      "author": "cjax2",
      "body": "Most the shit on the Galaxy Watch Ultra works half the time, they want us to pay for more features that work half the time too.",
      "score": 8,
      "created_utc": 1750335157.0,
      "replies": []
    },
    {
      "id": "mynqcay",
      "author": "Ghouly_Girl",
      "body": "What’s the fucking point of buying the watch then? What is with constant subscriptions?",
      "score": 5,
      "created_utc": 1750351452.0,
      "replies": [
        {
          "id": "mynw7y7",
          "author": "green_link",
          "body": "Constant subscriptions means constant flow of money coming in which means higher profits year after year",
          "score": 3,
          "created_utc": 1750353165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mymvwr5",
      "author": "None",
      "body": "Wow, I guess I’ll be going back to casio. No sweat",
      "score": 2,
      "created_utc": 1750342578.0,
      "replies": []
    },
    {
      "id": "myoq88g",
      "author": "RareGoomba",
      "body": "I've wanted a smart watch to track my runs with. But I just assume every brand will lock everything behind paywalls and enshitification, so I'm never going to buy one",
      "score": 2,
      "created_utc": 1750362459.0,
      "replies": []
    },
    {
      "id": "mypz0uu",
      "author": "fsfaith",
      "body": "I was considering upgrading to the next galaxy watch. I guess I'll shop elsewhere then. Anyone got any solid suggestions?",
      "score": 2,
      "created_utc": 1750376369.0,
      "replies": [
        {
          "id": "myr3k3k",
          "author": "None",
          "body": "I really like my Apple Watch. I have a family member that switched and loves it.",
          "score": 2,
          "created_utc": 1750390999.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myqe08x",
      "author": "Logical-Associate729",
      "body": "Came here to say how much I like my Garmin Fenix 5. I've had it since 2017. It still works great, meets all my needs, and all its functionality is free.",
      "score": 2,
      "created_utc": 1750381676.0,
      "replies": []
    },
    {
      "id": "myr212j",
      "author": "OutlyingPlasma",
      "body": "Good news: The greatest smartwatch ever made just made a comeback. The pebble has two new versions from the original designer.",
      "score": 2,
      "created_utc": 1750390369.0,
      "replies": []
    },
    {
      "id": "myrx9br",
      "author": "Wazza17",
      "body": "They should remember “don’t bite the hand that feeds”",
      "score": 2,
      "created_utc": 1750405860.0,
      "replies": []
    },
    {
      "id": "myrxg8y",
      "author": "Wilza_",
      "body": "I had a 5 Pro, recently switched to OnePlus Watch 3, this makes me feel even more justified in that decision. Many great watch options out there, don't support companies that pull this kind of shit",
      "score": 2,
      "created_utc": 1750405975.0,
      "replies": []
    },
    {
      "id": "mys7atn",
      "author": "xdxAngeloxbx",
      "body": "Not gonna pay this just like I will not pay for Galaxy AI.",
      "score": 2,
      "created_utc": 1750411766.0,
      "replies": []
    },
    {
      "id": "mysh13g",
      "author": "None",
      "body": "Man everything is shit now. Just a race to the bottom",
      "score": 2,
      "created_utc": 1750416955.0,
      "replies": []
    },
    {
      "id": "mysjwl2",
      "author": "FidgetyFondler",
      "body": "Only a matter of time before you'll be charged for looking at the time.",
      "score": 2,
      "created_utc": 1750418287.0,
      "replies": []
    },
    {
      "id": "mz0vhbp",
      "author": "Flimsy_wimsey",
      "body": "Smells like class action lawsuit",
      "score": 2,
      "created_utc": 1750529634.0,
      "replies": []
    },
    {
      "id": "myn46j1",
      "author": "timelessblur",
      "body": "And to me this is a big reason I have completely abandon Samsung across the board. \n\nI refuse to buy a Samsung TV, or Samsung Appliances. Never mind that the general reports are anything but Samsung. \n\nI recently bought a new washer and dryer and ask my brother who researches the crap out of this stuff and his answer was not Samsung. LG is great but f Samsung. Now I got a sweet deal from Costco on my LGs.",
      "score": 2,
      "created_utc": 1750345016.0,
      "replies": []
    },
    {
      "id": "mymjbef",
      "author": "xilcilus",
      "body": "If there are some noteworthy health tracking features, sure (for example continuous glucose monitoring).",
      "score": 2,
      "created_utc": 1750338458.0,
      "replies": [
        {
          "id": "myqkj4n",
          "author": "I_Automate",
          "body": "There is still no reason for that to be a subscription service. A physical sensor has no need for an ongoing subscription.\n\nYou already paid for the hardware when you bought the device. End of story.\n\nStop normalizing and justifying shit like this",
          "score": 3,
          "created_utc": 1750383968.0,
          "replies": [
            {
              "id": "myqmf1f",
              "author": "xilcilus",
              "body": "Hey champ, have you considered not buying things you don't like?",
              "score": -5,
              "created_utc": 1750384619.0,
              "replies": [
                {
                  "id": "myqo1ji",
                  "author": "I_Automate",
                  "body": "Hey champ, have you considered not normalizing consumer abuse?\n\nEnough people buying into this makes it the norm for *everyone*.\n\nRemember when you could use email without having ads thrown at you? Remember when a *paid subscription* meant no ads, instead of just *less ads*?\n\nRemember when buying a watch meant you could just....use the watch?",
                  "score": 9,
                  "created_utc": 1750385192.0,
                  "replies": [
                    {
                      "id": "myqshg2",
                      "author": "xilcilus",
                      "body": "I mean, you can still use email without having ads if you pay - which has always been the case. If you don't like Gmail, use Proton Mail.\n\nI can still buy watches to use just the watch - in fact, the analog watch business has never been this robust.\n\nYou gotta wake up and realize that you don't have to be a victim - that you actually have agency in the world based on your decisions rather than jerked around what subscription services that these big companies provide. Opting out is an option despite what you may think.",
                      "score": -5,
                      "created_utc": 1750386763.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mymnvo3",
      "author": "Snooklefloop",
      "body": "It’s Samsung, I’m surprised you don’t get ads when trying to tell time.",
      "score": 2,
      "created_utc": 1750340001.0,
      "replies": []
    },
    {
      "id": "myn8k5c",
      "author": "HariSeldon-Lives",
      "body": "Please deposit 10 cents for the correct time...",
      "score": 2,
      "created_utc": 1750346291.0,
      "replies": []
    },
    {
      "id": "mymld8r",
      "author": "SaiyanRajat",
      "body": "But buying their hardware is supposed to be the solution for that paywall?",
      "score": 1,
      "created_utc": 1750339155.0,
      "replies": []
    },
    {
      "id": "mympxze",
      "author": "spankdaddylizz",
      "body": "Well, imagine that.",
      "score": 1,
      "created_utc": 1750340695.0,
      "replies": []
    },
    {
      "id": "mymuf29",
      "author": "cheesyvoetjes",
      "body": "I bought one a couple of months ago specifically for Samsung Health and fitness stuff. What else is it for? 500 bucks to see notifications on your wrist? If they do this I will never buy a watch again and they'll lose me as a phone customer as well.",
      "score": 1,
      "created_utc": 1750342129.0,
      "replies": []
    },
    {
      "id": "mynbheb",
      "author": "TechnicallyLiterate",
      "body": "Oh look a mostly open source operating system.. lets fuck it up and add unnecessary shit so people hate it.",
      "score": 1,
      "created_utc": 1750347141.0,
      "replies": []
    },
    {
      "id": "mynwwtk",
      "author": "Hollywood-is-DOA",
      "body": "When I heard that that new printers now need a month subscription to use them, I mentally and philosophically checked out.",
      "score": 1,
      "created_utc": 1750353368.0,
      "replies": []
    },
    {
      "id": "myo81i2",
      "author": "timeandmemory",
      "body": "Welp, guess I'm donating this future paper weight. Happy tails samsung.",
      "score": 1,
      "created_utc": 1750356734.0,
      "replies": []
    },
    {
      "id": "mypn860",
      "author": "VeryBigPaws",
      "body": "0",
      "score": 1,
      "created_utc": 1750372401.0,
      "replies": []
    },
    {
      "id": "mypqu6b",
      "author": "CrapoCrapo25",
      "body": "Goodbye",
      "score": 1,
      "created_utc": 1750373623.0,
      "replies": []
    },
    {
      "id": "myresax",
      "author": "lew_rong",
      "body": "Pebble it is, as soon as the revival gets nailed down.",
      "score": 1,
      "created_utc": 1750395978.0,
      "replies": []
    },
    {
      "id": "myrg9ku",
      "author": "psq322",
      "body": "Hahahahahahah",
      "score": 1,
      "created_utc": 1750396685.0,
      "replies": []
    },
    {
      "id": "mysd9vz",
      "author": "basedlmly",
      "body": "Ah, the subscription apocalypse spreads to watches now? I mean, locking basic health features behind *another* monthly fee feels like a slap in the face. Like \"Your watch has detected... a subscription required to view this heart rhythm\" Hard pass.",
      "score": 1,
      "created_utc": 1750415066.0,
      "replies": []
    },
    {
      "id": "mysdq8m",
      "author": "ReefJR65",
      "body": "If I pay to have something, and I have to keep paying to have it, I do all that I can to get rid of it then.",
      "score": 1,
      "created_utc": 1750415306.0,
      "replies": []
    },
    {
      "id": "myn46gz",
      "author": "SOUND_NERD_01",
      "body": "Samsung. All the downsides of Apple products, without any of the upsides. I bailed on Samsung around Galaxy s10 for iPhone, and haven’t regretted it once.",
      "score": -1,
      "created_utc": 1750345016.0,
      "replies": [
        {
          "id": "myogqhp",
          "author": "None",
          "body": "Thinking of ditching my Samsung for an iPhone this fall. I'm moving away from anything Samsung. Never buying another Samsung product if I can help it again.",
          "score": 1,
          "created_utc": 1750359554.0,
          "replies": [
            {
              "id": "myol7zk",
              "author": "SOUND_NERD_01",
              "body": "I’m in the same boat. I’m not sure if I got lucky, or if Samsung quality has actually gone down. Back in the early 2000s I had a ton of Samsung stuff and it was great. Then in the 2010s I had a string of bad products. \n\nDefective Samsung products I’ve owned: fridge, stove, dishwasher, computer monitor, TV, note 7, Blu-ray player. \n\nNever again will I buy a Samsung product.",
              "score": 3,
              "created_utc": 1750360972.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mymr8v3",
      "author": "Ghozer",
      "body": "And here I bought a £12 watch from Temu that does pretty much everything this does (time, notifications, heart rate, health/sports tracking etc, weather) and battery is lasting a week easily.... not like, 2 days at best!!!",
      "score": 1,
      "created_utc": 1750341121.0,
      "replies": []
    },
    {
      "id": "myn2ku7",
      "author": "sonicsludge",
      "body": "I hate the tan line anyway.",
      "score": 1,
      "created_utc": 1750344548.0,
      "replies": []
    },
    {
      "id": "myn309m",
      "author": "Hindu_Wardrobe",
      "body": "paywalling health features would literally make me jump off the Samsung ship after over ten years of sticking with their flagships lol. they can fuck all the way off with that",
      "score": 1,
      "created_utc": 1750344673.0,
      "replies": []
    },
    {
      "id": "myn8d0n",
      "author": "Cattleist",
      "body": "Bro the watch barely does what it's supposed to correctly. These mfers are bugging.",
      "score": 1,
      "created_utc": 1750346232.0,
      "replies": []
    },
    {
      "id": "mynug8j",
      "author": "Goosexi6566",
      "body": "As a person who likes tech and watches, I have the Apple Watch Ultra. If they bricked or paywalled any content that come standard with the watch currently I would switch back to analog watches. For what I spent on this thing I could get a decent brand watch that will last a lifetime.",
      "score": 1,
      "created_utc": 1750352643.0,
      "replies": []
    },
    {
      "id": "mys8tbh",
      "author": "ojhatsman",
      "body": "Does paying for the watch not also count as a pay wall?",
      "score": 1,
      "created_utc": 1750412640.0,
      "replies": []
    },
    {
      "id": "mym5m1n",
      "author": "kat1795",
      "body": "We already know Samsung company is trash, the only things that were ok are their top phones but even now they are crap!!",
      "score": -2,
      "created_utc": 1750333238.0,
      "replies": []
    },
    {
      "id": "mymbbg7",
      "author": "SanboCat",
      "body": "Does that include battery power that lasts longer than 10 miles?",
      "score": 0,
      "created_utc": 1750335547.0,
      "replies": []
    },
    {
      "id": "mymo94w",
      "author": "DotkasFlughoernchen",
      "body": "All Galaxy Watch features are already behind a paywall. At least last I checked they didn't give the watches away for free.",
      "score": 0,
      "created_utc": 1750340128.0,
      "replies": []
    },
    {
      "id": "mynen5e",
      "author": "Nyoka_ya_Mpembe",
      "body": "Another reason to stay with Garmin.",
      "score": 0,
      "created_utc": 1750348047.0,
      "replies": [
        {
          "id": "mynj9we",
          "author": "diacewrb",
          "body": "Garmin have already launched their own subscription service called connect+ earlier this year.\n\nWouldn't be surprised if samsung are copying the idea since they immediately backtrack after customers complained.",
          "score": 10,
          "created_utc": 1750349392.0,
          "replies": [
            {
              "id": "mypwyqo",
              "author": "Nyoka_ya_Mpembe",
              "body": "Connect+ is totally optional and you don't get the feeling that they take something behind paywall, everything I had, is still there.",
              "score": 1,
              "created_utc": 1750375676.0,
              "replies": [
                {
                  "id": "myq1wqk",
                  "author": "DousaSepen",
                  "body": "The problem with Garmin is you pay the premium so that a subscription didn’t exist they’re now double dipping connect + pushed me to a different brand",
                  "score": 2,
                  "created_utc": 1750377354.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "myn2r0f",
      "author": "mrFish852",
      "body": "![gif](giphy|cPfbGOr812eRdvdsIV)",
      "score": 0,
      "created_utc": 1750344598.0,
      "replies": []
    },
    {
      "id": "mynswzj",
      "author": "Minionz",
      "body": "Sure locking features behind a pay wall will increase watch sales! /s",
      "score": 0,
      "created_utc": 1750352191.0,
      "replies": []
    },
    {
      "id": "myoj0rc",
      "author": "Eveningroovers",
      "body": "Premium is the new standard.",
      "score": 0,
      "created_utc": 1750360308.0,
      "replies": []
    },
    {
      "id": "mym6wu1",
      "author": "None",
      "body": "[deleted]",
      "score": -7,
      "created_utc": 1750333787.0,
      "replies": []
    },
    {
      "id": "mymezwa",
      "author": "Porcel2019",
      "body": "No duh. Theyve tried before and it didnt work",
      "score": -1,
      "created_utc": 1750336933.0,
      "replies": []
    },
    {
      "id": "myrrqsr",
      "author": "vpsj",
      "body": "I just want a watch that is not circular.\n\nWhy is it so hard to find on WearOS? Normally Android copies almost everything Apple does, but not even a single square watch? \n\nEven the Samsung Ultra just has square bezels over a round dial.",
      "score": -1,
      "created_utc": 1750402690.0,
      "replies": []
    },
    {
      "id": "myq6aox",
      "author": "None",
      "body": "[removed]",
      "score": -6,
      "created_utc": 1750378913.0,
      "replies": [
        {
          "id": "myr3g0i",
          "author": "None",
          "body": "Maybe get out more.",
          "score": 3,
          "created_utc": 1750390951.0,
          "replies": [
            {
              "id": "myr919y",
              "author": "TEMPORARYPERSONS413",
              "body": "Username checks out.",
              "score": -2,
              "created_utc": 1750393334.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "myqxt3k",
      "author": "Off-Da-Ricta",
      "body": "Imagine being fucking stupid enough to pay to wear a watch.\n\nWatches aren’t even necessary for 99 percent of people and no one under 25 can read them anyway",
      "score": -6,
      "created_utc": 1750388719.0,
      "replies": [
        {
          "id": "myr3dv3",
          "author": "None",
          "body": "In my opinion a lot of people wear the for health features.",
          "score": 2,
          "created_utc": 1750390926.0,
          "replies": []
        }
      ]
    }
  ]
}