{
  "post": {
    "title": "Sony’s new RGB backlight tech absolutely smokes regular Mini LED TVs | The backlight tech is just a concept for now, but it could lead to more detailed displays without the drawbacks of OLED.",
    "author": "chrisdh79",
    "id": "1jb1iwx",
    "score": 715,
    "created_utc": 1741951126.0,
    "selftext": "",
    "num_comments": 219,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jb1iwx/sonys_new_rgb_backlight_tech_absolutely_smokes/"
  },
  "comments": [
    {
      "id": "mhqk0h6",
      "author": "jeffram",
      "body": "These aren’t rumours, Sony flew journalists to Japan to show them the tech, said production would start later in the year and launch in 2026 starting with 75 and 85 inch TVs.\n\nAll the journalist came back very impressed.",
      "score": 280,
      "created_utc": 1741955611.0,
      "replies": [
        {
          "id": "mhrfpvb",
          "author": "Freodrick",
          "body": "I just want a 55 tho 😔",
          "score": 83,
          "created_utc": 1741965891.0,
          "replies": [
            {
              "id": "mhrscm4",
              "author": "VitalTrouble",
              "body": "Granted, the tv is now **55 inches tall** and 97 inches wide  \n  \nEnjoy that ≈ 110 inch tv",
              "score": 68,
              "created_utc": 1741969538.0,
              "replies": [
                {
                  "id": "mhs65s6",
                  "author": "Endarial",
                  "body": "I'll hold out for Frank's 2000\" TV.",
                  "score": 20,
                  "created_utc": 1741973487.0,
                  "replies": [
                    {
                      "id": "mhsdr7d",
                      "author": "BipedalWurm",
                      "body": "The Magnum",
                      "score": 11,
                      "created_utc": 1741975743.0,
                      "replies": []
                    },
                    {
                      "id": "mhuw11r",
                      "author": "generalemory",
                      "body": "“Robert Deniro’s mole has gotte be 10’ feet wide”",
                      "score": 2,
                      "created_utc": 1742004771.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mhrwg8o",
                  "author": "Freodrick",
                  "body": "Oh, you got me with your legal mumbo jumbo.",
                  "score": 7,
                  "created_utc": 1741970717.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhrhiyv",
              "author": "Ninjamuh",
              "body": "No!",
              "score": 11,
              "created_utc": 1741966416.0,
              "replies": []
            },
            {
              "id": "mhrlrie",
              "author": "Hellguin",
              "body": "Give it like +3-5 years",
              "score": 3,
              "created_utc": 1741967637.0,
              "replies": []
            },
            {
              "id": "mhs6stz",
              "author": "JohnSpikeKelly",
              "body": "I now watch everything on 120\" projector screen. 55\" would seem so limiting.",
              "score": 4,
              "created_utc": 1741973671.0,
              "replies": [
                {
                  "id": "mhtsho3",
                  "author": "CatProgrammer",
                  "body": "Projectors are great but OLED-style contrast levels can't be beat.",
                  "score": 6,
                  "created_utc": 1741991148.0,
                  "replies": [
                    {
                      "id": "mhug5cf",
                      "author": "JohnSpikeKelly",
                      "body": "Absolutely. Would probably swap for a decent 90\" OLED, but the price is so prohibitive atm. My projector was $600 and the screen was $110. Yes it's only 1080p, but very nice to watch.",
                      "score": 3,
                      "created_utc": 1741999106.0,
                      "replies": [
                        {
                          "id": "mhzz7we",
                          "author": "Blue-Summers",
                          "body": "I have an old, cheap as shit projector from about 13 years ago with a whopping resolution of 800x600 and I freaking love that thing. It would be nice if it was brighter but other than that, I don't see any reason to upgrade.",
                          "score": 2,
                          "created_utc": 1742079734.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhtbwz0",
                  "author": "NorCalAthlete",
                  "body": "Ultra short throw laser projectors are starting to proliferate. I wouldn’t mind switching to one if they come down in price some more.",
                  "score": 4,
                  "created_utc": 1741986090.0,
                  "replies": [
                    {
                      "id": "mhufs91",
                      "author": "JohnSpikeKelly",
                      "body": "Me too. I'm curious how they handle a not perfect projector screen. My screen was $110 but works great with the long throw. But with such an acute angle I wonder.",
                      "score": 2,
                      "created_utc": 1741998981.0,
                      "replies": [
                        {
                          "id": "mhui0x9",
                          "author": "NorCalAthlete",
                          "body": "I was just going to use the living room wall at first and see how that works out. My living room doesn’t get much natural light anyway.",
                          "score": 1,
                          "created_utc": 1741999753.0,
                          "replies": [
                            {
                              "id": "mhulyqx",
                              "author": "JohnSpikeKelly",
                              "body": "Might be worth getting some of that super reflective white paint. Walls are at least nice and flat.",
                              "score": 2,
                              "created_utc": 1742001146.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhvfpt0",
                      "author": "IGingerbreadman",
                      "body": "Have had one for 6 years, even great in moderate to low light but just doesn’t compare to an actual screen, ready for a mini led 100” this year.",
                      "score": 2,
                      "created_utc": 1742012955.0,
                      "replies": [
                        {
                          "id": "mhvgox2",
                          "author": "NorCalAthlete",
                          "body": "What model / specs? What are the biggest differences that you think don’t measure up to actual screens? What do you mainly use it for?\n\nI’d love to have something where I can hook up my PC and couch game, do work, and watch TV / movies all in one, but I know that’s kind of like asking for a unicorn and there’s always tradeoffs.",
                          "score": 1,
                          "created_utc": 1742013432.0,
                          "replies": [
                            {
                              "id": "mhvhlin",
                              "author": "IGingerbreadman",
                              "body": "It’s a Dell S718QL Projector. Got it second hand for 3.5K. It’s been a blast. The only thing I wish for is being better in lots of light. New home has tons. Also it’s great that you can just place it on an entertainment center and don’t have to mount it, but it also always there and in the way sort of speaking. The screen is what makes it amazing. The cancelling of light from above and the sides. It only throws back the image from the projector. It’s a giant matte screen. I may miss that. May hate glares once I move on to just a tv. Don’t game too much but I’m sure you can find reviews measuring lag. This particular unit is super bright. The fan kicking on won’t be missed. It’s the screen that makes it theatre like. Would recommend under low light to no light. A normal projector only in no light.  The other thing is that ust aren’t getting vastly better. This is a 4k unit and it is amazing, I don’t think the processors on these have been getting better as quickly. Some 4k units are only up scaling 1080p somehow. These need to get smaller and quieter to keep warranting a purchase. TVs will eat up the xxl market soon.",
                              "score": 2,
                              "created_utc": 1742013879.0,
                              "replies": [
                                {
                                  "id": "mhvi6p0",
                                  "author": "NorCalAthlete",
                                  "body": "I had a 1080p projector back in the day and yeah the fan was super annoying if there was a quiet scene in a movie or something. I wonder if you could mitigate that somehow. Additional cooling system or something, or build a case for it that exhausts into a wiring closet / attic…and relocate the fan to like a heat pump fan that pulls way more CFM.",
                                  "score": 1,
                                  "created_utc": 1742014172.0,
                                  "replies": [
                                    {
                                      "id": "mhvjrdj",
                                      "author": "IGingerbreadman",
                                      "body": "What I used to do to pcs is put bigger fans that were quieter. Even if they weren’t variable, they’d run cooler at any given time. Can add ducting haha. It’s not bad at all in eco mode this one. Only spins up with hdr where it uses max brightness.",
                                      "score": 2,
                                      "created_utc": 1742014976.0,
                                      "replies": [
                                        {
                                          "id": "mhvl4yq",
                                          "author": "NorCalAthlete",
                                          "body": "I was thinking step 1 is swap out the (usually shitty and cheap) internal fan for a noctua or something, then splice in an additional larger fan. Ducting optional after that. But also even just giving the whole thing some dense rubber padding around the top of the entertainment center might help. Sound deadening.",
                                          "score": 1,
                                          "created_utc": 1742015698.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhsb0te",
                  "author": "Freodrick",
                  "body": "I just feel comfortable with 55 in the space i use it in. It works well, so it's the size I like to view things by myself or as a group. Idk, I just really don't see a reason for anything larger than 65 for home use (maybe cause my home is limited in space)",
                  "score": 6,
                  "created_utc": 1741974877.0,
                  "replies": [
                    {
                      "id": "mhulqh1",
                      "author": "OldOutlandishness434",
                      "body": "It really deoends on the size and setup of your home. I wanted a 75 or bigger, my wife wanted to stay with a 55, so we compromised and got a 65. A few months later she says oh yeah, I guess we could have gotten a bigger one 🤬",
                      "score": 3,
                      "created_utc": 1742001064.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mu3jsy7",
              "author": "WATTO68",
              "body": "Same lol",
              "score": 1,
              "created_utc": 1748134462.0,
              "replies": []
            },
            {
              "id": "mwbct78",
              "author": "WATTO68",
              "body": "Same bro. They dont realise not all of us want a cinema",
              "score": 1,
              "created_utc": 1749217297.0,
              "replies": [
                {
                  "id": "mwn0ihs",
                  "author": "Freodrick",
                  "body": "I mean, I'd like one in my life if possible.. Lol. But given my current location? 55 is fine.",
                  "score": 1,
                  "created_utc": 1749381383.0,
                  "replies": [
                    {
                      "id": "mwpfgw1",
                      "author": "WATTO68",
                      "body": "Same",
                      "score": 1,
                      "created_utc": 1749410542.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mhtxgcp",
          "author": "TeutonJon78",
          "body": "And HiSense is launching models this year with the same tech.\n\nSony has just been working really hard to on the processing aspect and not caring if they ship first.\n\nI just really wish QDEL or microLED would get commercialized for normal people. RBG miniLED is still just a stopgap.",
          "score": 10,
          "created_utc": 1741992801.0,
          "replies": []
        },
        {
          "id": "mhs3wam",
          "author": "VikingBorealis",
          "body": "So y had a a rgb back it lcd several years ago though bcmfore they abandoned them because they were to expensive.",
          "score": -10,
          "created_utc": 1741972843.0,
          "replies": [
            {
              "id": "mhsr4j0",
              "author": "Noxious89123",
              "body": "Did you have a stroke?",
              "score": 13,
              "created_utc": 1741979924.0,
              "replies": [
                {
                  "id": "mhssqbg",
                  "author": "FoodExisting8405",
                  "body": "I think I can translate:\n\nSony had an rgb-backlit lcd several years ago, before they abandoned them because they were too expensive.",
                  "score": 7,
                  "created_utc": 1741980402.0,
                  "replies": [
                    {
                      "id": "mht6srr",
                      "author": "edvek",
                      "body": "I don't follow any of this tech but if that's true maybe they figured out the costs. I'm sure it will be expensive but maybe inline with what you would expect? Plus if this goes forward it might drive OLED prices down to get people to buy that.",
                      "score": 1,
                      "created_utc": 1741984573.0,
                      "replies": [
                        {
                          "id": "mhtnjw6",
                          "author": "FoodExisting8405",
                          "body": "I'm still not sure I understand the concept, tbh. Cuz, like imagine a Lisa frank image: You'd need the backlight resolution to be on par with the LCD, itself. At that point just use OLED.",
                          "score": 1,
                          "created_utc": 1741989540.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhqgdag",
      "author": "VampyreLust",
      "body": "\"Could be\" sooo OLED is still the go to then. \n\nI remember bout 5 years ago now when I was buying a tv everyone was convinced that OLED was going to be usurped by MicroLED panels the next year, telling people to hold off of OLED and they weren't going to be crazy expensive etc. Yah still waiting for that to happen.",
      "score": 109,
      "created_utc": 1741954153.0,
      "replies": [
        {
          "id": "mhrqmfd",
          "author": "LurkerPatrol",
          "body": "Yeah I bought an OLED TV when it was on a deep sale at Best Buy and have never looked back. Everything looks so good on it from YouTube to full fledged HDR and Dolby vision movies and TV shows. It’s unmatched",
          "score": 41,
          "created_utc": 1741969039.0,
          "replies": [
            {
              "id": "mhrw62m",
              "author": "Noversi",
              "body": "I bought the LG C2 as my computer monitor and it is incredible. My living room tv looks awful now in comparison. I will never go back to led/lcd.",
              "score": 16,
              "created_utc": 1741970635.0,
              "replies": [
                {
                  "id": "mhrxm8z",
                  "author": "VampyreLust",
                  "body": "It is definitely one of those technologies that ruins you against other tech technologies. I bought a C8 for my home theatre about five years ago and I can never go back. I do however still use an IPS display for my desktop because although I tested OLED and QDOLED displays, I just couldn't get past the text phasing.",
                  "score": 9,
                  "created_utc": 1741971049.0,
                  "replies": [
                    {
                      "id": "mhsavq7",
                      "author": "er-day",
                      "body": "I just upgraded my parents from a C8 to a C3 and the difference is pretty stunning. Modern oleds have come a long way as well. (Their old oled however had some seriously bad burn in).",
                      "score": 5,
                      "created_utc": 1741974835.0,
                      "replies": [
                        {
                          "id": "mhsjl3w",
                          "author": "VampyreLust",
                          "body": "That's interesting because mine has no burn-in whatsoever. I fully expected it to happen when I bought it and spent the money anyways but none. I guess it heavily depends on how you watch it, I use it for streaming, no cable tv so very few logos like CNN and such.",
                          "score": 1,
                          "created_utc": 1741977670.0,
                          "replies": [
                            {
                              "id": "mhyqxm6",
                              "author": "er-day",
                              "body": "Yeah it was the long hours of logo tv. They loved the today show every morning and the music channel at night with strong bars of color that didn’t move. Mix up what you watch and it likely won’t be a problem",
                              "score": 2,
                              "created_utc": 1742065083.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhyrnjt",
                  "author": "astro_plane",
                  "body": "Did the same as you, now I regret not buying a 65 inch C2.",
                  "score": 1,
                  "created_utc": 1742065310.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhsg9ym",
              "author": "North_South_Side",
              "body": "Had ours for 2 years now. No symptoms of burn in or anything else. Best looking tv we’ve ever seen. We maxed out our space with a 65 inch but in our dedicated tv room it is spectacular. \n\nI’m not ruling out that it will not be surpassed by some new technology eventually. But half of what we stream is lower than 4k and I just don’t see widespread adoption of 8k anytime soon.",
              "score": 3,
              "created_utc": 1741976636.0,
              "replies": []
            },
            {
              "id": "mhvssd7",
              "author": "GrayDaysGoAway",
              "body": "It's unmatched in ideal conditions. Too much light and an OLED is no longer so great. I just recently moved my Sony A90K out of my living room and replaced it with a mini LED because I got tired of the constant glare from the windows.",
              "score": 1,
              "created_utc": 1742019967.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhqoia3",
          "author": "Heightren",
          "body": "It just sounds like OLED with extra steps",
          "score": 12,
          "created_utc": 1741957280.0,
          "replies": [
            {
              "id": "mhqwpmc",
              "author": "VampyreLust",
              "body": "Its not. because its the best of both worlds, infinite contrast like OLED but also 5000 nits of brightness like an LCD, its the same tech they use for outdoor displays in places like Times Square but in a much much smaller form factor so each pixel is its own, very small LED as I understand it.\n\nShows like [The Mandelorian are filmed](https://youtu.be/gUnxzVOs3rk?si=il7v839uP7mTUv_P&t=55) on a sound stage with a huge curved one instead of greenscreen because its just that lifelike and they're modular so they're easily fixed [like this](https://youtube.com/shorts/bKqs942-OO8?si=Bxv86tII9wIilNGZ). Buuuut the last time I saw a price was at CES in Feb and it was a 75\" one for around $90k so realistically we're still years away from those being in homes, if they actually ever are.",
              "score": 48,
              "created_utc": 1741960109.0,
              "replies": [
                {
                  "id": "mhr0b55",
                  "author": "iouli",
                  "body": "By the time this technology will become mainstream, OLEDs will surpass 95% of every cinephile's needs. Heck, this year alone OLEDs have reached 2500 nits in peak brightness. Every year the OLED technology is evolving, so I expect in 5 year's time to be significantly cheaper than Sony's new tech and with no obvious drawbacks.",
                  "score": -2,
                  "created_utc": 1741961267.0,
                  "replies": [
                    {
                      "id": "mhr0lm6",
                      "author": "WFlumin8",
                      "body": "OLED is expensive to produce and it will continue to be expensive to produce because of the nature of its manufacturing. MicroLED WILL replace OLED as it advances because it has none of the drawbacks (burn in, manufacturing cost, low brightness) and all of its advantages.",
                      "score": 35,
                      "created_utc": 1741961358.0,
                      "replies": [
                        {
                          "id": "mhrlhbv",
                          "author": "VampyreLust",
                          "body": "MicroLED is much more expensive to produce than OLED, each LED pixel has to be placed by robots individually which is what the current and past high cost of them has been from. Just like 5 years ago there were people convinced that MicroLED would replace OLED but I don't know, they haven't yet and technologies that reduce burn-in have gotten a lot better. It's mainly the brightness and the degradation of the organic matter in OLEDs that MicroLED solves but if they can't reduce the manufacturing cost by over 90% it will never compete.",
                          "score": 11,
                          "created_utc": 1741967556.0,
                          "replies": [
                            {
                              "id": "mhucaa2",
                              "author": "hope_it_helps",
                              "body": "I recently read up on porotech and what they seem to have achieved with microLED sounds like we're about to stop having to place pixels via robots. \n\nAlthough they don't seem to be targeting the monitor and TV market but rather micro displays and such.",
                              "score": 1,
                              "created_utc": 1741997783.0,
                              "replies": []
                            },
                            {
                              "id": "mhrn36a",
                              "author": "ElectronicMoo",
                              "body": "Organic matter?\n\nOled doesn't also need robots placing led individually?\n\nNot facetious - actual questions, I know nothing of the latest formats.  I buy cheap roku enabled tvs in 4k and not a cinephile that notices the specifics.",
                              "score": -1,
                              "created_utc": 1741968014.0,
                              "replies": [
                                {
                                  "id": "mhrp3zj",
                                  "author": "Powerful-Parsnip",
                                  "body": "Organic is what the O stands for.",
                                  "score": 19,
                                  "created_utc": 1741968602.0,
                                  "replies": []
                                },
                                {
                                  "id": "mhrsjp9",
                                  "author": "VampyreLust",
                                  "body": "No, they actually print them onto the substrate in a similar way to how inkjet printers work so it can be done quickly and cheaply vs a robot placing each individual led. And as the person below or above me said, the \"O\" in OLED is Organic. Organic polymers are used in several if the layers that make up each OLED pixel.",
                                  "score": 16,
                                  "created_utc": 1741969595.0,
                                  "replies": [
                                    {
                                      "id": "mhtpuqp",
                                      "author": "ElectronicMoo",
                                      "body": "Interesting.  I'll do some reading this weekend.  Thanks for the cliff notes.",
                                      "score": 2,
                                      "created_utc": 1741990289.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhtjn6n",
                      "author": "HaMMeReD",
                      "body": "I don't think I'll ever be convinced that OLED has the lifespan of a LCD.\n\nI expect that everyone who buys a OLED today, will have some level of burn in or non-uniformity in their display in 5 years.\n\nBut I guess if you plan on replacing your screen every 3-5 years, OLED is great.",
                      "score": 4,
                      "created_utc": 1741988301.0,
                      "replies": [
                        {
                          "id": "mhtstol",
                          "author": "CatProgrammer",
                          "body": "Depends entirely on usage habits, panel settings, and what content you display.",
                          "score": 2,
                          "created_utc": 1741991259.0,
                          "replies": [
                            {
                              "id": "mi1frdx",
                              "author": "orangpelupa",
                              "body": "Uniformity changes quickly happens tho. It does gets better every time the TV did it's self maintenance thing. But  between the self maintenance sessions, the uniformity changes.\n\n\nAt least thats in my LG CX OLED 55. \n\n\nOh and in around 2 years, its edges starts to have dead pixels. \n\n\nNo other issue. No noticeable burn in too. ",
                              "score": 1,
                              "created_utc": 1742099749.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mi81vrm",
                          "author": "iouli",
                          "body": "I've had my LG OLED for four and a half years without any issues whatsoever. I primarily use it for YouTube and streaming movies with mixed content. If you're watching a news channel 24/7 with rolling text, then yes, you're likely to experience some burn-in.\n\nHowever, the reality is that 90% of OLED users are well-informed about the strengths and limitations of the technology and purchase them without any problems. I'm active in OLED forums where gamers use their displays at high luminance for HDR gaming without issues as well.\n\nAs for lifespan, you can comfortably use a modern OLED display for ten years without concern. The technology has advanced significantly, and most burn-in issues from early generations have been largely minimized. Unfortunately, these so-called issues are often exaggerated in the media by non-users, leading people to believe that OLEDs are still plagued by burn-in and low luminance drawbacks—when, in reality, they are not.",
                          "score": 1,
                          "created_utc": 1742195873.0,
                          "replies": [
                            {
                              "id": "mi82hif",
                              "author": "HaMMeReD",
                              "body": "You can say that to me, but I literally have a ton of burn in on my C1 (Which is only about 3 years old now, at least since I bought it).\n\nThe taskbar, teams, my IDE's, they all have common/static elements. If I only played games/videos maybe I'd think different, but they have really started scorching some areas of my screen.\n\nIt's still usable, but it's very apparent especially in the task bar area.\n\nI was aware of the limitations when I bought it, also largely because people are like \"it's a non-issue, and the screen cleaning makes it like new\". Yeah, until it doesn't.",
                              "score": 1,
                              "created_utc": 1742196268.0,
                              "replies": [
                                {
                                  "id": "mi8dimi",
                                  "author": "iouli",
                                  "body": "sorry to hear that? can you post a picture whenever possible to show it to my friend who alos has a C1, and playing a lot of HDR gaming on PS5 with no issues? Thanks!",
                                  "score": 1,
                                  "created_utc": 1742203619.0,
                                  "replies": [
                                    {
                                      "id": "miansvs",
                                      "author": "HaMMeReD",
                                      "body": "[https://imgur.com/a/OsyN1Rq](https://imgur.com/a/OsyN1Rq)\n\nBut you can see pretty clearly the pattern, teams, taskbar, reddit.\n\nThen the big blob in the center.\n\nLike I do acknowledge, as a living room TV, I would probably not be complaining, because the TV is for dynamic content. But if static content is expected in your day to day, you will eventually burn in just like this.\n\nSo personally, not a huge fan of OLED for Monitors. When this gets replaced, it'll probably be a LCD of some kind. However, when I upgrade my living room TV, I may very well go some variant of OLED.",
                                      "score": 1,
                                      "created_utc": 1742233754.0,
                                      "replies": [
                                        {
                                          "id": "miego31",
                                          "author": "iouli",
                                          "body": "Wow, that's nasty! I just bought a sh Asus Zenbook with an OLED display and it is clean as a whistle. But I thing it's luminance limited and hides some other tricks for not getting burn-in, given its monitor purpose first.",
                                          "score": 1,
                                          "created_utc": 1742283483.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhsrisl",
              "author": "TheNorthComesWithMe",
              "body": "OLED is kind of microLED with extra steps. Those extra steps just happen to make it actually economically feasible to produce displays with.",
              "score": 4,
              "created_utc": 1741980041.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhrmkvb",
          "author": "Psshaww",
          "body": "They already are surpassed by microLED if your TV is in a bright room.",
          "score": 4,
          "created_utc": 1741967869.0,
          "replies": [
            {
              "id": "mhrung3",
              "author": "VampyreLust",
              "body": "Only in a technological way, not in a competitive way when a MicroLED display costs 50-60 times more than an equivalent sized OLED display.",
              "score": 3,
              "created_utc": 1741970198.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhqifkq",
      "author": "bandannick",
      "body": "What are the “drawbacks” of OLEDs?",
      "score": 39,
      "created_utc": 1741954990.0,
      "replies": [
        {
          "id": "mhqj8ms",
          "author": "gfewfewc",
          "body": "Burn-in, black smearing",
          "score": 111,
          "created_utc": 1741955306.0,
          "replies": [
            {
              "id": "mhqmtbd",
              "author": "randomIndividual21",
              "body": "And low frame rate stutter, brightness",
              "score": 46,
              "created_utc": 1741956667.0,
              "replies": [
                {
                  "id": "mhronyt",
                  "author": "fvck_u_spez",
                  "body": "Also flickering when Freesync is enabled and the refresh rate is swinging rapidly",
                  "score": 12,
                  "created_utc": 1741968472.0,
                  "replies": [
                    {
                      "id": "mhscpv1",
                      "author": "Successful_Way2846",
                      "body": "VA panels, which are what this TV will use,  are worse than OLEDs in this regard.",
                      "score": 4,
                      "created_utc": 1741975395.0,
                      "replies": [
                        {
                          "id": "mhsfc7o",
                          "author": "fvck_u_spez",
                          "body": "Not all TVs, but many. I have had IPS TVs before. And from data I have seen on RTINGS, while it can be a problem on VA panels, it is much more noticeable on OLED.\n\nEdit: Looks like I was thinking of TN, VA does indeed have flicker too. So maybe not as relevant for TVs, but definitely a consideration for monitors. I frequently notice flicker on my new OLED display, whereas I never once noticed flicker on the 170hz IPS display that I upgraded from.",
                          "score": 3,
                          "created_utc": 1741976296.0,
                          "replies": [
                            {
                              "id": "mhsgc31",
                              "author": "Successful_Way2846",
                              "body": "I bet if you turned the brightness up on your OLED to match the black levels of your IPS panel, you wouldn't have any flicker on it either.",
                              "score": 0,
                              "created_utc": 1741976657.0,
                              "replies": [
                                {
                                  "id": "mhsj90l",
                                  "author": "fvck_u_spez",
                                  "body": "The brightness on both is 100%",
                                  "score": 1,
                                  "created_utc": 1741977570.0,
                                  "replies": [
                                    {
                                      "id": "mhspho7",
                                      "author": "Successful_Way2846",
                                      "body": "This statement makes me think you don't even own an OLED.  Brightness is the black level setting on an OLED.",
                                      "score": -3,
                                      "created_utc": 1741979440.0,
                                      "replies": [
                                        {
                                          "id": "mhsr2u2",
                                          "author": "fvck_u_spez",
                                          "body": "Lol sure thing buddy\n\n[Here is proof](https://www.imgur.com/a/weer2re)",
                                          "score": 1,
                                          "created_utc": 1741979910.0,
                                          "replies": [
                                            {
                                              "id": "mhtebqv",
                                              "author": "Successful_Way2846",
                                              "body": "So there's no real brightness setting? What a shit design.",
                                              "score": 0,
                                              "created_utc": 1741986709.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhr24rh",
                  "author": "WFlumin8",
                  "body": "Low frame rate stutter isn’t a con, it’s actually just a side effect of having perfect response time. Standard LED smears frames together (motion blur) which is why it looks smoother, but inaccurate",
                  "score": 37,
                  "created_utc": 1741961839.0,
                  "replies": [
                    {
                      "id": "mhrew0x",
                      "author": "proanimus",
                      "body": "Is this why 30fps games look harsher and more stuttery to me on my OLED TV compared to LCD? I noticed it immediately but could never really describe what I was seeing.",
                      "score": 24,
                      "created_utc": 1741965652.0,
                      "replies": [
                        {
                          "id": "mhrh37i",
                          "author": "IamGimli_",
                          "body": "Precisely.",
                          "score": 11,
                          "created_utc": 1741966287.0,
                          "replies": []
                        },
                        {
                          "id": "mhri2dd",
                          "author": "golimaaar",
                          "body": "Sometimes it's not even the TV \n\nI remember when I first launched horizon new dawn on my PS4 pro, and everything looked like it had ghosts chasing them when they moved",
                          "score": 2,
                          "created_utc": 1741966574.0,
                          "replies": []
                        },
                        {
                          "id": "mhvwxpm",
                          "author": "Olde94",
                          "body": "Yup. Same reason why gamers complain bellow 60fps and video films are fine at 24fps. \n\n[see this for visual representation at the video capture level](https://youtu.be/T78qvxircuk?si=mWqimaf8yo3CnNVY) but it’s the same\nConcept",
                          "score": 1,
                          "created_utc": 1742022561.0,
                          "replies": []
                        },
                        {
                          "id": "mjoynxh",
                          "author": "KillPenguin",
                          "body": "Chiming in late here, but I wanted to say: you can reduce this effect by turning on Black Frame Insertion (BFI). It makes motion a lot clearer.\n\nUnfortunately TV manufacturers often hide BFI behind some nonsense name. LG uses the term \"OLED Motion\". Anyway, might be worth a shot!",
                          "score": 1,
                          "created_utc": 1742925085.0,
                          "replies": []
                        },
                        {
                          "id": "mhri4ai",
                          "author": "golimaaar",
                          "body": "Sometimes it's not even the TV \n\nI remember when I first launched horizon new dawn on my PS4 pro, and everything looked like it had ghosts chasing them when they moved",
                          "score": 0,
                          "created_utc": 1741966589.0,
                          "replies": [
                            {
                              "id": "mhrlfnk",
                              "author": "steves_evil",
                              "body": "Sounds like TAA ghosting, something that's still very common in modern games unfortunately.",
                              "score": 17,
                              "created_utc": 1741967543.0,
                              "replies": []
                            },
                            {
                              "id": "mhrjwiy",
                              "author": "proanimus",
                              "body": "That sounds like upscaling artifacts from stuff like FSR or checkerboard rendering.",
                              "score": 6,
                              "created_utc": 1741967104.0,
                              "replies": [
                                {
                                  "id": "mhrlm9t",
                                  "author": "golimaaar",
                                  "body": "Yep, and almost every game uses that now\n\nThere are some video analysis on YouTube that are really disheartening",
                                  "score": 3,
                                  "created_utc": 1741967595.0,
                                  "replies": [
                                    {
                                      "id": "mht2vab",
                                      "author": "None",
                                      "body": "Yeah but it's not the TV tech, it's the upscaling tech causing it. This will be just as evident on a standard LED TV.",
                                      "score": 3,
                                      "created_utc": 1741983409.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhsb3jx",
                      "author": "er-day",
                      "body": "This. Took me like 6 months to not be bothered by the fast frame changes vs the smoothness of laggy leds.",
                      "score": 3,
                      "created_utc": 1741974899.0,
                      "replies": []
                    },
                    {
                      "id": "mhuqm2v",
                      "author": "Realistic_Condition7",
                      "body": "It’s not a defect or a step back, but it’s still a con. Perfect response time makes 30 fps look worse.\n\nSeems like a lot of games that run at 30 fps these days have motion blur built in (or at least optional), so I really wouldn’t think it’s the biggest deal though.",
                      "score": 3,
                      "created_utc": 1742002806.0,
                      "replies": [
                        {
                          "id": "mhxjrdd",
                          "author": "WFlumin8",
                          "body": "I just can’t agree with that sentiment. It’s like saying that good sound quality is a con on expensive headphones because it reveals how shittily produced SoundCloud music is. That’s an unfair con, and it’s not the headphones fault, it’s the shit produced music. Same goes for OLED, stuttery framerate is not a con of the monitor, but it reveals the con of low framerate further.",
                          "score": 1,
                          "created_utc": 1742051670.0,
                          "replies": [
                            {
                              "id": "mhywvp7",
                              "author": "Realistic_Condition7",
                              "body": "If someone frequently plays 30 fps games and says “what could be a con of buying an OLED system,” you would literally be doing them a disservice by not telling them that their games would look more stuttery. It’s literally a con.\n\nIs it OLED’s fault? No, but you would have to tell that person about the con of upgrading to OLED in their circumstance.",
                              "score": 1,
                              "created_utc": 1742066961.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhrcr0s",
                      "author": "donnievieftig",
                      "body": "In practice it is a con though.",
                      "score": 3,
                      "created_utc": 1741965030.0,
                      "replies": []
                    },
                    {
                      "id": "mhsqu02",
                      "author": "TheNorthComesWithMe",
                      "body": "\"Standard LED\" is still just LCDs with fancier backlighting.",
                      "score": 1,
                      "created_utc": 1741979837.0,
                      "replies": []
                    },
                    {
                      "id": "mht8oa2",
                      "author": "whilst",
                      "body": "I continue to wonder when we will wake up to the fact that 24fps is *incredibly* low temporal resolution, and more frames per second is just better.  \"It doesn't look cinematic\" and \"it looks like a soap opera\" are both impossible to not see as, \"this is what we got used to and associated with these two kinds of media, and therefore we will never accept change\".",
                      "score": 0,
                      "created_utc": 1741985128.0,
                      "replies": [
                        {
                          "id": "mhvaiyx",
                          "author": "I-seddit",
                          "body": "I'm sorry you're getting downvoted, but you're correct.  Panning is a nightmare for film and there's just no way around it.  And motion is just worse, their only argument is that people like and are used to  \"filmlike\" rates - not that it's in any quality way better.  \nElitism bias.",
                          "score": 2,
                          "created_utc": 1742010596.0,
                          "replies": []
                        },
                        {
                          "id": "mhur3vk",
                          "author": "Realistic_Condition7",
                          "body": "You can watch hours and hours of footage of film makers talking about this lol. You’re more than welcome to prefer 60 fps film, but it’s funny that people act like filmmakers just don’t wanna change cause “they’re dumb and don’t want to.”\n\nThey know all about HFR, and it’s a very well known and talked about aspect of the film making community. There is a lot more to it than just bigger number better.",
                          "score": 2,
                          "created_utc": 1742002986.0,
                          "replies": [
                            {
                              "id": "mhw6j2c",
                              "author": "whilst",
                              "body": "You're using quotation marks but you're not quoting me, or even paraphrasing.  Generations of filmmakers can be in love with an art form as it exists, and making great art within the language and limitations of that art form.  And still limiting themselves, because better technology exists but does a thing that isn't what gives them joy and exists within their tradition, and because the industry is built for 24fps.\n\nPeter Jackson tried, and still many theaters *couldn't* play his Hobbit films at his preferred 48fps.  And a lot of moviegoers hated it, and about *them* I can easily say \"it's because it's not what they're used to\".  I continue to hold that a generation could grow up only having seen 48fps or higher, and *hate* the old 24fps films, and produce a new crop of directors that felt the same.",
                              "score": 2,
                              "created_utc": 1742028894.0,
                              "replies": [
                                {
                                  "id": "mhw96my",
                                  "author": "Realistic_Condition7",
                                  "body": "But why is what you’re used to an irrelevant argument? Less frames has a visual effect the same way more frames has a visual affect. I feel like a generation of gamers (where fps is directly tied to how responsive a game is, and thus how well you can perform at it), has trained people to think that there is nothing to gain from lower fps.\n\nAgain, go and watch the actual filmmaking content out there. It boils down to a lot more than just “limiting themselves” because of “tradition,” (see, there I quoted what you actually said).",
                                  "score": 1,
                                  "created_utc": 1742030650.0,
                                  "replies": [
                                    {
                                      "id": "mhw9pvo",
                                      "author": "whilst",
                                      "body": "I didn't say it was an irrelevant argument.  I said the reason that filmmakers won't try higher framerates is it's not what they're used to.\n\nLess frames has a visual effect: certainly so.  So why isn't it *used* as a visual effect --- ie, something used some of the time --- rather than simply being how all films are made?  It's not a choice if it's everything.\n\n> I feel like a generation of gamers (where fps is directly tied to how responsive a game is, and thus how well you can perform at it), has trained people to think that there is nothing to gain from lower fps.\n\nI'm not a gamer.  But it sounds like we agree: a generation is growing up finding low fps visually unpleasant.  Hopefully that produces the film directors who feel similarly, with time.\n\n> It boils down to a lot more than just “limiting themselves” because of “tradition,” (see, there I quoted what you actually said).\n\nOkay.  What is it, if not tradition?  Because if it's a stylistic choice, it's... certainly not a \"choice\".  It's what every movie with almost no exceptions does.  You'd think an art form would at least sometimes vary the parameters of its medium, and the fact that this one is sacrosanct smacks of tradition and dogma.  Especially since the few attempts to change it have fallen flat, because of industry inertia.",
                                      "score": 1,
                                      "created_utc": 1742031003.0,
                                      "replies": [
                                        {
                                          "id": "mhwcm1u",
                                          "author": "Realistic_Condition7",
                                          "body": "In gaming fps affects your performance, that was meant to explain why it is not a 1:1 comparison.\n\nAs for the rest, I’m just not even going to bother, you’re clearly making some off handed points and need to actually go do some research (go tell filmmakers to only lower fps as a visual affect, see what they say.). \n\nI agree that there actually should be some more variance to framerates in videos, but there is a reason it hasn’t caught on as some superior standard. If it was seriously just flat out superior, there would be a bubbling force of filmmakers trying to make HFR film the norm, rather than just the odd experiment or specific attempt at a different style of shooting (a la the Hobbit).",
                                          "score": 1,
                                          "created_utc": 1742032867.0,
                                          "replies": [
                                            {
                                              "id": "mhxyn3f",
                                              "author": "whilst",
                                              "body": "I hear you re: going and doing some research.  But it would have been nice if you'd named even one reason why 24fps is inherently preferable in all of this.  It's like boxing a ghost.  I'm responding to my own experience of, 24fps *hurts* for me, especially when there's a pan and it looks like a slideshow.  It always has.  Every once in a while there's higher-fps content and it's like a breath of fresh air.  \n\nSo there *are* some advantages, and there is basically nobody catering to that at all, and that seems weird.  And I'm very curious if, given a real choice for an extended period of time, the viewing public would find it preferred 48fps and never look back.  Right now, we're not being given a choice, and just being *told* what we should like.\n\nEDIT: And it should be noted that modern TVs tend to insert extra ai-generated frames anyway.  Cinephiles all know to turn that functionality off because it ruins the directors' intent, but tv manufacturers wouldn't include that functionality in the first place and leave it on by default if it weren't selling TVs.  It's a suggestion, at least, that the quiet majority buy it because they think it looks better, even if they don't know why.  That's signal that it seems like creators should be paying attention to.",
                                              "score": 1,
                                              "created_utc": 1742056361.0,
                                              "replies": [
                                                {
                                                  "id": "mhyuwdv",
                                                  "author": "Realistic_Condition7",
                                                  "body": "Most videophiles turn motion smoothing off as soon as they pull their TVs out of the box, and film is shown in theaters also.\n\nI mean yeah, I can’t tell you that you’re wrong to dislike 24 fps, but we’ll just have to disagree that it’s because people are just trained to only prefer one option. I don’t think stubbornness would be holding an entire industry hostage like this, especially when you consider all of the filmmakers that have considered HFR and tried HFR.",
                                                  "score": 1,
                                                  "created_utc": 1742066337.0,
                                                  "replies": [
                                                    {
                                                      "id": "mi29hci",
                                                      "author": "whilst",
                                                      "body": "> Most videophiles turn motion smoothing off as soon as they pull their TVs out of the box, and film is shown in theaters also.\n\nI literally said this in the post you're responding to.\n\nBut most movie viewers aren't cinephiles.  Most TV purchasers buy the TV they like, which is the one with smoothing.  Maybe they're onto something.",
                                                      "score": 1,
                                                      "created_utc": 1742117235.0,
                                                      "replies": [
                                                        {
                                                          "id": "mi50uts",
                                                          "author": "Realistic_Condition7",
                                                          "body": "You edited your comment lol don’t try that.\n\nBut they also watch movies in the theaters.\n\nSo right now the crux of what you’re saying is to ignore the people who care more about how a film looks, and side with people who don’t care if smoothing is on their TVs…the same people who also don’t care that there is no smoothing on in the theater. 🤷‍♂️",
                                                          "score": 1,
                                                          "created_utc": 1742153849.0,
                                                          "replies": [
                                                            {
                                                              "id": "mi89c4q",
                                                              "author": "whilst",
                                                              "body": "I edited *which* comment? If you're talking about the one several back, that was edited at the time.  I didn't edit it in response to your comment, I edited it two minutes after I initially submitted it to add the edit at the end.  The fact that you didn't read all the way through, or refresh before you hit submit, is not my doing.\n\nEDIT (again, making this at the time, because this is how I write): the people who want it on on their TVs want it on because they like it.  They may not notice its absence at the theater, but I suspect if they had a choice between the two they'd pick the smoother one there too.  They might not know why they like it more, but again: if everyone had a choice, I have a strong suspicion that the market would push us all towards higher frame rates.  We're not being given a choice, except on TVs which add smoothing.  And there, we're choosing smoothing.",
                                                              "score": 1,
                                                              "created_utc": 1742200863.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mibaadg",
                                                                  "author": "Realistic_Condition7",
                                                                  "body": "You’re making an assumption with no evidence.\n\nIn fact, there is probably more contrary evidence, as many people found soap operas nauseating lol",
                                                                  "score": 1,
                                                                  "created_utc": 1742240187.0,
                                                                  "replies": []
                                                                },
                                                                {
                                                                  "id": "mibb0fx",
                                                                  "author": "Realistic_Condition7",
                                                                  "body": "Didn’t finish typing my lost post and accidentally hit send.\n\nThe soap opera is evidence against what you’re saying, and I don’t know why you’re saying that when there is no outcry in either direction, you’d say they prefer the smoothing. Most people prefer to watch movies in the movie theater.\n\nSo if I understand you right, your belief is that for the average viewer who doesn’t complain either way, we should just assume based on zero evidence that they prefer smoothing, and then we should make that the standard and ignore all people who actually care about the way video is viewed, and roll with a total guess based on people who don’t care either way?",
                                                                  "score": 1,
                                                                  "created_utc": 1742240395.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhu38nb",
                  "author": "dreadcain",
                  "body": "For me the low frame rate stutter is only really an issue without frame rate matching. The effects of the [3:2 pulldown](https://en.wikipedia.org/wiki/Three-two_pull_down) were what made me feel the stutter more than anything.",
                  "score": 2,
                  "created_utc": 1741994739.0,
                  "replies": []
                },
                {
                  "id": "mhrbyfw",
                  "author": "FewHorror1019",
                  "body": "Brightness flickering",
                  "score": 2,
                  "created_utc": 1741964793.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mhsciyg",
              "author": "Successful_Way2846",
              "body": "What black smearing?",
              "score": 3,
              "created_utc": 1741975333.0,
              "replies": [
                {
                  "id": "mhslfb9",
                  "author": "gfewfewc",
                  "body": "The pixels take longer to turn back on when off than they do to change to another color, if you have something moving on a black background or vice versa there's a pretty obvious smearing effect.",
                  "score": 6,
                  "created_utc": 1741978224.0,
                  "replies": [
                    {
                      "id": "mhso3ck",
                      "author": "Successful_Way2846",
                      "body": "This is not a phenomena on TV/Monitor sized panels. That's an issue on cell phones and other small sized panels. QD-OLED doesn't do it in any way whatsoever.",
                      "score": 5,
                      "created_utc": 1741979019.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhruidk",
              "author": "MadOrange64",
              "body": "And they straight up suck for a bright environment. OLED is at its best in a controlled light environment.",
              "score": 2,
              "created_utc": 1741970158.0,
              "replies": []
            },
            {
              "id": "mhr277e",
              "author": "badger906",
              "body": "Burn in is was less of a thing now with pixel shift and logo detection",
              "score": 1,
              "created_utc": 1741961860.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mhqk9ep",
          "author": "jeffram",
          "body": "Brightness, burn in, cost, manufacturability above 80ish inches",
          "score": 24,
          "created_utc": 1741955708.0,
          "replies": [
            {
              "id": "mhqmge8",
              "author": "predator-handshake",
              "body": "Let’s not use the word cost as if this Sony is going to be affordable. Brightness i just don’t get anymore, how can someone use a modern high end OLED and think it’s not bright enough. The G4 at 100% is crazy bright.",
              "score": 23,
              "created_utc": 1741956535.0,
              "replies": [
                {
                  "id": "mhsbfhj",
                  "author": "replus",
                  "body": "Forget this Sony, I haven't seen *any* Sony TV in the past decade that has been competitively priced. They are very much the \"no lowballs I know what I got\" of consumer TV brands.",
                  "score": 1,
                  "created_utc": 1741974996.0,
                  "replies": []
                },
                {
                  "id": "mhqri4h",
                  "author": "jasongill",
                  "body": "Agreed, I think \"cost\" is the only drawback at this point - my 4 year old OLED is kept at like 1/4 brightness because it can be blindingly bright. I wonder if people who complains of brightness issues (in real world environments, outside of testing) is really complaining of not overpowering reflections due to OLED's reflective finish vs cheaper matte LCD style displays they are used to.\n\nAnd even the cost argument is a bit crazy - a 77\" OLED can be had today for what a 50\" LCD cost 10 years ago ($1500-1700ish). And yes, you can buy a similar sized cheap LCD for $500 these days, but comparing a high end product which is now available at a low price, to a low end product that is now available at a bargain-basement price isn't really a good comparison.",
                  "score": 1,
                  "created_utc": 1741958341.0,
                  "replies": [
                    {
                      "id": "mhtg11c",
                      "author": "Emu1981",
                      "body": ">my 4 year old OLED is kept at like 1/4 brightness because it can be blindingly bright.\n\nI do this on my OLED monitor but I do run into the issue that I literally cannot see things in dark environments despite the game intending that I can still see things in those dark environments.",
                      "score": 1,
                      "created_utc": 1741987165.0,
                      "replies": []
                    },
                    {
                      "id": "mhqvyts",
                      "author": "Awkward_Pangolin3254",
                      "body": "Why someone would buy a huge expensive OLED TV and place it somewhere it receives glare completely mystifies me.\n\nIt's like someone buying an audiophile-grade setup and complaining it sounds like shit because they put it in their big, empty unfurnished basement.",
                      "score": 0,
                      "created_utc": 1741959864.0,
                      "replies": [
                        {
                          "id": "mhs4as6",
                          "author": "Auridran",
                          "body": "Hi, it's me, I don't have an OLED but I have the nicest TV I've ever had, and it needs to be insanely bright to combat glare in my setup. I don't really have a choice in the matter, as my living room has giant windows facing east, and the room dimensions/setup make having the TV anywhere but directly opposite the windows pretty awkward. I doubt I'm the only person in a similar situation.",
                          "score": 2,
                          "created_utc": 1741972958.0,
                          "replies": [
                            {
                              "id": "mhs8g0y",
                              "author": "3-DMan",
                              "body": "Blackout curtains, my man!",
                              "score": 1,
                              "created_utc": 1741974141.0,
                              "replies": []
                            },
                            {
                              "id": "mhsei7f",
                              "author": "Awkward_Pangolin3254",
                              "body": "Never heard of curtains? Blinds? Window coverings of any sort? Forget the TV; I couldn't stand living in a house completely in view to the outside world at all times.",
                              "score": 0,
                              "created_utc": 1741976004.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhqol2z",
                  "author": "DrunkenBartender17",
                  "body": "I bought a 75 inch LED for $500. Cost is absolutely a drawback on an OLED.",
                  "score": -5,
                  "created_utc": 1741957308.0,
                  "replies": [
                    {
                      "id": "mhr2cha",
                      "author": "predator-handshake",
                      "body": "You’re talking about a low end TV. This sony is easily going to be 10X that price",
                      "score": 7,
                      "created_utc": 1741961906.0,
                      "replies": []
                    },
                    {
                      "id": "mhqro9b",
                      "author": "CjBoomstick",
                      "body": "He was referring to the price of OLEDs vs. whatever this fancy new stuff is going to cost.",
                      "score": 13,
                      "created_utc": 1741958401.0,
                      "replies": [
                        {
                          "id": "mhqu66k",
                          "author": "thrownawaymane",
                          "body": "Nah since these are normalish LEDs it should be significantly cheaper, especially at larger sizes. OLED yields still suck in comparison",
                          "score": -5,
                          "created_utc": 1741959260.0,
                          "replies": [
                            {
                              "id": "mhr27ig",
                              "author": "predator-handshake",
                              "body": "Have you see the price of the Bravia 9? This isn’t going to be cheap",
                              "score": 4,
                              "created_utc": 1741961863.0,
                              "replies": [
                                {
                                  "id": "mhtko7b",
                                  "author": "thrownawaymane",
                                  "body": "I said “cheaper” not cheap and was talking about it partially from a margin perspective. \n\nSony doesn’t really do cheap.",
                                  "score": 1,
                                  "created_utc": 1741988623.0,
                                  "replies": [
                                    {
                                      "id": "mhtmeo6",
                                      "author": "predator-handshake",
                                      "body": "Cheaper than what exactly though? I’d expect this to be more expensive than any other tv of the same size.",
                                      "score": 1,
                                      "created_utc": 1741989172.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhrkg7v",
                      "author": "Mandible_Claw",
                      "body": "$500 for a 75\" TV of any quality is still an absurdly good deal and at that price range, most people don't really care if they're getting the best display technology. Companies still have a profit incentive to get you to buy a higher end model, so if OLEDs are sold that cheaply, LEDs are going to have to reduce in price even further or disappear completely, otherwise companies risk cannibalizing their own sales on models that are much cheaper to produce.",
                      "score": 1,
                      "created_utc": 1741967260.0,
                      "replies": [
                        {
                          "id": "mhro3fs",
                          "author": "ElectronicMoo",
                          "body": "This is me.  If it's 4k (which I notice) and cheap, I'm getting it. The Oled ca micro led vs whatever else doesn't seem to affect or bother me\n\nI generally am on the roku \"ecosystem\" so I'm always looking at whatever cheap, big roku TV there is.   My hisense and TCL roku tvs in the 70 and 75 inch do just fine for me and weren't bank breakers.",
                          "score": 2,
                          "created_utc": 1741968307.0,
                          "replies": [
                            {
                              "id": "mhrtid9",
                              "author": "frankev",
                              "body": "Agree completely with you.  Last year, we had a lightning strike take out the HDMI ports on our 65\" Vizio, which meant we could no longer use our Roku stick (which we preferred over Vizio's OS).\n\nWhile we had been ardent Vizio fans, we found a 65\" 4K TCL unit with built-in Roku for just $228 USD at Walmart on Thanksgiving weekend.  For our purposes, we're not missing anything.",
                              "score": 1,
                              "created_utc": 1741969869.0,
                              "replies": [
                                {
                                  "id": "mhtq8ub",
                                  "author": "ElectronicMoo",
                                  "body": "If it's any comfort, I use a Vizio sound system with my roku tvs. 😊",
                                  "score": 2,
                                  "created_utc": 1741990416.0,
                                  "replies": [
                                    {
                                      "id": "mhtucjt",
                                      "author": "frankev",
                                      "body": "Amazing—same here!  Our Vizio sound bar had survived the lightning strike, so we kept it with the TCL TV.\n\nThe old Vizio TV was moved to our guest room.",
                                      "score": 1,
                                      "created_utc": 1741991768.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mhrcyrj",
                      "author": "DurtyKurty",
                      "body": "Well they're still the best overall TV picture-wise so they're not going to be that cheap just by that fact alone. LG Oled's really aren't that expensive either if you just wait for a discount which seems to be every other day. I regularly see 65\" for around $1500 and that's not terrible considering you're getting the best picture quality in a TV and insane refresh rates if you're into gaming.",
                      "score": 1,
                      "created_utc": 1741965092.0,
                      "replies": [
                        {
                          "id": "mhrdttm",
                          "author": "DrunkenBartender17",
                          "body": "Totally valid points, same as the other commenter. I just don’t think it makes sense to ignore cost as a drawback of OLED. It’s the same as any top end tech, it’ll be more expensive until the next thing replaces it.",
                          "score": 0,
                          "created_utc": 1741965344.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mhqzrqs",
                  "author": "LAHurricane",
                  "body": "I like my TV to make me squint in bright scenes when HDR is on. Affordable, consumer grade, large screen OLED aren't really there yet brightness wise.\n\nReally, only the brand new flagships, LG's G4 and Samsung's Q95D, offer the stupid high 1000+ nits in HDR content in a screen over 70\". The Samsung only goes up to 77\" for $3,500, which would be a large screen size decrease for me. The LG gets up to 97\", which is a joke at $20,000. Although there is an 83\" for $5,300, which unfortunately still isn't financially viable for most people.\n\nThat's the reason I am still using my 85\" Samsung Q90T.",
                  "score": -2,
                  "created_utc": 1741961099.0,
                  "replies": [
                    {
                      "id": "mhr22if",
                      "author": "predator-handshake",
                      "body": "That’s what i mean, my G4 makes me squint on HDR. I don’t see why anyone would want even more, you’ll need sunglasses soon",
                      "score": 4,
                      "created_utc": 1741961819.0,
                      "replies": [
                        {
                          "id": "mhsldnk",
                          "author": "Elon61",
                          "body": "I don’t get why some people hate innovation so much. \n\nAnything that has to deal with daylight needs to be at least 1000 nits full field which even 2025 OLED models are not even remotely close to achieving. \n\nMeanwhile, the RGB MiniLED TV Sony demoed has like an order of magnitude greater colour volume than even QD-OLED, with greater brightness, and the reviewers who got a look loved it. It’s going to be the best TV of 2026 at this rate and nothing else comes even close.",
                          "score": 4,
                          "created_utc": 1741978210.0,
                          "replies": []
                        },
                        {
                          "id": "mhrf6l4",
                          "author": "LAHurricane",
                          "body": "Yea, the g4 is an incredible OLED, but most people can't afford a flagship TV.\n\nIn a few years that tech will trickle down.",
                          "score": 2,
                          "created_utc": 1741965736.0,
                          "replies": [
                            {
                              "id": "mhrii6b",
                              "author": "predator-handshake",
                              "body": "What do you think this Sony is? It’s a flagship. This sony isn’t meant for the average person, it’s going to cost a fortune. By the time this trickles down much better tech will exist like qned and microled",
                              "score": 2,
                              "created_utc": 1741966700.0,
                              "replies": [
                                {
                                  "id": "mhrn0f0",
                                  "author": "LAHurricane",
                                  "body": "Sir, are you dense?\n\nWho are you arguing with?\n\nWhen did I mention that the Sony wouldn't be a flagship?\n\nI was only stating OLED isn't bright enough for a lot of people. Something that has been one of the biggest downsides to OLED vs LCD. It hasn't been until the last one or two years that OLEDs, and only the flagship models that the average consumer can't afford, have been able to provide LCD level HDR brightness.\n\nThat's it.",
                                  "score": -1,
                                  "created_utc": 1741967993.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mhsip8n",
          "author": "PlasmaWhore",
          "body": "Framerate causes a terrible ghosting effect that apparently no one else seems to notice, but it drives me nuts. I have an A95L, which is supposedly the top of the line OLED and I've tried every single motion smoothing setting and I either have to live with soap opera effect and bad artifacting or this ghosting thing.\n\nhttps://imgur.com/a/8Npg8x1",
          "score": 4,
          "created_utc": 1741977402.0,
          "replies": []
        },
        {
          "id": "mhqphxe",
          "author": "4kVHS",
          "body": "Limited brightness for HDR. Burn in.",
          "score": 5,
          "created_utc": 1741957635.0,
          "replies": [
            {
              "id": "mhr12md",
              "author": "iouli",
              "body": "Limited brightness? At 2500 nits peak brightness from todays' OLEDs?",
              "score": -3,
              "created_utc": 1741961507.0,
              "replies": [
                {
                  "id": "mhs49u2",
                  "author": "4kVHS",
                  "body": "Which OLED TV has that much brightness?",
                  "score": 5,
                  "created_utc": 1741972950.0,
                  "replies": [
                    {
                      "id": "mk6a2ej",
                      "author": "iouli",
                      "body": "Both Samsung and LG's 2025 generation of OLEDs.",
                      "score": 1,
                      "created_utc": 1743165303.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mhr2bhu",
                  "author": "ItsAMeUsernamio",
                  "body": "Are you referring to a phone? On TVs Mini LEDS have been brighter than OLEDs for a while unless that's a recent development.",
                  "score": 4,
                  "created_utc": 1741961897.0,
                  "replies": [
                    {
                      "id": "mk6asml",
                      "author": "iouli",
                      "body": "No, both Samsung and LG's 2025 generation of OLEDs have peak brightness of roughly 2500 nits, in HDR mode.",
                      "score": 1,
                      "created_utc": 1743165584.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mhrmpqe",
          "author": "Psshaww",
          "body": "Burn in and poor brightness",
          "score": 2,
          "created_utc": 1741967907.0,
          "replies": []
        },
        {
          "id": "mhtl0tt",
          "author": "CountSheep",
          "body": "They can have an intense flickering effect sometimes",
          "score": 1,
          "created_utc": 1741988734.0,
          "replies": []
        },
        {
          "id": "mhua9fe",
          "author": "boygriv",
          "body": "They're not nearly as bright as a nice led (particularly full array and mini led).",
          "score": 1,
          "created_utc": 1741997100.0,
          "replies": []
        },
        {
          "id": "mi2kf7m",
          "author": "Advanced-Blackberry",
          "body": "All of the “drawbacks” listed are completely overblown.  I have 3 OLED starting with LGs curved 2013 model that’s is still in use. All of them are fucking amazing and I would not trade any of them for any LCDs. OLEDs are still king for consumer TVs.  Newer oleds offer plenty of brightness and plenty smooth for sports. Burn in is a complete non-issue for normal viewing. ",
          "score": 1,
          "created_utc": 1742123965.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhr246n",
      "author": "badger906",
      "body": "I went to a Microsoft research conference 20 years before oled came out and the entire conference was about oled lol so oled mk8 will be our by then and it will be bigger and brighter and cheaper",
      "score": 4,
      "created_utc": 1741961834.0,
      "replies": []
    },
    {
      "id": "mhs9rs0",
      "author": "muskratboy",
      "body": "Still stop gapping until we get micro led working properly.",
      "score": 4,
      "created_utc": 1741974522.0,
      "replies": []
    },
    {
      "id": "mhrljsr",
      "author": "EchoAtlas91",
      "body": "Ok, I might not be the most obsessed with this topic, but like what more do we need as far as TV tech? \n\nLike at what point does is it just diminishing returns with TV tech advancements?  Like going from 8k to 12k and like 99% of people won't comprehend the difference?",
      "score": 7,
      "created_utc": 1741967576.0,
      "replies": [
        {
          "id": "mhronz0",
          "author": "Benjamoose",
          "body": "You're not wrong, but don't forget people said the same sort of thing at the turn of the last century and then similar things about 20 years ago.\n\nThe truth is, while we can't see it now, the continuing drive is how we discover the next big thing.\n\nThat plus pushing the tech further also has the nice side effect of lowering the cost of production as resource needs become standardized and previous generations of tech then also become more accessible.\n\nLED lightbulbs are a great example. They were expensive at first, provided the same sort of light levels and weren't all that great.\n\nNow they're very affordable, use basically no energy compared to their counterparts, are safe to touch even after hours of use and last potentially decades.\n\nOr in the case of TVs, HD CRTs were in many ways technically better than similar sized flat screen TVs (perfect black levels, low latency, etc) but now OLED has caught up to that in some respects but in a far more efficient package.\n\n**TL;DR:** in the short term it always just seems like pointless iteration, but ultimately it typically leads to stronger tech that uses less resources and that costs less and is how we then discover the next big thing.",
          "score": 19,
          "created_utc": 1741968472.0,
          "replies": [
            {
              "id": "mhrpw1e",
              "author": "EchoAtlas91",
              "body": "Yeah, but in my opinion the next big thing is outside the realm of what we'd consider typical TVs. \n\nI'm talking about selectively shaded translucent screens, screens embedded in windows or clear films attached to walls, translucent screens that can selectively darken to either be clear or blackout, etc. \n\nUpping detail, definition, and color spectrum is just hitting the diminishing return ceiling at this point.",
              "score": 1,
              "created_utc": 1741968826.0,
              "replies": [
                {
                  "id": "mhymca7",
                  "author": "slam99967",
                  "body": "I agree. I think a better phrasing is that the current form factor of tv has basically reached maturity.",
                  "score": 0,
                  "created_utc": 1742063651.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mht1rnp",
          "author": "TheNorthComesWithMe",
          "body": "OLEDs tick basically all the boxes except they have big longevity issues and lower brightness than competitive LCDs. (They also have issues with text rendering and a black ghosting effect but those can be solved with drivers and aren't exactly problems with the displays themselves.) LCDs still have all the normal LCD issues. \n\nThe current \"thing\" is HDR. For most people this means displays that can compete with ambient light while still maintaining contrast, and also not having color banding in dark, low contrast scenes. Also your TV can flashbang you I guess. \n\nWide color gamut is the other thing that displays still haven't managed to cap out on. \n\nI'd also expect 3D to come back once someone figures out how to make a glasses-less 3D display. Also collapsible TVs might be a thing at some point, since big TVs are kind of an eyesore when you aren't watching them.",
          "score": 5,
          "created_utc": 1741983081.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhqoo65",
      "author": "None",
      "body": "Damn didn’t know there were drawbacks to my oleds my Sonys are like 6 years old and still have better picture then ones I see at Costco and Best Buy",
      "score": 9,
      "created_utc": 1741957339.0,
      "replies": [
        {
          "id": "mhs79uu",
          "author": "chronocapybara",
          "body": "And those ones on display are in \"display mode\" which is like 1000% more brightness and contrast than you would ever use at home.",
          "score": 6,
          "created_utc": 1741973807.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhutgdn",
      "author": "ICantBeliveUDoneThis",
      "body": "Somewhat of an expert in this area.\n\nThis isn't really new. The reason this hasn't been commercialized has always been cost and scale. The article doesn't really talk about the technology but presumably they made some improvements to the manufacturing process. It is just another incremental step. Nobody has found an easy way to place millions of LEDs in a way that is cost effective enough consumers could afford it, yet.\n\nSony has shown earlier versions of this. I believe it was called Crystal LED and was shown at CES. Samsung similarly has been showing \"The Wall\" microLED TV for years. \n\nBelieve it or not this tech has been around even longer than that. The massive displays you see in stadiums? Direct RGB LEDs just like this. It has just been prohibitively expensive to scale for general consumers. The way in which the image is generated is actually much simpler than LCD.\n\nThis is also the same thing as microLED technology by some definitions. I like that they aren't using the term microLED because there are actually 2 very different types of display that have both been called \"microLED\" and it gets confusing. They are differentiated by their manufacturing process. This display and Samsung's \"The Wall\" (marketed as \"microLED\") transfer millions of microLEDs from a wafer and spread them out over the display. Apple was also working on microLED displays for their devices (sadly no longer) and their tech would also fall under this first category. The second type of microLED display (which I personally think should retain the \"microLED\" name) leaves the microLEDs tightly packed on the wafer and directly bonds them to a backplane. This second type of microLED is for very tiny displays (even smaller than a watch) that will likely be used in future AR glasses. \n\nThere is no official definition of how small the LED has to be before it is called a \"microLED\". Even relatively small microLEDs only a few microns wide are plenty bright for a TV. The main thing that dictates the microLED size in these large format displays is cost, not performance. Bigger LEDs use more material and thus cost more. There are some papers out there that estimate based on cost even large TVs like this will probably need to use microLEDs about 10 microns wide (or less) to be meet the bottom line.\n\nPerformance wise it will beat (or tie) LCD and OLED in just about every way. Brightness, contrast, efficiency, lifetime, viewing angle, refresh rate etc will all be better. Color purity is debatable and really depends on the LEDs used. But it will cost you.",
      "score": 3,
      "created_utc": 1742003835.0,
      "replies": []
    },
    {
      "id": "mhqze8u",
      "author": "Scoobyhitsharder",
      "body": "I’ve had oleds for almost 10 years. Two 65 and one 77, can’t go back, and as far as drawbacks, have yet to “see” one.",
      "score": 8,
      "created_utc": 1741960980.0,
      "replies": []
    },
    {
      "id": "mhqlv6y",
      "author": "IWasSayingBoourner",
      "body": "Bring back SED TVs, you cowards! ",
      "score": 6,
      "created_utc": 1741956316.0,
      "replies": [
        {
          "id": "mhqztg3",
          "author": "Abba_Fiskbullar",
          "body": "SED was killed by a combination of difficulties in getting the resolution to 4k and a patent troll claiming that SED used their vague and broad concept.",
          "score": 5,
          "created_utc": 1741961114.0,
          "replies": [
            {
              "id": "mhr0o4s",
              "author": "IWasSayingBoourner",
              "body": "I'd imagine 20 years of newer tech could overcome the 4k issue",
              "score": 2,
              "created_utc": 1741961381.0,
              "replies": []
            },
            {
              "id": "mht07o4",
              "author": "tastyratz",
              "body": "It was almost exclusively the pissing match on rights and partnership falling apart blocking the release. At this point we have better options but back in the day SED was a real blow dealt.",
              "score": 2,
              "created_utc": 1741982621.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mhv0kdc",
      "author": "slickrasta",
      "body": "QD-OLED is incredible in terms of brightness and colour. I can't see how any brighter would be useful since I already have to turn down my Samsung S90C or else my eyes hurt. QD-OLED is also a highly scaleable technology so within 5 years it'll be one of the more affordable OLED options on the market. While this RGB tech does look very cool I wonder how scalable it is for manufacturing and what the end cost will be to consumers.",
      "score": 2,
      "created_utc": 1742006460.0,
      "replies": []
    },
    {
      "id": "mhwmdiw",
      "author": "Arashi_Uzukaze",
      "body": "Man large TVs are all the rage. Whatever happened to normal bedroom TV sizes? Like 24\" - 32\" tvs?",
      "score": 2,
      "created_utc": 1742038564.0,
      "replies": []
    },
    {
      "id": "mhqay7e",
      "author": "Doomchick",
      "body": "So. Useless news. Rumors",
      "score": 4,
      "created_utc": 1741951751.0,
      "replies": [
        {
          "id": "mhqwjdt",
          "author": "WolfyCat",
          "body": "This comment shouldn't be so highly upvoted. [Not rumours](https://youtu.be/bmGdYDShFvE). It's coming in 2026. [Press have seen it](https://youtu.be/-7egEx-xDto) and the technology has been explained and the impressions are glowing.",
          "score": 40,
          "created_utc": 1741960051.0,
          "replies": []
        },
        {
          "id": "mhqmp38",
          "author": "Floasis72",
          "body": "Sony’s got this new idea where TVs are BETTER. Please click our news article lol",
          "score": 7,
          "created_utc": 1741956624.0,
          "replies": []
        },
        {
          "id": "mhqbetg",
          "author": "Accomplished_Fun6481",
          "body": "Hopefully it works out but yeah right now they have “concepts” of a breakthrough",
          "score": -5,
          "created_utc": 1741951966.0,
          "replies": []
        },
        {
          "id": "mhqnlaq",
          "author": "MrInfuse1",
          "body": "Also the drawbacks of oled have been mitigated to the point there non existent",
          "score": -7,
          "created_utc": 1741956950.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhract5",
      "author": "Dalivus",
      "body": "What are the drawbacks to OLED?   I’ve had one for years and I can’t name one.",
      "score": 1,
      "created_utc": 1741964314.0,
      "replies": [
        {
          "id": "mhsm8h8",
          "author": "DrGrinch",
          "body": "Super reflective, not awesome in a bright room. \nI've got two and the one in my main living room is not good during the day, but great in the evening.",
          "score": 2,
          "created_utc": 1741978464.0,
          "replies": [
            {
              "id": "mht11bk",
              "author": "tastyratz",
              "body": "> Super reflective\n\nAnti glare filters can reduce brightness which is something an OLED tv cannot afford to give up right now. Displays capable of brighter output can use better anti glare filters but power efficiency and peak nits are such a marketing benefit the anti glare coating effectiveness has been de-prioritized in general.\n\nJust compare the anti glare filter on an old kuro plasma and weep vs any new tv.",
              "score": 2,
              "created_utc": 1741982863.0,
              "replies": [
                {
                  "id": "mhtve5m",
                  "author": "DrGrinch",
                  "body": "Totally it. I'm very curious to see this new Sony tech in the flesh next year. Was thinking of an upgrade to a G5 from my CX but will hold off until I see this new panel",
                  "score": 1,
                  "created_utc": 1741992115.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhrq0ue",
      "author": "dropthemagic",
      "body": "I wonder how it compares to tandem OLED. I actually really like the mini LED on my iPad because it gets used in places with a lot of light",
      "score": 1,
      "created_utc": 1741968866.0,
      "replies": []
    },
    {
      "id": "mhrra1v",
      "author": "TeamKiller",
      "body": "\"Absolutely smokes regular mini LED\" \"just a concept for now\" huh?",
      "score": 1,
      "created_utc": 1741969229.0,
      "replies": [
        {
          "id": "mhw1d7a",
          "author": "ultrahello",
          "body": "It’s been in development for 3 years and was demonstrated recently. it’s quite real. Sales start 2026",
          "score": 1,
          "created_utc": 1742025446.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhsmojp",
      "author": "Johnny_Menace",
      "body": "The only thing surpassing OLED is micro led but that’s still years away",
      "score": 1,
      "created_utc": 1741978597.0,
      "replies": []
    },
    {
      "id": "mhsn6r3",
      "author": "imclockedin",
      "body": "what are the drawbacks of oled, just curious",
      "score": 1,
      "created_utc": 1741978747.0,
      "replies": []
    },
    {
      "id": "mhsp44z",
      "author": "Flame734",
      "body": "All this tech just to put in a garbage smart OS that can barely function",
      "score": 1,
      "created_utc": 1741979326.0,
      "replies": []
    },
    {
      "id": "mhsy9dy",
      "author": "rafikiknowsdeway1",
      "body": "What are oleds drawbacks?",
      "score": 1,
      "created_utc": 1741982046.0,
      "replies": [
        {
          "id": "mht43hs",
          "author": "Jonesdeclectice",
          "body": "Burn-in, but that’s largely been resolved in modern displays.",
          "score": 1,
          "created_utc": 1741983769.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhti0k3",
      "author": "TheBoBiZzLe",
      "body": " /shrug\n\nBack to my 32inch 1080 monitor",
      "score": 1,
      "created_utc": 1741987787.0,
      "replies": []
    },
    {
      "id": "ml1488s",
      "author": "LeanSkellum",
      "body": "We need this in a monitor.",
      "score": 1,
      "created_utc": 1743605045.0,
      "replies": []
    },
    {
      "id": "mhqlsx3",
      "author": "HulksInvinciblePants",
      "body": "It’s not technology exclusive to Sony. Hisense and Samsung demonstrated similar technology at CES. Only Hisense’s was ready for market. \n\nIt’ll be nice for large displays (85”+), but it’s not going to “solve” OLED issues without having LCD issues.",
      "score": 0,
      "created_utc": 1741956292.0,
      "replies": []
    },
    {
      "id": "mhqgw8v",
      "author": "FirefighterNo2409",
      "body": "A rumor of concept? Seriously",
      "score": -5,
      "created_utc": 1741954371.0,
      "replies": []
    },
    {
      "id": "mhqupdn",
      "author": "ricktor67",
      "body": "Meanwhile random youtubers using off the shelf tech are making better TVs from junk. https://www.youtube.com/watch?v=qXrn4MqY1Wo",
      "score": -7,
      "created_utc": 1741959440.0,
      "replies": [
        {
          "id": "mhras50",
          "author": "OkThanxby",
          "body": "There’s literally no way that would ever be a commercial product though.",
          "score": 9,
          "created_utc": 1741964440.0,
          "replies": [
            {
              "id": "mhrob63",
              "author": "I_Am_A_Door_Knob",
              "body": "[Rear-projection tvs](https://en.m.wikipedia.org/wiki/Rear-projection_television) was sort of the precursor to what he made.\n\nBut yeah I don’t see them making a comeback.",
              "score": 4,
              "created_utc": 1741968369.0,
              "replies": [
                {
                  "id": "mht6g8j",
                  "author": "OkThanxby",
                  "body": "Yeah I know about those. \n\nImagine how big, impractical, and expensive a 4k 85” rear-projection-LCD (Lets call it an RPL) would have to be. And it wouldn’t even have better overall image characteristics than an OLED.",
                  "score": 1,
                  "created_utc": 1741984470.0,
                  "replies": [
                    {
                      "id": "mhtaxq7",
                      "author": "I_Am_A_Door_Knob",
                      "body": "Yeah it doesn’t really make practical sense when you look at the current offerings.\n\nAt that size i would probably begin looking into short throw projectors instead.",
                      "score": 1,
                      "created_utc": 1741985798.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mhs2107",
              "author": "ricktor67",
              "body": "1. its made FROM commercial products...so. \n2. Imagine if he had the budget measured in $Billions.\n3. You tell some gamers that this monitor is better than all the other ones on the market they will buy it.",
              "score": 1,
              "created_utc": 1741972309.0,
              "replies": [
                {
                  "id": "mht4pmm",
                  "author": "OkThanxby",
                  "body": "But it isn’t better than OLED, would end up being massive and heavy, and would cost a fortune if made from new hardware like it would if commercially made.",
                  "score": 1,
                  "created_utc": 1741983949.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mhs9zif",
      "author": "BolivianDancer",
      "body": "Except existing TVs are already great and not worth upgrading while they still work.",
      "score": 0,
      "created_utc": 1741974583.0,
      "replies": []
    },
    {
      "id": "mhyv1q9",
      "author": "None",
      "body": "I can get a used Mustang Mach-E for 20k now, why would I get a Tesla instead?",
      "score": 0,
      "created_utc": 1742066383.0,
      "replies": []
    },
    {
      "id": "mhr6pza",
      "author": "air_lock",
      "body": "I remember hearing about this a few years ago. This is not news. They are so far away from mass producing this tech that it’s little more than a pipe dream, especially given how things are going in the world right now.",
      "score": -3,
      "created_utc": 1741963238.0,
      "replies": [
        {
          "id": "mhseuac",
          "author": "gnocchiGuili",
          "body": "They are coming in 2026.",
          "score": 2,
          "created_utc": 1741976121.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mhr3rar",
      "author": "jetstobrazil",
      "body": "Ya well my new HXZ tech completely melts Sonys new RGB backlight tech. It’s just a concept for now but could lead to even more detailed displays without the drawbacks of RGB backlight.",
      "score": -2,
      "created_utc": 1741962339.0,
      "replies": []
    },
    {
      "id": "mhr4eg0",
      "author": "None",
      "body": "How does “just a concept” smoke an existing technology?",
      "score": -3,
      "created_utc": 1741962536.0,
      "replies": []
    }
  ]
}