{
  "post": {
    "title": "D-Link won’t fix critical bug in 60,000 exposed EoL modems",
    "author": "chrisdh79",
    "id": "1gqbpl1",
    "score": 777,
    "created_utc": 1731500756.0,
    "selftext": "",
    "num_comments": 99,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gqbpl1/dlink_wont_fix_critical_bug_in_60000_exposed_eol/"
  },
  "comments": [
    {
      "id": "lwwngoi",
      "author": "chrisdh79",
      "body": "From the article: Tens of thousands of exposed D-Link routers that have reached their end-of-life are vulnerable to a critical security issue that allows an unauthenticated remote attacker to change any user’s password and take complete control of the device.\n\nThe vulnerability was discovered in the D-Link DSL6740C modem by security researcher Chaio-Lin Yu (Steven Meow), who reported it to Taiwan’s computer and response center (TWCERTCC).\n\nIt is worth noting that the device was not available in the U.S. and reached end-of-service (EoS) phase at the beginning of the year.\n\nIn an advisory today, D-Link announced that it won’t fix the issue and recommends “retiring and replacing D-Link devices that have reached EOL/EOS.”",
      "score": 158,
      "created_utc": 1731500778.0,
      "replies": [
        {
          "id": "lwx1bfn",
          "author": "50calPeephole",
          "body": "Makes sense.  \n   \nYou can't expect a piece of tech to have service updates forever. However, this does open the door for a future solution for this as I'm sure there's people out there running on 10 and 15 year old routers with similar issues.",
          "score": 114,
          "created_utc": 1731506464.0,
          "replies": [
            {
              "id": "lwxzqsp",
              "author": "kiler129",
              "body": "To be fair also this device is 10-15 years old already (another poster mentioned 12). The manual literally references 802.11n and recommends Windows XP with IE6.",
              "score": 42,
              "created_utc": 1731517691.0,
              "replies": [
                {
                  "id": "lx1uzvg",
                  "author": "liftizzle",
                  "body": "And yet, Microsoft issued critical security patches multiple times for Windows XP after it reached end of life. https://www.computerworld.com/article/1723844/microsoft-sets-post-retirement-patching-record-with-windows-xp-fix-5-years-after-support-ended.html/amp/\n\nSometimes companies go out of their way to protect their customers and this should be one of those times for D-Link.",
                  "score": 11,
                  "created_utc": 1731566988.0,
                  "replies": [
                    {
                      "id": "lx28hg2",
                      "author": "humildemarichongo",
                      "body": "Genuine question, why should that be the case here?",
                      "score": 5,
                      "created_utc": 1731575786.0,
                      "replies": [
                        {
                          "id": "lx29g0u",
                          "author": "liftizzle",
                          "body": "There’s 60,000 of these bad boys around the world. The bad guys are constantly scanning the internet for vulnerable stuff to take over, services like shodan.io for example.\n\nAnyone can, at any given time, easily take over these 60,000 devices to build a large network (commonly known as a botnet). The botnet can then be used to leverage the power of the total bandwidth of those 60,000 hacked routers.\n\nNow imagine that 60,000 people go to your local bank branch today and queue outside, making it impossible to enter for the bank customers. The internet works the same way, this is known as a Distributed Denial of Service attack (DDoS).\n\nSome companies want to prevent such scenarios and not get their name dragged through the media mud. Those companies take responsibility and protect their customers even after the official end of warranty and support.\n\nD-Link doesn’t give a fuck. This is a threat to national security.",
                          "score": 4,
                          "created_utc": 1731576443.0,
                          "replies": [
                            {
                              "id": "lx2ppx1",
                              "author": "mdedetrich",
                              "body": "As an alternative viewpoint, these routers are extremely easy to replace unlike windows do (the companies using windows xp are doing so because they are likely stuck on using xp, I.e their software doesn’t run on newer windows)",
                              "score": 5,
                              "created_utc": 1731586255.0,
                              "replies": [
                                {
                                  "id": "lx2u0no",
                                  "author": "liftizzle",
                                  "body": "It depends. In Asia (where these mostly are) it is normal for ISPs to issue them and they’re whitelisted to prevent people from connecting other gear. Those customers aren’t replacing anything until their ISPs do.\n\nIn the West that might breach anti competition clause, idk.",
                                  "score": 3,
                                  "created_utc": 1731588261.0,
                                  "replies": [
                                    {
                                      "id": "lx4av1i",
                                      "author": "notfork",
                                      "body": "It is the same with ISP's in the us(as an option). You can use your own router, on some systems like coax using CMTS or GPON on CMTS they need to be white listed.\n\nAll of my ISP clients have a replacement cycle of between 2-4 years, so no they would not have 60k 15 year old routers sitting in the wild. \n\nI would consider anyone using a router that old to be OOS and require a replacement. And expecting security updates on a 15 year old router is just wishful thinking.",
                                      "score": 2,
                                      "created_utc": 1731606215.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lx2ce7h",
                              "author": "humildemarichongo",
                              "body": "That's a fair point and thank you for the view. I think the practical solution is that they have to continue support, but should the customers not also have planning around something going EOL to avoid this situation arising?",
                              "score": 1,
                              "created_utc": 1731578451.0,
                              "replies": [
                                {
                                  "id": "lx2f62z",
                                  "author": "liftizzle",
                                  "body": "The chances that most of those 60,000 devices being replaced anytime soon are slim to none. Most users of this type of low end home router don’t understand that they are affected even if you put it on the front pages.\n\nThe DSL-6740C is a combination DSL modem and router that was released in 2013. Most people have no reason to replace their network equipment every 10 years, especially DSL modems generally only get replaced when ISPs deprecate them and issue new ones, or the customer switches to an ISP that issues another one or the customer changes from DSL to fiber.\n\nISPs replacing outdated customer network gear happens mostly in the West. These devices were only sold outside the U.S. (which is also probably why D-Link doesn’t give a fuck).\n\nMost of them are in Taiwan - the primary military target of a large country notoriously known for carrying out cyber attacks, and probably the largest budget allocated to hostile activities by the State.\n\nYes, Taiwanese ISPs should replace the devices asap. But in the meantime D-Link should publish a patch so at least people have a chance to protect themselves.\n\nFrom a D-Link consumer POV, if you bought a router 11 years ago that suddenly fucked you up and D-Link refused to prevent it. Would you ever buy their products again?",
                                  "score": 6,
                                  "created_utc": 1731580270.0,
                                  "replies": [
                                    {
                                      "id": "lx4bu4b",
                                      "author": "notfork",
                                      "body": "If I bought a router over ten years ago, and it stopped receiving patches, I would consider it EoL and retire it. Routers and dsl modems do not have an infinite life span. And expecting company's to support stuff for that long seems like insanity. We do not expect our phones to get ten years of updates, and routers are much much cheaper. \n\n\nSo if ISP's are using outdated tech, that has known security issues, that is on them not on who they bought their routers from a decade ago.",
                                      "score": 3,
                                      "created_utc": 1731606508.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "lx2mr1a",
                                      "author": "humildemarichongo",
                                      "body": "Thanks!",
                                      "score": 2,
                                      "created_utc": 1731584740.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lx7lax6",
                      "author": "oshinbruce",
                      "body": "Agreed, having a bunch of your companies hardware fail isn't a good look. Only problem is people running 15 year old hardware probably aren't worried about patching",
                      "score": 2,
                      "created_utc": 1731644490.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwxdd5z",
          "author": "Just_Browsing_XXX",
          "body": "Why is the guys family name different in English?",
          "score": 5,
          "created_utc": 1731510713.0,
          "replies": [
            {
              "id": "lwxpwzw",
              "author": "askmeforashittyfact",
              "body": "He really likes cats",
              "score": 20,
              "created_utc": 1731514690.0,
              "replies": [
                {
                  "id": "lxls3bk",
                  "author": "methpartysupplies",
                  "body": "As good a reason as any",
                  "score": 1,
                  "created_utc": 1731857829.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwy2114",
              "author": "BucksEverywhere",
              "body": "I once wondered why names are translated at all in English. Some guy's name in the US counterpart of our company is Lee or so, but they call him Stan or so. They told me it's usual. I was confused af at first and didn't understand who wrote whom in a chain of mails.",
              "score": 1,
              "created_utc": 1731518384.0,
              "replies": [
                {
                  "id": "lwzutq5",
                  "author": "Programmdude",
                  "body": "Because some foreign names are extremely difficult to pronounce for english speakers, and it can be less hassle to simply use two names.\nIn your example, I wouldn't have bothered changing Lee to Stan, but what about Shi Ting (rude in english), or Ng (how?).\n\nTBH for work you should be consistent in which name you use though, because otherwise it would get so confusing.",
                  "score": 5,
                  "created_utc": 1731538196.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwy6wtb",
              "author": "BlackEric",
              "body": "Do you think Meow is his “English” last name? 🤣",
              "score": -1,
              "created_utc": 1731519864.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx22btd",
          "author": "punkalunka",
          "body": "Why does Taiwan's Computer and Response Centre (TWCERTCC) sound like someone stuffing their mouth with corn chips while yelling at someone to TWERK!",
          "score": 2,
          "created_utc": 1731571589.0,
          "replies": []
        },
        {
          "id": "lxls9uu",
          "author": "methpartysupplies",
          "body": "Yeah pretty standard.  Electronics reach obsolescence.  They’re not meant to be used forever.",
          "score": 2,
          "created_utc": 1731857891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwwzhic",
      "author": "RZ_1911",
      "body": "Affected router is 12 years old . even Cisco would not bother with EOS UPDATES .\n\n\nSecond - that problem is not really a problem .. exposing router management to internet is EXTREMELY BAD IDEA. Even on new routers with support . \n\n\nThird - if you are not exposed Management on internet - YOU ARE NOT AFFECTED . Generic deployment does not exposé management to WAN . Except if user Manually enable them in wan",
      "score": 89,
      "created_utc": 1731505775.0,
      "replies": [
        {
          "id": "lwy9i5z",
          "author": "Leafy0",
          "body": "Is it a modem or a router? Headline and article says modem, it’s normal for a modem to be managed by the isp.",
          "score": 6,
          "created_utc": 1731520644.0,
          "replies": [
            {
              "id": "lwyjv9o",
              "author": "OverSoft",
              "body": "ISP managed modems are usually managed over a separate VLAN. The management interface is not commonly accessible publicly over the internet.",
              "score": 4,
              "created_utc": 1731523765.0,
              "replies": [
                {
                  "id": "lwyxuci",
                  "author": "RZ_1911",
                  "body": "I highly doubt that there is ANY setting require CONSTANT management by isp . Usually those devices is ONE TIME configured with isp specific settings . and then those devices work till they die .",
                  "score": -2,
                  "created_utc": 1731527987.0,
                  "replies": [
                    {
                      "id": "lwyzfeq",
                      "author": "OverSoft",
                      "body": "It’s not that they require constant management, but (for example) many DOCSIS cable modems have frequency updates at least once every year, not to mention firmware updates for basebands and the device as a whole.\n\nThis isn’t rare, almost every ISP which rents out its devices does this.",
                      "score": 3,
                      "created_utc": 1731528477.0,
                      "replies": [
                        {
                          "id": "lwz2nfn",
                          "author": "RZ_1911",
                          "body": "First of all we talking about - DSL . There is nothing to change ( of i remember correctly) \n\nSecond - if ISP requires centralized settings management. They uses mass provision and automated configuration . When router  is configured to connect internal isp server for new settings and directives ( at least docsis do that ) . That does not involve web management exposed to WAN - so end user unaffected by this problem",
                          "score": -3,
                          "created_utc": 1731529475.0,
                          "replies": [
                            {
                              "id": "lwz3h8f",
                              "author": "OverSoft",
                              "body": "Yes. That’s exactly what I was saying…\n\nThat the management interface ISN’T exposed to WAN…",
                              "score": 3,
                              "created_utc": 1731529737.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwyx5aq",
              "author": "RZ_1911",
              "body": "Since affected device is VDSL. It combines modem and router functionality. Modem on VDSL site . And router (NAT) between VDSL  and internal Ethernet\\WIFI . So generic user is not affected. Unless - it have dedicated ip address and manually opened management onto internet",
              "score": 0,
              "created_utc": 1731527776.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx1ehm9",
          "author": "None",
          "body": "[deleted]",
          "score": 4,
          "created_utc": 1731558520.0,
          "replies": [
            {
              "id": "lxau3qb",
              "author": "notfork",
              "body": "Yeah, because relying on old tech is a bad idea. And routers from Gigabyte did not patch for PKfail, so you are sitting there with a big ol gaping hole in your system. Linksys did not patch anything for it made before 2019. ASUS is in a similar boat. \n\nAnd that is just one WELL known security issue. \n\nYou future proof your network by running better cables and switches than you need. Buy a router and keeping it for a decade is not something people should plan on.\n\nI am currently running an all 2.5 gig network, Ethernet and switches are rated for 10g, so when it comes time for me to upgrade my network I will just swap out the router. I bought this router this year, and I have 0 expectation of it still being used in 2030.",
              "score": 1,
              "created_utc": 1731693658.0,
              "replies": []
            },
            {
              "id": "lx1hwx0",
              "author": "RZ_1911",
              "body": "In real life most of the routers have even less lifespan . They die from hardware failure in 3-5 years . In the same timeframe that device usually losing software support . \n\nThis one lasted so long only because - long term support agreements with ISPs who buyed them. For example how many routers in 2017 got an update versus KRACK vulnerability? ( that was industry wide critical vulnerability which lead to wifi password bypass) - spoiler…. Few \n\nHow many consumer routers who received patch or manufactured later - stopped broadcast PMKID? That’s even more sad story \n\nWelcome in real world :)",
              "score": 0,
              "created_utc": 1731560089.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwwqsyw",
      "author": "challengeaccepted9",
      "body": "So two things I'd note:\n\n\n1. Time should be a factor here. I don't think anyone would reasonably expect them to issue a security patch for routers from 10 years ago. But these only reached end of life *at the beginning of the year*.\n\n\n2. If companies are going to adopt a policy of not providing support for critical flaws like this past the technical end of life date, they REALLY need to make it a matter of course to issue maybe a final, optional patch that allows people to install open source firmware on the router - if that isn't already the case. If a router is perfectly usable, save for one critical security flaw, and the open source community is able to issue a simple security patch to fix it, they should be able to.\n\n\nI appreciate the answer to the second point - and the reason it'll probably never happen is \"but then people would buy fewer routers and any goodwill brand loyalty as a result will be outweighed by the loss of new sales\".",
      "score": 44,
      "created_utc": 1731502280.0,
      "replies": [
        {
          "id": "lwx2c58",
          "author": "Mindestiny",
          "body": "End of life is end of life.  It doesn't matter when EOL hit compared to the vulnerability, it matters how long they sold and supported the devices.  There will always be a \"one more vulnerability\" past the date",
          "score": 16,
          "created_utc": 1731506847.0,
          "replies": [
            {
              "id": "lwxdil1",
              "author": "challengeaccepted9",
              "body": "Except:\n\n\n1) it isn't as simple as \"end of life is end of life\". Microsoft end of life for Windows 10 is next year - except you'll still be able to pay money for extended support. More relevantly to this, they also patched Windows XP well after end of life support, in order to address Wannacry ransomware. Even if the exploits for this critical security hole aren't as potentially disastrous as Wannacry, we're talking about issuing a security update for a product that hit EOL less than a year ago - Wannacry was patched three years after EOL.\n\n\n2) None of this prevents manufacturers from making it - if they so wished - so that hardware could have open source firmware installed that would allow others to patch it after EOL. Any required patches to allow such modifications could be made available the day before EOL if you want to be really black and white anal about what EOL actually means.",
              "score": -1,
              "created_utc": 1731510764.0,
              "replies": [
                {
                  "id": "lwxihti",
                  "author": "Mindestiny",
                  "body": "Again, EOL is EOL.  Microsoft choosing to make LTSC available for specific use cases has nothing to do with a company that made DSL routers 10 years ago, or any other company for that matter.\n\n\n\"But it was just a couple months!!!\" Doesn't mean squat.  There will always need to be a defined cutoff where support is no longer provided.\n\n\nAnd nobody is going to just open source their proprietary firmware because \"but muh EOL!!!\"",
                  "score": 10,
                  "created_utc": 1731512372.0,
                  "replies": [
                    {
                      "id": "lwxtfsl",
                      "author": "challengeaccepted9",
                      "body": "*Again, EOL is EOL.  Microsoft choosing to make LTSC available for specific use cases has nothing to do with a company that made DSL routers 10 years ago, or any other company for that matter.*\n\n\nYou're being intentionally obtuse here. Your suggestion was the end of life cutoff means literally no more support after that point. I responded that it doesn't always, actually and gave an example of a company patching serious issues YEARS after EOL.\n\n\nYou're right, D-Link doesn't need to follow Microsoft's example. They also don't need to follow your philosophy. The decision not to patch serious issues very soon after EOL is their decision alone - and one that other companies have been better at.\n\n\n*And nobody is going to just open source their proprietary firmware because \"but muh EOL!!!\"*\n\n\nYes. I literally said as much in my original comment, but thanks for adding a touch of dickishness in your reiteration there.",
                      "score": -3,
                      "created_utc": 1731515776.0,
                      "replies": [
                        {
                          "id": "lwxubxn",
                          "author": "Mindestiny",
                          "body": "You're arguing just for the sake of argument.\n\n\nThey are under no obligation to support a decade old product thats announced EOL date has passed.  That's the end of it, full stop.",
                          "score": 9,
                          "created_utc": 1731516048.0,
                          "replies": []
                        },
                        {
                          "id": "lwyln2j",
                          "author": "lurkerfox",
                          "body": "No the fact they stated was that EOL means EOL and that no further support should be expected or demanded. Microsoft wanting to be the exception to the rule and voluntarily choosing to offer extended support past EOL(that they charge $$$$ for due to the critical infrastructure that cannot be easily migrated from those old versions) is *purely* Microsofts business. Holding D-link or any other company to that standard of post-EOL support is completely and entirely *unreasonable*. \n\nWould it be nice if they decided to release a fix anyways? Sure. But absolutely nobody should be crying over it of they dont and hold it against them, because EOL is EOL.",
                          "score": 0,
                          "created_utc": 1731524293.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwwxm84",
          "author": "Waterfish3333",
          "body": "Definitely agree with number 2. Knowing US laws there would need to be legislation that the manufacturer be held harmless from anybody messing their stuff up with an unlocked device, but if a company ceases support for a product it should be unlocked.\n\nThe EOL thing though is a deadline. It’s not like they announce EOL for tomorrow, it’s well known and usually indicated months in advance at minimum, and typically over a year. So it doesn’t matter if it was the beginning of the year or yesterday. Saying “EOL was only recently reached so keep patching” means there is now a grey area of what “recently” means.",
          "score": 6,
          "created_utc": 1731505053.0,
          "replies": [
            {
              "id": "lwy9ins",
              "author": "challengeaccepted9",
              "body": "Yeah, fair enough on the liability point.\n\n\nOn end of life, Microsoft patched XP years after end of life to address Wannacry.\n\n\nI appreciate that if you buy something with an EOL date, you shouldn't *expect* support after that date. But at the same time, companies HAVE patched critical issues after EOL and much later beyond EOL than D-Link would need to in this case.",
              "score": 2,
              "created_utc": 1731520648.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwwubjh",
          "author": "None",
          "body": "[deleted]",
          "score": 13,
          "created_utc": 1731503751.0,
          "replies": [
            {
              "id": "lwwwk5q",
              "author": "Waterfish3333",
              "body": "Because they require ongoing security updates and D-Link is no longer providing those updates?",
              "score": 11,
              "created_utc": 1731504638.0,
              "replies": [
                {
                  "id": "lwxmvz5",
                  "author": "cwmshy",
                  "body": "Hail corporate! They get to decide when something is ewaste, even if it still works fine otherwise.",
                  "score": 5,
                  "created_utc": 1731513747.0,
                  "replies": []
                },
                {
                  "id": "lwwx2vb",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1731504842.0,
                  "replies": [
                    {
                      "id": "lwwy4zq",
                      "author": "Waterfish3333",
                      "body": "I mean, a gateway device that has known security issues that are not being patched isn’t “perfectly good”…\n\nThat’s like saying my front door lock is still perfectly good despite the locking pins not working. Yea, the material is still in the same shape and looks nice, but if it no longer locks then it doesn’t really do its function anymore.",
                      "score": 0,
                      "created_utc": 1731505257.0,
                      "replies": [
                        {
                          "id": "lwwzxn1",
                          "author": "Turmfalke_",
                          "body": "I think it's more like the locksmith expecting you to buy a new lock every couple of years, because he doesn't feel like serving the old.  \n\nDifference it is easy to tell whether a lock is still good, it isn't for a D-Link router. Especially when that one is still doing it's job just fine.",
                          "score": 9,
                          "created_utc": 1731505947.0,
                          "replies": [
                            {
                              "id": "lwx3fjd",
                              "author": "Waterfish3333",
                              "body": "Its not a perfect analogy because a lock is purely analog and not internet connected (there are smart locks that are internet connected but those have EOL eventually too). The best comparison would be expecting the locksmithing to come out yearly for free to service the lock.\n\nThe reality is consumer grade internet devices do have expire dates because they cost money to keep servicing, and people have shown they aren’t willing to pay a subscription to maintain devices. There are devices that get longer life, but they either have a subscription or are enterprise models which are significantly more expensive.",
                              "score": 6,
                              "created_utc": 1731507252.0,
                              "replies": [
                                {
                                  "id": "lwx71zi",
                                  "author": "Turmfalke_",
                                  "body": "Nobody expects them to develop new features or to support something they didn't 10 years ago. It's about owning up for past mistakes.  \n10 years ago they conned you into buying a faulty product and now they want nothing to do it with it. In ideal world this wouldn't happen, but when you go into a shop to buy a modem you can't reasonably scan the device for those mistakes.  \nSince the locks were a flawed analogy, lets consider a TV. You buy in a box at a shop and you take it home. Depending on where you live you now have some time to spot obvious issues (dead pixels, lines  across the screen..) and bring it back to the shop. However the TV in our example has a less obvious issue. When receives the signal to show a certain order of pictures, it overheats, catches fire and burns down your house. At the time you bought the TV no movie was using those exact pictures, but 5 years into the future one will.  \nDoes this mean we also have to throw out TVs that seemingly function just fine?\n\nWhat we as customers should expect from hardware manufactures is to do security testing when they develop their product. It shouldn't be in their interest to fix them before they ship, so they don't have to updates later on. They shouldn't bank on us only discovering them after some arbitrary cut of point in the future. If they confident in the hardware they are selling, they should be showing us the software that is running on it. Market theory expects the customer to be well informed, we are far from that.",
                                  "score": -3,
                                  "created_utc": 1731508562.0,
                                  "replies": [
                                    {
                                      "id": "lwx83sl",
                                      "author": "Waterfish3333",
                                      "body": "Tell me you have zero idea about internet security and cyber attacks without telling me you have zero idea.",
                                      "score": 9,
                                      "created_utc": 1731508931.0,
                                      "replies": [
                                        {
                                          "id": "lwx9uxe",
                                          "author": "Turmfalke_",
                                          "body": "I do think I understand a fair amount and I don't what I would like to see is less realistic then what you expect people to do.  \nYou expect everyone of those 60000 to remember that 10 years have passed and they should throw their functioning dsl modem away. That is isn't going to happen. They are going to stay connected to internet, eventually someone will break in, connect them to their bot network and maybe fixes the bug to prevent others from breaking in.  \nThe rest of us get to enjoy another 60000 IPs sending spam or running ddos attacks.\n\nI'm sure that is great.",
                                          "score": 1,
                                          "created_utc": 1731509533.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lwxar4z",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1731509837.0,
                                      "replies": [
                                        {
                                          "id": "lwxtm74",
                                          "author": "pomyh",
                                          "body": "> The modem was not faulty when it was sold\n\nIt contained the vulnerability when it was sold, so it was faulty.\n\n> engineers cannot forsee everything\n\nthat's because these days they've adopted the \"if it compiles, ship it\" mentality. Whereas back in the day they would release software that could get humans to the moon and back without the luxury of beta testing",
                                          "score": 1,
                                          "created_utc": 1731515831.0,
                                          "replies": [
                                            {
                                              "id": "lwxxytd",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": 3,
                                              "created_utc": 1731517149.0,
                                              "replies": [
                                                {
                                                  "id": "lwyb3do",
                                                  "author": "pomyh",
                                                  "body": "> There is no reasonable way the company could have forseen this vulnerability 10 years down the line. \n\nThat's an API exploit. It doesn't get more straightforward that this. Going back to the Apollo example, it was expected to foresee unexpected things back then: https://en.wikipedia.org/wiki/Margaret_Hamilton_(software_engineer)#Apollo_11_landing\n\n> The fact it took 10 years to discover is proof of that.\n\nit proves nothing:\n\n* the model wasn't available globally, so it limits the interest from the international reserachers\n* the source code is not available to the public, so it limits external testers to black box testing, whereas internal devs don't face the same issue\n* there's no confirmation that it hasn't been exploited in the wild for years already\n\n> This does not mean companies should be stuck supporting 10 year old devices for literally eternity.\n\nThis is literally the case for industries that are actually regulated. Just look at this year's Tesla seat belt recall for models dating all the way back to 2012.",
                                                  "score": 0,
                                                  "created_utc": 1731521122.0,
                                                  "replies": [
                                                    {
                                                      "id": "lwyd3hr",
                                                      "author": "None",
                                                      "body": "[deleted]",
                                                      "score": 2,
                                                      "created_utc": 1731521732.0,
                                                      "replies": [
                                                        {
                                                          "id": "lx0839t",
                                                          "author": "pomyh",
                                                          "body": "which is why other engineers don't consider software to be engineering",
                                                          "score": 0,
                                                          "created_utc": 1731542789.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lwx12j1",
                              "author": "Magnusg",
                              "body": "No lock is good. Have you not seen the lock picking lawyer?",
                              "score": -1,
                              "created_utc": 1731506370.0,
                              "replies": [
                                {
                                  "id": "lwx1ngs",
                                  "author": "Turmfalke_",
                                  "body": "Well, good enough to prevent drunkards from stumbling into your apartment.",
                                  "score": 1,
                                  "created_utc": 1731506591.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lwx8d1y",
                          "author": "pomyh",
                          "body": "Technically it was never “perfectly good” to begin with, the flaw was there even when it was brand new.",
                          "score": 5,
                          "created_utc": 1731509021.0,
                          "replies": []
                        },
                        {
                          "id": "lx2712b",
                          "author": "LBPPlayer7",
                          "body": "said security issues are in software, aka the same software that d-link arbitrarily decided to stop supporting",
                          "score": 1,
                          "created_utc": 1731574795.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwxh8lv",
          "author": "VietOne",
          "body": "Except who would develop the open source firmware?\n\n\nMost modems aren't actually locked down that much to be updated to a new firmware, just like most routers are easily flashed with custom firmware because it's a basic version check.\n\n\nWhile I don't know the exact details of this modem, the article doesn't mention that firmware is locked down. So if it's anything like just about every other DLink device, it's simply a matter of someone has to take the first step to create an open source firmware.\n\n\nAll the specs look to be public so it doesn't seem like there's anything stopping someone from making an open source firmware work with the modem.",
          "score": 1,
          "created_utc": 1731511970.0,
          "replies": [
            {
              "id": "lwybhof",
              "author": "challengeaccepted9",
              "body": "Well, obviously that's a key question. But if you go looking for it, it's amazing what kinds of gizmos people HAVE made open source firmware for.\n\n\nAnd I said they should issue a patch to make it modifiable IF it isn't already. I'm making no assumption either way. L\n\n\nMy point was one of principle, I guess. If you buy a product that relies on regular updates from the manufacturer to function/stay secure, you should be able to modify it after end of life so if anyone wants to patch security holes/maintain operability, they're able to.\n\n\nShould apply to phones, computers, smart devices, routers, everything.\n\n\nIt's such an obvious step towards sustainability, but - as I already acknowledged - it doesn't suit the business model of iterative hardware upgrades to sell at EOL.\n\n\nSo it'll never happen at any significant scale.",
              "score": 2,
              "created_utc": 1731521242.0,
              "replies": [
                {
                  "id": "lwydg69",
                  "author": "VietOne",
                  "body": "In theory that would be ideal but in practice, someone has to do the leg work. It's why even open source hardware eventually goes EOL because there's no one that is updating it.\n\n\nSure you could choose to download source and update it yourself but in reality, it's simply easier and more practical to buy newer, faster, updated hardware.\n\n\nRouter firmware is a perfect example. Although in theory there's so many routers that dd-wrt, tomato, etc support, if you have a really old router, chances are the newest versions of the firmware aren't stable. Because no one is testing and fixing issues that affect that hardware due to the handful of devs working on it. So in the end, you're stuck on old firmware anyway and if there is a security flaw, you're equally screwed as this scenario.\n\n\nMy point is, open source doesn't automatically make something useful past it's EOL. Someone has to find it worthwhile to keep the device alive by supporting it xontinuously. And unfortunately devices that get support are generally the higher end enthusiast devices with more CPU, RAM and features that someone wants to keep alive.",
                  "score": 0,
                  "created_utc": 1731521837.0,
                  "replies": [
                    {
                      "id": "lwyf50f",
                      "author": "challengeaccepted9",
                      "body": "*My point is, open source doesn't automatically make something useful past it's EOL*\n\n\nNo, it doesn't. But I explicitly said my point was one of principle.\n\n\nIf products are always modifiable after EOL, there are none of the barriers that there are now.\n\n\nI have a cheap smartphone from 2017 that is still receiving updates. Because of the open source community - and because the manufacturer didn't lock people out of doing it.\n\n\nNo, it doesn't mean it'll get them forever. But if the open source community stops developing updates for a device: \n\n\n1) I still have the option to do it myself, if I have the expertise. And obviously security patches are a ton less work than full system version upgrades.\n\n\n2) I can't hold anyone responsible for the fact this perfectly functional device is no longer reliable, from a security perspective. The advertised EOL has passed, the vendor isn't stopping anyone fixing security holes - there just isn't the expertise and/or motivation. At the moment, the second criteria isn't happening, so the third is academic.",
                      "score": 2,
                      "created_utc": 1731522347.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwwxkuz",
      "author": "PancAshAsh",
      "body": "End of Life means End of Life. You don't use Windows 7 without expecting some security flaws either.",
      "score": 38,
      "created_utc": 1731505038.0,
      "replies": [
        {
          "id": "lwxr9x1",
          "author": "PREMIUM_POKEBALL",
          "body": "Except Microsoft did it for 2003/xp years after the fact.  It’s not unprecedented, But there’s a really high fucking bar. ",
          "score": 7,
          "created_utc": 1731515112.0,
          "replies": [
            {
              "id": "lwy82nq",
              "author": "None",
              "body": "And they charge through the nose for it. If you're willing to drop millions into D-links accounts then they will most likely oblige too.",
              "score": 5,
              "created_utc": 1731520215.0,
              "replies": [
                {
                  "id": "lx2ev0g",
                  "author": "LBPPlayer7",
                  "body": "the security patches were free",
                  "score": -1,
                  "created_utc": 1731580068.0,
                  "replies": [
                    {
                      "id": "lx2xklh",
                      "author": "None",
                      "body": "[Google says no.](https://thehackernews.com/2014/03/banks-to-pay-microsoft-millions-of.html?m=1)",
                      "score": 3,
                      "created_utc": 1731589770.0,
                      "replies": [
                        {
                          "id": "lx84fkm",
                          "author": "LBPPlayer7",
                          "body": "i'm talking about the critical ones, i.e. the emergency eternalblue patch in 2017\n\nyou're talking about general extended support, which yes, businesses had to pay for",
                          "score": 1,
                          "created_utc": 1731653339.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwy0773",
          "author": "Rockfest2112",
          "body": "Use it everyday day on the in telnet and have since it’s last update.  Never had a problem.",
          "score": -2,
          "created_utc": 1731517829.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwwnv1k",
      "author": "chibiace",
      "body": "wont be buying or recommending a d-link to anyone ever. basically planned obsolescence with this policy even if the hardware is fine.",
      "score": 20,
      "created_utc": 1731500963.0,
      "replies": [
        {
          "id": "lwwye84",
          "author": "sarhoshamiral",
          "body": "How long a manufacturer should support their product in your opinion? And how much more are you willing to pay for it because such support costs money and resources.\n\nEOL usually is 5 or 10 years now.",
          "score": 16,
          "created_utc": 1731505356.0,
          "replies": [
            {
              "id": "lwz6pbb",
              "author": "nomnomnomnomRABIES",
              "body": "As long as a wristwatch. They can charge for updates after a certain period but if the hardware still works and is adequate for the customers needs they should be able to still use it instead of it being sent to landfill. A router is no longer cutting edge tech.",
              "score": 4,
              "created_utc": 1731530733.0,
              "replies": []
            },
            {
              "id": "lwx6nw5",
              "author": "Pauly_Amorous",
              "body": "> And how much more are you willing to pay for it because such support costs money and resources.\n\nThat's fine, but a device like this needs a big sticker on it with an 'expiration date', so consumers know when it's no longer being supported.",
              "score": 5,
              "created_utc": 1731508422.0,
              "replies": [
                {
                  "id": "lwx7pq9",
                  "author": "sarhoshamiral",
                  "body": "The EOL policies are listed on websites already. We don't need giant stickers everywhere, they don't do any good.",
                  "score": 4,
                  "created_utc": 1731508796.0,
                  "replies": [
                    {
                      "id": "lwx9z0s",
                      "author": "Pauly_Amorous",
                      "body": "> The EOL policies are listed on websites already. \n\nHow is your average rube supposed to know to check a website for EOL, or even that their router needs security updates to stay current? Having an insecure router has the potential to do a lot of damage and directly harm people, because who knows what attackers will do with it.",
                      "score": 2,
                      "created_utc": 1731509572.0,
                      "replies": [
                        {
                          "id": "lwxalq8",
                          "author": "sarhoshamiral",
                          "body": "And you think that average consumer will care about an end of life sticker that's ~5 years away or even notice it? Average consumer is clueless about this stuff anyway, even if there was a sticker they would just forget it and run the router. That's just the reality about average consumer. There is a reason phishing works so well because people ignore warnings, stickers.\n\nFor those who care, the information is readily available with a quick Google search.",
                          "score": 1,
                          "created_utc": 1731509785.0,
                          "replies": [
                            {
                              "id": "lwxbnm7",
                              "author": "Pauly_Amorous",
                              "body": "> And you think that average consumer will care about an end of life sticker that's ~5 years away or even notice it? \n\nAssuming they glance at the router occasionally to get the wifi password, they would notice it. And even if they don't, at least the manufacturer has done their due diligence to let people know that the hardware has a shelf life that might end long before the device itself stops working.",
                              "score": 1,
                              "created_utc": 1731510142.0,
                              "replies": [
                                {
                                  "id": "lwyly6a",
                                  "author": "lurkerfox",
                                  "body": "The manufacturer has already done their due diligence posting it to their website.",
                                  "score": -3,
                                  "created_utc": 1731524385.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwx2776",
              "author": "burnin_potato69",
              "body": "Difference to a car perhaps is that you can't take it to a garage to repair it. You can't update the firmware yourself after EoL support.",
              "score": 1,
              "created_utc": 1731506795.0,
              "replies": [
                {
                  "id": "lwx2x3s",
                  "author": "sarhoshamiral",
                  "body": "Sure but it doesn't cost as much as a car either. Also, what you said for cars doesn't apply anymore either.\n\nFirst of all for really old cars, challenge was always to find replacement parts but now with new cars a lot more electronics and software is involved so you won't be getting them repaired either at a shop.",
                  "score": 7,
                  "created_utc": 1731507064.0,
                  "replies": [
                    {
                      "id": "lwyva1v",
                      "author": "chibiace",
                      "body": "I've bought a car cheaper (second hand mind you) than some consumer routers these days, plenty of enterprise gear would be well up there.\n\nand had a decades old car get its airbags replaced for free because of a safety problem",
                      "score": 3,
                      "created_utc": 1731527213.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwwsbuz",
          "author": "kamalamading",
          "body": "If I am not mistaken, the affected modems are more than 10 years of age… Get real.",
          "score": 25,
          "created_utc": 1731502933.0,
          "replies": []
        },
        {
          "id": "lwwqoyt",
          "author": "NorysStorys",
          "body": "While I understand the sentiment but also it also unreasonable to expect free support and updates for products in perpetuity, it would skyrocket buy in prices and is a big part of why business and enterprise gear is more expensive, you are paying for the extended support the products have, that however isn’t feasible for the vast majority of the consumer market.\n\nAnd in regards to security, if that’s something that’s required or important, you should be on a regular upgrade cadence anyway as best practice is to phase out any tech that is older as exploits are more likely to have been found and not every exploit can be patched out.\n\nI absolutely agree that tech needs longer shelf lives in order to combat e-waste but support for products in perpetuity also isn’t a good answer either.",
          "score": 10,
          "created_utc": 1731502232.0,
          "replies": [
            {
              "id": "lwwrp8x",
              "author": "chibiace",
              "body": "they seem to indicate people are still using them. this isnt any feature update its a critical security flaw.\n\nand its not like they would be used forever anyway.",
              "score": 2,
              "created_utc": 1731502666.0,
              "replies": []
            },
            {
              "id": "lwwqyr1",
              "author": "Merwenus",
              "body": "Bullshit. Don't make 500 devices if you can't maintain them.",
              "score": 0,
              "created_utc": 1731502351.0,
              "replies": [
                {
                  "id": "lwwsh7t",
                  "author": "kamalamading",
                  "body": "The affected modems are over 10 years old. How long should a company maintain them?",
                  "score": 15,
                  "created_utc": 1731502994.0,
                  "replies": [
                    {
                      "id": "lwwsunn",
                      "author": "Merwenus",
                      "body": "Till it get obsolete to the point Noone uses it anymore.\nAnd since most internet world wide is below 100mbit....",
                      "score": -14,
                      "created_utc": 1731503149.0,
                      "replies": [
                        {
                          "id": "lwwt9gj",
                          "author": "kamalamading",
                          "body": "That’s very unrealistic and impractical. 10 years are a sufficient time to let a product of this class go.",
                          "score": 19,
                          "created_utc": 1731503319.0,
                          "replies": [
                            {
                              "id": "lwwxqa7",
                              "author": "Waterfish3333",
                              "body": "You can tell people that have zero clue about business management and expenses.",
                              "score": 14,
                              "created_utc": 1731505097.0,
                              "replies": []
                            },
                            {
                              "id": "lwwwkwb",
                              "author": "slight_digression",
                              "body": "If it is working properly and is adequate for the task, why? More profits for the company and e-waste for everyone else?",
                              "score": -6,
                              "created_utc": 1731504645.0,
                              "replies": [
                                {
                                  "id": "lwx0e3v",
                                  "author": "kilowhom",
                                  "body": "Because security flaws in old devices are an inevitability. \n\nYou don't wait until you have an emergency to replace a device. You keep it up to industry standards proactively.\n\nThat is, if you give a shit.",
                                  "score": 9,
                                  "created_utc": 1731506119.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwxaj57",
          "author": "shalol",
          "body": "In that case you won’t be buying any router ever again, because you may find literally no company is willing to provide security patches for 12yo cheap routers.",
          "score": 1,
          "created_utc": 1731509762.0,
          "replies": []
        },
        {
          "id": "lwxb490",
          "author": "_Keo_",
          "body": "I just upgraded all my Ubiquity hardware. Old stuff still works great but I wanted the new features and 2Gb+ throughput. I would bet that a 12yr old DSL6740C so slow by today's standards that it's a chokepoint in any modern network.    \n\nThis isn't planned obsolescence, this is the progression of tech. I have a friend who uses a 1930's Ford Model A as his daily driver. Can't really blame Ford that they no longer stock parts for it when it breaks down.    \n\nHell, some people buy a new cell phone every year. You still using that flip phone you bought in the 90's?",
          "score": -1,
          "created_utc": 1731509961.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwxb8ka",
      "author": "N3utro",
      "body": "The real problem with eol / eos is that 95% of users have no idea what it is, why it's important and there are often no warnings displayed when it reaches eos, so users dont even know it's dangerous to keep using their products. \n\nMy aunt was using an internet connected eos nokia windows phone, unaware that all her data were probably openly accessible on internet, and the last update on her phone didnt display any warning",
      "score": 2,
      "created_utc": 1731510001.0,
      "replies": [
        {
          "id": "lz9i6cs",
          "author": "LordGarak",
          "body": "Exactly, network infrastructure can stay in service for decades. Just few years ago I noticed my parents were still using the same DSL modem from ~1998. It was 20 years old at the time I pointed it out to them, they called and they got fiber installed at no additional cost. The router had been replaced a few times over the years.",
          "score": 1,
          "created_utc": 1732725186.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lx0jf74",
      "author": "ThatInternetGuy",
      "body": "Yeah, it's your job to install OpenWRT or DD-WRT on discontinued routers or even on newly bought routers.",
      "score": 2,
      "created_utc": 1731546795.0,
      "replies": []
    },
    {
      "id": "lwxeajo",
      "author": "Kosmos992k",
      "body": "D-Link, what a bunch of guys, so reliable..",
      "score": 0,
      "created_utc": 1731511017.0,
      "replies": []
    },
    {
      "id": "lwwoh8m",
      "author": "tblazertn",
      "body": "Not gonna lie, at first glance I thought it was old dialup moderns the article was going to talk about.",
      "score": 0,
      "created_utc": 1731501248.0,
      "replies": []
    },
    {
      "id": "lwwuaww",
      "author": "Jamie00003",
      "body": "Is D-link the same as TP link?\n\nJust cos I had some tp link power line adapters once upon a time, they disconnected constantly and there was a firmware fix, but it was only released in specific regions. Absolute trash company",
      "score": -6,
      "created_utc": 1731503744.0,
      "replies": [
        {
          "id": "lwx0w4t",
          "author": "matteventu",
          "body": "No, entirely different companies.",
          "score": 7,
          "created_utc": 1731506305.0,
          "replies": []
        }
      ]
    }
  ]
}