{
  "post": {
    "title": "Scalpers already charging double with no refunds for GeForce RTX 5090",
    "author": "a_Ninja_b0y",
    "id": "1i8wrcp",
    "score": 4083,
    "created_utc": 1737729331.0,
    "selftext": "",
    "num_comments": 477,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i8wrcp/scalpers_already_charging_double_with_no_refunds/"
  },
  "comments": [
    {
      "id": "m8x2057",
      "author": "spreadthaseed",
      "body": "“No refunds”.. since when did scalpers EVER offer refunds?",
      "score": 2180,
      "created_utc": 1737730267.0,
      "replies": [
        {
          "id": "m8x8s1y",
          "author": "OvenFearless",
          "body": "Seriously. They might as well write “No blowjobs” and it would’ve been equally unnecessary information \n\nAlthough obviously the fans still blow air so it is definitely doing its job but just to make sure I am not being misunderstood.",
          "score": 732,
          "created_utc": 1737732274.0,
          "replies": [
            {
              "id": "m8x9b0n",
              "author": "spreadthaseed",
              "body": "Scalpers will not swallow after payment.",
              "score": 110,
              "created_utc": 1737732425.0,
              "replies": [
                {
                  "id": "m8xe2hh",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 17,
                  "created_utc": 1737733780.0,
                  "replies": [
                    {
                      "id": "m8xi1sz",
                      "author": "Narrow-Chef-4341",
                      "body": "More like the STi Edition…*YEEEAAAHHHH*\n\n\\- David Caruso, probably.",
                      "score": 29,
                      "created_utc": 1737734899.0,
                      "replies": [
                        {
                          "id": "m8yfq8g",
                          "author": "RyanGoslingsJacket",
                          "body": "![gif](giphy|l46CbjgsqyGfJxrxK)",
                          "score": 1,
                          "created_utc": 1737744208.0,
                          "replies": []
                        },
                        {
                          "id": "m90zkfi",
                          "author": "morning_thief",
                          "body": "![gif](giphy|xPGkOAdiIO3Is)",
                          "score": 1,
                          "created_utc": 1737772327.0,
                          "replies": []
                        },
                        {
                          "id": "m91fahj",
                          "author": "FrosttheVII",
                          "body": ">*YEEEAAAHHHH*\n\n*Lil Wayne flashbacks*\n\n![gif](giphy|BcPbK9ci4EU31qUTkR)",
                          "score": 1,
                          "created_utc": 1737778256.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m908gb4",
                  "author": "DuckDatum",
                  "body": "Okay, but what about before payment?",
                  "score": 1,
                  "created_utc": 1737763118.0,
                  "replies": []
                },
                {
                  "id": "m91e2kw",
                  "author": "None",
                  "body": "No but I will",
                  "score": 1,
                  "created_utc": 1737777756.0,
                  "replies": []
                },
                {
                  "id": "m9lzcln",
                  "author": "None",
                  "body": "Enshitification :(",
                  "score": 1,
                  "created_utc": 1738056271.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xegwi",
              "author": "MixSaffron",
              "body": "You just haven't bought a scalped card from me yet ;)\n\nJust kidding, fuck scalpers!!! I really wish that more organizations would put limits on products but they like money.",
              "score": 24,
              "created_utc": 1737733894.0,
              "replies": [
                {
                  "id": "m8yxti7",
                  "author": "TheNotNiceAccount",
                  "body": "It ended up [backfiring](https://gamerant.com/ps5-pro-scalpers/#:~:text=Summary,due%20to%20high%20costs%20involved.) with the PS5 Pro.\n\nPerhaps the same thing will happen with these cards.  Surely, you don't need to pay double for a 5090, regardless of your overall financial standing.\n\nAt least, I hope a large majority will see reason, and the scalpers end up holding the bag.",
                  "score": 14,
                  "created_utc": 1737749303.0,
                  "replies": [
                    {
                      "id": "m915hrk",
                      "author": "antara33",
                      "body": "Yeah, on my end at least I'll wait till mid year. Want to see the different AIBs out in the wilds for some months and failure rate, exoerience after some usage, etc before letting my 4090 go.",
                      "score": 6,
                      "created_utc": 1737774471.0,
                      "replies": []
                    },
                    {
                      "id": "m978b09",
                      "author": "JoeyBigtimes",
                      "body": "Nobody will ever see reason. Ever. Never count on others changing or getting smarter.",
                      "score": 2,
                      "created_utc": 1737858394.0,
                      "replies": []
                    },
                    {
                      "id": "m92xzk0",
                      "author": "mojeaux_j",
                      "body": "If they scalp right they just return the unsold items instead of taking a hit. They can't even do that right though and end up tanking their own market.",
                      "score": 1,
                      "created_utc": 1737808729.0,
                      "replies": []
                    },
                    {
                      "id": "m935rp1",
                      "author": "kerbaal",
                      "body": "I always find it weird and toxic to wish somebody else fails. Scalpers are not the ones bringing a product to market and charging under what people are willing to pay and under what it would cost to keep them in stock.\n\nScalpers are providing a service.",
                      "score": -5,
                      "created_utc": 1737812152.0,
                      "replies": [
                        {
                          "id": "m93ntfs",
                          "author": "TheNotNiceAccount",
                          "body": "We 100% disagree there.  That is not a service.\n\nAnd I do not find it \"toxic\" to wish an arsonist fails.  Or a murderer.  Or a scalper.  I can go on, but I think we all get the point.",
                          "score": 2,
                          "created_utc": 1737818599.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8xdtx8",
              "author": "Phormitago",
              "body": "Lactose free scalpers yep",
              "score": 4,
              "created_utc": 1737733712.0,
              "replies": []
            },
            {
              "id": "m8xwfe5",
              "author": "TheLuminary",
              "body": ">Seriously. They might as well write “No blowjobs” and it would’ve been equally unnecessary information\n\nYou are just not buying from the right scalpers.",
              "score": 7,
              "created_utc": 1737738864.0,
              "replies": []
            },
            {
              "id": "m8y7p1g",
              "author": "Spacecowboy78",
              "body": "I want to put \"No Blowjobs\" on all my invoices now.",
              "score": 3,
              "created_utc": 1737741975.0,
              "replies": []
            },
            {
              "id": "m8xp436",
              "author": "pberck",
              "body": "Scalpers suck though",
              "score": 2,
              "created_utc": 1737736840.0,
              "replies": []
            },
            {
              "id": "m92nku2",
              "author": "duderos",
              "body": "Your scalper is sure ripping you off if you haven't gotten one with a card purchase.",
              "score": 2,
              "created_utc": 1737802910.0,
              "replies": []
            },
            {
              "id": "m8y0sdu",
              "author": "parks387",
              "body": "[wait…](https://i.imgflip.com/9htxm3.gif)",
              "score": 2,
              "created_utc": 1737740071.0,
              "replies": []
            },
            {
              "id": "m8yesux",
              "author": "novaMyst",
              "body": "Not sure what you are talking about my scalper lets me give them a blowjob anytime i buy anything.",
              "score": 1,
              "created_utc": 1737743951.0,
              "replies": []
            },
            {
              "id": "m902ckh",
              "author": "pessimistoptimist",
              "body": "Well thats a dealbreaker...i always go into negotiations thinking 'theres always a chance'",
              "score": 1,
              "created_utc": 1737761161.0,
              "replies": []
            },
            {
              "id": "m90mjns",
              "author": "HeftyArgument",
              "body": "If it doesn’t come with a blowjob, I’m not buying",
              "score": 1,
              "created_utc": 1737767791.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xl43p",
          "author": "Firstprime",
          "body": "Everyone should be aware that If a product is sold through eBay then the seller can only decline returns/refunds if it is for change of mind. If you receive a damaged/defective/deceptive product you can ALWAYS pursue a return/refund on eBay, regardless of what the seller writes in the listing. If you have a valid reason and the seller declines to accept the return then eBay will step in and force a refund.\n\nYou should also have similar protections any time you purchase a product using PayPal to process the payment - as long as you don't use the \"Friends and Family\" option. This is also the case for many other vendors and payment platforms. You might need to jump through some hoops to file a claim, but you will get there. Be aware of your rights as a consumer, and don't let dishonest sellers take advantage of you.",
          "score": 78,
          "created_utc": 1737735745.0,
          "replies": [
            {
              "id": "m8xrwlx",
              "author": "spreadthaseed",
              "body": "Yea that’s not the scalper themselves. Thats the marketplace/ platform",
              "score": 11,
              "created_utc": 1737737605.0,
              "replies": []
            },
            {
              "id": "m8xtmef",
              "author": "alidan",
              "body": "ebay, and if you use paypal, near universally settles with the buying instead of the seller. \n\nbrother sold headphones on ebay, around 800$, sell had seconds thoughts once he got them and claimed they smelled like cigarettes and weed (he does neither of these things) and ebay/paypal sided with him, ate all fees my bother had to pay for selling and fucked him over.",
              "score": 14,
              "created_utc": 1737738080.0,
              "replies": [
                {
                  "id": "m8y15fa",
                  "author": "jjayzx",
                  "body": "Sold an rov/underwater drone on ebay. Guy says it doesn't work and won't take charge, everything was fine when I shipped it. Sends it back and most things look like the way I packed it. I notice the guy is in same facebook group as me for these underwater drones. He already has a larger version from same company and I did some digging and the larger one has same plug but like double the voltage. He fried my shit and ebay and PayPal could give 2 shits, just said send him invoice of repair. Which of course he just played off. I've taken the drone and hub apart and both had the same diode on power input blown.",
                  "score": 25,
                  "created_utc": 1737740171.0,
                  "replies": [
                    {
                      "id": "m8y3y2t",
                      "author": "alidan",
                      "body": "there is some stuff you can do/info you can get, there are some youtube channels that go into rare games and ebay screwing them, but they tell you how to get the info you need to go after the people. \n\nwire fraud seems to not have a dollar amount associated with it, going after them for it would be difficult, but not undoable, especially because you could easily prove they damaged it.  \n\nin my brothers case, ill be honest, the headphones were 800$ value but were simbalant as hell, painful to listen to certain songs, I would not have paid more than 100$ for them, especially at the time because I also had blessing 2's and realistically, even 20$ salnotes zeros sounded better (not as clear but tone wise better) \n\nif I bought them and put them on my head and they sounded like that, I would have severe buyers remorse as well. \n\nbut my brothers problem isn't with the buyer, he fully understands why someone would send it back and want a refund, his problem is with ebay not refunding the commission or paypal fees.",
                      "score": 6,
                      "created_utc": 1737740942.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m91s3vl",
                  "author": "homanagent",
                  "body": "It's true they usually side with the buyer, and for good reason. But this is not universal or in all cases.\n\nI've had eBay and Paypal side with me in a dispute because I provided the documentation to prove I was right, and because I had a decently old account (2001 I think).",
                  "score": 1,
                  "created_utc": 1737784039.0,
                  "replies": []
                },
                {
                  "id": "m95fq35",
                  "author": "theycmeroll",
                  "body": "Yeah this is the main reason I quit selling on eBay, because of the general idiocy of buyers, and the me getting penalized for it. I think people have gotten so used to just impulse buying off sites like Amazon and Walmart and just retuning it if it isn’t right they are taking that mentality to eBay now and it screws over sellers. Then you got the ones that fully intend to defraud the seller. \n\nI have never tried to defraud or mislead someone and put all the information possible in my listings, but it never fails someone will buy something with no clue what it is and then get upset because it’s not what they wanted. \n\nWhen I finally threw in the towel was when I sold a PS4 on eBay, they buyer got it and said it didn’t work, I know damn well it worked, of course I said send it back, they sent me a tiny padded envelope with a picture of a smiley emoji in it. eBay said it shows the item was delivered to me, so that’s that. \n\nYou can see the idiocy in Amazon reviews as well. Like you can read the items description that clearly says what it does it doesn’t do, and gives important details and inevitably you will see multiple 1 star reviews complaining about something that was clearly stated in the description.",
                  "score": 1,
                  "created_utc": 1737837251.0,
                  "replies": [
                    {
                      "id": "m98x1ui",
                      "author": "alidan",
                      "body": "Im going to be fair on the amazon side given some underwear I bought, fruit of the loom, I measured my waist, bought the right size, they shipped it, every pair fit perfectly, they they went through the wash. \n\nthe grey ones shrunk a bit but are still wearable\n\nthe blue ones shrunk to the point they barely fit with about 1/5th a crack showing, this is acceptable but going from perfect to acceptable was a major blow when the shit cost 40$\n\nthe dark blue ones shrunk to the point that it covers barely half my ass or my crotch is exposed and 1/3 of my ass is showing... they shrank to the point they are panties. \n\neven if you correctly label everything, the person who gets it may expect a hell of alot more or just put up with what they get. I found natural feelings as a replacement, these are perfect and didn't shrink by a noticeable amount after being washed, got 7 pairs for the same price.\n\nalso with amazon you have to take into account people completely changing store pages after the fact, or in the case of electronics, not actually getting what you paid for, this has worked out in my favor of getting something higher end, and worked against me in the passed when I got a mouse that was obviously a counterfeit, there is a fun video on youtube by I forget who about this... it was a fun video where it took 3 or 4 attempts before they got an actual product, you also have cases where the factory workers themselves swap the products, or cases like samsung sd cards where they get counterfeited to the point even retail gets counterfeit versions without knowing it.\n\nit's really hard to say consumer stupidity for everything, its one of the reasons I really like smart usbc charging, I remember barrel jacks, I remember wal warts that god knows if it supply's enough or too much, the sooner we move to usbc everything with a smart charger so it knows how much to deliver to whatever is on the other end, the better, hell there are projects that replace barrel jacks for usb c granted its not one size fits all sadly. \n\nnow on the ebay side, I honestly wonder if there is money to be made in a third party seller that can verify something works and function as the middleman in sales. the problem with that would probably be the risk of that becoming used as a fence, but it's possible that this kind of a service where confirmed working goes in, confirmed working goes out, and could probably institute a no return policy of sorts.",
                      "score": 1,
                      "created_utc": 1737888253.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8zrynm",
              "author": "Fredasa",
              "body": "Gotta wonder how that hard protective policy pans out for people buying from sellers in China.",
              "score": 2,
              "created_utc": 1737757949.0,
              "replies": [
                {
                  "id": "m8zz6d1",
                  "author": "Firstprime",
                  "body": "At least for eBay it shouldn't make a difference. The buyer protection policies will be based on whichever regional eBay site you use to make the purchase. The location of the seller doesn't matter.\n\nIf you're buying directly through a Chinese vendor/marketplace it would probably be a very different story.",
                  "score": 1,
                  "created_utc": 1737760156.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m90brf5",
          "author": "clmsteamer",
          "body": "This what happens when AI starts writing briefs for freelancers.",
          "score": 3,
          "created_utc": 1737764197.0,
          "replies": []
        },
        {
          "id": "m8xvveb",
          "author": "Careless-Working-Bot",
          "body": "Alright \n\nOwn up \n\nWho among you all can afford this\n\nIn this economy...\n\nLike what do you all do for a living \n\nHow old are you all, I am barely holding on to my job\n\nYou guys tapping into your inheritance/ bar mitzwa bonds/ sold or flipped houses..?\n\nI can't think of a non IT crowd being able to save and spend on such silicon in this economy, y'all would just prefer a ps5 rather than build a pc with the graphics card that costs a months rent in a med col city\n\nSo come on , spit it out\n\nWhat do you do for a living, how old are you all who can afford this $#!t",
          "score": 4,
          "created_utc": 1737738710.0,
          "replies": [
            {
              "id": "m8y8q59",
              "author": "lowercaset",
              "body": "I'm like a gastroenterologist, but for buildings. Bout 40. (Wife, 2 kids, mortgage, etcetc)",
              "score": 8,
              "created_utc": 1737742262.0,
              "replies": [
                {
                  "id": "m8y99cr",
                  "author": "Careless-Working-Bot",
                  "body": "Alright man\n\n\nThat's a demographic I never thought would buy and assemble a PC with a big fat graphic card innit",
                  "score": -6,
                  "created_utc": 1737742409.0,
                  "replies": [
                    {
                      "id": "m8ya8t0",
                      "author": "lowercaset",
                      "body": "I know a number of plumbers, sparkies, and tin knockers who are big ol nerds. It's not the average guy but probably about 1 in 40 or so. Usually the ones who trend towards the more technical and tricky parts of the trade.\n\nI'm also convinced that spending thousands on tools also desensitizes to spending a grip on a hobby. Doesn't hurt the pays pretty decent generally if you've been doing it awhile.",
                      "score": 6,
                      "created_utc": 1737742686.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m91l4hw",
              "author": "korewednesday",
              "body": "Mortician, 30.  Lotta studies saying gaming trends waaaaay older than perceived by those both in and outside it.  As you kinda pointed out, that’s who’s got the money for it.\n\nI’m waffling on whether or not I want to, because I juuuuuuust plunked a card in my build, so I could probably get an okay resale on it, but that’s also such a pain in the ass.  Or I could give it to my partner to make room for the 5090 in mine and I’d still be all right, but, again, pain in the ass (and this time, expensive pain in the ass).  And my partner can afford a GPU upgrade independently anyway.\n\nI’ll probably sit this round out and take a look again early/mid-cycle 60x0s instead.",
              "score": 3,
              "created_utc": 1737780742.0,
              "replies": []
            },
            {
              "id": "m8y6jd4",
              "author": "Knubbelwurst",
              "body": "I'm in my late 30s, working for an average pay in software engineering. I could afford 4000€ for the 5090 without touching my savings. \n\nDo I want to? I'm still very happy with my 3080ti I've bought for 1400€ during the pandemic. And tbh, though it did not hurt financially, it was still too much money. It was not even from a scalper, it was from Media Markt.\n\nIt's like coffee offered for more than 5€. I could afford it easily. Daily. But I know it's wasted money and don't want to feed greedy as\\*holes.",
              "score": 8,
              "created_utc": 1737741650.0,
              "replies": []
            },
            {
              "id": "m9820nx",
              "author": "None",
              "body": "Anesthesiologist. I could buy one of these with my pocket change. But like the other guy on here said, just because I have money doesn’t mean I like to waste it.",
              "score": 2,
              "created_utc": 1737870255.0,
              "replies": [
                {
                  "id": "m98gzam",
                  "author": "Careless-Working-Bot",
                  "body": "Hello there\n\nI heard that's one of the best paid professions \n\nYou can buy this with chump change, that said so you use it?",
                  "score": 1,
                  "created_utc": 1737878467.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m916az9",
              "author": "Shadowlance23",
              "body": "Data architect, so yeah, IT. I've got the 4090 though and sit out every other generation, so I'll wait for the 6090 which will probably also be the cost.",
              "score": 1,
              "created_utc": 1737774767.0,
              "replies": []
            },
            {
              "id": "m8xxlb1",
              "author": "None",
              "body": "[deleted]",
              "score": -17,
              "created_utc": 1737739184.0,
              "replies": [
                {
                  "id": "m8xyezr",
                  "author": "Careless-Working-Bot",
                  "body": "Paycheck to paycheck \n\nAnd a couple of emergencies every quarter takes care of that",
                  "score": 5,
                  "created_utc": 1737739411.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8y5b4t",
          "author": "Korlod",
          "body": "Right?  But seriously, all we have to do is stop paying the prices they’re demanding and it’ll stop…",
          "score": 1,
          "created_utc": 1737741313.0,
          "replies": []
        },
        {
          "id": "m90csn0",
          "author": "Radulno",
          "body": "Depends where and how their business is setup (aka not if they sell as an individual on ebay for example) but they are obligatory in many places.",
          "score": 1,
          "created_utc": 1737764534.0,
          "replies": []
        },
        {
          "id": "m8yjg5f",
          "author": "beziko",
          "body": "In EU you have to give refunds so scalpels can't even do that.",
          "score": 1,
          "created_utc": 1737745236.0,
          "replies": [
            {
              "id": "m8ykpgc",
              "author": "spreadthaseed",
              "body": "EU is pro consumer rights lol \n\nUS/ Canada is a whole other circus",
              "score": 1,
              "created_utc": 1737745589.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xdwh6",
          "author": "Uhkaius",
          "body": "Get the card > charge back > ??? > Profit!",
          "score": -5,
          "created_utc": 1737733733.0,
          "replies": [
            {
              "id": "m8xkm1q",
              "author": "MattyIce260",
              "body": "??? = chargeback denied",
              "score": 5,
              "created_utc": 1737735609.0,
              "replies": [
                {
                  "id": "m8xtsmr",
                  "author": "alidan",
                  "body": "chargebacks aren't denied, however you open yourself up to wirefraud along with a blacklisting from the business you charge back.",
                  "score": 1,
                  "created_utc": 1737738128.0,
                  "replies": [
                    {
                      "id": "m8xu7fr",
                      "author": "MattyIce260",
                      "body": "They definitely can be denied. Usually on a package delivery over a certain dollar amount a signature is required, which is very hard to overcome in a chargeback review",
                      "score": 3,
                      "created_utc": 1737738244.0,
                      "replies": [
                        {
                          "id": "m8y251f",
                          "author": "alidan",
                          "body": "I have had a 7000$ delivery be left on my doorstep, certain dollar amounts don't mean anything for a package needing a signature, hell even paying for signature required doesn't imply signature will be required.",
                          "score": -1,
                          "created_utc": 1737740445.0,
                          "replies": [
                            {
                              "id": "m8y2zod",
                              "author": "MattyIce260",
                              "body": "FedEx requires signature on any package with a declared value over $500. eBay requires a signature on all sales over $750. So while you might not have to sign in all instances, in most cases you will. \n\n\nI’ve been selling on eBay and Amazon for about a decade and never lost a single dollar to a chargeback dispute, so if you think charging back is an automatic win than I have some bad news for you sir",
                              "score": 1,
                              "created_utc": 1737740680.0,
                              "replies": [
                                {
                                  "id": "m8z8owo",
                                  "author": "alidan",
                                  "body": "a chargeback is effectively a battle of fuck around and find out because what comes after it is going to court if you push it, and I can tell you this now given how often I have ordered crap over 500$ only to get it left on a doorstep or never even asking for a signature from fedex, I dont think its a hard requirement or the people delivering by me have stopped caring at all. \n\nbut I did have something 10$ once require a signature.",
                                  "score": 1,
                                  "created_utc": 1737752406.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8x0tlk",
      "author": "Cactuszach",
      "body": "Not like 4090s aren’t still being scalped too.",
      "score": 497,
      "created_utc": 1737729900.0,
      "replies": [
        {
          "id": "m8x3cli",
          "author": "mr_chip_douglas",
          "body": "Right? When everyone was so excited about the “low” pricing, my first thought was “who has ever paid $1,599 for a 4090?”",
          "score": 231,
          "created_utc": 1737730674.0,
          "replies": [
            {
              "id": "m8x5f6m",
              "author": "Antares30",
              "body": "Crazy how scalpers are still a problem. I'm sure there are ways to ensure no more than 1-2 per customer on online retailers. Of course, I'm sure they'd find workarounds to that too. Makes me feel kinda lucky I got a 4090 from zotac for 1699 two years ago.",
              "score": 70,
              "created_utc": 1737731295.0,
              "replies": [
                {
                  "id": "m8x7rel",
                  "author": "TacticlTwinkie",
                  "body": "The retailers have no incentive to block it. They sell all their inventory and make their money regardless.",
                  "score": 79,
                  "created_utc": 1737731981.0,
                  "replies": [
                    {
                      "id": "m909bi5",
                      "author": "Steinmetal4",
                      "body": "As with most blights on the consumer, the scalpers wouldn't have a business if people would stop paying them.",
                      "score": 27,
                      "created_utc": 1737763398.0,
                      "replies": [
                        {
                          "id": "m90jv03",
                          "author": "StarWarsTheLastJedi",
                          "body": "It's a chicken and egg situation, as the artificial deflating of the supply is part of what prevents would-be retail purchasers from doing so in the first place.",
                          "score": 11,
                          "created_utc": 1737766885.0,
                          "replies": [
                            {
                              "id": "m91at2s",
                              "author": "KnowherePie",
                              "body": "Spoiler alert, the egg came first.",
                              "score": 7,
                              "created_utc": 1737776469.0,
                              "replies": [
                                {
                                  "id": "m92gbhz",
                                  "author": "razikp",
                                  "body": "Unless that egg crash landed here, what laid the egg!",
                                  "score": 1,
                                  "created_utc": 1737798348.0,
                                  "replies": [
                                    {
                                      "id": "m93mvm3",
                                      "author": "FakeInternetArguerer",
                                      "body": "Something that wasn't a chicken",
                                      "score": 2,
                                      "created_utc": 1737818300.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m93adi2",
                          "author": "nooneisback",
                          "body": "A lot of them fail though. It's the same situation as with wallstreetbets and crypto. They hear stories of hundreds of people making it big and jump straight in, ignoring the fact that besides those hundreds there are tens of thousands that became homeless.\n\nScalping is more reliable because at most your net loss will be under 10k USD if you have 2 brain cells. Which is also why these stories almost never make headlines.",
                          "score": 1,
                          "created_utc": 1737813947.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m90m13i",
                      "author": "dm_me_pasta_pics",
                      "body": "my local retailers limit purchases of new cards to 1 per person/address and they still sell out lol",
                      "score": 3,
                      "created_utc": 1737767617.0,
                      "replies": [
                        {
                          "id": "m9dywlj",
                          "author": "Sock-Enough",
                          "body": "Well of course. Scalpers aren’t artificial demand. A product would only be scalped if there’s already a shortage.",
                          "score": 1,
                          "created_utc": 1737946212.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m92wxfk",
                      "author": "Choice-Rain4707",
                      "body": "they would still sell out, and have people’s respect",
                      "score": 1,
                      "created_utc": 1737808208.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8xzzyp",
                  "author": "CyberneticFennec",
                  "body": "Scalpers are beneficial to retailers, they don't care whether people are happy, they just want the bag. It doesn't matter whether it sells in 30 seconds or 30 days, they get paid the same, but if it's instant that means it's off their shelves much faster and they get paid much faster. There's literally no reason why they would act any differently, some negative feedback isn't going to stop people from continuing to shop from them.",
                  "score": 14,
                  "created_utc": 1737739848.0,
                  "replies": [
                    {
                      "id": "m8y2fg9",
                      "author": "LotFP",
                      "body": "It actually matters a lot if it sells in 30 seconds compared to 30 days. If it's sitting on the shelf for 30 days that's space being used that could hold something else waiting to be sold. In a perfect world shelves would be empty at the end of every day and restocked at night for sale the next day. A retailer can only dream of that sort of turnover.",
                      "score": 9,
                      "created_utc": 1737740525.0,
                      "replies": [
                        {
                          "id": "m8yt3zy",
                          "author": "Numarx",
                          "body": "It hurts sales as well, if you sell out of GPU's then people won't buy the new motherboard, the new CPU, the ram, SSD etc that goes with the GPU upgrade.  Just selling one part of a system is nice, but better if you can get them to buy an entire system with that new GPU.  Its a huge benefit to companies to limit the sales to increase sales in other areas.",
                          "score": 2,
                          "created_utc": 1737747954.0,
                          "replies": [
                            {
                              "id": "m8zhr0j",
                              "author": "Baalii",
                              "body": "That's true to a degree, but NVIDIA of all companies, has a particular reputation for not giving a fuck about even partners like Apple. So I doubt their sales strategy includes the effect on the bottom line of some other companies.",
                              "score": 3,
                              "created_utc": 1737754968.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8y4lnd",
                          "author": "CyberneticFennec",
                          "body": "That's exactly what I mean, they get paid the same regardless so it doesn't matter, holding onto it longer doesn't give them anymore money. If it's cleared out instantly they make their money and get their storage space back right away (which is obviously beneficial to them), that's a huge win for retailers but not for their consumers.",
                          "score": 1,
                          "created_utc": 1737741120.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8zcldc",
                      "author": "sybrwookie",
                      "body": "Hell, retailers are happier with scalpers.  Scalpers aren't returning items or trying to get support/repairs, and once they're resold, the store is 100% off the hook for everything and now the customer has to go to the manufacturer instead.\n\nAnd either way, they get their money.",
                      "score": 3,
                      "created_utc": 1737753514.0,
                      "replies": [
                        {
                          "id": "m90aaih",
                          "author": "Arthur-Mergan",
                          "body": "It’s sucks but scalpers really are a net positive on the business side of things. Drive up price, demand and create artificial scarcity that then feeds back into those first two things. ",
                          "score": 1,
                          "created_utc": 1737763715.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8x7p6p",
                  "author": "RivalRevelation",
                  "body": "All they need is a verified buyers program that requires a legal ID and limits sales to one per person for X amount of time.",
                  "score": 38,
                  "created_utc": 1737731964.0,
                  "replies": [
                    {
                      "id": "m8x8444",
                      "author": "Antares30",
                      "body": "Yep. Didn't EVGA do something similar for the 30 series? Maybe I'm thinking of Microcenter. The store near me always does 1 per person rule on gpu releases.",
                      "score": 21,
                      "created_utc": 1737732083.0,
                      "replies": [
                        {
                          "id": "m8xktfx",
                          "author": "Notasurgeon",
                          "body": "That’s how I got my 3070. Took a year but got to buy it for MSRP.",
                          "score": 8,
                          "created_utc": 1737735664.0,
                          "replies": []
                        },
                        {
                          "id": "m8y7zji",
                          "author": "DonArgueWithMe",
                          "body": "Yeah but during the gpu shortages people would just bring multiple people, each give a fake address, and then come back the next day and try again. \n\nIt's way better than just selling a dozen to one person, but it's pretty easy to abuse still.",
                          "score": 3,
                          "created_utc": 1737742056.0,
                          "replies": []
                        },
                        {
                          "id": "m986kh6",
                          "author": "TheRealGOOEY",
                          "body": "Micro center did a lottery XD",
                          "score": 1,
                          "created_utc": 1737872556.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8xhkmm",
                      "author": "Revoldt",
                      "body": "I don’t see why nvidia/retailers care about scalpers though.\n\nEnd of the day, they still get their money… the cards still sell out.\n\nAnd as an added bonus for them… since they’re not original buyers/authorized retailer, likely never have to deal with warranty issues either.",
                      "score": 15,
                      "created_utc": 1737734765.0,
                      "replies": [
                        {
                          "id": "m8xsi93",
                          "author": "Floaded93",
                          "body": "Because the buying experience ultimately turns sour to consumers. Does a company care enough to make sure their products go into the hands of consumers that actually want them? Well… no. They just care that the product gets sold and moved. Consumers who want it will get it. \n\nThird parties like NewEgg, Bestbuy, etc don’t care who buys them because they’re getting their cut too.",
                          "score": 16,
                          "created_utc": 1737737772.0,
                          "replies": []
                        },
                        {
                          "id": "m8xybhh",
                          "author": "CyberneticFennec",
                          "body": "I don't get the downvotes, you nailed it. Retailers don't care about perspective, people are still going to continue buying from them. They literally just offloaded all of their stock on an extremely expensive item in seconds. That's not a common opportunity. \n\nThey have absolutely nothing to incentivize them to act better. How would they benefit from adding limits when the only difference is they have to take more time to move their goods? People still buy from them either way regardless, nobody boycotts them, and negative reviews from people that care just get drowned out...",
                          "score": 9,
                          "created_utc": 1737739385.0,
                          "replies": [
                            {
                              "id": "m8ybrrh",
                              "author": "Revoldt",
                              "body": "I get it, people are annoyed not getting things at msrp.\n\nBut as all corporations are there to make the most money possible, unless they can prove scalpers are affecting their bottom line, there’s no incentive to do anything about it.\n\nGaming is like 1/5 of what Datacenters bring in for Nvidia. If they had their way with chip yields, pretty sure they’d prefer to go all in on datacenters\n\nhttps://nvidianews.nvidia.com/_gallery/download_pdf/65d669a33d63329bbf62672a/",
                              "score": 5,
                              "created_utc": 1737743111.0,
                              "replies": [
                                {
                                  "id": "m90morq",
                                  "author": "StarWarsTheLastJedi",
                                  "body": "The kind of situation you describe where there is no upside to the manufacturer or retailer doing anything about it is precisely the cases where the regulators need to step in, for the good of society.",
                                  "score": 2,
                                  "created_utc": 1737767840.0,
                                  "replies": [
                                    {
                                      "id": "m9dzbtd",
                                      "author": "Sock-Enough",
                                      "body": "I don’t think expensive graphics cards for gamers is high up on the government’s radar.",
                                      "score": 0,
                                      "created_utc": 1737946327.0,
                                      "replies": [
                                        {
                                          "id": "m9ecojy",
                                          "author": "StarWarsTheLastJedi",
                                          "body": "We see the same thing happen to mainstream consoles. The government should want the masses to have access to entertainment, and retail is the great equalizer ensuring that.",
                                          "score": 1,
                                          "created_utc": 1737950912.0,
                                          "replies": [
                                            {
                                              "id": "m9ectrw",
                                              "author": "Sock-Enough",
                                              "body": "People have massive access to entertainment. The government has no interest in ensuring that $1500 graphics cards are slightly more accessible.",
                                              "score": 1,
                                              "created_utc": 1737950966.0,
                                              "replies": [
                                                {
                                                  "id": "m9esnrf",
                                                  "author": "StarWarsTheLastJedi",
                                                  "body": "Again, I am not applying it narrowly to high-end graphics cards, but to the practice of scalping brand new retail goods of all types. It's a blemish on society that adds nothing of value, and for the time during which the supply of a product is constrained (due in part to the scalping itself exacerbating those shortages), it has the effect of taking the opportunity to own a product out of the hands of those less fortunate, and into the hands of the more affluent.",
                                                  "score": 0,
                                                  "created_utc": 1737958043.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9g4760",
                                                      "author": "Sock-Enough",
                                                      "body": "The more affluent always have more opportunity for that. That’s what affluence means.",
                                                      "score": 1,
                                                      "created_utc": 1737984099.0,
                                                      "replies": [
                                                        {
                                                          "id": "m9ghgot",
                                                          "author": "StarWarsTheLastJedi",
                                                          "body": "The issue isn't about affluence itself but how practices like scalping create artificial scarcity and amplify inequality as a result. Retail by its definition is to sell in small quantities to end consumers; not to re-sell, and scalping is antithetical to this. Capitalism at its heart relies on a free and unfettered market in which participants have a fair opportunity to buy and sell, and regulators should step in to prevent mechanisms that erode confidence in retail's ability to facilitate that.",
                                                          "score": 1,
                                                          "created_utc": 1737988774.0,
                                                          "replies": [
                                                            {
                                                              "id": "m9ghu3r",
                                                              "author": "Sock-Enough",
                                                              "body": "Scalping doesn’t create artificial scarcity. It can only exist when there’s already a shortage.\n\nScalping IS the unfettered market. Prices increasing in response to a shortage and strong demand is exactly what classical Econ models would predict.",
                                                              "score": 1,
                                                              "created_utc": 1737988895.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m9gndw1",
                                                                  "author": "StarWarsTheLastJedi",
                                                                  "body": "> Scalping doesn’t create artificial scarcity. It can only exist when there’s already a shortage.\n\nI'm sorry but this is completely false. Scarcity in a free market is when there are more people willing to buy at the retail price than there are units to sell. Scalpers deliberately buy up retail stock without a goal of consumption, as their intent is to hoard and resell at inflated prices. This removes supply and creates scarcity that doesn't exist naturally.\n\n>Prices increasing in response to a shortage and strong demand is exactly what classical Econ models would predict.\n\nMarket manipulation is not classical economics. Classical econ works on free competition and natural supply-demand movements to determine a market clearing price. Scalping manipulates this by artifically restricting supply to force higher prices. It is not an unfettered market when exploitive intervention unnaturally manipulates the market clearing price. It breaks the classical econ model.",
                                                                  "score": 0,
                                                                  "created_utc": 1737990649.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "m9gpixy",
                                                                      "author": "Sock-Enough",
                                                                      "body": "This is completely and totally wrong.\n\nEconomic models do not just consider the MSRP the “correct” price. The market clearing price is clearly higher than that given that people are willing to pay it.\n\nScalpers are obviously not hoarding since they are scalping. They are not removing supply.\n\nThere is no manipulation. If retailers simply charged much higher prices then the outcomes would be the same except with retailers making the profit that would have gone to scalpers otherwise.",
                                                                      "score": 1,
                                                                      "created_utc": 1737991297.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "m9gsv1d",
                                                                          "author": "StarWarsTheLastJedi",
                                                                          "body": "Of course retail is not always set at the market clearing price for various reasons, such as game consoles being sold at a loss. But the natural clearing price is determined by the actual balance of supply and demand. Profiteering resellers artificially reduce the supply by removing a chunk of stock from the market, inflating the market price beyond the natural clearing level. \n\n>Scalpers are obviously not hoarding since they are scalping. They are not removing supply.\n\nThis is fundamentally flawed. Scalping inherently involves hoarding, and scalpers purchase the products to disrupt the retail supply chain. Remember, resale is not an instant process. When scalpers buy up stock they remove them from retail circulation. Until those products actually sell they are effectively withheld from the legitmate supply chain\n\nEach unit a scalper purchases blocks a consumer who otherwise would have bought that unit for the intended consumption purpose at the regular price. By its nature each purchase for scalping purposes is a factor that amplifies the scarcity beyond what is generated by actual demand for the product. \nScalping is manipulation carried out by those who wish to profiteer and add nothing of value.",
                                                                          "score": 0,
                                                                          "created_utc": 1737992276.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "m9helpr",
                                                                              "author": "Sock-Enough",
                                                                              "body": "If they immediately turn around and sell the disruption would be incredibly small. This is making a mountain out of a mole hill if it’s your entire complaint.",
                                                                              "score": 0,
                                                                              "created_utc": 1737998414.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "m9huczu",
                                                                                  "author": "StarWarsTheLastJedi",
                                                                                  "body": "You've attempted to strawman my argument by ignoring the broader points I’ve made about scalping and reducing to a single hypothetical position I never took. It’s clear there’s no intention to engage meaningfully, so I’ll leave it here.",
                                                                                  "score": 1,
                                                                                  "created_utc": 1738002767.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "m9hurx8",
                                                                                      "author": "Sock-Enough",
                                                                                      "body": "I’m not strawmanning your argument. It’s just wrong.",
                                                                                      "score": 0,
                                                                                      "created_utc": 1738002884.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "m9k9mhw",
                                                                                          "author": "StarWarsTheLastJedi",
                                                                                          "body": "It seems awfully like you are trying very hard to rationalize something you know is wrong. Perhaps you or someone you know is involved in the practice. It is not an honest endeavor, it adds nothing of value, and the economic dynamics at play are well understood despite your inability to accept them.",
                                                                                          "score": 0,
                                                                                          "created_utc": 1738028556.0,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "m9kjgtv",
                                                                                              "author": "Sock-Enough",
                                                                                              "body": "There’s nothing wrong with it. No one I know does it. The economics of it are understood, but not by you. Scalpers are taking advantage of a shortage. It’s as simple as that.",
                                                                                              "score": 1,
                                                                                              "created_utc": 1738031763.0,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "m9kp1u5",
                                                                                                  "author": "StarWarsTheLastJedi",
                                                                                                  "body": "Let me give you a simplified example to help you understand this concept and where you are misunderstanding economics.\n\nStart with a hypothetical balanced market where a new product is launching for $1000, initial inventory is 100 units, and since the manufacturer researched the market well, there happen to be 100 consumers willing to buy at that price. They start taking pre-orders.\n\nNow imagine that scalpers intervene, using bots or other tools, and secure 50 of those 100 units.\n\n- There are still 100 consumers willing to buy the product at $1,000, but now only 50 units are available at retail.\n- A shortage of 50 units has been artificially created by the scalpers, where previously there was none.\n\nThen scalpers reintroduce the products on the resale market, forcing prices above retail. This is a distortion of the market because it entirely created a scarcity that didn't exist. Scalpers added no value; they blocked legitimate buyers, disrupted the manufacturer and retail business models, all in order to withhold stock to artificially command higher prices. \n\nYou cannot explain how this is not an artificial shortage generated directly by scalping. And the same mechanism works when the market is already supply constrained. In other words whatever shortages the market is experiencing, by the time scalpers have intervened, those shortages are amplified.",
                                                                                                  "score": 1,
                                                                                                  "created_utc": 1738033617.0,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "m9kplfn",
                                                                                                      "author": "Sock-Enough",
                                                                                                      "body": "The simple explanation is that buying something and immediately posting it for resale wouldn’t allow the scalpers to charge any higher than the initial $1000. They would lose money. Your hypothetical wouldn’t actually happen.\n\nIn the real world a good is only scalped when the market clearing price is above the retail price. That’s your error. Scalpers are actually getting the market to the equilibrium. That’s the only reason it works at all.",
                                                                                                      "score": 1,
                                                                                                      "created_utc": 1738033803.0,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "m9l04na",
                                                                                                          "author": "StarWarsTheLastJedi",
                                                                                                          "body": "You’re misinterpreting both the hypothetical and real-world mechanics of scalping. Let me address the real-world scenario.\n\nYou seem to be floating the idea that in a situation where the market clearing price is above the retail price, scalpers merely \"unlock\" the natural market clearing price, allowing supply and demand to function naturally without being constrained by the retail pricing model. However, the act of withholding stock artificially raises the equilibrium price by distorting the market's natural supply-demand balance. Let me show you how:\n\n**Without scalpers:**\n\nSupply: 100 units\n\nDemand at $1,000 retail: 150 buyers (50 unfulfilled)\n\nDemand at $1,200: 100 buyers (natural MCP achieved, market balanced).\n\n**With scalpers:**\n\nSupply: 50 units in retail circulation, 50 hoarded by scalpers.\n\n50 buyers purchase at $1,000 retail.\n\n100 buyers remain, but only 50 scalper-controlled units are available.\n\nRemember, 100 buyers were willing to buy at $1,200 retail, but there are now only 50 units. To clear this new imbalance, prices rise further until demand drops to match supply—e.g., $1,600. While there can be overlap where would-be $1,200 buyers are among the 50 who manage to buy at retail, even if only 90, or 80 remain, the scalper-distorted MCP will still exceed the natural one. \n\nScalpers don’t unlock market forces - they distort them, forcing consumers to pay inflated prices while adding zero value. This is market manipulation, not equilibrium.",
                                                                                                          "score": 0,
                                                                                                          "created_utc": 1738037642.0,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "m9l0cd1",
                                                                                                              "author": "Sock-Enough",
                                                                                                              "body": "But they don’t withhold anything! That’s what you don’t understand! A scalper scalps. They sell what they buy, and they want to sell it fast. Your entire model relies on an assumption that isn’t just wrong. It’s backwards!",
                                                                                                              "score": 1,
                                                                                                              "created_utc": 1738037727.0,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "m9l2dz6",
                                                                                                                  "author": "StarWarsTheLastJedi",
                                                                                                                  "body": "You are completely misunderstanding the argument. If a scalper wanted things to sell quickly they would step out of the way to allow retail transactions to take place unfettered. The core act in scalping is to divert stock from retail circulation to drive up prices in a secondary market. Even if they resell relatively quickly the damage is already done because that stock is removed from retail and they have created artificial scarcity. It is that scarcity which they created that they rely on to demand higher prices.\n\nScalper prices on secondary markets can be much higher than market clearing prices otherwise would be. That gap is ill-gotten gains from market manipulation.",
                                                                                                                  "score": 0,
                                                                                                                  "created_utc": 1738038548.0,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "m9l4miz",
                                                                                                                      "author": "Sock-Enough",
                                                                                                                      "body": "No, the goal is to make money, and they make money by selling to willing buyers. But they want to do that quickly because keeping stock on hand is risky and expensive. If they are reselling quickly there is obviously no hoarding. Hoarding means not selling.\n\nThere is no driving up of prices beyond the market clearing price.\n\nIf what you were saying were true then people would scalp everything, mattresses, onions, buildings, but people only seem to scalp things with very strong demand and limits on supply. I wonder if simple supply and demand explains that perfectly?",
                                                                                                                      "score": 1,
                                                                                                                      "created_utc": 1738039469.0,
                                                                                                                      "replies": [
                                                                                                                        {
                                                                                                                          "id": "m9l5qt7",
                                                                                                                          "author": "StarWarsTheLastJedi",
                                                                                                                          "body": "> Hoarding means not selling.\n\nScalpers don't need to hoard indefinitely. Even temporarily removing availability from retail channels disrupts the demand supply balance\n\n>There is no driving up of prices beyond the market clearing price.\n\nTheir intervention has already driven up the market clearing price. Scalping pushes up the market clearing price beyond what it would be without scalping, plain and simple\n\n>I wonder if simple supply and demand explains that perfectly?\n\nSpoiler: It doesn't. Scalping doesn't recreate or restore a perfect market, it disrupts simple supply and demand by creating artificial scarcity. They manipulate the supply curve to engineer a rapid increase in prices to profit from the scarcity they themselves have manufactured.",
                                                                                                                          "score": 0,
                                                                                                                          "created_utc": 1738039939.0,
                                                                                                                          "replies": [
                                                                                                                            {
                                                                                                                              "id": "m9l7frn",
                                                                                                                              "author": "Sock-Enough",
                                                                                                                              "body": "But they don’t hoard at all. The post the items for sale instantly.\n\nIt simply does not. There’s no mechanism for that to be the case.\n\nNone of that makes any sense. Scalping simply being a way to turn a time- and effort-driven market (you need to get to the store at the right time) into one driven by prices (you need to pay the market clearing rate) however coheres perfectly with bog standard Econ.",
                                                                                                                              "score": 1,
                                                                                                                              "created_utc": 1738040671.0,
                                                                                                                              "replies": []
                                                                                                                            }
                                                                                                                          ]
                                                                                                                        }
                                                                                                                      ]
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8xtatc",
                          "author": "IIlIIlIIlIlIIlIIlIIl",
                          "body": "PR.",
                          "score": 1,
                          "created_utc": 1737737991.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m90uuzu",
                      "author": "karatekid430",
                      "body": "OR you idiots could just stop buying from scalpers and then they would stop",
                      "score": 1,
                      "created_utc": 1737770657.0,
                      "replies": []
                    },
                    {
                      "id": "m8xiqwc",
                      "author": "_RrezZ_",
                      "body": "Then people just use their grandparent's ID's or other stolen ID's from picked pockets etc.",
                      "score": -3,
                      "created_utc": 1737735093.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8xdgih",
                  "author": "None",
                  "body": "If people could all agree to stop paying scalpers double the price and be patient for a non-necessity the problem would go away overnight. I have no sympathy for people that pay double MSRP. They’re the enablers.",
                  "score": 28,
                  "created_utc": 1737733607.0,
                  "replies": [
                    {
                      "id": "m8ybq8e",
                      "author": "Dangthing",
                      "body": "The problem is the rich people. When you have 500 million in the bank you don't give a shit that the item costs you pocket lint in extra cost. Hell your pocket lint probably costs more tbh. And in truth your time is so valuable to you that you probably don't even handle the purchase. You hire someone who handles things like this for you. You say, get me the BEST NOW. And that person does it. \n\nAnd not every person needs to be screw off levels of rich for this to be the case. I know plenty of older individuals who just want quality/the best and have enough money that they don't really care about paying double retail. \n\nThis is not a problem markets can solve, we require legal intervention.",
                      "score": 4,
                      "created_utc": 1737743099.0,
                      "replies": [
                        {
                          "id": "m8z7hq2",
                          "author": "Proponentofthedevil",
                          "body": "Legal intervention in what way? How do you determine if one person needs to buy one, or they have multiple systems and buy 6, or they have a family, or they own a local store.... etc....\n\n\n\"Rich people\" aren't making it happen. Plenty of non rich people will pay more out of desperation, lack of self control, stupidity,  genuine enthusiasm, etc... if you had even a very modest amount of investment money, you could buy X and attempt to sell them for more.\n\nRich people aren't buying GPUs to scalp and make money, they have plenty of better unethical means of profiting. Would your solution be to just give everyone a 4090? Make more people less \"rich?\"\n\nMyself, I just want one. I'm looking at buying a second hand one. I don't feel owed one. I don't deserve one. My purchase is going to help that guy buy a 5090, I can sell my 4070ti super (yes. I need that liiiitle but more lmao) and recoupe some of my costs, while someone else gets an upgraded card. And so it goes on.",
                          "score": 5,
                          "created_utc": 1737752068.0,
                          "replies": [
                            {
                              "id": "m8zgjr0",
                              "author": "Dangthing",
                              "body": "The legal intervention required is honestly not very difficult. We just need stronger price regulation laws and license requirements for bulk purchase. \n\nOn a product like a GPU a non-license cap of 3 of them would easily fit the vast majority of the populations requirements while making scalping substantially more difficult. Once you have a license you are given a resale restriction cap which limits the total markup you can resell the item at. Obviously breaking this limitation comes with a stiff penalty. Make that limit similar to average for normal commercial stores such as Walmart IE cap of \\~30% markup. Failure to put regulations in place is why the market can create artificial scarcity so easily. \n\nThere are likely expansions required to ensure such a law is less vulnerable to exploitation etc, it needs more cooking but for a basic comment you should get the idea. \n\nThe purpose is to stop someone from buying the entire stock of an item and then selling it at 200-300-400% + markups. These people are essentially just parasites and offer no value to anyone. \n\nYou've also somehow mistaken me saying that rich people are the problem for saying rich people are the scalpers. That was not what I was saying. I'm saying there are enough rich people that scalpers can be profitable which is at its core the problem. I don't support punishing the rich for being stupid with money or for being rich. I support making it impossible for the parasites to exist.",
                              "score": 2,
                              "created_utc": 1737754630.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8xhp5d",
                  "author": "Nasa_OK",
                  "body": "Or just ramp up production. Instead of just selling to scalpers you could sell to scalpers and people who won’t get mad if they aren’t able to resell",
                  "score": 9,
                  "created_utc": 1737734800.0,
                  "replies": [
                    {
                      "id": "m8xpwy5",
                      "author": "sr_90",
                      "body": "Then the scalpers would just buy more.",
                      "score": 5,
                      "created_utc": 1737737058.0,
                      "replies": [
                        {
                          "id": "m8xr3mz",
                          "author": "Nasa_OK",
                          "body": "Then produce more",
                          "score": 6,
                          "created_utc": 1737737383.0,
                          "replies": [
                            {
                              "id": "m8y2w5d",
                              "author": "LotFP",
                              "body": "There is a finite limit to what can be produced and those that want to control the supply have more than enough money to buy all they need to maintain that control (or at least make significant profit from the choke points in the supply line).",
                              "score": 4,
                              "created_utc": 1737740653.0,
                              "replies": []
                            },
                            {
                              "id": "m8xzmbq",
                              "author": "sr_90",
                              "body": "Then the scalpers would buy more. It’s all about controlling the supply.",
                              "score": -1,
                              "created_utc": 1737739744.0,
                              "replies": [
                                {
                                  "id": "m8y2zcn",
                                  "author": "apagogeas",
                                  "body": "Sure, how much more scalpers will buy anyway? Are they huge retail shops? At some point they'll have to stop buying otherwise they'll just create a huge stock of unsold GPUs. This will also work with a huge loss for scalpers. Patience is the key really, let scalpers get whatever, let them operate at loss. The only reason these people exist is because there are impatient people who don't look/know the actual value of the items they buy which drives this scummy behaviour.",
                                  "score": 7,
                                  "created_utc": 1737740677.0,
                                  "replies": []
                                },
                                {
                                  "id": "m8y5iro",
                                  "author": "Nasa_OK",
                                  "body": "So producing gpus is a tru infinite money glitch? Do scalpers have infinite money?",
                                  "score": 3,
                                  "created_utc": 1737741372.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8z0ew0",
                          "author": "pimpys",
                          "body": "Have you ever thought when  and why the scalpers started? That's the answer to the solution.",
                          "score": 1,
                          "created_utc": 1737750047.0,
                          "replies": [
                            {
                              "id": "m8z1yoq",
                              "author": "sr_90",
                              "body": "Crypto?",
                              "score": 1,
                              "created_utc": 1737750494.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8y9cfk",
                  "author": "maddcatone",
                  "body": "Scalpers have helped NVIDIA raise their prices to astronomical levels. GPUs would never have gotten this high if people hadn’t bought gpus for 2x markup during covid. NVIDIA sees that and says, why should scalpers pocket all that money when we could just msrp them for as much. Scalpers are an unlikely ally of industry these days.",
                  "score": 1,
                  "created_utc": 1737742433.0,
                  "replies": []
                },
                {
                  "id": "m90d9v6",
                  "author": "Radulno",
                  "body": "It's not even scalpers. Retailers don't sell at MSRP at all.",
                  "score": 1,
                  "created_utc": 1737764688.0,
                  "replies": []
                },
                {
                  "id": "m90qdob",
                  "author": "epi_glowworm",
                  "body": "Imagine if you had to enter your driver's license number to order it.",
                  "score": 1,
                  "created_utc": 1737769109.0,
                  "replies": []
                },
                {
                  "id": "m93bd3f",
                  "author": "Harouun",
                  "body": "Bruhh there was so many 4090s from zotac at launch, it’s not lucky you got one it’s people not wanting a subpar gpu, they said the plebs can have them.",
                  "score": 1,
                  "created_utc": 1737814321.0,
                  "replies": []
                },
                {
                  "id": "m93r2wq",
                  "author": "BurnerForJustTwice",
                  "body": "Your 4090 cost more than my whole PC with a 4070 super. lol wtf. I didn’t realize they were that expensive.",
                  "score": 1,
                  "created_utc": 1737819613.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8x4am0",
              "author": "Coders_REACT_To_JS",
              "body": "I was looking to get a FE 4080S a few months ago and it was out of stock with Nvidia and Best Buy. Made me realize that every time I’ve been interested in getting a FE card since 30 series it has been sold out.",
              "score": 57,
              "created_utc": 1737730958.0,
              "replies": [
                {
                  "id": "m8x8ipa",
                  "author": "RedlyrsRevenge",
                  "body": "I remember way back yonder trying to get a 3070 FE. Endless hours refreshing Best Buy pages. Trying to check out as fast as possible. Never got one...\nI did \"win\" the privilege of buying an EVGA 3070ti from NewEgg with a bundled PSU for the low price of $1000. Oof. Why was I so dumb back then?",
                  "score": 30,
                  "created_utc": 1737732200.0,
                  "replies": [
                    {
                      "id": "m8xji84",
                      "author": "nope_nic_tesla",
                      "body": "FOMO caused by marketing",
                      "score": 15,
                      "created_utc": 1737735305.0,
                      "replies": [
                        {
                          "id": "m8xmz57",
                          "author": "RedlyrsRevenge",
                          "body": "100%\n\nThe stupid part is, I already had a 3070 at the time.",
                          "score": 10,
                          "created_utc": 1737736253.0,
                          "replies": [
                            {
                              "id": "m8ypi95",
                              "author": "Merry_Dankmas",
                              "body": "NGL, it's stuff like this that makes me glad I fell out of deep interest in PCs. I was haaaard into them a few years ago. Constant benchmarking tests, comparing user benchmarks, watching endless hours of comparison videos etc. Then I moved out of my parents house and didn't have nearly as much disposable income so I just kinda...fell out of it.\n\nI still have a 2070 Super in my desktop and 3070 in my laptop. Im outdated now. But I look at what a massive hassle and headache the GPU market has become and am honestly glad I'm not deep into the hobby anymore. It looks like the market has become nothing more than a stupid game between scalpers, manufacturers and those looking to save a buck. I mean, its always been that way but it looks like it's gotten 20x worse over the years. \n\nDon't get me wrong, I still love PC and always will but damn does it seem annoying to get anything now.",
                              "score": 3,
                              "created_utc": 1737746935.0,
                              "replies": [
                                {
                                  "id": "m8yq3ny",
                                  "author": "RedlyrsRevenge",
                                  "body": "My desktop with that 3070ti has been sitting disconnected in my living room for two years now. Too many house projects and repairs. I bought a Zephyrus G14 because I needed a new laptop to replace my old ZenBook. Been playing a little games on it. One day my desktop will be back together. The 12700K might be a little dated by the time I do.",
                                  "score": 1,
                                  "created_utc": 1737747102.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m8z5ex2",
                              "author": "crinkledcu91",
                              "body": "I shelled out 800+ for a 4070 ti Super 16gvram last month. With the dumbass tariffs, it very well might be the last gpu I'll be able to purchase without taking out a loan. I'm not even mad, though because people are trying to hawk em where I am for almost double that as of yesterday.",
                              "score": 1,
                              "created_utc": 1737751479.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8yd8f4",
                      "author": "Ethrem",
                      "body": "When the 3000 series launched I wanted a 3060 Ti but didn't succeed in securing one so when EVGA launched all their queues, I joined each one. Didn't get pulled for a card until the 3080 Ti FTW3 Ultra Gaming in 10/2021. As I still had a 780 Ti, I bought it. Instead of a $400 card I ended up with a $1300 card. At least it was MSRP I guess but honestly I'm starting to get to the point that I'm not willing to continue paying ever escalating prices for graphics cards and now there's talk of $100 standard editions of games. It's all just a big waste of money for something I use a couple hours a day on average.",
                      "score": 2,
                      "created_utc": 1737743514.0,
                      "replies": []
                    },
                    {
                      "id": "m8ytj5i",
                      "author": "Goose-tb",
                      "body": "After the 5080 and 5090 release on Nvidias website how long do normal people like us have to place an order before they’re gone? Seconds? Minutes? I thought about getting one or the 5XXX series FE cards in day one the first few minutes it launches but I have a feeling I’ll never beat the bots.",
                      "score": 1,
                      "created_utc": 1737748073.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m917bn0",
                  "author": "Irorak",
                  "body": "I got a lenovo legion pc last year from lenovo, with a 4070 FE in it. Did I luck out? I just randomly picked it. Or are 4070's less rare?",
                  "score": 1,
                  "created_utc": 1737775145.0,
                  "replies": [
                    {
                      "id": "m91foq6",
                      "author": "Coders_REACT_To_JS",
                      "body": "A bit less rare, but mostly it’s easier to get them from builders since they get reservations for stock and are already going to have markup for assembly anyway.",
                      "score": 2,
                      "created_utc": 1737778419.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8x5nbo",
              "author": "Huxley077",
              "body": "Uh, me. Got it a few months after launch from Best Buy at the actual $1,600 price. I haven't been watching 4090 prices since I bought mine. When someone said they were $3k , I laughed ...until I saw it was true. Fuck scalpers",
              "score": 19,
              "created_utc": 1737731362.0,
              "replies": [
                {
                  "id": "m8x8jlf",
                  "author": "mr_chip_douglas",
                  "body": "I mean yeah I paid $1,750 for a Suprim x as well, but I suspect the vast majority of 4090 owners were gouged one way or another",
                  "score": 6,
                  "created_utc": 1737732207.0,
                  "replies": [
                    {
                      "id": "m8xggyq",
                      "author": "locofspades",
                      "body": "Same here.  Bought my suprim x at the same price and then a month later the prices shot to around $2500.  Ngl, that suprim x 5090 is looking pretty sweet though lol",
                      "score": 2,
                      "created_utc": 1737734453.0,
                      "replies": [
                        {
                          "id": "m8xhxgr",
                          "author": "Aggressive_Ask89144",
                          "body": "To be fair, all of the high end models are usually really good buys at launch. Suprims, Nitro+, even a Strix if they're sane. They'll only be like a 10% or 20% upcharge instead of double lmao. Like the Nitro is commonly only like 50 or 100 bucks more at MSRP and they're so well made.",
                          "score": 1,
                          "created_utc": 1737734865.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8ycwdz",
                      "author": "rabouilethefirst",
                      "body": "I don’t think that’s true at all. I walked into Best Buy and got a 4090 at MSRP randomly one day. I think people are confusing NVIDIA’s artificial supply reduction with scalping. NVIDIA chose to stop producing the card and switch focus to the 5000 series, even though they aren’t even producing a good replacement for the 4090. There’s no card in their stack with 24GB VRAM at about $1500 anymore.\n\nIf you were looking for a 4090 in 2023, it was EZ.",
                      "score": 1,
                      "created_utc": 1737743421.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8xhdq7",
              "author": "Select_Factor_5463",
              "body": "I paid 1599 for my 4090 last year on Nvidia's store.",
              "score": 3,
              "created_utc": 1737734710.0,
              "replies": []
            },
            {
              "id": "m8x86f7",
              "author": "nusyheart",
              "body": "They were sitting on Nvidia's website for MSRP over the summer.",
              "score": 2,
              "created_utc": 1737732101.0,
              "replies": []
            },
            {
              "id": "m8xkryg",
              "author": "ifixtheinternet",
              "body": "I paid 1360 with the 15% off CC signup bonus at Best Buy.",
              "score": 2,
              "created_utc": 1737735653.0,
              "replies": [
                {
                  "id": "m8yt9eb",
                  "author": "shmed",
                  "body": "To be fair 15% off for signing up for a CC isn't amazing when a few premium credit cards are offering $2000 signing bonuses right now. I wouldn't count a CC signing bonus toward the price of the GPU since you could have applied it toward any purchase",
                  "score": 3,
                  "created_utc": 1737747996.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8x7nrg",
              "author": "Dzov",
              "body": "I could have at microcenter. It was just too pricey for me at the time and I’m not sure my home’s wiring/circuit breaker could handle it. (1905 home with the entire upstairs on one circuit that shares with a large window A/C or space heater)",
              "score": 3,
              "created_utc": 1737731952.0,
              "replies": [
                {
                  "id": "m8yi4dz",
                  "author": "OramaBuffin",
                  "body": "I cant believe this has become a genuine concern with modern high end PCs lol",
                  "score": 2,
                  "created_utc": 1737744870.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xyj6y",
              "author": "RockerXt",
              "body": "I got a partner card in december for 1729 before tax from memoryexpress. Theres the odd one on marketplace that looks alright but beyond that youre screwed.",
              "score": 1,
              "created_utc": 1737739444.0,
              "replies": []
            },
            {
              "id": "m8ycbj9",
              "author": "rabouilethefirst",
              "body": "Plenty of people paid MSRP. I don’t understand where this discourse is coming from. The 4090 was always in stock until NVIDIA stopped production. They could have continued making 4090s for $1499 and they would have sold.",
              "score": 1,
              "created_utc": 1737743261.0,
              "replies": []
            },
            {
              "id": "m8yd2f2",
              "author": "iboughtarock",
              "body": "Yeah I got a 4080 just last year for $800 and had to replace the paste and pads cuz no way I was gonna send it in for warranty and just have them refund me. Crazy times.",
              "score": 1,
              "created_utc": 1737743468.0,
              "replies": []
            },
            {
              "id": "m8yd3pb",
              "author": "skyattacksx",
              "body": "I might have paid $1200 for a 3080 in 2022, but I paid 1550 for my 4090 in 2024! \n\n…that makes it worth it, right?",
              "score": 1,
              "created_utc": 1737743478.0,
              "replies": []
            },
            {
              "id": "m8yjd83",
              "author": "iprocrastina",
              "body": "They were easy to get a couple months after launch. Took me less than a week of searching to get my AIO 4090 for $1700.",
              "score": 1,
              "created_utc": 1737745214.0,
              "replies": []
            },
            {
              "id": "m8ysvla",
              "author": "shmed",
              "body": "You could get one on sale for 1400 last year.",
              "score": 1,
              "created_utc": 1737747887.0,
              "replies": []
            },
            {
              "id": "m8ztm2a",
              "author": "catfroman",
              "body": "Got an open box OC Aero 4090 in September for $1,629",
              "score": 1,
              "created_utc": 1737758446.0,
              "replies": []
            },
            {
              "id": "m90mfw5",
              "author": "ucrbuffalo",
              "body": "“Prices of last gen cards are about to drop because of this!”\n\n\\*Prices increase*\n\n\\*Shocked Pikachu face*",
              "score": 1,
              "created_utc": 1737767756.0,
              "replies": []
            },
            {
              "id": "m92ui0d",
              "author": "shekurika",
              "body": "I paid 1597 for mine on 17th may 2023; there was def a time you could get them ar MRSP",
              "score": 1,
              "created_utc": 1737806955.0,
              "replies": []
            },
            {
              "id": "m97jl6f",
              "author": "WinterDice",
              "body": "They’re hitting that price used on eBay right now.",
              "score": 1,
              "created_utc": 1737862475.0,
              "replies": []
            },
            {
              "id": "m8xfyge",
              "author": "locofspades",
              "body": "I paid around $1650-1750 for my Suprim X 4090 in the summer of '23, right before prices exploded.  I wish id bought more though as the profits (just at amazon prices) would have paid for my whole rig lol",
              "score": 0,
              "created_utc": 1737734310.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xk4nz",
          "author": "hybridfrost",
          "body": "I haven’t seen them in stock for months. I think nvidia stopped making them so the scalpers took over again",
          "score": 5,
          "created_utc": 1737735478.0,
          "replies": []
        },
        {
          "id": "m8ygvxw",
          "author": "karlzhao314",
          "body": "Ironically, it seems like we've returned to the COVID/mining era where buying GPUs in prebuilts is cheaper and more reasonable than buying GPUs alone.\n\nAccording to PCPartpicker today (1/24/2025), [the cheapest 4090s are $2500.](https://pcpartpicker.com/products/video-card/#c=539&sort=price&page=1)\n\nMeanwhile, Dell has a [14900KF + 4090 + 32GB DDR5 + 2TB NVMe Alienware on sale right now for $2900](https://www.dell.com/en-us/shop/desktop-computers/alienware-aurora-r16-gaming-desktop/spd/alienware-aurora-r16-desktop/useahctor16i08), which is less than the extra cost of a 14900KF alone. Sure, the motherboard and case are proprietary and pretty junky, but Steve GN had pretty good things to say about the Dell 4090 and you could just as easily move the 14900KF, RAM, and SSD over to your own build and probably come out on top.\n\nI gave up on getting a 5090 for now and just went for this Alienware instead. Managed to wrangle a student discount, too, which brought the price down to $2600 + tax. I probably would have had to spend that on a 5090 anyway, even if I went the route of camping overnight outside a Microcenter.",
          "score": 5,
          "created_utc": 1737744530.0,
          "replies": [
            {
              "id": "m90cszf",
              "author": "geoelectric",
              "body": "Yeah, I bought a Lenovo Legion 7i Gen 8 tower in late 2023 because I couldn’t find a reasonably priced 4090 for a BYO.\n\nPrebuilt system with a liquid cooled 13900KF, 64GB RAM and a 2TB SSD along with the admittedly vanilla 4090 GPU ended up costing me $3000 minus the $200 I got back from RetailMeNot. \n\nFor $2800 I regret nothing. The 4090 would’ve been $2000 of that easy at the time, if I could even find one. It’s a standard case and mobo, etc so it’s all swappable anyway.\n\nMy only real limitation is they left exactly enough length behind the radiator for what looks like a FE 4090 with a three fan cooler, so I probably can’t fit most of the new cards without changing cases and/or reverting to air for CPU cooling. Since I’d probably upgrade to a Ryzen anyway at the same time, it’s all been upside for me.",
              "score": 1,
              "created_utc": 1737764536.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m90gdgv",
          "author": "Eldritch_Raven",
          "body": "Why though? You can buy them for retail online. On multiple websites. Scalpers are so stupid.",
          "score": 1,
          "created_utc": 1737765717.0,
          "replies": []
        },
        {
          "id": "m90zmsu",
          "author": "CosmicCreeperz",
          "body": "At least they are available.  Who the fuck buys a graphics card from someone when it won’t even be on sale for a week?!",
          "score": 1,
          "created_utc": 1737772351.0,
          "replies": []
        },
        {
          "id": "m8xjlki",
          "author": "aaahhhhhhfine",
          "body": "I know this drives reddit off the wall for some reason... But this is a pretty basic thing economically. The original companies - or the best buys/Amazons of the world - should drastically raise their prices. \n\nScalpers exploit the case where MSRP is drastically below the real value of a good. The simplest way around that is to have the seller raise the price and price out scalpers. But everyone loses their shit when that happens for some silly reason. Scalpers make things worse for everyone and lead to the same outcome as we'd have if stores just prices things better. Doing that also incentivizes the people who actually control production - basically the sellers - to produce more.",
          "score": -7,
          "created_utc": 1737735331.0,
          "replies": [
            {
              "id": "m8xmnp7",
              "author": "shaky2236",
              "body": "In curious, since you think 2 grand is too low for the 5090, what should it be priced at? How drastically would you like them to raise their prices? If scalpers are selling it for double, should nvidea sell the 5090 for 4000? Maybe even 5000? Would that be reasonable to you?",
              "score": 6,
              "created_utc": 1737736166.0,
              "replies": [
                {
                  "id": "m8xqwf4",
                  "author": "suicidaleggroll",
                  "body": "They should sell them for whatever price allows them to sell everything they produce.  That naturally won't be a constant over time, maybe it would start at $4k and only the most die-hard people would buy them, then as that market dried up they would lower the price to draw in more and more people, always setting the price at whatever was required to keep up with production.\n\nThat's effectively the same thing that's happening now, just with scalpers sitting in the middle.",
                  "score": 3,
                  "created_utc": 1737737328.0,
                  "replies": []
                },
                {
                  "id": "m8xojqt",
                  "author": "microwavedave27",
                  "body": "If they can't scale up production to meet demand, they should price it at the point where scalping becomes unprofitable. If that's $4000, then price it at $4000. If some people are willing to pay that price, might as well cut out the middleman.\n\nThen just gradually lower the price as demand goes down.",
                  "score": 0,
                  "created_utc": 1737736685.0,
                  "replies": [
                    {
                      "id": "m8yuhzw",
                      "author": "DeadNeko",
                      "body": "You're objectively correct and it shouldn't even be a question. If Nvidia was absorbing the extra money from pricing higher originally they could also scale down prices faster as demand drops because they are hitting their margins quicker. But they can't because the hit they would take to their to image isn't worth it and if they did this consumers would see no reason to buy at the high price knowing it will drop. I.e consumer behavior is not optimal for maximizing profit in the space and to do so would likely result in lower profits. Right now the scalpers eat the brunt of the hate and NVIDIA likes that. \n\nAlthough the consumer argument is why would they drop prices if they can sell at 4k they will just never drop them and the issue is they have severely less demand at that market price and eventually they are just leaving money on the table for no reason that no business savvy investor is ever going to be okay with. It would be different if they were a luxury brand but they aren't.",
                      "score": 1,
                      "created_utc": 1737748346.0,
                      "replies": [
                        {
                          "id": "m8zj0ed",
                          "author": "microwavedave27",
                          "body": "Yeah I guess that makes sense. If doubling their prices made them more money they would have already done it anyway.",
                          "score": 1,
                          "created_utc": 1737755324.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8xvldu",
                  "author": "aaahhhhhhfine",
                  "body": "You're thinking of price as some abstract thing... But it's not... It's just whatever you're willing to pay and they're willing to sell.... And it changes a lot. \n\nIf you were almost out of gas... You'll go to the more expensive station that's closer, right? If you were really thirsty on a hot day, you'd pay more for water. \n\nPrice isn't some magical fixed number. \n\nAnd remember it goes the other way too... If Nvidia tries to sell a card for 10k... Few people will buy it...",
                  "score": -1,
                  "created_utc": 1737738633.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xm1l2",
              "author": "dzyp",
              "body": "Correct. Scalpers exist because there is more demand than supply. With no scalpers, the cards just wouldn't be available to most people at all.\n\nThe real blame lies with nvidia. And I can't really blame them because it's more lucrative to sell compute to ai companies. It sucks as a gamer, first we had to deal with bitcoin miners and now the AI hype train. There's too much easy money still floating around and that money has been chasing bubbles that require compute. Bad luck for us.",
              "score": -2,
              "created_utc": 1737735997.0,
              "replies": [
                {
                  "id": "m8y3ctv",
                  "author": "travelsonic",
                  "body": "> With no scalpers, the cards just wouldn't be available to most people at all.\n\nALL The citations needed for that one.",
                  "score": 2,
                  "created_utc": 1737740779.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8x40ol",
      "author": "None",
      "body": "[deleted]",
      "score": 828,
      "created_utc": 1737730873.0,
      "replies": [
        {
          "id": "m8xe4b7",
          "author": "theBeerdedGOAT",
          "body": "Facts",
          "score": 104,
          "created_utc": 1737733795.0,
          "replies": []
        },
        {
          "id": "m8xgb68",
          "author": "RaDeus",
          "body": "And no sympathy when you get a GTX 8800 in the box.",
          "score": 76,
          "created_utc": 1737734408.0,
          "replies": [
            {
              "id": "m8yt9y1",
              "author": "None",
              "body": "Idk, GTX 8800 sounds like it’s 3 generations in the future, seems like a good deal",
              "score": 8,
              "created_utc": 1737748000.0,
              "replies": []
            },
            {
              "id": "m8xttci",
              "author": "IIlIIlIIlIlIIlIIlIIl",
              "body": "I remember when that was the halo card, basically hat generation's XX80 card when no Supers, Tis, XX90s, or Titans existed, and cost... $600.\n\nNow $600 gets you a mid range XX70 card.",
              "score": 16,
              "created_utc": 1737738133.0,
              "replies": [
                {
                  "id": "m8y2bzc",
                  "author": "ob_knoxious",
                  "body": "Yeah but that card came out in 2006. That's about $1000 today, or the exact cost of the 5080.",
                  "score": 14,
                  "created_utc": 1737740498.0,
                  "replies": [
                    {
                      "id": "m8z74n9",
                      "author": "Olde94",
                      "body": "680 was 500$ in 2012 (683$ now)     \n980 was 550$ in 2014 (728$ now).   \n1080 was 600$ in 2016 (784$ now).   \n3080 was 700$ in 2020 (848$ now).   \n\nIt’s absolutely on an incline",
                      "score": 12,
                      "created_utc": 1737751965.0,
                      "replies": []
                    },
                    {
                      "id": "m8yjznm",
                      "author": "MetalstepTNG",
                      "body": "The new class of cards have changed their naming scheme so a 4080 is really more like a 4070 ti according to the specs. So, we're paying $1000 for what should be 5080 performance but probably is more like 5070/5070 ti results if they follow in Ada Lovelace's footsteps.\n\n\nAlso, let's be honest. Hardware never sells for MSRP in it's first year of launch. Prices are going to be at least $1200+ for the 5080.\n\n\nYes, Nvidia and AMD are that greedy. No, corporations are not your friends. And yes, inflation is a bigger phenomenon than people realize with how it affects the broader economy and I will die on that hill.",
                      "score": 6,
                      "created_utc": 1737745387.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8yx3f8",
                  "author": "ThePrussianGrippe",
                  "body": "Or a Radeon 7900XT if you get lucky with sales.",
                  "score": 1,
                  "created_utc": 1737749094.0,
                  "replies": []
                },
                {
                  "id": "m91j5hu",
                  "author": "stadisticado",
                  "body": "The 90nm/65nm wafer processes those cards were built on were also like $5k per wafer vs. $20k+ for TSMC N4P for Blackwell chips.  Also it is a roughly 100x in number of transistors on the chip at about the same die size, so a cost increase really shouldn't be surprising.  This is an extrapolation, but a chip with as many transistors as an 8800 built with the 5xxx architecture would likely fit in a smartwatch and cost about $50.  Inflation is inflation, but progress is also progress.",
                  "score": 1,
                  "created_utc": 1737779878.0,
                  "replies": []
                },
                {
                  "id": "m8y6aji",
                  "author": "NoTearsOnlyLeakyEyes",
                  "body": "Yeah, but that doesn't include keeping up with inflation. Someone posted a graph of 90/titan series cards adjusted for inflation, and besides a couple spikes, it's been relatively flat. For instance a 1080ti FE, which everyone continues to use for a comparison against 30xx and 40xx cards for some stupid reason, was $700 in 2017... that's $900 today with inflation. Yeah it'll play medium settings at 1080p on modern games, but that's about it (and obviously excluding ray tracing).\n\nWhen you actually look at how much tech has improved over the last 20 years while holding or reducing prices, it's insane!!! And as it's been stated since 3000 series came out, we're starting to hit a wall with transistor size where we aren't going to see 30% generational improvements at the same power consumption.",
                  "score": 2,
                  "created_utc": 1737741583.0,
                  "replies": [
                    {
                      "id": "m8ykyqy",
                      "author": "MetalstepTNG",
                      "body": "$700 isn't $900 in inflation today. Tbh, you're repeating what marketers want consumers to hear. The value of cards now are more expensive than before even when accounting for inflation.",
                      "score": 2,
                      "created_utc": 1737745662.0,
                      "replies": [
                        {
                          "id": "m8zys18",
                          "author": "NoTearsOnlyLeakyEyes",
                          "body": "Well you can tell your anecdotal inflation numbers to the US Bureau of Labor Statistics. \n\nhttps://data.bls.gov/cgi-bin/cpicalc.pl\n\nYes, the 4080 FE was $1000 at launch, $100 more than the 1080 ti launch with actual inflation numbers, but that's also giving you 5-10x better performance. An Intel Arc B580 is an upgrade over the 1080ti and it's 1/3 the launch price. Nvidia isn't the only player in town and their focus is clearly enthusiasts who will pay a premium for their products that are objectively better than everyone else's. Don't like it, support the other guys. No one is making you buy a $1000 GPU.",
                          "score": 2,
                          "created_utc": 1737760031.0,
                          "replies": [
                            {
                              "id": "m906n0l",
                              "author": "MetalstepTNG",
                              "body": "Except inflation came from liquidity injections by the Fed from a combination of QE, stealth QE, rate cuts, SLR regulations, reverse repo agreements, and more. You can see here that 80% of all US currency currently in circulation was printed post-COVID.\n\n  \n[https://fred.stlouisfed.org/series/M1SL](https://fred.stlouisfed.org/series/M1SL)\n\n\n\nOvertime, money supply increases can equate to price increases when the supply of goods and the velocity of money remains the same. Or as they say, ceteris paribus, all else being equal. You can read more about it here:\n\n[https://investment-fiduciary.com/2022/06/22/the-key-macroeconomic-equation-all-investors-should-know/](https://investment-fiduciary.com/2022/06/22/the-key-macroeconomic-equation-all-investors-should-know/)\n\n\n\nCPI is one indicator that the Fed observes (or so they say) when deciding monetary policy for the *average increase* in prices in a very *select* group of consumer goods. That is not the same as the value of the dollar or its affect on workers.\n\n  \nSo again, $700 then isn't $900 now by inflationary standards.",
                              "score": 0,
                              "created_utc": 1737762535.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8xjpyh",
              "author": "audigex",
              "body": "8800 GTX, you mean?\n\nThe \"GTX XXY0\" naming system started with the GeForce 200 series, which was the first time it became the \"GTX range\" then later the \"RTX range\"\n\nPrior to that it was \"GeForce XX00\" (or sometimes XX50) for the model name and GTX/GT/GS/GE/GSO/GX2 was suffix referring to a performance designation rather than the name of the range\n\nBecause GTX were the best single-GPU cards nVidia had, they decided to use that as the name for the entire range when they changed their naming system rather than going to \"10800 GT\" etc\n\nMy GeForce 8800GT is my second favourite card I've ever owned, after my GTX 1080",
              "score": 3,
              "created_utc": 1737735364.0,
              "replies": [
                {
                  "id": "m8xlkd0",
                  "author": "RaDeus",
                  "body": "I had one too, with an aftermarket copper cooler 😉",
                  "score": 1,
                  "created_utc": 1737735868.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8xka07",
          "author": "None",
          "body": "[deleted]",
          "score": 24,
          "created_utc": 1737735518.0,
          "replies": [
            {
              "id": "m8xp5dt",
              "author": "Pippihippy",
              "body": "Its called the quadro line, and it starts at $4k.",
              "score": 21,
              "created_utc": 1737736850.0,
              "replies": [
                {
                  "id": "m8ye4rg",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -4,
                  "created_utc": 1737743764.0,
                  "replies": [
                    {
                      "id": "m8ymaz6",
                      "author": "Pippihippy",
                      "body": "the people buying a $2k gpu aren't looking for gaming performance, they are looking at saving $2k from buying a quadro.",
                      "score": 4,
                      "created_utc": 1737746038.0,
                      "replies": [
                        {
                          "id": "m8ytr5d",
                          "author": "shmed",
                          "body": "Not necessarily true. Im getting a 2k GPU for gaming in VR. VR mods of triple A games need a crazy amount of vram.",
                          "score": 4,
                          "created_utc": 1737748136.0,
                          "replies": []
                        },
                        {
                          "id": "m8yx7u9",
                          "author": "ashyjay",
                          "body": "\"Thankfully\" Nvidia nerfed the drivers for Geforce cards to stop Quadro/Tesla buyers from hoovering up Geforce cards.",
                          "score": 1,
                          "created_utc": 1737749130.0,
                          "replies": []
                        },
                        {
                          "id": "m8z3gsm",
                          "author": "VexingRaven",
                          "body": "Or they're looking for 4k gaming lol.",
                          "score": 0,
                          "created_utc": 1737750927.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m90gi1q",
                      "author": "Muffin_Appropriate",
                      "body": "Quadros are used heavily in medical care and businesses to support multi monitor high resolution displays \n\nI have to support them for radiology.  \n\nThey’re not meant for gaming for the most part\n\nthey are common place in business.",
                      "score": 1,
                      "created_utc": 1737765759.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8xpn13",
              "author": "None",
              "body": "[deleted]",
              "score": 14,
              "created_utc": 1737736983.0,
              "replies": []
            },
            {
              "id": "m8xzfgd",
              "author": "3-DMan",
              "body": "\"This one goes to 11(k $)..\"",
              "score": 4,
              "created_utc": 1737739691.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8z4f9b",
          "author": "Colonel-LeslieDancer",
          "body": "I’d actually rather not have a pc at all than pay a scalper",
          "score": 4,
          "created_utc": 1737751200.0,
          "replies": []
        },
        {
          "id": "m8xw64j",
          "author": "None",
          "body": "Rich people, content creators, and/or desperate hobbyists.\n\nThey all won’t care.",
          "score": 1,
          "created_utc": 1737738793.0,
          "replies": [
            {
              "id": "m8z2zde",
              "author": "TheSteiner49er",
              "body": "Desperate hobbyist with a big wallet. I cant afford all this shit.",
              "score": 1,
              "created_utc": 1737750788.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m90ivx9",
          "author": "Fyfaenerremulig",
          "body": "Same with people who buy new nVIDIA cards from the store. Idiots.",
          "score": 1,
          "created_utc": 1737766556.0,
          "replies": []
        },
        {
          "id": "m93m7jz",
          "author": "duranarts",
          "body": "Get fucked, basically. Four thousand for a card that gives you around 30% is not worth it.",
          "score": 1,
          "created_utc": 1737818086.0,
          "replies": []
        },
        {
          "id": "m8xkunk",
          "author": "SpeedflyChris",
          "body": "Even for people using them to train ML models, $4k isn't a great deal when it's only ~25% faster than a 4090.",
          "score": -1,
          "created_utc": 1737735674.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x57ar",
      "author": "timeforknowledge",
      "body": "Just limit sales to 1 per person it's not hard link that to card number or email. Anything that makes it one step more difficult than just doing a drop down for 1000",
      "score": 102,
      "created_utc": 1737731231.0,
      "replies": [
        {
          "id": "m8xnphw",
          "author": "mdonaberger",
          "body": "this is what microcenter is doing, in addition to reserving purchases to in-store only on launch day. it obviously doesn't _stop_ scalpers but it is a lot more fair.",
          "score": 41,
          "created_utc": 1737736453.0,
          "replies": [
            {
              "id": "m8y61s9",
              "author": "Peter_La_Fleur_",
              "body": "I constantly wish I had a microcenter less than 1000 miles away.",
              "score": 28,
              "created_utc": 1737741516.0,
              "replies": []
            },
            {
              "id": "m8zmgb2",
              "author": "Semyonov",
              "body": "The only thing that sucks is that micro center won't have founders edition cards for the 5090, it seems like only nvidia's website and Best buy are going to be selling them on the 30th.",
              "score": 5,
              "created_utc": 1737756303.0,
              "replies": [
                {
                  "id": "m907dzk",
                  "author": "mdonaberger",
                  "body": "Yeah, it's kind of a bummer. Those FE cards are just a work of industrial design mastery. I have a 3080 FE and I occasionally just steal glances at it cus it's just so damn _pretty._",
                  "score": 3,
                  "created_utc": 1737762777.0,
                  "replies": []
                },
                {
                  "id": "m91pysg",
                  "author": "Xendrus",
                  "body": "why would you want the FE? They're usually the ugliest and weakest version out of the lineup, just as a collectors item to eventually be sold at a yard sale for $25 in 30 years?",
                  "score": -2,
                  "created_utc": 1737782986.0,
                  "replies": [
                    {
                      "id": "m91s9ym",
                      "author": "Semyonov",
                      "body": "One, because it's going to be probably the only card that is sold at $1,999 MSRP, and two, it's only two or two and a half slots, I forget which, so it's a lot more compact than the other partner cards, and three, it seems to have an absolutely amazingly engineered cooler this time around. \n\nI've actually always gotten partner cards before, this would be my first FE if I can grab one.",
                      "score": 2,
                      "created_utc": 1737784124.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8zbk01",
          "author": "ill0gitech",
          "body": "It’s relatively easy to get multiple email addresses, less effort if you have your own domain.\n\nDepending on the country, prepaid phone numbers are easy to collect.\n\nIn-person reservations can involve checking ID, which seems the most secure way, but it’s not necessarily practical",
          "score": 4,
          "created_utc": 1737753221.0,
          "replies": [
            {
              "id": "m90v368",
              "author": "viperfan7",
              "body": "Checking off the card and address though, that's not anywhere near as easy to get around.\n\nAnd don't allow for prepaid cards either",
              "score": 4,
              "created_utc": 1737770737.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8zldgz",
          "author": "xINSAN1TYx",
          "body": "People that use bots pay for hundreds of different new emails, unique IP’s, and online credit/debit cards. They are already setup for those situations.",
          "score": 1,
          "created_utc": 1737755989.0,
          "replies": []
        },
        {
          "id": "m8zwwk4",
          "author": "Proponentofthedevil",
          "body": "Why? Say 10,000 are made. This doesn't make it any more likely that you'll get one. Even 500,000, that's 1/X of cities. 10,000,000. Not even an entire state. The people with bots will bot multiple stores. It's not like stores have access to all other stores and their customers. \n\nDoing 1000 is because they need to be made, tested, transported, distributed to suppliers, local suppliers, international suppliers, distributed to individual stores, distributed to small stores.... etc....\n\nBut yeah, 1 per person. EZ.",
          "score": 1,
          "created_utc": 1737759450.0,
          "replies": []
        },
        {
          "id": "m90acrz",
          "author": "NinjaChenchilla",
          "body": "Companies just want to sell them out… and when they see people buy scalped products for $500 more, they learn. Next time they know they can safely go up more",
          "score": 1,
          "created_utc": 1737763736.0,
          "replies": []
        },
        {
          "id": "m90m2bh",
          "author": "SnrSquishy",
          "body": "Scalpers will still try their hardest to get around that. You could just get your whole family to buy one each on their cards instead of all on your single one and do a family trip down to the store on launch day and BAM you got yourself 3-5 cards.\n\nIt makes it harder but it doesn't stop the dedicated ones.",
          "score": 1,
          "created_utc": 1737767628.0,
          "replies": []
        },
        {
          "id": "m98cj23",
          "author": "RizySS",
          "body": "1 per person is easy to bypass online. you got plenty of virtual card providers, hell even capital one allows virtual cards",
          "score": 1,
          "created_utc": 1737875837.0,
          "replies": []
        },
        {
          "id": "m8z9uwk",
          "author": "Primae_Noctis",
          "body": "I'm taking the day off and driving to Miami to get in line.",
          "score": 0,
          "created_utc": 1737752739.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x000z",
      "author": "zaccyp",
      "body": "Wait, do they actually have stock? I thought they weren't released yet?",
      "score": 173,
      "created_utc": 1737729642.0,
      "replies": [
        {
          "id": "m8x084i",
          "author": "ErsatzNihilist",
          "body": "No, but their sneakerbots will ensure they will!",
          "score": 176,
          "created_utc": 1737729713.0,
          "replies": [
            {
              "id": "m8xe6km",
              "author": "blami",
              "body": "Just saw someone cursing on random dev Discord that their bot accidentally bought 20 Dell OptiPlex 5090 PCs. Serves them right!",
              "score": 148,
              "created_utc": 1737733812.0,
              "replies": [
                {
                  "id": "m8y33pe",
                  "author": "KN_Knoxxius",
                  "body": "Not really the win you'd hope. He can just cancel the order.",
                  "score": 25,
                  "created_utc": 1737740710.0,
                  "replies": []
                },
                {
                  "id": "m8zqan9",
                  "author": "Mortwight",
                  "body": "Should I put 5090 in my ebay listing's?",
                  "score": 7,
                  "created_utc": 1737757447.0,
                  "replies": [
                    {
                      "id": "m926grm",
                      "author": "Vilzku39",
                      "body": "\"RTX 5090 founders edition drawing\"",
                      "score": 1,
                      "created_utc": 1737792166.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8x0dnw",
              "author": "zaccyp",
              "body": "Yeah I figured it was that. I'll stick with the card I have for this and next gen tbh. Fuck the 50 series.",
              "score": 19,
              "created_utc": 1737729761.0,
              "replies": [
                {
                  "id": "m8x2mci",
                  "author": "Narfi1",
                  "body": "Just got a 4080 super, I don’t see any reason to upgrade",
                  "score": 3,
                  "created_utc": 1737730455.0,
                  "replies": [
                    {
                      "id": "m8x3pvw",
                      "author": "DaSemicolon",
                      "body": "I mean\n\nIt’s the same price",
                      "score": 12,
                      "created_utc": 1737730784.0,
                      "replies": [
                        {
                          "id": "m8x42g6",
                          "author": "Narfi1",
                          "body": "I don’t see a reason to upgrade from a 40 series to a 50 \n\nBut no, nobody will be able to score a 5080 at msrp for a while",
                          "score": 5,
                          "created_utc": 1737730888.0,
                          "replies": [
                            {
                              "id": "m8x6gvy",
                              "author": "DaSemicolon",
                              "body": "If you’re able to get at the same price, GDDR7 is good\n\nAnd micro center? They have caps for how many they sell to a customer",
                              "score": 12,
                              "created_utc": 1737731604.0,
                              "replies": [
                                {
                                  "id": "m8x7e3f",
                                  "author": "Dzov",
                                  "body": "I hope to replace my 2080 with a 4080. Should be 3 times as fast.",
                                  "score": 5,
                                  "created_utc": 1737731874.0,
                                  "replies": [
                                    {
                                      "id": "m8xqx56",
                                      "author": "dargonmike1",
                                      "body": "Craigslist and Facebook marketplace my friend! I got an Aorus Xtreme 3090 for $600 when the 4000 series came out",
                                      "score": 1,
                                      "created_utc": 1737737334.0,
                                      "replies": [
                                        {
                                          "id": "m8xuqe4",
                                          "author": "IIlIIlIIlIlIIlIIlIIl",
                                          "body": "Never bought a card second hand that didn't develop issues or already had them. They're a hassle to buy (you gotta be there physically and test, otherwise your taking a risk), can put you in awkward situations, and don't even come with that big a discount anyways.",
                                          "score": 2,
                                          "created_utc": 1737738393.0,
                                          "replies": [
                                            {
                                              "id": "m8y6de4",
                                              "author": "Dzov",
                                              "body": "Yeah, it’s definitely a gamble. Could be an excellent deal, could not work at all.",
                                              "score": 2,
                                              "created_utc": 1737741604.0,
                                              "replies": [
                                                {
                                                  "id": "m8ybs4i",
                                                  "author": "dargonmike1",
                                                  "body": "It wasn’t risk free, I had to open the card up and reapply new thermal pads and paste. Wasn’t a problem for me but thinking back, I didn’t even test it 😂 i don’t even know wtf I would have done if he gave me a lemon. Sometimes people really are genuine and you can tell",
                                                  "score": 2,
                                                  "created_utc": 1737743113.0,
                                                  "replies": [
                                                    {
                                                      "id": "m8yjbpl",
                                                      "author": "Dzov",
                                                      "body": "To be fair, my brand new asus aorus 1080 had bad memory artifacts and the used card they sent back on rma was also flakey and crashed, so no guarantees what you do.  Maybe I should’ve tried repairing the card myself.",
                                                      "score": 1,
                                                      "created_utc": 1737745202.0,
                                                      "replies": [
                                                        {
                                                          "id": "m8yrvom",
                                                          "author": "dargonmike1",
                                                          "body": "Can always sell it on Craigslist as a fully functional card!",
                                                          "score": 1,
                                                          "created_utc": 1737747604.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m8x54ov",
                              "author": "positivcheg",
                              "body": "2x at best",
                              "score": 1,
                              "created_utc": 1737731209.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8xfakf",
              "author": "Sack_Sparrow",
              "body": "I have a coworker who literally has a sneakerbot and told me he was gonna grab a new card too 😮‍💨",
              "score": 7,
              "created_utc": 1737734123.0,
              "replies": [
                {
                  "id": "m8xs5tj",
                  "author": "dargonmike1",
                  "body": "So easy for some. Impossible for most",
                  "score": 7,
                  "created_utc": 1737737676.0,
                  "replies": [
                    {
                      "id": "m8xsjuo",
                      "author": "Sack_Sparrow",
                      "body": "He is kind of stereotypical in what you might think of a scalper, tbh. He lies through his teeth constantly 😅",
                      "score": 10,
                      "created_utc": 1737737785.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8x0i54",
          "author": "neverfearIamhere",
          "body": "It's people selling promised stock, the article also said some Vietnamese stores sold some units early I guess.",
          "score": 4,
          "created_utc": 1737729800.0,
          "replies": []
        },
        {
          "id": "m8y50lh",
          "author": "youngestmillennial",
          "body": "I run a computer store and I checked all of the distributors we use yesterday. Looks like they are out there, just very few and immediately scalped.",
          "score": 2,
          "created_utc": 1737741233.0,
          "replies": []
        },
        {
          "id": "m8x5dtn",
          "author": "NotAPreppie",
          "body": "This is answered if you read the article.",
          "score": -2,
          "created_utc": 1737731284.0,
          "replies": [
            {
              "id": "m8xgt08",
              "author": "None",
              "body": "That’s only ever the answer if the question is “How can I get more ads”",
              "score": 6,
              "created_utc": 1737734547.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8x6ksz",
          "author": "neuromonkey",
          "body": "Second paragraph of the article.",
          "score": 0,
          "created_utc": 1737731636.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8wzipm",
      "author": "NotAPreppie",
      "body": "![gif](giphy|VJHtXeMHViHRHvKGKm)",
      "score": 177,
      "created_utc": 1737729486.0,
      "replies": [
        {
          "id": "m8y44jd",
          "author": "None",
          "body": "[deleted]",
          "score": 10,
          "created_utc": 1737740991.0,
          "replies": [
            {
              "id": "m8z4cy0",
              "author": "VexingRaven",
              "body": "Getting a 4070 Super at MSRP is easily doable and the 4070 Ti Super is only a bit above MSRP which is typical for partner cards. The 5070 and 5070 Ti was the one I was most happy to see the prices for. It'll take some time but I believe they'll be available for MSRP eventually.",
              "score": 1,
              "created_utc": 1737751181.0,
              "replies": [
                {
                  "id": "m8zekx9",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1737754074.0,
                  "replies": [
                    {
                      "id": "m8zvocm",
                      "author": "VexingRaven",
                      "body": "Which is also now suddenly forgotten now that it's time to be mad about the next generation...",
                      "score": 1,
                      "created_utc": 1737759075.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8x6ysc",
          "author": "K3idon",
          "body": "![gif](giphy|l0HlO3BJ8LALPW4sE)",
          "score": 3,
          "created_utc": 1737731749.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x6hmo",
      "author": "None",
      "body": "IF you're stupid enough to buy from a scalper, you deserve whatever you get.",
      "score": 20,
      "created_utc": 1737731610.0,
      "replies": []
    },
    {
      "id": "m8x5zl8",
      "author": "jacobpederson",
      "body": "May they rot in hell.",
      "score": 42,
      "created_utc": 1737731462.0,
      "replies": []
    },
    {
      "id": "m8x79cq",
      "author": "Eisegetical",
      "body": "Who's willing to pay double for a 4090ti? ",
      "score": 35,
      "created_utc": 1737731835.0,
      "replies": [
        {
          "id": "m8xa80j",
          "author": "ricktencity",
          "body": "As a regular person I'm not even willing to pay half. These cards are outrageously priced to begin with.",
          "score": 35,
          "created_utc": 1737732687.0,
          "replies": [
            {
              "id": "m8ygqxe",
              "author": "guareber",
              "body": "I'd probably pay about half of 4090 MSRP when it's next time to upgrade (maybe for 60 series, my 3070 FE is still doing OK but I foresee the 8GB will get rough by then) for the halo tier product. That's similar to 1080ti prices.",
              "score": 1,
              "created_utc": 1737744491.0,
              "replies": []
            },
            {
              "id": "m8y8vu7",
              "author": "Vallywog",
              "body": "Honestly my 4090 is probably the best GPU i have ever had. It runs cool and it pretty much handles anything you throw at it easily. I even got mine below MSRP at Best Buy with a online coupon lol",
              "score": -7,
              "created_utc": 1737742305.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8xnvq7",
          "author": "Acceptable-Ticket242",
          "body": "Techbros",
          "score": 3,
          "created_utc": 1737736501.0,
          "replies": []
        },
        {
          "id": "m8y8e87",
          "author": "MaxxDelusional",
          "body": "If people are willing to pay these inflated prices, why don't the manufafturers sell them for that price?\n\nNot that I want them to, I am just curious why the rules of supply and demand don't apply here.",
          "score": 1,
          "created_utc": 1737742171.0,
          "replies": [
            {
              "id": "m8ydi23",
              "author": "rabouilethefirst",
              "body": "They already create false hype by marketing non-existent FE cards at MSRP to get people interested. Then people say “oh what the heck” when they spend a few hundred more in reality.\n\nYou can probably count the number of $1999 5090s on one hand from each manufacturer. They know what they are doing.",
              "score": 2,
              "created_utc": 1737743588.0,
              "replies": []
            },
            {
              "id": "m8yms01",
              "author": "MetalstepTNG",
              "body": "Because they can artificially rig supply to create scarcity so that the hardcore enthusiasts pay more upfront than the average hobbyist would. \n\n\nBasically, if you can get a small to medium group of people to pay you more than a large group of people would, you will cater your efforts more to the small/medium size group of people because that makes you more money.\n\n\nSo it's sort of supply and demand, but in a disingenuous kind of way where they can halt production of cards and use market psychology (via naming schemes and dishonest performance results) to get their core audience to pay considerable amounts of money for their products.",
              "score": 1,
              "created_utc": 1737746170.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8yijq9",
          "author": "TheAmazingScamArtist",
          "body": "Reddit-brained comment",
          "score": -2,
          "created_utc": 1737744987.0,
          "replies": [
            {
              "id": "m903caj",
              "author": "SoftlySpokenPromises",
              "body": "Actual Reddit brained comment",
              "score": 2,
              "created_utc": 1737761479.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xmgz3",
      "author": "kp33ze",
      "body": "Anyone who buys a 5090 from a scalper is an idiot. Have some self control.",
      "score": 9,
      "created_utc": 1737736115.0,
      "replies": []
    },
    {
      "id": "m8x188u",
      "author": "ThatDandyFox",
      "body": "I'm just excited for the 50 series to be released so the 40s drop in price and become more affordable.\n\n...\n\nThe 40 series will drop in price, right? Economics & supply and demand are still a thing, right?",
      "score": 74,
      "created_utc": 1737730028.0,
      "replies": [
        {
          "id": "m8x1g73",
          "author": "evonebo",
          "body": "You must be new to PC upgrading lol!!",
          "score": 91,
          "created_utc": 1737730096.0,
          "replies": [
            {
              "id": "m8x1k08",
              "author": "ThatDandyFox",
              "body": "I bought a 3070 pre-built when it first came out, thinking I'd keep it two years then upgrade :(",
              "score": 3,
              "created_utc": 1737730129.0,
              "replies": [
                {
                  "id": "m8x2l9n",
                  "author": "evonebo",
                  "body": "well generally theres a few options to get GPU.\n\n\n\n1. Line up at the store and hope for the bset\n\n2. buy off a scalper (do not do this, you're feeing the sharks)\n\n3. GPU are always a hot item, they will never go on sale.  (newer generations).  \n\n4. buy a used GPU off someone that is upgrading (sometimes you get screwed)\n\n5. save up and buy off a retailer at MSRP",
                  "score": 15,
                  "created_utc": 1737730446.0,
                  "replies": [
                    {
                      "id": "m8x53lw",
                      "author": "ThatDandyFox",
                      "body": "I would rather build a gpu in a cave from scraps than support a scalper",
                      "score": 15,
                      "created_utc": 1737731199.0,
                      "replies": [
                        {
                          "id": "m8x6q3p",
                          "author": "WayneKrane",
                          "body": "Yup, it’s about the principle. I’ve put off upgrading a computer for years because I ain’t paying a scalper crazy amounts of money",
                          "score": 4,
                          "created_utc": 1737731679.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8x25qh",
                  "author": "Ekgladiator",
                  "body": "Ha, I'm sitting in my 1080 ti hoping it will last me a few more years till I can scrounge something together",
                  "score": 5,
                  "created_utc": 1737730314.0,
                  "replies": [
                    {
                      "id": "m8x3218",
                      "author": "Dennma",
                      "body": "Ninja Gaiden II black actually lists the 1080 as recommended. It's a beautiful sight in 2025. I've been holding onto mine to throw into a build for my brother. God I love that card",
                      "score": 2,
                      "created_utc": 1737730586.0,
                      "replies": [
                        {
                          "id": "m8xfd5m",
                          "author": "Ekgladiator",
                          "body": "I love it too but there have been times where it shows its age (especially since I play ultrawide most of the time). Plus my windows has been acting up and I have a sinking feeling it is semi GPU related (based on event viewer). I probably just need to bite the bullet and reimage my PC again but bleh.",
                          "score": 1,
                          "created_utc": 1737734143.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8x96r6",
                      "author": "sketchy_ai",
                      "body": "I just upgraded from 1080ti to a 4070ti super and it's been really nice.",
                      "score": 1,
                      "created_utc": 1737732391.0,
                      "replies": []
                    },
                    {
                      "id": "m8xsq0h",
                      "author": "dargonmike1",
                      "body": "That card is a beast man and still kicking in my cousins PC now. I kinda miss it 🥲. It will go down in history as a one of the staples of Nvidia GPUS",
                      "score": 1,
                      "created_utc": 1737737831.0,
                      "replies": []
                    },
                    {
                      "id": "m8y8wub",
                      "author": "nuclearwinterxxx",
                      "body": "Same boat. Except that games are starting to require Ray Tracing. I can't play the new Indiana Jones. I think the new doom has it inbuilt, too.",
                      "score": 1,
                      "created_utc": 1737742313.0,
                      "replies": [
                        {
                          "id": "m8ya3z5",
                          "author": "Ekgladiator",
                          "body": "Yeah, I was a bit disappointed that I couldn't fully enjoy cyberpunk 2077 and kcd 1 still ran meh on my card (oh and Star citizen was meh), but it has otherwise held its own since I built it back in 2018",
                          "score": 1,
                          "created_utc": 1737742648.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8x2vy1",
                      "author": "Silegna",
                      "body": "I still have a 1660...",
                      "score": 0,
                      "created_utc": 1737730535.0,
                      "replies": [
                        {
                          "id": "m8x3fr8",
                          "author": "Awkward_Pangolin3254",
                          "body": "Lol. I still have an RX 480",
                          "score": 2,
                          "created_utc": 1737730700.0,
                          "replies": []
                        },
                        {
                          "id": "m8x3ban",
                          "author": "ACcbe1986",
                          "body": "I have $50 laptop I bought off NewEgg.",
                          "score": 1,
                          "created_utc": 1737730662.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8y6acr",
                  "author": "Standing_on_rocks",
                  "body": "I have one of those from Ibuypower. \n\nIt's fine. Plays everything good enough as long as I don't push Ray tracing. I'd upgrade if it was cheaper but I personally still don't see a point",
                  "score": 1,
                  "created_utc": 1737741581.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8x21vg",
          "author": "DucklingInARaincoat",
          "body": "At this rate you’re just waiting for the savings to trickle down to the 20 series lol",
          "score": 12,
          "created_utc": 1737730282.0,
          "replies": [
            {
              "id": "m8x2j6v",
              "author": "ThatDandyFox",
              "body": "Maybe when the 80 series is released I can snag a 4080",
              "score": 3,
              "created_utc": 1737730428.0,
              "replies": [
                {
                  "id": "m8x2mxr",
                  "author": "DucklingInARaincoat",
                  "body": "I applaud your optimism!",
                  "score": 1,
                  "created_utc": 1737730459.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8y5uhe",
              "author": "Darkforces134",
              "body": "I heard the price of an abacus is down",
              "score": 3,
              "created_utc": 1737741460.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8x53z2",
          "author": "None",
          "body": "Insert Anakin and Padme meme here.",
          "score": 9,
          "created_utc": 1737731203.0,
          "replies": []
        },
        {
          "id": "m8xkeri",
          "author": "audigex",
          "body": "> The 40 series will drop in price, right? Economics & supply and demand are still a thing, right?\n\nKinda, but supply and demand has two parts and you're only really considering part of that equation\n\n40 series production has already ended, so probably not really. Sure, the demand dries up when the new gen releases, but so does the supply\n\nWhether the price drop therefore depends on which dries up first. Chances are it will be hard to get hold of a 50 series card, so there will still be demand for the 40 series and prices probably won't drop massively.\n\nIt's possible that there are enough 50 series cards to go around in which case sure, the 40 series cards could drop in price a little as retailers try to offload their inventory... but I think this is probably the less likely scenario and if it does happen it won't be for long, or probably by huge amounts\n\nIf retailers had loads of cards lying around then yeah, prices would drop sharply... but I doubt many retailers are gonna be sitting on a pile of them",
          "score": 9,
          "created_utc": 1737735554.0,
          "replies": []
        },
        {
          "id": "m8x7km8",
          "author": "pumaofshadow",
          "body": "Or stocks just disappear...  Our local store is pretty sure they can't get 40's in now really and won't see 50s for months and likely at 150%+ price.",
          "score": 6,
          "created_utc": 1737731926.0,
          "replies": [
            {
              "id": "m8x9zdu",
              "author": "ThatDandyFox",
              "body": ".... Yaay\n\nI picked a real bad time to become a high end computer gamer",
              "score": 2,
              "created_utc": 1737732618.0,
              "replies": [
                {
                  "id": "m8xakqd",
                  "author": "pumaofshadow",
                  "body": "I just upgraded from a 10 year old system and got the last 4080 they had in stock/expected to get in because I went in announcement week...",
                  "score": 1,
                  "created_utc": 1737732788.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8ygxpc",
          "author": "guareber",
          "body": "Nope. 40 series gets discontinued and since the cost per frame is the same the secondary market won't drop quickly enough",
          "score": 3,
          "created_utc": 1737744544.0,
          "replies": [
            {
              "id": "m8yh3j8",
              "author": "ThatDandyFox",
              "body": "![gif](giphy|QPUg0x3VGlg6Q)",
              "score": 2,
              "created_utc": 1737744588.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8x1r98",
          "author": "Intelligent-Ad-7833",
          "body": "Nah, they will take a page from Nintendo’s book and keep price the same for a decade.",
          "score": 5,
          "created_utc": 1737730191.0,
          "replies": []
        },
        {
          "id": "m8xi8pc",
          "author": "Nasa_OK",
          "body": "Well look at how it turned out for the 30xx series:\n\nThe 40xx came out, weren’t available to purchase at retail price, so everyone who planned on getting a 40 now turned to buying 30s instead, so demand went up and so did the prices",
          "score": 2,
          "created_utc": 1737734952.0,
          "replies": []
        },
        {
          "id": "m8x2a2j",
          "author": "Suedie",
          "body": "I'm hoping that the used prices for 3090's will drop, been meaning to cop one of those for the 24 gb vram and still really good performance.",
          "score": 1,
          "created_utc": 1737730352.0,
          "replies": [
            {
              "id": "m8x3ixh",
              "author": "SpaceshipPanda",
              "body": "Going rates over on Hardwareswap seem to hover around $650-700. Note that these are rather unlikely to drop in price any time soon as they are the sweet spot for anyone messing around with LLMs (large language models) and Machine Learning outside of a professional environment. 24GB VRAM is the selling point and is the same on the 4090 but the 3090 costs a lot less. I honestly wouldn't be surprised to see them go up slightly in the coming months based on how awful the 5090 is in performance and price point.",
              "score": 2,
              "created_utc": 1737730726.0,
              "replies": [
                {
                  "id": "m8x6rz9",
                  "author": "Suedie",
                  "body": "Hmm maybe I should cop one now then. I was hoping to see it go down to below $590 but you make a good point and the US economy might act funny in the near future too, which could make hardware more expensive even here in Europe.",
                  "score": 2,
                  "created_utc": 1737731694.0,
                  "replies": [
                    {
                      "id": "m8x8q7p",
                      "author": "Coldaine",
                      "body": "Ah darn, you’re in Europe,  I am looking to offload my 3090 before sacrificing my wallet to the 5000 series gods.",
                      "score": 1,
                      "created_utc": 1737732260.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8x9byo",
          "author": "BERND_HENNING",
          "body": "There were used 4070 tis being sold for ~450€ shortly after the first '5070 faster than 4090' slides showed up but it quickly changed when it turned out to be the obvious bullshit we thought it would be. \n\nNow its back to 650€+ for a used 4070 ti. The prices for used cards really are ridiculous, even a 2080 ti is still 300-350€ in germany, a card that has been released in 2018.",
          "score": 1,
          "created_utc": 1737732432.0,
          "replies": []
        },
        {
          "id": "m8xbzeq",
          "author": "RWDPhotos",
          "body": "That was how it worked maybe ten years ago before extortionist pricing and scalping became the norm.",
          "score": 1,
          "created_utc": 1737733192.0,
          "replies": []
        },
        {
          "id": "m8y9i9p",
          "author": "clitpuncher69",
          "body": "Unironically can't wait to buy a used 4090 in about 3-4 years lol i've got a really good deal on a 3080ti his past summer and couldnt be happier with it",
          "score": 1,
          "created_utc": 1737742479.0,
          "replies": []
        },
        {
          "id": "m8ydrdd",
          "author": "rabouilethefirst",
          "body": "They won’t, because they stopped production. NVIDIA realistically could have continued production of the 4090 and sold at $1499, but they wanted to pinch people towards the 5090. It has a smaller die size, and thus would have better yields. It also has cheaper GDDR6X memory.",
          "score": 1,
          "created_utc": 1737743662.0,
          "replies": [
            {
              "id": "m8zwe52",
              "author": "Proponentofthedevil",
              "body": "Can you prove that? Or is it just easily numbers pulled out of your ass?",
              "score": 1,
              "created_utc": 1737759292.0,
              "replies": [
                {
                  "id": "m900kt4",
                  "author": "rabouilethefirst",
                  "body": "The 4090 having a smaller die size than the 5090? That is factual information. It’s using the exact same node, so yields will always be higher on the smaller die. GDDR6X is last gen, so it’s obviously cheaper.",
                  "score": 1,
                  "created_utc": 1737760594.0,
                  "replies": [
                    {
                      "id": "m90828t",
                      "author": "Proponentofthedevil",
                      "body": "> It has a smaller die size, and thus would have better yield\n\ncombined with\n\n> The 4090 having a smaller die size than the 5090\n\nWould suggest that producing two different things, would be more difficult and require two production set ups.\n\nNot everything is a conspiracy.",
                      "score": 1,
                      "created_utc": 1737762993.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8yfbtc",
          "author": "PainterRude1394",
          "body": "You understand supply and demand, but you still have no idea what's happening. Nvidia is supply constrained on the node used for the rtx 4k and rtx 5k series. There is no reason for them to continue producing worse gpus on the same node.",
          "score": 1,
          "created_utc": 1737744098.0,
          "replies": [
            {
              "id": "m8yftqi",
              "author": "ThatDandyFox",
              "body": "But my capitalism :(",
              "score": 0,
              "created_utc": 1737744235.0,
              "replies": [
                {
                  "id": "m8ykfki",
                  "author": "PainterRude1394",
                  "body": "Capitalism is when thing u no likey happen",
                  "score": 2,
                  "created_utc": 1737745511.0,
                  "replies": [
                    {
                      "id": "m8zw3nu",
                      "author": "Proponentofthedevil",
                      "body": "Capitalism is when no 5090 for free months before I can get one. Smh Jeff bozo. \n\nAlso, like listen, capitalism. What a courageous and well thought out point I made.  I deserve recognition for my intellectual insight into the state of things. Just regulate that I have one. 5090 GPU is a human right. BOOM, the universe creates one in my hand.",
                      "score": 1,
                      "created_utc": 1737759204.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8ze3px",
          "author": "None",
          "body": "best of luck",
          "score": 1,
          "created_utc": 1737753939.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x4dnt",
      "author": "Agitated-Ad-504",
      "body": "Inb4 they start complaining that they’re sitting on inventory no one wants to buy.",
      "score": 7,
      "created_utc": 1737730983.0,
      "replies": []
    },
    {
      "id": "m8yctwa",
      "author": "AReallyAsianName",
      "body": "May all scalpers have their product destroyed, stolen or unsold.",
      "score": 6,
      "created_utc": 1737743401.0,
      "replies": [
        {
          "id": "m8yjwv0",
          "author": "Veteris71",
          "body": "Scalpers wouldn't be a thing if idiots didn't buy from them.",
          "score": 6,
          "created_utc": 1737745365.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x5yqw",
      "author": "LeCrushinator",
      "body": "The scalpers are the symptom, the real problem is the people willing to pay the crazy prices, without them the scalpers disappear.",
      "score": 33,
      "created_utc": 1737731456.0,
      "replies": [
        {
          "id": "m8xldkw",
          "author": "redbluemmoomin",
          "body": "The PS5 Pro didn't sellfor scalpers....I suspect scalpers won't manage to sell that many, some for sure but I doubt huge amounts. The cards are starting at 2K MSRP...that takes a lot of people out to begin with. The reviews also don't scream must buy either.",
          "score": 3,
          "created_utc": 1737735817.0,
          "replies": []
        },
        {
          "id": "m8x84sq",
          "author": "Shekowaffle",
          "body": "No, the problem is there is not enough supply. Nvidia should at least raise their prices if they can't/won't make more cards. Econ 101",
          "score": 13,
          "created_utc": 1737732088.0,
          "replies": [
            {
              "id": "m8x9dcf",
              "author": "DouglasTwice",
              "body": "Scalpers will just buy more and control the supply. The supply is low largely because of the scalping. Scalpers benefit from a problem they help create. If they raise prices, they give competition market share in the lower price categories. \n\nBelieve it or not, there are econ classes beyond “101”.",
              "score": 23,
              "created_utc": 1737732443.0,
              "replies": [
                {
                  "id": "m8yqy1y",
                  "author": "TubbyChaser",
                  "body": "I don’t think this is true lol but I never made it past Econ 101 so what do I know.",
                  "score": 4,
                  "created_utc": 1737747340.0,
                  "replies": []
                },
                {
                  "id": "m90lerx",
                  "author": "round-earth-theory",
                  "body": "Scalpers can't withstand over supply. They rely on being able to soak up supply and sell it back out. If they can't soak up the supply, then they're 100% fucked. Drown them in supply and they will lose all of their edge.",
                  "score": 3,
                  "created_utc": 1737767407.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8xt6v6",
              "author": "dargonmike1",
              "body": "The problem is not just not enough supply. Nvidia can only make a certain amount of cards crazy profitable before the Chinese silicon manufacturers shoot the price through the roof",
              "score": 1,
              "created_utc": 1737737961.0,
              "replies": []
            },
            {
              "id": "m8zvh8x",
              "author": "Proponentofthedevil",
              "body": "\"Just make more,\" genius idea. Just make enough for each person on earth. Like smh my head.",
              "score": 0,
              "created_utc": 1737759016.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8zxoa6",
          "author": "FizzingOnJayces",
          "body": "...the problem is that there is still a market for cards which price out a significant amount of people?\n\nIs the problem with Ferrari that their cars are too expensive too?\n\nThese new cards are a luxury item.  People who can't afford the retail price are not the target audience.  Buy the 40 or 30 series and move on.\n\nBlaming the company for charging a price they deem to be profit maximizing just because you're not in their target market is crazy.\n\nBut this is Reddit, I guess.",
          "score": 2,
          "created_utc": 1737759686.0,
          "replies": [
            {
              "id": "m902o3j",
              "author": "LeCrushinator",
              "body": "My problem is high-end cards are twice what they used to be, even accounting for inflation. Maybe there is a market out there for it, but it means a smaller percentage of players these days get to enjoy higher settings than in the past. This is driving up the cost for PC gaming as a hobby, unless, over time, players just start using lower and lower quality settings and older or lower-end cards.",
              "score": 1,
              "created_utc": 1737761263.0,
              "replies": [
                {
                  "id": "m90jn4v",
                  "author": "None",
                  "body": "What game will you see a meaningfully *different* experience using a 5090 over a 4090. The problem gamers have with the '90 series card is that they think they are for them. They are not. They are for prosumers. A gamer can use it just like a gamer could use a titan back in the day. Neither card was *for* gamers though. 4080/5080 is the gamer card. You go above that, you are going to really pay for it, because those cards are really competing with the 100/200 series chips and more or less have completely replaced the much more expensive Quadro line. Gamers think they are getting screwed buying one and professionals think they are getting a deal.\n\nHell, the only reason they are selling to gamers at all is because of the hype. ~10% of their profit comes from consumer products today. They would make more money scrapping the consumer division and just selling the chips themselves to the corporate sector. The only reason they are still supplying gamers is there is no better hype machine on the planet than PC gamers. 24/7/365 complaining about how expensive and hard to get Nvidia's top cards are. Sounds like the best in the world to me... and their stock brokers.",
                  "score": 1,
                  "created_utc": 1737766812.0,
                  "replies": []
                },
                {
                  "id": "m90k68b",
                  "author": "FizzingOnJayces",
                  "body": "40 series cards are more than enough to 'enjoy higher settings'.  \n\nPeople unable to afford the 50 series cards likely also so not have the other hardware required to play games at absolute max settings.  \n\nYou can literally enjoy 95% of games on near-max settings with a 40 series card.\n\n50 series cards are not required at all. They are a luxury item.",
                  "score": 1,
                  "created_utc": 1737766990.0,
                  "replies": [
                    {
                      "id": "m90voi7",
                      "author": "LeCrushinator",
                      "body": "40 series was and is too expensive also.",
                      "score": 1,
                      "created_utc": 1737770946.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8xzzn6",
      "author": "kage918",
      "body": "“No refunds” 💀 yeah that’s gonna be a brick in the box",
      "score": 6,
      "created_utc": 1737739846.0,
      "replies": []
    },
    {
      "id": "m8xbsb2",
      "author": "Berdariens2nd",
      "body": "Idiots already paying double**.  Ftfy",
      "score": 4,
      "created_utc": 1737733136.0,
      "replies": []
    },
    {
      "id": "m8xzq4p",
      "author": "ssj2yugi",
      "body": "You know how to stop ALL scalpers? Stop buying from them",
      "score": 3,
      "created_utc": 1737739773.0,
      "replies": [
        {
          "id": "m8yl0co",
          "author": "IvaNoxx",
          "body": "there are still people with a lot of money to throw away , they dont care if they throw extra 1 , 2k for a card if it means they will get it among the first people",
          "score": 1,
          "created_utc": 1737745675.0,
          "replies": []
        },
        {
          "id": "m8yj4i6",
          "author": "SnooStrawberries1078",
          "body": "Same with cars, houses...& STD's? Sadly it seems we're not equipped as a species to do the smart thing 😖",
          "score": 1,
          "created_utc": 1737745147.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x2ydi",
      "author": "RottenPingu1",
      "body": "I judging by how desperate the fanboys are they must be making a killing.",
      "score": 5,
      "created_utc": 1737730555.0,
      "replies": []
    },
    {
      "id": "m8x5thy",
      "author": "GivesBadAdvic",
      "body": "The solution to scalpers is easy. Don’t buy it from them. Self control. Nobody needs a 5090.",
      "score": 8,
      "created_utc": 1737731412.0,
      "replies": []
    },
    {
      "id": "m8xgm8n",
      "author": "Juandisimo117",
      "body": "Tf is this headline \"no refunds\"??? When the fuck was there ever refund policies expected from resellers??",
      "score": 3,
      "created_utc": 1737734495.0,
      "replies": []
    },
    {
      "id": "m8y5ajc",
      "author": "darkknight302",
      "body": "Don’t buy and let the scalpers waste their money = win for everyone. I’m sure someone will buy it to flex so yeah…..",
      "score": 3,
      "created_utc": 1737741309.0,
      "replies": []
    },
    {
      "id": "m8ynbte",
      "author": "None",
      "body": "How to beat scalpers in one step: don’t buy from them.",
      "score": 3,
      "created_utc": 1737746325.0,
      "replies": []
    },
    {
      "id": "m8yqrum",
      "author": "MoccaLG",
      "body": "SCALPING only works when you play the game too....",
      "score": 3,
      "created_utc": 1737747291.0,
      "replies": []
    },
    {
      "id": "m8ywx5e",
      "author": "ChordLogic",
      "body": "imagjne selling a 4090 to findout the 5090 is a potato for $5k",
      "score": 3,
      "created_utc": 1737749044.0,
      "replies": []
    },
    {
      "id": "m8x7bpo",
      "author": "isaac2004",
      "body": "For exactly one second I considered upgrading from a 3090. I took too long",
      "score": 6,
      "created_utc": 1737731855.0,
      "replies": []
    },
    {
      "id": "m91hw1v",
      "author": "crybannanna",
      "body": "STOP BUYING SHIT FROM SCALPERS, and they will stop doing this shit.  \n\nYou don’t fucking need whatever they are selling that badly.",
      "score": 4,
      "created_utc": 1737779339.0,
      "replies": []
    },
    {
      "id": "m8x314i",
      "author": "treemoustache",
      "body": "Wow, I should get into scalping /s.",
      "score": 2,
      "created_utc": 1737730579.0,
      "replies": [
        {
          "id": "m8yjw7p",
          "author": "Remarkable-NPC",
          "body": "nope, you really should do \n\nif I have money, I will because there is someone who will buy 2x and 3x the price \n\nit's easy money and who buy from scalpers they deserve it",
          "score": 0,
          "created_utc": 1737745360.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8x8qsg",
      "author": "b_a_t_m_4_n",
      "body": "Fucking  parasites.",
      "score": 2,
      "created_utc": 1737732264.0,
      "replies": []
    },
    {
      "id": "m8xd42f",
      "author": "v3bbkZif6TjGR38KmfyL",
      "body": "Good for them. They deserve it! Everyone knows that scalpers are unsung heros!",
      "score": 2,
      "created_utc": 1737733509.0,
      "replies": []
    },
    {
      "id": "m8xjh8m",
      "author": "Newbianz",
      "body": "too bad the \"no refunds\" doesnt work on ebay as they always allow it",
      "score": 2,
      "created_utc": 1737735297.0,
      "replies": []
    },
    {
      "id": "m8xmhpe",
      "author": "Spirited_Example_341",
      "body": "well it would REALLY HELP if companies start predicting better demand of its products so that scalpers would happen less\n\nseriously would think by now they would have a better system in place to balance supply and demand",
      "score": 2,
      "created_utc": 1737736120.0,
      "replies": [
        {
          "id": "m8zy8y0",
          "author": "FizzingOnJayces",
          "body": "You think Nvidia doesn't understand this 'problem' perfectly?\n\nNvidia doesn't care about scalpers.  They're here to maximize profits by setting an appropriate price.  \n\nIf they deemed that higher quality and lower prices yielded more profit, they would produce more cards at a lower price.",
          "score": 1,
          "created_utc": 1737759866.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xsvwc",
      "author": "jert3",
      "body": "Nothing compared to 3 generations ago during covid here in Canada. I worked for a tech compant and literally could not find any high end video cards or top end macbooks to buy for many months. Literally no stores had any, anywhere, they could simply not be purchased.",
      "score": 2,
      "created_utc": 1737737876.0,
      "replies": []
    },
    {
      "id": "m8y0zsh",
      "author": "karateninjazombie",
      "body": "Gtx1070 gang! Assemble!",
      "score": 2,
      "created_utc": 1737740127.0,
      "replies": [
        {
          "id": "m8zbhf9",
          "author": "OopsIHadAnAccident",
          "body": "1060 here! Ha",
          "score": 1,
          "created_utc": 1737753201.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8y1c7c",
      "author": "Parukia_de_Bolivar",
      "body": "NEVER buy from scalpers",
      "score": 2,
      "created_utc": 1737740224.0,
      "replies": []
    },
    {
      "id": "m8y68mc",
      "author": "JimboNovus",
      "body": "Solution: don’t buy one.  Wait a few months.",
      "score": 2,
      "created_utc": 1737741568.0,
      "replies": []
    },
    {
      "id": "m8ygvxg",
      "author": "None",
      "body": "STOP! FUCKING! BUYING! IT!!!!!!!!!!!!!!!!!!!!!!!!!:!:!;!;€:€3!2&2&:!:!3!:4!3 ejeirir r f rne",
      "score": 2,
      "created_utc": 1737744530.0,
      "replies": []
    },
    {
      "id": "m8yswdu",
      "author": "mars92",
      "body": "If someone is dumb enough to pay those prices, it's just an idiot tax.",
      "score": 2,
      "created_utc": 1737747893.0,
      "replies": []
    },
    {
      "id": "m8zchur",
      "author": "DIRTRIDER374",
      "body": "Skill issue, scalpers only exist because people are dumb enough to buy from them",
      "score": 2,
      "created_utc": 1737753487.0,
      "replies": []
    },
    {
      "id": "m8zn6lm",
      "author": "smiggy100",
      "body": "Don’t buy them, then scalping would not be a thing. \n\nPeople who buy them are the problem. Leave them to lose money and don’t buy.",
      "score": 2,
      "created_utc": 1737756517.0,
      "replies": []
    },
    {
      "id": "m8zp1u8",
      "author": "LookAlderaanPlaces",
      "body": "Scalpers need to be heavily prosecuted. This whole situation is so fucking unnecessary and stupid.",
      "score": 2,
      "created_utc": 1737757073.0,
      "replies": [
        {
          "id": "m906ne0",
          "author": "azmus",
          "body": "Why not just increase supply?",
          "score": 2,
          "created_utc": 1737762538.0,
          "replies": [
            {
              "id": "m90jv2d",
              "author": "LookAlderaanPlaces",
              "body": "Because it doesn’t work this way in reality. Companies will try to choke the supply for many reasons, like diamonds, for profit. Companies also don’t give a shit about scalpers cause they sell their shit anyways. Companies make supply count decisions for many reasons and scalpers just can’t be one of them.. and more",
              "score": 1,
              "created_utc": 1737766885.0,
              "replies": [
                {
                  "id": "m90pl86",
                  "author": "azmus",
                  "body": "I’m not sure why companies are supplying these graphics cards at such steep discounts when the market is willing to pay 2x more.  Often times it’s the government and their regarded policies damaging or destroying supply chains, restricting supply.",
                  "score": 1,
                  "created_utc": 1737768837.0,
                  "replies": [
                    {
                      "id": "m90u3uw",
                      "author": "LookAlderaanPlaces",
                      "body": "This isn’t just graphics cards. It’s concert tickets, Nintendo switches, shoes, so many many things. There are a bunch of reasons, collector value where people try to ride and create the artificial squeezes in the market like stocks, there is just genuinely wanting to go to a concert and there is no other way to do the thing, etc. My only point is it’s not always possible to just increase the supply form the company’s perspective, and that people buying a thing just to charge double for it while adding zero value shouldn’t be a thing. It makes shit less available for everyone, wya more expensive, etc. These people are leeches and should get a real job or find a different side hustle that does fuck everyone else over.",
                      "score": 2,
                      "created_utc": 1737770391.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m913a87",
      "author": "Shifted4",
      "body": "Ebay will side with the buyer regardless of whether it says no refunds/returns. A simple item not as described will pretty much always end in the buyer's favor.",
      "score": 2,
      "created_utc": 1737773672.0,
      "replies": []
    },
    {
      "id": "m92aljj",
      "author": "Bropulsion",
      "body": "These cards are gonna have an artificially low supply on release and then a month or 2 after gonna be flooding the market is my guess. If you earlybird a scalped card its fully on you.",
      "score": 2,
      "created_utc": 1737794738.0,
      "replies": []
    },
    {
      "id": "m92cfws",
      "author": "Typemessage1",
      "body": "Stop blaming \"scalping\".\n\n\nIts basically the \"boogeyman\" used to distract you from the fact NVIDIA is responsible for this.\n\n\nThat's why there are articles ready to drop with \"OMG SOLD OUT! LIMITED SUPPLY!\" \n\n\nEveryone just stop.\n\n\nYou're being manipulated by demonic capitalism.",
      "score": 2,
      "created_utc": 1737795894.0,
      "replies": []
    },
    {
      "id": "m936mxm",
      "author": "4xel_dma",
      "body": "Gpu’s are being released faster than games. The recommended specs for most games includes an rtx 2080 or higher.\n\nI am so close to upgrading my rtx 3060ti, but honestly it’s been keeping up with all games at recommended settings at 1080p. I don’t care much for 4K atm\n\nI’ll probably wait until people kill each other for 5090s and then buy a 4090 lol\n\nDevs need to step their shit up and keep up with GPUs being released",
      "score": 2,
      "created_utc": 1737812500.0,
      "replies": []
    },
    {
      "id": "m93f8td",
      "author": "KrackSmellin",
      "body": "What’s more wrong?  That scalpers bought it and set the price at 2x, or that there are people stupid enough to pay for it?  Because that’s the problem… there is never a demand if folks don’t want to pay for it.",
      "score": 2,
      "created_utc": 1737815729.0,
      "replies": []
    },
    {
      "id": "m94oc83",
      "author": "epidemica",
      "body": "Stopped caring about anything new or limited release thanks for resellers.\n\nMy retirement account is enjoying the new way of life.",
      "score": 2,
      "created_utc": 1737829203.0,
      "replies": []
    },
    {
      "id": "m97fpoa",
      "author": "Beneficial-Jump-7919",
      "body": "I think after the PS5 debacle, more people have become patient to wait until supply catches up. But seriously though, scalpers and “hustle culture” is starting to ruin market releases in general.",
      "score": 2,
      "created_utc": 1737861031.0,
      "replies": []
    },
    {
      "id": "m8x5qdm",
      "author": "Nubz66",
      "body": "Fuck scalpers. Those guys need to be shut down.",
      "score": 4,
      "created_utc": 1737731387.0,
      "replies": []
    },
    {
      "id": "m8x247o",
      "author": "I_T_Gamer",
      "body": "Imagine the impact, if every actual customer of these devices just waited 6-8 months.  Hard to do I know, as I recently picked up a 4070Ti as I only game at 2k.   I initially wanted to wait for the 5k launch in hopes that it would have a positive impact for me as a buyer on the 4k line.  Traditionally the impact is about 10% from my research.   I'm happy with the purchase at this point, and $60 is a nominal fee to have what I wanted right now.\n\nConsider that outlook when buying a $1500 card at double the price.  I feel like the FOMO would be significantly outweighed by the additional $1500 I'd have to shell to get hands on one.   I would love for these opportunists to barely get back their initial investment.  However I know that folks will willing pay double for something RIGHT NOW.   Happy to be in the age group that 4k really doesn't matter since I'd need glasses to see the improvement over 2k.",
      "score": 3,
      "created_utc": 1737730301.0,
      "replies": []
    },
    {
      "id": "m8xaam3",
      "author": "onedestiny",
      "body": "Don't buy this garbage guys..",
      "score": 2,
      "created_utc": 1737732708.0,
      "replies": [
        {
          "id": "m8xl3n5",
          "author": "lifestop",
          "body": "Don't worry, I wouldn't touch the 5090 for 2k, so this doesn't bother me at all.",
          "score": 1,
          "created_utc": 1737735741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xehze",
      "author": "cheknauss",
      "body": "Scalping needs to be made illegal. It's so ridiculous. And don't give me that bullcrap about capitalism and bla bla bla. If that's your advice, go watch Steven Seagal movies until your eyes become permanently crossed. \n\nIt's horrible and it needs to be punished.",
      "score": 2,
      "created_utc": 1737733902.0,
      "replies": [
        {
          "id": "m8y33yh",
          "author": "NardistOfficial",
          "body": "How do you distinguish between selling used goods and scalping though? A certain time frame after a product’s release? How is that enforced?",
          "score": 0,
          "created_utc": 1737740712.0,
          "replies": [
            {
              "id": "m8y87qp",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1737742121.0,
              "replies": [
                {
                  "id": "m8yo7ef",
                  "author": "NardistOfficial",
                  "body": "If someone is willing to pay the price, why not? You don’t like scalping, that doesn’t mean it should be illegal. There’s no difference between stores buying from wholesalers and reselling at marked up prices and scalpers buying from retailers and selling at marked up prices. The only shitty factor is the dumbasses who buy the scalped goods.",
                  "score": 1,
                  "created_utc": 1737746570.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8xc6f4",
      "author": "ScamperAndPlay",
      "body": "Nvidia is doing the scalping, just like Ticketmaster. Wake up..",
      "score": 2,
      "created_utc": 1737733247.0,
      "replies": []
    },
    {
      "id": "m8xrpdu",
      "author": "Shibbystix",
      "body": "The thing that bugs me is it's all about bragging rights at this point. I have a 2080 TI and I run literally every game I've ever played on Max graphics with no problems. There hasn't been a single game that it can't handle so outside of crypto farming or some very intense graphic rendering, I can't see how this wouldn't absolutely be resolved if people just stop trying to get a slightly higher score on 3D mark",
      "score": 2,
      "created_utc": 1737737550.0,
      "replies": [
        {
          "id": "m8xvaup",
          "author": "Candle1ight",
          "body": "You're still playing at 1080p, not everyone is.",
          "score": 2,
          "created_utc": 1737738551.0,
          "replies": [
            {
              "id": "m8xxja3",
              "author": "Shibbystix",
              "body": "Not only do I play at 4k, but I have dual monitor 4k monitors and usually watch movies on 1 while gaming on the other",
              "score": 1,
              "created_utc": 1737739169.0,
              "replies": [
                {
                  "id": "m8ykl5b",
                  "author": "Candle1ight",
                  "body": "Then you're fine with low FPS I guess, I have a more powerful card than you and can't max out things at 4k without dipping well under 60fps.",
                  "score": 3,
                  "created_utc": 1737745555.0,
                  "replies": [
                    {
                      "id": "m8yue8e",
                      "author": "Shibbystix",
                      "body": "OoOOOOr, not every game people play is made to tax 4k boundaries.\n\nI'm sure it COULD matter to some, but that wasn't my point now was it? My point is that the PROBLEM with scalpers is largely contributed to by massive numbers of gamers desperate to address \"is my number bigger\" as opposed to \"does it impact my game performance and experience\"\n\nThose are people continually willing to pay above market prices to have the latest and greatest because it's new Shiney, not because they are filling the need.\n\n\nTo that, my point still stands, as i didn't claim i have the highest fps.\nI stated that I run every game on Max with no performance hindrances \n\nI worked for a mobile IT company in a major city for almost 2 years right when the 3000 series came out and them immediately after the 4000 series, and I can't tell you how many calls I had to swap out perfectly good 2080s in exchange for 3080s and then even had some return customers that hadn't even utilized the 3000s have me swap out for 4000s.\n\nI was able to take home a number of 1070s, 1080s, 2070s, 2080s and 2080tis from these people who were convinced they HAD to have the newest or their games wouldn't work well. I gave em all out to people who had way older, shittier cards who played games on my discord, and everyone I gave upgrades to are having fun playing games on higher settings now, and having a blast, without wingeing over \"i can't game without a new 5080ti\n\nAnd myself on a 2080ti as well as the others that still run em that I play with all look at the newer cards and drool over how cool it would be, but everyone has discussed this each time a new card comes out, and pretty much everyone agrees, there's no game with graphics so intense that we're over here struggling to run at max graphics. (For the 2080tis at least) \n\nAnd games have such varied art styles that even the 2070s are unaffected most games",
                      "score": -4,
                      "created_utc": 1737748316.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8yg6qt",
                  "author": "droppinkn0wledge",
                  "body": "You’re absolutely full of shit then. A 2080ti is not “handling everything you can throw at it” at 4k resolution. Are you averaging 25fps? Gtfoh",
                  "score": 3,
                  "created_utc": 1737744336.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8x2gq8",
      "author": "Maxpowerxp",
      "body": "I just want a basic 4060",
      "score": 1,
      "created_utc": 1737730407.0,
      "replies": []
    },
    {
      "id": "m8x9am1",
      "author": "Splatty15",
      "body": "I’ll wait and see what the performance for the 9070 is like. Fuck scalpers.",
      "score": 1,
      "created_utc": 1737732422.0,
      "replies": []
    },
    {
      "id": "m8xb5d2",
      "author": "KICKASSKC",
      "body": "Its funny that people would even entertained the idea that these cards would go for msrp.",
      "score": 1,
      "created_utc": 1737732954.0,
      "replies": []
    },
    {
      "id": "m8xcadg",
      "author": "clit_or_us",
      "body": "I can't enjoy shit these days cause of fucking scalpers. I haven't seen Pokemon cards in weeks and now they want to take away any prospect of tech upgrades? TBH, I can't afford it, but two of my hobbies are filled with scalpers. It's upsetting to constantly read about this. I'm about to take up knitting or some shit.",
      "score": 1,
      "created_utc": 1737733278.0,
      "replies": []
    },
    {
      "id": "m8xcby6",
      "author": "darknetwork",
      "body": "Most of time, i never trust a post that claim he/she bought expensive GPU for discount.",
      "score": 1,
      "created_utc": 1737733290.0,
      "replies": []
    },
    {
      "id": "m8xcngi",
      "author": "MarceloWallace",
      "body": "Will be cool if stores start requiring IDs and only allow one purchase of GPUs a year",
      "score": 1,
      "created_utc": 1737733380.0,
      "replies": []
    },
    {
      "id": "m8xdcvo",
      "author": "SirJavalot",
      "body": "Cant wait to see the price in Uruguay where we already pay double or more for tech, I expect $5k.",
      "score": 1,
      "created_utc": 1737733579.0,
      "replies": []
    },
    {
      "id": "m8xddb2",
      "author": "Tommy__want__wingy",
      "body": "All because people need to have smoother blades of grass…",
      "score": 1,
      "created_utc": 1737733582.0,
      "replies": []
    },
    {
      "id": "m8xdgjk",
      "author": "Azrael-XIII",
      "body": "Charging *double*?  Imagine paying $4000 for a gpu… smh",
      "score": 1,
      "created_utc": 1737733607.0,
      "replies": []
    },
    {
      "id": "m8xepr2",
      "author": "t3nsi0n_",
      "body": "You can have them - I can wait.",
      "score": 1,
      "created_utc": 1737733962.0,
      "replies": []
    },
    {
      "id": "m8xgps6",
      "author": "h0tel-rome0",
      "body": "Is the market that large for these things?",
      "score": 1,
      "created_utc": 1737734521.0,
      "replies": []
    },
    {
      "id": "m8xhlho",
      "author": "bert4560",
      "body": "Easy....Just don't pay that. They can hold the bag after production ramps up.",
      "score": 1,
      "created_utc": 1737734772.0,
      "replies": []
    },
    {
      "id": "m8xhnws",
      "author": "TuggMaddick",
      "body": "Yeah, I'll just stick with my playstation, thanks. I play pixel art games and shit from 7-8 years ago, and I'm quite glad to not care enough about squeezing every pixel of detail to the point where the diminishing returns of graphical updates is worth that kinda money to me. I can just upgrade shit around the house for that amount of scratch and increase the value of my long-term assets instead of graphics-maxing.",
      "score": 1,
      "created_utc": 1737734790.0,
      "replies": []
    },
    {
      "id": "m8xjzfh",
      "author": "trademefortnite",
      "body": "It’s so hard to find these rn😵‍💫",
      "score": 1,
      "created_utc": 1737735437.0,
      "replies": []
    },
    {
      "id": "m8xk9ih",
      "author": "Omnom_Omnath",
      "body": "Feel free to not buy one from them.",
      "score": 1,
      "created_utc": 1737735514.0,
      "replies": []
    },
    {
      "id": "m8xm6lq",
      "author": "Jaquemon",
      "body": "I fixed the headline: Dumbasses already paying paying double with no refunds for GeForce RTX 5090",
      "score": 1,
      "created_utc": 1737736036.0,
      "replies": []
    },
    {
      "id": "m8xmuo1",
      "author": "Liberate90",
      "body": "This shit again...",
      "score": 1,
      "created_utc": 1737736220.0,
      "replies": []
    },
    {
      "id": "m8xnho4",
      "author": "mdonaberger",
      "body": "the literal only reason i am looking forward to this is because i have a microcenter within distance of a 15 minute drive. still pretty low chances showing up early will net me one.",
      "score": 1,
      "created_utc": 1737736394.0,
      "replies": []
    },
    {
      "id": "m8xnwuv",
      "author": "Cl4whammer",
      "body": "Maybe iam wrong, but wasnt the 30th the release date? How did they already got cards?",
      "score": 1,
      "created_utc": 1737736509.0,
      "replies": []
    },
    {
      "id": "m8xq1iv",
      "author": "Jaexa-3",
      "body": "The presale from scalpers are so funny",
      "score": 1,
      "created_utc": 1737737092.0,
      "replies": []
    },
    {
      "id": "m8xrkmg",
      "author": "None",
      "body": "5090 is 3000 euros on legitimate stores in the EU... \n\nI'm at the point where I judge people for having more money than brains when they say they have a 90 card",
      "score": 1,
      "created_utc": 1737737514.0,
      "replies": []
    },
    {
      "id": "m8xrsoh",
      "author": "GraveyardGuardian",
      "body": "“Retailers continue to not give a shit because $ is $ and no one lets them upcharge, and you’ll come back next time so they give zero Fs about your loyalty… so kick rocks at low resolution”",
      "score": 1,
      "created_utc": 1737737575.0,
      "replies": []
    },
    {
      "id": "m8xs5xf",
      "author": "Danabler42",
      "body": "Yeah so I'll be hanging on to my EVGA 3080ti till it stops working then, I guess",
      "score": 1,
      "created_utc": 1737737677.0,
      "replies": []
    },
    {
      "id": "m8xs67v",
      "author": "Maghorn_Mobile",
      "body": "I'll wait, or skip it entirely",
      "score": 1,
      "created_utc": 1737737679.0,
      "replies": []
    },
    {
      "id": "m8xsm6k",
      "author": "madding247",
      "body": "oh for fuck sake.\n\nBest to wait another year then.",
      "score": 1,
      "created_utc": 1737737802.0,
      "replies": []
    },
    {
      "id": "m8xso2v",
      "author": "Majorjim_ksp",
      "body": "Good luck enforcing no refund in the EU. 🤣",
      "score": 1,
      "created_utc": 1737737817.0,
      "replies": []
    },
    {
      "id": "m8xtyjc",
      "author": "xGHOSTRAGEx",
      "body": "You know it's a screwed market when even scalpers have shit on pre-order",
      "score": 1,
      "created_utc": 1737738174.0,
      "replies": []
    },
    {
      "id": "m8xuctg",
      "author": "GhostPartical",
      "body": "And here I am rocking the same 2080 I got in 2020.",
      "score": 1,
      "created_utc": 1737738286.0,
      "replies": []
    },
    {
      "id": "m8xue5s",
      "author": "TheBatemanFlex",
      "body": "I'm sorry but there is no game worth paying the scalp price on release just so you can play it in 4k VR ultra-settings 6 months before everyone else. Is the demand driven by miners?",
      "score": 1,
      "created_utc": 1737738296.0,
      "replies": [
        {
          "id": "m8zv3is",
          "author": "Proponentofthedevil",
          "body": "It's probably your first group. Some people have nore money than sense, or simply have different ideas of what they're willing to get for that money. PCVR people are likely to fall in this group.",
          "score": 1,
          "created_utc": 1737758898.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xuhpm",
      "author": "alidan",
      "body": "if you really want a 5090, your best route to get one is always going to be prebuilt, you pay over priced numbers for everything, but it comes out cheaper than the scalper charge, and if you really wanted to, sell off the hardware and case that comes with it.",
      "score": 1,
      "created_utc": 1737738324.0,
      "replies": []
    },
    {
      "id": "m8xuqyv",
      "author": "PhantomTissue",
      "body": "$4000 for a 5090?? $4000? Four fucking thousand? That’s fucking absurd. The card is not worth the same a a USED CAR.",
      "score": 1,
      "created_utc": 1737738398.0,
      "replies": [
        {
          "id": "m8zuqsk",
          "author": "Proponentofthedevil",
          "body": "Tbh, I'd use the 5090 more than more car. If about of use, quality of time using, even resale value, means enough to someone, the 5090 could easily outweigh the value of that car. \n\nI am not one if those people who would pay though. I'm happy waiting for a used 4090.",
          "score": 1,
          "created_utc": 1737758791.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xwt2q",
      "author": "Shibbystix",
      "body": "I play in 4k",
      "score": 1,
      "created_utc": 1737738967.0,
      "replies": []
    },
    {
      "id": "m8xyyal",
      "author": "HalfDirtBoi",
      "body": "I think scalpers personal info should become required as to hang them.",
      "score": 1,
      "created_utc": 1737739559.0,
      "replies": []
    },
    {
      "id": "m8y167t",
      "author": "Zionview",
      "body": "Can someone explain the urgency in getting the newer version,,, are the few frames or whatever better in new ones that much impressive or is it just there are so many with older gen ones that wants a upgrade",
      "score": 1,
      "created_utc": 1737740177.0,
      "replies": [
        {
          "id": "m901h3n",
          "author": "krunz",
          "body": "There is a segment of consumers that just want the fastest/latest/greatest (which the 5090 is).  There is nothing impressive about this iteration... the joke is that it's basically still just a 4090.",
          "score": 2,
          "created_utc": 1737760881.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8y3xp7",
      "author": "Boundish91",
      "body": "What else is new?",
      "score": 1,
      "created_utc": 1737740939.0,
      "replies": []
    },
    {
      "id": "m8y7k7x",
      "author": "lightninhopkins",
      "body": "But why though? I mean except for maybe mining what would be the rush to get this card?",
      "score": 1,
      "created_utc": 1737741938.0,
      "replies": []
    },
    {
      "id": "m8y86dm",
      "author": "m_kamalo",
      "body": "TIL that already an overpriced GPU is worth being scalped.",
      "score": 1,
      "created_utc": 1737742110.0,
      "replies": []
    },
    {
      "id": "m8y8i0z",
      "author": "Va1crist",
      "body": "This is why I don’t care about GPUs anymore",
      "score": 1,
      "created_utc": 1737742200.0,
      "replies": []
    },
    {
      "id": "m8yq3ip",
      "author": "Abba_Fiskbullar",
      "body": "The $5090?",
      "score": 1,
      "created_utc": 1737747101.0,
      "replies": []
    },
    {
      "id": "m8z1fp4",
      "author": "Abs0lutZero",
      "body": "Here we go again",
      "score": 1,
      "created_utc": 1737750343.0,
      "replies": []
    },
    {
      "id": "m8z2ib2",
      "author": "None",
      "body": "Refunds from scalpers? lol",
      "score": 1,
      "created_utc": 1737750650.0,
      "replies": []
    },
    {
      "id": "m8z7x4c",
      "author": "Taki_Minase",
      "body": "If you buy off a scalper, you are the problem.",
      "score": 1,
      "created_utc": 1737752188.0,
      "replies": []
    },
    {
      "id": "m8za05o",
      "author": "beleidigtewurst",
      "body": "Amusing, for such a meh card.\n\nBut naturally, dumdums gonna dumdum.",
      "score": 1,
      "created_utc": 1737752781.0,
      "replies": []
    },
    {
      "id": "m8zdtnh",
      "author": "None",
      "body": "and they’ll get it.  people are idiots",
      "score": 1,
      "created_utc": 1737753862.0,
      "replies": []
    },
    {
      "id": "m8zjlwe",
      "author": "RexKramerDangerCker",
      "body": "Why do they want this so badly?",
      "score": 1,
      "created_utc": 1737755491.0,
      "replies": []
    },
    {
      "id": "m8znpl4",
      "author": "fredl0bster",
      "body": "Look I know this is shitty. But I think scalpers should get the death penalty.",
      "score": 1,
      "created_utc": 1737756675.0,
      "replies": []
    },
    {
      "id": "m8zshm2",
      "author": "None",
      "body": "So then don’t buy it",
      "score": 1,
      "created_utc": 1737758108.0,
      "replies": []
    },
    {
      "id": "m90093c",
      "author": "SolidusBruh",
      "body": "So 3070s won’t be dropping in price anytime soon, eh?",
      "score": 1,
      "created_utc": 1737760491.0,
      "replies": []
    },
    {
      "id": "m901dw3",
      "author": "Brando6677",
      "body": "Ok cool and? We already knew they would. Well those of us that can critically think. Don’t buy it’s that fuckin simple. Stick all of these clowns with 5090s they can’t sell unless they go UNDER MSRP",
      "score": 1,
      "created_utc": 1737760853.0,
      "replies": []
    },
    {
      "id": "m904076",
      "author": "Hottentott14",
      "body": "I cannot imagine a more \"loser who thinks they're clever but they're actually just shameless enough to do stuff other people are too good for\" thing than scalping (at least among relatively mundane things to do). Maybe paparazzi compete for the throne.",
      "score": 1,
      "created_utc": 1737761692.0,
      "replies": []
    },
    {
      "id": "m9077gc",
      "author": "ultimapanzer",
      "body": "I hate everything.",
      "score": 1,
      "created_utc": 1737762718.0,
      "replies": []
    },
    {
      "id": "m908qb4",
      "author": "ThirtyMileSniper",
      "body": "That's fine. People who are prepared to pay it are suckers who deserve to be milked.",
      "score": 1,
      "created_utc": 1737763207.0,
      "replies": []
    },
    {
      "id": "m90cxo4",
      "author": "Forumrider4life",
      "body": "Hoping it’s like an initial release and they flood the market with 5090s like toilet paper during Covid… “why did they do this to me, now I’m stuck with all these 5090s I can’t sell, damnit nvidia!”",
      "score": 1,
      "created_utc": 1737764578.0,
      "replies": []
    },
    {
      "id": "m90hdu7",
      "author": "speeddemon266",
      "body": "Fucking scalpers are a cancer",
      "score": 1,
      "created_utc": 1737766053.0,
      "replies": []
    },
    {
      "id": "m90svgd",
      "author": "None",
      "body": "Damn humans can be complete dogshit. It needs to be stopped by the companies making the product. \nDriving away your loyal customers is never a good business plan",
      "score": 1,
      "created_utc": 1737769965.0,
      "replies": []
    },
    {
      "id": "m91gpc3",
      "author": "Thisistanman",
      "body": "Increase the price at launch exorbitantly so that it’s not worth it for scalpers to buy. This item is a luxury and is clearly worth more than what people are paying for. The free market already solves for this, but the companies don’t want the bad pr for committing the whole way.",
      "score": 1,
      "created_utc": 1737778841.0,
      "replies": []
    },
    {
      "id": "m91kj9o",
      "author": "ShopToyLife",
      "body": "Technically they are flippers. Still...MF scumbags. There are organized groups who snatch up things and list at 2-3x cost, many times while in line. Been dealing with them in other interests for 20+ years",
      "score": 1,
      "created_utc": 1737780480.0,
      "replies": []
    },
    {
      "id": "m91y4km",
      "author": "wolfiasty",
      "body": "Great. I just hope those are not big amounts. Otherwise if there are idiots buying 5000s for double the MRSP, sales managers from Nvidia will for sure take a note and you can be sure that prices for 6000s are going to be very much near what scalpers ask currently.\n\nI can't wait to see 6060s, if it will ever comes out, for $1000 MRSP.",
      "score": 1,
      "created_utc": 1737787239.0,
      "replies": []
    },
    {
      "id": "m928dv8",
      "author": "RegretAggravating926",
      "body": "4090 goes brrrr",
      "score": 1,
      "created_utc": 1737793346.0,
      "replies": []
    },
    {
      "id": "m92mpsi",
      "author": "IAteMyYeezys",
      "body": "Ive seen one for £25k lol.",
      "score": 1,
      "created_utc": 1737802379.0,
      "replies": []
    },
    {
      "id": "m93ducx",
      "author": "kurisu7885",
      "body": "Are these things even out yet? Then again scalpers have tried to sell pre-orders before.",
      "score": 1,
      "created_utc": 1737815230.0,
      "replies": []
    },
    {
      "id": "m98og5r",
      "author": "ashtefer1",
      "body": "Dont really care about the 5090, 2k for one PC part is already insane and those who were gonna buy it probably can still afford it. Now when the 5070s come out, thats when it’ll be annoying.",
      "score": 1,
      "created_utc": 1737883008.0,
      "replies": []
    },
    {
      "id": "m98p326",
      "author": "soviel_dazu",
      "body": "Back then I paid 260€ for my RX 5600 XT, am still able to play Witcher 3, rdr2 and GTA V with little to no compromises -- did I miss something? Who pays even more for a bunch of extra shadows? 🤔\nBesides professional interests, maybe",
      "score": 1,
      "created_utc": 1737883396.0,
      "replies": [
        {
          "id": "m9bowd7",
          "author": "NastyHobits",
          "body": "4k 240hz",
          "score": 1,
          "created_utc": 1737922517.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m992wem",
      "author": "UnknownMight",
      "body": "Scalping must be illegal",
      "score": 1,
      "created_utc": 1737891709.0,
      "replies": []
    },
    {
      "id": "madcn96",
      "author": "keno888",
      "body": "Think we'll ever see ebay or Amazon crack down on scalpers? It seems like they're enabling it hardcore.",
      "score": 1,
      "created_utc": 1738415560.0,
      "replies": []
    },
    {
      "id": "m8x3s2t",
      "author": "Tribolonutus",
      "body": "Maybe just don’t buy from them instead of crying about that?",
      "score": 1,
      "created_utc": 1737730802.0,
      "replies": []
    },
    {
      "id": "m8xh0uj",
      "author": "Bouchie",
      "body": "\"Scalpers\"",
      "score": 0,
      "created_utc": 1737734609.0,
      "replies": []
    },
    {
      "id": "m8xlww5",
      "author": "GreatMazinger1066",
      "body": "Scalpers aren't the problem, people that pay scalpers are.",
      "score": 0,
      "created_utc": 1737735962.0,
      "replies": [
        {
          "id": "m8y2qdo",
          "author": "travelsonic",
          "body": "How are scalpers (and the bots that many use) not at least part (if not a huge part) of the problem?  How can anyone boil this down to a single variable?",
          "score": 3,
          "created_utc": 1737740608.0,
          "replies": [
            {
              "id": "m926bk8",
              "author": "GreatMazinger1066",
              "body": "They would have no reason to do what they do if people didn't PAY for it.",
              "score": 1,
              "created_utc": 1737792079.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xtq8p",
      "author": "ThatGuyFromTheM0vie",
      "body": "Is the 32gb VRAM even a selling point for pure gamers? \n\nIf you do workstation type stuff or AI stuff  or content creation on the side, sure maybe. And I get wanting to “future proof” your card for longer. But 16GB of VRAM seems like it’s plenty for games today and probably for the next 5 years.\n\nBecause the major “selling point” of the 5090 besides being “the best” new card is the 32 gigs of VRAM. And I don’t see why you would ever pay $2000 ($4000 scalped) for that.\n\nIs there something I’m missing? A 5080 despite appearing to be like a 4080 Super++ (still needs confirmation of course) seems to be a much better “deal” if you can get one at MSRP.\n\nIf you can get lucky and find a used 4090 too—that also seems pretty good for pure gaming performance, cost wise. I just don’t get any reason why you’d even want a 5090 for gaming reasons.",
      "score": 0,
      "created_utc": 1737738109.0,
      "replies": [
        {
          "id": "m8yc7ok",
          "author": "clitpuncher69",
          "body": "I'm one of the dozen PCVR gamers so the 32gb VRAM makes my mouth water a bit. I still think a $2k gpu for a gaming pc is ridiculous though",
          "score": 2,
          "created_utc": 1737743232.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m90pguv",
      "author": "ooofest",
      "body": "Still happy with my two ASUS Strix 3090s, fortunately.",
      "score": 0,
      "created_utc": 1737768795.0,
      "replies": []
    },
    {
      "id": "m9781gl",
      "author": "JoeyBigtimes",
      "body": "So?",
      "score": 0,
      "created_utc": 1737858302.0,
      "replies": []
    },
    {
      "id": "m90n6ss",
      "author": "NC_Vixen",
      "body": "If you don't like scalping, go lobby your politicians, stop complaining online.",
      "score": -1,
      "created_utc": 1737768013.0,
      "replies": []
    }
  ]
}