{
  "post": {
    "title": "Kuo: Cheaper ‘Apple Vision’ headset delayed beyond 2027",
    "author": "BlueLightStruct",
    "id": "1gin7az",
    "score": 891,
    "created_utc": 1730641626.0,
    "selftext": "",
    "num_comments": 152,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gin7az/kuo_cheaper_apple_vision_headset_delayed_beyond/"
  },
  "comments": [
    {
      "id": "lv705lz",
      "author": "None",
      "body": "[deleted]",
      "score": 278,
      "created_utc": 1730649259.0,
      "replies": [
        {
          "id": "lv8eu7j",
          "author": "qpwoeor1235",
          "body": "I mean the use case is porn",
          "score": 88,
          "created_utc": 1730664493.0,
          "replies": [
            {
              "id": "lv8utdb",
              "author": "bitterbrew",
              "body": "Yeah except Apple is like anti-porn",
              "score": 49,
              "created_utc": 1730669388.0,
              "replies": [
                {
                  "id": "lv90sbt",
                  "author": "LITTLE-GUNTER",
                  "body": "apple and mastercard want to be royal guards standing outside of sex shops making an X with their polearms whenever any of the commoners try to enter",
                  "score": 38,
                  "created_utc": 1730671276.0,
                  "replies": [
                    {
                      "id": "lvaoj6d",
                      "author": "Im_ur_Uncle_",
                      "body": "It's crazy to think a business cares more about pornography than profits. If i was an investor, I'd be confused on why Apple would pass up such a lucrative opportunity.",
                      "score": 10,
                      "created_utc": 1730692227.0,
                      "replies": [
                        {
                          "id": "lvb250p",
                          "author": "Not_Jeffrey_Bezos",
                          "body": "Yeah I'm like more shocked Jesus freak Intel CEO, RIP Nana, allows us to watch porn on his chips.",
                          "score": 3,
                          "created_utc": 1730698880.0,
                          "replies": []
                        },
                        {
                          "id": "lvc25sn",
                          "author": "PublicWest",
                          "body": "Apple has always cared about its image more than about functionality. \nThat’s part of the reason that they still put the charging port on the bottom of the Magic Mouse, and why they don’t let villains use iPhones in TV shows.  They care what someone looks like using their products. \n\n\nIf the product had a primary use case for porn, it would shift public perception of their brand",
                          "score": 3,
                          "created_utc": 1730721857.0,
                          "replies": [
                            {
                              "id": "lvf1948",
                              "author": "Im_ur_Uncle_",
                              "body": "Maybe they will \"accidentally\" leave a door open for certain users and call it an over sight",
                              "score": 1,
                              "created_utc": 1730756093.0,
                              "replies": [
                                {
                                  "id": "lvfp3e9",
                                  "author": "PublicWest",
                                  "body": "They wouldn’t. Public perception is based on what the public sees, not what apple says. \n\nIf it’s that easy to get around, and people would just look at the headset as a $3500 porn machine, regardless of what Apple says",
                                  "score": 1,
                                  "created_utc": 1730763747.0,
                                  "replies": [
                                    {
                                      "id": "lvgddnn",
                                      "author": "Im_ur_Uncle_",
                                      "body": "Ima make my own porn machine and only charge $1500",
                                      "score": 1,
                                      "created_utc": 1730772150.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lva9enk",
                      "author": "AdeptnessAway2752",
                      "body": "Why Mastercard?",
                      "score": 3,
                      "created_utc": 1730686307.0,
                      "replies": [
                        {
                          "id": "lva9v73",
                          "author": "LITTLE-GUNTER",
                          "body": "because reasons. nobody’s certain but the company has been resoundly and staunchly against pornography, sex work, and expression of sexuality overall. they work hand-in-hand with apple to strongarm OTHER companies into accepting their terms to conduct business.",
                          "score": 15,
                          "created_utc": 1730686473.0,
                          "replies": [
                            {
                              "id": "lvbpaxg",
                              "author": "chipstastegood",
                              "body": "Isn’t VISA the same? It’s not just a Mastercard thing.",
                              "score": 2,
                              "created_utc": 1730714198.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvb5ooo",
                  "author": "PeopleRGood",
                  "body": "My friend used his iPhone for porn all the time",
                  "score": 1,
                  "created_utc": 1730700931.0,
                  "replies": []
                },
                {
                  "id": "lvb7a12",
                  "author": "Space_Lux",
                  "body": "You can watch porn just fine. \nEither 2D, 3D or 180°",
                  "score": 1,
                  "created_utc": 1730701898.0,
                  "replies": []
                },
                {
                  "id": "lv9puhy",
                  "author": "FightOnForUsc",
                  "body": "*Except",
                  "score": 1,
                  "created_utc": 1730679338.0,
                  "replies": []
                },
                {
                  "id": "lv9qj9h",
                  "author": "PhantomRoyce",
                  "body": "I feel like such a devious person when I get an ios app to work for porn",
                  "score": 1,
                  "created_utc": 1730679569.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvarxdt",
              "author": "FlamingTrollz",
              "body": "Meh.\n\nGo get an Meta Quest for a lot less $$$.",
              "score": 5,
              "created_utc": 1730693693.0,
              "replies": [
                {
                  "id": "lvfamaa",
                  "author": "throwthegarbageaway",
                  "body": "Quest's passthrough is cool to see if you're coming from an older headset, but in a vacuum it's utilitarian at best. I haven't been able to try a Vision Pro but people claim its leagues above Quest's so it sounds a lot more usable. The integration with the mac ecosystem would be the selling point for me, but paying 7x the cost of quest for that is simply not feasible.",
                  "score": 1,
                  "created_utc": 1730758990.0,
                  "replies": [
                    {
                      "id": "lvgcwa9",
                      "author": "FlamingTrollz",
                      "body": "I get your point. :)\n\nOwn both, and I’ve been using my Quest much more with Virtual Desktop as additional monitors. It’s been a pretty enjoyable experience. \n\nHere and there streaming via Big Screen has been enjoyable.",
                      "score": 1,
                      "created_utc": 1730771985.0,
                      "replies": [
                        {
                          "id": "lvgnuho",
                          "author": "throwthegarbageaway",
                          "body": "Love my quest as multi monitor but my issue is how frustrating it is to get going. I sit down and get up far too often, making the experience far from smooth as much as i’d love to use it more.\n\nPretty stoked to see what next gen VR and MR will bring that’s under $3.5k",
                          "score": 2,
                          "created_utc": 1730775815.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lv8b3ar",
          "author": "youreblockingmyshot",
          "body": "That’s kinda how I saw my first VR Headset, impressive and cool but mostly a novelty after a week or two. The difference I I picked that up for a few hundred dollars. Not a few thousand.",
          "score": 29,
          "created_utc": 1730663352.0,
          "replies": [
            {
              "id": "lvamf6o",
              "author": "RaiTab",
              "body": "The kicker here is that the Vision Pro isn’t a VR headset. It’s basically a VR computer. It’s meant to be a legitimate replacement or companion piece for a laptop or desktop computer. It’s just, currently, pretty niche to want to daily drive a headset as a computer, but some people are.",
              "score": 9,
              "created_utc": 1730691356.0,
              "replies": [
                {
                  "id": "lvben5g",
                  "author": "_Diskreet_",
                  "body": "I did the demo, which was just over half hour I think, and i wouldn’t want to use it daily unless I did a F1 drivers neck muscle training regimen.",
                  "score": 3,
                  "created_utc": 1730706696.0,
                  "replies": []
                },
                {
                  "id": "lvfaxo2",
                  "author": "throwthegarbageaway",
                  "body": "Other VR headsets have similar capabilities, there's nothing new in the Vision Pro, just different and *maybe* higher quality",
                  "score": 0,
                  "created_utc": 1730759091.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv8ddbc",
          "author": "None",
          "body": "[deleted]",
          "score": 28,
          "created_utc": 1730664043.0,
          "replies": [
            {
              "id": "lv9ns30",
              "author": "Initial_E",
              "body": "I think immersive 3d movies are their entryway into this market. Remember the iPhone App Store started with stupid apps like drinking beer, light sabers and “I am rich”, it takes time for momentum to build up, and in the meanwhile you need to constantly maintain a critical mass of consumers to keep buying your hardware. Keep making movies where they are best experienced in the Vision Pro, and people will keep having a Vision Pro.",
              "score": 13,
              "created_utc": 1730678633.0,
              "replies": [
                {
                  "id": "lvb0aks",
                  "author": "Constant-K",
                  "body": "Sure, the App Store was an incentive. But people bought the iPhone because they wanted everything else it offered too. It was the first “do everything” mobile device for most people.\n\nI can’t justify spending $3,500 on a TV, let alone a headset for occasional movies.",
                  "score": 9,
                  "created_utc": 1730697853.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvb8d9g",
          "author": "NarrativeNode",
          "body": "Then you seriously need to check out the Meta Quest 3. I’m an Apple fanboy, but after having a Q3 for a year before putting on the Vision Pro, I was underwhelmed by Apple. The only advantage is higher resolution passthrough. I can even use my Mac perfectly well on the Quest…",
          "score": 4,
          "created_utc": 1730702576.0,
          "replies": []
        },
        {
          "id": "lva6nl1",
          "author": "obi1kenobi1",
          "body": "I’ve been saying it since it launched but Apple really needs to lead by example, this still has the potential to be the next evolution of computing and make them absurd amounts of money but no one is going to put in the effort (and more importantly time and money) until the concept has been proven.\n\nI’m a huge proponent of the idea of virtual workspaces, as a graphic designer who also dabbled with industrial design and digital art/modeling as hobbies I absolutely can’t wait to ditch computer monitors and work entirely in a virtual headset, it has the potential to make almost every computer-related industry so much better. But even setting aside the fact that an entirely new user interface paradigm needs to be worked out and refined in order to make switching between various third party applications intuitive and seamless (some of which Apple has already done with VisionOS but from what I’ve seen their current system is pretty simplistic and needs to be expanded quite a bit) there’s the problem that serious software would need to be ported not just to a new OS but to a radically different and unprecedented interface concept that would need way more effort put into it than 2D user interfaces that already exist.\n\nTo me the obvious answer is to port iMovie and GarageBand, and to make them have radically new UI/UX concepts that really sell the idea of what they call “spatial computing”. It needs to be the kind of thing where it offers genuine benefits over traditional screen-based workflows, which is easy enough to imagine but difficult, expensive, and time consuming to implement, but they’re the only ones who should be expected to expend that effort if they want their multi-billion dollar investment to pay off. Then have versions of Final Cut Pro and Logic Pro ready at the same time, so that after people try the new interface and want to do more serious work they have an option, which should lead to other competitors to start development on porting their own software.\n\nI think Apple was expecting something similar to iOS 2 allowing third-party iPhone apps, or the iPad allowing companies to bridge the gap between iPhone apps and desktop apps, or later Apple Watch apps and complications. In all of those cases Apple didn’t really put that much effort into it apart from saying “here are the tools, have at it”. But those were very simple and easy to accomplish, consisting of little more than porting existing software ideas to new hardware, rather than needing to invent totally new ways to interact with software.\n\nThe Vision line is much more like the original Macintosh, where for a while software developers were at a loss for how to translate existing software to a GUI and the platform gained a reputation as a technical marvel with a lack of software until desktop publishing took off and the rest of the industry figured out how to make GUI software. But it could be argued that this time it’s going to be even more of a challenge, even transitioning from command-line text-only interfaces to GUIs wasn’t quite as big of a jump as the transition from GUIs to fully immersive VR workflows will be.\n\nApple has a reputation of being one of the only computer companies big enough to invest the kind of time and money needed to prove new technologies that others see the potential in but are hesitant to invest in. This is no different, if they don’t put the effort in nobody else will, and the only ones they would have to blame are themselves.",
          "score": 7,
          "created_utc": 1730685318.0,
          "replies": [
            {
              "id": "lvb95tu",
              "author": "None",
              "body": ">Apple has a reputation of being one of the only computer companies big enough to invest the kind of time and money needed to prove new technologies that others see the potential in but are hesitant to invest in. This is no different, if they don’t put the effort in nobody else will, and the only ones they would have to blame are themselves.\n\nThe obvious competitor here is Facebook, although Apple is targeting AR while Facebook is targeting VR. The quest 3 has some AR features but they are very subpar. I'm interested to see what the next iteration will hold for AR. One of them will get to it first, I'm sure Facebook is trying to one up them before this releases in 2027.",
              "score": 6,
              "created_utc": 1730703070.0,
              "replies": [
                {
                  "id": "lvbbz1v",
                  "author": "obi1kenobi1",
                  "body": "My personal wildcard is the Valve Deckard. Supposedly they’re still working on it, a PC VR standalone headset based on beefed-up Steam Deck hardware and software, that can run PC VR software via Steam VR without needing a computer or Windows. The PC VR platform has the most potential and flexibility compared to the walled garden approach of Apple or Meta or PSVR, but the whole industry feels like it has been on life support ever since it went mainstream a decade ago. The PC side has the best hardware hands down, but it’s generally far too expensive and finicky for the general public and the software side has been lacking as there has yet to be a true killer app and many big titles get exclusivity deals with Meta and other walled garden VR platforms.\n\nIf (and this is a *big* if) the Valve Deckard comes to market and is a success I think it will have the potential to get people interested in VR on the PC again. It will be expensive, rumors are pointing to somewhere in the range of a thousand dollars minimum, but at launch it will automatically have the largest library of existing VR software and it will likely be competitively priced since unlike any other PC hardware manufacturer Valve is capable of doing the thing that consoles and dedicated devices often do where they sell the hardware at a loss and make back that loss via their cut of Steam game/software sales. And it will pretty much by default be the cheapest and most accessible entry point for consumer PC VR, since even if it costs more than the Valve Index you don’t also need a $1-2000 computer to go alongside it.\n\nAnd if that all plays out like everyone is hoping then another benefit that’s relevant to this discussion is that it will effectively become the most accessible entry point for VR development. Trying to make a VR app for Apple or Meta or some other ecosystem isn’t impossible but it’s not going to be easy or cheap. PC VR, on the other hand, is something that any hobbyist programmer can dabble with and experiment with new ideas. We’ve already seen that before, with PC VR historically having a lot more tech demos and proof of concept software made by small teams or individuals. But PCVR has always been a small and fragmented market, which is why all the developers seem to partner with Meta or one of the other big players to try to achieve success. The Deckard would be a relatively powerful, relatively affordable platform with the openness of being a PC that runs normal PC software, allowing for quicker and easier development by smaller teams with fewer resources. It would be far easier for someone to experiment with ideas and put their work out there and get feedback.\n\nI’m still not confident that it could jump start the Virtual workspace software market the way that something big from a major developer would, but it might at least get us moving in the right direction. I wouldn’t expect anything crazy like a VR DAW or video editing suite, certainly not the more niche and industry-oriented graphic design or 3D modeling/animation/art software that I’ve been wishing for. But it would be the most likely platform for *someone* to develop *something* that shows the kind of potential benefits that a fully virtual workflow could have compared to traditional monitors and mouse/keyboard. And once someone has proved the concept others will want to try their hand at it, which could eventually down the road lead to bigger software developers porting their suites to VR.\n\nAnd I do keep talking about VR as opposed to AR but I think a lot of virtual workspaces don’t necessarily *need* to be AR. They may benefit from it, sure, and others wouldn’t really work that well without AR, but it has to start somewhere and I think there are a lot of potential scenarios where VR is good enough to get people interested and enthusiastic. So while something like the Vision Pro definitely has a lot more potential as a serious virtual workspace platform I still think a purely VR headset that offers a convenient and accessible development platform for experimentation could potentially lead to some major progress in the concept.",
                  "score": 1,
                  "created_utc": 1730704893.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvbznh3",
              "author": "Usernametaken1121",
              "body": "I don't think Apple sees much $$ in developing software for strictly consumer market use. It seems big tech is pouring most of their R&D investments into AI. They believe that's the next \"big thing\" as the market could cover consumer, business, and government.",
              "score": 1,
              "created_utc": 1730720571.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvbawgn",
          "author": "Ok_Minimum6419",
          "body": "The live sports part of the demo was the most mind blowing and realistic “I actually want to watch sports in VR”. It was like being on top of the arena literally.",
          "score": 2,
          "created_utc": 1730704187.0,
          "replies": []
        },
        {
          "id": "lvbbnht",
          "author": "KazzieMono",
          "body": "I mean this with utmost honesty and sincerity; how can a vr headset be “mindblowing” in today’s day and age?",
          "score": 1,
          "created_utc": 1730704678.0,
          "replies": [
            {
              "id": "lvcyetz",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1730733870.0,
              "replies": [
                {
                  "id": "lvf0e6c",
                  "author": "KazzieMono",
                  "body": "I mean, yeah, you get that feeling the first time you put one on. But that goes away. Trust me.",
                  "score": 1,
                  "created_utc": 1730755833.0,
                  "replies": [
                    {
                      "id": "lvf49tx",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1730757008.0,
                      "replies": [
                        {
                          "id": "lvf5pkt",
                          "author": "KazzieMono",
                          "body": "My point was apple’s headset doesn’t do anything any other headset can’t also do.",
                          "score": 1,
                          "created_utc": 1730757443.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvcubde",
          "author": "grimmdrum",
          "body": "edge automatic profit cheerful work afterthought spectacular school deserve dependent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1730732578.0,
          "replies": []
        },
        {
          "id": "lv7gfzd",
          "author": "None",
          "body": "[deleted]",
          "score": -1,
          "created_utc": 1730654209.0,
          "replies": [
            {
              "id": "lv7l2e5",
              "author": "None",
              "body": "Not even close. Phones were already a widespread necessity by then, and the iPhone was an upgrade to those\n\nNobody’s using AR/VR headsets that much and neither is it essential to anyone’s life at this point",
              "score": 8,
              "created_utc": 1730655583.0,
              "replies": [
                {
                  "id": "lv7xjwr",
                  "author": "LARGames",
                  "body": "They're basically mainstream in the gaming space at this point. The Quest 3 and 3s are currently the best selling consoles right now. The thing is that Apple's headset is way more expensive but does way less than the Quest headsets. Albeit at a considerably better visual quality.",
                  "score": -8,
                  "created_utc": 1730659255.0,
                  "replies": [
                    {
                      "id": "lv881co",
                      "author": "CrocCapital",
                      "body": "under 2% of steam users have a VR headset associated with their account. Mainstream is not the right word.",
                      "score": 8,
                      "created_utc": 1730662419.0,
                      "replies": [
                        {
                          "id": "lvatq77",
                          "author": "LARGames",
                          "body": "To be fair, Steam is the smallest VR installment base. The biggest is standalone, which is where all the sales have been mainly from.",
                          "score": -1,
                          "created_utc": 1730694523.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lv88mwi",
                      "author": "Blackpapalink",
                      "body": "No they're not. Stop lying. Even the best bang for your buck headset, the Quest 2, isn't even that common in use.",
                      "score": 4,
                      "created_utc": 1730662601.0,
                      "replies": [
                        {
                          "id": "lv91w5u",
                          "author": "LARGames",
                          "body": "You can check on Amazon. Right now.\n\nEven in my own workplace. They're outselling the other consoles. Not in lifetime sales, of course. But currently.",
                          "score": 0,
                          "created_utc": 1730671630.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lv6iwlx",
      "author": "None",
      "body": "run airport practice aware zesty lush ink consider tease juggle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 67,
      "created_utc": 1730643637.0,
      "replies": [
        {
          "id": "lv6s58a",
          "author": "Xelanders",
          "body": "I think $1500 is still too high considering there’s barely any software support.",
          "score": 55,
          "created_utc": 1730646752.0,
          "replies": [
            {
              "id": "lv743km",
              "author": "None",
              "body": "chubby terrific scary badge fanatical weather fragile advise complete flag\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 10,
              "created_utc": 1730650488.0,
              "replies": [
                {
                  "id": "lv7jbyi",
                  "author": "Bennehftw",
                  "body": "And Apple isn’t one to mess with their margins like the console market.\n\nWhich really, I think they need to do right in the beginning to establish a market share.",
                  "score": 3,
                  "created_utc": 1730655062.0,
                  "replies": []
                },
                {
                  "id": "lv8rfjd",
                  "author": "fullsaildan",
                  "body": "The Apple headset doesn’t compete with the Quest lineup, like at all. It’s very different intended audiences.",
                  "score": 2,
                  "created_utc": 1730668325.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv7hrz1",
              "author": "icedcoffeeheadass",
              "body": "$1500 is about $1000 too high for a product that is still in novelty status. No one needs one when most consumers don’t even need a laptop anymore. The average (American) consumer can survive with an iPad and printing at work. It’s good to move towards this direction. Less waste.",
              "score": 9,
              "created_utc": 1730654601.0,
              "replies": [
                {
                  "id": "lv7vje5",
                  "author": "Knubbelwurst",
                  "body": "I mean, you could compare the Oculus Quest 3 sales (\\~$600, android-based - massive marketplace ) to the sales of a $1500 headset with barely any economy around it.",
                  "score": 3,
                  "created_utc": 1730658668.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv7igl4",
              "author": "simondoyle1988",
              "body": "And can’t play games on it. They only use I see for it is watching f1",
              "score": 1,
              "created_utc": 1730654801.0,
              "replies": []
            },
            {
              "id": "lva7e6j",
              "author": "A_Witty_Name_",
              "body": "Also considering the Meta Quest 3 beats it in overall support and usability and is $500 brand new.\n\nThough most of the support work fell on Steam's efforts getting the VR ecosystem.",
              "score": 1,
              "created_utc": 1730685584.0,
              "replies": []
            },
            {
              "id": "lvbbvw9",
              "author": "KazzieMono",
              "body": "Seriously. A valve index is $600. A *full set*, controllers, base stations, and the headset itself, is $1000. Why in any mother of god would I spend more than that? Hell, a fucking oculus is $300. You seriously cannot get cheaper than that.\n\nApple overestimated their value and completely misjudged their competition.",
              "score": 1,
              "created_utc": 1730704835.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv77iix",
          "author": "Shapes_in_Clouds",
          "body": "The problem even at $1,500 is device fatigue.  People have phones, laptops, tablets, TVs - they all cost roughly $1k-$1,500 or much less for budget versions.  Not only does this eat up money, but it eats up time.  People have only so much free time in a day, and while VR/AR can offer very novel and interesting experiences, it has become harder and harder for people to justify yet another device in their lives with so much already competing for their attention.  \n\nWhile an argument can be made that headsets can replace some of these devices, I don't think it's so simple because being a wearable is a huge shift in how one uses the device.  Sure, I can run iPad apps on a VP, but I'd rather just use my iPad.\n\nI really enjoy VR and there's certain games and apps that totally sucked me in.  But at the same time I've just kind of fallen off of it because there are honestly too many other things to do, and right now the VR/AR space doesn't get a lot of investment.",
          "score": 8,
          "created_utc": 1730651552.0,
          "replies": []
        },
        {
          "id": "lv6ptqs",
          "author": "SilverCarbon",
          "body": "I agree, unless Apple comes up with a usecase where you put it on at least once a week (and preferably more often), otherwise it won't sell beyond a small batch of fans who are limited by budget. Others will spend their money on other (Apple) products on which they glance dozens of times a day like the phone and watch.",
          "score": 4,
          "created_utc": 1730645994.0,
          "replies": [
            {
              "id": "lv6ymud",
              "author": "None",
              "body": "unite shocking license degree books history reminiscent engine thought recognise\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1730648792.0,
              "replies": [
                {
                  "id": "lv7wxde",
                  "author": "SilverCarbon",
                  "body": "I agree with you. Actually Tim Cook's vision was a kind of AR glasses (like the Google Glass from 2012) but the tech isn't there yet. So a plan B was developed but Eyesight on the outer display doesn't really solve the problem of the closed environment. Nobody even talks about it anymore except that it looks goofy.\n\nThat's why I also think a cheaper price or \"light\" version isn't going to move the needle. I would also give it five years or more for innovation and improvement. Meta Orion seems the way to go but that's even more expensive and not yet ready for mass production.",
                  "score": 0,
                  "created_utc": 1730659074.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv6muss",
          "author": "kclongest",
          "body": "Well said. Lots of good points.",
          "score": 3,
          "created_utc": 1730645007.0,
          "replies": []
        },
        {
          "id": "lv732hq",
          "author": "Alicenchainsfan",
          "body": "$1500 is definitely not better, it feels no different than $2000.  $799 is more in line with what would be palatable",
          "score": 4,
          "created_utc": 1730650164.0,
          "replies": []
        },
        {
          "id": "lv7o38e",
          "author": "CarpeMofo",
          "body": "You're missing a big part of justifying the cost of getting a new phone. You can sell your old phone back to your carrier. I bought my initial iPhone 13 Pro Max outright for 1200. Then when it was time for me to upgrade, I sent my old phone back and they gave me a thousand dollars for it so my 15 Pro Max only cost 200 bucks. I'll probably do the same when the 17 comes out as well. 200 bucks every 2 generations to keep my phone updated is a very good deal.",
          "score": 1,
          "created_utc": 1730656492.0,
          "replies": []
        },
        {
          "id": "lv97ve0",
          "author": "EfficientAccident418",
          "body": "The sweet spot for pricing is under $1,000. The Vision Pro is way over because it’s over-engineered with no real focus. It makes me think of the solid-gold Apple Watch Edition- ok cool, but what the fuck for? All the bells and whistles on AVP (especially the digital “screen” on the front that creates a simulacrum of your eyes) are just silly.",
          "score": 1,
          "created_utc": 1730673513.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv6zuhh",
      "author": "VirtuaFighter6",
      "body": "Those OLED screens. Quest needs those.",
      "score": 8,
      "created_utc": 1730649163.0,
      "replies": []
    },
    {
      "id": "lv6eoas",
      "author": "IamAkevinJames",
      "body": "Did not like the first one barely freaking sell?",
      "score": 49,
      "created_utc": 1730642103.0,
      "replies": [
        {
          "id": "lv6f1t2",
          "author": "WrastleGuy",
          "body": "Most people can’t justify dropping 3500 on a headset",
          "score": 63,
          "created_utc": 1730642241.0,
          "replies": [
            {
              "id": "lv6n5n7",
              "author": "None",
              "body": "Especially if the battery lasts only an hour.",
              "score": 9,
              "created_utc": 1730645108.0,
              "replies": []
            },
            {
              "id": "lv6keql",
              "author": "MisterEinc",
              "body": "Plus it has basically no software. It looks like Apple chose Unity as a software partner probably early in development, when they were closer in parity to Epic's Unreal. But Fortnite basically allowed Epic to throw a ridiculous amount of resources into development and have left Unity in the dust. Not to mention the whole licensing snafu. So AVP has sort of been DOA because there's just not a lot going on in the app store.",
              "score": 25,
              "created_utc": 1730644169.0,
              "replies": [
                {
                  "id": "lv6rhhn",
                  "author": "Brico16",
                  "body": "Yeah it’s this exactly. There was no “killer app” that truly drove the value proposition home. The hardware is awesome but none of the software takes advantage of that awesomeness.\n\nFor example, the killer Quest app was, and largely still is, beat saber. Super accessible, simple to understand, a high skill ceiling for those that want a challenge, and took advantage of most of the innovation in the hardware. \n\nApple needed something similar and didn’t deliver. It’s pretty much an expensive desktop monitor that you wear on your face.",
                  "score": 14,
                  "created_utc": 1730646540.0,
                  "replies": [
                    {
                      "id": "lv6wg5i",
                      "author": "aykay55",
                      "body": "They also didn’t open up the device to developers pretty much at all. requiring them to have the $100 membership and then special order a $300 ‘developer strap’ to actually interface with the damn thing. Because there was seemingly no way to use VR controllers with the headset it pretty much leaves it out from any WebVR shenanigans. So now you have a device that can’t access most existing content, has no active development by its own creators, and doesn’t know if it’s a device for business, productivity, personal pleasure or gaming. The only people who’ve benefited from buying it are those who didn’t spend that money on a large TV instead.",
                      "score": 10,
                      "created_utc": 1730648132.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lv77rs5",
                  "author": "FinndBors",
                  "body": "Judging from a few years back when I was doing this, Unity is an easier development environment but unreal has better performance / visual quality. Especially startup performance which is pretty key for some experiences.",
                  "score": 5,
                  "created_utc": 1730651631.0,
                  "replies": [
                    {
                      "id": "lv79cal",
                      "author": "MisterEinc",
                      "body": "Back when I was teaching Tech the generaly thinking was that block coding applications were just sort of a stepping stone for teaching \"real\" coding but that turned out to be wrong - UEs blueprint system and visual coding are the new standard as far as I can tell.",
                      "score": 2,
                      "created_utc": 1730652094.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lv6o7xr",
              "author": "None",
              "body": "[deleted]",
              "score": 10,
              "created_utc": 1730645464.0,
              "replies": [
                {
                  "id": "lv6wkjk",
                  "author": "aykay55",
                  "body": "Walled garden but for your eyes",
                  "score": 7,
                  "created_utc": 1730648170.0,
                  "replies": []
                },
                {
                  "id": "lvb7fpq",
                  "author": "marcanthonyoficial",
                  "body": "objectively, the components justify the price. The screens alone cost as much as a Quest 3",
                  "score": 1,
                  "created_utc": 1730701998.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv6gdms",
              "author": "IamAkevinJames",
              "body": "For sure which  is why I was wondering. It was wasnt a bad product it seemed to  be undercooked in some regards like the head straps.  Apple does seem to be out of touch and expects that the whales will come out of the woodwork everytime.",
              "score": 9,
              "created_utc": 1730642728.0,
              "replies": [
                {
                  "id": "lv6hwan",
                  "author": "puffferfish",
                  "body": "They did. This initial release is a sort of beta test.",
                  "score": 7,
                  "created_utc": 1730643277.0,
                  "replies": []
                },
                {
                  "id": "lv6khjk",
                  "author": "Hobbit1996",
                  "body": "pretty sure they got like 200k pre orders but so many people just tried it and sent it back lol",
                  "score": 4,
                  "created_utc": 1730644197.0,
                  "replies": [
                    {
                      "id": "lv6l2kk",
                      "author": "DarthBuzzard",
                      "body": "> but so many people just tried it and sent it back lol\n\nThere's no evidence of this.",
                      "score": -2,
                      "created_utc": 1730644399.0,
                      "replies": [
                        {
                          "id": "lv7g1vv",
                          "author": "Hobbit1996",
                          "body": "[https://www.theverge.com/2024/2/14/24072792/apple-vision-pro-early-adopters-returns](https://www.theverge.com/2024/2/14/24072792/apple-vision-pro-early-adopters-returns)\n\neveryone was talking about it, store employees said this multiple times",
                          "score": 1,
                          "created_utc": 1730654094.0,
                          "replies": []
                        },
                        {
                          "id": "lv6t5ag",
                          "author": "Turbofan55",
                          "body": "There's plenty of evidence if you work there. As soon as that 14th day hits people are back in store returning the device. You see more people walk in with them than out.",
                          "score": 0,
                          "created_utc": 1730647078.0,
                          "replies": [
                            {
                              "id": "lv6w4c0",
                              "author": "None",
                              "body": "[removed]",
                              "score": 0,
                              "created_utc": 1730648032.0,
                              "replies": [
                                {
                                  "id": "lv75s6v",
                                  "author": "Turbofan55",
                                  "body": "You don’t have to work at every Apple Store in the world to recognize a trend. When you see high return rates consistently at one location, it’s usually a strong sign that the same pattern could be happening across other stores. Trends often reveal broader issues, especially with a product as unique and experimental as the Vision Pro. Right now, people are struggling to see enough everyday, practical value in it. They’re hesitant to keep a $4,000+ device that, at the end of the day, currently mostly offers an immersive way to watch movies, play a limited selection of games, or do tasks they can already handle (often more easily) on their laptops or phones. The AVP has potential, sure, but it currently lacks that ‘killer app’ or practical functionality that makes it indispensable. For most people, that’s just not enough to justify the price, and it's evident in the returns and feedback. People were expecting something revolutionary, but most are finding it doesn’t add much to their daily lives beyond what they already have.\n\nMy roommate has worked at one of the demo stores for 10 years and we actually have a Vision Pro here at home. It was getting tons of use for the first few weeks, but now? It mostly just sits there. The novelty of watching a movie in a virtual theater wears off when you realize you still have all the same options on a regular screen, which is easier and often more comfortable to look at.",
                                  "score": 0,
                                  "created_utc": 1730651015.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lv6p3yu",
              "author": "SilverCarbon",
              "body": "Even at a lower price it still has to have continued use. Enthusiasts mostly dropped the Pro after a few weeks, they should focus on making people pick it up more often but Apple hasn't found anything yet. Unless you're that rare frequent flyer who insists on putting it on for longer flights.",
              "score": 2,
              "created_utc": 1730645758.0,
              "replies": []
            },
            {
              "id": "lv6rqlg",
              "author": "Xelanders",
              "body": "Most people can’t justify dropping any amount of money on a headset, especially one that looks like a massive pair of ski goggles and has barely any game support (the one thing VR has actually found some marginal success with).",
              "score": 1,
              "created_utc": 1730646621.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv6heon",
          "author": "mehemynx",
          "body": "That and it was pretty pointless, VR was already a niche, now you needed someway to cram that niche into the apple ecosystem.",
          "score": 11,
          "created_utc": 1730643101.0,
          "replies": []
        },
        {
          "id": "lv6j4ve",
          "author": "salsation",
          "body": "Bleeding edge halo products are like that. The price is the \"bleeding\" part. Some people with money to burn like to try the newest new thing, and for them, it's a successful tech preview.\n\nIf you set aside price, the biggest issues are weight, size, and lack of 3rd party software. And that battery... yeesh. In terms of the OS, I think it makes the Meta effort look like garbage.",
          "score": 4,
          "created_utc": 1730643717.0,
          "replies": []
        },
        {
          "id": "lv6nqsy",
          "author": "None",
          "body": "[removed]",
          "score": 4,
          "created_utc": 1730645304.0,
          "replies": []
        },
        {
          "id": "lv7bh0b",
          "author": "krectus",
          "body": "There are no sales numbers released. Everyone is just guessing at this point.",
          "score": 1,
          "created_utc": 1730652726.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv6sx9k",
      "author": "lo_fi_ho",
      "body": "Apple Vision is DOA. No one wants to wear a heavy set with a limited use case on their heads no matter if it costs 3500€ or 1000€.",
      "score": 18,
      "created_utc": 1730647007.0,
      "replies": []
    },
    {
      "id": "lv6kejt",
      "author": "jzr171",
      "body": "It won't be relevant by then. They're hardly relevant now. There's plenty of companies that could make one now, but they don't. Microsoft discontinued theirs. Samsung said they might make one just to undercut Apple's price. Meta is 90% there and could obliterate Apple with a $500 unit. No one else seems to care. \n\nAR/VR is a very niche market and I don't see it going anywhere until it's the size of sunglasses. And even then people seem creeped out by the idea with the couple that have been glasses sized already. They were immediately used for bad things and the reputation has been ruined",
      "score": 20,
      "created_utc": 1730644167.0,
      "replies": [
        {
          "id": "lv6lbd7",
          "author": "DarthBuzzard",
          "body": "> And even then people seem creeped out by the idea with the couple that have been glasses sized already.\n\nA vocal minority of people does not equal the world. Most people don't care about privacy issues if the tech enhances their life.",
          "score": 10,
          "created_utc": 1730644481.0,
          "replies": []
        },
        {
          "id": "lv6wvrm",
          "author": "aykay55",
          "body": "I mostly agree with you but I think that the creative population has yet to really get their hands on the tech. I think that artists are currently really afraid of touching VR due to the complexity but they haven’t seen how much easier it’s become.",
          "score": 2,
          "created_utc": 1730648265.0,
          "replies": [
            {
              "id": "lv70x4l",
              "author": "jzr171",
              "body": "I thought that about 3D. And that didn't last. I would be interested in seeing VR movies though",
              "score": 2,
              "created_utc": 1730649497.0,
              "replies": [
                {
                  "id": "lv7e11u",
                  "author": "aykay55",
                  "body": "That’s my field haha! You should check out Maya: The Birth of a Superhero which is free on the meta store and is an incredible 30 minute animated short that also has interactive portions. One of the best uses of VR ive witnessed to date.",
                  "score": 2,
                  "created_utc": 1730653492.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lv9iqmh",
              "author": "NecroCannon",
              "body": "I have some ideas when I can actually afford one, I’m wondering how an interactive VR comic could be like",
              "score": 1,
              "created_utc": 1730676980.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv7cajr",
          "author": "hedoeswhathewants",
          "body": "I'm reasonably convinced these products exist to defray development costs for some longer-term goal.",
          "score": 1,
          "created_utc": 1730652973.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv7nz0x",
      "author": "Portatort",
      "body": "Vision Pro at half the price wouldn’t have moved the needle. \n\nThis is good. Focus on improving the state of the art. \n\nMake the best product better and most importantly make it more comfortable and accessible to use\n\nPriority number one should be getting to the point where you no longer have to literally strap it to your face. \n\nAugmented reality isn’t gonna go mainstream until they get rid of the strap",
      "score": 8,
      "created_utc": 1730656458.0,
      "replies": []
    },
    {
      "id": "lv6l44s",
      "author": "emiliabow",
      "body": "They should just do AR glasses linked up to the iphone",
      "score": 3,
      "created_utc": 1730644414.0,
      "replies": [
        {
          "id": "lv6mu0y",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1730644999.0,
          "replies": [
            {
              "id": "lv6x55q",
              "author": "aykay55",
              "body": "Yeah I don’t think Apple has actually ever gotten along with any fashion brands except Hermes, and they don’t make actual glasses afaik.",
              "score": 1,
              "created_utc": 1730648343.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv7la0j",
      "author": "sirduke75",
      "body": "Nobody wants a Vision Pro. Incredible waste of money in terms of product development. Add the Apple car waste of $10B as well. Apple should have made a commercial TV IMHO and owned the living room eye balls market.",
      "score": 4,
      "created_utc": 1730655647.0,
      "replies": [
        {
          "id": "lvae0in",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1730688011.0,
          "replies": [
            {
              "id": "lvaj4vu",
              "author": "sirduke75",
              "body": "Apple have to really convince me super hard to switch my input device to Apple TV as I actually spend more time in my TV’s OS (LG) and native Netflix, Prime and YouTube apps.\n\nApple could have been first party in streaming, now they are 2nd and in some cases 3rd. We are turning the clock back but they could have launched their TV just before the pandemic, 2018-2019.",
              "score": 1,
              "created_utc": 1730690023.0,
              "replies": [
                {
                  "id": "lvb7u04",
                  "author": "marcanthonyoficial",
                  "body": "if there's one device that Apple makes where they competitively priced and also *miles* ahead of the competition, it is with the Apple TV. there is no streaming box, regardless of price, that comes close.",
                  "score": 1,
                  "created_utc": 1730702241.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvb6sj3",
      "author": "Asking4Afren",
      "body": "It's honestly the most mind blowing thing I've tried (the demo). I haven't tried the quest 3 yet to compare though so I'll reserve my thoughts on if apple is really setting their prices far beyond what it should be maybe someone here can answer this for me?\n\nAlso, imo dropping $2500-4k for one isn't the issue really. It's that there's literally no support for this device. For someone like myself that WANTS it really really bad and do have the extra cash laying around for something like this, my drawback is the support. I'd use it for sports and watching movies. Quest has xstadium from what I've seen and has roughly 50+ immersive games for nba. Why would I go to apple if they don't even have that yet? I've seen it in the demo but it's not out. \n\nOnce prices start to get between 1500-2000 I might just bite but by then it'll be too late I might have a quest 3 or 4 and I'll wait for the next edition of avp. One reason I'm holding back from the quest is I'm hearing the visual quality is better and touch gestures on the avp. I'm also entirely in the apple ecosystem.",
      "score": 2,
      "created_utc": 1730701603.0,
      "replies": []
    },
    {
      "id": "lv6hbb0",
      "author": "itastesok",
      "body": "Shit is dead",
      "score": 6,
      "created_utc": 1730643067.0,
      "replies": []
    },
    {
      "id": "lv8izd7",
      "author": "msison1229",
      "body": "Give me something that’s more comfortable to wear for long periods of time and I’d be happy to buy it",
      "score": 2,
      "created_utc": 1730665759.0,
      "replies": []
    },
    {
      "id": "lv6f522",
      "author": "WangMangDonkeyChain",
      "body": "meanwhile all customers want is a phone that doesn’t break when dropped ",
      "score": 2,
      "created_utc": 1730642275.0,
      "replies": [
        {
          "id": "lv6nsev",
          "author": "dylan_1992",
          "body": "That is indeed, NOT what customers want. We used to have plastic phones that wouldn’t break when dropped, then people gobbled up iPhones and ran those companies out of the market. \n\nA famous story during iPhone development was the decision to use a plastic vs glass screen. Engineers wanted plastic because it wouldn’t shatter. Jobs made the argument that glass had far superior user experience and felt more premium, and plastic was more prone to scratches. \n\nJobs said if a user puts their iPhone in their pocket and it get scratched up by their keys they’ll blame the phone. But if they drop and shatter it, they’ll blame themselves. Jobs was right. Customers prefer the glass with a better feel with the trade off that accidents happen.",
          "score": 13,
          "created_utc": 1730645319.0,
          "replies": [
            {
              "id": "lv6ogii",
              "author": "WangMangDonkeyChain",
              "body": "gorilla glass would cost Apple an extra .03¢ per phone in licensing costs.\n\ndon’t be ridiculous.",
              "score": -4,
              "created_utc": 1730645544.0,
              "replies": [
                {
                  "id": "lv7twow",
                  "author": "quixoticslfconscious",
                  "body": "The first iPhone literally launched Gorilla Glass and Apple still uses Corning glass today.",
                  "score": 4,
                  "created_utc": 1730658190.0,
                  "replies": [
                    {
                      "id": "lv8f0q7",
                      "author": "Kinnins0n",
                      "body": "forget it, that fact about Apple and Corning doesn’t fit the guy’s narrative so he can’t allow it.",
                      "score": 2,
                      "created_utc": 1730664549.0,
                      "replies": [
                        {
                          "id": "lv9j9sa",
                          "author": "NecroCannon",
                          "body": "I never engage in conversations about Apple because of how biased they usually are, it’s never a conversation with two different views, but one biased person screeching about what they hate and will absolutely waste your time to feel right even if they’re wrong",
                          "score": 3,
                          "created_utc": 1730677151.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lv7uc1w",
                      "author": "WangMangDonkeyChain",
                      "body": "false.\n\nmade by Corning sure, but to Apple’s direct specifications.",
                      "score": -5,
                      "created_utc": 1730658315.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lv6g03s",
          "author": "DarthBuzzard",
          "body": "Steve Jobs: *\"Some people say give the customers what they want. But that’s not my approach. Our job is to figure out what they’re going to want before they do.\"*",
          "score": 9,
          "created_utc": 1730642590.0,
          "replies": [
            {
              "id": "lv6garj",
              "author": "WangMangDonkeyChain",
              "body": "cocaine and fruitarianism will do that to a guy…",
              "score": 3,
              "created_utc": 1730642699.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv6rhvb",
          "author": "Kinnins0n",
          "body": "Good thing Apple spends an ungodly amount of engineering time and money making the iPhone drop resistant then.",
          "score": 4,
          "created_utc": 1730646544.0,
          "replies": [
            {
              "id": "lv6s9qu",
              "author": "WangMangDonkeyChain",
              "body": "they’ve got a nice case to sell you… be a shame if you dropped it…",
              "score": 1,
              "created_utc": 1730646793.0,
              "replies": [
                {
                  "id": "lv6vkt9",
                  "author": "Kinnins0n",
                  "body": "Apple literally drops hundreds of phones during development to zero-in on the most resilient architectures. \n\nBut I guess “bad company bad”, right?",
                  "score": 3,
                  "created_utc": 1730647869.0,
                  "replies": [
                    {
                      "id": "lv6w2tj",
                      "author": "WangMangDonkeyChain",
                      "body": "no, good company has become greedy and rudderless is all. ",
                      "score": 2,
                      "created_utc": 1730648020.0,
                      "replies": [
                        {
                          "id": "lv6zody",
                          "author": "Kinnins0n",
                          "body": "And your evidence that Apple isn’t working on the phone resistance to drop?",
                          "score": 2,
                          "created_utc": 1730649110.0,
                          "replies": [
                            {
                              "id": "lv6ztft",
                              "author": "WangMangDonkeyChain",
                              "body": "and yours that it is??",
                              "score": 3,
                              "created_utc": 1730649154.0,
                              "replies": [
                                {
                                  "id": "lv71s3m",
                                  "author": "Kinnins0n",
                                  "body": "I work in the field. Not only is it true everywhere premium hardware is developped, but Apple is the gold standard for reliability testing. Typically >100 phones dropped on granite in various orientation per engineering build. Many more during mass production ramp, totaling low-thousand number of units dropped and torn apart to figure what breaks first and how to improve it.",
                                  "score": 2,
                                  "created_utc": 1730649766.0,
                                  "replies": [
                                    {
                                      "id": "lv72fab",
                                      "author": "WangMangDonkeyChain",
                                      "body": "cool, maybe you can convince Tim to license gorilla glass from Corning, but i doubt it… the cases are hugely profitable. ",
                                      "score": 0,
                                      "created_utc": 1730649966.0,
                                      "replies": [
                                        {
                                          "id": "lv749ls",
                                          "author": "Kinnins0n",
                                          "body": "Hmm, you do realize that Apple and Corning work hand in hand on every single iPhone?\n\nWho do you think manufactures the so-called “Ceramic Shield” of the iPhone? And how much money do you think Apple invested for the development of that glass at Corning (hint: the answer has 9 digits) ? \n\nMaybe be a little bit less quick to jump to conclusion if you know so little about hardware development.",
                                          "score": 2,
                                          "created_utc": 1730650540.0,
                                          "replies": [
                                            {
                                              "id": "lv74xsi",
                                              "author": "WangMangDonkeyChain",
                                              "body": "you’re a bot aren’t you?",
                                              "score": 1,
                                              "created_utc": 1730650753.0,
                                              "replies": [
                                                {
                                                  "id": "lv75om7",
                                                  "author": "Kinnins0n",
                                                  "body": "Ah yeah, only a bot could prove that you are dead wrong, right?\n\nGood day, fellow human.",
                                                  "score": 1,
                                                  "created_utc": 1730650984.0,
                                                  "replies": [
                                                    {
                                                      "id": "lv75x40",
                                                      "author": "WangMangDonkeyChain",
                                                      "body": "the only thing you’ve proven is that Apple fanboys don’t care about reality anymore. ",
                                                      "score": 1,
                                                      "created_utc": 1730651058.0,
                                                      "replies": [
                                                        {
                                                          "id": "lv79o04",
                                                          "author": "Kinnins0n",
                                                          "body": "ha yeah, engineer who actually works on the hardware you are discussing = “fanboy”\n\nmust be fun to always be the most knowledgeable person in every convo.",
                                                          "score": 3,
                                                          "created_utc": 1730652189.0,
                                                          "replies": [
                                                            {
                                                              "id": "lv7hanz",
                                                              "author": "WangMangDonkeyChain",
                                                              "body": "as if. \n\nwhy don’t you just admit the vr headsets\nsuck and keeping up with Facebook’s ridiculous thrashing in search of a\nbusiness model is bad for the industry and the brand.",
                                                              "score": -1,
                                                              "created_utc": 1730654461.0,
                                                              "replies": [
                                                                {
                                                                  "id": "lv7ivgy",
                                                                  "author": "Kinnins0n",
                                                                  "body": "where did I say anything about the headset? you brought that apple should work on iPhones that don’t break and i pointed out to you that Apple very much does, to a shocking extent. \n\nthe vr headset is fine, technically speaking. but there is indeed not really any market for it.",
                                                                  "score": 3,
                                                                  "created_utc": 1730654925.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "lv7m43x",
                                                                      "author": "WangMangDonkeyChain",
                                                                      "body": "?? what is the topic of this post? \n\ndude, just stop with your bullshit. \n\nApple tells Corning the specs for their glass, and that glass shatters when dropped from 2m onto concrete 100% of the times…\n\nbut vr headsets are getting cheaper!!! \n\n\ni mean….. wtaf. ",
                                                                      "score": -1,
                                                                      "created_utc": 1730655899.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lvb7n85",
                          "author": "Elephant789",
                          "body": "> good company\n\nWhen were they good? During Steve Jobs days they were even worse.",
                          "score": 1,
                          "created_utc": 1730702126.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvb7jyz",
                      "author": "Elephant789",
                      "body": "All companies do that.",
                      "score": 1,
                      "created_utc": 1730702072.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lv72r0c",
      "author": "None",
      "body": "Since VisionOS 2 is out, I'd give it until the next round of iOS releases before they pull the plug altogether. I mean, just abruptly stop providing updates and app support.",
      "score": 1,
      "created_utc": 1730650066.0,
      "replies": []
    },
    {
      "id": "lv72wkx",
      "author": "Difficult-Outside424",
      "body": "2027….",
      "score": 1,
      "created_utc": 1730650113.0,
      "replies": []
    },
    {
      "id": "lv74fec",
      "author": "Solicited_Duck_Pics",
      "body": "Still a no for me. The tech is neat, but I don’t want to wear a heavy device on my face.",
      "score": 1,
      "created_utc": 1730650592.0,
      "replies": []
    },
    {
      "id": "lv7ib29",
      "author": "TeamCool1066",
      "body": "It’s never going to happen",
      "score": 1,
      "created_utc": 1730654756.0,
      "replies": []
    },
    {
      "id": "lv7rzj8",
      "author": "Va1crist",
      "body": "Aka can’t make it cheaper to be worth it , even if you had the cash the current Vision Pro is worthless , making it cheaper isn’t going to fix the fact it’s worthless and has literally no use case",
      "score": 1,
      "created_utc": 1730657621.0,
      "replies": []
    },
    {
      "id": "lv7yx3w",
      "author": "etniesen",
      "body": "Eh this again.  We just aren’t quite ready for this technology wise.  Just a couple years too early",
      "score": 1,
      "created_utc": 1730659651.0,
      "replies": []
    },
    {
      "id": "lv82mwj",
      "author": "larini_vjetrovi",
      "body": "Sorry for the spelling \n\n\nI understand that this device is awesome and it’s really great thing to have, especially if you are in the gadgets and VR stuff.\n\n\nBut I just can’t defend this kind of price, or even 2000$ because it’s something that it’s very limited and only one person can use it at the time. I know that it have very strong hardware and soo. But even if they maxed it out to the roof I don’t see the point of spending that am of money. \n\n\nNow if we are talking about MacBook this is something that I can understand because it’s the laptop for the business and stuff that you actually can make some money and productive work or even some hobby like music, video editing, making pictures and more.",
      "score": 1,
      "created_utc": 1730660756.0,
      "replies": []
    },
    {
      "id": "lv99wzr",
      "author": "Bilcifer",
      "body": "They're just waiting till the parts are dated and cheaper",
      "score": 1,
      "created_utc": 1730674151.0,
      "replies": []
    },
    {
      "id": "lv9kyx3",
      "author": "EnglishDutchman",
      "body": "In other words, it’s never coming.",
      "score": 1,
      "created_utc": 1730677711.0,
      "replies": []
    },
    {
      "id": "lva62th",
      "author": "pdzulu",
      "body": "That’s fine. I mean nobody actually wants one anyway",
      "score": 1,
      "created_utc": 1730685108.0,
      "replies": []
    },
    {
      "id": "lvafhjb",
      "author": "i_am_banished",
      "body": "we're going to have full body prosthetics and robot eyes by then according to deus ex man, that's a massive hold up.",
      "score": 1,
      "created_utc": 1730688573.0,
      "replies": []
    },
    {
      "id": "lvbheih",
      "author": "yanginatep",
      "body": "I can see Apple changing direction and aiming for something closer to the in-development Meta and Snapchat AR glasses.",
      "score": 1,
      "created_utc": 1730708599.0,
      "replies": []
    },
    {
      "id": "lvcaozm",
      "author": "cmoz226",
      "body": "But how will we get to the metaverse?",
      "score": 1,
      "created_utc": 1730725660.0,
      "replies": []
    },
    {
      "id": "lv8je7k",
      "author": "None",
      "body": "Devs just refuse to develop for it so idk why anyone is buying or cares.",
      "score": 1,
      "created_utc": 1730665884.0,
      "replies": []
    },
    {
      "id": "lv6lpy2",
      "author": "j_middles",
      "body": "You’ll never hear about this product again",
      "score": -1,
      "created_utc": 1730644620.0,
      "replies": [
        {
          "id": "lvb703w",
          "author": "Asking4Afren",
          "body": "Bullshit. The tech is cool.",
          "score": 0,
          "created_utc": 1730701732.0,
          "replies": [
            {
              "id": "lvb805r",
              "author": "Elephant789",
              "body": "But not the product.",
              "score": 1,
              "created_utc": 1730702347.0,
              "replies": [
                {
                  "id": "lvdl689",
                  "author": "Asking4Afren",
                  "body": "Have you tried the demo? It's unbelievable tech man.",
                  "score": 1,
                  "created_utc": 1730740779.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m56zgro",
              "author": "j_middles",
              "body": "Welp https://www.techspot.com/news/106170-apple-may-have-ended-production-vision-pro-headset.html",
              "score": 1,
              "created_utc": 1735917952.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lv6hhet",
      "author": "kingofwale",
      "body": "It’s dead, Jim…",
      "score": 0,
      "created_utc": 1730643127.0,
      "replies": []
    },
    {
      "id": "lv6nct1",
      "author": "None",
      "body": "dead on arrival.",
      "score": -1,
      "created_utc": 1730645174.0,
      "replies": []
    }
  ]
}