{
  "post": {
    "title": "Nintendo Steps on PR Minefield as Exec Tells People They Can Buy the Switch If They Can’t Afford the Switch 2",
    "author": "chrisdh79",
    "id": "1jv5h2y",
    "score": 2118,
    "created_utc": 1744204437.0,
    "selftext": "",
    "num_comments": 401,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jv5h2y/nintendo_steps_on_pr_minefield_as_exec_tells/"
  },
  "comments": [
    {
      "id": "mm7mvyn",
      "author": "TheDynamicDino",
      "body": ">…[W]e believe that the pricing is appropriate for the value of the machine and the gameplay experience overall. We recognize there are some people that may not be able to afford the Nintendo Switch 2 price point. That’s why we wanted to make the other Switch platforms available, so people still have an opportunity to come into our gaming universe, be a part of these characters in these worlds, and see value, if you will, in whatever rung of the platform they come in.\n\nThe full quote.",
      "score": 1180,
      "created_utc": 1744206771.0,
      "replies": [
        {
          "id": "mm7qdle",
          "author": "Tasik",
          "body": "So they said they would continue to release games for the Switch. Sounds pretty reasonable to me. \n\nWe live in the era of rage bait and we take it every time.",
          "score": 1348,
          "created_utc": 1744207854.0,
          "replies": [
            {
              "id": "mm84e4w",
              "author": "mattsslug",
              "body": "Yeh, with the full quote it's certainly not on the level of the Xbox stupid comment regarding always on internet or the always wonderful blizzard...do you guys not have phones.",
              "score": 188,
              "created_utc": 1744212042.0,
              "replies": [
                {
                  "id": "mm9g95k",
                  "author": "jimmymcstinkypants",
                  "body": "I remember the PlayStation guy saying that people should get a second job if they have trouble affording the console. \n\nEdit: wow that was the PS3. Time flies. \n\nEdit2: \"Our goal for PlayStation 3 is for consumers to think to themselves, 'I will work more hours to buy one,' \" Kutaragi told the Japanese magazine Toyo Keizai. \"We want people to feel that they want it, irrespective of anything else.\"",
                  "score": 92,
                  "created_utc": 1744225917.0,
                  "replies": [
                    {
                      "id": "mm9gqta",
                      "author": "mattsslug",
                      "body": "Really, I don't remember that one...but that must be the most tone deaf one.",
                      "score": 27,
                      "created_utc": 1744226063.0,
                      "replies": [
                        {
                          "id": "mm9yv5v",
                          "author": "OcculusSniffed",
                          "body": "I'm still flabbergasted at \"do you not have phones?\"",
                          "score": 33,
                          "created_utc": 1744231329.0,
                          "replies": [
                            {
                              "id": "mm9zd8n",
                              "author": "mattsslug",
                              "body": "It was funny, like they just couldn't grasp how people that like diablo....wanted an actual diablo game not a phone game.",
                              "score": 20,
                              "created_utc": 1744231474.0,
                              "replies": [
                                {
                                  "id": "mmd78ga",
                                  "author": "Wisdomlost",
                                  "body": "Their biggest problem was there was massive rumors about diablo 4 being announced at that con. Rumors that blizzard fed for a couple days before they realized oh that might be a bad idea and stopping pushing the Rumors further. I dont think a phone game announcement would have been well received no matter how they did it but if they would have shut down the D4 Rumors immediately and tried to temper expectations instead of building hype for the wrong reasons then the backlash would have been vastly smaller. They shot themselves in the foot by trying to ride a hype train for something they knew was not happening.",
                                  "score": 9,
                                  "created_utc": 1744281857.0,
                                  "replies": []
                                },
                                {
                                  "id": "mmah74k",
                                  "author": "AcceptableFold5",
                                  "body": "And then the phone game went on to make hundreds of millions, proving the company right and everyone else wrong again.",
                                  "score": -3,
                                  "created_utc": 1744237089.0,
                                  "replies": [
                                    {
                                      "id": "mmakg09",
                                      "author": "BrotherRoga",
                                      "body": "Hundreds of millions by exploitation of vulnerable people like gambling addicts and children.\n\nJust because you are successful as a business does not mean it is for a good and justifiable reason.",
                                      "score": 14,
                                      "created_utc": 1744238227.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mmc8bcr",
                                      "author": "ThePrussianGrippe",
                                      "body": "“I made a hundred million dollars selling addiction to children around the world, your honor, thus I’ve committed no crime since I made lots of money. I am in the right!”",
                                      "score": 1,
                                      "created_utc": 1744260834.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mmdepwk",
                          "author": "SycoJack",
                          "body": "More than sense of pride and accomplishment?",
                          "score": 1,
                          "created_utc": 1744285395.0,
                          "replies": [
                            {
                              "id": "mmdexcd",
                              "author": "mattsslug",
                              "body": "Oh...I have no idea how I forgot that one, just beautiful.",
                              "score": 2,
                              "created_utc": 1744285484.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mmaatdd",
                      "author": "Strict_Ad1246",
                      "body": "I’ll give a pass on this since he’s not wrong. If you want a luxury good working a couple more hours for it should be worth it to you. Now someone saying “get another job if you can’t buy our food”should drop dead",
                      "score": 8,
                      "created_utc": 1744234983.0,
                      "replies": [
                        {
                          "id": "mmoznkd",
                          "author": "DvorakUser82",
                          "body": "There are some companies where overtime has to be approved in advance (like the one I work for). Makes working \"a couple more hours\" rather difficult.",
                          "score": 1,
                          "created_utc": 1744439293.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mmarzix",
                      "author": "PM_YOUR_BOOBS_PLS_",
                      "body": "All Katuragi is saying is he wants the console to be extremely desirable.  It's just an over-the-top way of saying it.",
                      "score": 2,
                      "created_utc": 1744240798.0,
                      "replies": []
                    },
                    {
                      "id": "mm9szjt",
                      "author": "Mean_Peen",
                      "body": "Tbf, that is a logical way of thinking in Japan. Just doesn’t gel well with us",
                      "score": 1,
                      "created_utc": 1744229616.0,
                      "replies": [
                        {
                          "id": "mmfexie",
                          "author": "fleemfleemfleemfleem",
                          "body": "It gels fine. They're not selling a necessity, it's a toy for playing games. I can't get mad at high prices on things that are expensive to make and I don't actually need.",
                          "score": 1,
                          "created_utc": 1744308330.0,
                          "replies": []
                        },
                        {
                          "id": "mmhr3gp",
                          "author": "zap_p25",
                          "body": "Exactly. Falls in line with Japanese work culture.",
                          "score": 1,
                          "created_utc": 1744335527.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mmhqy2y",
                      "author": "zap_p25",
                      "body": "Having worked for a Japanese owned company…that’s just Japanese work culture shining through. Has nothing to do with how it was received in the rest of the world. \n\nWork culture in Japan is very different from the rest of the western world. Dedicated employees never ask for raises, are happy to work extra, and are pretty much expected to devote their lives to the company and their work.",
                      "score": 1,
                      "created_utc": 1744335472.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mm98m8b",
                  "author": "Tittysprinkle97",
                  "body": "Yeah Xbox guy was a lot worse when he said what he said. It was something along the lines of “we have a product for people that can’t afford Xbox one, it’s Xbox 360”",
                  "score": 24,
                  "created_utc": 1744223678.0,
                  "replies": [
                    {
                      "id": "mm9t3d6",
                      "author": "broke_in_nyc",
                      "body": "Don Mattrick (the “Xbox guy” you’re referring to) said they have a product for people who don’t have internet connectivity, not if they couldn’t afford it.",
                      "score": 19,
                      "created_utc": 1744229646.0,
                      "replies": [
                        {
                          "id": "mm9x4d5",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -1,
                          "created_utc": 1744230818.0,
                          "replies": [
                            {
                              "id": "mm9zkg7",
                              "author": "broke_in_nyc",
                              "body": "IMO the entire situation was a bit overblown. Of the countries the Xbox One was launching in, an overwhelming majority had internet connectivity. I think the estimate was something like 5% of prospective buyers *may* be affected, but that there would even be a plan for them eventually. Then, even after MS reversed the policy, people still harped on them for it. Honestly, the whole “console war” thing is cringe as fuck and only helps bolster anti-consumer practices.",
                              "score": 2,
                              "created_utc": 1744231533.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mm99sql",
                      "author": "mattsslug",
                      "body": "Yeh that was about it. It's a similar sentiment but at least Nintendo said it in a far more diplomatic way and sounds like they are not just ending support for the switch.",
                      "score": 13,
                      "created_utc": 1744224023.0,
                      "replies": [
                        {
                          "id": "mm9sqn9",
                          "author": "Mean_Peen",
                          "body": "This all basically exists for PlayStation as well, they just never outwardly said “if you guys can’t afford the PS5, PS4 and the Pro are still an option.”, so nobody got upset lol",
                          "score": 2,
                          "created_utc": 1744229545.0,
                          "replies": []
                        },
                        {
                          "id": "mmbq459",
                          "author": "Fredasa",
                          "body": "They're not ending support for Switch for very practical reasons.  First being the simple fact that a large chunk of their user base can't afford the new console.  Second being the equally simple fact that most of their user base hasn't been clamoring for PS4 visuals when PS3 visuals have been sufficing just fine.  Good luck trying to get parents and kids interested in forking over $500 for a visual upgrade that those specific demographics almost certainly couldn't even identify in an A/B comparison.",
                          "score": 1,
                          "created_utc": 1744252794.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mmdao28",
                  "author": "raqloise",
                  "body": "“Do you guys not have phones” in a room filled with an audience of your customers and peers…\n\nInsult the people who buy your products. Genius.",
                  "score": 4,
                  "created_utc": 1744283551.0,
                  "replies": []
                },
                {
                  "id": "mmelaww",
                  "author": "Creative_Impulse",
                  "body": "The reason that feels lame is because it takes dev time to make games compatible for both consoles and usually takes away options for more high end features on the new thing because you still have to run it on the old hardware in some way.\n\nIdk, as a consumer who will now pay way more for Switch 2 games, that DOES upset me. If I am paying more, they better be fully utilizing the new specs of the console I paid a high price for.",
                  "score": 1,
                  "created_utc": 1744299704.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8q6j7",
              "author": "AsianSteampunk",
              "body": "Last time they release the 3DS, said the DS will be continue supported. guess who died like 2 months after?",
              "score": 57,
              "created_utc": 1744218457.0,
              "replies": [
                {
                  "id": "mmc1c9x",
                  "author": "darkmacgf",
                  "body": "Pokemon Black and White 2 came out for the DS like 8 months after the 3DS released.",
                  "score": 10,
                  "created_utc": 1744257498.0,
                  "replies": []
                },
                {
                  "id": "mmbb12n",
                  "author": "SolidOshawott",
                  "body": "Last time they released the Switch in March 2017 and the 3DS still got games until early 2019.\n\nAnd that was a completely different development pipeline. Switch and Switch 2 are much more similar.",
                  "score": 36,
                  "created_utc": 1744247522.0,
                  "replies": [
                    {
                      "id": "mmc6fkw",
                      "author": "LyokoMan95",
                      "body": "Switch games need to run under hardware emulation on the Switch 2. While they are both ARM64 systems, the way the games are compiled make them incompatible at a hardware level.",
                      "score": 0,
                      "created_utc": 1744259905.0,
                      "replies": [
                        {
                          "id": "mmc8g8c",
                          "author": "metrohopper",
                          "body": "How would you know?",
                          "score": 3,
                          "created_utc": 1744260903.0,
                          "replies": [
                            {
                              "id": "mmc94on",
                              "author": "DJfunkyPuddle",
                              "body": "Their uncle works at Nintendo",
                              "score": 8,
                              "created_utc": 1744261247.0,
                              "replies": []
                            },
                            {
                              "id": "mmcssbu",
                              "author": "frogmaster82",
                              "body": "MVG has a whole video on the Switch 2 having to emulate Switch games for the backwards compatibility. This is probably one of the reasons that they are charging for the Switch 2 upgrades since they had to change the code to make the games run natively on the system.",
                              "score": 2,
                              "created_utc": 1744272961.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mmce37e",
                          "author": "SolidOshawott",
                          "body": "I know, but that's not quite the point. It's still a *much* more similar development process for cross-gen games. Similarly shaped devices with similar functionalities.\n\nBesides, we can be pretty confident that any new first-party Switch 1 game going forward will receive a \"Switch 2 Edition\". Nintendo's development teams won't be split between Switch 1 and 2.",
                          "score": 1,
                          "created_utc": 1744263917.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mm98zqs",
                  "author": "Tasik",
                  "body": "Yeah fair point.",
                  "score": 2,
                  "created_utc": 1744223787.0,
                  "replies": []
                },
                {
                  "id": "mmcwidp",
                  "author": "Grimreap32",
                  "body": "To me, this just stinks of the Wii U all over again...\n\n\nI'd have thought they would have learned from the Wii U or the 'New 3ds'",
                  "score": 1,
                  "created_utc": 1744275438.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7yvqo",
              "author": "Zhelthan",
              "body": "Some months ago, around November I think, Nintendo said that for them Switch(1) has “just” reached half of its lifespan so they will want to support it for almost 7 more years",
              "score": 55,
              "created_utc": 1744210406.0,
              "replies": [
                {
                  "id": "mm82pvf",
                  "author": "synthdrunk",
                  "body": "The amount of limited editions of Lites that will be coming will be astounding. They’re not going to quit selling the things as they get cheaper and cheaper to make (from a Total Cost standpoint).",
                  "score": 37,
                  "created_utc": 1744211543.0,
                  "replies": [
                    {
                      "id": "mm89lp4",
                      "author": "None",
                      "body": "[removed]",
                      "score": 24,
                      "created_utc": 1744213584.0,
                      "replies": [
                        {
                          "id": "mm8b344",
                          "author": "Aritra319",
                          "body": "Indeed. We’ve seen this with PS4 and 5/ Xbox One and Series.",
                          "score": 7,
                          "created_utc": 1744214017.0,
                          "replies": []
                        },
                        {
                          "id": "mm921l3",
                          "author": "None",
                          "body": "There’s probably near 0 games coming out for the switch 2 that will be too “powerful” for the switch 1 that can’t be down scaled to compromise. \n\nLower FPS less draw distance etc. Nintendo isn’t know for pushing the limiting of visual fidelity or gameplay smoothness haha.",
                          "score": 12,
                          "created_utc": 1744221775.0,
                          "replies": [
                            {
                              "id": "mm9hhcw",
                              "author": "Cdwoods1",
                              "body": "Why the downvotes? They’re right haha. Or are games like the new pokemon really pushing the limits of the switch?",
                              "score": 7,
                              "created_utc": 1744226282.0,
                              "replies": [
                                {
                                  "id": "mm9klp3",
                                  "author": "None",
                                  "body": "Fan boys. No other reason. It’s been decades of shoddy graphics and people are still upset. Even the newest games could have been made a decade ago and look and play better. \n\nBut their IP keeps them a leader.",
                                  "score": 10,
                                  "created_utc": 1744227199.0,
                                  "replies": [
                                    {
                                      "id": "mmipgno",
                                      "author": "Schwiliinker",
                                      "body": "It’s not really that their IPs are even that good at all it’s just that children and extremely casual gamers settle with Nintendo",
                                      "score": 1,
                                      "created_utc": 1744350872.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mm9l9f4",
                                      "author": "Cdwoods1",
                                      "body": "Yeah it’s frustrating. I grew up on Nintendo and have a soft spot for them, but they are literally infamous for unoptimized games. Monolith Soft is the one big exception, but is not the norm",
                                      "score": 0,
                                      "created_utc": 1744227392.0,
                                      "replies": [
                                        {
                                          "id": "mmbc26n",
                                          "author": "chiptunesoprano",
                                          "body": "Since when? *Pokemon* has been having issues with unoptimized games lately, but 1st and 2nd party Nintendo games are typically the best running games on their systems. Mario Odyssey, Mario Kart, Smash Bros, and Splatoon 2/3 are all 60fps titles without serious frame drops afaik. When they can't make it they usually have them run a stable 30 instead like Zelda and Kirby.",
                                          "score": 4,
                                          "created_utc": 1744247884.0,
                                          "replies": [
                                            {
                                              "id": "mmgjpma",
                                              "author": "Cdwoods1",
                                              "body": "All of your examples are games with simpler art styles and simpler graphics. And most online games with Nintendo are very much not optimized. If a single person lags, literally everybody lags. That’s unacceptable in online games to literally everyone but Nintendo. I’m sorry but those examples just aren’t pushing any limits. They’re all great games, but it’s not Nintendo’s focus.",
                                              "score": 1,
                                              "created_utc": 1744320365.0,
                                              "replies": [
                                                {
                                                  "id": "mmhaa4r",
                                                  "author": "chiptunesoprano",
                                                  "body": "...Nintendo's main IPs made by their main dev team aren't their focus?",
                                                  "score": 1,
                                                  "created_utc": 1744329340.0,
                                                  "replies": [
                                                    {
                                                      "id": "mmhcivm",
                                                      "author": "Cdwoods1",
                                                      "body": "Performance is not Nintendo’s focus. The topic of the conversation.",
                                                      "score": 1,
                                                      "created_utc": 1744330138.0,
                                                      "replies": [
                                                        {
                                                          "id": "mmhdw6h",
                                                          "author": "chiptunesoprano",
                                                          "body": "I didn't say it was their focus. Their focus has always been gameplay. 1st party Nintendo titles are usually some of the best running because they have more intimate knowledge of the hardware, and they aren't badly downsizing games from more powerful systems like a lot of ports.",
                                                          "score": 1,
                                                          "created_utc": 1744330634.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mm99p6x",
                              "author": "daandriod",
                              "body": "At what point where to far though? Even now, the switch struggles to play a decent amount of its games with a steady fps and good resolutions. I suspect devs can't really optimize much more. End of the day, it had 2015 specs when it released. \n\nIt will be even worse then what Microsoft has been doing with the Series S. Not a good outlook",
                              "score": 1,
                              "created_utc": 1744223995.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mm87gjd",
                      "author": "CharlesP2009",
                      "body": "And gamers seem to find it laudable that the PlayStation 2 stuck around so long and had so much success. Or even the Sega Genesis when it comes to how long it lived on in Brazil.\n\nI appreciate Nintendo for doing things their own way.\n\nSo, yeah, that title smacks of rage bait. And I don’t know about the rest of you, but I am tired of non-stop rage about *everything*.",
                      "score": 8,
                      "created_utc": 1744212957.0,
                      "replies": []
                    },
                    {
                      "id": "mm8qf1z",
                      "author": "kscountryboy85",
                      "body": "This is only valid if the price of the switch and its games continue to drop with said price reductions. \n\nI almost pulled the trigger on a switch a few months ago, heard about the switch 2 thought I would wait... yeah... no way am I going to jump into nintendos walled garden and absolutely bonkers over priced weak ass ecosystem now. Cant even match a  last gen X86 chip? Lol. Can it truly even match a steam deck? Those are alread underpowered.",
                      "score": 3,
                      "created_utc": 1744218526.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm90c60",
              "author": "Omnizoom",
              "body": "I said in a gaming reddit that this was rage bait and the full quote doesn’t say anything remotely bad enough to be a PR minefield and got downvoted for not just reading a headline…",
              "score": 16,
              "created_utc": 1744221296.0,
              "replies": []
            },
            {
              "id": "mm7vvli",
              "author": "JamesIV4",
              "body": "We take it for clicks and $$$",
              "score": 9,
              "created_utc": 1744209526.0,
              "replies": []
            },
            {
              "id": "mm854w9",
              "author": "MrPlanetJustin",
              "body": "Don Mattrick said something similar to this when the Xbox one was revealed. It did not go over well. I don’t care what the intention was. It’s not a good look.",
              "score": 13,
              "created_utc": 1744212264.0,
              "replies": [
                {
                  "id": "mm8mmk6",
                  "author": "Dhiox",
                  "body": "It's not a fair comparison, telling gamers they still have the more affordable albeit weaker model that some games will still be coming out in is reasonable. Telling people they should just stick to the old dead console because they don't have good internet is not.",
                  "score": 7,
                  "created_utc": 1744217428.0,
                  "replies": []
                },
                {
                  "id": "mm924wg",
                  "author": "koos_die_doos",
                  "body": "His quote was pure hubris, while this is quite respectful, it’s not the same at all.",
                  "score": 10,
                  "created_utc": 1744221801.0,
                  "replies": [
                    {
                      "id": "mm9hpd1",
                      "author": "Cdwoods1",
                      "body": "What’s different about the two quotes message wise? One just seems to be more PR speak filtered",
                      "score": 2,
                      "created_utc": 1744226348.0,
                      "replies": [
                        {
                          "id": "mmagmvt",
                          "author": "PatternrettaP",
                          "body": "I think it's context in the overall market place changes how people react to it.\n\nMicrosoft was announcing a new machine at a very high price point for the time, while they were being undercut by Sony a full $100 cheaper and having to defend the value proposition of their console against it and some of their more unusual choices (Kinect, No 4k disc support, etc) \n\nThe answer people wanted to hear was \"whoops, we got our pricing wrong, we will be matching Sony at $399\" Instead they got a \"we know our worth and deserve the premium\" answer and people said ok and then PS4 outsold Xbox 2:1.\n\nNintendo is in a different situation. Traditionally they have gone for the value market so $450 is huge for a Nintendo console, but it's not the most expensive one out now so they can be a little more confident in their pricing without seeming cocky. If the current steam deck undercut them by $100 it would be a different story.",
                          "score": 3,
                          "created_utc": 1744236896.0,
                          "replies": [
                            {
                              "id": "mmgjy00",
                              "author": "Cdwoods1",
                              "body": "I see where you’re coming from, but considering the switch 2 is more in the previous console generation range power wise, I’d say those are the prices they’d be competing with.",
                              "score": 1,
                              "created_utc": 1744320439.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mmfp8s4",
                          "author": "ChaosLord121",
                          "body": "The difference is that with the Xbox One debacle, Microsoft execs pretty much told people to suck it up if you don’t like the always online requirements and restrictive nature of the console. They quietly walked back on that after E3 that year.\n\nNintendo’s statement boils down to letting consumers know that they are still going to support the Switch 1, though I will agree that it is pretty tone deaf.",
                          "score": 1,
                          "created_utc": 1744311353.0,
                          "replies": [
                            {
                              "id": "mmgjdb7",
                              "author": "Cdwoods1",
                              "body": "I’m sorry but to me that’s just the same message but one has better PR. There’s differences in the situation but both are really just, “don’t like it? Then get the old out of date console instead.”",
                              "score": 1,
                              "created_utc": 1744320257.0,
                              "replies": [
                                {
                                  "id": "mmtb4k2",
                                  "author": "NefariousRaccoon",
                                  "body": "It is indeed the same. People are just playing semantics cause it's nintendo. LOL",
                                  "score": 2,
                                  "created_utc": 1744500772.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mm8iyh5",
                  "author": "Bridgebrain",
                  "body": "MSs problem is they drop the old platform for the new platform the second they can, nintendos friendlier about it for a few years. Im sure the average user isnt making that distinction though.",
                  "score": 6,
                  "created_utc": 1744216352.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7xogp",
              "author": "ItsOkAbbreviate",
              "body": "Well he did basically say if you’re to poor for the new one there is still the old one in nicer wording. The thing is support for how long since I don’t believe nvidia is still manufacturing the silicon for that version any longer. A year two years three who knows. If anything they should have just said nothing they are already in enough hot water with the pricing, the game pricing, how they are handling the carts, the empty carts with just codes on them the game upgrades to switch two quality the cheaper Asian market version etc. \n\nJust know this does not affect me I was not going to get one it’s just a bit tone deaf right at this moment.",
              "score": 15,
              "created_utc": 1744210057.0,
              "replies": []
            },
            {
              "id": "mm7z6um",
              "author": "Oahkery",
              "body": "How is it rage bait? The headline is literally what he said in the quote, that some people can't afford Switch 2 so they can still buy Switch 1. Dressing it up in PR speak by saying \"make available\" and \"Switch platforms\" doesn't change anything. Maybe they're still going to release some Switch 1 games for a period of transition like with PS4 to PS5, but after, it's not going to be the same ones as Switch 2. That's why he said people can \"experience these characters in these worlds,\" not \"experience these games.\" \n\nWe live in the era of corporate boot licking and some people are ready to slobber all over them every time.",
              "score": 20,
              "created_utc": 1744210496.0,
              "replies": [
                {
                  "id": "mm8sejv",
                  "author": "Turmoil_Engage",
                  "body": "There's a clear attempt to call back to the Xbox 360 controversy in the headline.\n\nAlso, nuance and objectivity in discussions aren't corporate bootlicking. If we live in any era, it's the \"my feelings are more important than facts\" one.",
                  "score": 4,
                  "created_utc": 1744219098.0,
                  "replies": [
                    {
                      "id": "mm8thzk",
                      "author": "mimbo757",
                      "body": "I’m all for nuance but it isn’t that nuanced. It’s PR speak for go buy the old version, we’ll toss on some games and charge the shit out of ya if you want a switch 2. There’s no hidden meaning here and folks can care or not care but no one is being all that reactionary. Switch 1 was pushing its limit for games years ago.",
                      "score": 14,
                      "created_utc": 1744219404.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mm80z14",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -8,
                  "created_utc": 1744211021.0,
                  "replies": [
                    {
                      "id": "mm8crw9",
                      "author": "Oahkery",
                      "body": "There's absolutely nothing in that quote that implies they'll continue to support the Switch. I think they will to some extent because they're in the same position as PS4 in not wanting to immediately trash a huge install base and launching in a weird economic situation, but we already have the new Mario Kart and Donkey Kong being Switch 2 exclusives, and (as far as I know since I haven't been keeping complete track) no new first-party games announced that will be cross gen, only confirming that ones that were already announced for Switch 1 like Metroid will be getting upgrades for S2. And he very specifically didn't say you could play the same games but instead made a point to say you could experience the same characters and worlds.",
                      "score": 2,
                      "created_utc": 1744214514.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mm9uhyd",
                  "author": "froggyjm9",
                  "body": "Why do you have to buy a console at all?",
                  "score": -2,
                  "created_utc": 1744230053.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8ynn6",
              "author": "bonesnaps",
              "body": "Should be exciting to see the new Mario Kart run on Switch1 hardware at similar performance as Cyberpunk 2077 ran on PS4.",
              "score": 2,
              "created_utc": 1744220837.0,
              "replies": [
                {
                  "id": "mme4tov",
                  "author": "octagonallanogatco",
                  "body": "Ah, but you see they also said the new Mario Kart is a Switch 2 exclusive and will not be available on Switch 1.\n\n\"Zip around courses in a vast world where everything is connected. Race along grassy plains, bustling cities, wide-open waters, big ol' volcanos, and more—plus everything in between. Exclusively for the Nintendo Switch™ 2 system!\" Direct from the [Nintendo website.](https://www.nintendo.com/us/gaming-systems/switch-2/featured-games/mario-kart-world/)",
                  "score": 1,
                  "created_utc": 1744294797.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8fo4k",
              "author": "shgrizz2",
              "body": "Why tell the truth about select games being $80 when you can lie, say all games are $90 and get 10x the clicks.",
              "score": 4,
              "created_utc": 1744215378.0,
              "replies": []
            },
            {
              "id": "mm880te",
              "author": "FranksWateeBowl",
              "body": "Well, you definitely fell for their response that's for sure.",
              "score": 5,
              "created_utc": 1744213123.0,
              "replies": [
                {
                  "id": "mm8bj03",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1744214146.0,
                  "replies": [
                    {
                      "id": "mm8dtmu",
                      "author": "ShermanMcTank",
                      "body": "> I think saying they’re going to continue supporting the Switch 1 with new games is about the best you’re going to get.\n\nWhere does he say that exactly ? \n\nAll I can take from what he said is « the switch 1 will still be available ». Nothing about new games.",
                      "score": 4,
                      "created_utc": 1744214826.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm81tkk",
              "author": "bluesamcitizen2",
              "body": "Makes me wonder who’s benefiting from direct those rage to Nintendo rather than the tariff…",
              "score": 2,
              "created_utc": 1744211276.0,
              "replies": []
            },
            {
              "id": "mm7zu4a",
              "author": "wirelessfingers",
              "body": "Eh the title seems pretty accurate. He's just saying if you can't buy Switch 2, you can buy Switch 1. Not really a strong defense of their product.",
              "score": 3,
              "created_utc": 1744210684.0,
              "replies": []
            },
            {
              "id": "mm8gtk0",
              "author": "Pavillian",
              "body": "We also live in an era where we’re all fucked and the corporations have all the wealth.",
              "score": 1,
              "created_utc": 1744215720.0,
              "replies": []
            },
            {
              "id": "mm90e1t",
              "author": "nge001",
              "body": "Yup. Outrage is an easy emotion that gives a nice hit of dopamine and adrenaline, easy to trigger and exploit, hooray. There seems to be a growing awareness about it at least given posts like yours, so that at least gives me a little hope.",
              "score": 1,
              "created_utc": 1744221311.0,
              "replies": []
            },
            {
              "id": "mm9tig8",
              "author": "TheOvy",
              "body": "Yeah, and this is not exactly a radical notion. The PS2 is still the best selling console in history because it kept receiving support well into the PS3's life cycle. And suffice to say, a lot of us could not afford \"599 US dollars\" in 2006 for the upgrade.\n\nProduction of the PS2 did not end till 2013. That's not a typo: twenty-thirteen! I imagine Nintendo would be all too happy to keep producing the original Switch for as long, if people are willing to still buy it. And since the new game sharing feature on the Switch 2 works with the original Switch, they will have new value.\n\nThat all said, maybe Nintendo should introduce a price cut for the original switch. And a physical copy of Mario Kart World should not cost $90. That's a much bigger threat than Switch 2 launching at $450.",
              "score": 1,
              "created_utc": 1744229768.0,
              "replies": []
            },
            {
              "id": "mmb9g1m",
              "author": "ElPyroPariah",
              "body": "How is the headline rage bait? It’s saying the same thing after translating the PR speak…",
              "score": 1,
              "created_utc": 1744246963.0,
              "replies": [
                {
                  "id": "mmbchq4",
                  "author": "Tasik",
                  "body": "You know, after more consideration. I feel like perhaps I was the one that misinterpreted the quote. But I have too many upvotes to admit that now.",
                  "score": 1,
                  "created_utc": 1744248036.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmd0af5",
              "author": "iamamusing",
              "body": "This.",
              "score": 1,
              "created_utc": 1744277854.0,
              "replies": []
            },
            {
              "id": "mmdfq03",
              "author": "dudSpudson",
              "body": "Everyone just wants an opportunity to try and shit on Nintendo for this console launch. Even though the situation is actually pretty reasonable",
              "score": 1,
              "created_utc": 1744285827.0,
              "replies": []
            },
            {
              "id": "mmeo3dp",
              "author": "NothingLeft2PickFrom",
              "body": "As much as I have my own thoughts on it, Xbox has done the same with their Series and one consoles up until very recently.",
              "score": 1,
              "created_utc": 1744300523.0,
              "replies": []
            },
            {
              "id": "mmmmf5u",
              "author": "IRLCartoon",
              "body": "This assumes that new games made for Switch 2 are not artificially limited in some way on the older platforms, essentially forcing users to purchase new hardware for the actual *intended* experience of the game.",
              "score": 1,
              "created_utc": 1744404800.0,
              "replies": [
                {
                  "id": "mmmr1df",
                  "author": "Tasik",
                  "body": "I mean, you're right. I think that's a good point. But I don't even think it needs to be artificial. I think it's already challenging to optimize games for the Switch hardware, so developers may simply feel the Switch 2 better suites the experience they want for their game.",
                  "score": 1,
                  "created_utc": 1744406281.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8byqb",
              "author": "vingt-2",
              "body": "Nooooo !!! I deserve this quality product at a significant discount 😡 ",
              "score": 1,
              "created_utc": 1744214274.0,
              "replies": []
            },
            {
              "id": "mm8d28w",
              "author": "VagueSomething",
              "body": "They're offering a solution to their own problem. It isn't a totally tactless statement but it is still not a great look.",
              "score": -1,
              "created_utc": 1744214601.0,
              "replies": []
            },
            {
              "id": "mm8lm85",
              "author": "AstralProbing",
              "body": "Blessed that not only are other people doing stuff like this but that even more people brought it to the top so I could see it before commenting\n>This gives \"do you guys not have phones?\"",
              "score": -1,
              "created_utc": 1744217133.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm83k0h",
          "author": "Transposer",
          "body": "Haha wow that seems to be a more considerate response than the clickbait headline would have you believe.",
          "score": 41,
          "created_utc": 1744211793.0,
          "replies": []
        },
        {
          "id": "mm81y9e",
          "author": "nydjason",
          "body": "I remember going into toys r us one day and seeing older Nintendo consoles on display for sale. A game boy advance sp, Nintendo ds lite, the DSi and the DSi XL. All for sale at different price ranges. They always do this when the next gen comes out.",
          "score": 21,
          "created_utc": 1744211314.0,
          "replies": [
            {
              "id": "mmbbouo",
              "author": "broadwayzrose",
              "body": "My own silly “conspiracy theory” is that they’re trying to break the console record for the most units sold. Apparently they have to sell like 10 million units to beat the Nintendo DS and PlayStation 2 (currently the #2 and #1 “most popular” consoles, respectively) so by making the switch 2 really expensive and possibly lowering the price on the original switch maybe they’ll sell enough units to take the lead.",
              "score": 4,
              "created_utc": 1744247753.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm9ajgx",
          "author": "Lost_Minds_Think",
          "body": "When will news media be in a “PR minefield” for creating false narratives and hyping bullshit that never happens?",
          "score": 6,
          "created_utc": 1744224237.0,
          "replies": []
        },
        {
          "id": "mmaqhda",
          "author": "wubrgess",
          "body": "This is way more sensible than \"Don't you have phones?\"",
          "score": 5,
          "created_utc": 1744240279.0,
          "replies": []
        },
        {
          "id": "mm7s127",
          "author": "alucohunter",
          "body": "Imagine being such a treatler that this offends you",
          "score": 41,
          "created_utc": 1744208360.0,
          "replies": [
            {
              "id": "mm7y2z4",
              "author": "pm_social_cues",
              "body": "“let them eat cake”",
              "score": -15,
              "created_utc": 1744210175.0,
              "replies": [
                {
                  "id": "mm8wt3s",
                  "author": "alucohunter",
                  "body": "Americans when they can only afford 20 temu orders per month instead of 30",
                  "score": 6,
                  "created_utc": 1744220324.0,
                  "replies": [
                    {
                      "id": "mma19hx",
                      "author": "erichf3893",
                      "body": "Such a scam",
                      "score": 1,
                      "created_utc": 1744232021.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm84mc7",
          "author": "shalol",
          "body": "Old nintendo made a budget 3DS for kids who couldn’t afford the tilting one with a better screen.  \nThis is like saying to buy an 8 year old DS if you can’t afford the 3DS.",
          "score": 8,
          "created_utc": 1744212110.0,
          "replies": [
            {
              "id": "mmb0ehc",
              "author": "M-Noremac",
              "body": "Is comparing the DS to the 3DS really the same as comparing the Switch to the Switch 2? I feel like the 3DS was such a huge jump from the DS, and the Switch 2 is basically the same but with newer games and slightly improved specs...",
              "score": 2,
              "created_utc": 1744243735.0,
              "replies": [
                {
                  "id": "mmdlr1k",
                  "author": "Ghisteslohm",
                  "body": "op probably meant the 2DS which was a version of the 3DS that didnt have the 3D effect and was cheaper.\n\nwasnt avaible at release though and my guess was only made later down the line because the 3D effect was sadly not popular (I still think its cool)",
                  "score": 1,
                  "created_utc": 1744288277.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mma2j71",
              "author": "Glazu",
              "body": "3DS really struggled at launch though, they dropped the price a few months after launch. Likely played a factor in designing the 2DS.\n\nBut there was also the Switch Lite, I can definitely see a Switch Lite 2 on the horizon.",
              "score": 1,
              "created_utc": 1744232392.0,
              "replies": [
                {
                  "id": "mmseyyz",
                  "author": "RawSteelUT",
                  "body": "At this point, I'd be more interested in a home-only Switch 2.  The Pokemon machines hold little appeal as I don't do a lot of on-the-go gaming.",
                  "score": 2,
                  "created_utc": 1744489338.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm8wnd7",
          "author": "TingleyStorm",
          "body": "This is far from the “if you don’t like it, then buy a 360!” reaction Microsoft execs had when they initially announced the Xbox One. This is a very reasonable response.",
          "score": 5,
          "created_utc": 1744220281.0,
          "replies": []
        },
        {
          "id": "mm7rwbb",
          "author": "Cactuszach",
          "body": "People really want to be mad and are actively looking for reasons to be.",
          "score": 14,
          "created_utc": 1744208320.0,
          "replies": [
            {
              "id": "mm9z5s8",
              "author": "OcculusSniffed",
              "body": "To be fair, there are lots of reasons to be mad about the switch 2 right now, especially in the US.  But they aren't really Nintendo's fault.",
              "score": 0,
              "created_utc": 1744231414.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8eqw6",
          "author": "wheresmylife",
          "body": "This seems…reasonable?",
          "score": 4,
          "created_utc": 1744215102.0,
          "replies": []
        },
        {
          "id": "mm913dp",
          "author": "RustySheriffsBadge1",
          "body": "This is a really measured and good response. He acknowledged the pain point and explained the alternatives so people can still participate.",
          "score": 2,
          "created_utc": 1744221505.0,
          "replies": []
        },
        {
          "id": "mmabf20",
          "author": "Gravelayer",
          "body": "Don't be poor it sounds like",
          "score": 1,
          "created_utc": 1744235174.0,
          "replies": []
        },
        {
          "id": "mmar2q6",
          "author": "crawlspace_taste",
          "body": "They were probably also hinting at a dockless “lite” version in the future",
          "score": 1,
          "created_utc": 1744240485.0,
          "replies": []
        },
        {
          "id": "mmbf7fw",
          "author": "typo9292",
          "body": "I like the other one",
          "score": 1,
          "created_utc": 1744248992.0,
          "replies": []
        },
        {
          "id": "mmg734w",
          "author": "supremegamer76",
          "body": "unless the drop the price of the OLED, The lowest i can see them decrease the price is $400 usd. \n\non the topic, i wonder if the OLED model was financially successful, or in the very least broke even",
          "score": 1,
          "created_utc": 1744316591.0,
          "replies": []
        },
        {
          "id": "mmjckom",
          "author": "DreamrSSB",
          "body": "I dont know how but my mind kept on putting \"please understand\" in this paragraph lol",
          "score": 1,
          "created_utc": 1744365298.0,
          "replies": []
        },
        {
          "id": "mm85lfm",
          "author": "Kanstrup-",
          "body": "Nintendo gonna do what Nintendo gonna do.",
          "score": 0,
          "created_utc": 1744212401.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7imv7",
      "author": "fragydig529",
      "body": "Wouldn’t most of the people that are interested in the Switch 2 already have the original switch?",
      "score": 247,
      "created_utc": 1744205377.0,
      "replies": [
        {
          "id": "mm7qnx1",
          "author": "Frequent_Gap_3366",
          "body": "I don’t have a Switch and I’ve been thinking about getting one for a while, but was holding off for the 2.",
          "score": 103,
          "created_utc": 1744207942.0,
          "replies": [
            {
              "id": "mm9jygj",
              "author": "Pudding_Hero",
              "body": "Edging for Mario",
              "score": 52,
              "created_utc": 1744227010.0,
              "replies": [
                {
                  "id": "mm9kjxc",
                  "author": "Frequent_Gap_3366",
                  "body": "Edging for Starfox GameCube ports",
                  "score": 13,
                  "created_utc": 1744227185.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7zc3e",
              "author": "dramafan1",
              "body": "Same here, not everyone gets every console generation. And there’s no urgency because I see gaming as another form of entertainment and it’s not necessarily a “need”.",
              "score": 16,
              "created_utc": 1744210538.0,
              "replies": [
                {
                  "id": "mmar2o8",
                  "author": "epitoma",
                  "body": "I went from original Xbox, to Wii, to Switch OLED.",
                  "score": 2,
                  "created_utc": 1744240484.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm7kjn6",
          "author": "EtalusEnthusiast420",
          "body": "Yes. According to a reddit survey on the switch subreddit, almost 95% of switch buyers had bought a previous Nintendo console.",
          "score": 2,
          "created_utc": 1744206017.0,
          "replies": [
            {
              "id": "mm7o8s7",
              "author": "silentcrs",
              "body": "Was that a joke? A subreddit is a very statistically biased sample.",
              "score": 81,
              "created_utc": 1744207190.0,
              "replies": [
                {
                  "id": "mmbbpkh",
                  "author": "FoilCladShadows",
                  "body": "Lmao right. Crazy I put a poll on steam deck subreddit if they have a steam deck. Wild that 80% of people on reddit have one",
                  "score": 11,
                  "created_utc": 1744247760.0,
                  "replies": []
                },
                {
                  "id": "mm7pj3h",
                  "author": "EtalusEnthusiast420",
                  "body": "That’s just what I found when I looked into it, but maybe you could find and share a better survey for us.",
                  "score": -17,
                  "created_utc": 1744207590.0,
                  "replies": [
                    {
                      "id": "mm7q9c5",
                      "author": "AdMikey",
                      "body": "Even if there’s no better surveys out there, it doesn’t make the one you found a good example. Obviously people watching switch news owns a switch, why would they be watching switch news otherwise?",
                      "score": 31,
                      "created_utc": 1744207817.0,
                      "replies": [
                        {
                          "id": "mm7ytse",
                          "author": "LEJust_Twist_4955",
                          "body": "Definitely a biased survey but also many sub reddits are full of fans/interested buyers of things. Heck I’m in so many car subs for vehicles I have no interest in purchasing anytime soon.",
                          "score": 0,
                          "created_utc": 1744210391.0,
                          "replies": []
                        },
                        {
                          "id": "mm80kae",
                          "author": "Rixien",
                          "body": "He said the survey was whether people who owned a Switch also owned a Nintendo system in the past, not if they owned a Switch now.\n\nIt’s not a great sample to take from, but the survey isn’t quite as stupid as you make it out to be.",
                          "score": -3,
                          "created_utc": 1744210899.0,
                          "replies": []
                        },
                        {
                          "id": "mm82j3j",
                          "author": "EtalusEnthusiast420",
                          "body": "That’s not what I said lol",
                          "score": -1,
                          "created_utc": 1744211487.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mm81pa6",
                      "author": "Scratigan1",
                      "body": "I laughed at the original comment because it was so sarcastic it was hilarious...until this comment made me realise you were dead serious.\n\n\nPeople who actively participate in a SWITCH forum are absolutely going to buy another switch and will participate in a poll about the switch. \n\nLocal restaurant tells us that 95% of customers order it's food, more news at 7.",
                      "score": 5,
                      "created_utc": 1744211240.0,
                      "replies": [
                        {
                          "id": "mmdos92",
                          "author": "EtalusEnthusiast420",
                          "body": "Idk why you’re being a dick about this. I was transparent about where I found the survey and it definitely provides insight into that part of the market.\n\nIt also sounds like you misunderstood the survey. It was from 7 years ago and has nothing to do with the Switch 2 specifically.",
                          "score": 0,
                          "created_utc": 1744289419.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mm7ragl",
                  "author": "None",
                  "body": "Yeah, well, so is the gaming community as a whole lol it’s still probably a reasonable enough indication of the broader population, despite being a Nintendo-specific sub. Most console buyers are upgrading from a previous generation, regardless of company. Most people who bought a PS5 have had a PlayStation before. Most people who bought an Xbox X owned an Xbox before. It stands to acceptable reason that most Switch owners have owned another Nintendo before, and therefore a fair enough assumption that people who are interested in a Switch 2 likely currently own a Switch.\n\nEven if it’s a biased sample, in this scenario, it’s still probably accurate *enough*. I don’t think any recent-gen console out there has been wildly successful enough to capture a majority market of first-time users.",
                  "score": -6,
                  "created_utc": 1744208134.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7o5im",
              "author": "Gomerack",
              "body": "that sounds like a bit of a biased survey...",
              "score": 67,
              "created_utc": 1744207161.0,
              "replies": []
            },
            {
              "id": "mm9u2xu",
              "author": "bakedbread54",
              "body": "I think you need to take a statistics class",
              "score": 3,
              "created_utc": 1744229934.0,
              "replies": []
            },
            {
              "id": "mm7s2fp",
              "author": "Cactuszach",
              "body": "So they can continue to play the system they invested in. Why is this bad?",
              "score": 1,
              "created_utc": 1744208371.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmfft2l",
          "author": "fleemfleemfleemfleem",
          "body": "I haven't had a console since the SNES, but I was thinking about getting the 2, since a friend of mine is big into Switch and multiplayer would be a good way to stay in touch.",
          "score": 2,
          "created_utc": 1744308588.0,
          "replies": []
        },
        {
          "id": "mmc6vne",
          "author": "Dk1724",
          "body": "Most, yes. I was finally going to buy a switch this year, when they announced switch 2 and now I'm waiting for it.",
          "score": 1,
          "created_utc": 1744260122.0,
          "replies": []
        },
        {
          "id": "mm8i60f",
          "author": "Triassic_Bark",
          "body": "Then they can save for a couple of months and still buy the 2. This is a non issue. It’s what happens when there is something expensive you want to buy. You have to save to buy it, or buy a cheaper version.",
          "score": -1,
          "created_utc": 1744216118.0,
          "replies": []
        },
        {
          "id": "mm9fo1c",
          "author": "ASpiralKnight",
          "body": "I'll decide when switch 3 specs come out.",
          "score": -1,
          "created_utc": 1744225742.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7vxoh",
      "author": "Lead_weight",
      "body": "Why not sell a cheaper version with no screen?",
      "score": 183,
      "created_utc": 1744209542.0,
      "replies": [
        {
          "id": "mm84lq7",
          "author": "AQUEMlNI",
          "body": "There we go, good idea. You can even make it less compact, and therefore cheaper",
          "score": 93,
          "created_utc": 1744212105.0,
          "replies": [
            {
              "id": "mm86y7r",
              "author": "Lead_weight",
              "body": "Yeah, I don’t need a portable system, just give me the Apple TV sized Nintendo with an HDMI port. Sell it for $200",
              "score": 105,
              "created_utc": 1744212805.0,
              "replies": [
                {
                  "id": "mma48o9",
                  "author": "bigmac22077",
                  "body": "And make it a streaming device. I’ll buy it day one for my tv that’s so old apps no longer work on it.",
                  "score": 17,
                  "created_utc": 1744232913.0,
                  "replies": [
                    {
                      "id": "mmbvf4f",
                      "author": "giant2179",
                      "body": "Direct competition for the Nvidia shield, which is way overdue for an update.",
                      "score": 2,
                      "created_utc": 1744254933.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmae1lt",
                  "author": "inked_saiyan",
                  "body": "Honestly I'd be totally onboard with this.  That said, wishful thinking 🥲",
                  "score": 1,
                  "created_utc": 1744236029.0,
                  "replies": []
                },
                {
                  "id": "mmc66lv",
                  "author": "gingermeist",
                  "body": "I didnt know i wanted this until now..",
                  "score": 1,
                  "created_utc": 1744259786.0,
                  "replies": []
                },
                {
                  "id": "mmersa1",
                  "author": "BackupTrailer",
                  "body": "This makes sense. They’ll never do it.",
                  "score": 0,
                  "created_utc": 1744301617.0,
                  "replies": []
                },
                {
                  "id": "mmicttf",
                  "author": "latunza",
                  "body": "I've undocked my Wii U tablet only when I needed it for some gimmicky game and my Switch like 1 time. I'm a middle-aged man who lives in rural America. My commute is 10 minutes from home. I don't pick up and game anywhere in my house because shit isn't that serious. Why on earth do I need it to be a tablet? \n\nRelease the \\***Nintendo Switch 2: NuN (No Undock Needed)** Edition\\*  - NOW!!!",
                  "score": 0,
                  "created_utc": 1744344372.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm8dqid",
          "author": "CrahEgg",
          "body": "This is exactly what I wish they'd do. \n\nEven though a portable 1080p screen at 120 Hz sounds amazing... I'm not interested in paying $450 dollars for it if I mostly play on my own TV/monitor.",
          "score": 48,
          "created_utc": 1744214801.0,
          "replies": [
            {
              "id": "mm8h67u",
              "author": "NecroCannon",
              "body": "I only play in handheld, I would’ve just released a Lite 2 at least alongside it, that takes care of kids and broke adults like myself",
              "score": 12,
              "created_utc": 1744215824.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8m99j",
          "author": "kytheon",
          "body": "Like a Mac Mini?",
          "score": 6,
          "created_utc": 1744217321.0,
          "replies": [
            {
              "id": "mmbqj9g",
              "author": "Dashzz",
              "body": "Apple mini + apple tv + Nintendo games.",
              "score": 1,
              "created_utc": 1744252958.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmdr4fo",
          "author": "Nice_Promise9854",
          "body": "Yes please. Our switch doesn’t leave the deck. It’s a family gaming system that stays hooked up to the tv at all times. I’m sure we are one of many, many households with young kids that love the Nintendo games but do not need or want the handheld aspects of the console. The steam deck also rarely gets actually picked up and handled. We play couch co-op games on them. If the kid wants to drag an expensive computer around in his sticky little hands, he can ask to bring his 6 year old iPad in it’s industrial puffer jacket protector case that’s still trucking along.",
          "score": 3,
          "created_utc": 1744290267.0,
          "replies": []
        },
        {
          "id": "mm9gpc3",
          "author": "ASpiralKnight",
          "body": "Eventually this mindset (validly) leads to \"why cant they just release their games on PC?\"\n\nOtherwise it's \"please buy this poorly spec'd hardware so you can play a game on your monitor with your USB controller\"",
          "score": 7,
          "created_utc": 1744226051.0,
          "replies": []
        },
        {
          "id": "mmc1pwx",
          "author": "darkmacgf",
          "body": "Why not buy it and then sell the joycons for $90 if you're not gonna use it portable?",
          "score": 2,
          "created_utc": 1744257674.0,
          "replies": []
        },
        {
          "id": "mm8yt7s",
          "author": "bonesnaps",
          "body": "Bluetooth streams to your smartphone.\n\n\"Don't you guys have phones?\"\n\nAlso, voicechat will still cost extra $$$.",
          "score": 1,
          "created_utc": 1744220879.0,
          "replies": []
        },
        {
          "id": "mmdb8so",
          "author": "danxmanly",
          "body": "Or only if there would be some kind of emulator.",
          "score": 1,
          "created_utc": 1744283821.0,
          "replies": []
        },
        {
          "id": "mm93wfc",
          "author": "WhatThePann",
          "body": "Sony did this in 2014 and it sold like ass.",
          "score": -1,
          "created_utc": 1744222311.0,
          "replies": []
        },
        {
          "id": "mm9ry6m",
          "author": "uwrwilke",
          "body": "kids are mostly playing these, more so than adults. they tend to use portable more often.",
          "score": -4,
          "created_utc": 1744229318.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7zf60",
      "author": "wirelessfingers",
      "body": "\"We have a product for people who don't want to buy an Xbox One. It's called the Xbox 360.\"\n\nFamously a very good, successful strategy.",
      "score": 170,
      "created_utc": 1744210564.0,
      "replies": [
        {
          "id": "mm8huco",
          "author": "rymden_viking",
          "body": "The 360 was such a high for Microsoft/Xbox/Halo. It's been all downhill from that Xbox One reveal.",
          "score": 49,
          "created_utc": 1744216023.0,
          "replies": [
            {
              "id": "mmc5c8l",
              "author": "Jace265",
              "body": "Halo hasn't been the same since Reach",
              "score": 4,
              "created_utc": 1744259390.0,
              "replies": []
            },
            {
              "id": "mmas7vo",
              "author": "_RADIANTSUN_",
              "body": "Everyone remembers Don Mattrick being an asshole but nobody remembers the Adam Orth guy who got fired from Microsoft lol.",
              "score": 2,
              "created_utc": 1744240879.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8mh67",
          "author": "kytheon",
          "body": "Try explaining to my mom the difference between one, 360, series X and series S.\n\nMeanwhile PlayStation 1-5. iPhone 1-16 etc.",
          "score": 10,
          "created_utc": 1744217385.0,
          "replies": [
            {
              "id": "mn00a0r",
              "author": "Independent_Sea_6317",
              "body": "These are all Nintendos, what do you mean?",
              "score": 1,
              "created_utc": 1744598072.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8i6xy",
          "author": "NecroCannon",
          "body": "That’s the first thing I thought about when I saw this\n\nYou don’t want to pull a Microsoft, I was a fan boy as a kid but even that got me wanting a PS4 instead.\n\nYou got a lead on a currently rapidly evolving handheld market Nintendo… don’t pull a Microsoft. Or maybe do so I win more with cheaper handhelds, porting windows games over is starting to be possible on Android ones.",
          "score": 6,
          "created_utc": 1744216126.0,
          "replies": [
            {
              "id": "mmcgs3q",
              "author": "AJDx14",
              "body": "This isn’t “pulling a Microsoft” you’re all just incredibly spoiled. “If you can’t afford the expensive thing buy the cheaper thing, or save up for the more expensive thing” is basic finance.",
              "score": -1,
              "created_utc": 1744265449.0,
              "replies": [
                {
                  "id": "mme78v6",
                  "author": "NecroCannon",
                  "body": "During the Great Depression surprisingly enough movies were popular to attend as entertainment helped deal with the current economic and political stresses. Entertainment has always been a way to “escape” even during times of crisis, just that the entertainment we have today has become pretty damn expensive.\n\nSo in my opinion, it’s being an asshole to get mad at people complaining. You’re not the boss of anyone’s lives but your own, if that makes *you* feel spoiled, then that’s because of the life and environment you were in, everyone else isn’t like you.",
                  "score": 0,
                  "created_utc": 1744295525.0,
                  "replies": [
                    {
                      "id": "mmf5dss",
                      "author": "AJDx14",
                      "body": "I didn’t “get mad” it’s just true that you’re all spoiled. The entertainment options we have today are not the same as the ones available during the Great Depression, there isn’t any reason at all to think they’d have comparable costs. Despite that, even $80 for a game is pretty cheap when you look at what they used to cost and inflation. If a game is going to have 20 hours of playtime and it costs $80 then you’re just paying $4 per hour of playtime. For longer games the deal is even better. And the cost of entertainment being low during the Great Depression was partly a consequence of the depression, there was less consumer spending so theaters, for example, had to charge less to continue to operate at all. \n\nAnd entertainment isn’t expensive, just the entertainment that you personally want is. There are inexpensive entertainment options, they’re just less entertaining because they aren’t luxury goods. \n\nYou are all spoiled to think that video games are the only product that needs to forever cost the exact same nominal amount regardless of how the economy shifts or how the product changes.",
                      "score": 0,
                      "created_utc": 1744305601.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm82p4n",
          "author": "AQUEMlNI",
          "body": "Everyone go tweet this at Nintendo lol",
          "score": 5,
          "created_utc": 1744211536.0,
          "replies": []
        },
        {
          "id": "mm925xy",
          "author": "None",
          "body": "[deleted]",
          "score": -7,
          "created_utc": 1744221809.0,
          "replies": [
            {
              "id": "mm93179",
              "author": "wirelessfingers",
              "body": "\"As we look at Nintendo Switch 2 and you think about the feature sets that I talked about ... we believe that the pricing is appropriate for the value of the machine and the gameplay experience overall. We recognize there are some people that may not be able to afford the Nintendo Switch 2 price point. That's why we wanted to make the other Switch platforms available, so people still have an opportunity to come into our gaming universe, be a part of these characters in these worlds, and see value, if you will, in whatever rung of the platform they come in.\"\n\nThat is the quote. Tell me how it meaningfully differs from the Xbox presentation?",
              "score": 4,
              "created_utc": 1744222060.0,
              "replies": [
                {
                  "id": "mm9482l",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -6,
                  "created_utc": 1744222404.0,
                  "replies": [
                    {
                      "id": "mm99nhv",
                      "author": "wirelessfingers",
                      "body": "Sorry bro just not seeing it. They quite literally said if you can't afford the Switch 2 then you can buy the Switch 1. \n\nIf anything, the context just adds to it. They announced most Switch 2 games will be downloaded even if it's a physical card. They said that Joy Cons will still not use superior sensors and instead went for a 'redesign'. No OLED screen on launch. $80 games for no reason (even in other countries that do not have tarriffs).\n\nIn a lot of ways, it's the same thing. Nintendo thought they could get away with raising prices and continuing their bad business practices, and now they're getting flamed for it. We can only hope this forces Nintendo to change in some way.",
                      "score": 0,
                      "created_utc": 1744223981.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm82k4h",
      "author": "SheepWolves",
      "body": "\"If you think Mario Kart World is over priced, you can always pay full price for 8 year old titles on the first switch.\"",
      "score": 106,
      "created_utc": 1744211495.0,
      "replies": [
        {
          "id": "mmav9yh",
          "author": "greganada",
          "body": ">“If you think Mario Kart World is over priced, you can always pay full price for remasters of Wii games on the first switch.”",
          "score": 7,
          "created_utc": 1744241933.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm927j8",
      "author": "NastyAlabastey",
      "body": "This is great news for me as someone not planning on buying a Switch 2",
      "score": 10,
      "created_utc": 1744221822.0,
      "replies": []
    },
    {
      "id": "mm7hvjp",
      "author": "KalisQinsSais",
      "body": "Watch them price increase the Switch 1 titles in accordance with the planned Switch 2 hikes",
      "score": 103,
      "created_utc": 1744205121.0,
      "replies": [
        {
          "id": "mm7ifft",
          "author": "img_tiff",
          "body": "Stop giving them ideas lmao",
          "score": 54,
          "created_utc": 1744205307.0,
          "replies": [
            {
              "id": "mm7mgvb",
              "author": "faultydesign",
              "body": "Don’t worry the tariffs already gave them ideas.",
              "score": 16,
              "created_utc": 1744206635.0,
              "replies": [
                {
                  "id": "mmsfo4e",
                  "author": "RawSteelUT",
                  "body": "You mean the tariffs that are probably going to be negotiated further as Vietnam opens its markets and stops letting China use them to circumvent?\n\nThe price is what it is not because of \"orange man bad,\" but because Nintendo knows they can get away with it.",
                  "score": 1,
                  "created_utc": 1744489568.0,
                  "replies": [
                    {
                      "id": "mmsjcpo",
                      "author": "faultydesign",
                      "body": "Of course it’s not only because of that, but it contributes.",
                      "score": 1,
                      "created_utc": 1744490793.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm7k7pa",
          "author": "EtalusEnthusiast420",
          "body": "I imagine they will do that anyway because of the tariffs",
          "score": 20,
          "created_utc": 1744205909.0,
          "replies": [
            {
              "id": "mm8b38e",
              "author": "Roboculon",
              "body": "Seriously, how could they not? If current tariffs are any guide, the switch 1 could easily end up costing well more than the switch 2 was intended for.",
              "score": 4,
              "created_utc": 1744214018.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm7o3zr",
          "author": "ioncloud9",
          "body": "“We are just raising prices to match market rates”",
          "score": 1,
          "created_utc": 1744207149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7pjtq",
      "author": "dork3390",
      "body": "In context his quote is totally fine. Super cringe click bait due to everyone crying that a next gen console is more expensive than previous gen.",
      "score": 88,
      "created_utc": 1744207597.0,
      "replies": [
        {
          "id": "mm81r1e",
          "author": "ShaquilleMobile",
          "body": "Even out of context, I'm fine with it... What do we expect them to say if we can't afford a Switch 2? \"Sorry, send us financial statements and we'll offer preferred pricing\"? \n\nPeople are acting like it's a human right to own a brand new Nintendo console. \n\nIf you can't afford it, yeah, there are other options, including the original Switch, or a ball on a string tied to a cup. You will live without a Switch 2.\n\n\"Nintendo is alienating the people who can't buy their products! WOW, PR NIGHTMARE!\"\n\nLol obviously they're going to be fine if people who can't afford it are offended... They already weren't going to buy it.",
          "score": 32,
          "created_utc": 1744211254.0,
          "replies": [
            {
              "id": "mm8k49e",
              "author": "NecroCannon",
              "body": "Gotta love console releases nowadays, you got the people upset that they can’t afford it, they don’t matter. You got the people that are like “you’re broke, lol”. And you got most people that are just casually into gaming and are justifiably upset about some things, like 70-80 dollar games or paying for upgrades or some shit.\n\nIt’s like a brilliant symphony of both haters and elitists and the dominant casual crowd is just tugged along on either side. Only one group understands that this is a hobby and just upset about some things, while others use it as an opportunity to shit on anyone they can. Even broke people, they don’t deserve anything, they need to get a job, oh.",
              "score": -14,
              "created_utc": 1744216700.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmfq3m0",
          "author": "Vesuvias",
          "body": "It’s getting exhausting with all the clickbait drama over this quote.",
          "score": 1,
          "created_utc": 1744311607.0,
          "replies": []
        },
        {
          "id": "mmhs9hp",
          "author": "zap_p25",
          "body": "I think it’s also partially many westerners, having never worked for a Japanese company, don’t have a grasp of the cultural differences between Japanese work culture and western work culture. It’s completely different…and with that context you will see it’s a highly appropriate quote from\nA Japanese exec as not only are the understanding the cost is detrimental for some but are also stating that they will continue to release titles for the first generation Switch that simply won’t take advantage of some of the gameplay features on the Switch 2. No biggie.",
          "score": 1,
          "created_utc": 1744335963.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmeofmm",
      "author": "livevicarious",
      "body": "Gaming is a luxury, it’s entertainment. We are more upset about gaming being expensive than groceries, and that’s bad.",
      "score": 5,
      "created_utc": 1744300623.0,
      "replies": []
    },
    {
      "id": "mm8q2p0",
      "author": "D-inventa",
      "body": "better yet, you can buy neither. People need to stop spending money they don't have.",
      "score": 14,
      "created_utc": 1744218426.0,
      "replies": []
    },
    {
      "id": "mm7hbla",
      "author": "wid890979",
      "body": "Yeah this feels reminiscent of the Xbox one launch debacle. Yikes. ",
      "score": 99,
      "created_utc": 1744204931.0,
      "replies": [
        {
          "id": "mm7pmbi",
          "author": "SpaceFire1",
          "body": "Read the article. It’s clickbait",
          "score": 42,
          "created_utc": 1744207619.0,
          "replies": [
            {
              "id": "mm7q8xv",
              "author": "InternationalBuy8845",
              "body": "It’s not",
              "score": -35,
              "created_utc": 1744207814.0,
              "replies": [
                {
                  "id": "mm7rvwp",
                  "author": "Static-Stair-58",
                  "body": "It’s a mistake when Xbox does it, it’s clickbait when Nintendo does it. Will never understand people who deep throat corpos.",
                  "score": -22,
                  "created_utc": 1744208316.0,
                  "replies": [
                    {
                      "id": "mm7vjfl",
                      "author": "SpaceFire1",
                      "body": "Dude just says that “We believe our console is worth the price and the Switch is still a great console for people who want to join the nintendo ecosystem.” And this statement is true: they will likely be supporting the switch for the next few years at least as we saw at the recent direct.",
                      "score": 14,
                      "created_utc": 1744209423.0,
                      "replies": [
                        {
                          "id": "mm7wu13",
                          "author": "Static-Stair-58",
                          "body": "You’re missing my point. I have no issue with what they said, my point is about how this kind of statement can hurt one company but not another. That’s just bias, doesn’t make any sense. Which I don’t get why you would show bias for a corporation, that’s weird. That’s all I was tryna say friend.",
                          "score": -17,
                          "created_utc": 1744209809.0,
                          "replies": [
                            {
                              "id": "mm8inyo",
                              "author": "MMS-",
                              "body": "Your idiocy comes from thinking Reddit is one person. Of course you’re going to see different takes with hundreds of upvotes/downvotes on either side. Thats how this all works dude.",
                              "score": 8,
                              "created_utc": 1744216265.0,
                              "replies": [
                                {
                                  "id": "mm8m1y2",
                                  "author": "Static-Stair-58",
                                  "body": "Well my gosh golly bad for thinking “bias” means looking at two corpos who made the same dumb statement, sticking with the old console, but defending one as different. Would hypocrisy have been a better word choice?",
                                  "score": -5,
                                  "created_utc": 1744217262.0,
                                  "replies": [
                                    {
                                      "id": "mmayi8z",
                                      "author": "MMS-",
                                      "body": "It’s not hypocrisy because Reddit is not one person. Learn to read.",
                                      "score": 2,
                                      "created_utc": 1744243054.0,
                                      "replies": [
                                        {
                                          "id": "mmazhuq",
                                          "author": "Static-Stair-58",
                                          "body": "I just learned to read and I found this word, but I don’t know what it means. “Generalize”?!?? I’m stumped. Dog, thank you for teaching me to read. You can take statements and ideas and make broad inferences about them or people, and they can like apply to them. So like Reddit isn’t one person, but you can generalize about what people say based on things you’ve read and heard before and you’d be talking about those people and not reddit as a whole? Mind…blown.",
                                          "score": 0,
                                          "created_utc": 1744243406.0,
                                          "replies": [
                                            {
                                              "id": "mmb6rya",
                                              "author": "MMS-",
                                              "body": "You’re defending using inaccurate generalizations to make a point?",
                                              "score": 1,
                                              "created_utc": 1744246015.0,
                                              "replies": [
                                                {
                                                  "id": "mmbeyp9",
                                                  "author": "Static-Stair-58",
                                                  "body": "What do you think I didn’t accurately generalize? Saying Xbox screwed up by telling people to stick with their old console, but Nintendo didn’t by saying the same thing, is a pretty fair generalization of console wars fanatics showing bias. Which goes back into what I said about defending corporations like they’re your best friend. It’s weird. And I’m not saying don’t have products or companies to like, it’s just weird to full throat defend them like you’re being personally offended.",
                                                  "score": 1,
                                                  "created_utc": 1744248909.0,
                                                  "replies": [
                                                    {
                                                      "id": "mmcagpb",
                                                      "author": "MMS-",
                                                      "body": "The lack of accuracy makes it inaccurate. You would be just as accurate saying “people in this world said xbox good and nintendo bad which is hypocrisy”, generalizing humankind. It’s such a dumbass broad statement that speaking it out loud shows you just have no idea what is going on in life and things tend to whizz past your head only for you to react 15 minutes later",
                                                      "score": 2,
                                                      "created_utc": 1744261943.0,
                                                      "replies": [
                                                        {
                                                          "id": "mmccvse",
                                                          "author": "Static-Stair-58",
                                                          "body": "Yikes. Generalizing human kind? I’m talking about nerds and console war fanatics. People that get defensive over faceless corporations. Those people 100% exist. I’ve seen them, and talked to them, and read their opinions. And they show bias, like in my example before about how Nintendo made a statement about customers sticking with the old console if they don’t or can’t get the new one. When Xbox said that, it was a mistake and people pointed to it as a reason the console didn’t sell. Nintendo making a similar statement could also cost them in the same way. To think that it won’t or can’t shows denial/bias toward one company. Which is fine like I said earlier, it’s the white knighting and getting defensive over it that’s the weird part. I hope the Switch 2 sells like hotcakes, it’s still dumb to make a statement that justifies *staying put* with your old one. And then weird to keep defending their moves like its nbd, because there is evidence from previous companies where talking like that hurt their bottom line. That pretty much the whole enchilada of what I was trying to say. I’m not sure there’s much more I can do to explain it any better. I appreciate the conversation. Have a nice year. Stay safe.",
                                                          "score": 2,
                                                          "created_utc": 1744263246.0,
                                                          "replies": [
                                                            {
                                                              "id": "mmcjz9v",
                                                              "author": "MMS-",
                                                              "body": "You have to be AI holy shit",
                                                              "score": 1,
                                                              "created_utc": 1744267346.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mm92ynt",
                              "author": "None",
                              "body": "Do you not understand how context works? When Microsoft said it, they did it as a jab at people that didn’t like the price. When Doug said it, he said he they plan on supporting the original Switch, which considering we’re in economic turmoil at the moment, is a completely valid answer as they don’t plan on abandoning those that can’t afford to get a new console right now. This is 100% people just trying to attack Nintendo because they’re Nintendo.",
                              "score": 6,
                              "created_utc": 1744222040.0,
                              "replies": []
                            },
                            {
                              "id": "mm81u8q",
                              "author": "SpaceFire1",
                              "body": "Because xboxs statement was about always online, not price. A feature so bad they ended up rolling it back before release. Xbox’s was never about price",
                              "score": 3,
                              "created_utc": 1744211281.0,
                              "replies": [
                                {
                                  "id": "mm858z1",
                                  "author": "Zetra3",
                                  "body": "Hi yes, person who was alive and saw the interview. No it was about price.",
                                  "score": 10,
                                  "created_utc": 1744212298.0,
                                  "replies": []
                                },
                                {
                                  "id": "mm822le",
                                  "author": "Static-Stair-58",
                                  "body": "Ah so every person ever who said it was about Xbox saying keep your 360 if you don’t want to get the next console, they’re just being gaslit?",
                                  "score": 6,
                                  "created_utc": 1744211350.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm7vxf8",
          "author": "EViLTeW",
          "body": "Seems reminiscent of every single console launch in the last... 25 years?  \n\nCan't afford a PS3? PS2 is still being sold. Can't afford a PS4? PS3 is still being sold. Can't afford a PS5? The PS5 digital edition and PS4 are still being sold.  \n\nCan't afford an Xbox 360? The Xbox is still being sold. Can't Afford an Xbox One? The Xbox 360 is still being sold. Can't afford an Xbox Series X? The Xbox One and Xbox Series S are still being sold.",
          "score": 18,
          "created_utc": 1744209540.0,
          "replies": [
            {
              "id": "mm7wej4",
              "author": "wid890979",
              "body": "The only time they came out and said it was the Xbox one. PS3 was get two jobs to buy it. ",
              "score": 9,
              "created_utc": 1744209681.0,
              "replies": []
            },
            {
              "id": "mm8kue5",
              "author": "Kiwithegaylord",
              "body": "The biggest difference is that since the switch 2 is backward compatible, if a game doesn’t need the power of the switch 2 it makes more sense to release it on the switch",
              "score": 2,
              "created_utc": 1744216911.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm7ryxx",
          "author": "Cactuszach",
          "body": "Does it?",
          "score": 6,
          "created_utc": 1744208342.0,
          "replies": [
            {
              "id": "mm7wxry",
              "author": "wid890979",
              "body": "Yes, the headline does",
              "score": 0,
              "created_utc": 1744209839.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm7kih5",
          "author": "grannyklump",
          "body": "Came here to say the same thing.",
          "score": 5,
          "created_utc": 1744206007.0,
          "replies": []
        },
        {
          "id": "mmfq9b3",
          "author": "Vesuvias",
          "body": "It’s not even close, like AT ALL. Read the quote and take it in. Drama-tubers are skewing the entire thing.",
          "score": 1,
          "created_utc": 1744311655.0,
          "replies": [
            {
              "id": "mmg4zar",
              "author": "wid890979",
              "body": "It’s pretty similar, the headline that is. I didn’t read the article and probably won’t. This doesn’t really fall in any category for things I care about. 🤷",
              "score": 0,
              "created_utc": 1744315982.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm7pl59",
          "author": "TrapperJean",
          "body": "Literally all they had to do was blame the tarrifs and most people wouldn't be angry at them specifically",
          "score": -9,
          "created_utc": 1744207610.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mma4k93",
      "author": "MarvinParanoAndroid",
      "body": "![gif](giphy|ar9f7kG6erzQk)",
      "score": 5,
      "created_utc": 1744233011.0,
      "replies": []
    },
    {
      "id": "mmd5u7v",
      "author": "Pll_dangerzone",
      "body": "I had been looking forward to picking up the Switch 1 when the Switch 2 released because I assumed there would be a steep discount on the old console. This makes me feel like there will not be any discount. Which to me sounds like greed.",
      "score": 5,
      "created_utc": 1744281112.0,
      "replies": []
    },
    {
      "id": "mmdaiy4",
      "author": "ScurryScout",
      "body": "Do you guys not have phones?",
      "score": 4,
      "created_utc": 1744283485.0,
      "replies": []
    },
    {
      "id": "mmepojy",
      "author": "TheRedOwl17",
      "body": "The problem isn't that I can't afford it, its that I don't think it's worth that price. I've already got a switch and a steam deck. I'd be completely willing to spend 450 on a switch 2 but not 600+",
      "score": 5,
      "created_utc": 1744300988.0,
      "replies": []
    },
    {
      "id": "mm7uyjk",
      "author": "MattofCatbell",
      "body": "Company announces that they will continue support their current system for people who cant afford the new system, people online are outraged",
      "score": 21,
      "created_utc": 1744209248.0,
      "replies": [
        {
          "id": "mm7vfgx",
          "author": "Muted_Yoghurt6071",
          "body": "People who say they cannot afford luxury item furious that the company didn't just give it to them for free.",
          "score": 16,
          "created_utc": 1744209389.0,
          "replies": [
            {
              "id": "mmbxx6b",
              "author": "reduces",
              "body": "what? No one is asking for anything for free.",
              "score": 1,
              "created_utc": 1744255986.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmbm00d",
      "author": "BaconFlavoredToast",
      "body": "\"Do you guys not have phones?\"",
      "score": 3,
      "created_utc": 1744251412.0,
      "replies": []
    },
    {
      "id": "mmbuv84",
      "author": "Kevicelives",
      "body": "anyways... Can I just get the Switch 2 already?",
      "score": 3,
      "created_utc": 1744254707.0,
      "replies": []
    },
    {
      "id": "mmbvqcb",
      "author": "kakureru",
      "body": "I would not be surprised if this is what will drive switch 2 hacking.",
      "score": 3,
      "created_utc": 1744255063.0,
      "replies": []
    },
    {
      "id": "mm7lwmh",
      "author": "ElderSkeletonDave",
      "body": "This doesn’t sound unreasonable or rude at all. Bowser is saying that some of the hotly-anticipated titles for Switch 2 are launching on S1 as well (Metroid Prime 4, Pokémon Legends Z-A). If you want some of those experiences for a cheaper entry fee, the original Switch is there for you.\n\nNo need to make everything so sensational",
      "score": 26,
      "created_utc": 1744206456.0,
      "replies": [
        {
          "id": "mm7opok",
          "author": "OtterBoop",
          "body": "I don't have numbers but I am guessing that most people who would want a switch 2 right away already have a switch. And the rest of the hotly anticipated titles are exclusive to the new console. It does seem rude to me, and tone-deaf.",
          "score": -4,
          "created_utc": 1744207336.0,
          "replies": [
            {
              "id": "mm8lu50",
              "author": "Electrifying2017",
              "body": "It’s a reflection of reality. Some people just get mad by being told no. Not like they would suggest getting a payment plan if they really wanted it.",
              "score": 2,
              "created_utc": 1744217199.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm89ncl",
          "author": "coldiriontrash",
          "body": "Switch 1 explodes like a hand grenade trying to run MP4",
          "score": -3,
          "created_utc": 1744213597.0,
          "replies": []
        },
        {
          "id": "mm7p8wk",
          "author": "TimelessFool",
          "body": "It doesn’t look good to investors when you’re telling people to buy your old products instead of the new hotness you’re trying to push. However unbelievable the scenario might be, having Switch 1 outsell Switch 2 from opening day onwards is not a good indicator for people to think Nintendo knows what they’re doing.",
          "score": -8,
          "created_utc": 1744207503.0,
          "replies": [
            {
              "id": "mm7ugqi",
              "author": "Jim_84",
              "body": "Hopefully investors are smart enough to realize that by selling either version of the console, Nintendo is raking in money from games and subscriptions.",
              "score": 5,
              "created_utc": 1744209099.0,
              "replies": []
            },
            {
              "id": "mm7s9qh",
              "author": "Cactuszach",
              "body": "Yes he should have said “You NEED a Switch 2! Go into debt if you have to!”",
              "score": 2,
              "created_utc": 1744208434.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm8qpi0",
      "author": "Transphattybase",
      "body": "I can afford the Switch 2 at the original announced price and whatever the tariffs bring it up to. \n\nI just don’t believe the device is worth $450 and certainly not what the tariffs will bring it to.",
      "score": 8,
      "created_utc": 1744218610.0,
      "replies": [
        {
          "id": "mmbajaz",
          "author": "PM_Me-Your_Freckles",
          "body": "Gads i wish they were $450 here in Aus. $699 is the retail, and lowest I've seen is $694AUD. I skipped the Switch because I bought into the WiiU and went for a PS4 instead. I really want a SW2, but shit a brick, that's nearly PC territory.",
          "score": 1,
          "created_utc": 1744247350.0,
          "replies": [
            {
              "id": "mmc212g",
              "author": "darkmacgf",
              "body": "Damn, you can get a full PC for $700 AUD? That's cheap as heck.",
              "score": 2,
              "created_utc": 1744257819.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm7jjc3",
      "author": "_Bdoodles",
      "body": "“Don’t you all have mobiles?” Guy is somewhere out there building a welcome committee for this other guy",
      "score": 22,
      "created_utc": 1744205685.0,
      "replies": [
        {
          "id": "mm7ohto",
          "author": "silentcrs",
          "body": "Sadly, that guy was right. Not only did everyone have phones, a ton of people downloaded Diablo Immortal and the game makes decent money for the company.",
          "score": 13,
          "created_utc": 1744207268.0,
          "replies": [
            {
              "id": "mm7ujfb",
              "author": "MajorFuckingDick",
              "body": "He said the right thing in the wrong room. Nobody at blizzcon is excited to hear the future of their series is mobile even if they will play it.",
              "score": 5,
              "created_utc": 1744209121.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm938v8",
          "author": "None",
          "body": "Or read the actual quote and not comment on a clickbait headline. Some of you are so media illiterate, it hurts.",
          "score": 3,
          "created_utc": 1744222121.0,
          "replies": []
        },
        {
          "id": "mm7q022",
          "author": "None",
          "body": "It’s nice to see him get work again",
          "score": 2,
          "created_utc": 1744207738.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mma1b3h",
      "author": "More-Jellyfish-60",
      "body": "Steam deck here I come.",
      "score": 7,
      "created_utc": 1744232034.0,
      "replies": [
        {
          "id": "mmc273w",
          "author": "darkmacgf",
          "body": "Valve Steps on PR Minefield as Exec Tells People They Can Buy the Steam Deck If They Can’t Afford the Steam Deck 2 incoming later this year...",
          "score": 3,
          "created_utc": 1744257897.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm9ih3i",
      "author": "Landmine_Prime",
      "body": "Microsoft did this before the Xbox One released. It didn’t really work out the way they hoped",
      "score": 5,
      "created_utc": 1744226576.0,
      "replies": []
    },
    {
      "id": "mmbzd1c",
      "author": "redness88",
      "body": "Don't you people have phones?",
      "score": 3,
      "created_utc": 1744256610.0,
      "replies": []
    },
    {
      "id": "mm7mk5t",
      "author": "utupuv",
      "body": "What in the Don Mattrick are you doing, Bowser?",
      "score": 6,
      "created_utc": 1744206663.0,
      "replies": []
    },
    {
      "id": "mm7qlpu",
      "author": "typo180",
      "body": "Here's the quote. This seems like a perfectly normal and reasonable thing to say. I don't get why people are mad. \n\n>As we look at Nintendo Switch 2 and you think about the feature sets that I talked about ... we believe that the pricing is appropriate for the value of the machine and the gameplay experience overall. We recognize there are some people that may not be able to afford the Nintendo Switch 2 price point. That's why we wanted to make the other Switch platforms available, so people still have an opportunity to come into our gaming universe, be a part of these characters in these worlds, and see value, if you will, in whatever rung of the platform they come in.",
      "score": 10,
      "created_utc": 1744207923.0,
      "replies": [
        {
          "id": "mm7ylkt",
          "author": "nero40",
          "body": "The real issue isn’t the price of the console, it’s the price of the games.",
          "score": 5,
          "created_utc": 1744210326.0,
          "replies": []
        },
        {
          "id": "mme1iq2",
          "author": "Alternative-One5139",
          "body": "Unfortunately, people are taking it to extremes and intentionally taking it out of context because it’s easy to hate Nintendo. That’s what everyone wants to do & is continuing to do.",
          "score": 1,
          "created_utc": 1744293774.0,
          "replies": [
            {
              "id": "mme5dzv",
              "author": "typo180",
              "body": "There's no sin like making a fun toy that people like to play with :)",
              "score": 1,
              "created_utc": 1744294968.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmbya55",
      "author": "None",
      "body": "They don’t get my money. Period",
      "score": 2,
      "created_utc": 1744256142.0,
      "replies": []
    },
    {
      "id": "mmco0gg",
      "author": "Crans10",
      "body": "Exec with comments like that might not be able to afford a Switch 2 soon enough.",
      "score": 2,
      "created_utc": 1744269842.0,
      "replies": []
    },
    {
      "id": "mmg5szr",
      "author": "JLR-",
      "body": "Or they could purchase a different system.",
      "score": 2,
      "created_utc": 1744316217.0,
      "replies": []
    },
    {
      "id": "mm7kkwa",
      "author": "Laucien",
      "body": "They taking a page from the XBox One launch?.\n\nWhen the demanded constant internet connectivity and that guy said something like \"We have a perfectly good console if you don't have stable internet. It's the 360\".",
      "score": 3,
      "created_utc": 1744206028.0,
      "replies": []
    },
    {
      "id": "mm7ij75",
      "author": "42kyokai",
      "body": "They literally just did a 40 minute livestream of new and upcoming Switch games. It very much has several years of life left.\n\nIf you’re old enough to remember Don Mattic’s Xbox One comments back in 2013 but are still complaining about a $450 console in 2025, then honestly, what have you been doing with your life for the past 12 years?",
      "score": 10,
      "created_utc": 1744205343.0,
      "replies": [
        {
          "id": "mm7wrmb",
          "author": "EViLTeW",
          "body": "Sitting on Reddit complaining that the world has changed.",
          "score": 5,
          "created_utc": 1744209789.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm82f2b",
      "author": "augustocdias",
      "body": "I don’t think most people are pissed at the console’s price but rather the games’ prices.",
      "score": 4,
      "created_utc": 1744211454.0,
      "replies": []
    },
    {
      "id": "mm7p36n",
      "author": "txtoolfan",
      "body": "He tells the truth",
      "score": 4,
      "created_utc": 1744207453.0,
      "replies": []
    },
    {
      "id": "mm7wo4c",
      "author": "LusciousJames",
      "body": "“git gud”, economically speaking",
      "score": 4,
      "created_utc": 1744209760.0,
      "replies": []
    },
    {
      "id": "mm82jsg",
      "author": "natertottt",
      "body": "I can also not buy any Nintendo products?",
      "score": 4,
      "created_utc": 1744211493.0,
      "replies": []
    },
    {
      "id": "mm8ix5v",
      "author": "ChickenandWhiskey",
      "body": "\"You guys have phones dont you?\"",
      "score": 2,
      "created_utc": 1744216342.0,
      "replies": []
    },
    {
      "id": "mm8qifb",
      "author": "YoungLadHuckleberry",
      "body": "Absolutely, in fact don‘t even bother going to retailers anymore, there are plenty of used switches to go around",
      "score": 2,
      "created_utc": 1744218552.0,
      "replies": []
    },
    {
      "id": "mm8snxc",
      "author": "sassiest_sasquatch",
      "body": "Turning into the WiiU all over again",
      "score": 3,
      "created_utc": 1744219172.0,
      "replies": []
    },
    {
      "id": "mm7jylp",
      "author": "GrumpyKitten016",
      "body": "people will still buy it.",
      "score": 2,
      "created_utc": 1744205825.0,
      "replies": []
    },
    {
      "id": "mm92jbo",
      "author": "TowerOfPowerWow",
      "body": "Woof",
      "score": 2,
      "created_utc": 1744221916.0,
      "replies": []
    },
    {
      "id": "mm9byac",
      "author": "sodium-overdose",
      "body": "Sounds in the same vein as Kelloggs owner telling people to eat cereal for breakfast if they can’t afford food - when cereal is $7 a box hahaha",
      "score": 2,
      "created_utc": 1744224647.0,
      "replies": []
    },
    {
      "id": "mmehdl1",
      "author": "TheRealGOOEY",
      "body": "Somehow Nintendo has turned into Blizzard 😂",
      "score": 2,
      "created_utc": 1744298530.0,
      "replies": []
    },
    {
      "id": "mm7ktnd",
      "author": "1leggeddog",
      "body": "The best thing they can say is NOTHING",
      "score": 2,
      "created_utc": 1744206107.0,
      "replies": []
    },
    {
      "id": "mm7or6n",
      "author": "MrKuub",
      "body": "Welcome back, Don Mattrick.",
      "score": 2,
      "created_utc": 1744207349.0,
      "replies": []
    },
    {
      "id": "mm9cpnf",
      "author": "Psych-roxx",
      "body": "From the bottom of my heart I hope Nintendo gets a humbling experience at launch. It won't come close to Xbox One but the world is a very different place from 2017 economy wise and this company needs to get a reality check. Having weaker hardware is fine but this excessively aggressive behavior towards its own customers has always rubbed me the wrong way. From the way their games rarely go on sale, disdain for fan projects, their stance against legal emulation, their pay walled text chat, exorbitant new first party prices. The only thing going for them is the games are good but at what point will they cross the threshold for how much their games can cover for their PR. I desperately hope they cross it with this launch.",
      "score": 2,
      "created_utc": 1744224869.0,
      "replies": []
    },
    {
      "id": "mm9qlgs",
      "author": "RenegadeAccolade",
      "body": "Why is this specifically a controversy at all? Obviously not everyone can afford a Switch 2. They’re not gonna drop the price just so people who can’t afford it can. The Switch still exists and they’ll continue to release games on it. \n\nThat’s like calling it a PR Minefield for a car manufacturer to say “if you can’t afford our supercars, we have more affordable models available.” Like that’s just a statement of fact that reflects the reality of life on Earth. Not everyone can afford everything. \n\nThe absolute state of journalism",
      "score": 1,
      "created_utc": 1744228928.0,
      "replies": []
    },
    {
      "id": "mmaf5xh",
      "author": "jmthomas87",
      "body": "Or they could just walk away from Nintendo entirely and do something more constructive with their lives.",
      "score": 2,
      "created_utc": 1744236402.0,
      "replies": []
    },
    {
      "id": "mm7kse5",
      "author": "slycooper13",
      "body": "lol did Nintendo hire Don Mattrick? 😂",
      "score": 2,
      "created_utc": 1744206096.0,
      "replies": []
    },
    {
      "id": "mm7lxvo",
      "author": "Smurfsville",
      "body": "Who the fuck cares. I've seen these nothing burger posts come up so much recently on Reddit and they're all super ridiculous. Will people NOT buy the Switch 2 because they read this piece on wccftech dot com? Ask yourself this. ",
      "score": 2,
      "created_utc": 1744206467.0,
      "replies": []
    },
    {
      "id": "mm7xpt6",
      "author": "HonkedOffJohn",
      "body": "I only use my Nintendo Switch to play Nintendo Labo and that’s not compatible with the Switch 2. Please make Nintendo Labo 2 for the Switch 2.",
      "score": 1,
      "created_utc": 1744210068.0,
      "replies": []
    },
    {
      "id": "mm7z43l",
      "author": "ninjapro98",
      "body": "I don’t get people complaining about the switch 2 price. It’s the same price as other consoles and is priced totally fair, it’s Mario kart world that’s unreasonably priced",
      "score": 1,
      "created_utc": 1744210474.0,
      "replies": []
    },
    {
      "id": "mm7z5f1",
      "author": "zeotech98",
      "body": "Let them eat cake!!",
      "score": 1,
      "created_utc": 1744210484.0,
      "replies": []
    },
    {
      "id": "mm828qs",
      "author": "Arcadiaus",
      "body": "Ahh I get it, instead of a switch 2, I get 2 switches…",
      "score": 1,
      "created_utc": 1744211402.0,
      "replies": []
    },
    {
      "id": "mm83qrw",
      "author": "JazzlikeVariety",
      "body": "Sales above all. They'll change their tune if it's clear it's affecting sales. They charge $1,000 if it could reach the same sales goal.",
      "score": 1,
      "created_utc": 1744211848.0,
      "replies": []
    },
    {
      "id": "mm86f6c",
      "author": "VRGIMP27",
      "body": "Don matrick is that you?",
      "score": 1,
      "created_utc": 1744212648.0,
      "replies": []
    },
    {
      "id": "mm8anj7",
      "author": "NoeloDa",
      "body": "Yeah buy it and FUCKING HACK IT too!\nWTF Nintendo",
      "score": 1,
      "created_utc": 1744213890.0,
      "replies": []
    },
    {
      "id": "mm8b6no",
      "author": "Thenderick",
      "body": "Honestly, for me the problem isn't the console, but the game price. The console has upgrades and is a one time investment, but the game price is ridiculous, especially the ten extra for the physical!",
      "score": 1,
      "created_utc": 1744214047.0,
      "replies": []
    },
    {
      "id": "mm8c0z4",
      "author": "JohnClark13",
      "body": "Ah, the new \"That's why we have the xbox 360\"",
      "score": 1,
      "created_utc": 1744214292.0,
      "replies": []
    },
    {
      "id": "mm8cu32",
      "author": "XAMdG",
      "body": "That's a great advice for products like cell phones, that come out every year with minor updates. Consoles that take half a decade? No",
      "score": 1,
      "created_utc": 1744214532.0,
      "replies": []
    },
    {
      "id": "mm8hsi8",
      "author": "Right_Ostrich4015",
      "body": "Man, fuck Nintendo",
      "score": 1,
      "created_utc": 1744216008.0,
      "replies": []
    },
    {
      "id": "mm8k6ue",
      "author": "nighttaco",
      "body": "Launch the Switch app on iPhone to play games, “Don’t You People Have Phones???”",
      "score": 1,
      "created_utc": 1744216721.0,
      "replies": []
    },
    {
      "id": "mm8l964",
      "author": "Electrifying2017",
      "body": "Some people who want it, won’t be able to afford it. This is nothing new and the additional expense after tariffs is not their doing. ",
      "score": 1,
      "created_utc": 1744217028.0,
      "replies": []
    },
    {
      "id": "mm8mbam",
      "author": "Chassian",
      "body": "Christ, they did this with Xbox two gens ago, did no one learn anything?",
      "score": 1,
      "created_utc": 1744217337.0,
      "replies": []
    },
    {
      "id": "mm8nnj7",
      "author": "LuFalcon",
      "body": "But what are their expectations then for sales? The vast majority of people who bought a switch arent interested in upgrading, they wouldnt even notice a dip in performance.",
      "score": 1,
      "created_utc": 1744217724.0,
      "replies": []
    },
    {
      "id": "mm96mx4",
      "author": "nohumanape",
      "body": "Not a \"PR Minefield\" if you realize that Nintendo has fully positioned the Switch 2 as a device that exists along side the current Switch. \n\nJust look at the pricing for all things Switch 2. Literally every single thing is clearly taking the current Switch's pricing into consideration.",
      "score": 1,
      "created_utc": 1744223099.0,
      "replies": []
    },
    {
      "id": "mm991qn",
      "author": "jwpi31415",
      "body": "eh, I'm old enough to remember that Nintendo did a top-loader refresh of the NES console when SNES came out.  Selling gen[n-1] when releasing gen[n] isn't too unheard of.",
      "score": 1,
      "created_utc": 1744223804.0,
      "replies": []
    },
    {
      "id": "mm9q5dk",
      "author": "Derwinx",
      "body": "Hey, if they want to make Switch 2 games Switch compatible this is valid, otherwise it’s incredibly tone deaf.",
      "score": 1,
      "created_utc": 1744228800.0,
      "replies": []
    },
    {
      "id": "mm9qamm",
      "author": "surprisestoner",
      "body": "Remember when Nintendo said the DS would exist alongside the GBA SP? And wasn’t to replace it?",
      "score": 1,
      "created_utc": 1744228842.0,
      "replies": []
    },
    {
      "id": "mm9rgxo",
      "author": "Snarpkingguy",
      "body": "It’s not the console that’s concerningly overpriced, it’s games. I agree $450 is a reasonable price for console even if it is a bit higher than I was hoping, but I was NOT expecting $80 games to be standard for their biggest games. I thought for sure they would just have all games be $70. When you have a console that’s not as powerful as the current competition, how can you be the one pushing the prices on games?",
      "score": 1,
      "created_utc": 1744229180.0,
      "replies": []
    },
    {
      "id": "mm9tcgq",
      "author": "what595654",
      "body": "Click bait articles will keep happening, because people will keep clicking the links forever.",
      "score": 1,
      "created_utc": 1744229719.0,
      "replies": []
    },
    {
      "id": "mm9vmm5",
      "author": "thanatossassin",
      "body": "This is copy/paste of the Nintendo/Super Nintendo PR from way back in the day and it's stupidly arrogant. The question is who is going to be the Sega Genesis for this generation and Make Nintendo price drop quicker than expected?",
      "score": 1,
      "created_utc": 1744230380.0,
      "replies": []
    },
    {
      "id": "mmac5l9",
      "author": "GruulNinja",
      "body": "Look at those two beside each other, I thought Switch 2 was way bigger",
      "score": 1,
      "created_utc": 1744235411.0,
      "replies": []
    },
    {
      "id": "mmat0na",
      "author": "ohiocodernumerouno",
      "body": "No more tiers...",
      "score": 1,
      "created_utc": 1744241154.0,
      "replies": []
    },
    {
      "id": "mmbaoax",
      "author": "Westyle1",
      "body": "Doesn't this get said by someone at every company when a new console comes out?",
      "score": 1,
      "created_utc": 1744247400.0,
      "replies": [
        {
          "id": "mmbcuxj",
          "author": "Neo_Techni",
          "body": "Only by Don Mattrick for XBOX one, and is credited as a big reason why it failed.",
          "score": 3,
          "created_utc": 1744248166.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmbg1kt",
      "author": "rechoflex",
      "body": "I’ve heard of this before in response to concerns about access to the internet…",
      "score": 1,
      "created_utc": 1744249293.0,
      "replies": []
    },
    {
      "id": "mmbrsve",
      "author": "beren12",
      "body": "wtf.",
      "score": 1,
      "created_utc": 1744253466.0,
      "replies": []
    },
    {
      "id": "mmbtjaz",
      "author": "infamusforever223",
      "body": "They're having their own Xbox One/PS3 moment.",
      "score": 1,
      "created_utc": 1744254162.0,
      "replies": []
    },
    {
      "id": "mmby30n",
      "author": "qwilliams92",
      "body": "I feel like they are avoiding the actual concern people have which is the price of the games",
      "score": 1,
      "created_utc": 1744256056.0,
      "replies": []
    },
    {
      "id": "mmc3kqn",
      "author": "rbra",
      "body": "Yea…and…?",
      "score": 1,
      "created_utc": 1744258555.0,
      "replies": []
    },
    {
      "id": "mmcd5fe",
      "author": "yumaoZz",
      "body": "I don’t get it. If you can’t afford it, that’s not the fault of the manufacturer. Next thing you know people are complaining they can’t buy a Rolls-Royce or a Rolex?",
      "score": 1,
      "created_utc": 1744263397.0,
      "replies": []
    },
    {
      "id": "mmcya5m",
      "author": "popornrm",
      "body": "“If you can’t afford new, buy old”. Wow, genius idea.",
      "score": 1,
      "created_utc": 1744276573.0,
      "replies": []
    },
    {
      "id": "mmcyit8",
      "author": "DarthMaulATAT",
      "body": "Ignoring all the drama, what I really want to know is: DID THEY FIX STICK DRIFT",
      "score": 1,
      "created_utc": 1744276729.0,
      "replies": []
    },
    {
      "id": "mmd5hgl",
      "author": "theSpringZone",
      "body": "Don Mattrick?",
      "score": 1,
      "created_utc": 1744280918.0,
      "replies": []
    },
    {
      "id": "mmdfbwr",
      "author": "Fluffychipmonk1",
      "body": "![gif](giphy|6eLVFfvYnirNm)",
      "score": 1,
      "created_utc": 1744285658.0,
      "replies": []
    },
    {
      "id": "mmdhlan",
      "author": "Dtoodlez",
      "body": "Now post this again without the rage bait",
      "score": 1,
      "created_utc": 1744286605.0,
      "replies": []
    },
    {
      "id": "mmdju37",
      "author": "BZGames",
      "body": "I can’t lie if you’re complaining about it being $450 when it’s a PS4 pro level device in your hands then you are simply delusional. There was never a chance in HELL that it was going to be less than $400.",
      "score": 1,
      "created_utc": 1744287521.0,
      "replies": []
    },
    {
      "id": "mmdnrp7",
      "author": "Appropriate-Log8506",
      "body": "How about we not buy either? Tbh we fixed the joy-con from switch and called it switch 2 is a bit of a stretch.",
      "score": 1,
      "created_utc": 1744289045.0,
      "replies": []
    },
    {
      "id": "mmfdoey",
      "author": "KingDorkFTC",
      "body": "The problem is that we just want straight answers. We aren’t getting them.",
      "score": 1,
      "created_utc": 1744307967.0,
      "replies": []
    },
    {
      "id": "mmfhwct",
      "author": "Olddaddog",
      "body": "I see way less people mad about the cost of the console and way more anger at the cost of the games, tech demo, and chat feature.",
      "score": 1,
      "created_utc": 1744309196.0,
      "replies": []
    },
    {
      "id": "mmi65zg",
      "author": "Bucking_Fullshit",
      "body": "The American Nintendo guy’s last name is Bowser?!?",
      "score": 1,
      "created_utc": 1744341399.0,
      "replies": [
        {
          "id": "mn9njlu",
          "author": "Gullible-Ad-6290",
          "body": "Yeah! You should read the articles about Nintendo hiring him and I think it helped play a roll into his hiring",
          "score": 1,
          "created_utc": 1744738495.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmir7du",
      "author": "goldaxis",
      "body": "Ambassador Program 2 is gonna be fun to watch.",
      "score": 1,
      "created_utc": 1744351865.0,
      "replies": []
    },
    {
      "id": "mmkynqb",
      "author": "3D-Research-Monkey",
      "body": "Bogus headline.",
      "score": 1,
      "created_utc": 1744386836.0,
      "replies": []
    },
    {
      "id": "mmmfeed",
      "author": "Collyn2",
      "body": "They should at this point just hire Mattrick",
      "score": 1,
      "created_utc": 1744402646.0,
      "replies": []
    },
    {
      "id": "mmoxa4j",
      "author": "Groovetone",
      "body": "The pricepoint of the switch 2 is fine, its the games and upscaling costs that are just ridiculous.",
      "score": 1,
      "created_utc": 1744437901.0,
      "replies": []
    },
    {
      "id": "mm7oa44",
      "author": "correctingStupid",
      "body": "\"Waaa. I can't afford luxury entertainment product!\"\n\n\"don't buy it then.\"\n\n<PR nightmare!>\n\nThe entitlement of gamers never fails to astound me.",
      "score": 2,
      "created_utc": 1744207201.0,
      "replies": []
    },
    {
      "id": "mm7s0xr",
      "author": "electric--eskimo",
      "body": "Switch 2 will be cheaper than a NES and a SNES (when adjusted for inflation)",
      "score": 1,
      "created_utc": 1744208359.0,
      "replies": []
    },
    {
      "id": "mm81i8n",
      "author": "tiktock34",
      "body": "If you can even consider affording either, you arent in a financially critical situation.  No one is bullying homeless people here.  Its a handheld video game system.  They are keeping it affordable for people and its like they are the devil for stating it out loud",
      "score": 1,
      "created_utc": 1744211181.0,
      "replies": []
    },
    {
      "id": "mm9sq32",
      "author": "Kaslight",
      "body": "Didn't Xbox LITERALLY get crucified for the exact same sentiment?\n\nLet's see if the Nintendo cult fights back or just holds their mouth open lol",
      "score": 1,
      "created_utc": 1744229540.0,
      "replies": [
        {
          "id": "mmbd5bh",
          "author": "Neo_Techni",
          "body": "> Didn't Xbox LITERALLY get crucified for the exact same sentiment?\n\nyes",
          "score": 1,
          "created_utc": 1744248270.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmaert3",
      "author": "Seabrook76",
      "body": "OP, you gotta do better than this.",
      "score": 1,
      "created_utc": 1744236271.0,
      "replies": []
    },
    {
      "id": "mm7r2kk",
      "author": "Youneedtogoon_Mark",
      "body": "I am just gonna buy a second-hand DS at this point and pretend it’s still 2010",
      "score": 1,
      "created_utc": 1744208067.0,
      "replies": []
    },
    {
      "id": "mm7t72y",
      "author": "pcm2a",
      "body": "Old Switch will get new Mario and Zelda games?",
      "score": 1,
      "created_utc": 1744208716.0,
      "replies": [
        {
          "id": "mm8ykwn",
          "author": "chief_yETI",
          "body": "yes.",
          "score": 1,
          "created_utc": 1744220816.0,
          "replies": [
            {
              "id": "mm9i3mu",
              "author": "pcm2a",
              "body": "You have made my children happy with this information.",
              "score": 0,
              "created_utc": 1744226465.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm7v7om",
      "author": "thedude213",
      "body": "I didn't know Don Mattrick got a job at Nintendo.",
      "score": 1,
      "created_utc": 1744209325.0,
      "replies": []
    },
    {
      "id": "mm7wb9t",
      "author": "None",
      "body": "“Shut up and buy it” - Nintendo since 1987",
      "score": 1,
      "created_utc": 1744209654.0,
      "replies": []
    },
    {
      "id": "mm85i4u",
      "author": "leathco",
      "body": "Years ago \"we have a product for people who can't be online, it's called Xbox 360\". I remember that going well. /s",
      "score": 1,
      "created_utc": 1744212375.0,
      "replies": []
    },
    {
      "id": "mm8dep1",
      "author": "Gnash_",
      "body": "The PR nightmare is 90 € physical Mario Kart in Europe",
      "score": 1,
      "created_utc": 1744214703.0,
      "replies": []
    },
    {
      "id": "mm8ww5t",
      "author": "DarklyDreamingEva",
      "body": "I’d like to see a boycott because of this but that’s not likely to happen.",
      "score": 1,
      "created_utc": 1744220348.0,
      "replies": []
    },
    {
      "id": "mm9cjp5",
      "author": "JoseSuarez",
      "body": "People, it's as simple as this: don't buy it. We''ll see if they can afford to keep it up in a few months time.",
      "score": 1,
      "created_utc": 1744224820.0,
      "replies": []
    },
    {
      "id": "mm9vsgl",
      "author": "AppalachanKommie",
      "body": "Xbox literally did the same when Xbox one was unveiled.",
      "score": 1,
      "created_utc": 1744230428.0,
      "replies": []
    },
    {
      "id": "mm9ybj5",
      "author": "nanapancakethusiast",
      "body": "Don Mattrick’s Nintendo!",
      "score": 1,
      "created_utc": 1744231170.0,
      "replies": []
    },
    {
      "id": "mmbhrtu",
      "author": "AUkion1000",
      "body": "if it wasnt obvious were in a age where companies know that generally they can do as they want and not worry about fallout. People are too complacent and desperate for their fix. This isnt gonna get better.",
      "score": 1,
      "created_utc": 1744249894.0,
      "replies": []
    },
    {
      "id": "mmbugvm",
      "author": "Hakuuru",
      "body": "After the disappointment that the switch was for me, I would t buy a switch 2 at any price point. \n\nI’m two sets of replacement joycons poorer, and haven’t bothered to use it once in six months.  Almost every choice is a better choice at this point.",
      "score": 1,
      "created_utc": 1744254543.0,
      "replies": []
    },
    {
      "id": "mmjvu3x",
      "author": "stavors",
      "body": "Boycott nintendo",
      "score": 1,
      "created_utc": 1744374505.0,
      "replies": []
    },
    {
      "id": "mm7jxg7",
      "author": "Knyfe-Wrench",
      "body": "I really don't get what the big deal is. It's cheaper than the PS5 and Series X were at launch, and only slightly more than the Switch 1 accounting for inflation.\n\n\nThe game prices are much more concerning.",
      "score": -4,
      "created_utc": 1744205814.0,
      "replies": [
        {
          "id": "mm7l1fr",
          "author": "ItsOkAbbreviate",
          "body": "Yeah at launch sure however they are all the same price now and the series s is cheaper.",
          "score": 3,
          "created_utc": 1744206178.0,
          "replies": []
        },
        {
          "id": "mm7le91",
          "author": "diacewrb",
          "body": ">  It's cheaper than the PS5 and Series X were at launch, and only slightly more than the Switch 1 accounting for inflation.\n\nFor now, trump may launch another round of tariffs.\n\n100% on semiconductors may be next.",
          "score": 2,
          "created_utc": 1744206292.0,
          "replies": []
        },
        {
          "id": "mm7l56o",
          "author": "TheDynamicDino",
          "body": "The economy is in a very different place than during the Switch 1 launch. The asking price may be literally similar, but not contextually. Premium-priced entertainment isn’t a big priority for many right now, especially when a large number of prospective customers already have/had a Switch.",
          "score": 5,
          "created_utc": 1744206212.0,
          "replies": [
            {
              "id": "mm7xrl4",
              "author": "EViLTeW",
              "body": "The economy is very different. With Trump and CoViD inflation, $499.99 in 2020 USD is equivalent to $613.70 in 2025 USD. So Nintendo is effectively pricing their console $160 less than Sony did.",
              "score": 2,
              "created_utc": 1744210082.0,
              "replies": []
            },
            {
              "id": "mm7n3hy",
              "author": "Nope_______",
              "body": ">Premium-priced entertainment isn’t a big priority for many right now\n\nThen they should stick to their Switch, right?",
              "score": 4,
              "created_utc": 1744206834.0,
              "replies": [
                {
                  "id": "mm7nago",
                  "author": "TheDynamicDino",
                  "body": "Exactly. I imagine most have already made this decision.",
                  "score": 5,
                  "created_utc": 1744206894.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7r8st",
              "author": "dclxvi616",
              "body": "Yea, they should have said, “We recognize there are some people who may not be able to afford the Switch 2. That’s why we’re pulling the original Switch off the market with the launch of our new console. If you haven’t experienced Nintendo by now, get stuffed.” 🙄",
              "score": 2,
              "created_utc": 1744208120.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm82pp6",
      "author": "Mittens138",
      "body": "Lmao keep dreaming.  You can get a steam deck for $150 cheaper have a greater catalogue of games and not have to worry about nintendos bs.  They rely heavily on nostalgia to move units and have nothing to show for launch titles.  The switch launch dropped botw and mario odessy, the switch 2 has hyrule warriors 3 and a bunch of 3rd party games that have been out for a while. Good luck.",
      "score": 0,
      "created_utc": 1744211541.0,
      "replies": []
    },
    {
      "id": "mmd1l9i",
      "author": "KoriJenkins",
      "body": "THE PS5 LAUNCHED AT 500 DOLLARS FIVE YEARS AGO AND NO ONE COMPLAINED.\n\nThis is manufactured outrage at literally the only company in the industry that hasn't devolved into total scumbags by cramming in monetization and gambling.",
      "score": 0,
      "created_utc": 1744278658.0,
      "replies": []
    },
    {
      "id": "mma59ju",
      "author": "FadedP0rp0ise",
      "body": "Do they not realize aside from autistic Nintendo cultists, that nobody really prefers a switch? Been digging their grave since BOTW imo. Nintendo hates their fans.",
      "score": -2,
      "created_utc": 1744233228.0,
      "replies": []
    },
    {
      "id": "mm7qbol",
      "author": "dr4wn_away",
      "body": "Oh so we can play Mario kart world on the switch 1? Answer no",
      "score": -1,
      "created_utc": 1744207837.0,
      "replies": []
    },
    {
      "id": "mm7w07y",
      "author": "istinkalot",
      "body": "Poor people are so sensitive   High end gaming is not a constitutional right. ",
      "score": -4,
      "created_utc": 1744209562.0,
      "replies": [
        {
          "id": "mm7xyrt",
          "author": "chrisagiddings",
          "body": "Everyone is triggered by stupid shit constantly. Poor, rich, young, old, abled, disabled, employed, unemployed …\n\nWhat we’re triggered by, and why changes over time based on a variety of factors.",
          "score": 1,
          "created_utc": 1744210141.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7r3e1",
      "author": "charlie22911",
      "body": "If I can’t afford the Switch 2, I’ll just play the Switch I already own, or I’ll buy another product. With the way the world is going though I’ll probably just enjoy what I have already and not spend any money 👍. Checkmate Nintendo.",
      "score": 0,
      "created_utc": 1744208074.0,
      "replies": []
    },
    {
      "id": "mm7v1lf",
      "author": "ranchorbluecheese",
      "body": "maybe i will buy a discounted switch and play that until i get through its game library. then by the time i do, the switch 3 will be out. there's no desire to rush to get the switch 2",
      "score": 0,
      "created_utc": 1744209274.0,
      "replies": []
    },
    {
      "id": "mm83wwg",
      "author": "No-Brain9413",
      "body": "Not for nothing, I can’t afford the Switch 2 and think his advice is sound. We were looking forward to upgrade our Switch, which we love as a family, but such is life.\n\nHopefully we catch a sale somewhere",
      "score": 0,
      "created_utc": 1744211899.0,
      "replies": []
    },
    {
      "id": "mm8f0vi",
      "author": "blackdynomitesnewbag",
      "body": "![gif](giphy|2lypEloChTbEc)",
      "score": 0,
      "created_utc": 1744215184.0,
      "replies": []
    },
    {
      "id": "mm8gm47",
      "author": "KrookedDoesStuff",
      "body": "For $450 the Switch 2 is absolutely at the highest price point I’d be willing to pay, and even then I think it’s $100 too much. It screams “This is going to end up like the 3DS where they drop the price after sales don’t happen.”\n\nThat being said, if tariffs increase the price even more, it’s a skip for me, and I say that as someone who owns every Nintendo console, including a Virtual Boy.",
      "score": 0,
      "created_utc": 1744215659.0,
      "replies": [
        {
          "id": "mm8vcdx",
          "author": "Cakeski",
          "body": "Other handheld games consoles are available, the steamdeck let's you play games you own with Internet access completely free!",
          "score": 2,
          "created_utc": 1744219919.0,
          "replies": [
            {
              "id": "mm8y4j4",
              "author": "KrookedDoesStuff",
              "body": "That’s part of why I think $450 for the Switch 2 is insane. The steam deck is less expensive and far more capable.",
              "score": 1,
              "created_utc": 1744220691.0,
              "replies": [
                {
                  "id": "mm8ypf0",
                  "author": "Cakeski",
                  "body": "Exactly! Can the switch 2 run a desktop mode, applications outside of games? Yes the dock is a separate accessory but that let's you turn it into a  PC!",
                  "score": 1,
                  "created_utc": 1744220850.0,
                  "replies": [
                    {
                      "id": "mm9116m",
                      "author": "KrookedDoesStuff",
                      "body": "I know a lot of people are anti-emulation too, but I’m fairly certain the Steam Deck runs Yuzu. I’d be interested to see if the Switch 2 (like all other Nintendo consoles) is going to be exploited as easily as the Switch",
                      "score": 1,
                      "created_utc": 1744221488.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm8jks8",
      "author": "SenpaiSwanky",
      "body": "You can’t tell people things that make sense when they want to simultaneously complain about pricing AND be materialistic lol.",
      "score": 0,
      "created_utc": 1744216539.0,
      "replies": []
    },
    {
      "id": "mm8pijp",
      "author": "Bohottie",
      "body": "It’s not too expensive. I paid $50 for Super Metroid in 1994. That is $120 today. The fact is console software has not kept up with inflation.",
      "score": 0,
      "created_utc": 1744218264.0,
      "replies": [
        {
          "id": "mm8uwyg",
          "author": "coldfusion718",
          "body": "Wages haven’t kept up.  That’s why for most people, an $80 game today feels like a ripoff.",
          "score": 1,
          "created_utc": 1744219799.0,
          "replies": [
            {
              "id": "mm92h28",
              "author": "XBattousaiX",
              "body": "I agree with this.\n\nBack when games were 50/60, a lot of them felt like better purchases.\n\nAt current prices, few games are worth their full MSRP prices.\n\nSparking zero was a game I waited so damn long for. It didn't do it for me, despite buying the game with the season pass. I'll go back to it soon, but it didn't feel like what the old games did.\n\nWilds was worth it, but I bought it with a slight discount pre-release, and monster hunter is a series that is genuinely better as you follow the title updates, but ymmv on how much you like the series. Good dripfeed content is rather enjoyable to me.\n\nFew games are worth their price nowadays imo. The Zelda games typically are to me, but that doesn't apply for all games. Few AAA games are imo. \n\nBut to each their own. People buy call of duty every single year, and don't seem to mind the absurd price for what imo is a rather mediocre game, and then spend a load on micro transactions...",
              "score": 1,
              "created_utc": 1744221898.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm8tc0r",
      "author": "ImaFireMage",
      "body": "I mean, the 1st Switch is still pretty awesome.",
      "score": 0,
      "created_utc": 1744219359.0,
      "replies": []
    },
    {
      "id": "mm92awl",
      "author": "stahpstaring",
      "body": "Rage bait title. Total bullshit and misquoted.",
      "score": 0,
      "created_utc": 1744221848.0,
      "replies": []
    },
    {
      "id": "mm949zc",
      "author": "adilly",
      "body": "I’m not the biggest Nintendo fan but I’m not sure how 449 is prohibitively expensive for a console made in 2025. \n\nThe ps5 pro is 700 dollars for slightly better graphics. Even more if you want to use physical media…\n\nThe switch 2, conversely, is an entirely new system. Is it cheap? No. Is it crazy expensive…also no. \n\nThe games on the other hand….ouch.",
      "score": 0,
      "created_utc": 1744222419.0,
      "replies": []
    },
    {
      "id": "mm9lc7k",
      "author": "None",
      "body": "Yeah, if you can’t afford it, prioritize your shit. I know it’s a tough world out there. But this isn’t exactly a life necessity.",
      "score": 0,
      "created_utc": 1744227414.0,
      "replies": []
    },
    {
      "id": "mm9nzsx",
      "author": "Historical-Look388",
      "body": "I am so fucking sick of this shit\n\nAdjusted for inflation, it's a $50 price hike. On a $400 console. Which will continue releasing games on the old one too. \n\nYall are just desperate for something to whinge about",
      "score": 0,
      "created_utc": 1744228186.0,
      "replies": []
    },
    {
      "id": "mm9w5p0",
      "author": "7-11Armageddon",
      "body": "Oh clickbait trash.  Enjoy the clicks wccftech.com.",
      "score": 0,
      "created_utc": 1744230535.0,
      "replies": []
    },
    {
      "id": "mmcqzqd",
      "author": "LordBrasca",
      "body": "I feel like the price for the Switch 2 is fair, the problem is just the price of the games and the fact that physical copies are just cartridges with a code inside to download the game.",
      "score": 0,
      "created_utc": 1744271774.0,
      "replies": []
    },
    {
      "id": "mmfpuwd",
      "author": "Vesuvias",
      "body": "READ THE FULL QUOTE. Holy hell, people love drama.",
      "score": 0,
      "created_utc": 1744311535.0,
      "replies": []
    },
    {
      "id": "mmselef",
      "author": "RawSteelUT",
      "body": "Wasn't going to buy one anyway at that abusive price.  They can keep the Switch 2, or they can see sense like they did with the 3DS when it was met with resistance.",
      "score": 0,
      "created_utc": 1744489212.0,
      "replies": []
    },
    {
      "id": "mm7o18b",
      "author": "None",
      "body": "[deleted]",
      "score": -3,
      "created_utc": 1744207125.0,
      "replies": [
        {
          "id": "mm7wgam",
          "author": "sevenofnineftw",
          "body": "It’s a luxury product, it isn’t food or medicine. If they made it too expensive don’t buy it, and they’ll have to either make it cheaper or sell fewer of them",
          "score": 2,
          "created_utc": 1744209695.0,
          "replies": []
        },
        {
          "id": "mm86ym5",
          "author": "sir_rockabye",
          "body": "You're being ridiculous",
          "score": 1,
          "created_utc": 1744212808.0,
          "replies": []
        },
        {
          "id": "mm7osc2",
          "author": "jandkas",
          "body": "No they didn’t",
          "score": 0,
          "created_utc": 1744207359.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7osyi",
      "author": "EPICANDY0131",
      "body": "They did it! They fucked up the easiest launch ever",
      "score": -2,
      "created_utc": 1744207365.0,
      "replies": [
        {
          "id": "mm7prv8",
          "author": "SpaceFire1",
          "body": "It’s a clickbait headline. Read the full quote",
          "score": 6,
          "created_utc": 1744207667.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm7ovic",
      "author": "Wonder-Machine",
      "body": "How to these people become millionaires making such stupid mistakes",
      "score": -1,
      "created_utc": 1744207387.0,
      "replies": []
    },
    {
      "id": "mm825e7",
      "author": "IamChwisss",
      "body": "Ugh...Can they all just move to cloud based subscription gaming already? I don't want a switch. Just want to play Mario 64 or super Mario Land when I get nostalgia. Yeah I know there are emulators out there... But,....fuck it..nevermind.",
      "score": -4,
      "created_utc": 1744211374.0,
      "replies": []
    },
    {
      "id": "mmaufbh",
      "author": "The-student-",
      "body": "Tbh seems like a totally fine remark. They will continue to support Switch, that is their entry platform. When you're ready for Switch 2 you can transfer all your games and controllers over.",
      "score": -4,
      "created_utc": 1744241637.0,
      "replies": [
        {
          "id": "mmb4sbm",
          "author": "None",
          "body": "I agree. Seems reasonable.",
          "score": -2,
          "created_utc": 1744245314.0,
          "replies": []
        }
      ]
    }
  ]
}