{
  "post": {
    "title": "Motorola is Launching a New Batch of Folding Razrs Later This Month | There could be two or three folding Razr smartphones in this year's spring lineup, all with a little bit of \"Moto AI.\"",
    "author": "chrisdh79",
    "id": "1jwf0xp",
    "score": 1056,
    "created_utc": 1744337261.0,
    "selftext": "",
    "num_comments": 119,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jwf0xp/motorola_is_launching_a_new_batch_of_folding/"
  },
  "comments": [
    {
      "id": "mmi7v5p",
      "author": "LARGames",
      "body": "AI is not a feature anyone is looking forward to....",
      "score": 451,
      "created_utc": 1744342136.0,
      "replies": [
        {
          "id": "mmiyznx",
          "author": "alphabased",
          "body": "These companies slapping \"AI\" on every feature thinking we'll be impressed while the basic stuff still lags.",
          "score": 122,
          "created_utc": 1744356613.0,
          "replies": [
            {
              "id": "mmkh062",
              "author": "LibraryBig3287",
              "body": "Apple AI Intelligence+ coming to you soon for $20/month!",
              "score": 5,
              "created_utc": 1744381635.0,
              "replies": []
            },
            {
              "id": "mmjc5ma",
              "author": "2roK",
              "body": "I've put \"AgE of empires\" into my resume. It has AI and all these tech companies will be very impressed that I've been fiddling with AI all my life.",
              "score": 18,
              "created_utc": 1744365048.0,
              "replies": [
                {
                  "id": "mmmniv2",
                  "author": "LamentableFool",
                  "body": "Rogan?",
                  "score": 1,
                  "created_utc": 1744405144.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmiwwc0",
          "author": "TotallyNormalSquid",
          "body": "I use AI every day, I work in AI, I've even handed control of high power lasers over to AI.\n\nEven I don't want products marketed with AI. Just let me download the dedicated apps by choice instead of forcing it on me.",
          "score": 31,
          "created_utc": 1744355306.0,
          "replies": [
            {
              "id": "mmixkof",
              "author": "Lied-",
              "body": "Can you elaborate on how you’re using it for the laser control systems? By AI are you referring to traditional ML or LLM?",
              "score": 10,
              "created_utc": 1744355718.0,
              "replies": [
                {
                  "id": "mmiyzs0",
                  "author": "TotallyNormalSquid",
                  "body": "Oh the laser stuff was a good few years ago. It was CNNs, typically for predicting the machining quality of microscale femtosecond pulsed laser ablation of beams shaped via spatial light modulators.\n\nBasically: put a shaped window in front of your laser in the shape you want to burn into the surface, the shape at the surface will be a bit distorted from your window shape. So you need to adjust your window shape + pulse power to get the shape at the surface you actually want.\n\nWe really should have done the reverse transform with a CNN, i.e. have the shape you want as input and predict the ideal window shape, but we couldn't get that to work back in the day. I think these days I could probably have gotten it to work, but I was pretty new to deep learning back then.",
                  "score": 14,
                  "created_utc": 1744356614.0,
                  "replies": [
                    {
                      "id": "mmk26xm",
                      "author": "scarcely20characters",
                      "body": "(CNN = convolutional neutral network, a type of machine learning)",
                      "score": 13,
                      "created_utc": 1744376885.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmlv1oi",
          "author": "B00marangTrotter",
          "body": "If you'd be my bodyguard\n\nI can be your long-lost pal\n\nI can call you Betty and Betty, when you call me\n\nYou can call me Al\n\n![gif](giphy|8qtXJyuvDaCK7Vp72P)",
          "score": 5,
          "created_utc": 1744396420.0,
          "replies": []
        },
        {
          "id": "mmj070d",
          "author": "Adam-West",
          "body": "If it’s good AI, I am looking forward to it. I want to be able to sort out my life admin while driving by talking to an AI personal assistant. I also want answers to all the random nonsense questions I have in my head while driving.",
          "score": 8,
          "created_utc": 1744357396.0,
          "replies": []
        },
        {
          "id": "mmiqbzu",
          "author": "sargonas",
          "body": "Shareholders are! 😆😅😭",
          "score": 16,
          "created_utc": 1744351363.0,
          "replies": []
        },
        {
          "id": "mmlwj3n",
          "author": "kog",
          "body": "I wouldn't say that so much as...the AI a company is going to build into my phone is extremely unlikely to be the AI I want to use.\n\nIf a phone company is actually leading the market in AI, sure, put it on there. Motorola is not that company.",
          "score": 2,
          "created_utc": 1744396872.0,
          "replies": []
        },
        {
          "id": "mmnwq9s",
          "author": "Any_Initiative_9079",
          "body": "Or as the new Secretary of Education calls it: A-one",
          "score": 2,
          "created_utc": 1744421311.0,
          "replies": []
        },
        {
          "id": "mmoq68o",
          "author": "End3rWi99in",
          "body": "I use AI throughout the day every day for work and personal stuff. I want to see it scale across other platforms. I want to see agentic applications that can work across apps on my phone. I just don't really want \"Moto AI\" taking a crack at it because all these proprietary LLMs for this or that company are just going to suck. Reminds me of Samsung ramming Bixby down everyone's throat.",
          "score": 2,
          "created_utc": 1744433965.0,
          "replies": []
        },
        {
          "id": "mmo2e5s",
          "author": "PMmeyourlogininfo",
          "body": "It's pronounced \"Eh-one\"",
          "score": 1,
          "created_utc": 1744423497.0,
          "replies": []
        },
        {
          "id": "mmiey6j",
          "author": "Curse3242",
          "body": "The branding is stupid, but I quite like the 'AI' on my Samsung. Sure I could do everything it offers in a different way but it is very convenient & works better than most alternatives for me. Circle to search/hold home button to search/translate screen is so cool",
          "score": -11,
          "created_utc": 1744345389.0,
          "replies": [
            {
              "id": "mmio75f",
              "author": "gggg566373",
              "body": "Circle to search and translate existed in Android for years. Way before AI craziness. They just adding initials AI to every existing function and claim it to be revolutionary new feature",
              "score": 25,
              "created_utc": 1744350172.0,
              "replies": [
                {
                  "id": "mmiwnxv",
                  "author": "Curse3242",
                  "body": "I know but having it be built into the system is nice. In my personal experience it works better than I've ever used on before",
                  "score": -3,
                  "created_utc": 1744355165.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmivc1l",
              "author": "cafk",
              "body": "> Circle to search/hold home button to search/translate screen is so cool  \n  \nIt's called optical character recognition (OCR) and was a sales argument for scanners and their software in the mid 90s - now with running it through a translator. OCR has been used as a helping factor for visually impaired since the late 70s for computer users.  \nSimilarly reverse image search isn't a new feature (Content-based image retrieval) gained popularity in late 2000s  \nCircling/selecting an area is copy-paste in a convenience form, to do the previous tasks.  \n  \nBranding it as AI is just dressing up a donkey as a horse.",
              "score": 7,
              "created_utc": 1744354346.0,
              "replies": [
                {
                  "id": "mmixr3i",
                  "author": "Curse3242",
                  "body": "I need to use a ton of OCR in my business & trust me I never really found a great accessible free option. The one that comes with Samsung works the quickest.\n\nThere's always been the most up to date ways in technology. But things are better when they're built into the device.\n\nI think now that I'm older, I'm appreciating more simplicity. I remember when I was in school/college. I would constantly tell my brother/sisters/cousins.. older people, about all these ways of doing things & they were not interested. Like how many older people prefer iPhones because they offer the required usability for most casual users.\n\nI'm not that tech outed yet that I don't need an android anymore. But I would like things to already be built into my device & be usable easily.",
                  "score": 3,
                  "created_utc": 1744355830.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mms8s8k",
              "author": "too_oh_ate",
              "body": "That isn't AI",
              "score": 1,
              "created_utc": 1744487275.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmi1mv5",
      "author": "Metahec",
      "body": "No, not Motorola! Best thing about their phones is the almost vanilla Android they use. They don't need to shoehorn AI into it.",
      "score": 82,
      "created_utc": 1744339530.0,
      "replies": [
        {
          "id": "mmicbp9",
          "author": "MrBallBustaa",
          "body": "Look up Hello UI.",
          "score": 13,
          "created_utc": 1744344142.0,
          "replies": []
        },
        {
          "id": "mmlov9v",
          "author": "Troll_Enthusiast",
          "body": "You can probably turn it off",
          "score": 0,
          "created_utc": 1744394550.0,
          "replies": [
            {
              "id": "mmt3bkm",
              "author": "UnlimitedDeep",
              "body": "It’ll probably come back every update",
              "score": 3,
              "created_utc": 1744497854.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmiollh",
      "author": "Electricbutthair",
      "body": "I hope they actually sell all models in Canada this time. Also, can I just say I would be more likely to buy it if it promoted NOT having AI. Idk why they think it's a selling point, nobody cares about it.",
      "score": 11,
      "created_utc": 1744350392.0,
      "replies": []
    },
    {
      "id": "mmixz50",
      "author": "hankhilton",
      "body": "Oh yay AI, who gives a shit",
      "score": 43,
      "created_utc": 1744355971.0,
      "replies": []
    },
    {
      "id": "mmj7bq4",
      "author": "demwoodz",
      "body": "Now 145% more expensive!",
      "score": 10,
      "created_utc": 1744361993.0,
      "replies": []
    },
    {
      "id": "mmid2qc",
      "author": "baffnet",
      "body": "Hello moto",
      "score": 17,
      "created_utc": 1744344487.0,
      "replies": [
        {
          "id": "mmiowj6",
          "author": "UnluckySide5075",
          "body": "\"DUN DUN DUN! da dun DUN DUN! duh-duh-duh DUNNNNnnn...*pzzt*\"",
          "score": 13,
          "created_utc": 1744350562.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmhwdhe",
      "author": "Polymersion",
      "body": "And I literally just bought a phone for the first time in years, and it's the most recent Razr, dangit",
      "score": 23,
      "created_utc": 1744337502.0,
      "replies": [
        {
          "id": "mmhyhv9",
          "author": "chubbybator",
          "body": "what do you think of it? i keep hesitating on pulling that trigger",
          "score": 11,
          "created_utc": 1744338313.0,
          "replies": [
            {
              "id": "mmi543g",
              "author": "Polymersion",
              "body": "I've only had it for like three days, so grain of salt, but:\n\nCons:\n\n- I thought the model I got was supposed to have a leathery grip. Instead, it has an incredibly slick grip. Haven't dropped it and don't plan to, but this means I'm buying a case for it which I was hoping to go without since the phone, y'know, closes.\n\n- Closing the screen sometimes does stuff I wish it wouldn't. Like backing out of this comment with no prompt so I had to retype the whole thing.\n\n- It isn't practical to close with one hand. No snapping shut like an old flip phone. On the flip side, it doesn't wiggle at all when open, but behaves like any other solid-screen phone.\n\n- I'm not sure what the specs are for the external screen glass- it picks up fingerprints like crazy but they also wipe off super easily. It's almost a weirdly nice little ritual to wipe it off on a sleeve/hem when I close it?\n\n- I haven't found any cool uses for half-open mode yet besides being a camera stand/clock.\n\nPros:\n\n- The \"seam\" is a non-issue. If you run your finger across it (such as while scrolling) you can feel where it is, but you can only see it visually in certain lights. \n\n- Ohmygod icanputit inmypocket. Without worrying about it being bent or bumping things.\n\n- The external screen is far more functional than I expected. Still mostly a novelty, but allows for checking notifications and time and whatnot without opening it. Mostly redundant because I have a connected watch, but still handy. It will do apps as well, but I haven't tried.\n\n- You can customize which stuff is accessible on the small screen, both with and without your PIN.\n\n- Being able to stand does make it great for photos or alarms. Can't use it as a \"tent\" on the bedside because of the charging port, but that's a minor quibble.\n\nIt has a few software things, both good and bad, that are common to Motorola devices (I don't like that it doesn't have a photo gallery like LG, only Google Photos).\n\nThose are the things I noticed- other people might have a different focus. I couldn't tell you how good the cameras are, for instance, because I don't have much of an appreciation for the differences there.",
              "score": 32,
              "created_utc": 1744340956.0,
              "replies": [
                {
                  "id": "mminevy",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 10,
                  "created_utc": 1744349741.0,
                  "replies": [
                    {
                      "id": "mmiu11m",
                      "author": "NuPNua",
                      "body": "I don't have a folding Motorola, but I do have their fake leather backing and it is great for grip.",
                      "score": 2,
                      "created_utc": 1744353542.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mmi5c54",
                  "author": "chubbybator",
                  "body": "danke",
                  "score": 6,
                  "created_utc": 1744341049.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmi8w4p",
              "author": "kayson",
              "body": "Also just got a razr+ 2024 and I'm a huge fan. Really happy with it. It's definitely not nearly as polished as a Samsung phone though. Just a bunch of little bugs here and there (and some big ones, like Bluetooth pairing issues; supposedly resolved in the Android 15 update that's making its way out). \n\nAs the other commenter mentioned, the front screen is very functional. I often don't have to open the phone when I get some notification. Which is just like every other phone, obviously, but the point is that it being a folding phone isn't a huge deficit.\n\nYou can definitely notice the crease in the screen, especially with a white background. Not sure how it compares to other foldables, but it's easy enough to ignore. \n\nThe camera is servicable. Again, not as good as a Samsung phone, but it's rare that I've wished it were better. \n\nThere are a few things weirdly lacking - some of the UI is chunky, the settings app is totally black and white making it hard to navigate. The UI for customizing the front screen is great though, and a lot of the moto stuff is fun. It relies on Google apps for a lot of things, which I didn't like - calendar and files are examples. I removed those and use open source alternatives. \n\nI didn't think I'd be considering another razr for my next phone, but I am now!",
              "score": 7,
              "created_utc": 1744342590.0,
              "replies": [
                {
                  "id": "mmi9m3f",
                  "author": "chubbybator",
                  "body": "grazie",
                  "score": 3,
                  "created_utc": 1744342917.0,
                  "replies": []
                },
                {
                  "id": "mmncxyz",
                  "author": "TheArmadilloAmarillo",
                  "body": "Isn't it pretty much the same price as the Samsung like within $100? \n\nI would think it would be better to buy the Samsung for the issues you've listed.",
                  "score": 1,
                  "created_utc": 1744413870.0,
                  "replies": [
                    {
                      "id": "mmniddt",
                      "author": "kayson",
                      "body": "Really depends on the carrier. I got it for $6/mo for 36mo, no trade in. I think the Z fold would've been like $20/mo and I would've had to trade in my S22+ which I need.",
                      "score": 1,
                      "created_utc": 1744415848.0,
                      "replies": [
                        {
                          "id": "mmnlgdl",
                          "author": "TheArmadilloAmarillo",
                          "body": "Gotcha, I was genuinely curious about the reasoning and that makes complete sense. \n\nI want a flip or a razr+  but I'm likely getting an A36 bc cost.",
                          "score": 1,
                          "created_utc": 1744416992.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mml6zj3",
              "author": "Not_Bears",
              "body": "Had my Razr for almost 2 year now.  I love it.\n\nI use the front screen mostly for my Google Wallet and pictures, it's definitely useful but I don't think it's like having a 2nd device.  It's pretty cool sometimes when you're walking around a city and need directions to just have Google Maps running on the front screen.  That way you don't look like a tourist staring at this huge phone. You can just kind of hold it like a small GPS and glance at it in your hand once in awhile. \n\nAside from that the form factor is great, it feels so much smaller in my pocket and I love that I can like put it on speakerphone with the phone closed. \n\nI'll probably get another one and I don't think I'll get go back to a non-flip phone, as long as they keep making them.",
              "score": 2,
              "created_utc": 1744389326.0,
              "replies": [
                {
                  "id": "mml7icb",
                  "author": "chubbybator",
                  "body": "gracias!",
                  "score": 1,
                  "created_utc": 1744389481.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmoc6nd",
              "author": "reduces",
              "body": "I have had mine since black Friday. I have the regular razr 2024. It's a good phone. The physical act of flipping it shut makes me feel good about putting it down, and I am not obsessively checking it as often. I also put in a preorder for the new Clicks keyboard case. Because to me, the main reason I use my phone is to communicate with others, and the on screen keyboard is kinda so tiny it's unusable on the front screen. So I don't use the front screen much.",
              "score": 2,
              "created_utc": 1744427436.0,
              "replies": [
                {
                  "id": "mmogaf5",
                  "author": "chubbybator",
                  "body": "i'm out of extra languages to say thanks in, so \"thank you\"",
                  "score": 2,
                  "created_utc": 1744429212.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmie9ut",
          "author": "juicebox12",
          "body": "I've had a razr 50 ultra (razr+ 2024 in the states) for around 6 months, and it's been my favourite smartphone yet.\n\nI find the form factor so usable and love having a small square screen as my primary \"cyber deck\" style interface. Keeps distraction down and allows me to function almost exclusively one-handedly.\n\nThere are so few compromises with this device I find it difficult to want for more... Maybe an SD slot or slightly better cameras/processor? But I'm certainly not suggesting these are issues or holding me back in the slightest. So glad I went with this over the comparatively neutered Flip 6.",
          "score": 3,
          "created_utc": 1744345061.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmiftnm",
      "author": "Fujita21",
      "body": "I'm a big fan of my 2023 Razr and plan to trade up through my carrier for one of the new ones when my contract allows. Practical and affordable phones. They are the cheapest flips on the market, I believe. I'll be looking forward to the announcement!\n\nMy biggest gripe is that the assistant WILL NOT respond to commands with the phone closed, because Google decided they didn't want it to. It used to, but it doesn't anymore. That means no voice commands if it's in my pocket. No music controls, no basic questions. As far as I'm aware, there is no way to fix this and it affects all folding phones with a \"closed\" state.\n\nI'm generally not a fan of AI, but if Motorola can create their own native AI assistant that actually does shit with the phone closed, I'm sold.",
      "score": 9,
      "created_utc": 1744345816.0,
      "replies": [
        {
          "id": "mmq9gnz",
          "author": "Djghost1133",
          "body": "Commands work fine on my 2024 razr when it's closed",
          "score": 1,
          "created_utc": 1744464257.0,
          "replies": [
            {
              "id": "mmsi12q",
              "author": "Fujita21",
              "body": "I wonder if that has to do with the 2024s having a full-function outer screen on all models. Even when closed, they may not actually have a \"closed\" state, just a different display layout and whatnot. I have the 2023 with the mini screen.",
              "score": 1,
              "created_utc": 1744490352.0,
              "replies": [
                {
                  "id": "mmsjeix",
                  "author": "Djghost1133",
                  "body": "That's likely it. I essentially have full phone functionality even when \"closed\"",
                  "score": 1,
                  "created_utc": 1744490810.0,
                  "replies": [
                    {
                      "id": "mmtevri",
                      "author": "Fujita21",
                      "body": "That's what I'm looking forward to. I thought I'd like the small screen, but it was more limited than I expected when it came to functionality. Are there any limits to what you can do with the outer screen? Do all of your apps work? I can't imagine it's much different from the same apps running split screen on the main display.",
                      "score": 1,
                      "created_utc": 1744502197.0,
                      "replies": [
                        {
                          "id": "mmtk7n7",
                          "author": "Djghost1133",
                          "body": "Basically all of my apps work but a small few don't scale properly because of the small screen so you may see ui elements cut off",
                          "score": 1,
                          "created_utc": 1744504260.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mminjdi",
      "author": "Less_Party",
      "body": "Ah, it’s our yearly reminder Motorola still exists.",
      "score": 7,
      "created_utc": 1744349808.0,
      "replies": [
        {
          "id": "mmiu4dm",
          "author": "NuPNua",
          "body": "I use their mid level phones since they have all the power I need for my use case. Great value.",
          "score": 13,
          "created_utc": 1744353598.0,
          "replies": []
        },
        {
          "id": "mmkxej1",
          "author": "RomanOTCReigns",
          "body": "https://www.business-standard.com/industry/news/indian-smartphone-market-grows-7-2-reaching-69-million-in-h1-2024-124081301141_1.html\n\nGrew 180% Year on Year in India.\n\nmaybe look outside of your bubble",
          "score": 3,
          "created_utc": 1744386475.0,
          "replies": [
            {
              "id": "mml9gpv",
              "author": "Temporary_Maybe11",
              "body": "In Brazil they are big too, I use iPhone but all my family has Motorolas",
              "score": 3,
              "created_utc": 1744390058.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmmlwpx",
          "author": "NightFuryToni",
          "body": "My ThinkPhone is holding up decently, though I still don't have 15 for it yet.",
          "score": 1,
          "created_utc": 1744404641.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmi9tn0",
      "author": "computerman10367",
      "body": "Who tf wants this ai shit?",
      "score": 11,
      "created_utc": 1744343010.0,
      "replies": [
        {
          "id": "mmj804c",
          "author": "pomcomic",
          "body": "Shareholders.",
          "score": 6,
          "created_utc": 1744362435.0,
          "replies": []
        },
        {
          "id": "mmnp3jj",
          "author": "bowiemustforgiveme",
          "body": "Data harvester companies. AI assistants are just a repackage strategy to get people to give access to their data and app controls (sometimes even root permissions).",
          "score": 2,
          "created_utc": 1744418386.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmi805q",
      "author": "None",
      "body": "Nice.. the OG got stolen from my house",
      "score": 3,
      "created_utc": 1744342197.0,
      "replies": []
    },
    {
      "id": "mmir46j",
      "author": "goldaxis",
      "body": "It already leaked that they look the same as the 2024 model.",
      "score": 2,
      "created_utc": 1744351813.0,
      "replies": [
        {
          "id": "mmomjxb",
          "author": "errosemedic",
          "body": "Externally yes. Internally no. I’ve recently been working for an authorized Motorola service center and have seen the diagnostic and repair manuals for the new phones. There’s several notable changes (from what I see in the manuals) that hopefully fix a few of the things that tend to break in other models or make them a pain in my butt to repair. Will say Lenovo did an *excellent* job creating these documents, despite having not seen one of the phone in person, I feel I could reasonably repair one in an hour. Within a dozen units I could be down to 40 minutes per unit.\n\nNo don’t worry Lenovo I’m not dumb enough to leak anything.",
          "score": 1,
          "created_utc": 1744432142.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmius2g",
      "author": "PashaB",
      "body": "My razr+ died within 6 months. Brand new 2023. I will never touch their soulless products again.",
      "score": 2,
      "created_utc": 1744354002.0,
      "replies": [
        {
          "id": "mmjxw0q",
          "author": "Sopel97",
          "body": "that's good, means it's covered under warranty",
          "score": 2,
          "created_utc": 1744375301.0,
          "replies": [
            {
              "id": "mmktm8f",
              "author": "PashaB",
              "body": "No its not. It broke within the first month and I got it warranty replaced. I paid $1000 for a new phone, and got a refurbished one within a month. Then that one broke at 6 months. The whole thing was miserable. Worst $1k spent ever.",
              "score": 1,
              "created_utc": 1744385373.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mmj7z3b",
      "author": "pomcomic",
      "body": "Man, I got a little excited riiight up until the AI part. fucks sake.",
      "score": 2,
      "created_utc": 1744362416.0,
      "replies": []
    },
    {
      "id": "mmjacv4",
      "author": "redconvict",
      "body": "I was curious thinking the tittle meant flip phones for a second but its just folding smarphones with AI. E waste.",
      "score": 2,
      "created_utc": 1744363941.0,
      "replies": []
    },
    {
      "id": "mmktk8l",
      "author": "NightFuryToni",
      "body": "Let's see if the Clicks keyboard case will still work with it.",
      "score": 2,
      "created_utc": 1744385357.0,
      "replies": []
    },
    {
      "id": "mmlctov",
      "author": "TheWillRogers",
      "body": "Man, I just want a folding semi-smart phone with a physical keypad that can be used for calls, GPS, and that's basically it.",
      "score": 2,
      "created_utc": 1744391036.0,
      "replies": []
    },
    {
      "id": "mmopnc3",
      "author": "None",
      "body": "Comin in at a hot $4,600, it’s this season’s steal!",
      "score": 2,
      "created_utc": 1744433689.0,
      "replies": []
    },
    {
      "id": "mmilvan",
      "author": "WolfySpice",
      "body": "I was a little excited until the end of the sentence.",
      "score": 1,
      "created_utc": 1744348911.0,
      "replies": []
    },
    {
      "id": "mminsdb",
      "author": "Minukaro",
      "body": "Have they fixed the greenlining? Seemed to be a somewhat common issue when I had one",
      "score": 1,
      "created_utc": 1744349944.0,
      "replies": []
    },
    {
      "id": "mmis6jq",
      "author": "CAElite",
      "body": "Cool, but can I turn it off?",
      "score": 1,
      "created_utc": 1744352434.0,
      "replies": []
    },
    {
      "id": "mmj98da",
      "author": "bottomofleith",
      "body": "\"9to5Google also noticed that at one point, the floating Razr phone spells out AI.\"  \n\nWell spotted /s",
      "score": 1,
      "created_utc": 1744363227.0,
      "replies": []
    },
    {
      "id": "mmjsen7",
      "author": "morbnowhere",
      "body": "I just wish it ddint look so generic,  I had the 1st one when it first came out in 2019 and it lasted me 5 years almost pristine because the folding protects the screen superbly and looked and felt like a bespoke item until the very end. When it went... it went though.\n\nI hope they look like the 2020 one. The AI shit is getting disabled hour 0.",
      "score": 1,
      "created_utc": 1744373121.0,
      "replies": []
    },
    {
      "id": "mmjxs6m",
      "author": "that_one_wierd_guy",
      "body": "no one wants flip phones anymore. we want, earth the final conflict style slide out phones",
      "score": 1,
      "created_utc": 1744375260.0,
      "replies": []
    },
    {
      "id": "mmk51je",
      "author": "Spare_Temporary_2964",
      "body": "Please no…..",
      "score": 1,
      "created_utc": 1744377874.0,
      "replies": []
    },
    {
      "id": "mmkd8q6",
      "author": "Im_Soo_Coy",
      "body": "I switched from Motorola to a Primeco phone. I’m out.",
      "score": 1,
      "created_utc": 1744380496.0,
      "replies": []
    },
    {
      "id": "mmkdjfq",
      "author": "Randactbjthroaway",
      "body": "Folding, yes cool more of that. Especially if it hides the camera. Ai? Nah no thanks",
      "score": 1,
      "created_utc": 1744380587.0,
      "replies": []
    },
    {
      "id": "mmkinwp",
      "author": "DThaGawd",
      "body": "I want a book style type folding phone, the size of the pixel fold 1",
      "score": 1,
      "created_utc": 1744382134.0,
      "replies": []
    },
    {
      "id": "mmkwty7",
      "author": "LetsJerkCircular",
      "body": "What would really help foldables sell is a straight up guarantee that covers repair for two years.\n\nBuying a foldable is risky. \n\nYou either roll the dice and run the risk of having to pay for a broken device, plus a replacement device, if it breaks without coverage.\n\nOr, you pay for a protection plan, and go through the claim process whenever the crease wears out or you damage it, including a potential deductible.\n\nYou’re paying to field test a young technology that’s subject to the realities of moving parts and fragile design.\n\nfoldables *need* repair/replacement guarantees, non-optionally.",
      "score": 1,
      "created_utc": 1744386311.0,
      "replies": []
    },
    {
      "id": "mmkyihu",
      "author": "monti9530",
      "body": "I just got the razr 2024 so I can get my clicks case later next month…. I little remorse but not really. Let’s see if it is worth the update",
      "score": 1,
      "created_utc": 1744386795.0,
      "replies": []
    },
    {
      "id": "mml2it6",
      "author": "Due-Aioli-6641",
      "body": "One more AI thing to not care about.\n\nAt this point I swear, this AI everything is becoming the disadvantage on products. Negative marketing",
      "score": 1,
      "created_utc": 1744387990.0,
      "replies": []
    },
    {
      "id": "mml5aet",
      "author": "Lofttroll2018",
      "body": "The phone will cost only $6,000!",
      "score": 1,
      "created_utc": 1744388815.0,
      "replies": []
    },
    {
      "id": "mmlg9r5",
      "author": "ChillAMinute",
      "body": "I had a 24 for a couple weeks but unfolded, it was too long and narrow for me. I also live in a cold weather state and was afraid if I opened it outside with the temp was under freezing I’d damage the screen. \n\nLooking forward to seeing what they release on the 24th.\n\nEdit: grammar",
      "score": 1,
      "created_utc": 1744392044.0,
      "replies": []
    },
    {
      "id": "mmlhf1z",
      "author": "No_Squirrel4806",
      "body": "All for the low low price of 2500 bucks. 😌😌😌",
      "score": 1,
      "created_utc": 1744392377.0,
      "replies": []
    },
    {
      "id": "mmm1imh",
      "author": "Wonderful-Mousse-335",
      "body": "ai? I don't want it.  \n\nthis is an easy way to save money",
      "score": 1,
      "created_utc": 1744398396.0,
      "replies": []
    },
    {
      "id": "mmmkz6m",
      "author": "SteelCanyon",
      "body": "If it ups the camera game, I'm for it. Still waiting for a Motorola phone to at least match camera quality from a Samsung, iPhone or Pixel phone of the last 3-5 years. Still loving camera quality of my Pixel 7 Pro but don't like that I need to use a launcher to get rid of immovable search bar, no option to watermark photos with a date and miss my Moto gestures for flashlight and camera. I prefer Motorola's implementation of Android versus Google.\n\nAnd whatever happened to Horizon Lock for taking video? Was on one model and disappeared? Thought that would have been the ultimate image stabilization and been copied by others but...nothing burger.",
      "score": 1,
      "created_utc": 1744404351.0,
      "replies": []
    },
    {
      "id": "mmmrmqv",
      "author": "Cay-Ro",
      "body": "I’m actually pretty fed up with smartphones. I’m tired of having all this distraction constantly available to me 24/7. I’m sick of feeling alienated from everyone around me. Sitting on a train right now and literally everyone is sitting staring at screens it feels dystopian.",
      "score": 1,
      "created_utc": 1744406474.0,
      "replies": []
    },
    {
      "id": "mmn55f9",
      "author": "fullload93",
      "body": "Motorola is about to get fucked hard when they realize no one is buying this shit. Crazy marked up prices due to tariffs and an already expensive ass folding phone = flop guaranteed. Also AI isn’t a selling point.",
      "score": 1,
      "created_utc": 1744411090.0,
      "replies": []
    },
    {
      "id": "mmn5h8l",
      "author": "beetlej3ws",
      "body": "I wish they made a new sidekick phone",
      "score": 1,
      "created_utc": 1744411211.0,
      "replies": []
    },
    {
      "id": "mmn6vf1",
      "author": "septagon7777777",
      "body": "Couldn’t any phone work Internet access use AI? What is the actual difference with the hardware?",
      "score": 1,
      "created_utc": 1744411712.0,
      "replies": []
    },
    {
      "id": "mmnrmry",
      "author": "doucheydp",
      "body": "The only reason to even consider the Razr, in my opinion, was the retro inspired design which they basically dropped immediately.  They had a chance to stand out and be visually identifiable in a crowd and instead they basically just look like a lesser version of the Z-Fold... which they basically are at this point.",
      "score": 1,
      "created_utc": 1744419353.0,
      "replies": []
    },
    {
      "id": "mmnto9n",
      "author": "mobial",
      "body": "Not for you though",
      "score": 1,
      "created_utc": 1744420131.0,
      "replies": []
    },
    {
      "id": "mmnw185",
      "author": "smaguss",
      "body": ">Worlds absolutely on the brink of a global shit storm.\n\nAll of Tech: \"hEy GuYs, YoU wAnT sUm UsElEsS aI SlOp??!\"",
      "score": 1,
      "created_utc": 1744421040.0,
      "replies": []
    },
    {
      "id": "mmnw7b0",
      "author": "Savoy_",
      "body": "Side and Kick",
      "score": 1,
      "created_utc": 1744421106.0,
      "replies": []
    },
    {
      "id": "mmnwyil",
      "author": "Gymmmy68",
      "body": "Do not buy them. I was so excited, but my razr had its screen broken in 2 months and my wife's started breaking in 5 months. Garbage phones, do not buy.",
      "score": 1,
      "created_utc": 1744421396.0,
      "replies": []
    },
    {
      "id": "mmnx5sb",
      "author": "Supermkcay",
      "body": "Interesting",
      "score": 1,
      "created_utc": 1744421473.0,
      "replies": []
    },
    {
      "id": "mmolmeo",
      "author": "errosemedic",
      "body": "There’s 2 that I know of.\n\nSource: I work at a Motorola repair facility and have seen the documents that Motorola sent us. We have the level 2 diagnostic and repair manuals. I know what the insides of these phones look like but not their tech specs.",
      "score": 1,
      "created_utc": 1744431686.0,
      "replies": []
    },
    {
      "id": "mmowc7e",
      "author": "AdSimple9239",
      "body": "Hello Moto",
      "score": 1,
      "created_utc": 1744437356.0,
      "replies": []
    },
    {
      "id": "mmpm5gq",
      "author": "Sithlordandsavior",
      "body": "Me until the last eight words: :D\n\nMe now: :(",
      "score": 1,
      "created_utc": 1744453276.0,
      "replies": []
    },
    {
      "id": "mmr1g0x",
      "author": "IAmDiGlory",
      "body": "Will it come with so much bloat for those models that it will take up 20% of disk space !? Folks are happy to download AI apps, like who cares if the device natively has it or not....",
      "score": 1,
      "created_utc": 1744473522.0,
      "replies": []
    },
    {
      "id": "mms8ndq",
      "author": "too_oh_ate",
      "body": "NO ONE gives a fuck about AI on their god damn phones, or almost anywhere.",
      "score": 1,
      "created_utc": 1744487230.0,
      "replies": []
    },
    {
      "id": "mmylem6",
      "author": "PubliusDeLaMancha",
      "body": "Ban AI and bring back 2019 razr design",
      "score": 1,
      "created_utc": 1744579245.0,
      "replies": []
    },
    {
      "id": "mn5y29t",
      "author": "Jehneepher",
      "body": "As a motorola owner. Stay far far away from them. They have no customer service, will lie to you and call you a liar. I filed a complaint with BBB",
      "score": 1,
      "created_utc": 1744681447.0,
      "replies": []
    },
    {
      "id": "mmi9iw7",
      "author": "A96",
      "body": "Folding touchscreens are super neat, but open and close them enough times and eventually it will break. Not so with classic touchscreens. Personally I drop my iPhone every day and it has yet to crack. No case, commando style. (My home button doesn’t work and they can’t fix it)",
      "score": 0,
      "created_utc": 1744342878.0,
      "replies": []
    },
    {
      "id": "mmidzoc",
      "author": "xamott",
      "body": "Didn’t Google buy Motorola like 15 years ago for their patents",
      "score": 0,
      "created_utc": 1744344922.0,
      "replies": [
        {
          "id": "mmiruzq",
          "author": "nerf___herder",
          "body": "They bought Motorola. Then they snatched up the patents they wanted and sold Motorola to Lenovo.",
          "score": 3,
          "created_utc": 1744352244.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmiu1ai",
      "author": "MS_Fume",
      "body": "Little bit of? Wth that does that mean lol",
      "score": 0,
      "created_utc": 1744353546.0,
      "replies": []
    },
    {
      "id": "mmiboz2",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1744343854.0,
      "replies": [
        {
          "id": "mmiejhc",
          "author": "Polymersion",
          "body": "Too big? The foldables? The smallest phones on the market?",
          "score": 6,
          "created_utc": 1744345193.0,
          "replies": []
        },
        {
          "id": "mminoux",
          "author": "Minukaro",
          "body": "the razr is the size of your palm when folded",
          "score": 2,
          "created_utc": 1744349891.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmjcldr",
      "author": "ineververify",
      "body": "lol this sub Reddit hates tech",
      "score": -2,
      "created_utc": 1744365310.0,
      "replies": []
    }
  ]
}