{
  "post": {
    "title": "Keyboard-packing E Ink phone aims to simplify mobile life",
    "author": "chrisdh79",
    "id": "1ihgg1u",
    "score": 355,
    "created_utc": 1738671837.0,
    "selftext": "",
    "num_comments": 78,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ihgg1u/keyboardpacking_e_ink_phone_aims_to_simplify/"
  },
  "comments": [
    {
      "id": "mawzupj",
      "author": "jbyington",
      "body": "This appeals to the “this should appeal to me, but…..” crowd",
      "score": 133,
      "created_utc": 1738674678.0,
      "replies": [
        {
          "id": "max58uo",
          "author": "2_bit_tango",
          "body": "Currently most android with eink is too far behind in security updates to trust with phone stuff. Plus, the eink screens are slow and not really meant for what people use phones for. It works great for reading in my experience, not much else. Not to mention screen fragilty most models have issues with. And price tags on the devices. So while I would be ecstatic for an eink phone, it wouldn't be able to replace my current phone, there would have to be some drastic improvements. Even as a dumb phone i'd be hesitant.",
          "score": 44,
          "created_utc": 1738676652.0,
          "replies": [
            {
              "id": "mazuzu4",
              "author": "fleemfleemfleemfleem",
              "body": "The price point is tough for what it offers. $500 is a midrange phone, not a minimalist eink phone with unupdated android. \n\nI think boox sells some tablets, including a phone-sized one that are more affordable and bridge the gap between e-reader and android tablet a lot better.",
              "score": 12,
              "created_utc": 1738705196.0,
              "replies": [
                {
                  "id": "mazvbua",
                  "author": "2_bit_tango",
                  "body": "I’ve got a boox. It’s fabulous for reading, but really isn’t great for anything else unless you go for their newer, larger screen notepad type devices.",
                  "score": 3,
                  "created_utc": 1738705292.0,
                  "replies": [
                    {
                      "id": "mazw8b8",
                      "author": "fleemfleemfleemfleem",
                      "body": "I was thinking about getting one for a minimalist writing setup/writedeck. Basically just a bluetooth keyboard and boox running google docs--\n\nI figure it would be cheaper than one of those freewrite \"digital typewriter\" things that sell for like $600.",
                      "score": 2,
                      "created_utc": 1738705552.0,
                      "replies": [
                        {
                          "id": "mb0mlmq",
                          "author": "fla_john",
                          "body": "Not much cheaper really. But then you'd have a really nice e-reader and note taking device. I have one of their 10\" color ones and like it. The color is nice, btw, but the monochrome is clearer and faster.",
                          "score": 2,
                          "created_utc": 1738713868.0,
                          "replies": [
                            {
                              "id": "mb0vdoh",
                              "author": "fleemfleemfleemfleem",
                              "body": "The boox palma looks like it runs about $200 used, so that and a $30 bluetooth keyboard. Not cheap, but the freewrites are running like $500-600 now. But as you say, more versatile.",
                              "score": 2,
                              "created_utc": 1738716793.0,
                              "replies": [
                                {
                                  "id": "mb0z54s",
                                  "author": "fla_john",
                                  "body": "Oh ok. I assumed since you were talking about using it as a typewriter that you would be looking at the larger screen. You're right, the Palma has a decent price.",
                                  "score": 1,
                                  "created_utc": 1738718006.0,
                                  "replies": [
                                    {
                                      "id": "mb3o09n",
                                      "author": "fleemfleemfleemfleem",
                                      "body": "It looks like you get a lot with the bigger tablets-- but I have a android tablet, and a kindle eink reader, so I don't really want to get into that degree of redundancy. \n\nI don't mind the small screen if it is being used as a focused writing first-draft device. The weird angle of the free-write devices would bug me though.",
                                      "score": 1,
                                      "created_utc": 1738762022.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mb0n21x",
                          "author": "TheWilburnness",
                          "body": "I bought the poke 4 lite for this purpose, works great. It’s only a 6” screen which is really my only complaint. I’d recommend going large, but I went with the one I did because it was only $140 brand new. Add a 20 dollar Bluetooth keyboard and its made a pretty good setup. Screen refresh rate is great too, if you use the fastest setting. I use the google docs app and it’s cursor probably flashes at a similar rate to an iPhone’s cursor.",
                          "score": 1,
                          "created_utc": 1738714022.0,
                          "replies": [
                            {
                              "id": "mb0w7ie",
                              "author": "fleemfleemfleemfleem",
                              "body": "I've been at the Palma. About $200 used, but it looks like the form factor and battery life would be pretty much what I'm looking for. If it doesn't work out for writing, it would at least be a good handheld ereader.  \n\nI've also tried out an alphasmart, and the viewing angle of the screen on  the freewrites just wouldn't do it for me. I'm sure I can find a keyboard with a tablet stand pretty cheap though.",
                              "score": 1,
                              "created_utc": 1738717065.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mb7fyfq",
                  "author": "Bean_Juice_Brew",
                  "body": "I use a boox note air 2 for notes and reading and it's honestly my favorite device. If they made their mini e-reader (phone proportions) with telephone capabilities, I would be buying it.",
                  "score": 1,
                  "created_utc": 1738801504.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mb1iddr",
              "author": "weaselmaster",
              "body": "Also: Fucking Uber gets a home screen spot on marketing materials?\n\nYou can fuck right off!",
              "score": 4,
              "created_utc": 1738724242.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mayqwwt",
          "author": "SsooooOriginal",
          "body": "This is a cyclical trend that gets redone every few years by some idiot that believes *they* will be the one to succeed.\n\n\nSee Punkt, Light, and the literal Minimal Phone.",
          "score": 11,
          "created_utc": 1738693766.0,
          "replies": [
            {
              "id": "mazn8m2",
              "author": "helbnd",
              "body": "Punkt lost me when they advised they had no plans for a 5G model. I'm all for using my phone as a hotspot for a larger device but not having 5G speeds is a deal breaker",
              "score": 2,
              "created_utc": 1738702976.0,
              "replies": [
                {
                  "id": "mb03eoz",
                  "author": "SsooooOriginal",
                  "body": "Would bet it was lack of revenue. These are niche devices for a niche market. I ended up on the other end, loving my galaxy notes until they put the damn curved screen and integrated battery. Was too ahead of the times and people didn't like the size until apple started their max lineup.",
                  "score": 1,
                  "created_utc": 1738707669.0,
                  "replies": [
                    {
                      "id": "mb05c3q",
                      "author": "helbnd",
                      "body": "Quite possibly which is a shame.\n\nI hear you on the Notes, I'm back on my old Note 10+ after nothing but issues with my z fold 4, I feel like the Note 3 was peak Note",
                      "score": 2,
                      "created_utc": 1738708260.0,
                      "replies": [
                        {
                          "id": "mb08fa4",
                          "author": "SsooooOriginal",
                          "body": "I agree, unfortunately we are in a place where only the whales last and the minnows claim to shoot for the moon but most are really just hoping to be bought out.\n\n\nNote 4 was peak for me. Note 7 would have been the homerun had they not integrated the explosive battery. Unfortunately battery integration is a unspoken mandate to keep our pocket spies 100% up. At least that is my tinfoil. More likely, if not also, it ensures obsoletion through a finite life of the battery. My iphone mini has 86% bat health, I am not even running it hard. Having it as a gps for long trips has been the heaviest use it has seen. The degradation is just from normal use over a few years. Meanwhile my note 9 is still a battery tank with a shitty curved screen.\n\n\nI saw the screen crease and decided to wait until that gets properly fixed.\n\n\n\n\nBut what I really miss is the OG motorola Droid. Slide out keyboard with thumb trackpad, headphone jack, low light cam, replaceable battery, beta google maps, expandable memory.",
                          "score": 1,
                          "created_utc": 1738709208.0,
                          "replies": [
                            {
                              "id": "mb09ad8",
                              "author": "helbnd",
                              "body": "Ah I skipped the 4 cause I was happy with the 3.\n\nOh man, if I could modernise any of my previous handsets the N900 would be WELL up there",
                              "score": 2,
                              "created_utc": 1738709478.0,
                              "replies": [
                                {
                                  "id": "mb0crlo",
                                  "author": "SsooooOriginal",
                                  "body": "4 was really solid. \n\n\nThat looks like a predecessor to the Droid, same form factor. Only missing the thumb trackpad. I really liked that for when the touch was acting up trying to edit text.",
                                  "score": 1,
                                  "created_utc": 1738710592.0,
                                  "replies": [
                                    {
                                      "id": "mb0ef5k",
                                      "author": "helbnd",
                                      "body": "It was amazing in it's day - I hate to think what a modern one would cost. The N9 was it's \"successor\" that dropped the physical keyboard and stylus and switched from Maemo Linux to Meego. Still a nice handset but missing a lot of what (to me) made the N900 special.\n\nI'm not sure the droid ever made it to NZ, I ran windows phone for as long as possible after the n900 haha",
                                      "score": 2,
                                      "created_utc": 1738711134.0,
                                      "replies": [
                                        {
                                          "id": "mb0ir5s",
                                          "author": "SsooooOriginal",
                                          "body": "Oh shit, it had a stylus? I missed that part, that was ahead of its time for sure.\n\n\nNever tried a windows phone, the few I knew with one absolutely loved them.",
                                          "score": 1,
                                          "created_utc": 1738712580.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "max269w",
          "author": "dwbrick",
          "body": "Truth.",
          "score": 2,
          "created_utc": 1738675545.0,
          "replies": []
        },
        {
          "id": "mayol52",
          "author": "silverbolt2000",
          "body": "The problem is that it’s too big to hold in one hand, so this “ideal phone” can’t be used as a phone.",
          "score": 2,
          "created_utc": 1738693121.0,
          "replies": [
            {
              "id": "mazc9jx",
              "author": "Less_Than-3",
              "body": "To be fair, most phones are too big to be phones in my opinion these days",
              "score": 2,
              "created_utc": 1738699785.0,
              "replies": [
                {
                  "id": "mazvgf3",
                  "author": "fleemfleemfleemfleem",
                  "body": "Even big phones now are smaller than receivers from actual telephones used to be. Those had a design that worked really well for getting the microphone close to the mouth, speaker close to the ear, and giving you a good grip.",
                  "score": 1,
                  "created_utc": 1738705327.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbeys5l",
              "author": "judokalinker",
              "body": "It's not too big to hold in one hand though...\n\nEdit.\n\nThe dimensions are 120 x 72 x 10 mm. My galaxy s21 is 151.7 x 71.2 x 7.9 mm.",
              "score": 1,
              "created_utc": 1738897703.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mawvh6q",
      "author": "durielvs",
      "body": "I really like the whole e-ink thing, but since it's basically a monopoly, the prices are too high to be justifiable.",
      "score": 53,
      "created_utc": 1738672911.0,
      "replies": [
        {
          "id": "max472u",
          "author": "Loafer75",
          "body": "I’ve wondered why e-ink display prices are high…. I would have thought they would be super cheap by now",
          "score": 21,
          "created_utc": 1738676280.0,
          "replies": [
            {
              "id": "max50js",
              "author": "narwhal_breeder",
              "body": "They are niche (compared to LCDs) and have a complex manufacturing process that’s prone to defects that can scrap the whole panel (hence why it’s not a linear increase in price as screen size goes up, just like non-linearities in cost with die size in semiconductor fabrication)\n\nVery small e-ink displays can go down to $3/unit at volume, so the patent and licensing costs can’t be a huge cost driver.",
              "score": 26,
              "created_utc": 1738676570.0,
              "replies": [
                {
                  "id": "mb0rerd",
                  "author": "Peter_Nincompoop",
                  "body": "The answer of why they’re prone to defects is because the laminate was developed by former Polaroid engineers who left to join E-Ink as a startup. You ever hit a Polaroid on its edge prior to developing? It delaminates in a similar fashion, but the laminate became more stable once the developer paste was spread through the laminate. Neither the screens, nor the undeveloped film, were intended to be handled outside of their cases, so they didn’t see it as a big issue.\n\nI know, because I worked with the same engineers at Polaroid prior to the company shutting down, and then again when I developed the distribution packaging for their 6” screens to travel from the screen plant to the customer who installs them into their devices. At the time, that was mainly Foxconn, but some manufacturers were taking smaller scale screens as well (like the Pebble watch).",
                  "score": 3,
                  "created_utc": 1738715478.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "max3pw5",
          "author": "narwhal_breeder",
          "body": "How is it a monopoly? There are dozens of E-ink manufacturers.",
          "score": 6,
          "created_utc": 1738676108.0,
          "replies": [
            {
              "id": "maxawob",
              "author": "durielvs",
              "body": "I understand that the screen technology is handled by a single company and then there are many assemblers.",
              "score": 7,
              "created_utc": 1738678626.0,
              "replies": [
                {
                  "id": "maxf9pc",
                  "author": "narwhal_breeder",
                  "body": "It’s licensed by E-Ink - the IP and trademark is licensed out, just like it is for ARM. E-Ink itself doesnt manufacture anything, it even contracts out its demo panels.\n\nThat doesn’t mean prices are artificially high. There are many firms competing to lower cost of E-Ink licensed panels. \n\nThe license costs are insignificant compared to the manufacturing costs, as evident by the very low costs of small displays.",
                  "score": 8,
                  "created_utc": 1738680080.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mb0b3d5",
      "author": "thatdudedylan",
      "body": "I can't wait to never see anything about this ever again.",
      "score": 10,
      "created_utc": 1738710048.0,
      "replies": []
    },
    {
      "id": "mawzzkz",
      "author": "pcm2a",
      "body": "Does it run doom?",
      "score": 7,
      "created_utc": 1738674731.0,
      "replies": [
        {
          "id": "max0szp",
          "author": "Minamato",
          "body": "Does anything not these days? I think my cat can run doom…",
          "score": 14,
          "created_utc": 1738675039.0,
          "replies": [
            {
              "id": "max5et4",
              "author": "challengeaccepted9",
              "body": "Not going to stick around to see how you'll boot the code into your cat's OS.",
              "score": 2,
              "created_utc": 1738676710.0,
              "replies": [
                {
                  "id": "maxnkn2",
                  "author": "Minamato",
                  "body": "It may or may not involve literal boots",
                  "score": 2,
                  "created_utc": 1738682680.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "max5ywo",
          "author": "narwhal_breeder",
          "body": "It’s running a custom android ROM so definitely",
          "score": 2,
          "created_utc": 1738676908.0,
          "replies": []
        },
        {
          "id": "max1dt4",
          "author": "euzie",
          "body": "Give it long enough and they'll put Skyrim on it",
          "score": 1,
          "created_utc": 1738675254.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mazkntn",
      "author": "santathe1",
      "body": "I just want a modern phone but with the physical design of the Nokia E7.",
      "score": 4,
      "created_utc": 1738702230.0,
      "replies": []
    },
    {
      "id": "mawyib1",
      "author": "None",
      "body": "There’s a market for this but as a secondary screen on the back side of the actual phone. This way you can use it the same way to consume content. Edit photos etc,  but when flipped it can be used as a simple distraction free ebook reader, message Notification Center, or even a cool wallpaper. \neasy to know when user is intentionally touching the back panel ebook reader cuz there’s a camera array already there. ",
      "score": 15,
      "created_utc": 1738674149.0,
      "replies": [
        {
          "id": "max3s56",
          "author": "Aesorian",
          "body": "Yeah I'd really like that as a front screen on a Foldable; seems like the perfect kind of thing for it",
          "score": 5,
          "created_utc": 1738676130.0,
          "replies": []
        },
        {
          "id": "max5s3n",
          "author": "narwhal_breeder",
          "body": "This exists. Hisense A6L.",
          "score": 2,
          "created_utc": 1738676841.0,
          "replies": [
            {
              "id": "maxk44i",
              "author": "Mobile-Yak",
              "body": "The best part is they did it back in 2020. I believe the idea has merit, implementation could be much better.",
              "score": 2,
              "created_utc": 1738681623.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mayydkd",
      "author": "shawn0fthedead",
      "body": "A lot of these phones cost half as much as a flagship phone and offer less than half the features. I know that's the point, but if you have a DIY mentality you can replicate the minimal experience with a few lockdown apps and custom launchers. ",
      "score": 3,
      "created_utc": 1738695849.0,
      "replies": []
    },
    {
      "id": "maygu2c",
      "author": "SinkCat69",
      "body": "That is super expensive. Who’s going to buy this?",
      "score": 2,
      "created_utc": 1738690987.0,
      "replies": [
        {
          "id": "mazv5jn",
          "author": "Neo_Techni",
          "body": "not me. It's like 3 times the price of the phone I'm looking at (in Canadian dollars)",
          "score": 2,
          "created_utc": 1738705242.0,
          "replies": []
        }
      ]
    },
    {
      "id": "maz9282",
      "author": "ObviouslyTriggered",
      "body": "That keyboard looks terrible, there is a reason we stack rows, we've solved QWERTY keyboards on mobile devices already....",
      "score": 2,
      "created_utc": 1738698863.0,
      "replies": []
    },
    {
      "id": "mazmedo",
      "author": "Penguinkeith",
      "body": "$500 lol no I’ll stick with my phone and kindle thank you",
      "score": 2,
      "created_utc": 1738702734.0,
      "replies": []
    },
    {
      "id": "maxcxwi",
      "author": "internetlad",
      "body": "A few years back I would have been all about this. Now not sure I can go without a camera and YouTube.",
      "score": 3,
      "created_utc": 1738679311.0,
      "replies": [
        {
          "id": "maydocp",
          "author": "JAlfredJR",
          "body": "Try [Light Phone](https://www.thelightphone.com/lightiii). It has a camera. You don't need YouTube on your phone.",
          "score": -2,
          "created_utc": 1738690108.0,
          "replies": [
            {
              "id": "mayivc9",
              "author": "internetlad",
              "body": "Appreciate the rec but not what I'm looking for. I'm primarily  looking for for privacy oriented not digital cleanse.",
              "score": 3,
              "created_utc": 1738691549.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mawvbc3",
      "author": "JefferzTheGreat",
      "body": "If this is a \"minimal\" phone, why does it have 128gb of storage, and a front facing camera?",
      "score": 4,
      "created_utc": 1738672842.0,
      "replies": [
        {
          "id": "mawwr9w",
          "author": "AwesomeWhiteDude",
          "body": "What's wrong with 128gb? You can carry a bunch of podcasts, audiobooks, and music on device.",
          "score": 5,
          "created_utc": 1738673444.0,
          "replies": [
            {
              "id": "mawxu8a",
              "author": "JefferzTheGreat",
              "body": "Isn't the point of this device to minimize distractions?",
              "score": -1,
              "created_utc": 1738673882.0,
              "replies": [
                {
                  "id": "max0j8z",
                  "author": "jsm1",
                  "body": "Well it’s not like you can really watch YouTube, TikTok, or Instagram on an e-ink screen. Most distractions would be text based, which I’d argue are somewhat better on a dopamine-reduction level. ",
                  "score": 8,
                  "created_utc": 1738674939.0,
                  "replies": []
                },
                {
                  "id": "max0nds",
                  "author": "AwesomeWhiteDude",
                  "body": "Yeah, hard to be doomscrolling tiktok, reddit, or instagram with this. Distraction free doesn't mean it cannot do anything at all.",
                  "score": 6,
                  "created_utc": 1738674981.0,
                  "replies": []
                },
                {
                  "id": "maxex27",
                  "author": "nipsen",
                  "body": "Yeah, what's up with those distracting books! False advertisement! Bad!",
                  "score": 3,
                  "created_utc": 1738679967.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mayiy2b",
      "author": "SomethingAboutUpDawg",
      "body": "As someone who is addicted to his phone, but needs it for my career and lifestyle. I would love a dumb phone with an amazing camera for capturing videos",
      "score": 2,
      "created_utc": 1738691569.0,
      "replies": [
        {
          "id": "mazjf95",
          "author": "JJMcGee83",
          "body": "I think you're probably better off getting a flip phone and a compact mirrorless camera.",
          "score": 2,
          "created_utc": 1738701870.0,
          "replies": [
            {
              "id": "mazkhq5",
              "author": "SomethingAboutUpDawg",
              "body": "Yea you’re totally right. I actually already have the mirrorless camera’s but my iPhone is just so convenient to have when in situations when having my camera on my isn’t ideal.",
              "score": 1,
              "created_utc": 1738702182.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mayg8h0",
      "author": "froyolobro",
      "body": "Right on. I have a punkt phone and this is appealing",
      "score": 1,
      "created_utc": 1738690821.0,
      "replies": []
    },
    {
      "id": "mb3oxba",
      "author": "None",
      "body": "You can set a gray tone mode in iOS under accessibility options. Then enable pressing power button three times to enable.\n\nMuch cheaper option.",
      "score": 1,
      "created_utc": 1738762363.0,
      "replies": []
    },
    {
      "id": "mb4erk8",
      "author": "dj_ski_mask",
      "body": "Remember when people had those landline phones that looked like old school rotary phones but then just had press buttons anyways? Feels like that.",
      "score": 1,
      "created_utc": 1738770619.0,
      "replies": []
    },
    {
      "id": "mbcv3cd",
      "author": "kalud12",
      "body": "This reminds me how much I miss my very first kindle, one with a physical keyboard",
      "score": 1,
      "created_utc": 1738874183.0,
      "replies": []
    },
    {
      "id": "mawu7xq",
      "author": "bigersmaler",
      "body": "I *really* love the idea of this, however I’m constantly taking and editing photos on my phone. I know it has a camera, but it’s just not going to serve that requirement well enough for me.",
      "score": 1,
      "created_utc": 1738672373.0,
      "replies": [
        {
          "id": "maxbsfg",
          "author": "thisischemistry",
          "body": "This is where the idea of all-in-one devices breaks down. At some point you stuff too much into one device and it becomes crappy at a lot of the functions. A truly minimal phone should pair well with a great camera so you don't mind carrying both devices. Do the picture-taking and editing on the camera-tablet and the phone stuff on the much more compact phone.\n\nI like the idea of a phone being a device to really only make phone calls and display some notifications and such, then if you need to do more involved things you pull out a tablet. Have the two pair together and not overlap much in functionality.",
          "score": 3,
          "created_utc": 1738678928.0,
          "replies": [
            {
              "id": "maydgcx",
              "author": "JAlfredJR",
              "body": "....that's an exhausting comment. Here [there's this](https://www.thelightphone.com/lightiii). Instead of the constant \"but ahccttaully this won't work and I'll keep being miserable\", you can try a little bit. Just saying.",
              "score": -1,
              "created_utc": 1738690047.0,
              "replies": [
                {
                  "id": "mayjahe",
                  "author": "thisischemistry",
                  "body": "Yes, there are other products that are in that space. My quibble is that they are making a device that's called \"Minimal phone\" that they purport is a minimal phone but…it's not even close to that.\n\nIf this device ticks the boxes that people want then that's a good thing but don't misrepresent what it is. It's an e-ink tablet with other functions such as cameras and a phone.\n\nThe Light Phone is *much* closer to a minimal phone than the Minimal Phone. By the way, I also think the Light Phone is far too bulky and could be trimmed down quite a bit but it certainly is a very interesting device..",
                  "score": 2,
                  "created_utc": 1738691663.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "maxkzlz",
          "author": "Rezenbekk",
          "body": "Taking and editing photos is in the same row of distractions this phone is designed to stop you from.",
          "score": 2,
          "created_utc": 1738681895.0,
          "replies": [
            {
              "id": "maywwig",
              "author": "thisischemistry",
              "body": "And yet it has both a front and rear camera with which to be distracted!",
              "score": 1,
              "created_utc": 1738695442.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "max4sq1",
      "author": "thisischemistry",
      "body": "Looks too large to be minimal, it's basically a tablet. Call me when they make one in a much smaller size.",
      "score": -1,
      "created_utc": 1738676492.0,
      "replies": [
        {
          "id": "max71ir",
          "author": "narwhal_breeder",
          "body": "Minimal as in software feature set. It’s supposed to be a good e-reader.\n\nIf you want small minimal phone, there’s plenty of dumb phones still for sale that drop the e-ink display.",
          "score": 3,
          "created_utc": 1738677286.0,
          "replies": [
            {
              "id": "maxasp4",
              "author": "thisischemistry",
              "body": "If it's minimal in software features then it probably should leave off the e-reader aspect. You can just get an e-reader for that. A minimal phone is…a phone.\n\nThis seems to be in a very odd space where it has cut down physical aspects, but still quite large. It has a simple display, but still has stuff like both a back and front camera. It has a keyboard which takes up a large amount of room, especially that huge navigation bar. Not to mention the gigantic bezels.\n\nIt seems stuck between a modern smartphone and a large e-reader tablet, I think they could have gone much further in making it minimal and then they would have had a compelling product. This is just a crappy smartphone without many of the benefits of being truly minimal.\n\nI can get behind the e-ink and keyboard parts but drop the cameras, thin the bezels, make that nav bar more part of the keyboard, drop the idea of it *also* being an e-reader. Someone who wants a true minimal phone would probably want it to be mostly a phone with a few extras rather than a e-reader with a phone tacked on.",
              "score": -1,
              "created_utc": 1738678589.0,
              "replies": [
                {
                  "id": "maxizoh",
                  "author": "narwhal_breeder",
                  "body": "Yes, they could have, but other companies already do this:  \n[https://www.thelightphone.com/lightii](https://www.thelightphone.com/lightii)\n\nThis isn't designed (obviously) for people who want the most minimal phone possible. Its designed to support a featureset the creators and their assumptive customers consider holistic. Messaging/reading/music/productivity. Its as wide as an iPhone Max, while being shorter. Not really a 7in E-Reader size. \n\nThat fits the desires of quite a few people, as evident by their kickstarter backings.",
                  "score": 2,
                  "created_utc": 1738681270.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}