{
  "post": {
    "title": "Walmart Buys Vizio to Use Its TVs as a New Way to Blast You With Ads | Walmart paid 2.3 billion USD for Vizio with its SmartCast OS along with the 19 million accounts it can advertise to.",
    "author": "chrisdh79",
    "id": "1h6e6af",
    "score": 2845,
    "created_utc": 1733312913.0,
    "selftext": "",
    "num_comments": 453,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h6e6af/walmart_buys_vizio_to_use_its_tvs_as_a_new_way_to/"
  },
  "comments": [
    {
      "id": "m0dswpr",
      "author": "theangryintern",
      "body": "All the more reason to set up something like PiHole on your home network.",
      "score": 434,
      "created_utc": 1733327323.0,
      "replies": [
        {
          "id": "m0e1nac",
          "author": "Bob_A_Feets",
          "body": "Surprised this was so far down. You wanna flip the bird to advertisers, this is the way. Don't just block the shady shit you can see, block it all!",
          "score": 116,
          "created_utc": 1733330028.0,
          "replies": [
            {
              "id": "m0e8jgx",
              "author": "theangryintern",
              "body": "Every now and then I have an issue with the pihole.  paramount+ for example will fail sometimes when starting a stream.  I have to temporarily turn off adblocking to get the stream to start.  Interestingly, it almost never shows me an add, just starts the program.",
              "score": 61,
              "created_utc": 1733332122.0,
              "replies": [
                {
                  "id": "m0f6c4t",
                  "author": "fatherofraptors",
                  "body": "That has something to do with the DNS blocklist you're using in pihole (or AGH for people like me). You can try different blocklists or just track down which DNS query gets blocked when paramount+ fails and just whitelist that one.\n\n\nIf it bothers you, of course.",
                  "score": 51,
                  "created_utc": 1733342257.0,
                  "replies": [
                    {
                      "id": "m0hgbx9",
                      "author": "MTA0",
                      "body": "Yeah, took me awhile to finally get Paramount to work. Pihole is a blessing.",
                      "score": 6,
                      "created_utc": 1733369721.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0hswm0",
                  "author": "Frostsorrow",
                  "body": "If you game, do you notice any additional latency, etc using a pihole?",
                  "score": 3,
                  "created_utc": 1733375101.0,
                  "replies": [
                    {
                      "id": "m0hv89x",
                      "author": "theangryintern",
                      "body": "no, at least not enough to make a negative impact.  Really shouldn't impact gaming because usually you connect directly to a server via IP address, so DNS shouldn't even really come into play I wouldn't think.",
                      "score": 4,
                      "created_utc": 1733376198.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0hocow",
                  "author": "baromanb",
                  "body": "Does PiHole usually block ads on all other streaming services?",
                  "score": 2,
                  "created_utc": 1733373055.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0f0tup",
              "author": "JustifytheMean",
              "body": "This doesn't work as well as it used to.  Large companies just serve the ads from their own servers, so if you block them you don't get the actual content for the service you're using.  My adguard completely broke Prime Video, YouTube still has ads, and I pay for no ads on Hulu.  It's mostly for security/privacy now not ad blocking.",
              "score": 27,
              "created_utc": 1733340605.0,
              "replies": [
                {
                  "id": "m0hqtdz",
                  "author": "Automatic-End-8256",
                  "body": "Ublock and ghostery and I get no ads on youtube or hulu",
                  "score": 5,
                  "created_utc": 1733374151.0,
                  "replies": [
                    {
                      "id": "m0i94yz",
                      "author": "NotBannedAccount419",
                      "body": "Had no idea this worked with Hulu too. Been using this combo for YouTube for a while now and works great",
                      "score": 1,
                      "created_utc": 1733383927.0,
                      "replies": []
                    },
                    {
                      "id": "m0l8z5b",
                      "author": "JustifytheMean",
                      "body": "That only works in a web browser, pihole used to be network wide ad blocking.  Web browsers usually get limited to video quality 720p or below.  https://help.hulu.com/article/hulu-supported-computers[https://help.hulu.com/article/hulu-supported-computers](https://help.hulu.com/article/hulu-supported-computers)",
                      "score": 1,
                      "created_utc": 1733428219.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0hdgoe",
                  "author": "theangryintern",
                  "body": "weird, I don't have any issues with Prime Video and I very rarely get any ads on youtube.",
                  "score": 1,
                  "created_utc": 1733368603.0,
                  "replies": [
                    {
                      "id": "m0hp53b",
                      "author": "BlitzSam",
                      "body": "For a lot of these experimental changes, companies tend to do A B testing or batch rollouts. So some users get it, some dont. Or the change can be implemented differently between users. \n\nGoogle products are particularly known for this. People reporting that their YT looked weird or broke for a couple of days then went back to normal. Unskippable and multi ads started out that way. And this kind of selective rollout makes issue reports look schizophrenic as heck",
                      "score": 3,
                      "created_utc": 1733373400.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0ho5j0",
                  "author": "baromanb",
                  "body": "Try SmartTube",
                  "score": 1,
                  "created_utc": 1733372967.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0hjs4t",
              "author": "baromanb",
              "body": "While you’re at it install SmartTube as well",
              "score": 1,
              "created_utc": 1733371107.0,
              "replies": []
            },
            {
              "id": "m0jdhvu",
              "author": "thatgreenbassguy",
              "body": "It’s now the most upvoted comment :)",
              "score": 1,
              "created_utc": 1733406745.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0egh5r",
          "author": "wallacebrf",
          "body": "EXACTLY. i do this with my rokus (the TV while smart is not connected to the network)\n\ni love seeing the blank box where ads are supposed to show. I do not see ads, and all of the tracking and telemetry never gets successfully sent back to roku so they cannot spy on me.",
          "score": 22,
          "created_utc": 1733334518.0,
          "replies": []
        },
        {
          "id": "m0fbsi5",
          "author": "None",
          "body": "[deleted]",
          "score": 11,
          "created_utc": 1733343893.0,
          "replies": [
            {
              "id": "m0fmhkw",
              "author": "theangryintern",
              "body": "Make sure to update Gravity periodically.  I'm not sure if it does it automatically, I just do it manually a couple times a month.\n\nCould also subscribe to more adlists if you find it's not blocking to your liking.",
              "score": 6,
              "created_utc": 1733347044.0,
              "replies": [
                {
                  "id": "m0ftnnd",
                  "author": "DieDae",
                  "body": "Iirc it's default is to update every Sunday.",
                  "score": 1,
                  "created_utc": 1733349142.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0gcsls",
              "author": "JclassOne",
              "body": " i wish people with these tech skills would get together and help humanity instead of serving us up on a platter to “big corporate”",
              "score": 0,
              "created_utc": 1733355398.0,
              "replies": [
                {
                  "id": "m0gn9tc",
                  "author": "URPissingMeOff",
                  "body": "Big corporate pays them a LOT of money. Humanity pays them nothing.",
                  "score": 6,
                  "created_utc": 1733359111.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0g96ty",
          "author": "Slyrunner",
          "body": "I've got an rpi just sitting there, on my shelf. I'm looking at it now.\n\nCan you give some guidance on piHole? Or point to where I can learn?",
          "score": 5,
          "created_utc": 1733354136.0,
          "replies": [
            {
              "id": "m0gburt",
              "author": "theangryintern",
              "body": "I believe I used this video:\n\nhttps://www.youtube.com/watch?v=FnFtWsZ8IP0\n\nI also set up Unbound as a recursive DNS setup (which he goes over in the video)",
              "score": 8,
              "created_utc": 1733355064.0,
              "replies": [
                {
                  "id": "m0gc02z",
                  "author": "Slyrunner",
                  "body": "Thanks homie! 🙏",
                  "score": 3,
                  "created_utc": 1733355116.0,
                  "replies": [
                    {
                      "id": "m0k2ssn",
                      "author": "magic-seaweed",
                      "body": "You should rarely use a video for these kind of installs, it might be outdated and you wasted your time or it might refer to malicious links. Just go to the official website and follow the information there.",
                      "score": 2,
                      "created_utc": 1733415303.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0i99wt",
              "author": "NotBannedAccount419",
              "body": "Dude literally same. I have a rpi someone gave me that I have no idea what to do with but would like to setup pihole",
              "score": 1,
              "created_utc": 1733384013.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0i2mo2",
          "author": "j666xxx",
          "body": "Best thing I ever did for my house",
          "score": 3,
          "created_utc": 1733380085.0,
          "replies": []
        },
        {
          "id": "m0fdygi",
          "author": "trickman01",
          "body": "Or just not connect the TV to the internet.",
          "score": 7,
          "created_utc": 1733344552.0,
          "replies": []
        },
        {
          "id": "m0iowww",
          "author": "corgi-king",
          "body": "Can I do that with router? Sorry I never use this.",
          "score": 2,
          "created_utc": 1733394400.0,
          "replies": [
            {
              "id": "m0jicrv",
              "author": "theangryintern",
              "body": "Most likely not with most standard wifi routers that you'd pick up at your local electronics store.\n\nCrosstalk Solutions on Youtube does a great video explaining what Pihole is and what it can do:\n\nhttps://www.youtube.com/watch?v=cE21YjuaB6o&t=9s&pp=ygUGcGlob2xl",
              "score": 2,
              "created_utc": 1733408553.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0iuk1a",
          "author": "Practical-Square9702",
          "body": "What’s PiHole? Sounds like something you wouldn’t want to google",
          "score": 2,
          "created_utc": 1733397946.0,
          "replies": []
        },
        {
          "id": "m0h7oz8",
          "author": "imakesawdust",
          "body": "It's just a matter of time before TVs behind PiHole don't work.  I already have to run two versions of PiHole because some Roku channels will hang if I use the default blocklist.  For example, I have to allow certain adservers in order for the PBS app to work.  It's just a matter of time before all devices start that behavior.",
          "score": 1,
          "created_utc": 1733366460.0,
          "replies": []
        },
        {
          "id": "m0ifgug",
          "author": "cr0ft",
          "body": "Yeah, I even have two separate Wifi networks, one of them can only talk to the Internet (blocked from everything else in the house) and is heavily filtered with pfBlockerNG in my case. Most devices even on that network can only talk to my Home Assistant, and not outside at all. I temporarily permit some of them to go online if I need to check for firmware. \n\nI'm sure some TV's already do, or soon will, put up giant red error boxes about not reaching the ad server unless you permit it to talk though... I'd personally take an axe to one of those and throw it out, but that's just me.",
          "score": 1,
          "created_utc": 1733388034.0,
          "replies": []
        },
        {
          "id": "m0iknhg",
          "author": "Pixie1001",
          "body": "Does pihole actually work for stuff like this though? It seems to work pretty well for popups and google ad sense stuff, but if the ads are directly embedded into the site, pihole can't differentiate them.\n\nFor example, I'm using pihole right now while typing this comment, but still getting banner ads on reddit for some car because the thumbnail is being hosted on reddit's servers. (at least I think? It's also totally possible I set something up wrong)",
          "score": 1,
          "created_utc": 1733391549.0,
          "replies": []
        },
        {
          "id": "m0i1yig",
          "author": "rome_vang",
          "body": "Why even hook up your TV (to the network) at all?",
          "score": 0,
          "created_utc": 1733379708.0,
          "replies": [
            {
              "id": "m0jiy2r",
              "author": "theangryintern",
              "body": "Well I'd guess for most people it's to be able to watch streaming services if they don't want to get a Roku or AppleTV or something like that.",
              "score": 1,
              "created_utc": 1733408765.0,
              "replies": []
            },
            {
              "id": "m0m0hmb",
              "author": "qtx",
              "body": "Because who watches normal TV?\n\nIf you want to stream you have to hook it up to the internet.\n\nAnd having a Chromecast/Roku/AppleTV still does the exact same thing as your smart TV OS and apps.",
              "score": 1,
              "created_utc": 1733436832.0,
              "replies": [
                {
                  "id": "m0mlblq",
                  "author": "rome_vang",
                  "body": "Preaching to the choir. I have smart TVs but I don’t hook them up on my network. I don’t trust TV firmware. \n\nI have mini PCs (used to be fire sticks) hooked up to them. \n\nPeople complain about ads or the other annoyances of TV OSs but there’s solutions and work arounds to that.",
                  "score": 1,
                  "created_utc": 1733444032.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0gaer0",
          "author": "TheMacMan",
          "body": "How about not buying the cheapest TV out there? Have a nice Sony TV and an Apple TV and see zero ads.",
          "score": -2,
          "created_utc": 1733354561.0,
          "replies": [
            {
              "id": "m0m0txw",
              "author": "qtx",
              "body": "Apple TV is also filled with ads. Ads for their shows.",
              "score": 1,
              "created_utc": 1733436943.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0gysdr",
          "author": "cincydude123",
          "body": "I'm new to pihole. It's an app you download and install on your TV and then it blocks ads on anything? Cable? Netflix? YouTube? I also don't have a smart tv yet...",
          "score": 0,
          "created_utc": 1733363202.0,
          "replies": [
            {
              "id": "m0hd7sq",
              "author": "theangryintern",
              "body": "No, don't think you can't install it on a TV, since those are pretty closed systems that can only install certain apps.  Most people run it on a Raspberry Pi device (hence the name Pi Hole), but it can be installed on other things.  I know my Asustor NAS has it as an app I can download, for example, so I'd guess that QNAP or Synology also has it.  Another similar product is called Adguard Home, does basically the same thing.  You could theoretically install in on your main computer, the caveat is the device running PiHole needs to run 24/7, which is why Raspberry Pi's are so popular since they are very low power devices so it doesn't cost a lot to have one running all the time.\n\nThe basics of it is it acts as a DNS Sinkhole.  The PiHole device sits on your home network and you point your Router's DNS settings to the PiHole.  That way, any device on your network has it's DNS queries go through the PiHole before going out to a public DNS server.  So if it tries to go to a known ad-serving address, the PiHole will not allow that traffic through, effectively blocking the ads.",
              "score": 2,
              "created_utc": 1733368507.0,
              "replies": [
                {
                  "id": "m0iymua",
                  "author": "cincydude123",
                  "body": "Thank you stranger",
                  "score": 2,
                  "created_utc": 1733400207.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0h2i7q",
          "author": "SpaceDandye",
          "body": "Yeah but streaming providers like Hulu are broken with it.",
          "score": -1,
          "created_utc": 1733364549.0,
          "replies": [
            {
              "id": "m0h7zkm",
              "author": "theangryintern",
              "body": "I watch Hulu all the time with no issues",
              "score": 3,
              "created_utc": 1733366566.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0dco33",
      "author": "Guy-Manuel",
      "body": "RIP Vizio. Ironically it’s the one tv I still have that isn’t a smart panel.",
      "score": 90,
      "created_utc": 1733321840.0,
      "replies": [
        {
          "id": "m0hstsq",
          "author": "bigeyez",
          "body": "The new ones are trash anyway. This year alone the TV has bricked twice because when their online services go down it completely bricks your TV if it's connected to the internet. Can't even watch antenna channels when this happens. No Vizio services will load and even disconnecting from the internet at that point doesn't fix the issue.\n\nThe OS is also just dogshit. It's constantly sluggish and prone to freezes and crashes. At least once a month or so we have to unplug it from the wall because the OS will just stop working and lock up and only a full restart will fix it. The cherry on top is no browser and no side loading apps like you can do on Samsung tvs.\n\nIt's the worst TV I've ever bought and I'll never get another Vizio again.",
          "score": 7,
          "created_utc": 1733375065.0,
          "replies": [
            {
              "id": "m0i74qc",
              "author": "skaterhaterlater",
              "body": "My newish one has worked great the past 4 or 5 years, I don’t connect it to the internet or use the os at all though",
              "score": 1,
              "created_utc": 1733382695.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0e8g7v",
          "author": "Jelly_Mac",
          "body": "We still daily 2 Vizios we bought from Costco in 2008, one plasma one LCD. Heavy but absolute tanks, with the fire sticks we just don’t really have any reason to upgrade yet",
          "score": 29,
          "created_utc": 1733332094.0,
          "replies": [
            {
              "id": "m0fdq7m",
              "author": "jewsonparade",
              "body": "You aren't \"daily\" ing them. You're using them.",
              "score": -10,
              "created_utc": 1733344483.0,
              "replies": [
                {
                  "id": "m0fkrwd",
                  "author": "MinutesFromTheMall",
                  "body": "As in…using them…daily?",
                  "score": 5,
                  "created_utc": 1733346553.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0goohw",
          "author": "LookAtTheFlowers",
          "body": "My mother gave me her Vizio that’s from at least 2011. *At least* because that was the TV I learned of Osama Bin Laden’s compound raid/death. \n\nThat was a good day",
          "score": 8,
          "created_utc": 1733359618.0,
          "replies": [
            {
              "id": "m0gqvn3",
              "author": "Guy-Manuel",
              "body": "Ok weirdo",
              "score": -2,
              "created_utc": 1733360404.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0g2swm",
          "author": "NCSUGrad2012",
          "body": "Yeah, I still have one from 2016 I like.  The updates have slowed it down but overall it works",
          "score": 1,
          "created_utc": 1733351994.0,
          "replies": []
        },
        {
          "id": "m0iy10m",
          "author": "MoirasPurpleOrb",
          "body": "Pretty much every TV can be a dumb panel if you never set it up to the internet",
          "score": 1,
          "created_utc": 1733399888.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0d8xo9",
      "author": "dirthurts",
      "body": "Yall, Vizio was already blasting you with ads. \n\nNow just Walmart gets the revenue. This is not news.",
      "score": 775,
      "created_utc": 1733320421.0,
      "replies": [
        {
          "id": "m0dovr8",
          "author": "Zetra3",
          "body": "This requires internet. My consoles does all the TV based processing, my TV has been removed from the network and sure the on light always blinks but it’s so easy to ignore.",
          "score": 207,
          "created_utc": 1733326038.0,
          "replies": [
            {
              "id": "m0dqodb",
              "author": "LilMoWithTheGimpyLeg",
              "body": "Cover it with black tape.",
              "score": 119,
              "created_utc": 1733326615.0,
              "replies": [
                {
                  "id": "m0duy93",
                  "author": "Lone_Beagle",
                  "body": "Specifically, electrical tape. Works like a charm, no light will bleed through.",
                  "score": 105,
                  "created_utc": 1733327956.0,
                  "replies": [
                    {
                      "id": "m0ec2to",
                      "author": "JustADutchRudder",
                      "body": "That's how I get those pesky check engine lights to disappear. I know its mad about an 02 sensor not being in the muffler somewhere, but the mufflers broke off at the bend after the engine so a sensor will never reappear.",
                      "score": 58,
                      "created_utc": 1733333196.0,
                      "replies": [
                        {
                          "id": "m0edfjs",
                          "author": "RapNVideoGames",
                          "body": "Lol what happens if another problem causes it to start blinking and you cants see it?",
                          "score": 13,
                          "created_utc": 1733333603.0,
                          "replies": [
                            {
                              "id": "m0ef7h6",
                              "author": "JustADutchRudder",
                              "body": "Hey man it's a 98 dodge dakota, if there isn't other problems I'd be shocked.",
                              "score": 71,
                              "created_utc": 1733334137.0,
                              "replies": [
                                {
                                  "id": "m0eog5q",
                                  "author": "Angry_Villagers",
                                  "body": "I’m impressed that it is still out there in the wild, running and driving, lol",
                                  "score": 9,
                                  "created_utc": 1733336903.0,
                                  "replies": [
                                    {
                                      "id": "m0erfb2",
                                      "author": "JustADutchRudder",
                                      "body": "150k miles only! It's been my back up daily vehicle since 2005. Currently it's on it's 4th call up to daily driver duty and it's still chugging along at about 12mpg. I'll find a shit box car to make work car again soon and truck will go back to the bullpen. It is being ate alive by rust.",
                                      "score": 13,
                                      "created_utc": 1733337792.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m0eelly",
                              "author": "None",
                              "body": "Don't worry, eventually the problem will make itself known in another way.",
                              "score": 5,
                              "created_utc": 1733333954.0,
                              "replies": [
                                {
                                  "id": "m0ej14m",
                                  "author": "PracticalDaikon169",
                                  "body": "Your not wrong.",
                                  "score": 2,
                                  "created_utc": 1733335275.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m0g0nq0",
                              "author": "Bacon4Lyf",
                              "body": "If it’s actually important, you’ll feel it, hear it, smell it, or taste it",
                              "score": 1,
                              "created_utc": 1733351307.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m0ek3a8",
                          "author": "Lone_Beagle",
                          "body": "lul, that's exactly what my dad used to do.\n\nWait...Dad?",
                          "score": 6,
                          "created_utc": 1733335598.0,
                          "replies": [
                            {
                              "id": "m0ekm3j",
                              "author": "JustADutchRudder",
                              "body": "I told you to become successful and I catch you here! During work hours!",
                              "score": 2,
                              "created_utc": 1733335757.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m0ef038",
                          "author": "Miss_Speller",
                          "body": "Naw, [you gotta let that light shine, brother!](https://www.reddit.com/r/funny/comments/6yhyth/let_it_shine/)",
                          "score": 2,
                          "created_utc": 1733334076.0,
                          "replies": []
                        },
                        {
                          "id": "m0ex2hy",
                          "author": "weasuL",
                          "body": "https://youtu.be/ddPQAJSm2cQ?si=v5d1ATszdLTTdYJP",
                          "score": 2,
                          "created_utc": 1733339479.0,
                          "replies": []
                        },
                        {
                          "id": "m1f4tkj",
                          "author": "booch",
                          "body": "> but the mufflers broke off at the bend \n\nHeh. I had that happen with my Honda back in 90-something. Going over a bridge, CLUNKCLUNK, and that was the last time I saw it.",
                          "score": 2,
                          "created_utc": 1733864715.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m0hcjop",
                      "author": "Blurgas",
                      "body": "Problem is electrical tape adhesive gets real gooey over time, can be quite the annoyance to clean up.  \nThose silicone grip stickers work just as well and doesn't leave residue",
                      "score": 1,
                      "created_utc": 1733368253.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0eckqq",
                  "author": "3-DMan",
                  "body": "*I see a red light and I want to tape it black...*",
                  "score": 15,
                  "created_utc": 1733333346.0,
                  "replies": []
                },
                {
                  "id": "m0dtr97",
                  "author": "Darklord_Bravo",
                  "body": "\\^ This. Did that with mine.",
                  "score": 13,
                  "created_utc": 1733327587.0,
                  "replies": []
                },
                {
                  "id": "m0lg9h7",
                  "author": "Kromehound",
                  "body": "I prefer flex tape.",
                  "score": 1,
                  "created_utc": 1733430514.0,
                  "replies": []
                },
                {
                  "id": "m0f718z",
                  "author": "moosefre",
                  "body": "better answer is to find a setting to turn it off, if there is none then try using tools to open the device and disable the LED. Otherwise you will get used to a standard of living where you are constantly fighting your own possessions and living an ugly life with tape everywhere. get some control over the world and learn to use a screwdriver!!!!\n\nDid this to disable the big LED ring on the back of my monitors, and to disable the speaker on an old Roomba. Don't be afraid of modifying things properly. Have some standards for appearances",
                  "score": 1,
                  "created_utc": 1733342467.0,
                  "replies": [
                    {
                      "id": "m0fl59a",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1733346660.0,
                      "replies": [
                        {
                          "id": "m0h3veg",
                          "author": "moosefre",
                          "body": "if you want to live a shitty life where you half ass every single thing you ever do and submit to an ugly world that you don't question",
                          "score": 0,
                          "created_utc": 1733365053.0,
                          "replies": [
                            {
                              "id": "m0i2mun",
                              "author": "eyekantspel",
                              "body": "Yeah I almost died the last time I had to just put a small bit of tape to cover a light. Worst thing I ever did.",
                              "score": 1,
                              "created_utc": 1733380088.0,
                              "replies": [
                                {
                                  "id": "m0iojis",
                                  "author": "moosefre",
                                  "body": "same here",
                                  "score": 0,
                                  "created_utc": 1733394153.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0ek4rr",
              "author": "PM_ME_UR_REDPANDAS",
              "body": "Same here. All streaming, etc. is done through my Xbox or a Roku stick. My TV is basically just a monitor.",
              "score": 14,
              "created_utc": 1733335611.0,
              "replies": [
                {
                  "id": "m0ekzaf",
                  "author": "libury",
                  "body": "Same here. I was putting up with the ads at first but what really pissed me off what the bandwidth Vizios eat up. Disabled it's wifi and moved to an HDMI connection. Now my network's faster and I don't have to watch dumb ads.",
                  "score": 13,
                  "created_utc": 1733335868.0,
                  "replies": [
                    {
                      "id": "m0eq1hm",
                      "author": "PM_ME_UR_REDPANDAS",
                      "body": "Yeah, I did it for privacy reasons. I don’t need my TV collecting data about what I watch and sending it back to its servers.",
                      "score": 1,
                      "created_utc": 1733337380.0,
                      "replies": [
                        {
                          "id": "m0ezyll",
                          "author": "Zetra3",
                          "body": "This, I'm not subsidizing the cost of the TV (specially for such low cost hardware) with my data",
                          "score": 2,
                          "created_utc": 1733340347.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0hgyd2",
                  "author": "taimusrs",
                  "body": "Smart TV fucking sucks man. It's such a shame that we all waste money for a 'computer' in our TV that nobody wanted to use",
                  "score": 3,
                  "created_utc": 1733369966.0,
                  "replies": []
                },
                {
                  "id": "m0fx7bn",
                  "author": "Mackotron",
                  "body": "Ok, now microsoft is blasting us with ads on the Xbox home screen. Whoop-de-do.",
                  "score": 1,
                  "created_utc": 1733350224.0,
                  "replies": [
                    {
                      "id": "m0lgfuv",
                      "author": "TingleyStorm",
                      "body": "I have yet to see an ad on my Home Screen that doesn’t directly relate to new GamePass games.\n\nThen again I use it strictly for gaming and even deleted any app that isn’t related.",
                      "score": 1,
                      "created_utc": 1733430570.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0ehw1e",
              "author": "None",
              "body": "Wait. Vizio TVs blink the on light now when they aren't connected to a network? I have a few Vizio TVs as cheap secondary screens in certain areas, and mine don't and they've never been connected to a network.",
              "score": 8,
              "created_utc": 1733334936.0,
              "replies": [
                {
                  "id": "m0eifql",
                  "author": "Zetra3",
                  "body": "No clue, enough seem to that people gave me recommendations to block the light",
                  "score": 3,
                  "created_utc": 1733335099.0,
                  "replies": []
                },
                {
                  "id": "m0gcx14",
                  "author": "Oddjob64",
                  "body": "TCL does. Not sure about Vizio",
                  "score": 3,
                  "created_utc": 1733355441.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0esdt2",
              "author": "Katorya",
              "body": "You also have a Roku / TCL tv. I have mine connected to my guest network but with internet blocked in my router settings and the light doesn’t blink",
              "score": 3,
              "created_utc": 1733338080.0,
              "replies": []
            },
            {
              "id": "m0fmgb7",
              "author": "thenewaretelio",
              "body": "This. None of my ‘smart tvs’ are connected to the internet.",
              "score": 1,
              "created_utc": 1733347033.0,
              "replies": []
            },
            {
              "id": "m0gc93p",
              "author": "cHaNgEuSeRnAmE102",
              "body": "Vizio TV’s require internet to even use them lol. I have one sadly.",
              "score": 1,
              "created_utc": 1733355204.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0dtpwe",
          "author": "Pauly_Amorous",
          "body": "Is there any TV these days that doesn't? My LG OLED devotes the top half of the home screen just to show video ads. (You can disable them, but then that area of the screen just sits there unused.)",
          "score": 44,
          "created_utc": 1733327575.0,
          "replies": [
            {
              "id": "m0eewbi",
              "author": "None",
              "body": "I swear it's just like something out of Idiocracy. \n\nSo many damn ads playing at the edges of the screen, only to break in the middle of the video with another ad.",
              "score": 33,
              "created_utc": 1733334044.0,
              "replies": [
                {
                  "id": "m0fhzeq",
                  "author": "Dark_Alchemist",
                  "body": "We interrupt this commercial with another commercial.  Back to our regularly scheduled commercials after these few moments.",
                  "score": 5,
                  "created_utc": 1733345737.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0en1wf",
              "author": "Warning_Low_Battery",
              "body": "Reset the tv to factory default, never connect it to the internet. Worked for my LG but that was a 2021 model.",
              "score": 10,
              "created_utc": 1733336487.0,
              "replies": []
            },
            {
              "id": "m0ev2yp",
              "author": "Curtis_Low",
              "body": "I use my Roku or PS5 for apps.  Never connected my tv to my network, so never seen an ad like described.",
              "score": 6,
              "created_utc": 1733338882.0,
              "replies": []
            },
            {
              "id": "m0fcqow",
              "author": "throwaway3270a",
              "body": "Yeah and they're moving into the pc monitor market as well. I wish I was joking.",
              "score": 3,
              "created_utc": 1733344179.0,
              "replies": []
            },
            {
              "id": "m0h4tu6",
              "author": "aaahhhhhhfine",
              "body": "Why use the built in apps? Just get a Chromecast or whatever and leave your TV offline.",
              "score": 5,
              "created_utc": 1733365404.0,
              "replies": []
            },
            {
              "id": "m0hcfcx",
              "author": "ghostfreckle611",
              "body": "Don’t connect tv to internet.\n\nUse another device tied to one input.",
              "score": 3,
              "created_utc": 1733368206.0,
              "replies": []
            },
            {
              "id": "m0i29t7",
              "author": "btgeekboy",
              "body": "The LG won’t if you just stop using the home screen. Ours just shows the Apple TV interface from power on to power off. I think the TV has apps, but I have no idea which ones.",
              "score": 3,
              "created_utc": 1733379886.0,
              "replies": []
            },
            {
              "id": "m0ej4mj",
              "author": "justanothersurly",
              "body": "My Samsung Frame doesnt have any ads.",
              "score": 5,
              "created_utc": 1733335305.0,
              "replies": []
            },
            {
              "id": "m0fo1n8",
              "author": "WolfieVonD",
              "body": "There's a reason that you can get a $15,000 TV for around $350 nowadays.",
              "score": 1,
              "created_utc": 1733347498.0,
              "replies": []
            },
            {
              "id": "m0ghhui",
              "author": "The__Amorphous",
              "body": "I use Android TV with a custom launcher (Projectivy right now). No ads, customizable, etc.",
              "score": 1,
              "created_utc": 1733357050.0,
              "replies": []
            },
            {
              "id": "m0e5jnf",
              "author": "comcastsupport800",
              "body": "My Samsung S90C doesn't show any ads",
              "score": 1,
              "created_utc": 1733331210.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0dz7un",
          "author": "GrayDaysGoAway",
          "body": "They can always blast you with *more* ads, though. And I guaran-fucking-tee you Walmart will do exactly that.",
          "score": 17,
          "created_utc": 1733329282.0,
          "replies": [
            {
              "id": "m0ev8n2",
              "author": "Curtis_Low",
              "body": "Don't have your TV connected to your network and it isn't an issue.  Stream through something like a roku.",
              "score": 8,
              "created_utc": 1733338929.0,
              "replies": [
                {
                  "id": "m0fhhvy",
                  "author": "lkeels",
                  "body": "Like Roku doesn't show ads on every menu page.",
                  "score": 9,
                  "created_utc": 1733345596.0,
                  "replies": [
                    {
                      "id": "m0fi052",
                      "author": "Curtis_Low",
                      "body": "Mine just has the app tiles, if there are ads (I will look tomorrow when I get home) I can say I never noticed them.",
                      "score": 1,
                      "created_utc": 1733345743.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0gb5wg",
                  "author": "hannahbay",
                  "body": "My Vizio is not connected to my network and it still causes issues. I almost exclusively watch TV on my Apple TV on HDMI 1. Every time the TV restarts, it tries to connect to the Smartcast by default. Even though I turned it off on HDMI 1. It spends a full 30 seconds trying to get something to load, during which the TV is unusable and does not respond to switching inputs. \n\nI finally programmed my Apple TV to switch to a screen saver and never turn off. That's how annoyed at it I was. \n\nAlso I bought a new TV.",
                  "score": 3,
                  "created_utc": 1733354825.0,
                  "replies": []
                },
                {
                  "id": "m0evw2d",
                  "author": "GrayDaysGoAway",
                  "body": "That's definitely an option. But I don't want to spend extra money for a 3rd party solution and have yet another remote sitting around if it can be avoided.",
                  "score": 1,
                  "created_utc": 1733339125.0,
                  "replies": [
                    {
                      "id": "m0ewbqo",
                      "author": "Curtis_Low",
                      "body": "Yea, I think my roku was like $40 but I am so used to it at this point it is what it is.  I would use my PS5 for everything except they don't offer / allow the F1 app.  That is honestly all I use Roku for now.",
                      "score": 0,
                      "created_utc": 1733339256.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0gl60t",
                  "author": "URPissingMeOff",
                  "body": "Not necessarily. Tivo boxes have had the ability to record promotional videos off a cable channel at preset times for a couple of decades. They would buy ultra cheap air time for their ads on crappy channels that no one watched at around 2 or 3 am, record them, and play them back when you were watching a recorded show.",
                  "score": 1,
                  "created_utc": 1733358359.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0gdeyg",
              "author": "Wloak",
              "body": "That's not really the play here. \n\nI build advertising products that span TV, web, mobile, and in person.. the data about you is what they want, not to show more ads but ads more likely to get you to buy things. \n\nWalmart is the fastest growing ad platform over the past few years because they can tie your online shopping to in person shopping and what sites you're browsing at times (Walmart runs ads not for themselves but other companies all over the Internet). Now they also will have direct access to what TV is being watched in your household. \n\nWhy this is a big benefit for them: you search for something and go to a website with their ad tracker on it, their ad platform know nows you're looking at fridges. Through their ad platform they can now show you ads for fridges across their websites, 3rd party sites, and ads on your smart TV. If you buy from Walmart they can tie it back to a specific commercial for a brand that got you to buy it.",
              "score": 1,
              "created_utc": 1733355616.0,
              "replies": [
                {
                  "id": "m0la57p",
                  "author": "GrayDaysGoAway",
                  "body": "In my experience walmart always wants to have their cake and eat it too. So sure, they might be doing this primarily for the advertising synergy across platforms. But they'll also gladly pump up the number of ads to produce more of the data they're looking for.",
                  "score": 1,
                  "created_utc": 1733428581.0,
                  "replies": [
                    {
                      "id": "m0lj5zx",
                      "author": "Wloak",
                      "body": "That's a risky gambit since there are other TV brands with competitive pricing. Vizio used to be the dominant low cost TV but you can get a Philips or Samsung 40\" for $200 these days.",
                      "score": 1,
                      "created_utc": 1733431430.0,
                      "replies": [
                        {
                          "id": "m0lljlb",
                          "author": "GrayDaysGoAway",
                          "body": "The thing is those others are far worse about shoving ads in your face. Philips and Samsung were two of the earliest to jump on the TV menu ads bandwagon, and remain probably the most egregious offenders on that front. Vizio can cram a lot more ads into their stuff before they get on that level.",
                          "score": 1,
                          "created_utc": 1733432158.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0dpbbt",
          "author": "cjcs",
          "body": "They also sell your ad impression data to data brokers",
          "score": 21,
          "created_utc": 1733326176.0,
          "replies": []
        },
        {
          "id": "m0g9304",
          "author": "Fredasa",
          "body": "I was hoping it would at last inspire into being a TV firmware scene, whose absence I've whined about for many years.  And that perhaps said scene would bleed over to Samsung models so that the best TVs on the market (QD-OLED) could be given the firmware that they deserve, rather than the worst, most restrictive firmware on the market.",
          "score": 4,
          "created_utc": 1733354099.0,
          "replies": []
        },
        {
          "id": "m0du4fw",
          "author": "Butt_Hurt_Toast",
          "body": "Love my Visio for its display but fuck the adds are goddamn awful on it",
          "score": 5,
          "created_utc": 1733327701.0,
          "replies": [
            {
              "id": "m0ee2rp",
              "author": "chum_slice",
              "body": "Can I just plug in an Apple TV or an Xbox and circumvent the TV OS? Is this doable?",
              "score": 9,
              "created_utc": 1733333797.0,
              "replies": [
                {
                  "id": "m0emuy8",
                  "author": "PM_ME_UR_REDPANDAS",
                  "body": "Yes, you absolutely can. I’ve been doing this exact thing and haven’t connected my TV to WiFi for years.\n\nI have 2 ways to get streaming on my primary TV.\n\nI have all my apps on my Xbox, and I have a Roku stick as well. Sometimes some apps are a bit of a pain to navigate with the Xbox controller, so I just switch over to the Roku if I get frustrated, lol. An Apple TV will work as well.\n\nSo many apps are available on multiple platforms that it’s just a matter of making sure all your apps are available on a given platform.",
                  "score": 8,
                  "created_utc": 1733336430.0,
                  "replies": []
                },
                {
                  "id": "m0i7xy2",
                  "author": "Raistlarn",
                  "body": "Yes.  I have my computer hooked up to my \"smart\" TV.  I keep my TV off the net by never making an account and never receive ads.",
                  "score": 2,
                  "created_utc": 1733383188.0,
                  "replies": []
                },
                {
                  "id": "m0eegs6",
                  "author": "Butt_Hurt_Toast",
                  "body": "You can, and you can set it to never go to the tv os, but you have to go to the TV os to access the apps using the TV. I don’t want to use an Xbox for it, and only want to have 1 remote so I guess clicking off the stupid pop is the price I pay.",
                  "score": 1,
                  "created_utc": 1733333914.0,
                  "replies": [
                    {
                      "id": "m0eh7o8",
                      "author": "MrSinister248",
                      "body": "Buy the xbox media remote. One of them has universal functionality to control your tv's baaic functions. They're pretty cheap.",
                      "score": 3,
                      "created_utc": 1733334737.0,
                      "replies": []
                    },
                    {
                      "id": "m0egmea",
                      "author": "chum_slice",
                      "body": "Got it thanks. Been in the market for a new TV and couldn’t find any info. A friend said he has to first be in the TVos and then select the source on his TCL.",
                      "score": 1,
                      "created_utc": 1733334561.0,
                      "replies": [
                        {
                          "id": "m0glw54",
                          "author": "FireLucid",
                          "body": "Google Chromecast with TV or whatever it is called now has a remote. It has a universal function that lets you control the volume and turn the TV on. So hit power, choose streaming app and away you go. Don't even see the TV OS.\n\nI'm sure others can do similar, like apple or Roku which seems a popular US choice.\n\nAny new TV should have HDMI CEC which basically means if you wake up something in HDMI port 1, the TV will turn on and switch to that input. So if you hit the controller on your game console, boom TV on and switched to game input.\n\nMake a list of features you want and see what is in your price range. If buying at a store, you might be able to get them bundle in a soundbar and streaming device for cheaper?",
                          "score": 1,
                          "created_utc": 1733358620.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0envbl",
          "author": "CatWeekends",
          "body": "I think it's not just the revenue. It's that the world's largest retailer gets that revenue *and* your TV habits *and* any extra data \"accidentally\" acquired through microphones/cameras.\n\nIt feels a whole lot like when Amazon started putting microphones in everyone's homes.",
          "score": 4,
          "created_utc": 1733336731.0,
          "replies": [
            {
              "id": "m0euuyq",
              "author": "dirthurts",
              "body": "They could get that data anyway if they wanted it. Every company sells your data. It's up for sell to these big corps at any moment. Now they just don't have to get billed for it.",
              "score": 4,
              "created_utc": 1733338816.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0ffb93",
          "author": "JC_Hysteria",
          "body": "Eh, if they had a large chunk of market share, it would be similar to the antitrust suit against MS Windows…\n\nIt’s about the marriage of data.",
          "score": 2,
          "created_utc": 1733344954.0,
          "replies": []
        },
        {
          "id": "m0fklxh",
          "author": "Zylonite134",
          "body": "They can block some features if not connected to the internet. My Vizio TV didn’t function with CEC on a Roku remote until I enabled the internet connection on the TV.",
          "score": 1,
          "created_utc": 1733346504.0,
          "replies": []
        },
        {
          "id": "m0g1205",
          "author": "ProfessorPetrus",
          "body": "That's how you get the internet turned off TV!",
          "score": 1,
          "created_utc": 1733351432.0,
          "replies": []
        },
        {
          "id": "m0gd4zf",
          "author": "Edmundyoulittle",
          "body": "Can confirm that my old Vizio TV was updated into literal dogshit some time a couple years ago",
          "score": 1,
          "created_utc": 1733355519.0,
          "replies": []
        },
        {
          "id": "m0gzvhq",
          "author": "sth128",
          "body": "> This is not news.\n\nBut you know what is news? Greedy CEO getting shot dead in daylight.",
          "score": 1,
          "created_utc": 1733363586.0,
          "replies": [
            {
              "id": "m0h90k9",
              "author": "dirthurts",
              "body": "Ok...?",
              "score": 1,
              "created_utc": 1733366940.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0i6yar",
          "author": "lookyloolookingatyou",
          "body": "I primarily watch tv through the vizio free channels and I frequently find myself thinking how it is a massive improvement over free tv from the old analog days. The commercial breaks are timed, the selection is way more vast, the picture quality and sound is far more clear. All of the content is from 15 years ago but I'm a millennial so its comforting.",
          "score": 1,
          "created_utc": 1733382589.0,
          "replies": []
        },
        {
          "id": "m0ioqgf",
          "author": "corgi-king",
          "body": "Not for me, it is blocked in my router.",
          "score": 1,
          "created_utc": 1733394282.0,
          "replies": []
        },
        {
          "id": "m0gucdk",
          "author": "cat_prophecy",
          "body": "There is a reason why that 65\" TV costs less than $1000.",
          "score": 1,
          "created_utc": 1733361633.0,
          "replies": [
            {
              "id": "m0h91t0",
              "author": "dirthurts",
              "body": "Ok...?",
              "score": 2,
              "created_utc": 1733366953.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0cyenh",
      "author": "Plz_PM_Steam_Keys",
      "body": "I update the tv then disconnect it from the internet and like 6 months - 1 year later check for new updates. Repeat",
      "score": 181,
      "created_utc": 1733316038.0,
      "replies": [
        {
          "id": "m0d8px4",
          "author": "Webfarer",
          "body": "I have a TCL that I have never connected to internet. Its only function is to display whatever it receives via hdmi.",
          "score": 143,
          "created_utc": 1733320337.0,
          "replies": [
            {
              "id": "m0df4jr",
              "author": "QuestionablePanda22",
              "body": "What a crazy idea, they should make smart tvs without apps or internet that just......uh work as a tv",
              "score": 83,
              "created_utc": 1733322737.0,
              "replies": [
                {
                  "id": "m0dgpxm",
                  "author": "emanresu_b",
                  "body": "Zenith: “You rang?”",
                  "score": 17,
                  "created_utc": 1733323306.0,
                  "replies": [
                    {
                      "id": "m0dk0vm",
                      "author": "TripleSecretSquirrel",
                      "body": "Do they even make TVs still? Their website looks like they do software and R&D only now.",
                      "score": 4,
                      "created_utc": 1733324431.0,
                      "replies": [
                        {
                          "id": "m0dk9vm",
                          "author": "emanresu_b",
                          "body": "Nah. LG bought them in bankruptcy back in the day.",
                          "score": 8,
                          "created_utc": 1733324516.0,
                          "replies": [
                            {
                              "id": "m0fb09x",
                              "author": "jeepsterjk",
                              "body": "They need to bring back this brand in some way. They had the most metal logo lol🤘",
                              "score": 4,
                              "created_utc": 1733343657.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0dswg4",
                  "author": "daOyster",
                  "body": "They still make them, they're called dumb TV's now and unless you want ones that barely pass quality control or just have a decent sound/picture quality they usually cost 2-3x the price since their technology isn't being subsidized by their ability to serve you ads and send back information on your viewing habits.\n\n\nBest Buy even has a filter for them if you're shopping on their website.",
                  "score": 36,
                  "created_utc": 1733327320.0,
                  "replies": [
                    {
                      "id": "m0eweu5",
                      "author": "theninal",
                      "body": "The subsidizing take is kinda garbage too, imho. I bought a $2000 high quality smart tv. First thing that came up after getting it on at home? Ads in the menu and restrictions on features unless I remained connected to the internet. That doesn't sound subsidized. That sounds like a hostage situation. \n\nDumb TV's are going to be overpriced to push us into buying smart TV's. It's a penalty.",
                      "score": 22,
                      "created_utc": 1733339282.0,
                      "replies": [
                        {
                          "id": "m0f55xv",
                          "author": "PersonalAd8831",
                          "body": "Damn. What kind of features get restricted?",
                          "score": 2,
                          "created_utc": 1733341910.0,
                          "replies": [
                            {
                              "id": "m0fceo4",
                              "author": "100GbE",
                              "body": "Internet access.",
                              "score": 3,
                              "created_utc": 1733344078.0,
                              "replies": []
                            },
                            {
                              "id": "m0hzogm",
                              "author": "theninal",
                              "body": "Ambient scene lighting is one off the top of my head. It's been so long since I worried about it I couldn't say what the rest was.",
                              "score": 2,
                              "created_utc": 1733378468.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m0g3703",
                          "author": "sovereign666",
                          "body": "your experience doesnt mean that advertisers aren't subsidizing the sticker price of TV's, because they are. \n\nYour experience just means you got duped into paying $2k for one.\n\nAdvertisers at this point are near subsidizing your entire experience with technology.",
                          "score": 2,
                          "created_utc": 1733352121.0,
                          "replies": []
                        },
                        {
                          "id": "m0iyewr",
                          "author": "MoirasPurpleOrb",
                          "body": "It’s still subsidized, TVs are far cheaper now than they ever were in our history. One of the few things that’s actually beating inflation.\n\nThe trick is you just never connect it to the internet, ever, even at first setup.",
                          "score": 1,
                          "created_utc": 1733400091.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m0fc0b1",
                      "author": "100GbE",
                      "body": "My viewing habits are:\n\n\n- HDMI1",
                      "score": 12,
                      "created_utc": 1733343958.0,
                      "replies": [
                        {
                          "id": "m0h89zm",
                          "author": "thrownawaymane",
                          "body": "TVs can tell what you watch/play over HDMI now...",
                          "score": 1,
                          "created_utc": 1733366671.0,
                          "replies": []
                        },
                        {
                          "id": "m0nw9e3",
                          "author": "fatdjsin",
                          "body": "you watch the same shit i do !",
                          "score": 1,
                          "created_utc": 1733461764.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m0fhinl",
                      "author": "TheHolyFamily",
                      "body": "I bought a 40\" insignia dumb TV for like $140 at best buy. Its a great TV with decent speakers wasn't that expensive in my opinion.",
                      "score": 1,
                      "created_utc": 1733345602.0,
                      "replies": []
                    },
                    {
                      "id": "m0gnxh7",
                      "author": "URPissingMeOff",
                      "body": "Nobody sane is relying on the built-in sound system of a TV. They are always horrible garbage built to a price point and to fit a very small footprint. Even a $100 sound bar will perform better. Legit home theater gear will sound an order of magnitude better.",
                      "score": 1,
                      "created_utc": 1733359347.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0dk5wb",
                  "author": "StarsMine",
                  "body": "They do, its called digital signage",
                  "score": 8,
                  "created_utc": 1733324479.0,
                  "replies": []
                },
                {
                  "id": "m0ecldd",
                  "author": "AlphaTangoFoxtrt",
                  "body": "It'll cost more.\n\nThe fact is these ads are being used to subsidize costs. If you don't like it just quarantine your TV from the internet, or don't connect it to wi-fi.\n\nGo comparison shop, smart TVs are cheaper than dumb TVs. But if you never connect it to the internet it's still a dumb TV.",
                  "score": 5,
                  "created_utc": 1733333351.0,
                  "replies": []
                },
                {
                  "id": "m0g2xb9",
                  "author": "sovereign666",
                  "body": "hotel/hospitality tv's",
                  "score": 1,
                  "created_utc": 1733352035.0,
                  "replies": []
                },
                {
                  "id": "m0dyuyz",
                  "author": "None",
                  "body": "Sort of like…a phone??? 😂",
                  "score": -3,
                  "created_utc": 1733329173.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0djnng",
              "author": "TripleSecretSquirrel",
              "body": "That’s what I do too, but as further reason to do that, Roku (TCL makes Roku’s TVs) recently filed a patent for a tech that enables them to splash an ad over anything your tv is displaying. \n\nIf you have a dvd player plugged in and hit pause, it detects that your video is paused, then pipes in an ad. \n\nSo, A, never buying a Roku device ever again, *especially* one of their TVs, and B, like you said, never connecting my TV to the internet.",
              "score": 28,
              "created_utc": 1733324308.0,
              "replies": [
                {
                  "id": "m0e7i8y",
                  "author": "Ryase_Sand",
                  "body": "That's wild lol and yet not at all surprising. They're constantly finding new ways to cram in more ads. I'd say it's genius if it wasn't so obnoxious.",
                  "score": 6,
                  "created_utc": 1733331805.0,
                  "replies": []
                },
                {
                  "id": "m0efof5",
                  "author": "wallacebrf",
                  "body": "that is why i block all of roku's ads at the network level so everywhere an ad is supposed to be is a large blank box.... LOVE IT. roku can still update the OS, the roku channel still works, youtube, amazon, youtube still work ect.... just ads and tracking are blocked at the network level",
                  "score": 6,
                  "created_utc": 1733334279.0,
                  "replies": [
                    {
                      "id": "m0fkajx",
                      "author": "BWCDD4",
                      "body": "Iirc Roku devices and apps use DoH(dns over https) to try circumvent network/dns redirection/blocking. \n\nIt can be dealt with as long as you don’t use Google as your upstream DNS provider as that’s who’s DoH Roku are using.",
                      "score": 2,
                      "created_utc": 1733346412.0,
                      "replies": [
                        {
                          "id": "m0fvrzh",
                          "author": "wallacebrf",
                          "body": "For me, I do not use a pie hole directly, I use my fortigate router which has a web filter. This uses SSL certificate inspections and can get the domain name from the cert and it can block all access that way so I can still filter DoH. My fortunate uses piehole block lists to perform this work.",
                          "score": 2,
                          "created_utc": 1733349782.0,
                          "replies": [
                            {
                              "id": "m0h8l6j",
                              "author": "thrownawaymane",
                              "body": "Look at this guy with a Fortigate at home. \n\nMake sure your Fortimanager is up to date.",
                              "score": 1,
                              "created_utc": 1733366783.0,
                              "replies": [
                                {
                                  "id": "m0h98j8",
                                  "author": "wallacebrf",
                                  "body": "Don't have a fortimanager",
                                  "score": 1,
                                  "created_utc": 1733367021.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m0fwda5",
                          "author": "wallacebrf",
                          "body": "Forgot to add, I have my rokus in a dedicated VLAN and that VLAN has DoH disabled so the rokus are forced to fall back to standard port 53 unen encrypted DNS allowing DSN filtering if I choose.",
                          "score": 2,
                          "created_utc": 1733349966.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0egexu",
                  "author": "Catenane",
                  "body": "My roku TV hasn't been allowed on the internet for a year or so now. This was just a cheap hisense with roku built in, but I won't be buying anything roku in the future. Their HDMI-hijacking patent application is just the doodoo softserve on top of the shit soufflé that is roku. \n\nEver tried sideloading an application? Like jellyfin and the 3 other projects that build for roku? Oh you can load one single application at a time temporarily, but it's also in a language no one targets and is aptly named \"BS\" in shortform (brightscript). Oh, and you have to upload it as a zip file to the web UI or with HTTP POSTs.\n\nFuck roku lmfao",
                  "score": 3,
                  "created_utc": 1733334499.0,
                  "replies": [
                    {
                      "id": "m0f73vz",
                      "author": "SweetCosmicPope",
                      "body": "They've also recently made it where their TVs are REQUIRED to be online.  My roku tv in my office got that update, and if it's not online, it won't even let you past an error screen until you fix the connection.",
                      "score": 3,
                      "created_utc": 1733342489.0,
                      "replies": [
                        {
                          "id": "m0gp2z0",
                          "author": "URPissingMeOff",
                          "body": "If that isn't prominently displayed on the box and in their advertising, that's grounds for a huge class action.",
                          "score": 4,
                          "created_utc": 1733359764.0,
                          "replies": [
                            {
                              "id": "m0k5try",
                              "author": "1Seti24",
                              "body": "Great username 👍🏻",
                              "score": 2,
                              "created_utc": 1733416242.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m0f75i2",
                      "author": "SweetCosmicPope",
                      "body": "They've also recently made it where their TVs are REQUIRED to be online.  My roku tv in my office got that update, and if it's not online, it won't even let you past an error screen until you fix the connection.",
                      "score": 3,
                      "created_utc": 1733342502.0,
                      "replies": [
                        {
                          "id": "m0g9gd1",
                          "author": "Catenane",
                          "body": "Oh fucking seriously? When was this?",
                          "score": 1,
                          "created_utc": 1733354228.0,
                          "replies": [
                            {
                              "id": "m0gbh3p",
                              "author": "SweetCosmicPope",
                              "body": "Not sure.  I’d heard about it around a year ago but only noticed it on mine recently.",
                              "score": 2,
                              "created_utc": 1733354934.0,
                              "replies": [
                                {
                                  "id": "m0gd5mg",
                                  "author": "Catenane",
                                  "body": "Damn, that sucks. Can you factory reset to get back to a lower version? Thks is exactly the reason I neutered it a year or two back...and I'm glad I have the validation to show my wife that my craziness is warranted. (At least in this case, lmao)",
                                  "score": 1,
                                  "created_utc": 1733355525.0,
                                  "replies": [
                                    {
                                      "id": "m0geyhp",
                                      "author": "SweetCosmicPope",
                                      "body": "I don’t believe you can.  Maybe reflash the OS but I haven’t looked into it.",
                                      "score": 1,
                                      "created_utc": 1733356158.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m0gmjqu",
                          "author": "FireLucid",
                          "body": "Lol, I'd be returning mine to the store",
                          "score": 1,
                          "created_utc": 1733358852.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0ff59f",
                  "author": "ZonaiSwirls",
                  "body": "Nobody ever recommends Chromecast. I've been using Chromecast for 10 years now and I love it.",
                  "score": 1,
                  "created_utc": 1733344905.0,
                  "replies": [
                    {
                      "id": "m0gmmzl",
                      "author": "FireLucid",
                      "body": "I got the one with the remote! My wife loved it so much she bought them for all our TV's even though we rarely use them, lol.",
                      "score": 1,
                      "created_utc": 1733358884.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0e5w13",
              "author": "Wolfram_And_Hart",
              "body": "My FireTV used to do that. They took the option away. I’m thinking of trying to hack it before I buy a Sony",
              "score": 2,
              "created_utc": 1733331313.0,
              "replies": []
            },
            {
              "id": "m0dlpbl",
              "author": "Horzzo",
              "body": "I don't think I've ever connected any tv to the internet. Anything it ever would need comes from the PC.",
              "score": 3,
              "created_utc": 1733324996.0,
              "replies": [
                {
                  "id": "m0e9yf3",
                  "author": "Chosen1PR",
                  "body": "Okay but your average Joe ain’t connecting a whole-ass desktop PC to their TV. At best, they’re using a separate streaming device. And other than maybe the Apple TV, they’re all infested with ads.",
                  "score": 3,
                  "created_utc": 1733332554.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0d9zry",
          "author": "None",
          "body": "I do the same with my Samsung. Based on the way these people invade privacy that seems the most reasonable. \n\nBut they can just collect information and upload it during that one update.",
          "score": 13,
          "created_utc": 1733320823.0,
          "replies": [
            {
              "id": "m0ec2jm",
              "author": "TapTapReboot",
              "body": "Why do you need to update in the first place? If you're only using it for the hdmi connection what purpose does updating serve?",
              "score": 13,
              "created_utc": 1733333193.0,
              "replies": [
                {
                  "id": "m0edgd9",
                  "author": "None",
                  "body": "Compatibility. Sometimes they update keys and stuff. You're right though, normally that isn't necessary.",
                  "score": 7,
                  "created_utc": 1733333610.0,
                  "replies": [
                    {
                      "id": "m0fow1p",
                      "author": "soytuamigo",
                      "body": "Keys for what?",
                      "score": 2,
                      "created_utc": 1733347737.0,
                      "replies": [
                        {
                          "id": "m0fsmdg",
                          "author": "None",
                          "body": "Encryption. The video going between your devices and the television has encryption to keep filthy pirates from making copies of the digital video. It doesn’t help much but they require it. Sometimes a key will get compromised and they’ll update them or some displays will stop working with the player. \n\nI’m not sure how often this happens. My guess isn’t often. I’ve never had an issue.",
                          "score": 3,
                          "created_utc": 1733348835.0,
                          "replies": [
                            {
                              "id": "m0fuqrv",
                              "author": "soytuamigo",
                              "body": "Oh, you mean for Blu-ray and stuff? If only they knew that those keys never kept pirates away. When they couldn't directly crack the streams or media they screen grabbed it lol and it looked good to me.",
                              "score": 3,
                              "created_utc": 1733349469.0,
                              "replies": [
                                {
                                  "id": "m0fwn89",
                                  "author": "None",
                                  "body": "Not the blurays themselves but the video going from the player to the television. This includes Rokus, Apple TVs, Amazon TV, etc. that have players and hook up to a television. That digital video can be grabbed on the wire and they want to prevent that. \n\nAnd yes, of course there are ways around it. Nothing will stop the pirates. Before all this technology and old friend of mine used to say, locks keep honest people honest but they won't keep out everybody.",
                                  "score": 4,
                                  "created_utc": 1733350051.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0dc8e1",
              "author": "thisischemistry",
              "body": "Exactly, the only safe way to do an update would be if they let you load it onto a USB stick or similar and update without network connectivity.",
              "score": 12,
              "created_utc": 1733321677.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0dvbo4",
          "author": "Techi-C",
          "body": "I’ve still got my 2014 dumb TV. Advertisers can pry it from my cold, dead hands.",
          "score": 9,
          "created_utc": 1733328072.0,
          "replies": [
            {
              "id": "m0gr3vp",
              "author": "URPissingMeOff",
              "body": "I still have my 2006 dumb plasma TV that refuses to die. It's basically just a multi-input monitor. It has a tuner, but I've never used it. I think it might be analog-only. I feed it video from Tivo, an obsolete digital video player (Uebo), and a computer with a YUV output. Audio is via home theater gear.",
              "score": 1,
              "created_utc": 1733360484.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0d9lm1",
          "author": "thisischemistry",
          "body": "Don't bother updating it in the first place, unless it has some major bug that affects how it works. And if it has that when you buy it then return it, that's a bad sign to start with.\n\nJust don't connect devices to a network, if you can help it. I get a streaming device I trust and connect it to the HDMI ports instead. Smart TVs are a scourge of bad UI updates, spyware, and pushing advertising into your viewing.\n\nIf you turn off all connection to the outside world then they don't need security updates because there's nothing to secure.",
          "score": 40,
          "created_utc": 1733320672.0,
          "replies": [
            {
              "id": "m0df7u2",
              "author": "francis2559",
              "body": "They know. Latest TV I got was crippled until you created an account and logged in.",
              "score": 6,
              "created_utc": 1733322770.0,
              "replies": [
                {
                  "id": "m0dps4j",
                  "author": "thisischemistry",
                  "body": "Returned.",
                  "score": 14,
                  "created_utc": 1733326328.0,
                  "replies": []
                },
                {
                  "id": "m0fpb0o",
                  "author": "soytuamigo",
                  "body": "Which brand?",
                  "score": 1,
                  "created_utc": 1733347856.0,
                  "replies": [
                    {
                      "id": "m0fqhic",
                      "author": "francis2559",
                      "body": "Vizio, actually! New policy they had just added.",
                      "score": 2,
                      "created_utc": 1733348210.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m0d9y8a",
              "author": "Plz_PM_Steam_Keys",
              "body": "Some TV's actually have updates that are important. I had a TCL tv that didn't have VRR at launch but came later with an update.",
              "score": 9,
              "created_utc": 1733320806.0,
              "replies": [
                {
                  "id": "m0daegl",
                  "author": "dandroid126",
                  "body": "They already covered what to do in that case\n\n>then return it, that's a bad sign to start with.",
                  "score": 20,
                  "created_utc": 1733320982.0,
                  "replies": [
                    {
                      "id": "m0daqw8",
                      "author": "Plz_PM_Steam_Keys",
                      "body": "Both of you don't know what you're talking about. You must of not had a TV that had good meaningful updates.",
                      "score": -17,
                      "created_utc": 1733321114.0,
                      "replies": [
                        {
                          "id": "m0dd1iw",
                          "author": "bottomofleith",
                          "body": "Why would you buy a TV that doesn't do something straight out of the box, until it's been updated at a later date?",
                          "score": 20,
                          "created_utc": 1733321976.0,
                          "replies": [
                            {
                              "id": "m0dhvaf",
                              "author": "Plz_PM_Steam_Keys",
                              "body": "Maybe the TV didn't advertise the new features and they just added it because they wanted to?",
                              "score": -10,
                              "created_utc": 1733323703.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m0dcjxg",
                          "author": "dandroid126",
                          "body": "If I did, I would get rid of it because that's a bad sign to start with. I don't want my TV to update. I want it to display my content. If I wanted a TV with VRR, I would buy a TV with VRR. Not buy one without it and hope it gets it in the future.",
                          "score": 10,
                          "created_utc": 1733321797.0,
                          "replies": [
                            {
                              "id": "m0dp1my",
                              "author": "cjcs",
                              "body": "Right but say you didn’t care about VRR when you bought the tv and it was added later, you’re saying your refuse to update just because?",
                              "score": 4,
                              "created_utc": 1733326090.0,
                              "replies": [
                                {
                                  "id": "m0ds800",
                                  "author": "dandroid126",
                                  "body": "Yes, I refuse to update. Not \"just because\". Because I have been burned in the past. I bought a smart TV that was fine when I bought it, then they updated it, which fucked with the color balance, and I preferred it before. I did an insane amount of research on my TV, paid a lot of money to get the exact one that I wanted, and then they fucked it up with an update. I also had one where they made it so instead of just going to my content, like it did when I bought it, they updated it so it went to their shitty, ad-riddled \"home screen\" where I had to select my input first before it would show my content. I could no longer just turn on my TV, I now had to turn on my TV, then select my input while seeing ads.\n\nAs I said, I do a lot of research on products before I buy them. When I buy something, I am paying money and deciding to be content with the features that I get in exchange for that money. If VRR wasn't important to me when I was doing all that research, then it isn't going to suddenly become important to me later. If I decided I want a new feature set later, I will buy a new product. \n\nFor the record, VRR is an important feature to me, and I do have a TV that has it. But I made sure that it had it before I bought it, even though my PC at the time couldn't use it, because I wanted to future proof myself for when I could use it (and after a GPU upgrade, I can).",
                                  "score": 8,
                                  "created_utc": 1733327106.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0dauk9",
                  "author": "thisischemistry",
                  "body": "Sure but you're rolling the dice with every update, do they improve features or degrade them? If you are *absolutely* sure there's no hidden downgrades then go for it but that's a tough thing to be sure of.\n\nIf I buy something that doesn't have an essential feature enabled then I'm more likely to just return it instead of trying to update it to fix the issues.",
                  "score": 9,
                  "created_utc": 1733321153.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0e96r8",
              "author": "hickok3",
              "body": "I bought a Samsung TV just befote the Xbox Series X launched. I had to update the TV before I could even use my Xbox properly(can't remember if it didn't woek at all, or is it was just the one port it woupdn't get the full benefit on as it has been a few years). ",
              "score": 1,
              "created_utc": 1733332320.0,
              "replies": []
            },
            {
              "id": "m0efzyq",
              "author": "wallacebrf",
              "body": "agreed. However using cheap network hardware and some settings changes you can block all of the ads and tracking features at your network level while keeping everything else (OS updates, apps like netflix and youtube) working.",
              "score": 1,
              "created_utc": 1733334375.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0dzpvt",
          "author": "Cheap_Collar2419",
          "body": "Yep! Thank god for Apple tv",
          "score": 6,
          "created_utc": 1733329436.0,
          "replies": [
            {
              "id": "m0nwn84",
              "author": "fatdjsin",
              "body": "i followed the wise ppl of reddit and i did NOT connect my new 85 inches tv, got a apple tv 4k (WITH RJ45 connector....and that was wise, wifi was not fast enough to keep up with huge uncompressed blueray content)  \n\nthis is the pro move, new tv = not connected to the net, apple tv DONE",
              "score": 1,
              "created_utc": 1733461938.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0dk9ro",
          "author": "weaselmaster",
          "body": "You don’t need updates if you don’t use any of their spyware.\n\nNEVER connect a TV to the internet - Full Stop.",
          "score": 14,
          "created_utc": 1733324515.0,
          "replies": []
        },
        {
          "id": "m0dji43",
          "author": "sold_snek",
          "body": "I've had this 85 Samsung for a few year from a Black Friday and it's just so obnoxiously slow with a horrible, ugly menu that pops up from the bottom and lags like crazy. Bought an Apple TV since I'm trying to do the home automation thing. Much better, but TV still starts up with all that crap at the bottom since it's trying. Once I reset the network settings to disconnect it, now it immediately pops up to the Apple TV and is as quick as my Roku TV.",
          "score": 7,
          "created_utc": 1733324256.0,
          "replies": [
            {
              "id": "m0dnlv9",
              "author": "IGetLyricsWrong",
              "body": "YES that stupid menu on the bottom and blocks what I actually want to do for what seems like a randomized 5-10 seconds. I'm never buying a samsung product again as they're just obnoxious, but the options are limited with their competitors.",
              "score": 9,
              "created_utc": 1733325624.0,
              "replies": [
                {
                  "id": "m0g64la",
                  "author": "sold_snek",
                  "body": "lmao yes. I would never recommend a Samsung TV, which is weird because their name used to be up there.",
                  "score": 1,
                  "created_utc": 1733353088.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0doxv7",
          "author": "Crintor",
          "body": "I don't even bother updating, most of the times it's just worst UX/UI so they can cram more ad space. Almost never improves functionality, and if it's not connected it doesn't need security updates.",
          "score": 3,
          "created_utc": 1733326056.0,
          "replies": []
        },
        {
          "id": "m0dr8bt",
          "author": "fastlerner",
          "body": "If you're not using the online functions, then you don't need updates.",
          "score": 4,
          "created_utc": 1733326791.0,
          "replies": []
        },
        {
          "id": "m0e6iwn",
          "author": "Johndeauxman",
          "body": "What do updates for tvs actually do? Mines been reminding me for at least year there’s an update but my tv works perfectly fine. Always been curious but not enough to find out they just added more junk and broke it lol",
          "score": 3,
          "created_utc": 1733331503.0,
          "replies": []
        },
        {
          "id": "m0dxynk",
          "author": "ITworksGuys",
          "body": "My Vizio I bought a few years ago literally came with a tiny little remote \n\nI had to use an app on my phone to change settings. \n\nSO annoying",
          "score": 2,
          "created_utc": 1733328898.0,
          "replies": []
        },
        {
          "id": "m0dsaua",
          "author": "Templar388z",
          "body": "You know, I didn’t think of that 😂",
          "score": 1,
          "created_utc": 1733327130.0,
          "replies": []
        },
        {
          "id": "m0erchl",
          "author": "blacksoxing",
          "body": "The only \"problem\" is that Roku TV requires an account + internet else they won't show you the local TV guide....so I made a dummy account and isolated it on a 2nd network so it wouldn't interact with my other devices. Thanks to HDMI CES my Apple TV boots directly at launch and I miss the interface almost completely  unless needing to watch local TV\n\nElse....I'd be just like you - disconnected smart TV w/an Apple TV doing the heavy lifting",
          "score": 1,
          "created_utc": 1733337769.0,
          "replies": []
        },
        {
          "id": "m0f5df4",
          "author": "Ranier_Wolfnight",
          "body": "It’s a hard and fast rule in my home. Never connect TVs to the WiFi. I have Apple TV for streaming. PS5 for games. Refuse to connect that thing to the internet.",
          "score": 1,
          "created_utc": 1733341972.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0cuw4a",
      "author": "shamont",
      "body": "Saw an ad on a Samsung Smart TV 6-7 years ago. Haven't considered a smart tv a smart buy since. ",
      "score": 87,
      "created_utc": 1733314357.0,
      "replies": [
        {
          "id": "m0cv9gw",
          "author": "asmodeus1112",
          "body": "You just dont hook them up to the internet",
          "score": 70,
          "created_utc": 1733314541.0,
          "replies": [
            {
              "id": "m0cvpll",
              "author": "sevairity",
              "body": "Until the picture goes black and white because it forces you to update the firmware. It was a Vizio from 2011",
              "score": -29,
              "created_utc": 1733314760.0,
              "replies": [
                {
                  "id": "m0cw7r3",
                  "author": "the_simurgh",
                  "body": "I had one for 6 years and that never happened.",
                  "score": 20,
                  "created_utc": 1733315006.0,
                  "replies": []
                },
                {
                  "id": "m0e6bif",
                  "author": "AKAManaging",
                  "body": "To clarify, are you saying that your TV forced itself to only show black and white video, and you were REQUIRED to update the firmware, or that you updated the firmware which turned your video to black and white, and needed another firmware update?\n\nEither way, I can't find ANY sources that back up what you're saying, for any scenario. Do you have proof or a source of this happening to yourself or literally anyone else in existence? This seems (sorry if it's true) like a blatant lie.",
                  "score": 11,
                  "created_utc": 1733331442.0,
                  "replies": [
                    {
                      "id": "m0fdrrs",
                      "author": "zzazzzz",
                      "body": "how would the tv even know there is a new firmware update without an internet connection. its obviously bullshit.",
                      "score": 3,
                      "created_utc": 1733344496.0,
                      "replies": [
                        {
                          "id": "m0feu2t",
                          "author": "AKAManaging",
                          "body": "I think what they said is nonsense, but if I was theorizing this silliness, I'd assume it could be argued that any TV could \"check\" to see if there had been a connection to the internet, and if not within X amount of time, it would \"punish\" the user by being black and white.\n\nAgain, the fact that I'm even theorizing this lunacy is silly, but here we are. :p",
                          "score": 2,
                          "created_utc": 1733344815.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m0ecxto",
                  "author": "AlphaTangoFoxtrt",
                  "body": "Never had that happen, even if it did, connect-update-disconnect.",
                  "score": 4,
                  "created_utc": 1733333455.0,
                  "replies": []
                },
                {
                  "id": "m0cwn70",
                  "author": "asmodeus1112",
                  "body": "I have actually always bought vizios and i have never had a problem with them. I never connect them to the internet.",
                  "score": 9,
                  "created_utc": 1733315213.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0enl0c",
          "author": "DerangedGinger",
          "body": "They just pushed an update to my Samsung TV to add a shit ton of ads.  I can't even navigate the main menu until all the ads are done loading.  The picture in picture I used to have when I went back to the home screen was removed to make way for ads.  The stuff still plays in the background, but I can't see it, because 50% of my screen is a banner ad.",
          "score": 12,
          "created_utc": 1733336645.0,
          "replies": [
            {
              "id": "m0fq7nr",
              "author": "soytuamigo",
              "body": "This is why I disconnected my Samsung TV from the internet. You need to disconnect it both physically (if using ethernet) and logically (forget Wi-Fi) because Samsung will make it go online on its own; it did it to mine! I still have a clean UI and I use a streaming device I can somewhat control to add \"smarts\" to it.",
              "score": 3,
              "created_utc": 1733348126.0,
              "replies": [
                {
                  "id": "m0hosll",
                  "author": "getoffmeyoutwo",
                  "body": "These discussions fill me with horror.  My Samsung \"smart tv\" is hooked up via hdmia to an extra laptop only, the laptop using browsers with adblock.  Never an ad in site unless I'm like streaming an NFL stream from somewhere.  Video ads make me want to blow my brains out.  This whole notion of scatter advertising, 1000 people will be forced to watch this ad and it will be relavent to 1 of them who will purchase... kind of seems a touch unethical.",
                  "score": 1,
                  "created_utc": 1733373246.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0fq859",
              "author": "soytuamigo",
              "body": "This is why I disconnected my Samsung TV from the internet. You need to disconnect it both physically (if using ethernet) and logically (forget Wi-Fi) because Samsung will make it go online on its own; it did it to mine! I still have a clean UI and I use a streaming device I can somewhat control to add \"smarts\" to it.",
              "score": 2,
              "created_utc": 1733348131.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0dh8ce",
      "author": "heybart",
      "body": "Vizio is go longer a good cheap alternative anyway. TCL and Hisense are where it's at",
      "score": 28,
      "created_utc": 1733323483.0,
      "replies": [
        {
          "id": "m0ebldv",
          "author": "Fedoraus",
          "body": "Do any of the cheap brands make amything comparable to an OLED yet? I haven't looked into getting a new tv since like 2020 but I remember all of the non LG oled alternatives being really bad",
          "score": 4,
          "created_utc": 1733333049.0,
          "replies": [
            {
              "id": "m0ef0ql",
              "author": "heybart",
              "body": "You'll have to get the higher tier models by TCL or Hisense to have mini LEDs (lotsa local dimming zones). Do they come close to OLED? Even the best ones from Sony and Samsung can't match OLED for inky black, but can surpass in brightness. Brightness is important for HDR because you don't have to compress the dynamic range as much, going from what the source is mastered at to what your TV is capable of reproducing. And of course you don't need to worry about OLED burn in.",
              "score": 9,
              "created_utc": 1733334081.0,
              "replies": []
            },
            {
              "id": "m0f0iqr",
              "author": "edvek",
              "body": "The C3 or whatever it is, as far as I know, is still king from LG. But buying a higher end TCL is a good option if the OLED isn't in your budget. I got a TCL Q7 last year for a good price and it's a very good TV. Was cheaper than the OLED and it was also 75 inches so... Ya...\n\nDefinitely look into the reviews and rtings review of the different TVs and go from there.",
              "score": 3,
              "created_utc": 1733340514.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0falkd",
          "author": "Funny_Alternative_55",
          "body": "Hisense is legit. I got a 55” 4K one with Google TV a bit ago, first question it asked was “set up Google TV (use smart features) or set up Basic TV (HDMI in only)?”",
          "score": 4,
          "created_utc": 1733343533.0,
          "replies": [
            {
              "id": "m0go7jg",
              "author": "ForzaShadow",
              "body": "I’ve heard horror stories of them that’s why I haven’t bought one yet, but the 179.99 55”inch hisense is calling my mf name",
              "score": 1,
              "created_utc": 1733359447.0,
              "replies": [
                {
                  "id": "m0l1qlu",
                  "author": "-SPM-",
                  "body": "I had one lasted me about 2 years before it stopped working. Never again. I would personally look at TCL instead if you’re on a budget",
                  "score": 1,
                  "created_utc": 1733425989.0,
                  "replies": [
                    {
                      "id": "m0q5vd5",
                      "author": "ForzaShadow",
                      "body": "I’d be happy if it lasted me 2 years, for 180$, you can’t beat it",
                      "score": 1,
                      "created_utc": 1733501922.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0q0197",
                  "author": "Realistic-Nature9083",
                  "body": "Hisense or tcls google tvs are not good. The android os kills the emmc over time. The emmc is shit. Android os writes and reads a lot. Buy the TV and get a streaming box immediately and never use the built in tv features",
                  "score": 1,
                  "created_utc": 1733500055.0,
                  "replies": [
                    {
                      "id": "m0q5txd",
                      "author": "ForzaShadow",
                      "body": "That’s exactly what I did lol. I didn’t even connect it to the internet. I already had a Roku.",
                      "score": 1,
                      "created_utc": 1733501909.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m0fazk7",
          "author": "heybart",
          "body": "That's a choice you won't get from LG or Samsung",
          "score": 2,
          "created_utc": 1733343651.0,
          "replies": []
        },
        {
          "id": "m0ibn1x",
          "author": "elreniel2020",
          "body": "> Hisense\n\nyeah bought one in 2017, barley lived for 2 years. never again.",
          "score": 1,
          "created_utc": 1733385498.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0dlz81",
      "author": "axleflunk",
      "body": "Almost every TV is an ad delivery unit now. Very sad.",
      "score": 21,
      "created_utc": 1733325088.0,
      "replies": [
        {
          "id": "m0fred6",
          "author": "soytuamigo",
          "body": "🌎🧑‍🚀🔫🧑‍🚀\n\nAlways has been.",
          "score": 14,
          "created_utc": 1733348476.0,
          "replies": []
        },
        {
          "id": "m0hoyxd",
          "author": "getoffmeyoutwo",
          "body": "There are no \"Tvs\" in my house, only tvs used as monitors hooked up to computers with adblock.  A video ad at this point would seem like a stranger taking a poop in our living room.",
          "score": 1,
          "created_utc": 1733373324.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0dfdis",
      "author": "AEternal1",
      "body": "Smart TV my ass. There are plenty of low-cost high-powered microcomputers now that you can set up inconspicuously next to your TV and have a full multimedia computing experience that is so much better than anything a traitorous Smart TV could provide.",
      "score": 13,
      "created_utc": 1733322826.0,
      "replies": [
        {
          "id": "m0exra3",
          "author": "Cry_Wolff",
          "body": "I'll take Android TV box or Apple TV. PCs with desktop UI are annoying to use and limited (streaming wise).",
          "score": 4,
          "created_utc": 1733339684.0,
          "replies": [
            {
              "id": "m0fsg37",
              "author": "soytuamigo",
              "body": "Yes but Android TV stock launcher has ads now (sorry, \"content suggestions\") and needless to say it's Google, it is collecting your data which granted isn't visually annoying but still a violation of your privacy. You can install alternative launchers though.",
              "score": 1,
              "created_utc": 1733348786.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0hpbxe",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1733373483.0,
          "replies": [
            {
              "id": "m0hqxvq",
              "author": "AEternal1",
              "body": "There are some excellent and cheap Bluetooth keyboards/mice multimedia combo controllers on Amazon. I have several 🤣",
              "score": 2,
              "created_utc": 1733374206.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0edo3n",
      "author": "kruthikv9",
      "body": "You guys connect your tvs to the internet? I thought the console/PC did all the connecting",
      "score": 11,
      "created_utc": 1733333674.0,
      "replies": [
        {
          "id": "m0ef2k5",
          "author": "lolli91",
          "body": "Exactly",
          "score": 2,
          "created_utc": 1733334096.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0d03pe",
      "author": "kclongest",
      "body": "This is old news. The sale was just finalized.",
      "score": 22,
      "created_utc": 1733316804.0,
      "replies": [
        {
          "id": "m0gx4kv",
          "author": "CosmicCreeperz",
          "body": "Exactly, this was announced in FEBRUARY.",
          "score": 3,
          "created_utc": 1733362616.0,
          "replies": []
        },
        {
          "id": "m0dgd3k",
          "author": "TheJasonaut",
          "body": "Thought so",
          "score": 2,
          "created_utc": 1733323181.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0eej1b",
      "author": "burnSMACKER",
      "body": "ITT: People with Google Pixel devices, Google Chromecast, Google Nest, Google Mini, and a plethora of Amazon devices and services. But yes, Walmart is where you draw the line.",
      "score": 24,
      "created_utc": 1733333933.0,
      "replies": [
        {
          "id": "m0gtizp",
          "author": "URPissingMeOff",
          "body": "90% of Google employees don't need foodstamps to survive like 90% of Walmart employees.",
          "score": 9,
          "created_utc": 1733361343.0,
          "replies": []
        },
        {
          "id": "m0goj0w",
          "author": "clerk37",
          "body": "Well, to be fair all of those are android based devices and can at the very least be modified to the point that you don't see any ads.",
          "score": 5,
          "created_utc": 1733359562.0,
          "replies": [
            {
              "id": "m0i0tq3",
              "author": "AbsoluteZeroUnit",
              "body": "uh huh, and how many people in this sub are rooting their chromecasts?",
              "score": 2,
              "created_utc": 1733379080.0,
              "replies": [
                {
                  "id": "m0k0ruz",
                  "author": "clerk37",
                  "body": "You don't have to root a chromecast to not see homescreen ads, just install an alternative launcher like flauncher. \nhttps://play.google.com/store/apps/details?id=me.efesser.flauncher&hl=en_US",
                  "score": 1,
                  "created_utc": 1733414669.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0fqhjg",
          "author": "soytuamigo",
          "body": "My thoughts exactly. Had they made this big a fuss when Amazon started to do the same with all their devices maybe things wouldn't be this awful.",
          "score": 3,
          "created_utc": 1733348211.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0dv9yj",
      "author": "YJeezy",
      "body": "TV advertising is huge for Walmart. They can add Vizio to their advertising tech stack to distribute ads for themselves and other advertisers. They are one of the most advanced digital advertising players in the world and spend over 7% of overall media spend in the US. \n\nThey are competing with the likes of Amazon not only to advertise but as an advertising platform for other advertisers.",
      "score": 6,
      "created_utc": 1733328057.0,
      "replies": []
    },
    {
      "id": "m0euben",
      "author": "NateinOregon",
      "body": "I bought my Vizio 65 inch 3d tv in 2013. Finally developed some lines on the screen this year. I would happily buy another Vizio. Wish 3d tv was still a thing.",
      "score": 4,
      "created_utc": 1733338654.0,
      "replies": []
    },
    {
      "id": "m0dffw8",
      "author": "KrackSmellin",
      "body": "So glad I don’t buy their TVs… cheap doesn’t always mean good.",
      "score": 8,
      "created_utc": 1733322850.0,
      "replies": [
        {
          "id": "m0fqnm7",
          "author": "soytuamigo",
          "body": "It's not just their \"cheap\" stuff. Samsung is doing the same, LG does other underhanded shit to sell you ads (by selling your data). It's all of them.",
          "score": 3,
          "created_utc": 1733348260.0,
          "replies": [
            {
              "id": "m0g2roj",
              "author": "KrackSmellin",
              "body": "Not if you never connect and actively block the TVs on your network :) - thankfully I use other devices which have their own issues but as with the TVs I block their access to except to what I need.",
              "score": 1,
              "created_utc": 1733351983.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0gb9ye",
      "author": "Ianthin1",
      "body": "Using a third party streamer and never connecting the TV to the internet fixes all this.",
      "score": 3,
      "created_utc": 1733354864.0,
      "replies": []
    },
    {
      "id": "m0cw4p1",
      "author": "hhs2112",
      "body": "fuuuuuuuuuuuuuuuuuck that, scratches vizio off the tv list...\n\n\nEdit: vizio, not visio, apologies ms, lol",
      "score": 31,
      "created_utc": 1733314965.0,
      "replies": [
        {
          "id": "m0d5j05",
          "author": "VampyreLust",
          "body": "They all do this to some degree, just look at it like a monitor and use a streaming box as the brains like an Apple TV, Google Groan or Nvidia Shield like everyone else.",
          "score": 15,
          "created_utc": 1733319080.0,
          "replies": [
            {
              "id": "m0d9o38",
              "author": "nerox092",
              "body": "I have an Apple TV on my main TV, the interface is clean and I can select the app I want easily.\n\nMy other TVs have Amazon FireSticks, we rarely use them, but I feel like I get eye fucked by the Blue Origin rocket with the pure amount of amazon ads that it displays all the time and then you gotta go through multiple clicks to get to your app cause it puts all the amazon prime content where your apps should be.",
              "score": 7,
              "created_utc": 1733320699.0,
              "replies": [
                {
                  "id": "m0djafn",
                  "author": "adobecredithours",
                  "body": "I have an Amazon interface on my smart TV and will never get one again. It's clunky and hard to find things buried beneath mountains of Amazon product ads, and like you said amazons own services get pulled to the front all the time.",
                  "score": 4,
                  "created_utc": 1733324185.0,
                  "replies": [
                    {
                      "id": "m0drj91",
                      "author": "JoeDawson8",
                      "body": "I’m not buying another Amazon Fire based TV The remote doesn’t have an input button.  That’s unforgivable.  No internet going to the tv so it’s tolerable",
                      "score": 2,
                      "created_utc": 1733326888.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m0dv3av",
                  "author": "No_Mammoth_4945",
                  "body": "I have a fire tv stick and it sucks so bad. If you turn on the TV you have to immediately click on Netflix or YouTube or whatever or else you’ll be blasted with an Ad that’s somehow 100x louder than anything else you watch",
                  "score": 2,
                  "created_utc": 1733327999.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m0e3gan",
              "author": "phblue",
              "body": "Hehe, google *groan*",
              "score": 3,
              "created_utc": 1733330578.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0ebzr2",
          "author": "RetroBTS",
          "body": "Do people not use streaming sticks/boxes? I can’t remember the last time I interfaced with a Smart TV’s own interface besides to change the display settings. Whether or not the TV shows ads on its own OS might be the least important consideration when buying a TV.",
          "score": 2,
          "created_utc": 1733333170.0,
          "replies": [
            {
              "id": "m0fsxky",
              "author": "soytuamigo",
              "body": "They have ads too which will only get more invasive. They masks them as \"suggestions\" for now and in the case of Android and I guess the fire TV you can install alternative launchers without ads but if will only get worse from here. In my case I downgraded the Google launcher to one before they integrated ads but at some point that won't be an option for future android TVs.",
              "score": 2,
              "created_utc": 1733348926.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0czqeg",
          "author": "igeekone",
          "body": "Yup, no more Vizio, ever.",
          "score": 4,
          "created_utc": 1733316638.0,
          "replies": [
            {
              "id": "m0d90g2",
              "author": "dirthurts",
              "body": "They all do this.\n\nEdit. Whoever is downvoting me has never inspected their network traffic coming form their TVs and it shows.",
              "score": 1,
              "created_utc": 1733320450.0,
              "replies": [
                {
                  "id": "m0ftd7g",
                  "author": "soytuamigo",
                  "body": "The reddit hive mind is dumb don't pay attention to the down votes--it's not like you can use reddit points to buy stuff anyways. These days getting down voted usually means you're over the target in an uncomfortable way.",
                  "score": 1,
                  "created_utc": 1733349054.0,
                  "replies": []
                },
                {
                  "id": "m0eb1yw",
                  "author": "None",
                  "body": "correct. they all do it. Samsung, LG, Roku, etc. some brands basically paywalled their data forcing advertisers to use their platform to access their user data.  i also don't get why people get so uppity about it. its not like they know your name. its to serve relevant ads to you lulz.",
                  "score": -1,
                  "created_utc": 1733332887.0,
                  "replies": [
                    {
                      "id": "m0ftlu9",
                      "author": "soytuamigo",
                      "body": "Yeah you're only submitting your email account to them, they have no way of knowing your name. /s",
                      "score": 1,
                      "created_utc": 1733349127.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0dvqhr",
      "author": "karvus89",
      "body": "I use an Apple TV and disable internet on the smart tv.  It’s so slow and the ads are insufferable.",
      "score": 3,
      "created_utc": 1733328202.0,
      "replies": []
    },
    {
      "id": "m0eqz26",
      "author": "Hampni",
      "body": "Friendly reminder to not connect your TV directly to the internet.\n\nUse a streaming device plugged into it if you need to stream.",
      "score": 3,
      "created_utc": 1733337657.0,
      "replies": []
    },
    {
      "id": "m0es9c1",
      "author": "Lets_Bust_Together",
      "body": "Couldn’t you just not connect your tv to WiFi…?",
      "score": 3,
      "created_utc": 1733338043.0,
      "replies": []
    },
    {
      "id": "m0h0l05",
      "author": "QuiGonColdGin",
      "body": "I use PiHole on my network to block the majority of the millions of intrusive requests my smart tvs (and Roku, and other streamers) try to make. I love knowing I'm depriving them of information and advertising.",
      "score": 3,
      "created_utc": 1733363845.0,
      "replies": [
        {
          "id": "m0h3fd8",
          "author": "Grouchy_Value7852",
          "body": "Love the username and also, where would one find this pihole knowledge you speak of?",
          "score": 3,
          "created_utc": 1733364890.0,
          "replies": [
            {
              "id": "m0hb9ks",
              "author": "QuiGonColdGin",
              "body": "There are a good number of walk-throughs out there and especially YouTube videos. I have a technical background but I used YouTube walk-throughs because it made everything so much easier. Even if you're not technical I think these would probably be easy enough to follow for most people. [PiHole on Raspberry Pi](https://youtu.be/cE21YjuaB6o). This one is for setting it up on a Raspberry Pi device, but you can set it up on any small PC or almost anything. It requires very little computing power.",
              "score": 2,
              "created_utc": 1733367769.0,
              "replies": []
            },
            {
              "id": "m0hbxpl",
              "author": "thrownawaymane",
              "body": "It's not something the advertisers would tell you.",
              "score": 1,
              "created_utc": 1733368021.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0d7vpf",
      "author": "BAG1",
      "body": "Because of that one time 19 million people forgot about Walmart existing.",
      "score": 5,
      "created_utc": 1733320013.0,
      "replies": []
    },
    {
      "id": "m0dzipt",
      "author": "Gorgar_Beat_Me",
      "body": "America America....",
      "score": 2,
      "created_utc": 1733329375.0,
      "replies": []
    },
    {
      "id": "m0e3cvz",
      "author": "None",
      "body": "Good luck getting them into my house",
      "score": 2,
      "created_utc": 1733330548.0,
      "replies": []
    },
    {
      "id": "m0e6ztd",
      "author": "Macroagnostic",
      "body": "This is why I update my TV and then disconnect it from the internet. Using then an apple TV or an android TV box to do what I need.",
      "score": 2,
      "created_utc": 1733331647.0,
      "replies": []
    },
    {
      "id": "m0eansy",
      "author": "None",
      "body": "Vizio has been licensing their data for years and years. I'm not so involved in that aspect of the industry anymore but Vizio had one of the largest panels of user data because their tvs are so cheap and people buy them .... I'm sure walmart will also sell it out now they own them.",
      "score": 2,
      "created_utc": 1733332768.0,
      "replies": []
    },
    {
      "id": "m0eb6de",
      "author": "queeftoe",
      "body": "I'm way too smug when I tell people I don't watch shows, let alone *own* a television. Shit like this reinforces that's a good choice for myself",
      "score": 2,
      "created_utc": 1733332923.0,
      "replies": [
        {
          "id": "m0eqvvb",
          "author": "Soakitincider",
          "body": "I don’t watch it much anymore. I use YouTube a lot but I use apps to block the ads on my PC. There is one that is user generated where it will even skip the sponsor talks.",
          "score": 1,
          "created_utc": 1733337631.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0ee0zd",
      "author": "Mysterious_Fennel459",
      "body": "I got rid of my last Visio months ago when it forced me to watch my local over the air channels on their stupid internet channels app. It instantly made browsing local channels harder and slower. And once you connect it to a wifi network, there's no way to disconnect it w/out doing a factory reset. I liked the internet connected option so I could stream from content from my plex media server but that was it.\n\nNow I just use a $20 roku stick to stream and get pluto/youtube and whatnot.",
      "score": 2,
      "created_utc": 1733333781.0,
      "replies": []
    },
    {
      "id": "m0eef0k",
      "author": "rjksn",
      "body": "Another product to avoid like the plague.",
      "score": 2,
      "created_utc": 1733333899.0,
      "replies": []
    },
    {
      "id": "m0f9p2i",
      "author": "Konstant_kurage",
      "body": "This is a good reason to use an HDMI connected device to stream. All my smart TV’s have the internet turned off, camera covered.",
      "score": 2,
      "created_utc": 1733343259.0,
      "replies": [
        {
          "id": "m0fhkp7",
          "author": "ErgoProxy0",
          "body": "Camera?",
          "score": 1,
          "created_utc": 1733345618.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0fh9lr",
      "author": "marbitross",
      "body": "Just don’t connect your tv to the internet. It’s so easy",
      "score": 2,
      "created_utc": 1733345530.0,
      "replies": []
    },
    {
      "id": "m0fhrtn",
      "author": "ImSorryOkGeez",
      "body": "My Vizio smart tv was garbage in several ways. I hooked the Apple TV into it and disconnected the tv itself from the internet. I hate “smart” tvs.",
      "score": 2,
      "created_utc": 1733345675.0,
      "replies": []
    },
    {
      "id": "m0gm845",
      "author": "One_Doubt_75",
      "body": "FYI: If you have Android TV, use projectivity launcher. No ads to be seen.",
      "score": 2,
      "created_utc": 1733358737.0,
      "replies": []
    },
    {
      "id": "m0gp22g",
      "author": "Ksan_of_Tongass",
      "body": "Who connects their TV to the internet lol",
      "score": 2,
      "created_utc": 1733359754.0,
      "replies": []
    },
    {
      "id": "m0gqogp",
      "author": "scuddlebud",
      "body": "Can I buy a quality TV with a good picture that isn't a smart TV?",
      "score": 2,
      "created_utc": 1733360335.0,
      "replies": []
    },
    {
      "id": "m0mrigv",
      "author": "Jgray1087",
      "body": "I recommend making a media server using Plex or Jellyfin. Either rip you DVDs/blurays or sail the seas. Custom make your own stuff by using an old computer lying around. Or buying a NAS.\n\nSo far with me I have hundreds of movies , around 50 TV shows, and around 200 cds worth of music on this thing. So far worth it.",
      "score": 2,
      "created_utc": 1733446263.0,
      "replies": []
    },
    {
      "id": "m0g5xp9",
      "author": "robotokenshi",
      "body": "never connect your tv to internet",
      "score": 2,
      "created_utc": 1733353024.0,
      "replies": []
    },
    {
      "id": "m0e0rsc",
      "author": "LocustUprising",
      "body": "Friendly reminder to NEVER connect your tv to the Internet",
      "score": 3,
      "created_utc": 1733329758.0,
      "replies": []
    },
    {
      "id": "m0d65h4",
      "author": "IAmYourDadDads",
      "body": "I have an older Vizio tv and it’s not a smart tv but it has like air play or screen sharing or whatever. It’s a fine tv for being in my room. I got it for like $130 on clearance at the wal mart.",
      "score": 2,
      "created_utc": 1733319331.0,
      "replies": []
    },
    {
      "id": "m0dpw3f",
      "author": "buggin_at_work",
      "body": "Fuck \"TV's\" Buy a monitor and hook up your streaming devices. Only getting ads while watching an actual show\n\nFuck, is this where we are?!",
      "score": 2,
      "created_utc": 1733326363.0,
      "replies": [
        {
          "id": "m0fu9f0",
          "author": "soytuamigo",
          "body": "That's the final stage I believe we can still find models without the very invasive ads but in the end they will all have them. A huge monitor (expensive!) with Kodi is the only option we will have left when that time comes.",
          "score": 2,
          "created_utc": 1733349324.0,
          "replies": [
            {
              "id": "m0hc2w6",
              "author": "thrownawaymane",
              "body": "They will add this tech to monitors, it's already patented.",
              "score": 1,
              "created_utc": 1733368074.0,
              "replies": [
                {
                  "id": "m0hqugo",
                  "author": "soytuamigo",
                  "body": "Yep, Louis Rossmann did a story on it. The monitor market is way bigger though, it's not owned by a handful of players. They will all have to agree to go down this path.",
                  "score": 1,
                  "created_utc": 1733374165.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0dbwe5",
      "author": "BishopsBakery",
      "body": "My tv was lobotomized",
      "score": 1,
      "created_utc": 1733321554.0,
      "replies": [
        {
          "id": "m0ej9pf",
          "author": "procsysnet",
          "body": "How?",
          "score": 1,
          "created_utc": 1733335349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0drkm4",
      "author": "Goldengod4818",
      "body": "Wait. Didn't Vizio start as a Walmart brand?",
      "score": 1,
      "created_utc": 1733326900.0,
      "replies": []
    },
    {
      "id": "m0du9th",
      "author": "Darklord_Bravo",
      "body": "I had an older Vizio, and the apps were so slow compared to the ones on my PS4, I took it off the network. I don't have one anymore, but my current LG is disconnected as well, because I only use it as a monitor and none of the apps.",
      "score": 1,
      "created_utc": 1733327747.0,
      "replies": []
    },
    {
      "id": "m0e012a",
      "author": "None",
      "body": "I bought a 60” Vizio from Target in 2013. It was a floor model, used and discontinued, and we got it for around $500. We bought a Roku stick just after that. It’s still the same as the day we bought it. I’ve never seen an ad on it, probably because it’s so old. Up until now I always thought I’d get another one because of how well it works, but now hearing about this ad deal, maybe not…..",
      "score": 1,
      "created_utc": 1733329529.0,
      "replies": [
        {
          "id": "m0e4nwf",
          "author": "dicemonkey",
          "body": "If you use the roku you’re fine …it’s only if you use the vizio smart cast .",
          "score": 1,
          "created_utc": 1733330944.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0e4900",
      "author": "MatsGry",
      "body": "Thought they owned them since like the 2000s",
      "score": 1,
      "created_utc": 1733330820.0,
      "replies": []
    },
    {
      "id": "m0e6qu1",
      "author": "ZellZoy",
      "body": "Spectre makes 4k TVs that will never show you ads because they aren't smart. Super cheap too",
      "score": 1,
      "created_utc": 1733331570.0,
      "replies": [
        {
          "id": "m0ei6vq",
          "author": "xbbdc",
          "body": "About 14 years ago, my job was running some kind of event where a bunch of TVs had to be used. Because of budget, I went with Spectre. The entire time, people were like who the fuck is Spectre. I forgot what we did with the TVs after.",
          "score": 3,
          "created_utc": 1733335025.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0e90xr",
      "author": "SternLecture",
      "body": "what part of the tv do i have to stab with a screwdriver",
      "score": 1,
      "created_utc": 1733332270.0,
      "replies": []
    },
    {
      "id": "m0e9cdi",
      "author": "jonathanrdt",
      "body": "Pi-hole blocks my roku ads. If you want to stop them, there’s always a way.",
      "score": 1,
      "created_utc": 1733332367.0,
      "replies": [
        {
          "id": "m0eie6s",
          "author": "xbbdc",
          "body": "Roku can force their own DNS servers if they wanted to, bypassing your Pihole.",
          "score": 1,
          "created_utc": 1733335085.0,
          "replies": [
            {
              "id": "m0f4j8j",
              "author": "jonathanrdt",
              "body": "I dont allow anything to talk to other dns servers.",
              "score": 1,
              "created_utc": 1733341721.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0em73n",
      "author": "MarkusRight",
      "body": "so what happens to TCL then? I thought that was Walmarts champion brand and best seller? So if Walmart owns Vizio they can undercut TCL and sell TV's for even cheaper. Look at it this way, its good to have more competition even if most of us wont use their ad filled products.",
      "score": 1,
      "created_utc": 1733336231.0,
      "replies": []
    },
    {
      "id": "m0eof8x",
      "author": "ATXDefenseAttorney",
      "body": "Somebody needed to tell Walmart the only people with Vizio TVs are Walmart shoppers already. Heh.",
      "score": 1,
      "created_utc": 1733336896.0,
      "replies": []
    },
    {
      "id": "m0er4tf",
      "author": "esteroberto",
      "body": "Vizio is crap anyway.\n\n\\-Vizio owner",
      "score": 1,
      "created_utc": 1733337706.0,
      "replies": []
    },
    {
      "id": "m0er928",
      "author": "HGLatinBoy",
      "body": "They should have bought TCL",
      "score": 1,
      "created_utc": 1733337741.0,
      "replies": []
    },
    {
      "id": "m0esmir",
      "author": "Arikaido777",
      "body": "glad this has 0 impact on me and my vizio tv that will never connect to my network",
      "score": 1,
      "created_utc": 1733338153.0,
      "replies": []
    },
    {
      "id": "m0espq9",
      "author": "therankin",
      "body": "As I've always said. Don't connect your smart TV to the internet and you won't have an issue. I do that with my Samsung TV and just use a Google TV plugged in to it. Works great. No injected ads from Google besides youtube obviously.",
      "score": 1,
      "created_utc": 1733338179.0,
      "replies": []
    },
    {
      "id": "m0eudry",
      "author": "legenduu",
      "body": "Vizio yuck",
      "score": 1,
      "created_utc": 1733338674.0,
      "replies": []
    },
    {
      "id": "m0ew6dg",
      "author": "None",
      "body": "Do these tvs take HDMI input? It's simple you buy a raspberry pi5 and HDMI it to your \"big computer screen\" and run adblock",
      "score": 1,
      "created_utc": 1733339211.0,
      "replies": []
    },
    {
      "id": "m0eyksq",
      "author": "None",
      "body": "I just use appleTV. Nothing on the TV I use. It’s all terrible and slow ",
      "score": 1,
      "created_utc": 1733339933.0,
      "replies": []
    },
    {
      "id": "m0f0hh4",
      "author": "Myklindle",
      "body": "Perfect parent company for those shitty tvs.  Fucking Ladanian Tomlinson",
      "score": 1,
      "created_utc": 1733340504.0,
      "replies": [
        {
          "id": "m0f7lic",
          "author": "flirtmcdudes",
          "body": "They used to be the best bang for the buck, now they’re just mid",
          "score": 1,
          "created_utc": 1733342636.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0f1sot",
      "author": "chickenintendo",
      "body": "Don’t connect the tv to the internet 🤷🏼‍♀️",
      "score": 1,
      "created_utc": 1733340897.0,
      "replies": []
    },
    {
      "id": "m0f1tkd",
      "author": "its0matt",
      "body": "I have an AWESOME Hisense that I just bought. My first smart TV. When on, It literally defaults to ads. For shows, Channels, products, services, ect. This is the start of Idiocracy",
      "score": 1,
      "created_utc": 1733340905.0,
      "replies": []
    },
    {
      "id": "m0f4t6x",
      "author": "Ketsuo",
      "body": "I thought Vizios were made by Sony. I haven’t had any issues out of mine.",
      "score": 1,
      "created_utc": 1733341804.0,
      "replies": []
    },
    {
      "id": "m0famii",
      "author": "gargravarr2112",
      "body": "And this is why I never, ever connect my TV to the internet.",
      "score": 1,
      "created_utc": 1733343541.0,
      "replies": []
    },
    {
      "id": "m0fapig",
      "author": "Soulprism",
      "body": "Like I would ever hook up any tv to the network….",
      "score": 1,
      "created_utc": 1733343567.0,
      "replies": []
    },
    {
      "id": "m0fbkon",
      "author": "100GbE",
      "body": "Imagine if everyone just cancelled that shit today and stopped buying them.\n\n\nFantasy land I know, _but imagine._",
      "score": 1,
      "created_utc": 1733343827.0,
      "replies": []
    },
    {
      "id": "m0fbnp0",
      "author": "babaroga73",
      "body": "Is or will there be custom OS tweaks for this plague? I fear buying a new \"smart\" shart tv.",
      "score": 1,
      "created_utc": 1733343853.0,
      "replies": []
    },
    {
      "id": "m0fbsfw",
      "author": "geddy",
      "body": "I always thought of it this way, if they’re going to lower the prices of TVs and subsidize with ads, I’ll happily buy the TV for a cheaper price and never connect it to the Internet. I’ll simply let somebody else leave the ads on so I can get cheaper televisions. Smart TVs are the best thing to happen to my wallet!\n\nIt’s the same with credit cards, I pay off my bill in full every month and get loads of points, paid for by people who pay massive amounts of interest.",
      "score": 1,
      "created_utc": 1733343892.0,
      "replies": []
    },
    {
      "id": "m0fjz2b",
      "author": "NoCaterpillar1584",
      "body": "It’s the same thing as Amazon’s fireTV, the only news here is “it happened”",
      "score": 1,
      "created_utc": 1733346317.0,
      "replies": []
    },
    {
      "id": "m0fllnu",
      "author": "Jeff_72",
      "body": "I have never seen a single ad on any of my three Vizio tvs … step one, do not have Ethernet connected nor WiFi active on the tv. Step two, use an AppleTV",
      "score": 1,
      "created_utc": 1733346792.0,
      "replies": []
    },
    {
      "id": "m0fohfw",
      "author": "soytuamigo",
      "body": "I wish everyone had made the same fuss when Amazon did the same with both all their devices (which now includes TVs) and their Amazon homepage.",
      "score": 1,
      "created_utc": 1733347623.0,
      "replies": []
    },
    {
      "id": "m0fp5rx",
      "author": "monstermash420",
      "body": "I’m starting to lose faith in my beloved Wal-Mart",
      "score": 1,
      "created_utc": 1733347815.0,
      "replies": []
    },
    {
      "id": "m0fqxj7",
      "author": "Johnny_Menace",
      "body": "Haven’t seen a Vizio tv in years, did they get relegated to bargain bin trash tvs? They used to be todays Hisense and TCL",
      "score": 1,
      "created_utc": 1733348339.0,
      "replies": []
    },
    {
      "id": "m0fx5y1",
      "author": "Syrairc",
      "body": "I have a 42\" Vizio plasma tv from 2010 that still works perfectly. It's only 720p/1080i and has zero other features but still works, somehow.",
      "score": 1,
      "created_utc": 1733350212.0,
      "replies": []
    },
    {
      "id": "m0fycl5",
      "author": "Less-Dragonfruit-294",
      "body": "Thank fuck all I use my TV for is either movies or games.",
      "score": 1,
      "created_utc": 1733350581.0,
      "replies": []
    },
    {
      "id": "m0fzqg5",
      "author": "Funny_Perception420",
      "body": "![gif](giphy|HW05UrUSfAzZu)",
      "score": 1,
      "created_utc": 1733351017.0,
      "replies": []
    },
    {
      "id": "m0g17wb",
      "author": "None",
      "body": "I already ditched vizio years back. Wanna know why? Ads!",
      "score": 1,
      "created_utc": 1733351484.0,
      "replies": []
    },
    {
      "id": "m0g1o75",
      "author": "Moore2257",
      "body": "I punched my Vizio TV because it wouldn't shut off. The remote was 100% fine. I know I could've just unplugged it, but MAN, it felt good after dealing with that pile of shit for a year.",
      "score": 1,
      "created_utc": 1733351630.0,
      "replies": []
    },
    {
      "id": "m0g45fa",
      "author": "3006mv",
      "body": "Thanks for the heads up to not buy a Vizio",
      "score": 1,
      "created_utc": 1733352433.0,
      "replies": []
    },
    {
      "id": "m0gcna2",
      "author": "Mr_Shizer",
      "body": "And this is how you don’t sell a TV.",
      "score": 1,
      "created_utc": 1733355345.0,
      "replies": []
    },
    {
      "id": "m0gfmmi",
      "author": "RainaDPP",
      "body": "I wonder if there's a market for dumb TVs. Like, I know I would never buy a smart TV if I had the choice, and I feel like I'm not alone in that sentiment. Somebody's gonna come along and start selling dumb TVs again, right? Probably for an extreme markup, but still.",
      "score": 1,
      "created_utc": 1733356393.0,
      "replies": [
        {
          "id": "m0gjkbd",
          "author": "-NotEnoughMinerals",
          "body": "Why are the fact that the TV's being smart relevant at all? \n\nPeople actually use a tvs smart features? Isn't the UI always horrifically bad and slow? \n\nSerious question- people legitimately use that crap instead of a fire stick, Chromecast, etc?",
          "score": 1,
          "created_utc": 1733357790.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0gfo0u",
      "author": "shuznbuz36",
      "body": "No more smart tvs please. Thank you",
      "score": 1,
      "created_utc": 1733356407.0,
      "replies": []
    },
    {
      "id": "m0gii1r",
      "author": "h0tel-rome0",
      "body": "Rip Vizio. For me anyway",
      "score": 1,
      "created_utc": 1733357409.0,
      "replies": []
    },
    {
      "id": "m0gudk2",
      "author": "izziefans",
      "body": "Do not connect your tv to internet.",
      "score": 1,
      "created_utc": 1733361645.0,
      "replies": []
    },
    {
      "id": "m0guidc",
      "author": "jljue",
      "body": "I personally think that it is better to never hook up the smart TVs to the networks and use an Apple TV as the source.",
      "score": 1,
      "created_utc": 1733361693.0,
      "replies": []
    },
    {
      "id": "m0gv3bl",
      "author": "JonPileot",
      "body": "Its pretty easy at this point to build a TV streaming box. Don't connect your \"smart\" TV to the internet, connect it to a streaming box you control. Yes, its an extra step, but in the end its a much better user experience.",
      "score": 1,
      "created_utc": 1733361897.0,
      "replies": []
    },
    {
      "id": "m0gwrfx",
      "author": "Krimreaper1",
      "body": "Get an Apple TV, never connect the tv to the internet.",
      "score": 1,
      "created_utc": 1733362488.0,
      "replies": []
    },
    {
      "id": "m0gxri6",
      "author": "himenokuri",
      "body": "Vizio sucks my vizio tv lasted a year and a half",
      "score": 1,
      "created_utc": 1733362840.0,
      "replies": []
    },
    {
      "id": "m0h41dn",
      "author": "PotatoHunter_III",
      "body": "We're back to square one woth more targeted ads.\n\nNetflix, Amazon, Hulu, Disney+, Paramount+, HBO Max, Discovery, Science, etc. all these fucks have ads now and we're being forced to pay separately too.",
      "score": 1,
      "created_utc": 1733365113.0,
      "replies": []
    },
    {
      "id": "m0h6fus",
      "author": "VictoriousStalemate",
      "body": "Time to dust off the old 14-inch black and white Sony television.  Maybe get a new set of rabbit ears.",
      "score": 1,
      "created_utc": 1733365995.0,
      "replies": []
    },
    {
      "id": "m0h9gar",
      "author": "None",
      "body": "Thanks for the warning. Note to self- avoid Visio tv",
      "score": 1,
      "created_utc": 1733367102.0,
      "replies": []
    },
    {
      "id": "m0he7a4",
      "author": "aBeaSTWiTHiNMe",
      "body": "But can barely pay a decent wage",
      "score": 1,
      "created_utc": 1733368889.0,
      "replies": []
    },
    {
      "id": "m0hef9u",
      "author": "None",
      "body": "I am keeping my non smart flat tv until it dies for exactly this reason.",
      "score": 1,
      "created_utc": 1733368975.0,
      "replies": []
    },
    {
      "id": "m0hgu3o",
      "author": "NoodlerFrom20XX",
      "body": "Vizio went to shit years ago. They used to be a great buy: good quality at an odd brand price. But then they loaded their sets with software and the tvs sucked. I got suckered into buying a Vizio a few years ago and was quite disappointed.",
      "score": 1,
      "created_utc": 1733369920.0,
      "replies": []
    },
    {
      "id": "m0hi0z8",
      "author": "singlejeff",
      "body": "I haven’t ever connected my TV to the internet, I’m always using a separate box to do that.",
      "score": 1,
      "created_utc": 1733370396.0,
      "replies": [
        {
          "id": "m0hqrpr",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1733374131.0,
          "replies": [
            {
              "id": "m0jvqmd",
              "author": "singlejeff",
              "body": "Yeah, I'm sure Amazon's Fire TV appliances phone home often.",
              "score": 1,
              "created_utc": 1733413089.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0hle55",
      "author": "nightspell",
      "body": "Don't care! I don't connect my smartTV to the internet I plug in a Roku Ultra and use that.",
      "score": 1,
      "created_utc": 1733371784.0,
      "replies": []
    },
    {
      "id": "m0hmym5",
      "author": "ShortHandz",
      "body": "Vizio has gone to shit over the past 5 years. Enjoy it Walmart.",
      "score": 1,
      "created_utc": 1733372453.0,
      "replies": []
    },
    {
      "id": "m0ho8d8",
      "author": "getoffmeyoutwo",
      "body": "Someone bold enough to step up and answer the question is there anything worse than Roku",
      "score": 1,
      "created_utc": 1733373001.0,
      "replies": []
    },
    {
      "id": "m0hsb8t",
      "author": "stinkdrink45",
      "body": "Walmart, it’s what humans want.",
      "score": 1,
      "created_utc": 1733374828.0,
      "replies": []
    },
    {
      "id": "m0ht3hq",
      "author": "Frostsorrow",
      "body": "2.3 billion is honestly a steal for Walmart",
      "score": 1,
      "created_utc": 1733375190.0,
      "replies": []
    },
    {
      "id": "m0htwee",
      "author": "LochNessMansterLives",
      "body": "Is Vizio still the preferred Costco brand? Because that’s gonna change if this happens…",
      "score": 1,
      "created_utc": 1733375565.0,
      "replies": [
        {
          "id": "m0jnp3f",
          "author": "August_Runs_Red",
          "body": "It’s also Sam’s club specialty since Walmart and Sam’s club are owned by the same company",
          "score": 1,
          "created_utc": 1733410432.0,
          "replies": [
            {
              "id": "m0kbmwg",
              "author": "LochNessMansterLives",
              "body": "Yup that’s why I mentioned that.",
              "score": 1,
              "created_utc": 1733418018.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0hucdi",
      "author": "nixmix6",
      "body": "NEVER BUY VIZIO ITS FOR CON-SUMERS!!! BECOME PRO!!!",
      "score": 1,
      "created_utc": 1733375775.0,
      "replies": []
    },
    {
      "id": "m0hv2yg",
      "author": "SnooChipmunks2079",
      "body": "I honestly thought this happened a few years ago.",
      "score": 1,
      "created_utc": 1733376127.0,
      "replies": []
    },
    {
      "id": "m0i266j",
      "author": "landob",
      "body": "Honestly i always thought walmart owned vizio. I feel like walmart is the only place I ever seen the brand so i assumed it was like their in house brand. But then again I haven't actually been in the market for a tv in like 15 years.",
      "score": 1,
      "created_utc": 1733379829.0,
      "replies": []
    },
    {
      "id": "m0i2p5s",
      "author": "jmegaru",
      "body": "Screw ads, I paid for YouTube premium for years, then they increased the price so I cancelled, YouTube with ads was an awful experience, so I installed revanced, no more ads, if anytime in the future it stops working I'm quitting YouTube, same reason I don't watch broadcast tv or even own a tv since like 2014. I always subconsciously ignore ads anyways, they are so goddamn cringey and useless, I don't remember ever being influenced by an ad to buy a product or service.",
      "score": 1,
      "created_utc": 1733380124.0,
      "replies": []
    },
    {
      "id": "m0ig6xd",
      "author": "Wastoidian",
      "body": "Fuck, now that this brand is going to become absolute shit what can I turn to next? I love my Vizios vivid mode…",
      "score": 1,
      "created_utc": 1733388523.0,
      "replies": []
    },
    {
      "id": "m0iw67k",
      "author": "fundiedundie",
      "body": "Bought a Vizio once and never will again. Cheap shitass brand.",
      "score": 1,
      "created_utc": 1733398876.0,
      "replies": []
    },
    {
      "id": "m0kwyf0",
      "author": "Cool_Cheetah658",
      "body": "My Vizio is not connected to the Internet. No need to do so. I use my Roku for all the streaming on it. The rest of the ads are filtered via PiHole. All is going well with it so far.",
      "score": 1,
      "created_utc": 1733424518.0,
      "replies": []
    },
    {
      "id": "m0q7282",
      "author": "Instance_of_wit",
      "body": "So they can advertise to you, or so they can create and sell advertising space? \n\nProbably both.",
      "score": 1,
      "created_utc": 1733502301.0,
      "replies": []
    },
    {
      "id": "m0cyvi3",
      "author": "firedrakes",
      "body": "tcl and hensense took vizio  tv sales",
      "score": 1,
      "created_utc": 1733316253.0,
      "replies": []
    },
    {
      "id": "m0f5uk7",
      "author": "Hot_Negotiation3480",
      "body": "Vizio is not a bad TV, but the ads part also means that they are spying on your viewing habits. The fact they do this on everyone should be illegal.",
      "score": 1,
      "created_utc": 1733342112.0,
      "replies": []
    },
    {
      "id": "m0d9a12",
      "author": "Brother191",
      "body": "Walmart is  Not my choice of goods and groceries anymore. That's why? They have to ask themselves",
      "score": 1,
      "created_utc": 1733320550.0,
      "replies": []
    },
    {
      "id": "m0de4a2",
      "author": "BluePeriod_",
      "body": "I have a TCL and it has its own smart features. I never use them. I just wish that when I turned on the TV it would go straight to my Apple TV so I don’t even have to see that ugly Google menu.",
      "score": 1,
      "created_utc": 1733322369.0,
      "replies": []
    },
    {
      "id": "m0er1sm",
      "author": "Greyboxer",
      "body": "Gross. Still not stepping into a Walmart no matter how many ads they throw at me",
      "score": 1,
      "created_utc": 1733337680.0,
      "replies": []
    },
    {
      "id": "m0et6zi",
      "author": "Traveler_90",
      "body": "Apple TV is the way. No ads whatsoever and can plug into any tv. I do not connect any of my tvs to the internet for this specific reason.",
      "score": 1,
      "created_utc": 1733338323.0,
      "replies": []
    },
    {
      "id": "m0evso6",
      "author": "None",
      "body": "I mean. You can just ignore them.",
      "score": 1,
      "created_utc": 1733339096.0,
      "replies": [
        {
          "id": "m0exfa4",
          "author": "cyberentomology",
          "body": "By not buying them.",
          "score": 3,
          "created_utc": 1733339584.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0d0khz",
      "author": "PraetorianAE",
      "body": "This is very old news",
      "score": 0,
      "created_utc": 1733317008.0,
      "replies": []
    },
    {
      "id": "m0cxy6l",
      "author": "oeeiae",
      "body": "If it's the way Amazon implements theirs and if it cuts the price of the TV down to pocket change like Amazon's televisions, it's a fair trade-off. If you don't like the ads, don't buy the budget TV that is supplemented by ad revenue.",
      "score": -9,
      "created_utc": 1733315828.0,
      "replies": [
        {
          "id": "m0d62ki",
          "author": "SpiderSlitScrotums",
          "body": "It is more like the TV you bought at full price gets updated so that it is full of ads, lags, and crashes a lot.",
          "score": 12,
          "created_utc": 1733319299.0,
          "replies": [
            {
              "id": "m0d8psa",
              "author": "Mocavius",
              "body": "Fr. 58\" bought three years ago is now gonna get wonderful ads for a company I loathe.",
              "score": 3,
              "created_utc": 1733320336.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0d09o3",
          "author": "kapege",
          "body": "Better is to trick them with a PiHole and block all that stuff.",
          "score": 3,
          "created_utc": 1733316876.0,
          "replies": [
            {
              "id": "m0dy08p",
              "author": "robzen92",
              "body": "Does a Pihole block implemented adds? Like adds during streams and adds in some Hardware OS?",
              "score": 1,
              "created_utc": 1733328912.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m0dmo6f",
      "author": "Ruttagger",
      "body": "Am I the only one that updates the tv, then disconnects from the internet?",
      "score": 0,
      "created_utc": 1733325318.0,
      "replies": [
        {
          "id": "m0eeou6",
          "author": "AlphaTangoFoxtrt",
          "body": "I don't even update it. It works fine, and it's not connected to the internet. What do I need an \"update\" for?",
          "score": 1,
          "created_utc": 1733333981.0,
          "replies": [
            {
              "id": "m0efsyo",
              "author": "Ruttagger",
              "body": "Ya I haven't updated my OLED in over a year.  I turn off auto updates on everything I own.  Updates do more harm than good alot of the times.",
              "score": 0,
              "created_utc": 1733334317.0,
              "replies": [
                {
                  "id": "m0egnnt",
                  "author": "AlphaTangoFoxtrt",
                  "body": "If it connects to the internet, I update. A lot of updates are security fixes, even minor ones. But if I don't connect it to the internet, I don't care.",
                  "score": 1,
                  "created_utc": 1733334572.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m0gipny",
          "author": "h0tel-rome0",
          "body": "Do you use a Roku or Apple tv or similar instead? Those all have ads too",
          "score": 1,
          "created_utc": 1733357485.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0ed0q2",
      "author": "muskratboy",
      "body": "Vizio, like all smart TVs, is constantly recording whatever is on your screen, compressing it, and sending it back to the company to sell to advertisers. This is why these TVs are so cheap, because they actually make money off your viewing data. You are the product!",
      "score": 0,
      "created_utc": 1733333480.0,
      "replies": []
    },
    {
      "id": "m0dlh19",
      "author": "Ajreil",
      "body": "That's $121 per customer. Lol.",
      "score": 0,
      "created_utc": 1733324920.0,
      "replies": []
    },
    {
      "id": "m0eclli",
      "author": "GagOnMacaque",
      "body": "The last nail on the coffin for smart TVs.",
      "score": 0,
      "created_utc": 1733333353.0,
      "replies": []
    },
    {
      "id": "m0emgb2",
      "author": "MCGaming1991",
      "body": "I thought Vizio was a Walmart brand since the beginning. Now I know.",
      "score": 0,
      "created_utc": 1733336308.0,
      "replies": [
        {
          "id": "m0g28uw",
          "author": "user3296",
          "body": "If I recall correctly, they started as a Walmart exclusive brand.  Not a Walmart brand in and of itself.  So Walmart was the exclusive retailer for Vizio TVs.  That lasted maybe there first 4 or 5 years in the biz, and then their products were able to be sold at all retailers.",
          "score": 1,
          "created_utc": 1733351816.0,
          "replies": [
            {
              "id": "m0g2nh3",
              "author": "MCGaming1991",
              "body": "You know what, I feel like I remember that now",
              "score": 1,
              "created_utc": 1733351946.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m0eygzc",
          "author": "None",
          "body": "Best Buy",
          "score": 0,
          "created_utc": 1733339901.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m0enetc",
      "author": "Rholand_the_Blind1",
      "body": "Someone please explain why a company has to pay to advertise on a billboard but somehow that same company doesn't have to pay me to post ads on my fucking TV and phone both of which I own using the Internet I pay for",
      "score": 0,
      "created_utc": 1733336595.0,
      "replies": [
        {
          "id": "m0exsxs",
          "author": "cyberentomology",
          "body": "They don’t have to pay to advertise on billboards that they own…",
          "score": 0,
          "created_utc": 1733339698.0,
          "replies": [
            {
              "id": "m0fg27q",
              "author": "Rholand_the_Blind1",
              "body": "They definitely don't own my TV",
              "score": 1,
              "created_utc": 1733345174.0,
              "replies": [
                {
                  "id": "m0fikge",
                  "author": "cyberentomology",
                  "body": "That’s what *you* think.",
                  "score": 1,
                  "created_utc": 1733345907.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0eoul3",
      "author": "Angry_Villagers",
      "body": "You guys don’t use a network wide Adblocker, yet? Why not?\n\nEdit: for anyone curious, I would recommend a PiHole. It will block ads like the ones you’ll get on a smart tv homepage and many others. It also reduces your overall network traffic. Combined this with using a computer with Firefox and some Adblock extensions and you’ll practically never see an ad again unless you watch a live broadcast. You can even block promotional segments of YouTube videos where the content creator promotes some product. You can block it all and be ad free.\n\nThis won’t block ads from streaming services that are embedded in their content. But it blocks pretty much everything else.",
      "score": 0,
      "created_utc": 1733337023.0,
      "replies": [
        {
          "id": "m0exotp",
          "author": "cyberentomology",
          "body": "Because most traffic is HTTPS, and you can’t see the page content to selectively block it.",
          "score": 0,
          "created_utc": 1733339664.0,
          "replies": [
            {
              "id": "m0ggj6n",
              "author": "Angry_Villagers",
              "body": "Lmao, you don’t know how this works.\n\nUse a DNS server. PiHole.",
              "score": 0,
              "created_utc": 1733356711.0,
              "replies": [
                {
                  "id": "m0gsv3g",
                  "author": "cyberentomology",
                  "body": "LOL, DNS blocking of ads is like using naval artillery to swat a fly. There’s gonna be significant collateral damage.",
                  "score": 0,
                  "created_utc": 1733361106.0,
                  "replies": [
                    {
                      "id": "m0h2tb7",
                      "author": "Angry_Villagers",
                      "body": "You’re talking out of your ass and it shows",
                      "score": 0,
                      "created_utc": 1733364664.0,
                      "replies": [
                        {
                          "id": "m0h3k57",
                          "author": "cyberentomology",
                          "body": "That may have been an effective strategy 30 years ago when there was a 1:1:1 relationship between servers, IP addresses, and hostnames. \n\nGo ahead and try blocking YouTube ads that way and see how that works for you.",
                          "score": 0,
                          "created_utc": 1733364940.0,
                          "replies": [
                            {
                              "id": "m0h43wf",
                              "author": "Angry_Villagers",
                              "body": "What is the collateral damage? The goalposts of your argument get damaged in the move?",
                              "score": 1,
                              "created_utc": 1733365138.0,
                              "replies": [
                                {
                                  "id": "m0h5csw",
                                  "author": "cyberentomology",
                                  "body": "Blocking all kinds of other shit that keeps things working. \n\nMerely a host/domain name isn’t enough to determine with sufficient confidence that something is an ad.",
                                  "score": 0,
                                  "created_utc": 1733365597.0,
                                  "replies": [
                                    {
                                      "id": "m0h6fu1",
                                      "author": "Angry_Villagers",
                                      "body": "Right well, despite your ability to talk out of your ass, you have no value to ad to this conversation.",
                                      "score": 1,
                                      "created_utc": 1733365995.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m0d2j9s",
      "author": "wrightscott57",
      "body": "I’ve come to always assume that buying my account data was apart of the deal but when it gets reported on as a featured headline is just sad and a sign of the times",
      "score": -1,
      "created_utc": 1733317854.0,
      "replies": []
    },
    {
      "id": "m0dbm98",
      "author": "GamerRadar",
      "body": "And? What’s the news here. Y’all use amazon and google, they do the same stuff with their smart devices. Walmart is trying to compete with Amazon: one way they’ll do that is with Walmart+, ONN and now Vizio.  They’ll probably combine a few of the brand, maybe we’ll get Wall-E (get it???) smart assistants in the future lol\n\nEdit: why am I being downvoted?",
      "score": -5,
      "created_utc": 1733321448.0,
      "replies": [
        {
          "id": "m0dckks",
          "author": "thisischemistry",
          "body": "> Y’all use amazon and google\n\nI do my best not to. It's tough to avoid completely but I, generally, avoid their sites and products.",
          "score": 4,
          "created_utc": 1733321804.0,
          "replies": []
        }
      ]
    }
  ]
}