{
  "post": {
    "title": "Samsung's Odyssey OLED G6 is the world's first 500Hz OLED gaming monitor | Now available in Southeast Asia, with a Western release expected in late 2025",
    "author": "chrisdh79",
    "id": "1klhxwb",
    "score": 135,
    "created_utc": 1747129879.0,
    "selftext": "",
    "num_comments": 105,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1klhxwb/samsungs_odyssey_oled_g6_is_the_worlds_first/"
  },
  "comments": [
    {
      "id": "ms2k88l",
      "author": "Sweaty_Commercial229",
      "body": "Pray it doesn't have the god awful smartOS, locking features behind registration and the worst port switching /signal detection I've ever seen. Or better wait for the panel to be used by another manufacturer with better or no SmartOS features IMO.",
      "score": 64,
      "created_utc": 1747134184.0,
      "replies": [
        {
          "id": "mseomf0",
          "author": "foxhelp",
          "body": "Their latest G8 G81SF got rid of the smart OS, so there is a good chance this will as well. \n\nMonitors unboxed talked about it here\nhttps://youtu.be/_c3y9amPT8c",
          "score": 3,
          "created_utc": 1747290803.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms2dvvm",
      "author": "I_will_take_that",
      "body": "Feels past 144 things are over kill though",
      "score": 64,
      "created_utc": 1747130894.0,
      "replies": [
        {
          "id": "ms2l1xc",
          "author": "StaysAwakeAllWeek",
          "body": "60 vs 144 is an enormous visual difference\n\n144 vs 240 is unnoticeable for most\n\n240 vs 360 is unnoticeable for most\n\n360 vs 500 is unnoticeable for most\n\nBut 144 vs 500 is an enormous visual difference\n\nThe issue isn't that it's overkill, it's that each incremental upgrade isn't earth shattering the way 60 to 144 is. It's pretty easy to demonstrate that the human eye can still detect improvements as high as 10000hz in specific scenarios. You can do it yourself with an arduino and a LED - make the LED blink at a few kHz and shake it about and you'll see it flickering. Once you see it you'll never unsee - you'll start spotting car headlights flickering at their PWM frequency as they drive past",
          "score": 47,
          "created_utc": 1747134568.0,
          "replies": [
            {
              "id": "ms2upqs",
              "author": "Jasonguyen81",
              "body": "Certain enormous visual difference to my wallet size after",
              "score": 40,
              "created_utc": 1747138671.0,
              "replies": [
                {
                  "id": "ms2utyt",
                  "author": "StaysAwakeAllWeek",
                  "body": "144hz used to be expensive too. Give it a few years.",
                  "score": 5,
                  "created_utc": 1747138718.0,
                  "replies": [
                    {
                      "id": "msepbbt",
                      "author": "foxhelp",
                      "body": "But I want to splurge on my gaming now?! \n\nAmen though. I am running 12 year old dell ultrasharp's and have been looking for a good replacement for 8hr productivity and few hours gaming and movie watching. \n\nProblem is all the fancy OLEDs get burn in from productivity, and going up to a tv is proving difficult to make a final decision (considering the u88n or the qn900D but they are quite different price brackets.) \n\nany rate I have been dragging my feet while stuff keeps improving.",
                      "score": 1,
                      "created_utc": 1747291205.0,
                      "replies": [
                        {
                          "id": "msey4z3",
                          "author": "StaysAwakeAllWeek",
                          "body": ">Problem is all the fancy OLEDs get burn in from productivity\n\nIt doesn't happen anywhere near as fast as it used to, and if you turn the brightness down below max while you're doing productivity it most likely won't happen for as long as you have the monitor",
                          "score": 1,
                          "created_utc": 1747296614.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms2uxkx",
                  "author": "Pheonix1025",
                  "body": "It’ll get cheaper over time, I picked up a 1080p/240Hz IPS display a couple years ago for less than 200$",
                  "score": 2,
                  "created_utc": 1747138758.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms5tl1c",
              "author": "Starfuri",
              "body": "So you see the matrix uh?",
              "score": 5,
              "created_utc": 1747170817.0,
              "replies": []
            },
            {
              "id": "ms4ii7n",
              "author": "bonesnaps",
              "body": "Except it's all redundant when the only games you can run past 144hz are ghetto esport games with graphics from 2010 like Counterstrike or League.\n\n\n\nI have a 165 oled 3440x1440 and my 9800X3D/RTX 3070 build can only push most modern games to around 80-120 fps.\n\n\nTo push 500hz in actual good looking games you'd need triple SLI'd 5090s basically.\n\n\nI am skipping this gen of gpus since the 5000 series was a hardware + pricing disaster and AMD is only marginally better. Maybe nextgen of AMD with be worth it for me.",
              "score": 14,
              "created_utc": 1747157218.0,
              "replies": [
                {
                  "id": "ms6ku3d",
                  "author": "Cynical_Manatee",
                  "body": "It's a very small market, but rhythm games like OSU really benefits from super high refresh rates. Or any game where you are looking at fast but simple motion.",
                  "score": 8,
                  "created_utc": 1747179839.0,
                  "replies": []
                },
                {
                  "id": "mse2p21",
                  "author": "Edarneor",
                  "body": "Yeah, I was going to mention it too... What modern triple-A game would ever run in 500 fps? Even with upscale and framegen. There are none. maybe on future hardware from 10 years past now...",
                  "score": 1,
                  "created_utc": 1747279996.0,
                  "replies": []
                },
                {
                  "id": "ms7x694",
                  "author": "Kiseido",
                  "body": "You might want to reduce quality settings below \"Ultra\" if you actually want higher frames per second. You might find many multiplayer games can be run well over 200fps on low settings with your stated hardware.",
                  "score": 0,
                  "created_utc": 1747198154.0,
                  "replies": [
                    {
                      "id": "ms9t4zb",
                      "author": "cbytes1001",
                      "body": "That’s not a trade most people would make. Personally, I’d rather look at beautiful graphics at 120Hz than pixelated edges, less defined textures at 200Hz.",
                      "score": 6,
                      "created_utc": 1747231532.0,
                      "replies": [
                        {
                          "id": "msb8kdl",
                          "author": "Kiseido",
                          "body": "If you are attempting to play a competitive game, then the trade off is often worth it. Additionally, you are unlikely to be admiring the details when all your attention is spent on checking doors and corners for enemies (or etc).\n\nFor instance, I play Halo Infinite on (nearly) all low settings and with upscaling from 788p up to 4k, so I can maintain a constant 240fps, and I play much better at that higher frame rate, despite my monitor only being a 60hz model. The input latency reduction is substantial, and can be felt even if I only get to see one of every four frames generated.",
                          "score": 1,
                          "created_utc": 1747246349.0,
                          "replies": [
                            {
                              "id": "msbdshs",
                              "author": "cbytes1001",
                              "body": "The person you replied to originally specifically stated “To push 500Hz in actual good looking games” so I am really only speaking to that. \n\nIn competitive games then sure, not only do you want frames, but also the fewer shadows the easier it is to see the other player.",
                              "score": 4,
                              "created_utc": 1747247869.0,
                              "replies": [
                                {
                                  "id": "msbgsbm",
                                  "author": "Kiseido",
                                  "body": "I hadnt noticed it wasnt the original commenter i had replied to, thanks for pointing that out.\n\nExtreme framerates for non-competitive (or otherwise non-fast paced) games aren't likely to help all that much. The slight improvement in input latency won't really be immediately noticable, but rather only showing itself in aggregate when comparing how well you did against others with low latencies.\n\nI would argue shadows tend to help, at least where dynamic shadows are a thing, seeing a players shadow appear on a wall prior to them coming around the corner can be strongly helpful. \n\nMany games are only a bit less pretty when at medium or low settings, but tend to perform much much better than ultra.\n\nUltra is a preset that tends to be made such that halo-tier or high-end *next generation* cards are required to run the game at >=60fps. \n\nSo running a modern game at Ultra or even high, and also desiring high framerates, would seem to be conflicting objectives. And it would seem they are likely to be conflicting objectives for the foreseeable future.",
                                  "score": 1,
                                  "created_utc": 1747248733.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms4irn5",
                  "author": "StaysAwakeAllWeek",
                  "body": "I can't think of a better candidate for kHz monitors than counterstrike\n\nAlso, nvidia 50 cards can probably frame gen their way up there in a pinch",
                  "score": -4,
                  "created_utc": 1747157292.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msl09lb",
              "author": "Otaraka",
              "body": "Without double blinded testing to verify it, these kinds of claims are dubious.  Audiophiles have made claims like this for decades.\n\nBut the marketing people will be very happy and overkill can be good for peace of mind.",
              "score": 2,
              "created_utc": 1747376753.0,
              "replies": [
                {
                  "id": "mslf9we",
                  "author": "StaysAwakeAllWeek",
                  "body": "[linus went there years ago](https://youtu.be/OX31kZbAXsA?si=nDQn9fe-Xkos-a16)\n\ntldw: even under double blind conditions the difference in gaming performance is easily measurable, whether you're a noob or a professional, and the trained eye can spot the difference pretty consistently",
                  "score": 1,
                  "created_utc": 1747386029.0,
                  "replies": [
                    {
                      "id": "msljwbo",
                      "author": "Otaraka",
                      "body": "That was a a really interesting watch, thank you. To be picky, it wasn’t double blinded and it wasn’t just the monitor refresh rate being compared. \n\nIn my view it supported the idea that 144 onwards is pretty marginal even when it was the whole fps being limited rather than just the monitor, let alone 240 vs 500 which obviously couldn’t be tested there. ",
                      "score": 1,
                      "created_utc": 1747388886.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms4ozma",
              "author": "SupMonica",
              "body": "> Once you see it you'll never unsee - you'll start spotting car headlights flickering at their PWM frequency as they drive past\n\nYeah, no thanks. I don't need to be bothered by such things. I want to keep at a steady 60fps, and boost the graphics after that.",
              "score": 4,
              "created_utc": 1747159049.0,
              "replies": [
                {
                  "id": "ms4r25c",
                  "author": "StaysAwakeAllWeek",
                  "body": "Frame gen was made for people like you",
                  "score": -2,
                  "created_utc": 1747159643.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msqqgau",
              "author": "Cheap-Plane2796",
              "body": "Since oled panels are still sample and hold they suffer heavily from sample and hold blue in motion. 360 fps/hz MASSIVELY reduces sample and hold blur over 120 or 144 hz.\n\nFirst time ever for me that a sample and hold panel looks as clear in motion as crt did. In games where i can get such good fps",
              "score": 1,
              "created_utc": 1747454550.0,
              "replies": [
                {
                  "id": "msqr1uq",
                  "author": "StaysAwakeAllWeek",
                  "body": "Even without sample and hold on strobed displays there is still the residual stroboscopic artifacting that is impossible to remove in any way other than increasing framerate. It doesn't necessarily look blurred but it still looks imperfect",
                  "score": 1,
                  "created_utc": 1747454834.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms34h8y",
              "author": "lart2150",
              "body": "I have a 144 monitor and 60hz monitors and have a hard time telling the difference.  The real solution is to get older.  In another decade I might be able to go down to 50hz.",
              "score": -1,
              "created_utc": 1747142232.0,
              "replies": [
                {
                  "id": "ms3qfde",
                  "author": "Abigail716",
                  "body": "I have a 240hz monitor And I can tell a huge difference if the settings get messed up and it switches to one of the lower ones. 144 vs 240 It's pretty noticeable, but if it goes down to 60 it is a massive difference Even fixing it to 144.",
                  "score": 5,
                  "created_utc": 1747149066.0,
                  "replies": []
                },
                {
                  "id": "ms43or1",
                  "author": "Itwasallyell0w",
                  "body": "yeah you definitely have vision problems then.\n60-144 is actually an extreme difference, you can't even come back to 60 fps... Now even 144 to 180 is a big difference for me.",
                  "score": 1,
                  "created_utc": 1747152916.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms797cg",
              "author": "Tee__B",
              "body": "144 to 240 is incredibly noticeable. Even the cursor looks super janky when it's at low refresh.",
              "score": -1,
              "created_utc": 1747188430.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms2hifc",
          "author": "WllmZ",
          "body": "Thats what I thought with 60hz phone screens but I can't go back to 60hz anymore now I've used 120hz.",
          "score": 8,
          "created_utc": 1747132858.0,
          "replies": []
        },
        {
          "id": "ms328hs",
          "author": "No-Bother6856",
          "body": "It gets into diminishing returns, but even then a leap this large should make a difference. Motion clarity on a CRT is still better than a 120hz OLED because sample and hold displays inherently have this issue. The only way to reduce this issue is to run higher and higher refresh rates. Until this sample and hold blur is entirely imperceptible, there will be benefit from going higher and higher with the refresh rate.",
          "score": 1,
          "created_utc": 1747141451.0,
          "replies": []
        },
        {
          "id": "ms41dyk",
          "author": "stdfan",
          "body": "Getting closer to perfect motion clarity.",
          "score": 1,
          "created_utc": 1747152234.0,
          "replies": []
        },
        {
          "id": "ms2f7qs",
          "author": "burnSMACKER",
          "body": "Human eye can't see anything more than 60",
          "score": -48,
          "created_utc": 1747131631.0,
          "replies": [
            {
              "id": "ms2hqit",
              "author": "vision0709",
              "body": "Bro, get them eyes checked",
              "score": 10,
              "created_utc": 1747132974.0,
              "replies": [
                {
                  "id": "ms2muyq",
                  "author": "Dolatron",
                  "body": "Screen tearing as head turns",
                  "score": 5,
                  "created_utc": 1747135389.0,
                  "replies": []
                },
                {
                  "id": "ms44rzu",
                  "author": "burnSMACKER",
                  "body": "It was a sarcastic comment. Get your brain checked.",
                  "score": -4,
                  "created_utc": 1747153239.0,
                  "replies": [
                    {
                      "id": "msnk8fe",
                      "author": "FeloniousReverend",
                      "body": "If only there was some agreed upon way to mark a post as sarcasm or a joke. It would have to be really simple though.\n\nMaybe /s?\n\n/s",
                      "score": 0,
                      "created_utc": 1747414546.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms2j6nt",
              "author": "I_will_take_that",
              "body": "I definitely track better at 144 compared to 60 when I play FPS games though",
              "score": 6,
              "created_utc": 1747133683.0,
              "replies": []
            },
            {
              "id": "ms35z54",
              "author": "JMccovery",
              "body": "I have some of the worst eyes in the world, and I see a *massive* difference between 60hz and 120/144hz (the crappy 27\" Acer I have drops to 6-bit + FRC at 144hz, so I run it at 120).\n\nHell, I can see and *feel* (less eye strain) a difference just going from 60hz to 75hz.",
              "score": 1,
              "created_utc": 1747142738.0,
              "replies": [
                {
                  "id": "ms43wh7",
                  "author": "Itwasallyell0w",
                  "body": "I can confirm 144 to 180 helps a lot with eye strain.",
                  "score": 1,
                  "created_utc": 1747152979.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms2fngn",
              "author": "Chillindude82Nein",
              "body": "Bro the human eye can't see past 1080p 30 fps. Stop trying to spread misinformation, you harlot.",
              "score": -5,
              "created_utc": 1747131870.0,
              "replies": [
                {
                  "id": "ms363c5",
                  "author": "JMccovery",
                  "body": ">/s\n\nYou dropped this.",
                  "score": 3,
                  "created_utc": 1747142777.0,
                  "replies": [
                    {
                      "id": "ms379nn",
                      "author": "Chillindude82Nein",
                      "body": "Figured calling someone a harlot in the wrong context was /s enough...",
                      "score": 2,
                      "created_utc": 1747143179.0,
                      "replies": [
                        {
                          "id": "ms37kd3",
                          "author": "JMccovery",
                          "body": "Bruh, this is Reddit, /s is pretty much necessary.",
                          "score": 3,
                          "created_utc": 1747143279.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms2jty3",
                  "author": "SparklePonyBoy",
                  "body": "Tell us you don't game without telling us you don't game.",
                  "score": -4,
                  "created_utc": 1747133993.0,
                  "replies": [
                    {
                      "id": "ms2ld6z",
                      "author": "Chillindude82Nein",
                      "body": "Tell us you are a dense person without telling us you're dense.",
                      "score": -3,
                      "created_utc": 1747134712.0,
                      "replies": [
                        {
                          "id": "ms2locp",
                          "author": "SparklePonyBoy",
                          "body": "Yeah, you're proving it. \n\nWhen my fps is 144, the game looks really nice. It's smooth. 100 fps, still nice, just less. 60 fps, I can tell the game is struggling. 30 fps, super choppy. This is with a 144 hz refresh rate.",
                          "score": -7,
                          "created_utc": 1747134854.0,
                          "replies": [
                            {
                              "id": "ms2lwa1",
                              "author": "Chillindude82Nein",
                              "body": "r/whoosh",
                              "score": 12,
                              "created_utc": 1747134953.0,
                              "replies": [
                                {
                                  "id": "ms2m80b",
                                  "author": "SparklePonyBoy",
                                  "body": "Why do you have a vendetta against anyone enjoying content at a higher fps than you think is possible?",
                                  "score": -8,
                                  "created_utc": 1747135101.0,
                                  "replies": [
                                    {
                                      "id": "ms2mifu",
                                      "author": "Chillindude82Nein",
                                      "body": "r/whoosh",
                                      "score": 14,
                                      "created_utc": 1747135231.0,
                                      "replies": [
                                        {
                                          "id": "ms2vc88",
                                          "author": "Defelj",
                                          "body": "The double down was fantastic hahaha",
                                          "score": 3,
                                          "created_utc": 1747138916.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "ms2n0wc",
                                          "author": "SparklePonyBoy",
                                          "body": "Lol",
                                          "score": 0,
                                          "created_utc": 1747135462.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms2hsah",
                  "author": "vision0709",
                  "body": "You ok?",
                  "score": -5,
                  "created_utc": 1747132999.0,
                  "replies": [
                    {
                      "id": "ms2juaf",
                      "author": "kryst4line",
                      "body": "r/whoosh",
                      "score": 6,
                      "created_utc": 1747133998.0,
                      "replies": [
                        {
                          "id": "ms2k6gj",
                          "author": "vision0709",
                          "body": "r/woooosh? For insinuating he has a medical issue if his eyesight or vision processing was that bad?",
                          "score": -5,
                          "created_utc": 1747134161.0,
                          "replies": [
                            {
                              "id": "ms2k952",
                              "author": "kryst4line",
                              "body": "Yes, whoosh because you didn't catch the sarcasm",
                              "score": 7,
                              "created_utc": 1747134195.0,
                              "replies": []
                            },
                            {
                              "id": "ms2l5vv",
                              "author": "Chillindude82Nein",
                              "body": "Absolutely wooosh. Because I even gave a second tell that what I was saying was fucking stupid to avoid this very scenario.",
                              "score": 6,
                              "created_utc": 1747134618.0,
                              "replies": [
                                {
                                  "id": "ms2lj4u",
                                  "author": "vision0709",
                                  "body": "K",
                                  "score": -5,
                                  "created_utc": 1747134788.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms2i71j",
                      "author": "Chillindude82Nein",
                      "body": "Apparently the brains around here are stuck in 480i",
                      "score": 6,
                      "created_utc": 1747133204.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msbqaky",
      "author": "VRGIMP27",
      "body": "What is 500hz good for? Low persistence. 500 fps at 500hz means that each frame will be visible to the eye for 2 milliseconds.\n\nIf you have a good BenQ 144 HZ monitor and you use backlight Strobing, this monitor at 500 FPS will look as good as a 2 ms strobe.\n\nOLED pixels also switch on average in .25 milliseconds. If you use this monitor with frame generation, to lock to the 500 FPS, this monitor should look in motion like an analog picture tube.\n\nThink of A Dell P 1110 CRT monitor in motion.",
      "score": 3,
      "created_utc": 1747251528.0,
      "replies": [
        {
          "id": "mtjda1n",
          "author": "crashprime",
          "body": "This guy gets it. So many people think refresh rate needs to equal frames per second to benefit from the high refresh rates.",
          "score": 1,
          "created_utc": 1747859500.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms3jpdu",
      "author": "Edward_TH",
      "body": "I get that that's what they do, and that advancing tech is always good but... Excluding a very minute handful of games run on stupidly expensive and overkill hardware, what's the point of chasing this trail? How many people would have the exact combination of hardware, games, will to sacrifice detail/fidelity for smoother visuals and money to justify a consumer product launch over a custom made order only product?\n\n\nI mean, how many games can you *actually* run at 500 fps 1% low, at maxed graphical settings, even on literal top of the line hardware? Even if you could afford thousands of these monitors, how many years do you have to wait for the rest of the hardware to catch up in capability?",
      "score": 5,
      "created_utc": 1747147072.0,
      "replies": [
        {
          "id": "ms46j01",
          "author": "andynator1000",
          "body": "If you drop the graphics settings to less than ultra you can play a lot of games at 500fps on high-end hardware. This is mostly for competitive FPS players, though, who have a 40/5090 and play an older title.",
          "score": 1,
          "created_utc": 1747153750.0,
          "replies": [
            {
              "id": "ms4a2tl",
              "author": "Edward_TH",
              "body": "Yeah, but 500 average is MUCH different than 500 1% lows. Even cs2, lol, dota2 and starcraft can't really hit those numbers for 1% lows at 1080p. If you look at one of the latest video from LTT where they tune a very high end computer, cs2 sits at ~300fps 1% lows at 1080p. That's what seems odd to me on a market point of view: why pushing for a 500hz monitor that just a handful of people in the world would be willing to compromise with and buy because of external bottlenecks when you could market a \"only\" 360hz one but with lower response time, better brightness, better contrast, better color accuracy or other features that can make a difference and people actually care about enough to shell out some extra money?",
              "score": 0,
              "created_utc": 1747154791.0,
              "replies": [
                {
                  "id": "ms5h94i",
                  "author": "andynator1000",
                  "body": "Because some people own a 5090 and are playing old games. 1% lows are much less important when you’re in the hundreds of frames per second because even if your 1% lows are 100 fps lower than your average, your frame latency is not dramatically different. Regardless, if you want a 360hz monitor, they exist, but honestly a 4k 144hz monitor makes more sense for most people who are not interested in competitive shooters and own a high end gpu.",
                  "score": 0,
                  "created_utc": 1747167232.0,
                  "replies": [
                    {
                      "id": "ms5pfwi",
                      "author": "Edward_TH",
                      "body": "No, I know that they aren't useless. I'm just puzzled by the idea that there could be more demand for this than for a better, lower refresh rate display instead... The amount of people that have rigs even capable to reach these numbers isn't zero, but not that common either: how many of those are playing so much older games competively that they value marginally smoother experiences (let's be real, most of them are probably already rocking >240hz displays anyway) over a better image quality, better viewing angles or whatever?",
                      "score": 2,
                      "created_utc": 1747169584.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms9koep",
      "author": "Plz_PM_Steam_Keys",
      "body": "I feel just fine with my 120hz LG c3. 500hz sounds overkill and I bet very expensive",
      "score": 2,
      "created_utc": 1747228775.0,
      "replies": []
    },
    {
      "id": "msatlax",
      "author": "MSTRFLSH",
      "body": "Shame it's Samsung so will be dead within the 2 year warranty or 1 day after.",
      "score": 2,
      "created_utc": 1747242132.0,
      "replies": []
    },
    {
      "id": "ms2vvht",
      "author": "lirannl",
      "body": "I can't wait for people to go \"my CPU is 5Ghz, my screen is 1.4khz\"\n\n\n\"What? Only 1.4khz? You noob, my display does 2khz\" \n\n\nI like high framerates, I think they matter more than resolution, but come on, 500? Even 200 is overkill. ",
      "score": 5,
      "created_utc": 1747139122.0,
      "replies": [
        {
          "id": "ms32xk7",
          "author": "No-Bother6856",
          "body": "My 20 year old monitor says it has a 110khz refresh rate\n\nThats the horizontal refresh rate but just ignore that detail and it sounds more impressive.",
          "score": 2,
          "created_utc": 1747141696.0,
          "replies": []
        },
        {
          "id": "ms3krbo",
          "author": "Niten-Doraku",
          "body": "200 is absolutely not overkill for competitive games",
          "score": -3,
          "created_utc": 1747147387.0,
          "replies": [
            {
              "id": "ms9vulq",
              "author": "lirannl",
              "body": "I don't think many games have ticks lower than 5ms. ",
              "score": 1,
              "created_utc": 1747232365.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms447nq",
          "author": "Itwasallyell0w",
          "body": "200 overkill? I'd say is normal right now... ",
          "score": -2,
          "created_utc": 1747153071.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms2d3p8",
      "author": "inc0mingst0rm",
      "body": "But why?",
      "score": 5,
      "created_utc": 1747130440.0,
      "replies": [
        {
          "id": "ms30hx8",
          "author": "mr_ji",
          "body": "Because someone will buy it.",
          "score": 3,
          "created_utc": 1747140836.0,
          "replies": []
        },
        {
          "id": "ms3333f",
          "author": "No-Bother6856",
          "body": "Reduced motion blur if you can actually push those framerates.",
          "score": 5,
          "created_utc": 1747141750.0,
          "replies": []
        },
        {
          "id": "ms2hr5z",
          "author": "WllmZ",
          "body": "Why not?",
          "score": 8,
          "created_utc": 1747132983.0,
          "replies": []
        },
        {
          "id": "ms41gbw",
          "author": "stdfan",
          "body": "Perfect motion clarity.",
          "score": 1,
          "created_utc": 1747152254.0,
          "replies": []
        },
        {
          "id": "ms2klkl",
          "author": "SovietTriumph",
          "body": "Same reason they're making their phones more slimmer despite nobody asking them to do so, to flex their tech.",
          "score": -6,
          "created_utc": 1747134358.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms2tpd1",
      "author": "Marcysdad",
      "body": "128 k monitor next!",
      "score": 1,
      "created_utc": 1747138271.0,
      "replies": []
    },
    {
      "id": "ms4fdel",
      "author": "Burtttttt",
      "body": "Personally I’d rather have a 4K monitor with a slower refresh rate if I had the hardware needed to hit 500 Hz at 1440.",
      "score": 1,
      "created_utc": 1747156302.0,
      "replies": [
        {
          "id": "ms5hw8s",
          "author": "EvilTaffyapple",
          "body": "I play at 1440p / 240 fps and I’d never go back again. It’s as smooth as butter - much better than higher resolution, especially at the 2-3ft you’re viewing your monitor at.",
          "score": 1,
          "created_utc": 1747167415.0,
          "replies": [
            {
              "id": "ms79wnz",
              "author": "Tee__B",
              "body": "4k 240Hz is great, but really requires constant hardware upgrades and makes your PC chrew through power / generates lots of heat.",
              "score": 2,
              "created_utc": 1747188687.0,
              "replies": [
                {
                  "id": "mse41fg",
                  "author": "Edarneor",
                  "body": "Is there a recent game besides CS2 that can even run 240fps in 4k?",
                  "score": 1,
                  "created_utc": 1747280564.0,
                  "replies": [
                    {
                      "id": "mse4ldu",
                      "author": "Tee__B",
                      "body": "Can always use MFG, but for games I play, real FPS, I can manage that in Overwatch 2 and Marvel Rivals(*).",
                      "score": 1,
                      "created_utc": 1747280802.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms3uqlj",
      "author": "no0ns",
      "body": "Zero point in monitors with refresh rates higher than 240Hz and even that is pushing it. The difference is not noticeable enough to warrant the other hardware requirements to get games to run at +200fps. Most titles coming out have trouble running at 100fps natively with mid-tier hardware. And if you use frame generation, it doesn't matter how great your framerate is, since the input latency will make it feel like crap.\n\nI'll stick to 165Hz @ 1440p for the next 5+ years.",
      "score": 1,
      "created_utc": 1747150312.0,
      "replies": [
        {
          "id": "mtjcvtz",
          "author": "crashprime",
          "body": "Unless you care about motion clarity. BFI is a technology worth having. It’s better with higher refresh rates. It doesn’t need frames = refresh rate.",
          "score": 1,
          "created_utc": 1747859390.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msfr1xt",
      "author": "I_T_Gamer",
      "body": "[https://www.healthline.com/health/human-eye-fps#can-we-test-fps-vision](https://www.healthline.com/health/human-eye-fps#can-we-test-fps-vision)\n\nDiminishing returns IMO, but whatever makes you \"feel\" like its worth it...",
      "score": 1,
      "created_utc": 1747311755.0,
      "replies": []
    },
    {
      "id": "ms38ve8",
      "author": "ishamm",
      "body": "But... Why?",
      "score": -2,
      "created_utc": 1747143710.0,
      "replies": [
        {
          "id": "mtjcz8x",
          "author": "crashprime",
          "body": "Motion clarity.",
          "score": 1,
          "created_utc": 1747859416.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms2eph7",
      "author": "None",
      "body": "[deleted]",
      "score": -17,
      "created_utc": 1747131355.0,
      "replies": [
        {
          "id": "ms2fw0h",
          "author": "PineappleLemur",
          "body": "Put a 30/60/120/240/500 display side by side and tell me you can't see past 120.",
          "score": 11,
          "created_utc": 1747131998.0,
          "replies": [
            {
              "id": "ms2g69m",
              "author": "None",
              "body": "[deleted]",
              "score": -13,
              "created_utc": 1747132150.0,
              "replies": [
                {
                  "id": "ms2gn5s",
                  "author": "MultiMarcus",
                  "body": "Did you read your own source? “However, going from a 144Hz monitor to a 240Hz monitor (or one with an even higher refresh rate) will be less noticeable. There's definitely a difference, but your eyes and brain won't notice them as much. There's going to be a more accurate representation of the gameplay unfolding on screen and there will be less input lag. With that said, above 144Hz, you'll begin to get diminishing returns on how much you notice the higher FPS.” \n\nLess noticeable doesn’t mean unnoticeable. I don’t really think 500 hz is worth it since you are pouring an extraordinary amount of performance into frame rate, but it is definitely noticeable.",
                  "score": 9,
                  "created_utc": 1747132403.0,
                  "replies": [
                    {
                      "id": "ms2guhu",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -17,
                      "created_utc": 1747132511.0,
                      "replies": [
                        {
                          "id": "ms2hnar",
                          "author": "vision0709",
                          "body": "So which is it? Am I superhuman or is it just not worth it for you?",
                          "score": 5,
                          "created_utc": 1747132928.0,
                          "replies": [
                            {
                              "id": "ms2hqcf",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -6,
                              "created_utc": 1747132971.0,
                              "replies": [
                                {
                                  "id": "ms33dwy",
                                  "author": "No-Bother6856",
                                  "body": "That's entirely up to the individual. You don't speak for all of humanity. \n\nIf I knew I could actually push those framerates in the games I play, I would be down to buy this.",
                                  "score": 1,
                                  "created_utc": 1747141857.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms2hgpm",
                          "author": "MultiMarcus",
                          "body": "Do you not know what “diminishing returns” means? “proportionally smaller profits or benefits derived from something as more money or energy is invested in it.” Smaller benefits don’t equal no benefit. What is happening is that every fps doubling halves the minimum input lag. The issue is that basically every system has a certain amount of input lag meaning that above 120 the difference becomes very slight. Also, halving 16.7 ms to 8.3 going from 30 to 60 is much bigger than 60 to 120 and especially even further. Frame times too. That is not however completely pointless. It just means that the benefits are much less significant than lower end jumps.",
                          "score": 3,
                          "created_utc": 1747132834.0,
                          "replies": [
                            {
                              "id": "ms2hjxo",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -6,
                              "created_utc": 1747132880.0,
                              "replies": [
                                {
                                  "id": "ms2iqjn",
                                  "author": "MultiMarcus",
                                  "body": "I don’t think you know what pointless is. It’s just a preference thing.  If someone prefers a higher refresh rate, even if it has more marginal gains that’s perfectly alright. The idea that 120 Hz is the be all end all of temporal resolution is just kind of dumb because people don’t have to have the exact same preferences for refresh rate as you.",
                                  "score": 6,
                                  "created_utc": 1747133467.0,
                                  "replies": []
                                },
                                {
                                  "id": "ms2lwm7",
                                  "author": "vision0709",
                                  "body": "If people like you ever took an opportunity to accept being wrong, learn from it, and grow as a person the world would be a better place",
                                  "score": 2,
                                  "created_utc": 1747134958.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms2gill",
                  "author": "Vctoria_R",
                  "body": "Its not just about \"FPS\". Flat panel displays have image retention issues and 1000Hz monitors are the holy grail of getting motion clarity similar to CRTs.",
                  "score": 7,
                  "created_utc": 1747132334.0,
                  "replies": [
                    {
                      "id": "ms34o0g",
                      "author": "No-Bother6856",
                      "body": "This, exactly this. \n\nSample ans hold induced motion blur happens on all LCD and OLED displays to a much greater extent than those old CRTs because on a CRT there is only a static image on screen, exposing your retina, for a tiny portion of the total frame time. If your eye is moving at all while its being exposed, the image is blurring, just like how camera shake causes blur on a camera proportional to how long you leave the shutter open. We can fight this with black frame insertion to some extent but then your brightness drops, but raising your refresh rate lets you reduce this blur without a brightness reduction.",
                      "score": 1,
                      "created_utc": 1747142295.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms2jhq8",
                  "author": "SufferingSloth",
                  "body": "I speedrun Halo which requires multiple frame perfect actions to compete at a high level.  \nI started on a 144hz monitor.  \nSwitched to 240hz and felt a large difference.  \nSwitched to 360hz a year later and felt a difference but not as significant.  \n  \nThe input delay reduces substantially at first but gets smaller as you upgrade from one high refresh rate to another.  \n60hz being 16.67 milliseconds  \n120hz 8.33 milliseconds  \n240hz 4.17 milliseconds  \n360hz 2.78 milliseconds  \n\nI personally don't think i would feel anything going beyond 360.",
                  "score": 5,
                  "created_utc": 1747133832.0,
                  "replies": []
                },
                {
                  "id": "ms2glys",
                  "author": "PierreFeuilleSage",
                  "body": "The article states we can see up to 500hz.",
                  "score": 0,
                  "created_utc": 1747132385.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms2gddw",
          "author": "Noto987",
          "body": "More hz leads to less motion sickness could be applicable in vr one day",
          "score": 2,
          "created_utc": 1747132258.0,
          "replies": []
        }
      ]
    }
  ]
}