{
  "post": {
    "title": "Samsung needs to give us a reason to care about new phones every year | It’s time for Samsung — and honestly, the industry as a whole — to look in the mirror and ask: do we really need this?",
    "author": "a_Ninja_b0y",
    "id": "1i6ljd3",
    "score": 2165,
    "created_utc": 1737474422.0,
    "selftext": "",
    "num_comments": 442,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i6ljd3/samsung_needs_to_give_us_a_reason_to_care_about/"
  },
  "comments": [
    {
      "id": "m8d8r8i",
      "author": "None",
      "body": "It’s not really Samsungs fault that people keep buying it and if I were them, I’d do the same thing.\n\nThis is a lesson for consumers to learn.",
      "score": 773,
      "created_utc": 1737475674.0,
      "replies": [
        {
          "id": "m8dsz97",
          "author": "Deep90",
          "body": "My first reaction was \"Why do you *need* a reason to upgrade?\" \n\nPhones are pretty good right now.\n\n\nUpgrading is a luxury not a need.",
          "score": 262,
          "created_utc": 1737481282.0,
          "replies": [
            {
              "id": "m8dwlce",
              "author": "tetsuo_7w",
              "body": "I upgrade when things stop working- usually physically- on my phone. That seems about every 5-6 years. When I do upgrade, I'm usually underwhelmed by the difference from my old phone. I can't imagine shelling out the cash to experience that every year.",
              "score": 178,
              "created_utc": 1737482260.0,
              "replies": [
                {
                  "id": "m8eu78f",
                  "author": "tholasko",
                  "body": "I see my phone as a tool, something to work for me. I like to set it and forget it. I couldn’t imagine getting everything set up again every single year. I recognize that phone transfer features have gotten pretty good, but it seems like unnecessary hassle.",
                  "score": 36,
                  "created_utc": 1737491419.0,
                  "replies": [
                    {
                      "id": "m8glsja",
                      "author": "MinimumArmadillo2394",
                      "body": "I transferred from a galaxy s10 to a pixel 9 pro xl.\n\nI had issues getting the e sim to work, and since I did it at home at 11pm, I couldnt call and have them activate it.\n\nOther than that the transition was largely seamless. \n\nOne word of warning to anyone reading out there, make sure your authenticators work before you give up your old phone. Its impossible to get into them unless youre under an org.",
                      "score": 15,
                      "created_utc": 1737510127.0,
                      "replies": [
                        {
                          "id": "m8gy5by",
                          "author": "Call_Me_ZG",
                          "body": "Probably worth saving the backup codes somewhere. \n\nIdeally a seperate storage drive. I use NFC tags because they cost nothing and have just enough storage.",
                          "score": 4,
                          "created_utc": 1737514158.0,
                          "replies": [
                            {
                              "id": "m8gyleo",
                              "author": "MinimumArmadillo2394",
                              "body": "> Probably worth saving the backup codes somewhere. \n\nVery difficult when the most common place to store backup codes is your email inbox but in order to sign into your email, you need the 2fa.\n\nMy girlfriend just updated her iphone last week and ran into this issue. Luckily she was able to call IT at her job to reset her, but if she didn't have her account managed, then she'd be screwed.",
                              "score": 3,
                              "created_utc": 1737514306.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8dxh6i",
                  "author": "piratep2r",
                  "body": "Same boat here, every 5 years seems to work well for me.\n\n>I can't imagine shelling out the cash to experience that every year.\n\nI think even if you did shell out the cash, you would not reap the reward. You'd get one year of innovation (minimal) instead of 5 and not really see the difference.",
                  "score": 24,
                  "created_utc": 1737482500.0,
                  "replies": [
                    {
                      "id": "m8fyrud",
                      "author": "itchynipz",
                      "body": "I still have an iPhone XR that I got in 2018. I don’t feel like I’m missing anything tho. They’ll stop supporting it in like 26-28ish. Gonna try and keep till then. It’s a perfect phone. Why ‘fix’ it?",
                      "score": 11,
                      "created_utc": 1737502902.0,
                      "replies": [
                        {
                          "id": "m8g1qey",
                          "author": "piratep2r",
                          "body": "But think how much happier you would be if you'd spent $7000 on 7 new $1000 dollar phones since then?!? (Shakes head) I pity you.\n\n>!/s!<",
                          "score": 10,
                          "created_utc": 1737503837.0,
                          "replies": [
                            {
                              "id": "m8kd4mz",
                              "author": "hanshotfirst-42",
                              "body": "I’ve never bought a phone with cash, it’s pointless.",
                              "score": 1,
                              "created_utc": 1737565410.0,
                              "replies": [
                                {
                                  "id": "m8led65",
                                  "author": "piratep2r",
                                  "body": ">I’ve never bought a phone with cash, it’s pointless\n\nCould you explain more? \n\nThe pay-per-month approach that some people use can end up being a lot more money than paying cash. It all comes down to the total and the interest.\n\nTLDR I either think you are wrong (at least in some situations) or I am not understanding you.",
                                  "score": 1,
                                  "created_utc": 1737575358.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8jjwsg",
                          "author": "AspiringDataNerd",
                          "body": "I have an iPhone SE from 2020. Once the OS is no longer capable of updating then I’ll buy the newest SE at that time.",
                          "score": 3,
                          "created_utc": 1737557154.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8e9eja",
                  "author": "JayKay8787",
                  "body": "I upgrade about every 2 models, but my last 2 phones have been very marginal. I remember going from an s8 to s20, that was a huge leap. I don't really get what phone makers are doing anymore. The camera is already as good as you need(and 90% of people don't use them right anyway, making the fancier lenses pointless) processing speed is great. They need to focus on bringing something new. The folding phones is interesting but I don't think that's the future, but atleast it's something new",
                  "score": 22,
                  "created_utc": 1737485737.0,
                  "replies": [
                    {
                      "id": "m8edd3q",
                      "author": "Sharticus123",
                      "body": "They need to focus on battery life. Storage, processing, and resolution are already well beyond satisfactory. \n\nGive us a f$&king battery that lasts longer than a workday.\n\nI wanna charge my phone no more than twice a week.",
                      "score": 29,
                      "created_utc": 1737486822.0,
                      "replies": [
                        {
                          "id": "m8g4scm",
                          "author": "carnabas",
                          "body": "Bring back swappable batteries! I miss having a fully charged battery I could swap into my phone and just go",
                          "score": 19,
                          "created_utc": 1737504821.0,
                          "replies": []
                        },
                        {
                          "id": "m8exoqp",
                          "author": "AinzTheEvil",
                          "body": "The battery life is always great the first year. It was hard to kill my 23 Ultra in a day. Now? It's a different story. I feel like the updates have some part in this too.",
                          "score": 11,
                          "created_utc": 1737492368.0,
                          "replies": [
                            {
                              "id": "m8h26ao",
                              "author": "guyincognito121",
                              "body": "Limit your charge to 80% (there are settings that will do this for you), and try not to discharge below 25%.  Also minimize use of fast (and especially super fast) chargers.",
                              "score": 1,
                              "created_utc": 1737515503.0,
                              "replies": [
                                {
                                  "id": "m8hmppo",
                                  "author": "unripenedfruit",
                                  "body": "I've been doing that with my s23u since day 1 basically.\n\nIt may prolong battery health but it won't make it last forever. My battery doesn't last a full day anymore, and if I know I'll be out and about with heavy phone use, taking lots of photos etc - I basically need to charge it to 100% at the start of the day now.\n\nThe reality is batteries degrade and there isn't much that can be done about it. Aside from making them easily replaceable again.",
                                  "score": 6,
                                  "created_utc": 1737523387.0,
                                  "replies": [
                                    {
                                      "id": "m8hrltz",
                                      "author": "guyincognito121",
                                      "body": "But did you really, actually prevent it from going below 25% consistently?  Or did you do what pretty much everyone does and throw it on the super fast charger when it hit 15% and the alarm went off?  I'm a data scientist at a medical device company and have compiled analyses of extensive testing of hundreds of lithium ion batteries.  The steps I described make a *huge* difference in battery longevity.",
                                      "score": -1,
                                      "created_utc": 1737525669.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8mt5rl",
                          "author": "PARANOIAH",
                          "body": "Would love to see them use the slimmed down internals (especially from the new slim model they teased) and pad out the extra space with battery to the same thickness as the camera lenses.",
                          "score": 2,
                          "created_utc": 1737589834.0,
                          "replies": [
                            {
                              "id": "m8mw9va",
                              "author": "Sharticus123",
                              "body": "Right? I would happily accept a phone 50% thicker if that extra volume was occupied by a larger longer lasting battery.",
                              "score": 2,
                              "created_utc": 1737590812.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8fmwn3",
                          "author": "jeepsaintchaos",
                          "body": "I do. I have a Ulephone that has a fucking massive battery, and I only charge it every 3 days. I can use it as a power bank for other phones and stuff, too. Huge speaker, and damned near unbreakable as a phone. I throw it sometimes for fun, and have gone swimming with it too. Underwater music is fun, and I love the flashlight mounted on top. Has one for the camera, too. 9600mah battery, I think. \n\nThe phone is kinda slow and the Duraspeed app kills my important background processes, like a blood sugar app and Spotify. It's also massive and heavy, but that's part of the rugged phone. \n\nI don't say this to be a shill, and I'm looking into replacement options for the phone because of the Duraspeed, and the battery isn't as good as it was new. I'm looking at Blackview next because I miss my CAT thermal camera, although the rest of the CAT phone was shit. \n\nTl;Dr you can absolutely have the battery you want.",
                          "score": 4,
                          "created_utc": 1737499279.0,
                          "replies": [
                            {
                              "id": "m8k0i23",
                              "author": "StopVapeRockNroll",
                              "body": "About Duraspeed and background process: go into the app you want to not be hindered settings ->click battery -> click unrestricted",
                              "score": 1,
                              "created_utc": 1737561926.0,
                              "replies": [
                                {
                                  "id": "m8vjmmw",
                                  "author": "jeepsaintchaos",
                                  "body": "I have. It didn't work. Oh, it said it worked, but my music still randomly pauses and other background stuff gets stopped, unless that particular app is in the foreground. \n\nIt happens to 2 different music apps, that both work fine on other phones. Sometimes FB messenger messages don't come through until I open the app. Emails, same. Oddly, some apps work fine that were never excluded, like my bank app.",
                                  "score": 1,
                                  "created_utc": 1737704335.0,
                                  "replies": [
                                    {
                                      "id": "m8w48h2",
                                      "author": "StopVapeRockNroll",
                                      "body": "> Sometimes FB messenger messages don't come through until I open the app.\n\n\nYeah, same thing happens with my WhatsApp messages.",
                                      "score": 1,
                                      "created_utc": 1737716822.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8haldm",
                          "author": "DirectlyTalkingToYou",
                          "body": "No idea why they keep trying to make them thinner. Make it thicker and give a bigger battery.",
                          "score": 3,
                          "created_utc": 1737518491.0,
                          "replies": []
                        },
                        {
                          "id": "m8h1set",
                          "author": "guyincognito121",
                          "body": "This is more of a consumer issue.  Batteries now have a lot more capacity than batteries from five years ago, and components and software are more efficient.  It would be entirely feasible too make a reasonably priced phone with performance equivalent to that of five years ago, but the kind of battery life your talking about.\n\nYou could also make a similar phone that has virtually infinite battery longevity (i.e., the capacity doesn't drain over time so you never need to replace it) by using a modern battery, but preventing it from ever charging above 75% or discharging below 25%.  It would need to be recharged daily since you're only actually using half of the stored charge, but it wouldn't degrade over time.",
                          "score": 1,
                          "created_utc": 1737515372.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8jk9bq",
                      "author": "AspiringDataNerd",
                      "body": "Folding phones are not the future. We already did that before in the past.",
                      "score": 1,
                      "created_utc": 1737557261.0,
                      "replies": [
                        {
                          "id": "m8mjn26",
                          "author": "JayKay8787",
                          "body": "There were smartphones in the past that folded to double the size of the screen?",
                          "score": 1,
                          "created_utc": 1737586817.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8fqpua",
                  "author": "NickCharlesYT",
                  "body": "The thing that usually gets me is memory. When apps start closing on me 5 seconds after I leave them, that's a sign...It's actually worse on iPhone, but by the time this starts happening it makes EVERYTHING that much slower to get done because I'm constantly losing context or progress on one thing or another. To me my phone is a tool, and when that tool stops functioning like it's supposed to, I need to replace it. Recently it's been longer, but for a while that was every 2-3 years. Now I'm on an S23 Ultra and I think I'll be fine for a while longer because I got the higher spec model with increased memory, but time will ultimately tell. \n\nI think part of the aspect of phone upgrades that compels me to upgrade sooner is that I also use the phones I've \"retired\" from daily use. Many are lying around as touch controls for various applications, and when one of them finally does die I have to replace it. If my regular phone is getting older, I'll often buy a new phone so I can retire the current one to whatever needs replacement.",
                  "score": 7,
                  "created_utc": 1737500408.0,
                  "replies": [
                    {
                      "id": "m8gyfxu",
                      "author": "Call_Me_ZG",
                      "body": "Limit your battery charge to 80% from the settings and turn off fast charging and only use it when you need it. \n\n\nIf you plan to use your phone for 4+ years, battery health will be the weakest link",
                      "score": 1,
                      "created_utc": 1737514256.0,
                      "replies": [
                        {
                          "id": "m8hhgnw",
                          "author": "NickCharlesYT",
                          "body": "I already do that but I have to charge my phone twice a day when it's new. By the time it's worn out I'm charging it 3-4 times a day.",
                          "score": 1,
                          "created_utc": 1737521154.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8i3nit",
                  "author": "elderly_millenial",
                  "body": "Going into year 7, and the face recognition stopped working. I can get a new phone or replace a module for <$200 and go a few more years\n\nEdit: well shit, it looks like it loses support later this year. I guess 7 years is the magic number for iPhones",
                  "score": 4,
                  "created_utc": 1737532146.0,
                  "replies": []
                },
                {
                  "id": "m8m0co2",
                  "author": "Emeryb999",
                  "body": "Unfortunately it's also app and update support now, especially if you stay further behind on purpose to be cheap lol. I had a LG V30 that I switched from to a LG V60 because banking/credit card apps stopped supporting the old one. I could have just used the browser but there are so many automatic prompts to open in app and other annoying \"functionality\" that becomes useless.",
                  "score": 2,
                  "created_utc": 1737581245.0,
                  "replies": []
                },
                {
                  "id": "m8eeds3",
                  "author": "AlwaysRushesIn",
                  "body": "I do the same, but i consistently upgrade to the generation or second behind the latest release. Save a little money, but still get an upgrade from what I had.",
                  "score": 3,
                  "created_utc": 1737487100.0,
                  "replies": []
                },
                {
                  "id": "m8fmbx1",
                  "author": "timeshifter_",
                  "body": "I've owned exactly 3 smartphones in my entire life.\n\nI bought my first one in... 2007?\n\nThe biggest problem I've ever faced is manufacturers not providing any further Android updates, meaning some apps simply won't install on my phone at all. Otherwise, I've never really felt \"out of date\".\n\nAlso, the *most* I've paid for a phone, was about $400. My current phone, T-Mo literally gave me for free, in its release year. Sure it could have been considered e-waste the day it released... but here I am, more than 5 years later, still using it. Third battery, but the back plate pops off and lets me easily replace it, so why toss it? \n\n.....did ya get that last part, manufacturers?",
                  "score": 4,
                  "created_utc": 1737499112.0,
                  "replies": [
                    {
                      "id": "m8fuuu0",
                      "author": "sucfucagen",
                      "body": "Oh they get it... Which is why they don't do it. They _want_ you to spend to completely replace something like a battery or a screen when everything else is completely fine. They make it as hard as possible on purpose.",
                      "score": 2,
                      "created_utc": 1737501678.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8f1647",
                  "author": "Front_Tomatillo217",
                  "body": "My last phone that seemed like a \"big\" upgrade was an S9+. That was several years ago, and my current phone doesn't seem like a big leap from that.",
                  "score": 1,
                  "created_utc": 1737493297.0,
                  "replies": []
                },
                {
                  "id": "m8glyqg",
                  "author": "None",
                  "body": "I applaud you for that. I've gone from iPhone 5S->XS>Galaxy S22>iPhone 15 PM.\n\n I must be in the minority that has to replace their phone every 3 years. I've yet to get more than 3 years from a single phone. I did have an iPhone 5S for 5, but it was replaced with another after 3 years because the home button broke. Bought the XS in 2018 because the old one was unusably slow for work and the home button acted up again. S22 was on its way out the door for me due to the atrocious SoC before I dropped a dumbell on it and bought my 15 Pro Max last month. My phone is a tool I need for work a *lot*, so I do wonder if that's why I struggle to get more than 3 years out of one.",
                  "score": 1,
                  "created_utc": 1737510182.0,
                  "replies": []
                },
                {
                  "id": "m8gvbyb",
                  "author": "kalirion",
                  "body": "My current phone, a 3 year old Samsung, is my *first* smart phone ever. I'd been using dumb phones from 2003 to 2021. The only thing short of it stopping working that may get me to upgrade is if my gacha game of choice stops working on it (yea, I know...)",
                  "score": 1,
                  "created_utc": 1737513232.0,
                  "replies": []
                },
                {
                  "id": "m8gxm59",
                  "author": "twigboy",
                  "body": "Same here.\n\nEven then, I gawk at the exorbitant prices of new phones. The SD card removal is still a bitter pill to swallow. Constantly running into space issues on 265gb as I used to have a 512gb SD card\n\nI only buy refurbs now once they hit an acceptable price. It's just not worth going full price, but hey each to their own.",
                  "score": 1,
                  "created_utc": 1737513982.0,
                  "replies": []
                },
                {
                  "id": "m8i7ufn",
                  "author": "None",
                  "body": "Same. Upgraded from iPhone 11-13 during Black Friday. Great $0 deals on 13’s. 15’s were like $20/month. Nothing the more expensive phones do that I can’t do on the $0 ones. Then I wait 2-3 years and snag the next $0 upgrade.",
                  "score": 1,
                  "created_utc": 1737534633.0,
                  "replies": []
                },
                {
                  "id": "m8ia13n",
                  "author": "Hakaisha89",
                  "body": "I got an samsung s20, and the battery is starting to get worse, cover is starting to pop off, and there is screen burn-in.  \nbut i would need to go for the s24 to even get a sense of an upgrade, but the entire AI shit turns me off so hard im just going \"Maybe next year they will give up the AI shit\"",
                  "score": 1,
                  "created_utc": 1737535978.0,
                  "replies": []
                },
                {
                  "id": "m8iudh1",
                  "author": "Joey6543210",
                  "body": "I do the same and upgrade to the two year old model. So it still feels some substantial upgrade but save $$",
                  "score": 1,
                  "created_utc": 1737547683.0,
                  "replies": []
                },
                {
                  "id": "m8jk98p",
                  "author": "Reniconix",
                  "body": "Recently upgraded all my family's phones. It started out with my wife needing to replace her iPhone 11 because the charging port died. When we get to the store, the salesman does what no salesman ever has before: finds a way for us to spend LESS money.\n\nUpgraded my S21 Ultra to an S24 Ultra, my wife to an S24 basic, and my daughter to an A15 from an S9 (my phone before I got the S21, which I only got because she needed a phone and upgrading me made more sense than buying her a new phone). Our bill went DOWN $50 a month.\n\nThat man was a wizard and looked the part.",
                  "score": 1,
                  "created_utc": 1737557260.0,
                  "replies": []
                },
                {
                  "id": "m8kg74y",
                  "author": "cookielicious1237",
                  "body": "I'm around the 4 year mark between upgrades. Biggest difference ends up being battery life since the old one is generally depleted to the point where the delta is pretty big. \n\nPerformance changes are so minimal it doesn't even matter at this point.",
                  "score": 1,
                  "created_utc": 1737566245.0,
                  "replies": []
                },
                {
                  "id": "m8paop1",
                  "author": "None",
                  "body": "Most people do exactly what you do.",
                  "score": 1,
                  "created_utc": 1737628114.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8goj6a",
              "author": "Stashmouth",
              "body": "It's weird that people cannot get this through their heads. You seldom *have to* upgrade your phone, but when you do, don't you want the luxury of choice to get that year's flagship? The \"issue\", as it exists, is that not everyone is on the same upgrade cycle, which means manufacturers will be trying to outdo themselves every year.\n\nHypothetically, if Apple released a new phone every odd-numbered year and Samsung released one on the even-numbered years, what does that do for consumers? It doesn't do much for the companies or their stakeholders",
              "score": 9,
              "created_utc": 1737511003.0,
              "replies": [
                {
                  "id": "m8o0yi6",
                  "author": "davispw",
                  "body": "You’re not accounting for all the people with scratched and cracked screens, beat up phones, dead batteries, busted charge ports.  Yes these are all repairable issues, but if my phone is more than 2-4 years old, I’ve got some cash and my damage insurance (if I ever had any) has expired, an upgrade is a lot more attractive.  Most people do not (cannot) keep their phones in perfect condition for 6+ years.",
                  "score": 1,
                  "created_utc": 1737604224.0,
                  "replies": [
                    {
                      "id": "m8s3mxs",
                      "author": "Stashmouth",
                      "body": ">You’re not accounting for all the people with scratched and cracked screens, beat up phones, dead batteries, busted charge ports. \n\nI said you seldom have to upgrade your phone, not you never do. And my point was that if, for whatever reason, you want to buy a new phone, wouldn't you like to be able to choose from a current roster?\n\nTo be clear, I think what the author of the article is proposing is myopic and stupid (he suggests going back to the tick tock cadence Apple used to use, where big number changes happen every two years, and we get an S model in between). It results in the same thing for the consumer. He's complaining as a journalist (I think?) that he has to cover a major launch every year, even though the changes are incremental at best.",
                      "score": 1,
                      "created_utc": 1737661584.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8ivzw5",
                  "author": "chaotic_zx",
                  "body": "> but when you do, don't you want the luxury of choice to get that year's flagship?\n\nNot at all. I once got flagship Samsung phones in any upgrade I had. I'd keep them until they broke. Then I figured out that a low tier phone was faster than the one replacing it. I'm no longer playing the I want the fastest phone game. I don't need it.",
                  "score": 1,
                  "created_utc": 1737548436.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8fipgx",
              "author": "TheSeventhBrat",
              "body": "I upgrade when the battery no longer holds a charge. I went 4 years before I upgraded the last time. That was 2 years ago.",
              "score": 2,
              "created_utc": 1737498067.0,
              "replies": []
            },
            {
              "id": "m8eukgc",
              "author": "TingleyStorm",
              "body": "I’m trying to honestly think of a reason for me to upgrade…\n\niPhone 14 Pro:\n- 48mp camera\n- 120hz display\n- Stainless Steel casing\n- Siri\n\niPhone 16 Pro:\n- 48mp camera\n- 120hz display\n- titanium casing (slightly lighter!)\n- even worse Siri\n\nSo even with a trade in, I’m spending $700 for…a slightly lighter phone? Why would I do that?",
              "score": 2,
              "created_utc": 1737491520.0,
              "replies": [
                {
                  "id": "m8fpqpl",
                  "author": "Adventurous_Meal1979",
                  "body": "For me it’s USB-C charging. I’m using a 13 Pro, and it’s the last piece of electronics I have that doesn’t use USB-C. I’m going to find a refurbished 15 or 15 pro just for the ZuSB-C.",
                  "score": 14,
                  "created_utc": 1737500115.0,
                  "replies": []
                },
                {
                  "id": "m8f3rw4",
                  "author": "lordraiden007",
                  "body": "The LiDAR sensor is slightly better if you do high-detailed 3D scanning, but if not I wouldn’t consider upgrading",
                  "score": 1,
                  "created_utc": 1737494000.0,
                  "replies": [
                    {
                      "id": "m8fbl25",
                      "author": "Deep90",
                      "body": "The 3d scanner is neat, but if you're essentially paying $700 for a better 3d scanner you could just buy a 3d scanner.",
                      "score": 5,
                      "created_utc": 1737496105.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8fh0tr",
              "author": "Richard_Thickens",
              "body": "They usually take care of that for us at some capacity — incompatibility with the newest OS and apps, no connectivity with new service technologies like 5G, and obviously, battery life if you aren't able to replace that yourself.\n\nYou may not need to replace a phone every two years on the dot like many people do, but for the vast majority of us, they aren't something that makes sense to keep beyond the, \"upgrade,\" period, particularly since purchasing a decent smartphone in cash is not cheap.",
              "score": 1,
              "created_utc": 1737497589.0,
              "replies": []
            },
            {
              "id": "m8gj34c",
              "author": "mr_chip_douglas",
              "body": "I had an iPhone 11. I wanted 120hz screen and my battery was at around 71%. \n\nI was happy with 5 years service, though I could’ve just went longer",
              "score": 1,
              "created_utc": 1737509268.0,
              "replies": []
            },
            {
              "id": "m8gpv6s",
              "author": "Passthegoddamnbuttr",
              "body": "We've had our phones for 6 years.\n\nMy wife replaced hers yesterday, a Note 10. Her charging port stopped working and she is a voracious ebook reader on her phone. I'm less abusive to my phone (s10+) and will wait to upgrade until after the payment plan for hers stops in two years.",
              "score": 1,
              "created_utc": 1737511438.0,
              "replies": []
            },
            {
              "id": "m8gxsv6",
              "author": "godnorazi",
              "body": "I upgrade because it honestly makes more financial sense to in my case. I use a Google Pixel and they always do insane pre-order bonuses (I was out less than $100 this past year going from the Pixel 8 to the 9 after trade-in and bonuses). If I kept my old phone for 5+ years until I really needed an upgrade, it would cost me over $500 to get a new phone of the same quality vs paying under $100 a year to have the latest and greatest.",
              "score": 1,
              "created_utc": 1737514044.0,
              "replies": []
            },
            {
              "id": "m8ht2ne",
              "author": "nagi603",
              "body": "> Upgrading is a luxury not a need.\n\nEspecially with how fast the prices have risen. And how the previous \"cheap but still top perf\" brands have also gone up... or sideways.",
              "score": 1,
              "created_utc": 1737526401.0,
              "replies": []
            },
            {
              "id": "m8hw9ng",
              "author": "blenderbender44",
              "body": "For me it's the Camera and screen. I usually buy about 5 years behind the latest and every time I've been blown away by how much better the camera is, and the introduction of HDR screens makes a big difference to this. So better cameras is a big one for me.",
              "score": 1,
              "created_utc": 1737528051.0,
              "replies": []
            },
            {
              "id": "m8kcz5a",
              "author": "hanshotfirst-42",
              "body": "What’s wrong with luxury? My gaming computer from 2008 would probably still turn on. It doesn’t mean I would have a good experience with it. Some people buy clothes, others buy gadgets.",
              "score": 1,
              "created_utc": 1737565367.0,
              "replies": []
            },
            {
              "id": "m8heirh",
              "author": "whilst",
              "body": "Except when the manufacturer stops supporting them with security updates.  Then it's a need, unless you want your identity compromised and your device mining crypto.",
              "score": 1,
              "created_utc": 1737519985.0,
              "replies": [
                {
                  "id": "m8hife4",
                  "author": "Deep90",
                  "body": "Title says yearly though, so my comment was in that context.",
                  "score": 1,
                  "created_utc": 1737521551.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8dxzle",
          "author": "_CatLover_",
          "body": "Every EA sports game franchise (Fifa, nhl, Madden etc) has entered the chat..\n\nMost people are braindead consumerbots",
          "score": 25,
          "created_utc": 1737482641.0,
          "replies": [
            {
              "id": "m8g6vzv",
              "author": "supe_snow_man",
              "body": "The phone is like 10x the price of the \"roster update\" for the EA franchise tho...",
              "score": 4,
              "created_utc": 1737505470.0,
              "replies": [
                {
                  "id": "m8hs75o",
                  "author": "NorthernerWuwu",
                  "body": "Probably cheaper than FIFA though.",
                  "score": 1,
                  "created_utc": 1737525962.0,
                  "replies": [
                    {
                      "id": "m8hukgi",
                      "author": "supe_snow_man",
                      "body": "That depends on how many extra you buy after the base game. Getting nickel and dimed on a game probably sucks.",
                      "score": 1,
                      "created_utc": 1737527165.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8ek2xr",
              "author": "None",
              "body": "This is the correct answer.",
              "score": 1,
              "created_utc": 1737488646.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8ghmzr",
          "author": "audigex",
          "body": "Yeah people got into the habit when 2 years gave quite a substantial difference between phones - an iPhone 4 vs 3G, 6 vs 5 etc (with the S generations in between) was fairly significant\n\nBut now the difference between even an iPhone 11 and 15 is... well, it's nice to have and certainly not nothing, but I've made the argument repeatedly on Reddit already that it's really not revolutionary.\n\nI can switch between my 15 and my fiancee's 11 and they're essentially the same phone in all the ways that really actually matter. A bit of snappiness, a better camera (from good to very good), a bit more battery life (from \"sufficient\" to \"more than enough\").... I prefer mine to hers, but I really wouldn't care that much if we had to swap for some reason\n\nRealistically an upgrade every 4-5 years is plenty at this point for most people unless you REALLY rely on your camera or some other specific niche feature that gets upgraded in the meantime",
          "score": 10,
          "created_utc": 1737508811.0,
          "replies": [
            {
              "id": "m8mj5dk",
              "author": "OMGItsCheezWTF",
              "body": "And it's not even like iPhone for iPhone. I have an iPad and a pixel 8 pro. I have the same wallpaper on both, the same apps, the same home screen layout. There are minor differences of course but essentially my iOS iPad is my android phone with a big screen that I use when I'm at home instead of my phone.\n\nTheres no real difference between them despite being different generations running different operating systems.\n\nI used to upgrade frequently. Now I do it every 3-4 years. I upgraded to the pixel 8 from the pixel 4, and to that from the nexus 6 and to that from the iPhone 4.",
              "score": 1,
              "created_utc": 1737586662.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8eefi7",
          "author": "GigabitISDN",
          "body": "You beat me to it. I have a Galaxy S23 as my daily driver and a Galaxy S20 that I use in rough environments, like strapped to my bike handlebars on a long ride. The S20 still works perfectly. I suppose technically, the S23's CPU is a little faster and the S23's camera is a little better, but does any of that help it track my rides any better?\n\nNo.\n\nI guess my S23 can't get the latest AI-powered ~~in-your-face advertising and invasive data mining~~ personalized content, but that's just a reason to hang on even longer.",
          "score": 4,
          "created_utc": 1737487113.0,
          "replies": []
        },
        {
          "id": "m8g66i4",
          "author": "supe_snow_man",
          "body": "I just upgraded my S8+ to a S24+ and I did because my USB connector was dead. WTF do people do with their phones to want to upgrade so damn often?",
          "score": 3,
          "created_utc": 1737505254.0,
          "replies": []
        },
        {
          "id": "m8flouc",
          "author": "GameofPorcelainThron",
          "body": "It's because in capitalism, if your company isn't growing, it's dying. And over time, it gets worse and worse and you can't get off the treadmill.",
          "score": 11,
          "created_utc": 1737498924.0,
          "replies": [
            {
              "id": "m8foi11",
              "author": "None",
              "body": "That’s not true in the slightest. That’s only relevant for Fortune 500 companies and companies aspiring to that. \n\nMom and pop shops exist and thrive all throughout America, all functioning under capitalism, and haven’t expanded in 50 years. The companies will exist until the owners close up shop or get swallowed/purchased. \n\nBut it is possible for business owners to make their living and be satisfied.\n\nEverything else is just theoretical nonsense that only works on paper.",
              "score": -2,
              "created_utc": 1737499746.0,
              "replies": [
                {
                  "id": "m8fortw",
                  "author": "GameofPorcelainThron",
                  "body": "We're talking about Samsung, one of the largest companies in the world. And you're comparing that to privately owned mom and p op shops.",
                  "score": 11,
                  "created_utc": 1737499827.0,
                  "replies": [
                    {
                      "id": "m8fqpnq",
                      "author": "None",
                      "body": "Lmao fair enough. But I still don’t view the push for a new model every year to be from the basis of “Samsung will die if we don’t continue to expand” so much as “we added $50 of new features and these dumb dumbs will buy it for another $1,000”.\n\nThis issue isn’t caused by endless expansion, it’s derived from a stupid market that’s easy to take advantage of.",
                      "score": 1,
                      "created_utc": 1737500406.0,
                      "replies": [
                        {
                          "id": "m8fr7fi",
                          "author": "GameofPorcelainThron",
                          "body": "I work for a similarly sized company and every year we turn a good profit, our fiscal goals for the next year grow. And then if we miss *those* goals, there are layoffs, even if we hit similar financial targets to previous years. It isn't just an issue of extracting as much money as possible, once that money has been extracted, you have to do it all over again because the company now has those expectations.\n\nMakes me wish I did work for a mom and pop shop lol",
                          "score": 2,
                          "created_utc": 1737500554.0,
                          "replies": [
                            {
                              "id": "m8g49g7",
                              "author": "None",
                              "body": "It’s never too late lol depending on what you do, you could be quite the asset to a small company.",
                              "score": 1,
                              "created_utc": 1737504655.0,
                              "replies": [
                                {
                                  "id": "m8g4tzh",
                                  "author": "GameofPorcelainThron",
                                  "body": "Sadly the kind of work I do is largely the purvey of large corporations. I'm a slave to the man lol",
                                  "score": 2,
                                  "created_utc": 1737504836.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m8hsexm",
                          "author": "NorthernerWuwu",
                          "body": "A lot of it is internal too of course. No one ever got a promotion from saying the company should just rest on its laurels and cash cheques.",
                          "score": 1,
                          "created_utc": 1737526069.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8l7sv7",
                  "author": "Alexpander4",
                  "body": "It's any publicly traded company. The shareholders aren't people, they're huge companies. They want infinite growth because growth is returns. More than that they want the amount  of growth to increase each year. If that growth even slightly falters, they sell all their stock and the company collapses.",
                  "score": 1,
                  "created_utc": 1737573608.0,
                  "replies": [
                    {
                      "id": "m8lchb7",
                      "author": "None",
                      "body": "Sure, you said it better than I did, but publicly traded companies are not the only company structure that exists in capitalism, so everything I’ve said still stands. My point is not about the publicly traded companies, it’s about the rest.",
                      "score": 0,
                      "created_utc": 1737574856.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8ha5hz",
          "author": "DirectlyTalkingToYou",
          "body": "If consumers keep buying then there isn't a lesson to be learned. It's something they enjoy and want. It's like saying all football games are the same, why keep going and wasting money, if you've see one you've seen them all.",
          "score": 2,
          "created_utc": 1737518326.0,
          "replies": [
            {
              "id": "m8hqrvk",
              "author": "None",
              "body": "Then who’s complaining about all this “new model every year” thing?",
              "score": 2,
              "created_utc": 1737525263.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8fb32y",
          "author": "ostrichfart",
          "body": "The uninformed consumer has ruined the economy",
          "score": 3,
          "created_utc": 1737495971.0,
          "replies": []
        },
        {
          "id": "m8deb5t",
          "author": "ErGo404",
          "body": "Samsung and other brands promotes the new shiny gimmicks on every generation in every marketing campaign they have so let's not pretend that they are not part of the problem.\n\n  \nThey also actively discourage the use of older phones by setting up trade programs to trick you into selling relatively recent and functioning models to get the new one.",
          "score": 6,
          "created_utc": 1737477241.0,
          "replies": [
            {
              "id": "m8dkv6v",
              "author": "zzzzzooted",
              "body": "How are you construing trade programs as *predatory*? Lmfao\n\nTrade programs allow people who have less money to upgrade phones more readily when their current one starts going out. It’s not to ~lure you in~ or something. It’s just smart recycling - they can re-use parts, and it encourages *brand loyalty* from people who otherwise might just go for the cheapest market option.\n\nIf *you* feel lured in by trade in deals, that’s something to think about. I sure don’t, but i’m glad they exist when my phone starts bugging out on me and getting old.",
              "score": 31,
              "created_utc": 1737479047.0,
              "replies": [
                {
                  "id": "m8dme1v",
                  "author": "simon132",
                  "body": "By the time my smartphones start bugging out, it's been 6/7 years and they are worth maybe 50€ in a trade in lol. Not worth it",
                  "score": 10,
                  "created_utc": 1737479470.0,
                  "replies": [
                    {
                      "id": "m8dn733",
                      "author": "zzzzzooted",
                      "body": "Maybe we have different tolerances for minor bugs lol, i get annoyed with small things fast, and i already prefer to have a better camera on my phone, so i end up switching every ~3 releases or so. My trade in is worth a good amount, and my new phones never cost much. If not for the trade ins, i would be stuck buying whatever’s cheapest or buying used phones off third party retailers (which i did enough of before trade ins were as common, im good! So many “refurbished” phones that will break quicker than they should)\n\nIt’s a beneficial thing for poor people, if you don’t like trade ins, simply don’t use them, but don’t pretend they don’t serve a beneficial purpose for many.",
                      "score": -2,
                      "created_utc": 1737479694.0,
                      "replies": [
                        {
                          "id": "m8dot0m",
                          "author": "simon132",
                          "body": "Poor people shouldn't change phone every three years, waste of money. You can buy a really good midrange phone for 250 to 300€ that lasts easy 5 years without problems. \"Bugs\" only need maybe a factory reset after 4 years. I haven't gotten any \"bugs\" on android for almost 8 years now, this is just a myth",
                          "score": 11,
                          "created_utc": 1737480138.0,
                          "replies": [
                            {
                              "id": "m8dpk56",
                              "author": "zzzzzooted",
                              "body": "Some poor people have jobs that rely on having up to date tech, but nice bullshit response dude! Very r/iamverysmart energy here",
                              "score": -16,
                              "created_utc": 1737480343.0,
                              "replies": [
                                {
                                  "id": "m8dpyyt",
                                  "author": "simon132",
                                  "body": "I doubt that, everything works on a few years old phone. Only if you go 6+ years will the android version not be supported by some apps",
                                  "score": 10,
                                  "created_utc": 1737480455.0,
                                  "replies": [
                                    {
                                      "id": "m8eattx",
                                      "author": "navigationallyaided",
                                      "body": "I’ve seen Uber drivers still use iPhone X/XS/XRs and SEs. Doordash’s courier/driver app works better on the iPhone. But then again, I was in a a Lyft and someone was using a cheap Android on it.",
                                      "score": 2,
                                      "created_utc": 1737486124.0,
                                      "replies": [
                                        {
                                          "id": "m8f7bq6",
                                          "author": "zzzzzooted",
                                          "body": "Those arent the types of jobs im referring to lmfao.",
                                          "score": 0,
                                          "created_utc": 1737494956.0,
                                          "replies": [
                                            {
                                              "id": "m8hswno",
                                              "author": "simon132",
                                              "body": "It's even less valid, what kind of job needs a new smartphone lol",
                                              "score": 0,
                                              "created_utc": 1737526318.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m8ds0xf",
                                      "author": "zzzzzooted",
                                      "body": "You clearly are not someone who understands the difference between “functional“ and “meeting the current standards of an industry“ but those are different things for some jobs and “functional” doesn’t cut it.",
                                      "score": -3,
                                      "created_utc": 1737481020.0,
                                      "replies": [
                                        {
                                          "id": "m8dtcud",
                                          "author": "Photo_Synthetic",
                                          "body": "Good old capitalism. If your job requires you to need an up to date phone they should be buying that shit for you.",
                                          "score": 10,
                                          "created_utc": 1737481385.0,
                                          "replies": [
                                            {
                                              "id": "m8dxgoe",
                                              "author": "zzzzzooted",
                                              "body": "Wow, what great advice, if only I didn’t work for myself in an industry of freelancers.\n\nY’all need to stop pretending we live in a perfect world and realize the reality of many peoples situations. All you’re doing with comments like this is showing how sheltered and privileged you are lmao.",
                                              "score": 0,
                                              "created_utc": 1737482496.0,
                                              "replies": [
                                                {
                                                  "id": "m8ea7is",
                                                  "author": "Photo_Synthetic",
                                                  "body": "I think uninformed is a better word. That's partly on me but you were so vague about your profession so I'll take that one anyway. Sheltered and priveleged is a funny way to describe people who want to hold corporations accountable. Do you not agree that if you worked for a business that required you to have a top of the line phone that they should be required to get that phone for you?",
                                                  "score": 1,
                                                  "created_utc": 1737485956.0,
                                                  "replies": [
                                                    {
                                                      "id": "m8f6wgz",
                                                      "author": "zzzzzooted",
                                                      "body": "I do agree that a company should be required to provide one if you are working for a company, I just also know that more people are not in a situation where that is the case, either because the company does not provide it or because they work for themselves, and I would never be so presumptuous as to assume an ideal situation being the default case.",
                                                      "score": 1,
                                                      "created_utc": 1737494844.0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "m8eb29w",
                                                      "author": "JayKay8787",
                                                      "body": "Are fancy jobs required to buy and tailor your suits? Do work from home jobs cover your internet bill? It's just something you need for a job and is commonplace.",
                                                      "score": 1,
                                                      "created_utc": 1737486189.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m8dx94s",
                                  "author": "Worsehackereverlolz",
                                  "body": "what the fuck type of job is someone who is POOR working that needs cutting edge tech??? lmfao",
                                  "score": 4,
                                  "created_utc": 1737482439.0,
                                  "replies": [
                                    {
                                      "id": "m8dyzgp",
                                      "author": "pathologicalDumpling",
                                      "body": "Not a good one. This guy just hasn't realized that yet",
                                      "score": 7,
                                      "created_utc": 1737482913.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m8dyngi",
                                      "author": "zzzzzooted",
                                      "body": "Lots of creative freelancers use phones as essentially a tech pocket knife; no need for a bunch of expensive equipment if you have an up to date smart phone. Its actually more affordable than freelancing for photography/music/digital art/etc used to be at a low level.\n\nObviously, it doesn’t compete at higher levels, but that’s fine because high-level work doesn’t get as many jobs and is much harder to market.\n\nAnd this is not a niche population of people, so many people make their money that way, whether it’s their primary job or a secondary one.\n\nAnd I’m not even including influencers in that group, which also need up-to-date tech to be able to put out quality content, and are not a small population either.",
                                      "score": 1,
                                      "created_utc": 1737482822.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8do2lr",
                  "author": "sstromquist",
                  "body": "Yeah, I traded in an iPhone XR last year for an iPhone 15, I was given $300 credit for it towards an $800 phone which I thought was an amazing deal.\n\nMy stepsister traded in her more recent model for a new one as well and she only had a pay like $100 or something for the newest. This was with AT&T, not sure how much other carriers give but it definitely isn’t predatory when they give you very good amounts for phones that are extremely outdated and don’t work well anyway.",
                  "score": 6,
                  "created_utc": 1737479937.0,
                  "replies": [
                    {
                      "id": "m8eabzz",
                      "author": "navigationallyaided",
                      "body": "Yea, I had an old Galaxy S10e I traded in for an iPhone 16 Pro. I’m guessing you used that same T-Mobile trade-in too. \n\nIt doesn’t feel too different than my 13 Mini except for the screen, AI and physical size.",
                      "score": 1,
                      "created_utc": 1737485989.0,
                      "replies": [
                        {
                          "id": "m8esf56",
                          "author": "sstromquist",
                          "body": "Mine was with at&t, traded in an iPhone for an iPhone so I guess not as relevant to Samsung but it’s still same topic of trade ins",
                          "score": 1,
                          "created_utc": 1737490932.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8dzhmo",
                      "author": "Aralevara",
                      "body": "The predatory part of carriers doing it is it locks you into their service until the phone is paid off. She'll be getting credits every month on her bill for 24 months or 36! Months, but if she cancels, she'll owe what's left. \n\nIt's fine if you know what you're getting into, but so many people would be better off not doing an installment plan with premium service. It's normalized, but for sure, it is predatory. They'll take the hit and give cheap phones because the amount they get from the service cost more than makes that up. \n\nYou can definitely go on a pre-paid plan and get the phone thru samsung or apple programs for less than the cost of service at the big 3. Additionally, you'll pay the sale tax of the whole cost of the device. If you have a flagship that's only 1-2 years old, you do not need to upgrade, and it's a total luxury waste. The upgrade incentives are there to lock you into expensive service plans and keep you there. If you can and want to, by all means, go for it. I would recommend trading in thru samsung and apple themselves rather than a carrier if possible.",
                      "score": -1,
                      "created_utc": 1737483050.0,
                      "replies": [
                        {
                          "id": "m8eadeg",
                          "author": "JayKay8787",
                          "body": "Phone contracts are not predatory, I'm sorry. They allow people with less money on hand to get a phone. And if you get locked into a contract you can get out of it rather easily, just pay off the phone and a small fee to end the line. They tell you all this when you sign up, it's pretty reasonable.",
                          "score": 8,
                          "created_utc": 1737486000.0,
                          "replies": []
                        },
                        {
                          "id": "m8es22b",
                          "author": "sstromquist",
                          "body": "2 year contracts for phones is nothing new. The employee who helped me with this explained the contract and the credit system, that it would be applied to the bill monthly.\n\nIt’s not predatory if they provide all these details to you. I also went into this expecting to have to pay for the whole phone with no trade in credit at all because my phone was 6 years old. I’m sure most people would assume a phone that old would be worth next to nothing",
                          "score": 4,
                          "created_utc": 1737490831.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8dmeri",
                  "author": "Ace_of_Sevens",
                  "body": "It's to keep old phones off the used market, where they would be an even more affordable option.",
                  "score": 13,
                  "created_utc": 1737479476.0,
                  "replies": [
                    {
                      "id": "m8dnji0",
                      "author": "zzzzzooted",
                      "body": "I used to buy my phones off the used market and stopped using it because many “refurbished” phones break again much faster.\n\nMany people don’t want to fight their technology to get it to work, they just want it to work, and getting a brand new phone for the price i would be getting a used one anyways works better.",
                      "score": 0,
                      "created_utc": 1737479790.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8dmne3",
                  "author": "Petra246",
                  "body": "Reading your comment on an 8-year old iPhone. Battery replacement last year.",
                  "score": 5,
                  "created_utc": 1737479543.0,
                  "replies": [
                    {
                      "id": "m8doy6r",
                      "author": "zzzzzooted",
                      "body": "Good for you! Again: i also prefer a better camera, so i would never keep the same model for 8 years regardless of if it was buggy or not. Rather than pay for repairs, i trade shit in when its old enough for me to consider a new model, and the new model satisfies my desires.\n\nI did this before trade in programs were available without contracts, so its not that the trade in program is ~making me do this~ so much as it is *making what i already wouldve done more affordable and allowing me to get new phones rather than refurbished ones, which i have had issues with almost every time*",
                      "score": 1,
                      "created_utc": 1737480177.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8dsouu",
                  "author": "ErGo404",
                  "body": "Never said it was predatory.\n\nI said they were actively encouraging you to switch every year.",
                  "score": 2,
                  "created_utc": 1737481202.0,
                  "replies": [
                    {
                      "id": "m8dx1pu",
                      "author": "Worsehackereverlolz",
                      "body": "Any business is encouraging you to purchase from them, it is then oh the consumer to make smart choices, which is what the OP commenter said, which is that no one needs to upgrade yearly",
                      "score": 6,
                      "created_utc": 1737482383.0,
                      "replies": []
                    },
                    {
                      "id": "m8dxq96",
                      "author": "zzzzzooted",
                      "body": "How are they encouraging you to switch every year? What specifically is encouraging that you switch *every year* besides the option being slightly more affordable and them making new products?\n\nLike obviously they would love that, but how are they *encouraging* it *here specifically*?",
                      "score": 3,
                      "created_utc": 1737482570.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8dnajc",
                  "author": "Letters_to_Dionysus",
                  "body": "as you say trade programs convince people to buy phones they can't afford instead of going for cheap options within their budget",
                  "score": -2,
                  "created_utc": 1737479721.0,
                  "replies": [
                    {
                      "id": "m8do9ie",
                      "author": "zzzzzooted",
                      "body": "No, trade programs make brand new, unused phones be in budget for people by allowing them to sell their old phone back to the company.\n\nI would much rather sell my old phone to the company that can recycle its parts (otherwise they wouldnt be doing this) than try to sell my old phone on ebay after getting someone else’s old phone, which is more likely to have issues than a new phone.\n\nYou’re trying way too hard to villainize this.",
                      "score": 6,
                      "created_utc": 1737479990.0,
                      "replies": [
                        {
                          "id": "m8doptb",
                          "author": "Letters_to_Dionysus",
                          "body": "I used to work for phone companies and can confirm that they are villains lol. you think when a company does a free trial or a coupon that they do it out of benevolence? no they want you hooked on something expensive",
                          "score": 2,
                          "created_utc": 1737480114.0,
                          "replies": [
                            {
                              "id": "m8dpcff",
                              "author": "zzzzzooted",
                              "body": "Im not saying the companies arent evil, im saying that this specific thing has objective benefits and the most “evil” thing about it is that its gonna encourage brand loyalty.",
                              "score": 4,
                              "created_utc": 1737480284.0,
                              "replies": [
                                {
                                  "id": "m8dzbgn",
                                  "author": "pathologicalDumpling",
                                  "body": "And buying new phones more frequently than you need to",
                                  "score": -1,
                                  "created_utc": 1737483004.0,
                                  "replies": [
                                    {
                                      "id": "m8dzkwv",
                                      "author": "zzzzzooted",
                                      "body": "How exactly is it doing that? I would be getting phones every 3-4 drops regardless, i was before trade ins were so available, all it changed is that im getting a *new phone* from them, rather than a used phone thats gonna break faster lmao",
                                      "score": 3,
                                      "created_utc": 1737483075.0,
                                      "replies": [
                                        {
                                          "id": "m8ebj5a",
                                          "author": "JayKay8787",
                                          "body": "I don't know why everyone is so mad, they don't have to use the service. It's wild that some people don't understand not wanting to use a 5 year old used phone.",
                                          "score": 2,
                                          "created_utc": 1737486318.0,
                                          "replies": [
                                            {
                                              "id": "m8ef0pp",
                                              "author": "C_Madison",
                                              "body": "That's not hard to understand. Being *poor* (because someone wrote the good thing is poor people can have new phones) and prioritizing this, that's wild. Or maybe my definition of poor is different.",
                                              "score": -2,
                                              "created_utc": 1737487273.0,
                                              "replies": [
                                                {
                                                  "id": "m8f75zu",
                                                  "author": "zzzzzooted",
                                                  "body": "What I said is that some people need up-to-date phones for work and this makes that more affordable for people who couldn’t afford it otherwise, you’re the one making it about poor people buying things that aren’t necessary, but they are necessary! for work.",
                                                  "score": 2,
                                                  "created_utc": 1737494913.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m8e1cbu",
                                          "author": "pathologicalDumpling",
                                          "body": "They offer it so people are incentivised to replace their phones more frequently than they would otherwise. \n\nCompany's like this need to make sales every year. Shareholders wanna see them selling more and more new phones each year to show \"growth\". This is one way to get people hopping from one new phone to the next and add up the numbers each time.",
                                          "score": 1,
                                          "created_utc": 1737483556.0,
                                          "replies": [
                                            {
                                              "id": "m8fhi0k",
                                              "author": "asscdeku",
                                              "body": "The problem is that it's actually a bad deal for new phones lol. Samsung provides a massive base deal for promotional trade ins during the first week of a phones launch. The base value for most Samsung phones actually sucks balls for trade ins, but the promotional deals gives a ridiculously high floor trade in value even for damaged phones.\n\nThis means people with broken phones or older phones are more incentivized and have a significantly better deal trading in their i.e water damaged s20 for like a free 200-300 off in comparison to something like a pristine s24, which only gives marginally more value.\n\nLike yeah Samsung needs to make sales every year, but they don't actually prioritize the previous year phones for trade ins",
                                              "score": 1,
                                              "created_utc": 1737497723.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8h02vs",
              "author": "Call_Me_ZG",
              "body": "Not sure what you expect the brands to do. \n\n\nEven if everyone is on a 4 year cycle when it's time to upgrade, you'll go for the best value proposition. \n\n\nI'm fine if they release a phone every year as long as they have some level of repairablity and support for 5ish years",
              "score": 2,
              "created_utc": 1737514795.0,
              "replies": [
                {
                  "id": "m8illu2",
                  "author": "ErGo404",
                  "body": "I'm not really against the release of a new model every year as long as : \n\n\\- they provide support for a long time, including spare parts, affordable repairs, and a recycling program for dead units  \n\\- they don't actively encourage people to change until their previous unit is dead and unrepairable\n\n  \nHonestly that should be the bare minimum in 2025 given the environmental impact of the billions of phones built every single year but hey, current leaders in those companies won't face the consequences of their policy.",
                  "score": 2,
                  "created_utc": 1737543061.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8f5z1x",
          "author": "Xylamyla",
          "body": "I really don’t think it’s as bad as people make it out to be. I’d like to see data on how many buyers are upgrading from the previous model vs how many are upgrading from an older model or different phone.",
          "score": 1,
          "created_utc": 1737494596.0,
          "replies": []
        },
        {
          "id": "m8gw4wh",
          "author": "_Spastic_",
          "body": "I ran an S8 for 6 years until it shattered due to my negligence. I don't understand people who get new phones every year or two.",
          "score": 1,
          "created_utc": 1737513498.0,
          "replies": []
        },
        {
          "id": "m8i1axv",
          "author": "Whiskey-Weather",
          "body": "This is correct, but also feels like a dead end. Quite frankly, consumers buy trash, evilly sourced products, etc. all the time. Myself included. \n\nWhat happens when \"we/they must learn a lesson\" and \"We/they most assuredly won't\" collide? I guess fortunes are made amidst the churn, and time will tell how both sides of the consumer/producer coin play their respective parts.",
          "score": 1,
          "created_utc": 1737530793.0,
          "replies": [
            {
              "id": "m8jdhy2",
              "author": "None",
              "body": "Evilly sourced products is entirely different and something the every day consumer doesn’t have much choice or mostly even awareness of.\n\nUpgrading your non-broken phone from last year’s model is a choice people actively make for themselves.",
              "score": 1,
              "created_utc": 1737555103.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8i7lva",
          "author": "None",
          "body": "Yup. vote with your wallet.",
          "score": 1,
          "created_utc": 1737534487.0,
          "replies": []
        },
        {
          "id": "m8ip4hd",
          "author": "speakerall",
          "body": "Planned obsolescence",
          "score": 1,
          "created_utc": 1737545029.0,
          "replies": [
            {
              "id": "m8jdq2s",
              "author": "None",
              "body": "Yeah but even that should get you about 5 or so years. A new phone every year is just a dumb consumer",
              "score": 1,
              "created_utc": 1737555179.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8jal2w",
          "author": "firsmode",
          "body": "Peoples phones get worn out and need replacing. Many times new phones are sold to people who have not upgraded their phone in years.",
          "score": 1,
          "created_utc": 1737554110.0,
          "replies": [
            {
              "id": "m8jgmi1",
              "author": "None",
              "body": "Which is exactly why it’s not Samsungs fault for a releasing a new phone every year. Some people need a new phone. \n\nThe people engaging with frivolous spending are the ones that need to learn the lesson, so it’s a consumer issue.",
              "score": 2,
              "created_utc": 1737556120.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8ju2ea",
          "author": "ssuuh",
          "body": "Im pretty sure there are also a lot of people who don't understand that others in their surroundings upgrade regularly but because they can and not because they pay for it. \n\nCompany phones for example or as a business expense.",
          "score": 1,
          "created_utc": 1737560138.0,
          "replies": []
        },
        {
          "id": "m8jx6dw",
          "author": "k410n",
          "body": "Yes, governments must prevent this shit. As long as we live in a capitalist system cooperations exist for the purpose of making as much money as possible by selling as many products l, produced as cheaply as possible for the highest price they can get anyone to pay them.\nWe simply cannot afford this shit, and we obviously do not need it and never did",
          "score": 1,
          "created_utc": 1737561002.0,
          "replies": [
            {
              "id": "m8jzwbq",
              "author": "None",
              "body": "…so…let me get this right, you think companies would operate differently under communism or some other form of economic structure? Even in feudalism or in empires, you have one or two families (read: companies) controlling each industry, amassing all of the wealth. One group controls the quarries, others the logging, others the manual labor, others control the laborers. The class of owners become the nobility of the land and are in the pocket of whoever controls the law, whether it’s a government, king or emperor.\n\nThis has been evidenced in every civilization we have ever known about. From ancient Egyptians to feudal Japan to modern America. What does capitalism have to do with it?",
              "score": 1,
              "created_utc": 1737561756.0,
              "replies": [
                {
                  "id": "m8k2es5",
                  "author": "k410n",
                  "body": "For the longest time slavery murder and rape were considered perfectly acceptable, yet you (I hope) do not endorse these values.you describe the primitive and obviously disagreeable state of affairs we find ourselves in and which has long plagued us. This is something that must be overcome.\n\nCapitalism -  and the system that claimed to be communist and differ from it fundamentally, yet only manage to shift the maner, perpetrator and victim of their machinations - enforce and propagate those values enslaving us, thus they must be overcome.\n\nI do not want companies to operate in another way, I wish them to cease to exist.\nThe way in which our societies are structured - not to enjoy the fruits of our labour, instead to live to labour and labour to consume - are not just morally objectionable but also unsustainable. Consumerism is among the most destructive forces humankind could ever imagine. To produce and consume as we do is not just incredible oppression, but will also destroy us all.",
                  "score": 1,
                  "created_utc": 1737562462.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8lsdos",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1737579132.0,
          "replies": [
            {
              "id": "m8m6lia",
              "author": "None",
              "body": "Yeah, leasing a phone is predatory in the same way leasing a car is predatory; it makes no sense for the consumer to do, outside of immediate need, which puts them in a vulnerable position.\n\nYour best course of action is returning the phone at the end of contract and purchasing a prepaid smartphone until you can save up, over the course of *months*, to afford a phone at full price, *and then* get a contract if you still miss the service, once your phone is full paid off. From that point, you’ll have about 5 years to save up for another phone before the one you bought isn’t supported anymore.\n\nGotta get out of that non-ownership cycle any way you can.",
              "score": 1,
              "created_utc": 1737582921.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8qw2nr",
          "author": "GamerRadar",
          "body": "It’s more Techtubers need a reason to care…. Most people don’t give a damn and will upgrade when their phone stops working or gets slow enough",
          "score": 1,
          "created_utc": 1737649711.0,
          "replies": []
        },
        {
          "id": "m8dxa38",
          "author": "kuroimakina",
          "body": "That’s sort of complicated though. Companies spend lots of money on making their marketing and their products as appealing as possible - to the point of relying on psychological manipulation and taking advantage of certain common human behavior to influence people into certain behavioral patterns. This is present in basically every facet of our lives (at least in the US and much of the western world). Food, fashion, electronics, social media, gaming, you name it \n\nWhile consumers definitely need to do better, the reality is that they will not, which is why government run consumer protection agencies are very important",
          "score": 1,
          "created_utc": 1737482446.0,
          "replies": [
            {
              "id": "m8ek12d",
              "author": "None",
              "body": "Yup. And the psycho-manipulation has been happening since the 1970s. So it’s been 2-4 entire generations of this being public knowledge.",
              "score": -1,
              "created_utc": 1737488631.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8isuxl",
          "author": "Shamscam",
          "body": "This 100%. I only get a new phone when it doesn’t cost me anything extra. If my provider wants to give me the best phone at the exact same rate I am paying right now then I’m going to take it!",
          "score": 1,
          "created_utc": 1737546949.0,
          "replies": [
            {
              "id": "m8jdxfu",
              "author": "None",
              "body": "Same lol I got my first iPhone on a family plan when they did “buy 1 get 3 free” at Verizon like 10 years ago.",
              "score": 1,
              "created_utc": 1737555245.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8dv0ab",
          "author": "1980-whore",
          "body": "Nah they are starting to sabotage the phones like apple. Im on the top teir s21 and its running like poo no matter how much i clean it up and remove the background cancer.",
          "score": -1,
          "created_utc": 1737481833.0,
          "replies": [
            {
              "id": "m8eoiec",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1737489850.0,
              "replies": [
                {
                  "id": "m8ewkua",
                  "author": "1980-whore",
                  "body": "Possible, or im just the sucker who they think will upgrade the quickest.",
                  "score": 1,
                  "created_utc": 1737492066.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8frij7",
              "author": "rechlin",
              "body": "I think there was something wrong with the S21 series.  My wife had an S21 and it was terrible too, so she replaced it with an S24 last year.  Meanwhile my S20 is still going strong with no problems.",
              "score": 2,
              "created_utc": 1737500648.0,
              "replies": [
                {
                  "id": "m8ftgyj",
                  "author": "1980-whore",
                  "body": "Its possible, mine had tfhe first run of the upgraded camera so im sure there was a bunch of stuff they were tinkering with.",
                  "score": 1,
                  "created_utc": 1737501253.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8ejpou",
              "author": "None",
              "body": "Then you should learn your lesson and stop buying Samsung. This is still on you.",
              "score": 3,
              "created_utc": 1737488547.0,
              "replies": [
                {
                  "id": "m8exf6a",
                  "author": "1980-whore",
                  "body": "My mil reviews this stuff for a living, I've  had huwei, one plus, samsung, nokia and all the other major brands from china to the u.s.. I've even reviewed a few things for her. This phone is not bad comparitavly to many other brands, there are very few that are just flat out no gos anymore. But if samsung is going the way of apple they are definitely on that list for me.",
                  "score": 0,
                  "created_utc": 1737492294.0,
                  "replies": [
                    {
                      "id": "m8f05cs",
                      "author": "None",
                      "body": "For sure, I don’t doubt you, or even disagree with you.\n\nBut no one is holding a gun to anyone’s head to make them buy anything. Pre-paid phones exist, they just aren’t sexy. There are options.",
                      "score": 3,
                      "created_utc": 1737493024.0,
                      "replies": [
                        {
                          "id": "m8f2c8x",
                          "author": "1980-whore",
                          "body": "Kind of a weird statement considering i just said my mil reviews phones and tech for a living. I understand there are options and just said from experience this is par for the course. And while those pay as you go smart phones can do a lot, saying they are a nonsexy viable option for someone like me who needs the camera and storage for work just isn't true. \n\nYou can also put those prepaid phones on major carriers and vice versa, carrier has less to do with that other than tracphone is more concerned with you buying the next top up at insane rates than buying a new phone because their target demographic can't afford that.",
                          "score": 0,
                          "created_utc": 1737493613.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8gj75e",
              "author": "audigex",
              "body": "> Nah they are starting to sabotage the phones like apple.\n\nThis is, frankly, an awful argument, Apple devices generally have great longevity\n\nIn the room I'm sitting in I have\n\n- A 2009 MacBook. 15 years old\n- A 2011 2nd Gen iPad 2, 13 years old\n- A 2013 iPad Air (I think my actual device is 2014). 11 years old\n- A 2015 iPad Mini 4, 9 years old\n- A 2016 iPhone 7 Plus, 9 years old\n\nAll still work, two are still in daily use - one being theiPad Air as a YouTube-only device\n\nAnd my 2009 MacBook is still running a supported version of MacOS, admittedly without official support... but it works surprisingly well for a 15 year old laptop\n\nI've literally only broken two Apple Devices ever. The iPhone 6 Plus (which definitely had a flawed design) and my 2018 Airpods which eventually had one battery fail after 6 years of constant use.\n\nOh and I think I actually still have an iPhone 4S and 3GS knocking around somewhere, but I'd have to check if they still power on after sitting with 0% charge for years",
              "score": 1,
              "created_utc": 1737509303.0,
              "replies": [
                {
                  "id": "m8j8k7u",
                  "author": "1980-whore",
                  "body": "Dude, they have litteral lawsuits, huge settlrments, and every other legal action over the software they used to kill batteries. You can say all the stuff you want, but it has already gone through courts and they were found guilty.",
                  "score": 1,
                  "created_utc": 1737553408.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8fshd1",
      "author": "None",
      "body": "[deleted]",
      "score": 51,
      "created_utc": 1737500947.0,
      "replies": [
        {
          "id": "m8p9dql",
          "author": "THBLD",
          "body": "Exactly. I've only ever upgraded phones when I've had massive problems or deterioration with the previous ones. Usually I'm upgrading like every three to five years, and they last so long, because I generally buy flagship models.",
          "score": 1,
          "created_utc": 1737627324.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8d5b1w",
      "author": "pimpeachment",
      "body": "You don't have to buy every iteration. But they also shouldn't just make one and sit on it for 3 years. Iterative development is good. They keep getting better. Not everyone needs a new phone today. But I certainly wouldn't want to need one today and have to buy the 3 year old model knowing the next one is coming in 3 months. This means you always can buy a phone that's about a year up to date when you need one. ",
      "score": 401,
      "created_utc": 1737474694.0,
      "replies": [
        {
          "id": "m8grh1b",
          "author": "KaitRaven",
          "body": "Yeah, I'm not sure why people are so worked up about this. Cars have a new model year released annually, that doesn't mean you are expected to buy a new car every year.",
          "score": 48,
          "created_utc": 1737511959.0,
          "replies": [
            {
              "id": "m8h48os",
              "author": "__theoneandonly",
              "body": "Seriously imagine that they only updated the phones every 3 years when there was a \"big\" update. Who would buy phones during the off years? Who would buy a 30-month old phone when the next \"big\" update is 6 months away? At least with annual iterative upgrades, you know that you're always buying a phone that's less than a year old, or you're less than a year away from the next one",
              "score": 18,
              "created_utc": 1737516212.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8d6hvr",
          "author": "Threndsa",
          "body": "100% this. I dont get why people buy new phones every year when almost every other piece of electronics people use is on more of a 4-8 year cycle. I'm still using my S10 and I'm just getting to the point where I'll probably be considering an upgrade to the S24 once a good deal pops up after the 25 is out. We're at a point where the difference is substantial enough to warrant spending hundreds of dollars on a new phone.",
          "score": 109,
          "created_utc": 1737475030.0,
          "replies": [
            {
              "id": "m8dvmpk",
              "author": "calcium",
              "body": "I used to update phones every 2 years, then 3. Now I’m updating every 4 years and even then there’s not a huge difference between them. Wife just upgraded from the 12 Pro to 16 Pro and about all she can say is “it feels snappier”. Toss in a new battery every 2-3 years and your phone will last for a good long while. Don’t know of anyone (even the most die hard tech nerds) who update every year.",
              "score": 22,
              "created_utc": 1737482001.0,
              "replies": [
                {
                  "id": "m8ho257",
                  "author": "egguw",
                  "body": "i went from the 8 plus to the 14 pro max and it blew me away",
                  "score": 1,
                  "created_utc": 1737523993.0,
                  "replies": [
                    {
                      "id": "m8hoi29",
                      "author": "calcium",
                      "body": "You also went through a redesign. The iPhone hasn’t changed much since the 11",
                      "score": 2,
                      "created_utc": 1737524195.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8hv49q",
                  "author": "i_liek_trainsss",
                  "body": "This. I used to buy economy/feature phones, and upgrade every ~3 years. In 2020 I decided to finally treat myself to a flagship, the Galaxy S20 Ultra. I think that it is regarded as a bit of a flop for its time, but hey, it's been good for me, even some 5 years later. I'm really only contemplating upgrading now because security updates are dropping off and the battery is losing capacity.",
                  "score": 1,
                  "created_utc": 1737527450.0,
                  "replies": [
                    {
                      "id": "m8hwgs9",
                      "author": "calcium",
                      "body": "You should be able to plop in a new battery for less than $100 but the security updates are the larger issue IMO. I’m still rocking an iPhone 13 Pro and it’s been nothing but a solid workhorse for me. I may hold onto it for 5 years and do a battery swap soon, but I love that Apple will support their phones for a minimum of 7 years of feature updates and possibly longer for security.",
                      "score": 2,
                      "created_utc": 1737528154.0,
                      "replies": [
                        {
                          "id": "m8hx2j3",
                          "author": "i_liek_trainsss",
                          "body": "Yeah, if it weren't for the camera specifically being a weak point, I would probably do a battery swap on my 20 Ultra and keep using it at least as a camera even as I get a newer daily driver.",
                          "score": 1,
                          "created_utc": 1737528472.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8i661g",
                  "author": "toumei64",
                  "body": "I've kept each phone I've had for 3 to 5 years. The one that I kept for slightly over 5 years I finally upgraded because It was getting old and struggling and my partner was like this new phone is coming out that you'll be interested in, now might be a good time to finally upgrade and get rid of your frustration. I got the Pixel 4 XL and loved it. I kept it for 3 years and only upgraded to the Pixel 7 Pro because there was a deal that made it practically free over 3 years. By the time Google releases whatever AI abomination phone this coming fall, it'll be time to upgrade again, provided that they offer a good deal.\n\nI'm kind of fed up because \"innovation\" has turned into blatant enshittification and planned obsolescence abounds as they release new software features exclusive to the new phones. With a little tinkering you can fake it on old phones and get a lot of the stuff working. I participated in some of the Android betas and Google made it clear that they do not give a shit what their users think. They have their own plan and they're leaning in on it no matter how much we hate it. I used to like using Google products. Now I just tolerate them because they're the least awful.",
                  "score": 1,
                  "created_utc": 1737533611.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8igrnn",
              "author": "kvng_stunner",
              "body": "Exactly. \n\nI have used a pixel 4a since 2020 and I just upgraded to a pixel 8 6 months ago. \n\nIf I didn't use 2 phones at the same time, I wouldn't buy another phone, but since I do, I'll also be upgrading my Huawei from 2019 (probably get the next flip phone from Samsung).\n\nIf the last phone both companies made was from 3 years ago, I definitely would not be upgrading for another year (even though I badly needed the upgrade last year)",
              "score": 1,
              "created_utc": 1737540190.0,
              "replies": []
            },
            {
              "id": "m8j556s",
              "author": "Maelarion",
              "body": "Yeah. Two years ago I got the S22 Ultra (previously had S9). Even then, I didn't *need* to upgrade, but I could, and I wanted to take better pictures on a two-week visit to my parents I was about to go on.\n\nLike, the S24 Ultra is nice but...no need to upgrade. My S22 Ultra is fine. I'll run this into the ground and then think about a new phone.",
              "score": 1,
              "created_utc": 1737552170.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8dqvuy",
          "author": "Nobanob",
          "body": "I usually keep my phone 5+ years before upgrading then I get yesteryears model at a discounted price.",
          "score": 7,
          "created_utc": 1737480707.0,
          "replies": []
        },
        {
          "id": "m8d6r5u",
          "author": "atlasgcx",
          "body": "Edit: yes I confused “customer to replace phone every year” and “manufacturer to release phone every year” \n\nPersonally, I’m honestly not sure why sit on it for 3 years is bad. I’m still using a phone 4 years old which is perfectly fine, I don’t think any tech advancements in the last few years really excites me (another AI assistant?)\n\nIt’s like there isn’t a good reason for me to change my TV every 5 years.",
          "score": 3,
          "created_utc": 1737475103.0,
          "replies": [
            {
              "id": "m8d8ep5",
              "author": "wildddin",
              "body": "They mean the manufacturer not the consumer. The point is it's good that phone manufacturers release a new phone every year, so if you need to replace your 4 year old phone as it has broken, you can buy a phone that is under a year from release. \n\nIf manufacturers waited for meaning upgrades before releasing a new iteration, you could be forced to buy a phone that is 2 and a half years old, when they'll be releasing a new version in 6 months.",
              "score": 15,
              "created_utc": 1737475575.0,
              "replies": [
                {
                  "id": "m8d8lz9",
                  "author": "atlasgcx",
                  "body": "Oh that. Yes I agree, someone will be on their 3/4/5th year this year.",
                  "score": 5,
                  "created_utc": 1737475633.0,
                  "replies": []
                },
                {
                  "id": "m8dsrap",
                  "author": "Photo_Synthetic",
                  "body": "It's also nice when you want to wait out the new release and snap up a deal on a year old phone that is still way better than what you're replacing.",
                  "score": 2,
                  "created_utc": 1737481221.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8d94kc",
              "author": "MatsMaLIfe",
              "body": "I think they meant Samsung releasing every 3 years and not consumer habits buying every 3 years. I'm with you though - I did Pixel -> Pixel 4 -> Pixel 8 Pro. Only reason I went flag ship this time was because I started traveling and wanted to be able to take nicer pictures and a longer battery life.",
              "score": 1,
              "created_utc": 1737475782.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8df883",
          "author": "gats1212",
          "body": "And would you really feel the difference between these phones? People are still going to use it to take photos, post them on instagram, text through SMS and whatsapp, you don't need the latest snapdragon or more than 4GB to use the web browsers efficiently.",
          "score": 1,
          "created_utc": 1737477496.0,
          "replies": [
            {
              "id": "m8dibru",
              "author": "pimpeachment",
              "body": "Some people do, some don't. I play games on my phone, so having a newer CPU is nice. I also take a lot of photos of my kids, so better quality camera is nice. I upgrade once every 2.5 years on average. Everyone is different, but I am happy there is always a more modern version when I do go buy a phone and I don't have to plan for a major updates, and I know a new one is coming at a scheduled interval, so if I do plan, it's going to be available for me.",
              "score": 12,
              "created_utc": 1737478347.0,
              "replies": []
            },
            {
              "id": "m8dq4p1",
              "author": "QuestGiver",
              "body": "This year they are starting to implement new denser battery tech so more battery for same weight. I think a lot more phones will absolutely become two day heavy use phones which could be really cool.",
              "score": 2,
              "created_utc": 1737480499.0,
              "replies": []
            },
            {
              "id": "m8mno01",
              "author": "Tifoso89",
              "body": "Who texts through SMS on a smartphone? I agree on the rest though",
              "score": 1,
              "created_utc": 1737588106.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8dpf0d",
          "author": "xSmallDeadGuyx",
          "body": "Yeah I've never bought a new phone every year. At first it was every 2 years, last time it was 4 years between the s20 and s24. Will likely be at least 4 years between the next upgrade. The incremental differences each year are neglible, but over multiple years it builds into a much bigger difference.",
          "score": 1,
          "created_utc": 1737480304.0,
          "replies": []
        },
        {
          "id": "m8hj8b7",
          "author": "radicalelation",
          "body": "I've had zero reason to move on from my then-refurbished Note9 I got in 2019. Need a new pen, and to backup and reset for the first time for refresh but it's been everything I need and more.",
          "score": 1,
          "created_utc": 1737521885.0,
          "replies": []
        },
        {
          "id": "m8i3hml",
          "author": "NuclearReactions",
          "body": "I don't know about them getting better, i feel like my s6 used to have more features and a better battery compared to my s20. As for performance, it's a silly arms race among phone makers, nobody needs 8gb of ram in a damn phone that's as much as we used to have on our PCs a few years ago. Only thing that improved is the charging port being usb c",
          "score": 1,
          "created_utc": 1737532053.0,
          "replies": [
            {
              "id": "m8ih8b2",
              "author": "kvng_stunner",
              "body": ">nobody needs 8gb of ram in a damn phone that's as much as we used to have on our PCs a few years ago.\n\nYes we do. Phones and their apps are insanely powerful these days. You need that RAM or else or will drag when you need it to work fast.\n\nOf course part of this is that we as consumers now expect our phones to be fast af.\n\nIt's like how my laptop took 30-60 seconds to boot up in 2008, but I'd be fucking pissed if my laptop in 2025 took more than 15 seconds to start.",
              "score": 1,
              "created_utc": 1737540470.0,
              "replies": [
                {
                  "id": "m8imhda",
                  "author": "NuclearReactions",
                  "body": "If you use dex or game on it? Sure. But if i need 8gb for whatsapp, music/video stream or player, social media apps and some light photography then that's on the devs saving on optimization costs and leveraging the hardware instead. \n\nPhones have been snappy since a long time, that's the beauty of them never going through the hard drive phase. I don't feel like my s4 was any less quick than my s20 even though the apps had the same features more or less and even a very similar screen resolution. \n\nThe only thing that got quicker is the boot time, and those 20 seconds i save every once in a while when i manage to kill my battery completely are not worth the money. And believe me when i say that i would have noticed, I'm allergic to slow hardware, there is not a lot of things that make me loose patiente like a loading icon",
                  "score": 1,
                  "created_utc": 1737543558.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8i3u10",
          "author": "SiscoSquared",
          "body": "I buy a new phone every  4 or 5 years and even that seems too often in many ways, there's just no need\n, basically once I stop getting security updates then it's a concern.",
          "score": 1,
          "created_utc": 1737532251.0,
          "replies": []
        },
        {
          "id": "m8d6tcf",
          "author": "atlasgcx",
          "body": "Personally, I’m honestly not sure why sit on it for 3 years is bad. I’m still using a phone 4 years old which is perfectly fine, I don’t think any tech advancements in the last few years really excites me (another AI assistant?)\n\nIt’s like there isn’t a good reason for me to change my TV every 5 years.",
          "score": 1,
          "created_utc": 1737475120.0,
          "replies": [
            {
              "id": "m8htl9f",
              "author": "sabershirou",
              "body": "That's because not everybody changes their phone on a 3 year cycle at the same time. It's totally fine that you stick with your phone for a set number of years, but when you finally decide to upgrade, there will always be a phone that is less than 1 year from its release.",
              "score": 4,
              "created_utc": 1737526665.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8d7hxa",
      "author": "OrganicKeynesianBean",
      "body": "This is like asking Activision to stop releasing yearly Call of Duty.",
      "score": 104,
      "created_utc": 1737475315.0,
      "replies": [
        {
          "id": "m8d9ww6",
          "author": "Bakedsoda",
          "body": "why does a company that exists to release products keep releasing products every year around the same time.  make it stop.  i have no self control",
          "score": 64,
          "created_utc": 1737476008.0,
          "replies": [
            {
              "id": "m8dap4y",
              "author": "MHWGamer",
              "body": "why is the company release a product every year just because they make big profit of it?!?\nhave you thought about the children!\n\n(actually, I should just unsub this subreddit as 99% of linked articles are just bait-nonsense reposted for 10 years now)",
              "score": 11,
              "created_utc": 1737476231.0,
              "replies": [
                {
                  "id": "m8ht4u9",
                  "author": "Proponentofthedevil",
                  "body": "Personally? I blame Capitalism.\n\nPlease shower me in upvotes due to my very nuanced and well constructed reasoning.  Nothing more needs to be said.",
                  "score": 1,
                  "created_utc": 1737526432.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8r7kea",
          "author": "ThePr0vider",
          "body": "there's three studios making CoD so technically there is no single cod timeline. every subversion of CoD gets a release every three years",
          "score": 2,
          "created_utc": 1737652862.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dhr20",
      "author": "Confused_Drifter",
      "body": "There is absolutely no reason to care about this years phone until your current phone is not fir for purpose. If it does what you need, why are you chasing an upgrade to begin with??",
      "score": 14,
      "created_utc": 1737478189.0,
      "replies": [
        {
          "id": "m8dnsb4",
          "author": "Dadisfat46",
          "body": "Yeppers. I’ve just purchased 2-3 different cases and swap out BAM newish looking phone.NOTHING about newest phones I need. 14 pro working good",
          "score": 4,
          "created_utc": 1737479857.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dmqa1",
      "author": "2squishmaster",
      "body": ">Samsung needs to give us a reason to care about new phones every year\n\nThere is no reason to care about getting a new phone every year. Just because they released it doesn't mean *you* need to buy it, the person who has a 5 year old phone is who it's for, people just have FOMO.",
      "score": 33,
      "created_utc": 1737479565.0,
      "replies": [
        {
          "id": "m8j02bq",
          "author": "None",
          "body": "I don't even think that's their sales strategy, it seems like they keep their phones up to date so when people are ready for an upgrade they'll stick to Samsung.",
          "score": 1,
          "created_utc": 1737550201.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8d7tu0",
      "author": "I_R0M_I",
      "body": "Phone shave been this way for years.\n\nMinor incremental upgrades are the norm now. There aren't many more breakthroughs on the horizon, not other than gimmicky ones. They are already fast, batteries are good, screens are good etc etc. \n\nNo one has to buy them. I'm on a 23 Ultra, and only got that as my wife broke her phone. So I gave her my 22 Ultra (she doesn't look after phones, so no new ones for her).",
      "score": 14,
      "created_utc": 1737475409.0,
      "replies": []
    },
    {
      "id": "m8d5tca",
      "author": "brokenmessiah",
      "body": "I'm on the 21+ and I'm happy with the phone itself, though it feels sluggish now, but I'm sure just reseting the phone to factory default would accomodate for that.",
      "score": 23,
      "created_utc": 1737474839.0,
      "replies": [
        {
          "id": "m8dgvwl",
          "author": "50bucksback",
          "body": "I have an S9+. If the S21+ feels slow then definitely needs a factory reset.",
          "score": 20,
          "created_utc": 1737477951.0,
          "replies": [
            {
              "id": "m8dqeyb",
              "author": "QuestGiver",
              "body": "You need to upgrade lol wth. Respect.",
              "score": 6,
              "created_utc": 1737480577.0,
              "replies": [
                {
                  "id": "m8dspxb",
                  "author": "50bucksback",
                  "body": "Oh I for sure am to the S25+! Just saying an S21+ should still be working fine as far as speed goes. Even mine being on medium power saver which reduces CPU to 70% it's not slow.",
                  "score": 3,
                  "created_utc": 1737481211.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8d7frd",
          "author": "Tittop2",
          "body": "S20+ user here.  I put a new battery in it and it's a fast as most new phones, no ai but that could be a good thing.",
          "score": 11,
          "created_utc": 1737475297.0,
          "replies": [
            {
              "id": "m8f34gk",
              "author": "drealph90",
              "body": "I'm going to buy the s20 ultra as soon as my finances allow it. The s20 will be the last Galaxy s series phone I would ever buy because it's the last one that has a freaking micro SD card. There are only three or four flagship phones available right now that have micro SD cards.",
              "score": 8,
              "created_utc": 1737493825.0,
              "replies": [
                {
                  "id": "m8fhdhk",
                  "author": "Tittop2",
                  "body": "That's my next upgrade as well.  The phone works great, has an awesome camera and display, why spend more?",
                  "score": 3,
                  "created_utc": 1737497688.0,
                  "replies": []
                },
                {
                  "id": "m8gqb7d",
                  "author": "nladyman",
                  "body": "I'm actually looking to do the same but I'm not sure where to get one? I've seen some on eBay and whatnot but not sure how legit those are. \n\nI have an S20+ and I really don't wanna lose my microsd card functionality plus the S25 series doesn't really seem like a major improvement over recent iterations",
                  "score": 1,
                  "created_utc": 1737511582.0,
                  "replies": []
                },
                {
                  "id": "m8ja6q6",
                  "author": "Sasselhoff",
                  "body": "I'd still have my Note 20 Ultra (I read a lot of books and like the bigger screen...I'm also a Domesticated Bigfoot, so it's small for me) if it hadn't been having a problem with the GPS.  Well, that and the fact that for some crazy reason Samsung gave me $800 for it towards a new phone. \n\nI use a phone until it stops performing adequately, and then I move to \"last years\" model, instead of the current flagship model.",
                  "score": 1,
                  "created_utc": 1737553975.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8d9nf8",
      "author": "champs",
      "body": "Cars, PCs, and more go *years* with only modest, incremental updates. If you’re in the market for one today, you buy the current model, but if that purchase can wait for the next one, you get that instead. \n\nThis sounds less like an actual problem than occupational ennui. If you don’t think the event is important, don’t cover it!",
      "score": 12,
      "created_utc": 1737475933.0,
      "replies": []
    },
    {
      "id": "m8d7z52",
      "author": "luttman23",
      "body": "I keep mine until they're falling apart, had my s20fe until the screen was falling off. Only just got a new P9. I'll have this until it's banged up to buggary too",
      "score": 6,
      "created_utc": 1737475452.0,
      "replies": []
    },
    {
      "id": "m8g2rdd",
      "author": "dope_like",
      "body": "You're not suppose to upgrade every single year. You're supposed to skip a couple years for more meaningful updates",
      "score": 5,
      "created_utc": 1737504172.0,
      "replies": []
    },
    {
      "id": "m8dbwf0",
      "author": "evonebo",
      "body": "They don't need to give you a reason to buy every year because there is absolutely no need to buy a new phone every year.\n\nWhat you should learn is self control and awareness, use the item until it no longer works.\n\nSaves you money and the environment.",
      "score": 8,
      "created_utc": 1737476568.0,
      "replies": []
    },
    {
      "id": "m8d9i4j",
      "author": "Alkohal",
      "body": "I upgrade every 3 to 4 years. I honestly dont understand the need to upgrade every cycle because the changes year to year are pretty minimal.",
      "score": 3,
      "created_utc": 1737475890.0,
      "replies": []
    },
    {
      "id": "m8env7f",
      "author": "darth_voidptr",
      "body": "There are a lot of good reasons to keep doing year-over-year improvements even if only a fraction of people buy them. Think about how much more factory capacity you need, for example, to ramp up to resupply all of your customers at once, versus 1/4-1/2 of them every year. Think about the risk you need to take if, for example, your phone burns up on an airplane and everyone decides not to buy \\*that\\* model. \n\nAlso, and this is a hardware thing more than software: adding new features is often easier to do as a sequence of small changes rather than one big change. There's a trade off between frequency and test overhead, but harware development tends to prefer these yearly cycles.\n\n  \nBottom line, don't worry about it. Buy a new phone when you need it. MFG's will figure out the ROI and react. Marketing will of course continue to insist you need to update every millisecond.",
      "score": 3,
      "created_utc": 1737489673.0,
      "replies": []
    },
    {
      "id": "m8flnjx",
      "author": "Dick_Lazer",
      "body": "You don't need a new phone every year any more than you need a new car every year. That doesn't mean they shouldn't keep them up to date. When you do finally update you probably won't want a phone that's several years old.",
      "score": 3,
      "created_utc": 1737498914.0,
      "replies": []
    },
    {
      "id": "m8g5q82",
      "author": "djphatjive",
      "body": "I’m on a iPhone 11. It’s not an industry problem. Stop buying phones every year. They will have to stop changing them every year.",
      "score": 4,
      "created_utc": 1737505115.0,
      "replies": []
    },
    {
      "id": "m8giwza",
      "author": "Death_Pig",
      "body": "Every new \"LEAK OF 2025 phone\" looks the fucking same as the phones before it.",
      "score": 4,
      "created_utc": 1737509214.0,
      "replies": []
    },
    {
      "id": "m8dfe7b",
      "author": "ShadowBannedAugustus",
      "body": "I just upgraded from a 500 EUR S20 FE to a 800 EUR S24+. A 4-generation upgrade. There is no tangible improvement in terms of daily use, despite what the benchmarks say.\n\nI don't see how an upgrade every other year makes sense, let alone every year.",
      "score": 6,
      "created_utc": 1737477543.0,
      "replies": []
    },
    {
      "id": "m8f2k5s",
      "author": "drealph90",
      "body": "What I really need is expandable storage, fucking greedy assholes making me pay for non-expandable phones. And for phone manufacturers to stop advertising virtual memory as being part of the ram. I see phone saying 24 GB of RAM and then in parentheses 12 GB virtual memory.",
      "score": 3,
      "created_utc": 1737493671.0,
      "replies": [
        {
          "id": "m8faw2i",
          "author": "WordNERD37",
          "body": "The fold 6 doesn't even reach 12 GB virtual memory. Max out is 8.\n\nAnd I own a the fold 6 and have had the last few, but at this point, unless this thing conks out on me, or security updates and builds stop coming and using it becomes a liability, there's nothing Samsung has provided to keep me going year to year buying a new phone. \n\nThere needs to be some serious hardware features and benefits. The inner screen being better, really improved processing power, the stylus inside the phone, incredible camera array, something that doesn't just feel like minor improvement in the cycle of diminishing returns.",
          "score": 1,
          "created_utc": 1737495918.0,
          "replies": []
        },
        {
          "id": "m8fx675",
          "author": "Aquis_GN",
          "body": "Sony Xperia.",
          "score": 1,
          "created_utc": 1737502394.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8g2gzl",
      "author": "SchighSchagh",
      "body": "_sigh_ OK I'll spell it out. I don't buy a new phone every year. But when I do buy a new phone, I want one that was released recently, has all the latest bells and whistles, and has yearsssss of support on it.\n\nIf Samsung released a phone every... 3? years: Let's say I need a new phone 2.5 years into their cycle. I can either settle for a 2.5 hear old phone, with outdated features, and only maybe 2 or 3 years of updates. Or I can switch to a competitor.\n\nThe point of the yearly cadence is that whenever anyone upgrades, even if they haven't upgraded in a decade, gets the latest and greatest that was released less than a year ago. And which will continue to be supported for 5+ years.",
      "score": 3,
      "created_utc": 1737504077.0,
      "replies": []
    },
    {
      "id": "m8hdmhq",
      "author": "mnorri",
      "body": "I worked at a company making a low volume, high price piece of  equipment. Engineering pushed for a model year rollout concept.  There were improvements that would make it a little better for the user, a little cheaper for us to build, a little easier to service, etc.  Making a change to a product is expensive, because we needed to show to lots of stakeholders that the change didn’t affect the way it worked.  So lots of testing.  Maybe it was quieter, or the UI was snappier, the screen a little brighter but that the output was indistinguishable from the previous version.  Collecting a bunch of minor fixes until a triggering event (fixing a real problem) meant that we stopped improving the product at all because there weren’t any “aw shit” moments after the first months unless some sub component went end of life. \n\nI understand that phones are changing much more dramatically than our two-bit products, but there is benefit to saying “everything not ready by this date goes in next year’s model.”",
      "score": 3,
      "created_utc": 1737519638.0,
      "replies": []
    },
    {
      "id": "m8hhssb",
      "author": "ryanknapper",
      "body": "Make disposal a problem for the manufacturer.",
      "score": 3,
      "created_utc": 1737521292.0,
      "replies": []
    },
    {
      "id": "m8incfl",
      "author": "sturmeh",
      "body": "If Samsung doesn't push out an update each year, half their users will switch to a model/phone/brand that does.",
      "score": 3,
      "created_utc": 1737544049.0,
      "replies": []
    },
    {
      "id": "m8dnc4u",
      "author": "HanzanPheet",
      "body": "Isn't it up to the consumer of what to buy? Who gives a shit if they release every year? You don't have to buy it. Go every second third or 8th generation. \nA smart phone is a smart phone. Everything doesn't need to always be revolutionary every cycle. ",
      "score": 4,
      "created_utc": 1737479733.0,
      "replies": []
    },
    {
      "id": "m8db3xr",
      "author": "1leggeddog",
      "body": "They don't.\n\nBut they also do. Because shareholders demand yearly results and new planned releases do that.",
      "score": 2,
      "created_utc": 1737476347.0,
      "replies": []
    },
    {
      "id": "m8dcpy7",
      "author": "Xendrus",
      "body": "the answer is no, my galaxy S21 still works fantastically, I literally can't find a single reason to upgrade, even using the phone for work, even if the upgrade was $20, much less over $1000. A new phone is a flex for kids in school that don't know the value of a dollar yet.",
      "score": 2,
      "created_utc": 1737476796.0,
      "replies": []
    },
    {
      "id": "m8dh2vo",
      "author": "__sonder__",
      "body": "I think they have the right *general idea* with the foldable phones: experimental hardware is cool. People loved the Galaxy Note because it was different too. But not everyone wants a foldable phone, so there have to be other new innovations in hardware beyond those.\n\nPersonally I'd upgrade my S21+ today IF Samsung came out with a phone that had some width to it, like 4\" wide or so. I'm sick and tired of the aspect ratio of these phones.",
      "score": 2,
      "created_utc": 1737478005.0,
      "replies": []
    },
    {
      "id": "m8e2xzx",
      "author": "REV2939",
      "body": "I'm sure most don't buy a new phone each year.  I skip 3 generations before upgrading.  Just because Apple releases a new iPhone each year doesn't mean every iPhone user has to upgrade.",
      "score": 2,
      "created_utc": 1737483990.0,
      "replies": []
    },
    {
      "id": "m8f3t6d",
      "author": "Naroyto",
      "body": "Yeah, no. It's not up to the company to give its consumers a reason to care when people will keep buying regardless if each year the phone shows little to no change. The fact is that you don't need to \"upgrade\" your phone every year, yet so many do due to carelessness and in most cases vanity of having the \"newest\" phone. Much like cars being manufactured each year the phone is now in the same way that each year will be a new one and not much innovation is introduced. As for me I won't get another device until my Samsung galaxy s10 plus dies out on me and so far still working like day 1.",
      "score": 2,
      "created_utc": 1737494010.0,
      "replies": []
    },
    {
      "id": "m8fjuof",
      "author": "war-and-peace",
      "body": "Why though? Samsung and apple phones sell as is. The only true competitor was huawei and they got taken out of the world market by legal means. So now they're only significantly in china doing their trifold phones which is very innovative.",
      "score": 2,
      "created_utc": 1737498396.0,
      "replies": []
    },
    {
      "id": "m8gcrsv",
      "author": "reddit2bitcollector",
      "body": "People should stop buying phones every year as well, in addition to Samsung and/or Apple doing their part.",
      "score": 2,
      "created_utc": 1737507280.0,
      "replies": []
    },
    {
      "id": "m8gh80z",
      "author": "drealph90",
      "body": "The phone industry needs to be forced to manufacture phones that lack the ability to be locked to one carrier/country + support all networks worldwide. This would force all mobile carriers to actually provide good service or else customers would leave for a better service provider leading to an overall increase in service quality. We're also simplify purchasing a phone so I don't have to spend 2 hours figuring out of a specific model of phone will work for me on T-Mobile. Would also be more environmentally friendly because manufacturers wouldn't have multiple different sub models of each phone for different markets around the world, thus simplifying manufacturing as well.",
      "score": 2,
      "created_utc": 1737508681.0,
      "replies": []
    },
    {
      "id": "m8guurb",
      "author": "King-Rat-in-Boise",
      "body": "I've kept the same personal phone for 4 years. My work phone is brand new - I notice no difference in performance besides the camera. Iphone 11 and iphone 16. Honestly, the reliability is why I'll keep coming back. I know apple wants you to upgrade yearly or every other year... whatever. But if the quality diminished I would jump and try another brand - but so far iphone is like a Lexus.",
      "score": 2,
      "created_utc": 1737513075.0,
      "replies": []
    },
    {
      "id": "m8h5bz4",
      "author": "ebmx",
      "body": "There has never been a reason to care about new phones every year.",
      "score": 2,
      "created_utc": 1737516594.0,
      "replies": []
    },
    {
      "id": "m8h99wn",
      "author": "SadSwimmer9999",
      "body": "Just because they make a new phone every year doesn't mean that you need to buy a new one every year. That's regarded.",
      "score": 2,
      "created_utc": 1737518003.0,
      "replies": []
    },
    {
      "id": "m8ioa80",
      "author": "Pony5lay5tation",
      "body": "How about a fucking smaller phone  that will fit in my pocket ?",
      "score": 2,
      "created_utc": 1737544571.0,
      "replies": []
    },
    {
      "id": "m8isbmq",
      "author": "Fortyseven",
      "body": "S24U here. There would have to be some overwhelming improvement to the already excellent cameras to get me on board with 'upgrading'. I'm not even sure what that would look like: better zoom, maybe? Actual 100X instead of digital zoom? No idea. But the actual Android OS itself is snappy no matter what I do. It's basically 'done'.",
      "score": 2,
      "created_utc": 1737546685.0,
      "replies": []
    },
    {
      "id": "m8mnhft",
      "author": "Kaptajn_Bim",
      "body": "How about PEOPLE look in the mirror and ask: do i really need this?\nLet them release new phones.. who cares, don't buy if you don't need to.",
      "score": 2,
      "created_utc": 1737588049.0,
      "replies": []
    },
    {
      "id": "m8d6ofz",
      "author": "Jugales",
      "body": "It's gotten to the point where forced adolescence isn't possible because the technology is just too good, and competitors would undercut them if they made quality worse.\n\nIt's actually hilarious to me that Apple Intelligence, largely cloud-based software, is requiring a hardware upgrade to use. I'm sure they have some sensors or other justification, but it's only that - justification.\n\nRIP forced adolescence. Long live forced renewal.",
      "score": 7,
      "created_utc": 1737475081.0,
      "replies": [
        {
          "id": "m8d7s2r",
          "author": "XDenzelMoshingtonX",
          "body": "Doubling down on forced adolescence surely was a funny read",
          "score": 18,
          "created_utc": 1737475395.0,
          "replies": [
            {
              "id": "m8d8g27",
              "author": "Jugales",
              "body": "Great, now I'm a social piranha",
              "score": 6,
              "created_utc": 1737475586.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8d7ajf",
          "author": "letstalkaboutyrhair",
          "body": "*obsolescence",
          "score": 23,
          "created_utc": 1737475256.0,
          "replies": [
            {
              "id": "m8d87l6",
              "author": "Jugales",
              "body": "My b. Had 4 bowls for breakfast and only 1 was cereal. Keeping because it's funny.",
              "score": 9,
              "created_utc": 1737475519.0,
              "replies": [
                {
                  "id": "m8d8oj4",
                  "author": "letstalkaboutyrhair",
                  "body": "lmaooo. right on.",
                  "score": 1,
                  "created_utc": 1737475653.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8de6v6",
          "author": "Ok-Criticism6874",
          "body": "I hate when me (a 44 year old man) has to be labeled an 11 year old boy! Stop forced adolescence!",
          "score": 4,
          "created_utc": 1737477208.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8djq8w",
      "author": "NO_SPACE_B4_COMMA",
      "body": "I look at most Apple products and ask: why do we need this?",
      "score": 6,
      "created_utc": 1737478729.0,
      "replies": [
        {
          "id": "m8gjklp",
          "author": "alc4pwned",
          "body": "Why do we need phones, laptops, headphones, etc you mean?",
          "score": 2,
          "created_utc": 1737509421.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dfoq0",
      "author": "triplevanos",
      "body": "It’s exactly like cars. The 2020 and 2021 Toyota Camry aren’t different, and if you’re upgrading every year you’re not smart. But eventually you get a new generation that might be worth buying",
      "score": 2,
      "created_utc": 1737477623.0,
      "replies": [
        {
          "id": "m8dr12m",
          "author": "QuestGiver",
          "body": "Tbf they give you way better trade in value for the phone than the car, lol. \n\nSamsung usually has a ridiculously good deal on release of approximately 400-450 for the new phone if you trade in the old. Car dealership would laugh at you.",
          "score": 4,
          "created_utc": 1737480747.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dlnpr",
      "author": "strawbericoklat",
      "body": "I just want phones to be smaller...",
      "score": 4,
      "created_utc": 1737479268.0,
      "replies": [
        {
          "id": "m8h3hmp",
          "author": "None",
          "body": "iPhone 12 Mini user who may have to hang onto it until it dies because nobody will build a phone I want anymore.\n\nedit to add: it works great, there's very little incentive to get a newer phone. AI assistant? Pffffft.",
          "score": 1,
          "created_utc": 1737515953.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8flgsd",
      "author": "timeshifter_",
      "body": "\"We\" aren't the customers. \n\nShareholders are.",
      "score": 3,
      "created_utc": 1737498860.0,
      "replies": []
    },
    {
      "id": "m8gdez1",
      "author": "Fred_Oner",
      "body": "We don't need new tech each year period. It's a waste of limited resources, and it only benefits the companies wasting the world's resources for a 10% of performance, or adding another camera... Stop buying shit before shit runs out.",
      "score": 2,
      "created_utc": 1737507479.0,
      "replies": []
    },
    {
      "id": "m8glls4",
      "author": "DownRUpLYB",
      "body": "It's time for The Verge and the whole tech-blogging industry to look in the mirror and ask: Do we really need this shitty 'story'?",
      "score": 2,
      "created_utc": 1737510067.0,
      "replies": []
    },
    {
      "id": "m8h49cd",
      "author": "SirEDCaLot",
      "body": "Go back to the early 2000s/2010s- mobile devices were FUN!  They didn't all look identical.  Different manufacturers were experimenting with different form factors-- slide out keyboards, pivoting screens, flip open laptop type phones, etc.  It was great.  \n\nThen for years a drought- phones became boring identical carbon copy clones, losing the few distinctive features they previously had (IR transmitters, I/O ports, extra storage, etc).  \n\nSorry guys but *I'm bored.*  There's nothing EXCITING coming out!  And I'm sorry but AI is NOT exciting- the only thing I need to know about AI is how to turn it off.  \n\nBendable screens have given us a *little* innovation- flip-open phones are the first actual innovation we've had in a while.  And I've seen a few cool concept prototypes that probably won't actually get made.  \n\nI'd love to have something like the [Global Link from Earth: Final Conflict](https://www.therpf.com/forums/threads/earth-final-conflict-global-link.268850/)- it was a handheld pod-type device, the side would pop out on an accordion arm and pull a rollable screen behind it.  The screen could be pulled out more or less depending on what functionality was needed.",
      "score": 2,
      "created_utc": 1737516218.0,
      "replies": []
    },
    {
      "id": "m8d7bup",
      "author": "CosmicOwl47",
      "body": "I think the concept of “s” versions painted a more realistic picture of what to expect with the annual release schedule. Some years are just small upgrades with very little new stuff to show off. Maybe they sell fewer phones that way though ¯\\\\\\_(ツ)_/¯",
      "score": 1,
      "created_utc": 1737475267.0,
      "replies": []
    },
    {
      "id": "m8d9onk",
      "author": "Bakedsoda",
      "body": "newsflash you don't",
      "score": 1,
      "created_utc": 1737475943.0,
      "replies": []
    },
    {
      "id": "m8da586",
      "author": "Squery7",
      "body": "Unless you live in EU and get the terrible exynos version most years. The snapdragon alone is enough to make me care this time, although for sure they could at least update the cameras and battery on the base and plus models since those are very stagnant.",
      "score": 1,
      "created_utc": 1737476074.0,
      "replies": []
    },
    {
      "id": "m8damf0",
      "author": "Sundance37",
      "body": "Cell phones are becoming a durable good, until we can find a new use for them. 3D scanning is an interesting candidate, but far too niche.",
      "score": 1,
      "created_utc": 1737476210.0,
      "replies": []
    },
    {
      "id": "m8dcgc6",
      "author": "TheGinger_Ninja0",
      "body": "I have a phone model that's over 4 years old. I haven't seen anything on the newer phones I wish I had, nor had any issues with performance.\n\nI feel like the iterations are kind of a scam",
      "score": 1,
      "created_utc": 1737476722.0,
      "replies": []
    },
    {
      "id": "m8dg2mf",
      "author": "imacmadman22",
      "body": "I’m not going to replace my two year old phone, I am going to keep it for at least another year, maybe two. At best, I will just get a new battery for it. \n\nI am not interested in buying a new phone every year because they don’t change that much from year to year anymore. It’s just not worth spending money on such minimal upgrades every year.",
      "score": 1,
      "created_utc": 1737477729.0,
      "replies": []
    },
    {
      "id": "m8dlh5j",
      "author": "DocPhilMcGraw",
      "body": "I honestly still miss LG making phones.  They weren’t afraid to give us something different in the hopes we would give it a shot.  I wish Samsung would allow some of that creativity.  Still give us the Galaxy series with iterative updates but then also give us some wacky stuff for a couple one-off devices.",
      "score": 1,
      "created_utc": 1737479217.0,
      "replies": []
    },
    {
      "id": "m8dm854",
      "author": "dcheesi",
      "body": "I've been buying their bargain A-series phones for years, and for the last 5-10 years the only reason I've ever felt the need to replace them was due to damage/breakage. \n\nThe only thing I might miss is wireless charging, and that only because devices & vehicles seem to be standardizing on that in last couple of years.",
      "score": 1,
      "created_utc": 1737479425.0,
      "replies": []
    },
    {
      "id": "m8dmpa7",
      "author": "Ace_of_Sevens",
      "body": "I have a Note 10+. Still works great & has an SD card slot.",
      "score": 1,
      "created_utc": 1737479557.0,
      "replies": []
    },
    {
      "id": "m8do3r4",
      "author": "fartman404",
      "body": "Goes against capitalist / mass production and waste production values. Sustainable production in 3-4 year cycles is a not good competitive business practice according to the Samsung",
      "score": 1,
      "created_utc": 1737479946.0,
      "replies": []
    },
    {
      "id": "m8dog56",
      "author": "SandKeeper",
      "body": "This is a dumb article. If people buy it they make it.",
      "score": 1,
      "created_utc": 1737480040.0,
      "replies": []
    },
    {
      "id": "m8donhb",
      "author": "Snipedzoi",
      "body": "People in emulation really like this iteration. More power every year is really nice.",
      "score": 1,
      "created_utc": 1737480096.0,
      "replies": []
    },
    {
      "id": "m8dqglc",
      "author": "Brico16",
      "body": "They don’t need to give me a reason to buy a new phone every in the same way I don’t need to purchase a new car every year. \n\nHowever I wouldn’t want to be in the market for a new phone and Samsung’s flagship phone tech is 3 years old. Same with a car. I’m not paying a new car price for the same car they made 3 years ago. Samsung is just following the car makers business model with minor improvements every year with a major refresh two or three times in a decade. \n\nThe technological improvements of the current style of mobile devices is approaching its ceiling. It’s going to take a major shift in form, function, or new use cases to create the major annual enhancements we got from mobile devices 10 years ago.",
      "score": 1,
      "created_utc": 1737480589.0,
      "replies": []
    },
    {
      "id": "m8drlym",
      "author": "CrundleMonster",
      "body": "Same reason kids buy skins on fortnight. We are all degenerates",
      "score": 1,
      "created_utc": 1737480907.0,
      "replies": []
    },
    {
      "id": "m8drtj1",
      "author": "None",
      "body": "What’s the problem with phone manufactures producing slightly better annual iterations? It’s not required to buy! I get a new phone every 4ish years.",
      "score": 1,
      "created_utc": 1737480964.0,
      "replies": []
    },
    {
      "id": "m8dsk4t",
      "author": "flirtmcdudes",
      "body": "Or you could just like, not buy it?",
      "score": 1,
      "created_utc": 1737481166.0,
      "replies": []
    },
    {
      "id": "m8dw3ug",
      "author": "StuffinYrMuffinR",
      "body": "Its you're own fault if you buy a new phone every year. From my perspective, it's a good thing so that when I get a new phone every 4 to 5 years, I can grab the newest model and not be 3 years out of date from the start. The same logic applies to cars",
      "score": 1,
      "created_utc": 1737482129.0,
      "replies": []
    },
    {
      "id": "m8dzkws",
      "author": "tech240guy",
      "body": "Super Vooc.  This needs to be a standard.",
      "score": 1,
      "created_utc": 1737483075.0,
      "replies": []
    },
    {
      "id": "m8e29zw",
      "author": "Cheeseychunks",
      "body": "Note 20 ultra owner hoping its the last phone i need to buy.",
      "score": 1,
      "created_utc": 1737483809.0,
      "replies": []
    },
    {
      "id": "m8e6iun",
      "author": "ARobertNotABob",
      "body": "*People* in this economy should be asking themselves why they are paying that much money, simply for, in reality, whatever genuine new *hardware*-based feature the new model has ... is it really worth **that** much to have it, over last years model that didn't?   \n\nAnd if it's only a software feature you gain, you'll be downloading an app for it soon enough, so, really, why do you need to buy it at all, never mind for the price?\n\nA fool and their money...",
      "score": 1,
      "created_utc": 1737484959.0,
      "replies": []
    },
    {
      "id": "m8e87ll",
      "author": "rollin340",
      "body": "The article does bring up the other brands, but I personally feel that phone technology has plateaued for a long time. The processing speed on phones are capable of doing what a phone should be able to; any more would be specific for gaming, which not everyone needs.\n\nThe only real improvements we've seen are in the cameras and batteries. It'd also be nice if repairability was improved, and thankfully, all the brands are moving in the right direction there.\n\nBut other than that, what else are phones supposed to innovate on? I feel that every flagship is just a new shiny incremental upgrade on the previous model that is wholly overpriced. A phone a few years ago would still work perfectly fine for most people today; they've become more of a symbol than anything else.\n\nI'd rather they improve on their mid-tier range phone offerings. Reduce the number of models they have to streamline its production to increase the overall quality of that mid-tier, and make that their primary product. Most people don't need the fancy new shiny stuff; they need something that works and is affordable.",
      "score": 1,
      "created_utc": 1737485417.0,
      "replies": []
    },
    {
      "id": "m8e8dy1",
      "author": "pittypitty",
      "body": "Yes, keeps investors and users attention your way plus thanks to software, they can kneecap your 30 core, 128gb ram, 5tb storage, 500mp camera equipped device to 2001 levels :)",
      "score": 1,
      "created_utc": 1737485465.0,
      "replies": []
    },
    {
      "id": "m8e9e8n",
      "author": "FlopsMcDoogle",
      "body": "I used to get a new one every 2 years with the upgrade plans they used to do. Now I've been using the same phone for 5 years with no problems. Why would anyone need a new one every year?",
      "score": 1,
      "created_utc": 1737485734.0,
      "replies": []
    },
    {
      "id": "m8eaa3w",
      "author": "spinosaurs70",
      "body": "Smartphones have had basically the same capabilities for years; the upgrade cycle at this point is only based on operating systems' much slower progress in consuming up the power of a computer.",
      "score": 1,
      "created_utc": 1737485975.0,
      "replies": []
    },
    {
      "id": "m8eczk9",
      "author": "unhealthycopingmecha",
      "body": "i firmly believe that if your current device is working fine, there is truly no need to upgrade. i’ve kept phones until it was physically impossible to do so. by the time i actually do upgrade, my brand new device actually *feels* brand new because of all the new and different features added from previous generations that i “missed out” on",
      "score": 1,
      "created_utc": 1737486718.0,
      "replies": []
    },
    {
      "id": "m8efrp1",
      "author": "rellsell",
      "body": "Just like Apple, the share price is of utmost importance. If you don’t release the “latest and greatest” every year, how are you supposed to keep revenue/share price up? Believe it or not, these companies don’t do what they do for customer satisfaction.",
      "score": 1,
      "created_utc": 1737487479.0,
      "replies": []
    },
    {
      "id": "m8eip76",
      "author": "Ashamed-Fig-4680",
      "body": "Are you saying you’re ready for a tech-based analog type of world? Are we ready for Star Wars yet?",
      "score": 1,
      "created_utc": 1737488273.0,
      "replies": []
    },
    {
      "id": "m8enej5",
      "author": "Ok_Carrot_2029",
      "body": "I’ve been consistently using 3+ year old phones for a long time now. Every upgrade is another refurbished phone that’s a few cycles behind and I don’t notice a thing.",
      "score": 1,
      "created_utc": 1737489549.0,
      "replies": []
    },
    {
      "id": "m8ephax",
      "author": "an-evil-penguin",
      "body": "The answer is simple, consumers don't need yearly updates, but investors do.",
      "score": 1,
      "created_utc": 1737490119.0,
      "replies": []
    },
    {
      "id": "m8eqef6",
      "author": "pinchymcloaf",
      "body": "Nobody is forcing you to buy a new one every year",
      "score": 1,
      "created_utc": 1737490372.0,
      "replies": []
    },
    {
      "id": "m8erra1",
      "author": "jafromnj",
      "body": "They won’t do a thing till people stop buying them",
      "score": 1,
      "created_utc": 1737490748.0,
      "replies": []
    },
    {
      "id": "m8es84x",
      "author": "bawlsacz",
      "body": "Don’t upgrade every year then…",
      "score": 1,
      "created_utc": 1737490878.0,
      "replies": []
    },
    {
      "id": "m8esfex",
      "author": "iamabigtree",
      "body": "There's no reason for companies not to release new phones every year. There's also no need to upgrade every year. But when I do get to wanting a new phone then there's a newly released one ready for me.",
      "score": 1,
      "created_utc": 1737490934.0,
      "replies": []
    },
    {
      "id": "m8etxfy",
      "author": "ryeguymft",
      "body": "no we do not need this",
      "score": 1,
      "created_utc": 1737491344.0,
      "replies": []
    },
    {
      "id": "m8euy5o",
      "author": "kjbaran",
      "body": "Samsung profits off of wants not needs.",
      "score": 1,
      "created_utc": 1737491624.0,
      "replies": []
    },
    {
      "id": "m8eve8q",
      "author": "supernovababoon",
      "body": "What's obnoxious is Apple blocking the new AI software from the older models to sell new hardware. It's SOFTWARE. There's nothing stopping it from working on last year's model.",
      "score": 1,
      "created_utc": 1737491745.0,
      "replies": []
    },
    {
      "id": "m8ew934",
      "author": "MrFIXXX",
      "body": "My Poco X3 pro is almost 4 years old and there is barely any lagging in any day-to-day apps.\n\nOnly drawbacks could be camera improvements, wifi signal capturing is probably better on modern phones, CPUs likely have some better power management, and Bluetooth versions are more recent.\n\nBut neither of those are worth upgrading for.\nI'd really like a new phone to learn how to use and get a better screen too - but it's just not worth spending the money if this current one works.\n\nI bet its the same for Samsung models that had a decent CPU and storage.",
      "score": 1,
      "created_utc": 1737491977.0,
      "replies": []
    },
    {
      "id": "m8ey3pj",
      "author": "Kruxf",
      "body": "We spent hundreds of years fostering greed; here you go.",
      "score": 1,
      "created_utc": 1737492481.0,
      "replies": []
    },
    {
      "id": "m8f1e7i",
      "author": "VagueSomething",
      "body": "I haven't upgraded for 3 years but if I upgrade this year I'd rather get this year's phone instead of last year's. You'd hate for your phone to break and get the last version then barely 6 months later a 2/3 years jump releases.\n\n\n\nShould the new model have some kind of design flaw you'd hit even more customers with the software or hardware problems if we're pushed into periodic updates.\n\n\nLimited releases would likely see price hikes to make up for the sales lulls and as they know more people cannot wait much longer. Unless phones were legally required to be more fixable such as removable batteries and easier to replace screens you're not going to see phones lasting longer. 3 years already makes the hardware struggle regardless of system and manufacturer updates.\n\n\n\nI am not fully against the idea of refining the process but there are a lot of consequences that will come along which may not be immediately obvious at staggering the releases.",
      "score": 1,
      "created_utc": 1737493359.0,
      "replies": []
    },
    {
      "id": "m8f45t4",
      "author": "yarash",
      "body": "I've been watching Supernatural which spans 15 seasons. Watching the phones change is fun. Every few seasons its something new and interesting. Then it hits the iPhone age and everything is a boring rectangle from then on. \n\nThe iPhone killed phone innovation.",
      "score": 1,
      "created_utc": 1737494105.0,
      "replies": [
        {
          "id": "m8hhhz3",
          "author": "None",
          "body": "Once an industrial design reaches maturity, all the variations will converge on a small range of optimal possibilities. It's why all airliners, SUVs, excavators, scissors, mixers and on and on and on all look and are very similar. It just means that the design problem has been more or less solved. The smartphone has been optimized and there likely won't be much new until it is completely rethought/reinvented somehow.",
          "score": 1,
          "created_utc": 1737521168.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8f6isj",
      "author": "dlobnieRnaD",
      "body": "The only reason the answer would ever be “yes” is because of planned obsolescence and pushing out bugs to older devices.",
      "score": 1,
      "created_utc": 1737494744.0,
      "replies": []
    },
    {
      "id": "m8falp5",
      "author": "lodemeup",
      "body": "We never needed it. They do. We just need software support for 5 or so years and easily replaceable screens and batteries. They need us buying new devices every year.",
      "score": 1,
      "created_utc": 1737495841.0,
      "replies": []
    },
    {
      "id": "m8faxmb",
      "author": "BlastMyLoad",
      "body": "Phones reached their final form with the iPhone X. A phone where virtually the entire face is a screen. Since then phones have not evolved at all",
      "score": 1,
      "created_utc": 1737495930.0,
      "replies": []
    },
    {
      "id": "m8fbz4v",
      "author": "jpnewbury",
      "body": "I will never own another Samsung anything ever again.",
      "score": 1,
      "created_utc": 1737496210.0,
      "replies": []
    },
    {
      "id": "m8fc7rp",
      "author": "James-Cooper123",
      "body": "Never had top of the year phones, ive  been at least 3-5 modells behind. I got the iphone 12 (wich i use now) when the iphone 14 was top dog and iphone 15 was just announced, like cars, phones arent worth the overhyped price.",
      "score": 1,
      "created_utc": 1737496275.0,
      "replies": []
    },
    {
      "id": "m8fen1d",
      "author": "_HiWay",
      "body": "Most sane people I know seem to go 3-4 years unless something breaks, myself included.",
      "score": 1,
      "created_utc": 1737496927.0,
      "replies": []
    },
    {
      "id": "m8ffx1r",
      "author": "heckfyre",
      "body": "New phones are needed either because the products are crappy and they degrade quickly, or because of planned obsolescence.",
      "score": 1,
      "created_utc": 1737497281.0,
      "replies": []
    },
    {
      "id": "m8fm93q",
      "author": "smurficus103",
      "body": "Im rocking an S7 and recently my phone provider messaged me that it's ending 2G and it'll affect my call forwarding or something...\n\nShit's not just Samsung's fault but the whole ecosystem, particularly google and os support/ why can't phone providers open up for operating system innovation? It's just captured lol.",
      "score": 1,
      "created_utc": 1737499088.0,
      "replies": []
    },
    {
      "id": "m8fmwzk",
      "author": "Keypop24",
      "body": "They will keep making these phones as long as people keep buying them. Companies like Samsung and Apple could even stop making small technical upgrades each year and just put a bigger number on each phone, and people would still buy them just because 26 is bigger than 25.",
      "score": 1,
      "created_utc": 1737499282.0,
      "replies": []
    },
    {
      "id": "m8fnc7a",
      "author": "Blapanda",
      "body": "Still owning an OnePlus 7 Pro, which is like what? 6 years old? Had a Huawei Mate 8 before that, which is also quite older.\n\nThere is absolutely no reason to upgrade your phone at any time. It is just a waste of money = luxury reason to upgrade.",
      "score": 1,
      "created_utc": 1737499404.0,
      "replies": []
    },
    {
      "id": "m8g3i0i",
      "author": "kernanb",
      "body": "I'm on the S24 right now. The S25 is still lagging behind phones like OnePlus 13 with features like Aqua Touch, 6,000 mAh silicon-carbon-based battery, 100W charging that can charge the phone from 0 to 100% in 36 minutes, and under-display front camera. However, even if the S25 had those features I wouldn't upgrade.",
      "score": 1,
      "created_utc": 1737504410.0,
      "replies": []
    },
    {
      "id": "m8g5qx9",
      "author": "Xerain0x009999",
      "body": "Maybe if they add a second USB C port and an SD Card slot...",
      "score": 1,
      "created_utc": 1737505121.0,
      "replies": []
    },
    {
      "id": "m8g7obf",
      "author": "_pinklemonade_",
      "body": "Bring back the iPhone mini though, damnit.",
      "score": 1,
      "created_utc": 1737505711.0,
      "replies": []
    },
    {
      "id": "m8guuib",
      "author": "WaifuPillow",
      "body": "I don't think company makes a new phone every year, because of people buying them every year, but because there are always people up for an upgrade, those people were sitting on their phone for 5+ years already.\n\nAnd the phone industry as a whole is hyper competitive, if you don't spit out an upgrade of their lineup, you get left behind and become irrelevant to the market.\n\nThis isn't a phone industry problem, car is like that, computer hardware is like that, things that have room for innovation are bound to be like this, you don't see a new lineup of Coca cola every year.",
      "score": 1,
      "created_utc": 1737513072.0,
      "replies": []
    },
    {
      "id": "m8gw66f",
      "author": "godnorazi",
      "body": "I would be OK with phones having a 2 or 3 year life cycle instead of a new iPhone 15, 16, 17, etc every year",
      "score": 1,
      "created_utc": 1737513509.0,
      "replies": []
    },
    {
      "id": "m8gywau",
      "author": "redconvict",
      "body": "We dont but far too many are willing to buy a new phone every year for it to be profitable.",
      "score": 1,
      "created_utc": 1737514406.0,
      "replies": []
    },
    {
      "id": "m8h35no",
      "author": "davidgasparnue",
      "body": "You think?? Are we just now realizing this?",
      "score": 1,
      "created_utc": 1737515840.0,
      "replies": []
    },
    {
      "id": "m8h8d97",
      "author": "MWD_Dave",
      "body": "I'm still rocking an Samsung S10. Until Samsung either \n\na) makes 1TB storage standard on their regular sized phone \n\nor \n\nb) brings back the microSD card\n\nI won't be getting a new phone because it would be a straight up downgrade. (Not just storage - thinner, curved screen, headphone jack.)  S10 was one of the best phones they made. \n\n(For perspective you could buy a 512GB S10 and drop in 1TB of storage for a total of 1.5TB) \n\nThe regular S24 **maxes out** at 256GB.",
      "score": 1,
      "created_utc": 1737517675.0,
      "replies": []
    },
    {
      "id": "m8h9c5n",
      "author": "TomatilloUnlucky3763",
      "body": "Samsung has been in shambles for years. I wouldn’t buy one",
      "score": 1,
      "created_utc": 1737518026.0,
      "replies": []
    },
    {
      "id": "m8hev0n",
      "author": "Oldfolksboogie",
      "body": "Why do you think they engineer them so batteries can't be replaced?",
      "score": 1,
      "created_utc": 1737520118.0,
      "replies": []
    },
    {
      "id": "m8hglpl",
      "author": "DXsocko007",
      "body": "I had a Samsung s6. Got an s10 when mine was crapping out. Had an s10 until I got an iPhone 15pro. My s10 was slowing down a lot and had horrible battery life. The charge port was failing as was the headphone jack.\n\nI literally only need to get a new phone when the old one craps out I plan on keeping this phone for 5-7 years",
      "score": 1,
      "created_utc": 1737520804.0,
      "replies": []
    },
    {
      "id": "m8hgtb6",
      "author": "Far-Egg3571",
      "body": "I still remember the first time my friend dropped her iPhone (6?) From a pretty high spot. It split open and fell into two main pieces. What surprised us was the chips on the main board all said Samsung.",
      "score": 1,
      "created_utc": 1737520887.0,
      "replies": []
    },
    {
      "id": "m8hiszs",
      "author": "MrGeno",
      "body": "You don't but people keep buying them every year regardless.",
      "score": 1,
      "created_utc": 1737521707.0,
      "replies": []
    },
    {
      "id": "m8hkg5t",
      "author": "Deep-Room6932",
      "body": "Their people need money",
      "score": 1,
      "created_utc": 1737522402.0,
      "replies": []
    },
    {
      "id": "m8hmwl1",
      "author": "None",
      "body": "No, they don't. They don't owe you anything.",
      "score": 1,
      "created_utc": 1737523472.0,
      "replies": []
    },
    {
      "id": "m8hp4vl",
      "author": "sarhoshamiral",
      "body": "Why? Phones are made to last 3 years at least especially now with longer software update promises.\n\nThere will be fanboys that always upgrade to latest no matter what, Samsung knows they will upgrade. They don't need to do anything for them.\n\nFor others, they know they replace their phones every 3-5 years so as long as they have some improvement over 3 years, they are good.\n\nI think you have to look in the mirror and ask yourself if you really need a reason to change your phone every year?",
      "score": 1,
      "created_utc": 1737524487.0,
      "replies": []
    },
    {
      "id": "m8hq9e4",
      "author": "cheknauss",
      "body": "If people keep buying them they'll keep selling them.",
      "score": 1,
      "created_utc": 1737525016.0,
      "replies": []
    },
    {
      "id": "m8hqwt3",
      "author": "kalinslo",
      "body": "Capitalism. Line go up. Infinite growth. Fiduciary responsibility. Just a few words explaining why they won't ask, admit, rethink anything.",
      "score": 1,
      "created_utc": 1737525330.0,
      "replies": [
        {
          "id": "m8hteef",
          "author": "Proponentofthedevil",
          "body": "Self control. The whole world isn't you. What about other people looking for a new phone looking to upgrade after 5-6 years. New customers. Just a few words explaining how you're in too deep and need less internet time.",
          "score": 1,
          "created_utc": 1737526567.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8hr2ll",
      "author": "senorsmartpantalones",
      "body": "Went from the S7 to the S20.   I see no reason to go to the S24 or 25..... in fact, I'd lose features like removable Sim and Sd cards",
      "score": 1,
      "created_utc": 1737525408.0,
      "replies": []
    },
    {
      "id": "m8hrrqk",
      "author": "my5cworth",
      "body": "Ive had my same phone for over 5 years now.\n\nI really couldn't care about what new processor or gimmicky feature is out. \n\nPhone is still in perfect condition, but I go through screen protectors like diapers.",
      "score": 1,
      "created_utc": 1737525751.0,
      "replies": []
    },
    {
      "id": "m8hv41v",
      "author": "omac4552",
      "body": "Give me more battery, that's all I ask for in a modern phone",
      "score": 1,
      "created_utc": 1737527447.0,
      "replies": []
    },
    {
      "id": "m8hvrqm",
      "author": "therealsoggi",
      "body": "Wow this is dumb",
      "score": 1,
      "created_utc": 1737527791.0,
      "replies": [
        {
          "id": "m8hx44n",
          "author": "a_Ninja_b0y",
          "body": "Why?",
          "score": 0,
          "created_utc": 1737528496.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8hwemm",
      "author": "Curse3242",
      "body": "They don't. People don't buy a phone every year. The small changes stack up to when you'll probably switch your phone in the next 5-6 years",
      "score": 1,
      "created_utc": 1737528123.0,
      "replies": []
    },
    {
      "id": "m8hzo3r",
      "author": "xenoborg007",
      "body": "People want FOMO and status, Apple could bring out the exact same phone and slap a +1 on it, remove features and Apple cucks would still go out and buy it in droves.\n\nConsumers are the problem, in every single instance because they still go out and buy the product, its why the games industry is a microtransaction always online drm shithole.",
      "score": 1,
      "created_utc": 1737529884.0,
      "replies": []
    },
    {
      "id": "m8i2fbe",
      "author": "ItsLlama",
      "body": "people just need to stop buying a new phone every year if they want true innovation.\n\ni went from s3, to iphone 5 back to s7 then s10 and now rock a s24 and don't see myself upgrading for awhile. 120hz, great camera and 70-80% battery after a day of use is hard to see much noticeable improvement from\n\nyou barely notice any differcence swapping a phone every year no matter if you are android or apple",
      "score": 1,
      "created_utc": 1737531440.0,
      "replies": []
    },
    {
      "id": "m8i3309",
      "author": "unematti",
      "body": "Put back the SD card and I'll consider a new one. If they put back the SD card and the iris scanner... I'm buying 2!",
      "score": 1,
      "created_utc": 1737531820.0,
      "replies": []
    },
    {
      "id": "m8i36lb",
      "author": "joe0185",
      "body": "Guys, it's not like it was a few years ago when you needed a flagship to get by or you would experience insufferable amounts of lag doing basic things or have atrocious smeary cameras. \n\nI know they are still really popular, but buying a flagship honestly just doesn't make sense anymore.\n\nThese days a $250 phone will give you 95% of the functionality of a flagship. I am talking usable octa-core processors, 120Hz OLED screen, 256GB storage, 8GB+ RAM, 5000mAH+ battery. \n\nI actually PREFER the cheaper phones because they have expandable storage, 3.5mm headphone jack, and less overall depreciation. \n\nMy $250 phone with a $99 sdcard has 1.75TB of storage. A year from now, if I want, I can easily sell it for $100, pop out my storage, and upgrade to the newer hardware for $150 (after selling my $100 old phone). \n\nThat's nine years of new phones for the same price as a flagship, and by the time you get to year three or four, your phone's hardware is already better than that flagship you would have originally bought but you have more storage and a brand new battery. \n\nMake your next phone purchase a \"downgrade\" and you'll never go back to buying flagships.",
      "score": 1,
      "created_utc": 1737531878.0,
      "replies": []
    },
    {
      "id": "m8i63pq",
      "author": "None",
      "body": "Why should we be excited about every new phone? What kind of childish pre-christmas attitude is this? These things are tools and should be treaded (and reviewed!) as such. Most tech reviewers get super excited about some new bullshit (AI in smartphones, the new camera button of the iPhons) just to generate hype and sell phones / get video klicks, but after half a year of use they all come back and talk about the important points: improvements that matter for daily use. \n\nWe should hold producers and reviewers to a higher and useful standard instead of demanding hype, that will inevitably disappoint us. This article is stupid \n\nPS: I love being excited about tech. This argument is just stupid.",
      "score": 1,
      "created_utc": 1737533573.0,
      "replies": []
    },
    {
      "id": "m8i656f",
      "author": "Majukun",
      "body": "As long as people keep buyin', they Wil keep makin'.\nThat's as easy as that",
      "score": 1,
      "created_utc": 1737533597.0,
      "replies": []
    },
    {
      "id": "m8i6cm1",
      "author": "vyashole",
      "body": "This is such a stupid take. They are a corporation they will do what they think is good for business. \n\nYou don't have to buy every minor update. If you had an s20 for 5 years, s25 would be a great upgrade. If you have an s24, just don't buy the s25. How do people not get this?",
      "score": 1,
      "created_utc": 1737533721.0,
      "replies": []
    },
    {
      "id": "m8i7ovz",
      "author": "ngc-arb",
      "body": "They all lost me at AI chips.",
      "score": 1,
      "created_utc": 1737534538.0,
      "replies": []
    },
    {
      "id": "m8i7wvj",
      "author": "hotweiss",
      "body": "LOL... What a moving question? So woke... Samsung is business. They will try to make new phones each year so that you can keep on giving them money...",
      "score": 1,
      "created_utc": 1737534675.0,
      "replies": []
    },
    {
      "id": "m8i8b1i",
      "author": "rustpunk666",
      "body": "They're desperate now, I see ads for Samsung and iPhone, \"come on guys it's got ai!  We'll give you fucking four of them!\".\n\nAll I want is better or removable battery, sd card, and headphone jack in a phone but nothing is compatible with Verizon :(",
      "score": 1,
      "created_utc": 1737534917.0,
      "replies": []
    },
    {
      "id": "m8ib7pl",
      "author": "Asgard033",
      "body": "People have never been required to upgrade every generation. It's fine to skip generations. So what if you have an S23 and aren't interested in an S24? Your neighbour or friend who is on an older phone might be interested. We're not all on a synchronized upgrade schedule.",
      "score": 1,
      "created_utc": 1737536716.0,
      "replies": []
    },
    {
      "id": "m8icz4c",
      "author": "IT_techsupport",
      "body": "Ya'll forgetting there is still loads of people upgrading from 4 years +, I sure was happy to upgrade from a s21 to s24u, had they skipped that year I would have no option but to buy a phone with an almost 2 year old chip at that point. Yearly releases are not meant to be bought each year, there is alawys someone on the market for a phone. Its all in the consumer's hands , no one is forcing you to buy a phone each year.",
      "score": 1,
      "created_utc": 1737537821.0,
      "replies": []
    },
    {
      "id": "m8ie50j",
      "author": "rnnd",
      "body": "I don't think they need a reason. If you need a phone, you'd upgrade. If you don't, you shouldn't upgrade. I for once upgrade every 4 or so years.",
      "score": 1,
      "created_utc": 1737538565.0,
      "replies": []
    },
    {
      "id": "m8ihi5w",
      "author": "CumInsideMeDaddyCum",
      "body": "I am not being forced to buy a phone every X years. 🤷",
      "score": 1,
      "created_utc": 1737540636.0,
      "replies": []
    },
    {
      "id": "m8ihreu",
      "author": "dingo596",
      "body": "Did anyone else have the Note 3? I did and I felt like I have had the \"modern\" smartphone since 2013. I only replaced it in 2020 because the software was so old my apps no longer worked. In 2013 it was a large phone with a beautiful oled screen and a nice camera. Since then I have struggled to find a phone that improved on the Note 3 that isn't a gimmick. If anything the only meaningful upgrade had been to USB-C.",
      "score": 1,
      "created_utc": 1737540789.0,
      "replies": []
    },
    {
      "id": "m8iira3",
      "author": "SoftlySpokenPromises",
      "body": "I haven't bought a new phone since 2016.  When Sprint got bought out I got a free OnePlus 9 because my device was carrier locked as part of the contract transfer.\n\nThe only reason I see to get a new phone is if my old one stops working or becomes unreliable.  I'm not about to shell out $1,500-2000 USD for some AI infused scrap to make the bulge in my pocket look more expensive.",
      "score": 1,
      "created_utc": 1737541380.0,
      "replies": []
    },
    {
      "id": "m8ijev7",
      "author": "AbaixoDouroTudoMouro",
      "body": "And people need to find real jobs instead of writing this kind of useless garbage.",
      "score": 1,
      "created_utc": 1737541774.0,
      "replies": []
    },
    {
      "id": "m8ijmo3",
      "author": "jk441",
      "body": "This article is at least 5 years late to the party easily",
      "score": 1,
      "created_utc": 1737541904.0,
      "replies": []
    },
    {
      "id": "m8imrgy",
      "author": "French_O_Matic",
      "body": "I'm still using my 2017 Galaxy S8, because I feel new phones aren't that innovative. At least the S8 was the first to have the \"no button\" front face. These days it's just about \"more photo lenses !\" \"More AI !\", and it's not enough for me to **want** to change phone.",
      "score": 1,
      "created_utc": 1737543718.0,
      "replies": []
    },
    {
      "id": "m8imvti",
      "author": "srtpg2",
      "body": "Why would Samsung ask this?",
      "score": 1,
      "created_utc": 1737543787.0,
      "replies": []
    },
    {
      "id": "m8iu3q5",
      "author": "IIIllllIIIllI",
      "body": "I know people who get a new iPhone every 1-2 years. It’s absurd and some of the most ridiculous spending I’ve seen tbh. But to each their own",
      "score": 1,
      "created_utc": 1737547555.0,
      "replies": []
    },
    {
      "id": "m8iydm7",
      "author": "motorboat_mcgee",
      "body": "Phones are now a mature market, like computers are. There won't be a lot of innovation in that space anymore, just buy a new one when the current one starts feeling slow. It's not that complicated",
      "score": 1,
      "created_utc": 1737549501.0,
      "replies": []
    },
    {
      "id": "m8iytbs",
      "author": "lewjr",
      "body": "I am asking in all honesty. People really do buy new phones every year? Is it a status symbol? Honestly I can't tell one phone from the next if you told me we are on iPhone 2 or iPhone 200 I would have no idea. Same for my Samsung. It's an S something no idea the number lol",
      "score": 1,
      "created_utc": 1737549687.0,
      "replies": []
    },
    {
      "id": "m8j17v5",
      "author": "Wonderful_Common_520",
      "body": "Maybe one with more cameras?",
      "score": 1,
      "created_utc": 1737550665.0,
      "replies": []
    },
    {
      "id": "m8j26y2",
      "author": "firstname_Iastname",
      "body": "You don't need to and shouldn't upgrade every year op",
      "score": 1,
      "created_utc": 1737551049.0,
      "replies": []
    },
    {
      "id": "m8j3kf5",
      "author": "alexzhivil",
      "body": "I'm still using Huawei p30 pro from nearly 6 years ago, it takes amazing photos and has been working smoothly without a single issue so far. The yearly progress between models nowadays almost nonexistent.\n\nI can understand why they are doing it, it gives people a feeling that they need to upgrade because \"oh wow, i am already 4 generations behind\". But it's also a negative thing because they don't focus enough on innovation and polishing their products.",
      "score": 1,
      "created_utc": 1737551580.0,
      "replies": []
    },
    {
      "id": "m8j44v7",
      "author": "4a4a",
      "body": "I usually only upgrade my device(s) when Verizon has promotions for free phones. I have 5 phones on my family account, so it would really add up if I didn’t do it that way. I think I used promotions like that for 4 of our current phones.",
      "score": 1,
      "created_utc": 1737551794.0,
      "replies": []
    },
    {
      "id": "m8j6efo",
      "author": "D_Anger_Dan",
      "body": "Every iPhone user on Reddit: “Samsung, the TV maker, sells phones?”",
      "score": 1,
      "created_utc": 1737552632.0,
      "replies": []
    },
    {
      "id": "m8j8etk",
      "author": "Environmental-Week79",
      "body": "Stop buying! These company know we have become thoughtless consumers",
      "score": 1,
      "created_utc": 1737553356.0,
      "replies": []
    },
    {
      "id": "m8ja7qk",
      "author": "killroystyx",
      "body": "I agreed until the last paragraph when the article argues for bringing back minor version updates to hardware. It undermines everything that preceded it and makes the article feel like propaganda to support the idea of pushing even more useless updates every 6 months.\n\nIf the hardware isn't advancing, and the companies still fail to deliver software updates along with new hardware, then what the hell are they selling us? The promise of shelling out a few hundred bucks every time you feel FOMO?\n\nA real conclusion to this issue would be to call out the \"Steve Jobs\" tech cycle for the massive social, economic, and environmental catastrophe that it is: bad; and then to call for regulation from government, becuase we clearly can't trust these big corporations to make good choices for the well-being of the people, society, and the world.\n\nFor example: a law that makes businesses liable for handling the waste they create. For most things that means a buy-back program tied to a clean recycling system(don't keep shipping chips overseas for poor children to get sick dismantling). If they want to save money after that, they would need to redesign some parts to be recycled, but until then they would need to reduce the amount of old devices being bought back, which means longer life cycles and longer customer support and more easily available repair services.\n\nThis is late-stage capitalism destroying everything that it relies on to survive. What happens when people stop buying phones every year if the buisness is designed around that? Collapse. \n\nGreed is bad capitalsim.",
      "score": 1,
      "created_utc": 1737553985.0,
      "replies": []
    },
    {
      "id": "m8jd9mu",
      "author": "Mickymon",
      "body": "If we keep buying, they'll keep selling",
      "score": 1,
      "created_utc": 1737555025.0,
      "replies": []
    },
    {
      "id": "m8jdjm1",
      "author": "Utter_Rube",
      "body": "I got a refurbished S22 on Black Friday a couple years back, and it'll be my last Samsung unless they quit locking the fuck out of the bootloader for their North American phones.  I'd rather pay a few extra bucks for a phone that can be rooted than save a bit and get a pile of bloatware, AI crap, and forced updates that may or may not brick the phone.",
      "score": 1,
      "created_utc": 1737555118.0,
      "replies": []
    },
    {
      "id": "m8jh2ur",
      "author": "zeffydurham",
      "body": "They ran out of ideas.",
      "score": 1,
      "created_utc": 1737556265.0,
      "replies": []
    },
    {
      "id": "m8jhmv5",
      "author": "AlphaDart1337",
      "body": "How is this news? It's been this way for like 6 years now..",
      "score": 1,
      "created_utc": 1737556443.0,
      "replies": []
    },
    {
      "id": "m8jiy5v",
      "author": "Accomplished-Rest-89",
      "body": "Folding phones are very different indeed",
      "score": 1,
      "created_utc": 1737556858.0,
      "replies": []
    },
    {
      "id": "m8jlkhr",
      "author": "BeepBoopImACambot",
      "body": "The shareholders need it",
      "score": 1,
      "created_utc": 1737557659.0,
      "replies": []
    },
    {
      "id": "m8jo6z6",
      "author": "None",
      "body": "It's the same with the auto industry. Why do we need new models every year?\n\nMost of the time it's just a slight tooling difference that makes the new model different.",
      "score": 1,
      "created_utc": 1737558447.0,
      "replies": []
    },
    {
      "id": "m8kcqn4",
      "author": "hanshotfirst-42",
      "body": "As long as people keep phones for years at a time, there will always be a reason for someone to upgrade.",
      "score": 1,
      "created_utc": 1737565301.0,
      "replies": []
    },
    {
      "id": "m8l04d4",
      "author": "jmo1",
      "body": "I went from a Galaxy S6 (2015) to an S20 in 2020. Then in 2022 I got an iPhone 13 because everyone in my family and friend group had iPhones and I was sick of my pictures looking like shit and it falling on me to find workarounds. Then a couple months ago I got the 16 Pro Max. \n\nTwo things I took away from all of this, four phones in 10 years, I don’t think that’s too bad. I think every phone was able to be traded in as well, so credit toward the next one was decent to good. And, without anything crazy happening, this one will hopefully last me quite awhile. I don’t see anything coming to truly innovate the mobile phone any time soon. This phone is fast, good camera, decent battery, and that’s really all I need at this point.",
      "score": 1,
      "created_utc": 1737571566.0,
      "replies": []
    },
    {
      "id": "m8m25zf",
      "author": "rutgersftw",
      "body": "Hi, it's me, I'm the problem. Every year, I get excited for the newest releases.\n\nI've spent time with the S22 Ultra, S23 Ultra, and have used the S24 Ultra for the last 8 months or so. It might sound crazy to say this, but each was actually a pretty big upgrade from the last.\n\nI had the lowest storage variant of the S22 Ultra which had less RAM than the others. It could get bogged down in app switching and DEX. Switching to the S23 Ultra meant getting better cameras, battery, and performance. It actually felt kinda worth it. \n\nCrazy as it sounds, the S24 Ultra has been my favorite upgrade ever. The new Gorilla Glass with built in anti-glare and flat edges is such a huge quality of life feature. The battery is truly \"I never think about battery life\" good. The software has been rock solid and has gotten better. It was worth it.\n\nThe S25 Ultra doesn't look worth it. The camera setup seems like a downgrade (I like the 10X lens). The S-Pen losing Bluetooth is super obnoxious if you've ever used it as a camera shutter or anything else. It looks like it may be a bit chunkier, even if rounded edges are better. This one probably doesn't need to exist.",
      "score": 1,
      "created_utc": 1737581732.0,
      "replies": []
    },
    {
      "id": "m8mbapo",
      "author": "ultratorrent",
      "body": "They want to sell shit and people keep buying it. 🤷‍♀️",
      "score": 1,
      "created_utc": 1737584268.0,
      "replies": []
    },
    {
      "id": "m8mhwxw",
      "author": "CSWorldChamp",
      "body": "I buy a new smartphone phone when the old one is no longer compatible. Ends up being about every 7-8 years. Then I buy the oldest, cheapest  “new” model on the market for $300, and I’m *perfectly* satisfied.",
      "score": 1,
      "created_utc": 1737586274.0,
      "replies": []
    },
    {
      "id": "m8msgjk",
      "author": "Defiant_Office",
      "body": "Honestly the sweet spot to upgrade is every 4 years. I upgraded mine from s20fe to OnePlus 12 and the upgrade is very noticeable and worth it. I don't understand why people need the latest and greatest.\n\nAlso I'm ditching Samsung until they improve the battery life and charging speed. The fact that I can charge from an almost dead battery to 100 in 26 minutes is insane. (I mostly just charge it for 10-15 minutes and I'm set for the day)\n\nAs long as I can play the most demanding games like Genshin with max graphics and 60fps and be able to have apps still in the ram without the app needing to be refreshed I won't be upgrading anytime soon",
      "score": 1,
      "created_utc": 1737589614.0,
      "replies": []
    },
    {
      "id": "m8muzf8",
      "author": "frenix5",
      "body": "I would buy a new phone if they improved their speech to text",
      "score": 1,
      "created_utc": 1737590404.0,
      "replies": []
    },
    {
      "id": "m8n5wck",
      "author": "ohiocodernumerouno",
      "body": "How are you going to use your Samsung TV without a phone to make a Samsung account?",
      "score": 1,
      "created_utc": 1737593842.0,
      "replies": []
    },
    {
      "id": "m8nwk77",
      "author": "Arquill",
      "body": "Does anybody actually buy a new phone every year? I suspect that's a very very small number of people. I have a pretty affluent group of friends and I don't see anybody upgrading every year. Oftentimes I even see people with large social media presences don't have the latest phone. Who is this imaginary person upgrading every year?",
      "score": 1,
      "created_utc": 1737602646.0,
      "replies": []
    },
    {
      "id": "m8oj4an",
      "author": "Makeitquick666",
      "body": "No, the answer has been \"no\" for a long time.",
      "score": 1,
      "created_utc": 1737611895.0,
      "replies": []
    },
    {
      "id": "m8owe9t",
      "author": "knyak06",
      "body": "People really want competent reliable phone. Samsung is delivering it. Why do you want to buy phone every year? That's not normal.",
      "score": 1,
      "created_utc": 1737619139.0,
      "replies": []
    },
    {
      "id": "m8oz065",
      "author": "slim121212",
      "body": "I think 10 years ago we all looked at people who changed phone every 4 years as weirdos, now i think it's becoming the norm, i'm on 13 Pro Max, and i have almost no desire at all to have iphone 16 models, i literally don't see the difference, yes if mine breaks i would get a 16 pro max and then i would keep it until it breaks.",
      "score": 1,
      "created_utc": 1737620729.0,
      "replies": [
        {
          "id": "m99f8rt",
          "author": "None",
          "body": "Keep it until the software updates stop, that’s what I do. The hardware is fine these days even at 3 years old, it’s the security features for me.",
          "score": 2,
          "created_utc": 1737897777.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8p97i3",
      "author": "THBLD",
      "body": "I have the S22 ultra was thinking of upgrading, but then I just heard that they got rid of the Bluetooth out the stylus which has a bunch of gesture features that I use quite often. Huge mistake there.\n\nOther than that I think the phone is generally pretty good, although the battery could use a bit of a buff.",
      "score": 1,
      "created_utc": 1737627219.0,
      "replies": []
    },
    {
      "id": "m8po33h",
      "author": "Balbuto",
      "body": "No we don’t! I’ve had three different iPhones in my life but since the 12 I feel like it’s has everything I need. There’s nothing that could make me buy a newer model for the price they are asking. Lower the price to 200$ and we can talk",
      "score": 1,
      "created_utc": 1737635213.0,
      "replies": [
        {
          "id": "m99f3a9",
          "author": "None",
          "body": "The only time I buy a new iPhone now is when I’m a year from EOL for the software, I’m a big believer in security and not getting security updates is a big deal for me, that does mean they last around 5-6 years before needing replacement",
          "score": 1,
          "created_utc": 1737897713.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8qmps5",
      "author": "geekwithout",
      "body": "IT's the result of a saturating market with phones that are future proof for several years. It's like PC's that have way more performance than what they need for what they're used for. YEars ago every PC was way underpowered and every new model/new cpu would sell rapidly. Not anymore.\n\nThat's why we now see gimmicks like AI on phones come out. I got a brandnew 1+ 13 but the 12 was perfectly fine and the difference is definetely not very big. I did it because of the great trade in and free gift (a watch worth 300). If it wasn't for that I wouldn't have bought it.",
      "score": 1,
      "created_utc": 1737647065.0,
      "replies": []
    },
    {
      "id": "m8qvw0o",
      "author": "GamerRadar",
      "body": "If they don’t release it then everyone freaks out. I’ve called this for years with apples “S” lineup. It’s not needed anymore.\n\nIt’s like cars. You have a MODEL YEAR, a 2019 compass is the same as a 2020. There’s just a few tweaks here and there… electronics are going to reach that status soon and people need to be okay with it",
      "score": 1,
      "created_utc": 1737649660.0,
      "replies": []
    },
    {
      "id": "m8r4rr4",
      "author": "c_immortal8663",
      "body": "I think Samsung should release a tri-fold phone. Huawei released a tri-fold phone called MateXT in September 2024",
      "score": 1,
      "created_utc": 1737652083.0,
      "replies": []
    },
    {
      "id": "m8r782v",
      "author": "ThePr0vider",
      "body": "samsung doesn't tell you to buy a new phone, users do because \"new gimmic\". They'd love for you to consoom because money. but they're not actively telling you to buy new every year",
      "score": 1,
      "created_utc": 1737652766.0,
      "replies": []
    },
    {
      "id": "m8s7ay1",
      "author": "jeedaiaaron",
      "body": "Disagree. Maybe true of Apple",
      "score": 1,
      "created_utc": 1737662586.0,
      "replies": []
    },
    {
      "id": "m8wizyr",
      "author": "slikk50",
      "body": "Lmao we never needed it. We don't need most of the stuff we have. We just need shelter, a job and food. Stop buying it.",
      "score": 1,
      "created_utc": 1737723746.0,
      "replies": []
    },
    {
      "id": "m9b9xmo",
      "author": "None",
      "body": "Their removal of the external microsd slot just broke my heart.",
      "score": 1,
      "created_utc": 1737918281.0,
      "replies": []
    },
    {
      "id": "m8d6yon",
      "author": "TheOGDoomer",
      "body": "Nah, I’m good with not destroying the earth with hyper consumerism and excess e waste.",
      "score": 1,
      "created_utc": 1737475162.0,
      "replies": []
    },
    {
      "id": "m8dc0dt",
      "author": "bestjakeisbest",
      "body": "I have a Samsung s9+ I feel very little need to upgrade, these recent phones do not really make me want to buy.  \n\nBefore this phone I had a Samsung s4 so I dont really upgrade every generation but when my phone becomes unusable.",
      "score": 1,
      "created_utc": 1737476598.0,
      "replies": [
        {
          "id": "m8dl801",
          "author": "50bucksback",
          "body": "Have you had to replace anything on it? I have an S9+ that ai love, but even on medium power saver the battery isn't great. The charger port also won't hold cables in anymore even after I cleaned it out.\n\nI was on the S5 before that and had two batteries since I could swap em out.",
          "score": 2,
          "created_utc": 1737479147.0,
          "replies": [
            {
              "id": "m8doqtx",
              "author": "bestjakeisbest",
              "body": "My s9 had that issue with the charging cable, I found getting a cable with a 90 degree bend was best also the USB c spec is kind-of weird with tolerances, some of my cables are held pretty well, and others do not.  \n\nI also have not had to replace anything on it but battery life while using it is kind of bad nowadays, but it can sit on my desk and not need a charge for a few days if I'm not using it or only using it for phone calls.",
              "score": -2,
              "created_utc": 1737480121.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8dc7wy",
      "author": "diuturnal",
      "body": "You need to give Samsung a reason to not keep making little modifications every single year. And it's not even mostly Samsung. You can blame Apple for pushing this trend of needing to upgrade every year.",
      "score": 1,
      "created_utc": 1737476657.0,
      "replies": []
    },
    {
      "id": "m8dd7hg",
      "author": "ebbiibbe",
      "body": "I get a new phone yearly because I want a fresh battery and antenna. The features are nice to have.  \n\nIf batteries were replaceable, I might keep my phones longer.\n\nAlso, Samsung practically pays you to upgrade. I upgrade yearly for less than the cost of Brunch.\n\nTech is unwilling to admit they are at a standstill until some new chips, batteries, or something (not AI) are invented.  They are maxed out on current tech.",
      "score": 1,
      "created_utc": 1737476932.0,
      "replies": []
    },
    {
      "id": "m8d8r9c",
      "author": "Mclarenrob2",
      "body": "We haven't needed new models of phones for at least 5 years.",
      "score": 1,
      "created_utc": 1737475675.0,
      "replies": []
    },
    {
      "id": "m8dbxed",
      "author": "strangerzero",
      "body": "I see absolutely no reason to upgrade from my iPhone 13 Pro Max, I plan on using it for another 4 or 5 years.",
      "score": 1,
      "created_utc": 1737476575.0,
      "replies": []
    },
    {
      "id": "m8dca3f",
      "author": "snds117",
      "body": "Do we need them? No. But shareholders want nothing but growth.",
      "score": 1,
      "created_utc": 1737476674.0,
      "replies": []
    },
    {
      "id": "m8dn53k",
      "author": "ECHLN",
      "body": "Everyone is on different update/upgrade cycles. There will also be a need for a phone every year. If you are the person that upgrades every year, that’s your own problem",
      "score": 1,
      "created_utc": 1737479679.0,
      "replies": []
    },
    {
      "id": "m8fpok5",
      "author": "IamAFlaw",
      "body": "I think this post is silly. People don't upgrade every year. There is nothing wrong with incremental changes. I buy a phone once every 5 years. By that time if the changes are significant enough for me to want to upgrade or if my phone is damaged enough to get sick of it I'll upgrade.\n\nNo one is forcing anyone to upgrade. Phones advance fast enough what more do you want? You want a radical changes every single year somehow and you think people can pay for that?\n\nSmall changes and your not happy either...\n\nHold onto your phone for at least 5 years. Take care of it and in 5 years check out some phones and see if it justifies the change for you.",
      "score": 1,
      "created_utc": 1737500097.0,
      "replies": []
    },
    {
      "id": "m8g0z4h",
      "author": "thatdudedylan",
      "body": "Honestly, in terms of actual tangible advancements, I feel like every 2 years is a reasonable timeframe to make those advancements. \n\nI'll still hold off and only upgrade every 5, I'm just saying 1 year is not enough time to make actual tangible improvements, 2 probably is.",
      "score": 1,
      "created_utc": 1737503596.0,
      "replies": []
    },
    {
      "id": "m8gejyd",
      "author": "Status_Medicine_5841",
      "body": "I feel apple is better example. Regardless... don't want/need it don't buy it. I replace my phone as needed due to damage.",
      "score": 1,
      "created_utc": 1737507837.0,
      "replies": []
    },
    {
      "id": "m8dap0o",
      "author": "acceptable_sir_",
      "body": "No. It's complete waste. Of your money and of the planet.",
      "score": 0,
      "created_utc": 1737476231.0,
      "replies": []
    },
    {
      "id": "m8dvlwg",
      "author": "knucklehead_89",
      "body": "Why shouldn’t they release a new model every year that’s a minor improvement from the people? What I don’t get is the people who think they need a new phone every year. You can easily go 3-5 years and see no difference in performance.",
      "score": 0,
      "created_utc": 1737481995.0,
      "replies": []
    },
    {
      "id": "m8desk9",
      "author": "Jamie00003",
      "body": "I’d be more than happy for phones to go to a 2-3 year cycle. I upgrade my phones when I feel like it. Because my iPhones tend to last forever, and tech doesn’t move that quickly.\n\nAnother reason to slow down cycles is software updates. Software quality gets worse and worse because they want to push a million features into a big release, and rush to get it out the door in time for new phones to come out, at least with apple",
      "score": 0,
      "created_utc": 1737477375.0,
      "replies": []
    },
    {
      "id": "m8fc5bg",
      "author": "None",
      "body": "New models every year a form of planned obsolescence. The performance and camera improvements are negligible, and even then, would not warrant an upgrade for at least 5 years.\n\nRunning out of battery quickly? Get the battery replaced, save yourself 2 grand.",
      "score": 0,
      "created_utc": 1737496257.0,
      "replies": []
    },
    {
      "id": "m8hggc8",
      "author": "Thecrazier",
      "body": "Do you really think the world revolves around you? Maybe you get a phone every 3-4 years and when you get a new phone, someone asks, \"why do you need to care about this new phone, it's the same as last years model\".... \n\nFor some people, this is their new phone after 4 years of having a phone.",
      "score": 0,
      "created_utc": 1737520744.0,
      "replies": []
    },
    {
      "id": "m8d7jhe",
      "author": "vinse81",
      "body": "But.. but more AI",
      "score": -5,
      "created_utc": 1737475327.0,
      "replies": []
    }
  ]
}