{
  "post": {
    "title": "Brother denies using firmware updates to brick printers with third-party ink",
    "author": "moeka_8962",
    "id": "1j4kb6q",
    "score": 2691,
    "created_utc": 1741225710.0,
    "selftext": "",
    "num_comments": 299,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1j4kb6q/brother_denies_using_firmware_updates_to_brick/"
  },
  "comments": [
    {
      "id": "mg9bxxv",
      "author": "Mosox42",
      "body": "You were the chosen one! It was said that you would destroy the Sith, not join them! Bring balance to the Force, not leave it in darkness!",
      "score": 1497,
      "created_utc": 1741226635.0,
      "replies": [
        {
          "id": "mgak1z0",
          "author": "kyredemain",
          "body": "You were like a Brother to me! I loved you!",
          "score": 367,
          "created_utc": 1741245277.0,
          "replies": [
            {
              "id": "mgap1rd",
              "author": "aphaits",
              "body": "Future printer models only available in vader black",
              "score": 87,
              "created_utc": 1741248182.0,
              "replies": []
            },
            {
              "id": "mgbcjrf",
              "author": "Jamal_Khashoggi",
              "body": "You butchered the quote. It’s “You were my brother, Anakin! I loved you!”",
              "score": 25,
              "created_utc": 1741262092.0,
              "replies": [
                {
                  "id": "mgc8g64",
                  "author": "kyredemain",
                  "body": "I am altering the quote. Pray I don't alter it further.",
                  "score": 77,
                  "created_utc": 1741273762.0,
                  "replies": [
                    {
                      "id": "mgnb9tg",
                      "author": "Sonjazrin",
                      "body": "Oh, that was good",
                      "score": 6,
                      "created_utc": 1741416403.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mgbd31b",
                  "author": "Bigwhtdckn8",
                  "body": "You're still talking about printers, right?",
                  "score": 12,
                  "created_utc": 1741262348.0,
                  "replies": [
                    {
                      "id": "mgfdubt",
                      "author": "Jamal_Khashoggi",
                      "body": "What the hell’s a printer?",
                      "score": 4,
                      "created_utc": 1741307148.0,
                      "replies": [
                        {
                          "id": "mgk7cpk",
                          "author": "LifeWulf",
                          "body": "A spawn of Satan. Occasionally seen in offices eating paper.",
                          "score": 2,
                          "created_utc": 1741375215.0,
                          "replies": [
                            {
                              "id": "mgl37r6",
                              "author": "Jamal_Khashoggi",
                              "body": "“Rear door jammed. Please remove page and close door.”\n\nThere’s no page in there.\n\n“Rear door jammed. Please remove page and close door.”\n\nNo, there’s nothing—\n\n“Rear door jammed. Please remove page and close door, fuckface.”\n\nREEEEEEEEEEEEEEEE",
                              "score": 3,
                              "created_utc": 1741385261.0,
                              "replies": [
                                {
                                  "id": "mgnf9ja",
                                  "author": "ZeeroMX",
                                  "body": "Sometimes, there's not a rear door.",
                                  "score": 2,
                                  "created_utc": 1741418711.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mh0dazy",
                          "author": "gromette",
                          "body": "An archaic physical stationary format device that reduced middle schoolers to tears by refusing to \"print\" anything but jibberish. Firmware like a fickle cat, it would defy users at the most inopportune moment. Especially, if not certainly, at the end of an 8 page essay 2AM the night before due.",
                          "score": 1,
                          "created_utc": 1741608785.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mgbrcai",
          "author": "ninsurv",
          "body": "![gif](giphy|tLRifcvQNJIic)",
          "score": 29,
          "created_utc": 1741268188.0,
          "replies": []
        },
        {
          "id": "mgbmi1b",
          "author": "brokenpinata",
          "body": "It ran out of ink, darkness wasn't even an option.",
          "score": 17,
          "created_utc": 1741266389.0,
          "replies": []
        },
        {
          "id": "mgapncc",
          "author": "xxlordxx686",
          "body": "Brother: 'I hate you!'",
          "score": 8,
          "created_utc": 1741248545.0,
          "replies": []
        },
        {
          "id": "mgbs98x",
          "author": "-Badger3-",
          "body": "Brother’s inkjet printers were always just as shitty as the others.",
          "score": 7,
          "created_utc": 1741268503.0,
          "replies": [
            {
              "id": "mgc0lwl",
              "author": "TheAspiringFarmer",
              "body": "Yep. It's just they were cheap...and had fairly cheap generic inks. That you could actually use.",
              "score": 6,
              "created_utc": 1741271328.0,
              "replies": []
            },
            {
              "id": "mgcml66",
              "author": "SpartanLeonidus",
              "body": "It was the decent drivers that just did what you wanted unlike HP drivers that drove a lot of Brother printer good comments.",
              "score": 6,
              "created_utc": 1741277848.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mgmvtbr",
          "author": "yumtoastytoast",
          "body": "I wonder why Brother isn't comming out with their analysis why the Rossmann's video is a clickbait shit in which the \"evidence\" is being solely based on a random reddit post from 3 years ago. All Brothers I've seen still work with 3rd party inks and I assume those people who complained used a crappy cartridge with a sketchy chip that had legit compatibility issues. People are being baited. People have always been blaming big corporations and unless Brother do something else they'll have to end their ethical and reasonable print business.",
          "score": 1,
          "created_utc": 1741408598.0,
          "replies": []
        },
        {
          "id": "mgn8f38",
          "author": "Bea-Billionaire",
          "body": "Literally came here to write this (first sentence). Wild thdt Brother did this.",
          "score": 1,
          "created_utc": 1741414804.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg9b64f",
      "author": "adamdoesmusic",
      "body": "Come on. Brother, you’re supposed to be one of the good printer companies. I hope you’re telling the truth, don’t do this crap!",
      "score": 944,
      "created_utc": 1741226366.0,
      "replies": [
        {
          "id": "mg9byys",
          "author": "chrisdh79",
          "body": "I blocked my brother printer from touching the internet just to be safe. Hope they can redeem themselves from this news.",
          "score": 349,
          "created_utc": 1741226645.0,
          "replies": [
            {
              "id": "mgbj9j1",
              "author": "venrod",
              "body": "I work in cyber in this industry. Brother shouldn’t be on your network generally :)\n\nFor a decade, they have a problem with their emulator where you can dump the entire active memory into clear text using PRET. You will see all the secret keys in use. \n\nThis can be done to a secured device without any authentication. Google PRET (printer remote exploitation toolkit). Most other OEMs have patched out the PRET exploits, but brother still hasn’t.",
              "score": 109,
              "created_utc": 1741265088.0,
              "replies": [
                {
                  "id": "mgc0po7",
                  "author": "TheAspiringFarmer",
                  "body": "All printers are exploit gateways...they should be locked down as tight as possible.",
                  "score": 37,
                  "created_utc": 1741271362.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mgarwxp",
              "author": "batatatchugen",
              "body": "At this point I don't believe a single excuse any company makes.\n\nTo me it's just then being assholes for profit and only backing down when shit explodes in their faces, not because the executives actually had a revelation that that shit is anti consumer behavior and that's not acceptable and shouldn't be done and will do better in the future.",
              "score": 16,
              "created_utc": 1741249943.0,
              "replies": [
                {
                  "id": "mgc3j16",
                  "author": "sapphicsandwich",
                  "body": "I'm just surprised they didn't blame Covid for it somehow. That's the Great Excuse I *still* occasionally hear from companies, usually while in hold as it explains \"why\" their hold times will be long.",
                  "score": 7,
                  "created_utc": 1741272265.0,
                  "replies": []
                },
                {
                  "id": "mglazkn",
                  "author": "TheProvocator",
                  "body": "I mean, they're doing it for a reason -- it works. Even when they're caught red-handed, any punishment is usually so insignificant that they've got their money's worth either way.\n\nHonest companies that genuinely want their products to last as long as possible are a thing of the past. Or at least it feels like it.\n\nIf Brother has nothing to hide, then by all means let an independent investigator look at the source code for these machines. If there's no nefarious code in there, shouldn't be an issue, right?",
                  "score": 1,
                  "created_utc": 1741387715.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mg9hv5q",
              "author": "cjcs",
              "body": "It seems more like the news wasn’t accurate, no redemption necessary",
              "score": 93,
              "created_utc": 1741228690.0,
              "replies": [
                {
                  "id": "mgb4ain",
                  "author": "None",
                  "body": "It is accurate, I have a brother printer and third party inks will not work in the printer. Brother has also now resorted to blocking black and white/grayscale printing if the color cartridges are empty (even if you have a full black ink cartridge).\n\n\n\nEdit: here is a reply by Brother's CSR.\n\n\n> I understand that you are getting a Replace Ink error. Thanks for letting me know. I apologize for the inconvenience, but I’ll try my best to further assist you so we can get the machine back up and running and improve your day.\nSadly, since the error message is Replace Ink, you should replace the missing color cartridge. You can't manually place your machine into B&W only mode.\n The machine will use a small amount of ink from each cartridge during regular cleanings to maintain optimal print quality. Your printer is designed to stop ALL printing operations when any of the ink cartridges have reached their end-of-life. This is to ensure the life of the printhead and to maintain premium print quality. Some ink from all the ink cartridges is used in periodic cleaning cycles. This helps to prevent issues such as printhead clogs and poor print quality. There is no way to bypass this feature.\nI apologize for the inconvenience this has caused.\n\n\nSo there's no solution or bypass. In the past I was able to select both in the brother iprint software to print only in black and white or press a button on the printer to bypass the warning that the color ink was out.",
                  "score": 87,
                  "created_utc": 1741257615.0,
                  "replies": [
                    {
                      "id": "mgbhzvx",
                      "author": "Niaz89",
                      "body": "Yeah. After recent FW update, my Brother printer selected one cartridge as incompatible. Even tho it was happily printing with it for months.\n\nWhat a shitty behavior.",
                      "score": 70,
                      "created_utc": 1741264557.0,
                      "replies": [
                        {
                          "id": "mgbivuu",
                          "author": "mistahelias",
                          "body": "Bought my girl this brand of printer so she can use 3rd party inks for special prints and such. Any way to revert an update?",
                          "score": 13,
                          "created_utc": 1741264930.0,
                          "replies": []
                        },
                        {
                          "id": "mgboqkw",
                          "author": "Party-Interview7464",
                          "body": "Why in the world would you update your printer or even hook it up?",
                          "score": 2,
                          "created_utc": 1741267244.0,
                          "replies": [
                            {
                              "id": "mgbq6yt",
                              "author": "AreEUHappyNow",
                              "body": "Networked printing is great if you’ve got multiple devices or people wanting to print, or if you want to shove your printer in a cupboard somewhere out of sight. You should definitely disable updates though, and if technically inclined, prevent it from accessing the internet.",
                              "score": 31,
                              "created_utc": 1741267775.0,
                              "replies": [
                                {
                                  "id": "mgcjs92",
                                  "author": "Dumrauf28",
                                  "body": "Just plug the printer into your router directly.",
                                  "score": 0,
                                  "created_utc": 1741277035.0,
                                  "replies": [
                                    {
                                      "id": "mgdfdxg",
                                      "author": "marvin_sirius",
                                      "body": "You mean usb into the router and use a print server on the router?",
                                      "score": 2,
                                      "created_utc": 1741285978.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mgf4eke",
                                      "author": "AreEUHappyNow",
                                      "body": "That's networked printing?",
                                      "score": 2,
                                      "created_utc": 1741303773.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mgddvfj",
                                      "author": "bungojot",
                                      "body": "Two of us share a printer at work. Instead of networking it, which involves dealing with IT and all their problems, we just quietly bought a usb cord with a toggle on it. \n\nOne end goes into the printer, two other ends go into my computer and coworker's. If I need to use it I flip the toggle for my computer, and vice versa. Works like a charm.\n\nWhat IT doesn't know won't hurt them.",
                                      "score": 1,
                                      "created_utc": 1741285549.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mgb8flh",
                      "author": "cmaldrich",
                      "body": "I have found this to be the base as well. Infuriating.",
                      "score": 8,
                      "created_utc": 1741259980.0,
                      "replies": []
                    },
                    {
                      "id": "mgddevl",
                      "author": "bungojot",
                      "body": "My brother printer at work keeps trying to do this. So far going into printer settings and choosing \"print as black and white\" is working, but gods help you if you forget.",
                      "score": 3,
                      "created_utc": 1741285420.0,
                      "replies": []
                    },
                    {
                      "id": "mgcl4to",
                      "author": "Kiseido",
                      "body": "The blocking when color ink is out, might actually have something to do with complying with USA federal law.\n\n Printers are mandated to apply tiny watermarks (usually in yellow) all over the paper, so that any printed page can be inspected and determined what serial number the printer it came from had. That way law enforcement can then track down who sold that printer to whom, and find the owner, if need be.",
                      "score": 6,
                      "created_utc": 1741277422.0,
                      "replies": [
                        {
                          "id": "mge60cu",
                          "author": "harkuponthegay",
                          "body": "I read somewhere that this is only for laser printers, but it wouldn’t surprise me if they had extended it to inkjet too and just didn’t tell anybody.",
                          "score": 3,
                          "created_utc": 1741293451.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mgbc409",
                      "author": "Takemyfishplease",
                      "body": "You can out a lil piece of scotch tape over the empty cart sensor thing and it will usually read it as full.",
                      "score": 1,
                      "created_utc": 1741261882.0,
                      "replies": [
                        {
                          "id": "mgbtjtf",
                          "author": "peeaches",
                          "body": "yeah but is there something else the printer checks for compatibility? if so, not sure tape would work for that",
                          "score": 1,
                          "created_utc": 1741268949.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mgbleba",
                      "author": "Crimbilion",
                      "body": "I just installed a third-party drum in my printer (model: DCP-L2540DW) yesterday morning and I've not had any issues.",
                      "score": 1,
                      "created_utc": 1741265951.0,
                      "replies": [
                        {
                          "id": "mgcix6n",
                          "author": "ZenApollo",
                          "body": "I think laser does not have the same issue as inkjet",
                          "score": 3,
                          "created_utc": 1741276788.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mgoxto4",
                      "author": "RenegadeUK",
                      "body": "My Brother printer tells me that i'm using non genuine toner inks. The ink quality appears to be excellent though.",
                      "score": 1,
                      "created_utc": 1741446475.0,
                      "replies": []
                    },
                    {
                      "id": "mgb8bb3",
                      "author": "Pay08",
                      "body": "Are you sure you're just not out of yellow?",
                      "score": 1,
                      "created_utc": 1741259915.0,
                      "replies": [
                        {
                          "id": "mgb8oh3",
                          "author": "None",
                          "body": "This is what Brother's CSR said:\n\nBasically, your Brother machine is designed to stop ALL printing operations when any of the ink cartridges are empty. This is to ensure the life of the print head and maintain premium print quality. If the unit were to continue printing, print jobs and cleaning cycles would suck air from the empty cartridge and damage the print head.",
                          "score": 6,
                          "created_utc": 1741260114.0,
                          "replies": [
                            {
                              "id": "mgbcfxd",
                              "author": "double-you",
                              "body": "If the printer knows it is out of ink, why is it sucking air from those cartridges? Such a BS answer they've given.",
                              "score": 14,
                              "created_utc": 1741262042.0,
                              "replies": [
                                {
                                  "id": "mgbirql",
                                  "author": "Darkchamber292",
                                  "body": "You act like their is some mechanism in place for it to not try using a certain print cartridge but I bet there isn't. I believe they are telling the truth here.",
                                  "score": -8,
                                  "created_utc": 1741264882.0,
                                  "replies": [
                                    {
                                      "id": "mgbmf28",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 5,
                                      "created_utc": 1741266357.0,
                                      "replies": [
                                        {
                                          "id": "mgbr4yc",
                                          "author": "DonArgueWithMe",
                                          "body": "The logic isn't logic-ing. A printer needs precise control of the output of each head and ink type, it should have no problem turning off each color type.",
                                          "score": 3,
                                          "created_utc": 1741268115.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mgbj9uc",
                                      "author": "zap_p25",
                                      "body": "This is actually something they state with the Ecotank and why you should refill when the low level alerts go off because running too low could result in damage to the print head if air is sucked through.",
                                      "score": 4,
                                      "created_utc": 1741265092.0,
                                      "replies": [
                                        {
                                          "id": "mgbmocn",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 6,
                                          "created_utc": 1741266458.0,
                                          "replies": [
                                            {
                                              "id": "mgbndxq",
                                              "author": "zap_p25",
                                              "body": "Are you accounting for the fact the print heads use heat? Depending on how the ink is routed in the heads, there could be some heat being sinked via the ink.",
                                              "score": -4,
                                              "created_utc": 1741266733.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mgdd17e",
                                          "author": "Darkchamber292",
                                          "body": "Right so I was correct and you clarified my suspicion and yet I get downvoted. Makes sense",
                                          "score": 1,
                                          "created_utc": 1741285314.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mgbnuoh",
                                      "author": "Zerothekitty",
                                      "body": "How else does it control what colors come out of it? It must have some way to stop and control it. If it didn't when i would print something in black, all the other colors would come out with it. Critical thinking skills pal, gotta develop them.",
                                      "score": 1,
                                      "created_utc": 1741266911.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mgbberr",
                      "author": "Nexustar",
                      "body": "There are sound mechanical reasons to prevent printing without a complete component of inks.",
                      "score": -13,
                      "created_utc": 1741261536.0,
                      "replies": [
                        {
                          "id": "mgbr6t5",
                          "author": "DonArgueWithMe",
                          "body": "Go on...",
                          "score": 3,
                          "created_utc": 1741268133.0,
                          "replies": [
                            {
                              "id": "mgekj5x",
                              "author": "Nexustar",
                              "body": "The priming process that is part of the nozzle cleaning that must occur on a regular basis can suck air into the system if the cartridge becomes fully empty leaving ink remnants to potentially congeal there which threatens the tiny nozzles, ultimately damaging the printer. \n\nMuch like oil added to gasoline in a 2-stroke engine, the ink **is** the lubricant for the plumbing and mechanics of the nozzles. It is also the coolant - especially important for thermal inkjet vs piezoelectric heads that helps protect the nozzles from overheating and damaging themselves.",
                              "score": 1,
                              "created_utc": 1741297519.0,
                              "replies": [
                                {
                                  "id": "mgemmxx",
                                  "author": "DonArgueWithMe",
                                  "body": "Even if that's all true, being short on any/all color shouldn't prevent you from using your black cartridge. \n\nAnd if that was the reason they would be upfront when deploying a firmware that prevents it. It should call out increased longevity due to x, y, z, not just shadowban it.",
                                  "score": 1,
                                  "created_utc": 1741298121.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mgbivuh",
                          "author": "AspGuy25",
                          "body": "Those sound mechanical reasons were engineered in.",
                          "score": 4,
                          "created_utc": 1741264930.0,
                          "replies": [
                            {
                              "id": "mgekvoe",
                              "author": "Nexustar",
                              "body": "No, the ink also a coolant, a lubricant, and importantly liquid instead of dried up which are necessary to service the tiny nozzles on the printhead. Air in the system caused by priming from an empty cartridge promotes ink remnants drying or congealing and can significantly degrade the printhead.",
                              "score": 1,
                              "created_utc": 1741297620.0,
                              "replies": [
                                {
                                  "id": "mgeso0i",
                                  "author": "AspGuy25",
                                  "body": "I have a buddy who services printers.  Those issues can mainly be fixed with another servo. A normal servo can go years without needing additional lubricant. Have you ever lubed up an old toy? A blender?  No need ever.  \n\nThey design printers so there is one motor and a series of clutches so they can run into this problem.   It makes them more money. It’s a good problem for them to have.\n\nGuess how much it costs to do it a different way. How older printers did it.  It’s a BOM adder of 50 cents.  It’s a great smoke screen for them to hide behind.  If project management/upper management wanted the problem to go away, they could easily make it happen.",
                                  "score": 1,
                                  "created_utc": 1741299872.0,
                                  "replies": [
                                    {
                                      "id": "mgfq9gz",
                                      "author": "Nexustar",
                                      "body": "To my knowledge, no modern inkjet uses servos (maybe the wiper mechanism) but definitely not anywhere where the ink flows. They do have stepper motors (again nowhere near the ink) and vacuum pumps to prime the printer.\n\nAs far as the ink being a lubricant/coolant that relates to the nozzle itself only - these are 10 to 50 microns, typically smaller than a human hair and block or (in thermal inkjets) overheat easily.",
                                      "score": 1,
                                      "created_utc": 1741311608.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mg9rbom",
              "author": "Ascian5",
              "body": "This is the way. Wish I had done it from the get go when my old one finally died after 15 years in the garage. I got a color printer this time around and it's plastered with their subscription toner program. I had a sinking feeling in my gut and knew this was coming. I don't trust a damn thing until we see more proof.",
              "score": 8,
              "created_utc": 1741232117.0,
              "replies": []
            },
            {
              "id": "mg9tpgm",
              "author": "Fancy-Pair",
              "body": "How do you print wirelessly then",
              "score": 2,
              "created_utc": 1741233019.0,
              "replies": [
                {
                  "id": "mg9umy0",
                  "author": "wjean",
                  "body": "I print wirelessly from inside my lan. However, my printer has a static IP address and that address isnt allowed to connect to anything outside of the local subnet. Router won't route",
                  "score": 103,
                  "created_utc": 1741233380.0,
                  "replies": [
                    {
                      "id": "mg9uwlx",
                      "author": "Fancy-Pair",
                      "body": "Oh cool ty",
                      "score": 15,
                      "created_utc": 1741233485.0,
                      "replies": [
                        {
                          "id": "mg9vboy",
                          "author": "wjean",
                          "body": "No problem. Only works if you setup the printer to always get the same IP address and go look in the firewall settings for the option to block outgoing traffic from a specific source address.\n\nYour cheapest potato router might not have these features... But most do.\n\n\nI literally spent 20min going through all the options to confirm if I can disable fw updates from the printer or from the web interface. Neither looked possible (old enough firmware) so I deleted all the brother SW on all my devices  and this was just a final bit of protection for me.",
                          "score": 33,
                          "created_utc": 1741233651.0,
                          "replies": [
                            {
                              "id": "mgaixqn",
                              "author": "SarcasticOptimist",
                              "body": "Dhcp reservation tied to the Mac address of the printer via the router works too.",
                              "score": 15,
                              "created_utc": 1741244643.0,
                              "replies": []
                            },
                            {
                              "id": "mg9vgkv",
                              "author": "Fancy-Pair",
                              "body": "Thank you!",
                              "score": 3,
                              "created_utc": 1741233705.0,
                              "replies": []
                            },
                            {
                              "id": "mgbje87",
                              "author": "Piett_1313",
                              "body": "!RemindMe 10 hours when I’m home to do this too",
                              "score": 1,
                              "created_utc": 1741265143.0,
                              "replies": []
                            },
                            {
                              "id": "mgam1af",
                              "author": "dultas",
                              "body": "While not technically the only way it is probably the simplest.",
                              "score": 1,
                              "created_utc": 1741246412.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mgaqsqd",
                      "author": "Peuxy",
                      "body": "Never could get static IP to work on my brother, then again the interface sucked lol",
                      "score": 1,
                      "created_utc": 1741249249.0,
                      "replies": [
                        {
                          "id": "mgb1dxo",
                          "author": "w1n5t0nM1k3y",
                          "body": "Use a DHCP reservation for the MAC Address. It's a better way to handle static IPs in general anyway since it will survive device resets and operating system installs. You can see all the IPs that you have set up in one convenient place.",
                          "score": 10,
                          "created_utc": 1741255875.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mgbyusw",
                  "author": "Evile_Gaming",
                  "body": "Windows and Linux have had printer sharing since forever, literlly no reason for a printer to need its own sharing infrastructure.",
                  "score": 1,
                  "created_utc": 1741270758.0,
                  "replies": []
                },
                {
                  "id": "mgab3lr",
                  "author": "QBNless",
                  "body": "If you disconnect your wireless router from your wall cable, all of your devices on can still talk to each other! You wont be able to reach the internet though. You can program your router to keep the printer from reaching the internet too!",
                  "score": 1,
                  "created_utc": 1741240514.0,
                  "replies": [
                    {
                      "id": "mgc19iq",
                      "author": "Fancy-Pair",
                      "body": "Ty!",
                      "score": 2,
                      "created_utc": 1741271543.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mgce0jp",
              "author": "Sgt_carbonero",
              "body": "Can you explain to us mere mortals how we can do this too?",
              "score": 1,
              "created_utc": 1741275395.0,
              "replies": [
                {
                  "id": "mgcfhqg",
                  "author": "chrisdh79",
                  "body": "Easiest way is not to setup up wifi on your printer, and just utilize USB connection. If you want to use Air Print, just just block the printer at the firewall on your router.",
                  "score": 1,
                  "created_utc": 1741275820.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mh5juxh",
              "author": "Billy1121",
              "body": "How do u do this ? Now i am paranoid, though i don't think i have ever seen an update prompt for my brother",
              "score": 1,
              "created_utc": 1741668467.0,
              "replies": []
            },
            {
              "id": "mgaysdc",
              "author": "nadiaco",
              "body": "I block as much as possible from the internet especially printers...why do people make themselves so vulnerable to attacks?",
              "score": 0,
              "created_utc": 1741254276.0,
              "replies": [
                {
                  "id": "mgb1gwh",
                  "author": "w1n5t0nM1k3y",
                  "body": "Most people don't give it a second thought. They just plug the printer in and start printing.",
                  "score": 12,
                  "created_utc": 1741255925.0,
                  "replies": []
                },
                {
                  "id": "mgb4gyo",
                  "author": "None",
                  "body": "You expect everyday users to fiddle with firewall rules? Lol",
                  "score": 14,
                  "created_utc": 1741257721.0,
                  "replies": []
                },
                {
                  "id": "mgbbb6g",
                  "author": "None",
                  "body": "Some people don’t block printers from the Internet. Other people don’t set down scissors when they have to run.  And still others don’t wear condoms. No purpose in even wasting time asking the question.",
                  "score": 5,
                  "created_utc": 1741261485.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mgbonj5",
              "author": "Party-Interview7464",
              "body": "I don’t know why anybody hooks their printers up in the Internet-  you don’t do that and then you don’t have any issues. Like can’t you walk a few feet and print it manually",
              "score": 0,
              "created_utc": 1741267212.0,
              "replies": [
                {
                  "id": "mgbsnvl",
                  "author": "chrisdh79",
                  "body": "For me, my family utilizes air print, being able to print from our phones/ipad makes it convenient. But from the recent news, Brother is doing a forced update without owner permission. I didn't want to take a risk of getting that dreaded update. My 3rd party cartridges still work, I want to keep it that way!",
                  "score": 1,
                  "created_utc": 1741268639.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mgb5ush",
          "author": "djskein",
          "body": "I would be very disappointed if Brother turned out to be like HP. I sell printers for a living and regularly tell customers Brother are the only reliable option if you want a mono laser printer you can trust.",
          "score": 9,
          "created_utc": 1741258522.0,
          "replies": []
        },
        {
          "id": "mgbywqc",
          "author": "DJKGinHD",
          "body": "I read \"come on, brother\" and all I could think of was this guy's voice.\n\n![gif](giphy|BaSHs78BU2ZYQ|downsized)",
          "score": 2,
          "created_utc": 1741270774.0,
          "replies": []
        },
        {
          "id": "mga6d6g",
          "author": "EnigmaSpore",
          "body": "I read this in Hulk Hogan’s voice.",
          "score": 3,
          "created_utc": 1741238306.0,
          "replies": [
            {
              "id": "mgbfb45",
              "author": "evildevil90",
              "body": "I read this as: come own. Onichan you’we suppowsed to bwe one of the gwod pwinter cowmpanies. I hope you’we telling the twuth, don’t do this cwap! UwU",
              "score": 1,
              "created_utc": 1741263378.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mgaiimi",
          "author": "TotallyNormalSquid",
          "body": "I've never had as much trouble with a printer as with my Brother inkjet. Heard I should have gotten a colour laser printer, but just figured any Brother printer must be OK based on how much reddit loves them. Every print takes an average of 4 attempts, with a 'strong' automatic cleaning between each attempt which must waste a lot of ink. I don't print that often, so I can see a cleaning being needed after a few months, but this can happen after a few weeks of no use. And the thing wakes up to clean itself randomly every once in a while, so you'd think you wouldn't have to worry about it being ready to go when needed. And then the updates that break the WiFi connection and need a full reinstall of the software to fix.\n\nLast time I wanted to print a single black and white page it took over 30 minutes.",
          "score": 5,
          "created_utc": 1741244408.0,
          "replies": [
            {
              "id": "mgajh1k",
              "author": "adamdoesmusic",
              "body": "Inkjets in general suck for consumer use, but the industry behind them got huge in the 90s as everyone wanted to buy the fanciest color printer (only to not use it, or for it to look like ass). \n\nThings would be different if people got behind laser sooner.",
              "score": 18,
              "created_utc": 1741244946.0,
              "replies": []
            },
            {
              "id": "mgc593a",
              "author": "mouse_8b",
              "body": "Get the laser. I also had the Brother inkjet for a while. It is better than the competition, but it's still an inkjet. Switched to a Brother laser. It only does black & white, but that's generally all I need. And it always just works, no matter how long it has been since I last printed.",
              "score": 2,
              "created_utc": 1741272799.0,
              "replies": []
            },
            {
              "id": "mgdsk9w",
              "author": "orev",
              "body": "Inkjets are a really bad choice for people who don’t print often. The ink dries inside the nozzles, so if you haven’t used it they need to be deep cleaned, which wastes ink. You might be able to get around this by printing something that uses all 4 colors once a week.\n\nTypically people who “don’t print often” get an inkjet because they’re cheaper, but unintuitively that’s when buying the more expensive laser printer makes more sense.\n\nBut don’t ever print photos at home. It’s far cheaper to have them printed at a pharmacy/photo shop",
              "score": 1,
              "created_utc": 1741289681.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mg9nkno",
          "author": "MoringA_VT",
          "body": "Today we learned that there are no good companies.",
          "score": 1,
          "created_utc": 1741230730.0,
          "replies": [
            {
              "id": "mgc12nn",
              "author": "TheAspiringFarmer",
              "body": "If you're just learning that, well...",
              "score": 2,
              "created_utc": 1741271480.0,
              "replies": [
                {
                  "id": "mgc8ej3",
                  "author": "MoringA_VT",
                  "body": "Yes, only yesterday",
                  "score": 1,
                  "created_utc": 1741273748.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mg9qgip",
              "author": "adamdoesmusic",
              "body": "Not necessarily. Has not been proven yet!",
              "score": 4,
              "created_utc": 1741231793.0,
              "replies": [
                {
                  "id": "mgb4p7z",
                  "author": "snan101",
                  "body": "brother has gone to shit when they implemented \"chips\" on their MFC cartridges and disabled counter resets successfully making it impossible to continue using a toner cartridge until it's truly empty \n\n3rd party toner still works on my POS brother color laser but since I cannot do the counter reset anymore, I use 3, as many toner cartridges as I would need",
                  "score": 3,
                  "created_utc": 1741257855.0,
                  "replies": []
                },
                {
                  "id": "mgabalq",
                  "author": "B0Y0",
                  "body": "Steam, while still doing many shitty company things, has far outweighed that with the good they do for their userbase and the gaming community at large.",
                  "score": 4,
                  "created_utc": 1741240610.0,
                  "replies": []
                },
                {
                  "id": "mgabjul",
                  "author": "B0Y0",
                  "body": "Oh wait I got a better one: \"I can think of one good company. Yours.✨\"",
                  "score": 2,
                  "created_utc": 1741240737.0,
                  "replies": [
                    {
                      "id": "mgag5q0",
                      "author": "adamdoesmusic",
                      "body": "Ok that is a good one\n\nEdit: [obligatory](https://i.pinimg.com/736x/5b/12/d4/5b12d4a9155b2c94e68c6846170f9f0d.jpg)",
                      "score": 1,
                      "created_utc": 1741243125.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mg9hfah",
      "author": "FixedLoad",
      "body": "It took me forever to figure out why someone's brother bricking a printer with 3rd party ink was news... its been a long day.",
      "score": 339,
      "created_utc": 1741228537.0,
      "replies": [
        {
          "id": "mg9lf6q",
          "author": "None",
          "body": "No, you’re right. Headline reads like an Onion article about family drama",
          "score": 71,
          "created_utc": 1741229951.0,
          "replies": []
        },
        {
          "id": "mgakqju",
          "author": "opisska",
          "body": "At least I am not alone :) Would be a lot of effort to learn firmware programming just to get back at your siblings ...",
          "score": 9,
          "created_utc": 1741245662.0,
          "replies": [
            {
              "id": "mgboqu5",
              "author": "FixedLoad",
              "body": "Right!? That brother took his siblings' torment to the next level!",
              "score": 2,
              "created_utc": 1741267247.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mga2w2u",
          "author": "Mysterious-Pay-517",
          "body": "What are you doing step bro",
          "score": 11,
          "created_utc": 1741236780.0,
          "replies": [
            {
              "id": "mga37go",
              "author": "FixedLoad",
              "body": "Brickin' up this printer step sis!  Wanna see?",
              "score": 6,
              "created_utc": 1741236916.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mgaobtz",
          "author": "NeuHundred",
          "body": "That was my first thought too.",
          "score": 5,
          "created_utc": 1741247761.0,
          "replies": []
        },
        {
          "id": "mgafh8p",
          "author": "Whiterabbit--",
          "body": "you are not alone.",
          "score": 3,
          "created_utc": 1741242758.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mgb1mdo",
      "author": "Lumanus",
      "body": "Can definitely confirm. My old boss had a stockpile of third party toners for the company printer (small business) and out of the blue the printer gave an error that the toner wasn’t recognised. I thought the new toner must have been a dud so I replaced it with another new one, same problem, replaced it with an empty third party toner which we KNEW it recognised, same problem. My boss got fed up as we had shipping labels to print so he bought a genuine toner, worked flawlessly first try. Tried the third party toner again, wouldn’t fucking work.\nAsked my boss if he updated the printer firmware and he told me that he did indeed update it.\n\n\nBrother done fucked us all.",
      "score": 123,
      "created_utc": 1741256017.0,
      "replies": [
        {
          "id": "mgbqxw4",
          "author": "leova",
          "body": "NEVER UPDATE ANYTHING",
          "score": 22,
          "created_utc": 1741268044.0,
          "replies": [
            {
              "id": "mgcgrdl",
              "author": "OkDragonfruit9026",
              "body": "All those backdoors are greatly appreciated by adversaries. So go ahead, use your windows xp machine and Android 2.2.4. Botnets are fun! \n\nSigned: security engineer",
              "score": 15,
              "created_utc": 1741276181.0,
              "replies": [
                {
                  "id": "mgdwal9",
                  "author": "ml20s",
                  "body": "Your comment is more properly directed at developers who create anti-features (and more bugs) when they push out updates.",
                  "score": 14,
                  "created_utc": 1741290709.0,
                  "replies": [
                    {
                      "id": "mgdy9ox",
                      "author": "OkDragonfruit9026",
                      "body": "Devs are not to be blamed, they report to idiotic CEOs who want endless growth. \n\nI know, I used to give support to some appliances and dealt with devs daily. They wanted QOL stuff, management wanted to sell more",
                      "score": 9,
                      "created_utc": 1741291260.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mgkngw0",
          "author": "sh0cked",
          "body": "Sounds like you just had a broken printer. This is not a thing that is actually happening.",
          "score": -1,
          "created_utc": 1741379910.0,
          "replies": [
            {
              "id": "mgl4luy",
              "author": "Lumanus",
              "body": "Yes tf it is, my boss had two identical printers in two different clothing stores which both stopped working with third party toners within one month of eachother.",
              "score": 3,
              "created_utc": 1741385696.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mg9a69a",
      "author": "ChoiceHour5641",
      "body": "![gif](giphy|6JB4v4xPTAQFi|downsized)",
      "score": 246,
      "created_utc": 1741226024.0,
      "replies": [
        {
          "id": "mg9anvz",
          "author": "ginongo",
          "body": "Ikr, bricking printers? Who ever would have guessed",
          "score": 38,
          "created_utc": 1741226193.0,
          "replies": [
            {
              "id": "mgafta9",
              "author": "Afferbeck_",
              "body": "That's just the natural state of a printer, achieving anything else with them is a miracle ",
              "score": 5,
              "created_utc": 1741242939.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mg9xp08",
          "author": "ashleyriddell61",
          "body": "Source; 3 unverified stories from unidentified Reddit users. From 3 years ago. No follow up, investigation or testing of any of the claims.\n\nI’m with Ron.\n\n![gif](giphy|lSz7yVdOTAnk2o16RY)",
          "score": 53,
          "created_utc": 1741234601.0,
          "replies": []
        },
        {
          "id": "mga6qnu",
          "author": "kat1795",
          "body": "It might be true!\n\nCompanies usually brick devices by area/country you are from as usually updates are different for different regions!! So not everyone is going to be affected.\n\nAlso, companies pretty much never brick all devices at once, as it's going to be too suspicious and could bring court cases. They usually do it slowly...\n\nReal life example: I remember a few years ago I had an older iPhone (3y) and a new update made my phone not working properly, it turned out I wasn't alone with that update and identical issues, but my friend from USA never actually received the 'bricking' update even though had same phone model.\nI am from Australia and I've noticed we receive in general significantly more poor quality updates/bricking in comparison to my US friends... ;(",
          "score": 3,
          "created_utc": 1741238473.0,
          "replies": []
        },
        {
          "id": "mgb51d1",
          "author": "None",
          "body": "Keep your head in the sand.\n\n\nHere's what brother emailed me back when I asked them why I couldn't print in grayscale/black and white docs of my yellow ink cartridges was empty.\n\n\"Basically, your Brother machine is designed to stop ALL printing operations when any of the ink cartridges are empty. This is to ensure the life of the print head and maintain premium print quality. If the unit were to continue printing, print jobs and cleaning cycles would suck air from the empty cartridge and damage the print head.\"",
          "score": -2,
          "created_utc": 1741258050.0,
          "replies": [
            {
              "id": "mgbesl1",
              "author": "KrackSmellin",
              "body": "It can’t print the hidden yellow dots all color printers do to hide your information in the print… but you know that already right?  RIGHT?",
              "score": 6,
              "created_utc": 1741263147.0,
              "replies": [
                {
                  "id": "mgct37s",
                  "author": "None",
                  "body": "I heard about that, just didn't know it was this blatant and only yellow dots.",
                  "score": 1,
                  "created_utc": 1741279742.0,
                  "replies": [
                    {
                      "id": "mgi1hia",
                      "author": "KrackSmellin",
                      "body": "They are the easiest to hide color wise, enjoy the rabbit hole:\n\nhttps://en.wikipedia.org/wiki/Printer_tracking_dots",
                      "score": 1,
                      "created_utc": 1741351203.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mg9dqg0",
      "author": "xxbiohazrdxx",
      "body": "There’s very little PR speak in Brother’s statements here. Usually they’ll try and word the statement in such a way that you could interpret it one way while they’re saying another. This is an unequivocal denial.",
      "score": 134,
      "created_utc": 1741227258.0,
      "replies": [
        {
          "id": "mg9u5fw",
          "author": "Cynical_Cyanide",
          "body": "BS. \n\n\nThey're not ruling out that the re-alignment isn't disabled with 3rd party cartridges, and their firmware doesn't 'Block' 3rd party cartridges, but that doesn't mean that the printer doesn't refuse to work under certain conditions that it would happily work under with an OEM cart.",
          "score": -20,
          "created_utc": 1741233192.0,
          "replies": [
            {
              "id": "mgacvjo",
              "author": "accidentlife",
              "body": "From their statement:\n\n> “We are aware of the recent false claims suggesting that a Brother firmware update may have restricted the use of third-party ink cartridges. Please be assured that Brother firmware updates do not block the use of third-party ink in our machines.“\n\nAnd\n\n> “Brother printers do not intentionally degrade print quality based on whether a Brother Genuine or non-genuine ink/ toner cartridge is used”\n\nI’ve never worked with a color laser printer, but if it’s in anyway similar to inkjets, I would definitely consider page and color alignments to fall under “print quality”.",
              "score": 29,
              "created_utc": 1741241403.0,
              "replies": [
                {
                  "id": "mgagh64",
                  "author": "cH3x",
                  "body": "> When asked where Brother thinks the confusion may be coming from, the company said:\n> \n> Brother encourages the use of Brother Genuine ink and toner for optimal performance and reliability, and it is standard practice that we perform a Brother [G]enuine check when troubleshooting a Brother printer. Compatible supplies may range in quality, and in order to verify that a printer is working properly, we like to troubleshoot with Brother Genuine supplies. *We believe this check in the process may have led to a misunderstanding[,]* but as we confirmed, the firmware update would not be responsible for the degradation of quality or removal of printer features.\n\nThis could be interpreted to mean that, *after using a genuine toner cartridge to verify the printer is working properly,* one could use the third-party toner to actually print. In other words, a genuine cartridge is required to be inserted before inserting the third-party.",
                  "score": 7,
                  "created_utc": 1741243298.0,
                  "replies": [
                    {
                      "id": "mgau71z",
                      "author": "_Middlefinger_",
                      "body": "I think that's totally reasonable. Some third party carts are garbage that leak or have poor quality ink in them.",
                      "score": -1,
                      "created_utc": 1741251393.0,
                      "replies": [
                        {
                          "id": "mgb60bt",
                          "author": "tminx49",
                          "body": "Not this shit again. \n\nNo, no it fucking isn't. If you bought third party, you want to use third party. If you bought their precious brand name ink, again it's your choice. \n\nYou are the buyer, the one who made the fucking purchase. Do not allow them to prevent you from using what you bought.",
                          "score": 2,
                          "created_utc": 1741258608.0,
                          "replies": [
                            {
                              "id": "mgb7uo5",
                              "author": "Impossible_Leg_2787",
                              "body": "That’s fine, but the issue is when people expect support or to try and warranty their printer after jamming who-knows-what in there.",
                              "score": 6,
                              "created_utc": 1741259660.0,
                              "replies": []
                            },
                            {
                              "id": "mgbfpon",
                              "author": "_Middlefinger_",
                              "body": "FACT, some cartridges ARE garbage an DO leak and WILL damage printers (or make a huge mess). Not all, SOME. \n\nGet it now?\n\nI didn’t say you cant or shouldn’t use 3rd party, just that they might want or require you use their parts in order to diagnose issues. That is not unreasonable and is pretty standard in everything.",
                              "score": 5,
                              "created_utc": 1741263558.0,
                              "replies": []
                            },
                            {
                              "id": "mghafal",
                              "author": "BranTheUnboiled",
                              "body": "It said when troubleshooting. Obviously they can't verify the quality of every third party product and that they're all up to par dude, which is why they ask you to try first try it with something they know will work when they're providing you with customer support. That's troubleshooting 101.",
                              "score": 1,
                              "created_utc": 1741336079.0,
                              "replies": [
                                {
                                  "id": "mghmoo3",
                                  "author": "tminx49",
                                  "body": "> a genuine cartridge is required to be inserted before inserting the third-party.\n\nThis doesn't have anything to do with troubleshooting.",
                                  "score": 0,
                                  "created_utc": 1741343709.0,
                                  "replies": [
                                    {
                                      "id": "mgiv7bx",
                                      "author": "BranTheUnboiled",
                                      "body": "That's not part of their statement, that's someone's interpretation. To me, the company statement reads like a description of the customer support script. Try turning it on and off again, try after making sure it has the latest update, try after using first party ink, etc.",
                                      "score": 1,
                                      "created_utc": 1741361449.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mga7q2b",
              "author": "ertbvcdfg",
              "body": "No",
              "score": 3,
              "created_utc": 1741238915.0,
              "replies": [
                {
                  "id": "mgb6s1u",
                  "author": "Cynical_Cyanide",
                  "body": "Lmao 'no' .\n\n\nSo convincing, what a cogent argument.",
                  "score": -1,
                  "created_utc": 1741259047.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mgb97h5",
          "author": "j0s3f",
          "body": "That's absolutely untrue.\nThe only thing they say is they don't \"block\" third party cartridges.\nBut no one claimed that they block them. They disable certain features to make print quality worse. They made very sure to never deny that.",
          "score": -9,
          "created_utc": 1741260395.0,
          "replies": [
            {
              "id": "mgbp6jb",
              "author": "FrostyMittenJob",
              "body": "They actually did\n\n\nWhen asked for more detail, Brother told Ars that “firmware updates do not block the use of third-party compatibles,” but added:\n\n\n    \"Brother printers do not intentionally degrade print quality based on whether a Brother Genuine or non-genuine ink/ toner cartridge is used.\"\n\n\nApparently reading the full article is too much to ask.",
              "score": 23,
              "created_utc": 1741267406.0,
              "replies": []
            },
            {
              "id": "mgbqf6f",
              "author": "Snowmobile2004",
              "body": "The Rossman video claimed that 3rd party cartridges are outright blocked.",
              "score": 4,
              "created_utc": 1741267857.0,
              "replies": []
            },
            {
              "id": "mgcdtet",
              "author": "AccomplishedEnergy24",
              "body": "Why do people keep talking abstractly? \n\nApparently, because none of them understand how printers work.\n\nWhat *exactly* is the \"feature\" you think they disable to make print quality worse.\n\nI'll offer a view - none.\n\nLaser printers are simple devices.\n\nThere is a beam that electrostatically charges the drum with the right image and causes it to attract toner.\n\nThe toner is then rolled on to the paper and fused with heat.\n\nThat's it.\nSo what is the \"feature\" they are disabling, exactly?\nAll of this is easy to verify too.\n\nYou can easily measure whether the fusing temperature is the same with/without third party ink.\n\nYou can easily measure whether the image is being painted the same on the drum.\n\nYou can easily measure whether the roller speed is the same.\n\nMaybe instead of abstractly accusing brother, people should just do the fucking measurements and we'd know for sure.\n\nOn the software side - it's trivial to determine if they are doing something in the software.  While most printers accept various formats of drawing commands from their drivers, basically all of them (including brother) *also* accept post processed raw-image formats that they don't touch\n\nSo disconnect your machine from the network (so it can't possible communicate with the printer to determine if the ink is genuine), generate a raw datastream format that the printer accepts, copy it to the printer.\n\nReconnect machine to network, reprint.\n\nTry again with a non-raw image format.\n\nIf you see differences, maybe the software is doing something.\n\nAgain, this is just not that hard to test.\n\nMy guess: You will discover brother is doing literally nothing, and some slightly different property of the third party ink accounts for all perceived difference.",
              "score": 1,
              "created_utc": 1741275337.0,
              "replies": [
                {
                  "id": "mgdafu5",
                  "author": "diverareyouokay",
                  "body": "You know a whole lot more about this than I do - I honestly never even thought to wonder how a laser printer works… but I assumed when the person you were responding to spoke about degradation, that they were referring to software reducing the dots per inch on things like images before it actually hit the printer. It seems like that would still be possible, but I don’t know if that would work on things like printed text or not.",
                  "score": 1,
                  "created_utc": 1741284586.0,
                  "replies": [
                    {
                      "id": "mgezpy0",
                      "author": "AccomplishedEnergy24",
                      "body": "This is really only possible in certain modes.\nIt's also a *lot* harder than one would think to implement something like this.\n\nThe reason is that Microsoft has multiple print APIs, and most if not all are still in use.\n\nBy print API, let me try to give a not-too-incorrect version of what happens when you click print:\n\n1. You click print button\n2. Depending on print API used (GDI, XPS, OpenXPS, etc), a set of drawing commands is issued to the printer driver, *or* a raw image is handed to the printer driver.\n3. The driver then translates these into some printer language it sends the printer.\n4. It gets transported to printer and printer processes the commands.  \n\nA few things:\n\n1. As things became more complex, printers actually do less and less of the rasterization work on device because it's too intensive, and too easy to get wrong if, for example, you want fonts to look the same way on the screen and the device.    In the case of raw image print modes, it basically just splats pixels directly (and hence, affecting this sort of mode would be *really* hard).\n\n2. Non-raw formats like GDI, XPS, etc getting sent to the driver are *completely* different sets of drawing commands and what have you.  Which one gets used is not just selected by *windows*, but by the *app*.  So for example, Google Chrome still uses EMF->GDI printing.\nWhile Microsoft word prints in XPS.  XPS in turn queries the printer driver to understand which sorts of things it understands.\n\n\n\n\n3. Degrading image quality while not making it completely unusable is not trivial either (if it was, we wouldn't have dithering/etc algorithms).\n\n\n\n\nIn the end, because of all of this, making the software degrade image quality would actually be *a lot* of work.  That's true even if you don't, for example, try to degrade it consistently the same way in XPS vs GDI vs etc.\n\nIt is very hard to believe anyone would undertake the development effort required to degrade image quality in the driver, across all supported modes.  It would also be very easy to discover through reverse engineering.\n\nOn top of that, it's one of those things where you actually *want* the user to know it's happening.  If someone only ever used third party ink, how would they ever know it was lower quality printing without someone telling them?\n\nIn the end:\n\n1. It's dramatically easier, safer, and saner to just refuse to work properly when third party ink is detected, if that is what someone wants to do.  It isn't illegal in the vast majority of cases, and as we see here, users assume all printer companies are both assholes, and doing it, so ....\n\n2. Building and maintaining support for consistently degrading image quality inside the software is hard, and it's hard to imagine anyone would bother over just doing #1.  If they did bother, i also don't see why they'd try to hide it from the user. -  if you want people to buy your ink, at some point you have to tell them they should buy your ink to get better quality prints.",
                      "score": 2,
                      "created_utc": 1741302151.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mg9ldyc",
          "author": "Daratirek",
          "body": "Cause a company has never outright lied before? Not saying they are but I don't trust them.",
          "score": -12,
          "created_utc": 1741229939.0,
          "replies": [
            {
              "id": "mg9lh03",
              "author": "xxbiohazrdxx",
              "body": "I never said differently",
              "score": 11,
              "created_utc": 1741229969.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mgb7ne4",
      "author": "yumms101",
      "body": "So this is based on a three year old Reddit post with no actual proof? \n\n\"On March 3, YouTuber Louis Rossman posted a video saying that “Brother turns heel & becomes anti-consumer printer company.” The video, spotted by Tom’s Hardware, has 163,000 views as of this writing and seems to be based on a Reddit post from 2022. In that post, Reddit user 20Factorial said that firmware update W1.56 caused the automatic color registration feature to stop working on his Brother MFC-3750 when using third-party cartridges.\"",
      "score": 41,
      "created_utc": 1741259546.0,
      "replies": [
        {
          "id": "mgbv8yv",
          "author": "Snowmobile2004",
          "body": "Seems like rossman is turning into sensationalist reporting..",
          "score": 17,
          "created_utc": 1741269534.0,
          "replies": [
            {
              "id": "mgmvn08",
              "author": "yumtoastytoast",
              "body": "Rossmann has always been making clickbait craps.\n\nBut I wonder why Brother isn't comming out with their analysis why his video is a clickbait crap in which the \"evidence\" is being solely based on a random reddit post from 3 years ago. All Brothers I've seen still work with 3rd party inks and I assume those people who complained used a crappy cartridge with a sketchy chip that had legit compatibility issues. People are being baited. People have always been blaming big corporations and unless Brother do something else they'll have to end their ethical and reasonable print business.",
              "score": 4,
              "created_utc": 1741408518.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mgd5777",
      "author": "Icy_Department8104",
      "body": "how sad. I hope this is not true.\n\nI bought my brother printer like 6 years ago and its been a good B/W laser printer. Its far outlasted any printer I've ever owned. Toner lasts forever and the aftermarket ones are super cheap. I'm probably on my 4th cartridge?\n\nit was the only printer brand I recommended to friends lol. I guess not anymore.",
      "score": 7,
      "created_utc": 1741283130.0,
      "replies": [
        {
          "id": "mgdoi8z",
          "author": "CheezeLoueez08",
          "body": "I was thinking the same thing. I bought mine second hand around 7 or 8 years ago. Also always recommending them. I hope this isn’t true.",
          "score": 3,
          "created_utc": 1741288541.0,
          "replies": []
        },
        {
          "id": "mic1ryy",
          "author": "mboswi",
          "body": "Same here. Hope this is just a bad day for Brother and things keep as usual.\nI was really happy with their products. I even bought some original parts from them (no toners) as a recognition for their quality and good policies.",
          "score": 1,
          "created_utc": 1742248192.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mgams6c",
      "author": "Jiggerjuice",
      "body": "I tossed my brother for an ecotank, not going back. ",
      "score": 7,
      "created_utc": 1741246852.0,
      "replies": []
    },
    {
      "id": "mgcgio7",
      "author": "skibbady-baps",
      "body": "A friend of mine was literally telling me about this happening to him the other day. 🤔",
      "score": 5,
      "created_utc": 1741276112.0,
      "replies": []
    },
    {
      "id": "mgczaca",
      "author": "Healfezza",
      "body": "We didn't update the code!\\* (it was there all along, it was just time gated)",
      "score": 5,
      "created_utc": 1741281480.0,
      "replies": []
    },
    {
      "id": "mg9hf0h",
      "author": "waloshin",
      "body": "How can they do that Brother does not have microchips like HP, Lexmark and other brands…",
      "score": 29,
      "created_utc": 1741228534.0,
      "replies": [
        {
          "id": "mg9jbs0",
          "author": "CocaineIsNatural",
          "body": "From the original post, it seems some do.\n\nhttps://www.reddit.com/r/printers/comments/s9b2eg/brother_mfc_firmware_update_nongenuine_toner_now/i0jt832/",
          "score": 25,
          "created_utc": 1741229205.0,
          "replies": [
            {
              "id": "mgahbsw",
              "author": "speculatrix",
              "body": "Thanks for that link. Unfortunately the ... menu was disabled so I screenshotted it for my future self.",
              "score": 5,
              "created_utc": 1741243761.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mgavqz7",
          "author": "sid2k",
          "body": "They do",
          "score": 5,
          "created_utc": 1741252364.0,
          "replies": []
        },
        {
          "id": "mgb4li8",
          "author": "None",
          "body": "Brother ink cartridges do have chips. Check out their lc30xx ink line.",
          "score": 3,
          "created_utc": 1741257795.0,
          "replies": []
        },
        {
          "id": "mgknt9m",
          "author": "sh0cked",
          "body": "They aren't doing that. That's the point.",
          "score": 1,
          "created_utc": 1741380010.0,
          "replies": [
            {
              "id": "mgkre14",
              "author": "waloshin",
              "body": "Then why all the hysteria?",
              "score": 1,
              "created_utc": 1741381272.0,
              "replies": [
                {
                  "id": "mgksdw0",
                  "author": "sh0cked",
                  "body": "Because someone picked up on 3 Reddit users making an accusation 3 years ago that Lius Rossman did a video on without any fact checking and made false statements in.",
                  "score": 1,
                  "created_utc": 1741381691.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mgagvf6",
      "author": "Geargarden",
      "body": "My HL2170W had been a beast for over 10 years. She's still rocking in my living room. Bought a Brother scanner because of how good that printer has been. I hope they haven't gone to the dark side. Reputation is everything.",
      "score": 4,
      "created_utc": 1741243512.0,
      "replies": []
    },
    {
      "id": "mgbylfc",
      "author": "thisuckerselectrical",
      "body": "I thought this was already confirmed that they did. I had a brother all in one , did a firmware update and it immediately stopped working due to the 3rd party ink from Amazon that I had been using for the past 5 plus years. I switched to Epson eco tank specifically because brother did this.",
      "score": 5,
      "created_utc": 1741270673.0,
      "replies": [
        {
          "id": "mgko6pu",
          "author": "sh0cked",
          "body": "No, it was never confirmed.. 3 people reported it and luis rossman made a video with no facts to back it up. This is them confirming they DON'T. You can have a problem with your printer and it not be a conspiracy.",
          "score": 2,
          "created_utc": 1741380119.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg9cm6d",
      "author": "FaximusMachinimus",
      "body": "![gif](giphy|CpRz4dbLFBAKXwpMdd|downsized)",
      "score": 22,
      "created_utc": 1741226870.0,
      "replies": []
    },
    {
      "id": "mga62yt",
      "author": "pelrun",
      "body": "Could also just as easily be a bug in the firmware update, or simply something that the third-party cartridge chip didn't copy properly that only worked by luck rather than design, and the firmware change broke it. It doesn't have to be a deliberate action to block them.\n\nCan't expect Brother to put the effort in to keep their firmware bug-compatible with accessories they don't control.",
      "score": 19,
      "created_utc": 1741238180.0,
      "replies": [
        {
          "id": "mgay5d7",
          "author": "alidan",
          "body": "apparently this effected 3 people, 3 years ago, and its news now. \n\nim going with a batched update... which given how many pritners there are, thats not bad odds, but still shitty when a firmware update kills a product.",
          "score": 20,
          "created_utc": 1741253873.0,
          "replies": [
            {
              "id": "mgb4qz2",
              "author": "None",
              "body": "There was a recent firmware update which made this issue worse. No more black and white printing unless you have all color ink cartridges too.",
              "score": 11,
              "created_utc": 1741257882.0,
              "replies": [
                {
                  "id": "mgbuubt",
                  "author": "Snowmobile2004",
                  "body": "Is that related to the yellow tracking dots mandated by law?",
                  "score": 3,
                  "created_utc": 1741269394.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mgb1s1t",
              "author": "Lumanus",
              "body": "No tf it does not, it affected the printer at my old job almost a year ago too.",
              "score": 2,
              "created_utc": 1741256112.0,
              "replies": []
            },
            {
              "id": "mgbslkq",
              "author": "unibrow4o9",
              "body": "I don't know why people on reddit are so hard for Brother, they're just as shitty as the rest of them. They bricked my 3rd party ink about 4 or 5 years ago with an updated. Threw it in the trash and got a Canon laserjet.",
              "score": 2,
              "created_utc": 1741268617.0,
              "replies": [
                {
                  "id": "mgcqdu3",
                  "author": "alidan",
                  "body": "more or less, unless you require color and print often enough, a laser jet is better, and brother was the best laser jet, and seemingly the least shitty printer option, probably still are the least shitty printer option.",
                  "score": 1,
                  "created_utc": 1741278982.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mgcnkvw",
      "author": "Diashocks",
      "body": "Threw away two Brother printers exactly like the one in the article (expansive A3 multi-functional) in December. One of the most reliable printers I have had for years till some firmware update. \n\nSystem prompted me to replace the ink cartridges that had plenty of ink left, able to tell by shaking and there’s a transparent window. It just won’t let me print till I replace them with a new cartridge. Multiply this by four times CMYK one after the other. The system used to just prompt low ink and would still print. \n\nFinal straw was, the latest patch of cartridges prompted an error and mentioned “cartridges are not detected”.\n\nNow on a Epson EcoTank.  No chip, no cartridges.\n\nEdit* Printer also loves to run its routine print head cleaning that uses up lots of ink after new cartridges are installed.",
      "score": 5,
      "created_utc": 1741278169.0,
      "replies": []
    },
    {
      "id": "mgc53dy",
      "author": "rdmusic16",
      "body": "I 100% know Brother is a printing company, but still was confused because I read it as if it was a family member.",
      "score": 3,
      "created_utc": 1741272750.0,
      "replies": [
        {
          "id": "mgdoreh",
          "author": "CheezeLoueez08",
          "body": "Me too 😂",
          "score": 2,
          "created_utc": 1741288612.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mgc62ha",
      "author": "BrokkelPiloot",
      "body": "Oh Brother...",
      "score": 3,
      "created_utc": 1741273046.0,
      "replies": []
    },
    {
      "id": "mgcj750",
      "author": "Professional_Ad8069",
      "body": "![gif](giphy|PkWtM2kZ0B76VV2g0W)\n\nNot cool.",
      "score": 3,
      "created_utc": 1741276866.0,
      "replies": []
    },
    {
      "id": "mgcp4wp",
      "author": "frascada9119",
      "body": "Jokes on them…my printer has refused to update firmware since day 1!",
      "score": 3,
      "created_utc": 1741278625.0,
      "replies": []
    },
    {
      "id": "mgdl5rt",
      "author": "Fuzzylojak",
      "body": "Tell your brother he is a liar!",
      "score": 3,
      "created_utc": 1741287601.0,
      "replies": []
    },
    {
      "id": "mg9i5qq",
      "author": "jnovel808",
      "body": "My work has an HP. It won’t use third party either. And I did all the back end changes to unlock it. Still won’t work. Fuck tech companies. Actually, fuck all large corporations",
      "score": 10,
      "created_utc": 1741228791.0,
      "replies": [
        {
          "id": "mg9j6vu",
          "author": "r31ya",
          "body": "third party aside,\n\nHP printer software is among the most maddening useless piece of sh\\*t software i ever touch. i throw my new HP printer in my office to other division after trying to deal with that software.\n\nits intentionally gimped, they remove many troubleshooting feature or setting that exist basically in every other brand printer software, just so you pay for HP maintenance crew or something.\n\nmy office now use either Epson or Brother.",
          "score": 6,
          "created_utc": 1741229157.0,
          "replies": []
        },
        {
          "id": "mgds9yy",
          "author": "chuloreddit",
          "body": "> My work has an HP...\n\nStop there, burn it with fire",
          "score": 2,
          "created_utc": 1741289599.0,
          "replies": [
            {
              "id": "mgf0cqi",
              "author": "jnovel808",
              "body": "🤣🔥🔥🔥",
              "score": 1,
              "created_utc": 1741302370.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mg9m607",
          "author": "watchmedrown34",
          "body": "When someone asks me what printer they should get, my default answer is \"Anything but HP\". I don't want to add Brother to the list, I usually recommend them or Epson 😭",
          "score": 3,
          "created_utc": 1741230220.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg9dgo5",
      "author": "NovaHorizon",
      "body": "![gif](giphy|avZCkkmbnx7Ta)",
      "score": 9,
      "created_utc": 1741227163.0,
      "replies": [
        {
          "id": "mg9s0f5",
          "author": "BritTheBret",
          "body": "To blathe",
          "score": 0,
          "created_utc": 1741232374.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg9qf2e",
      "author": "gaya2081",
      "body": "Weird how my color laser printer was fine just a couple months ago and now prints like crap and I also had to manually override the \"out of toner\" error for my 3rd party toners. No changes except a firmware update.",
      "score": 6,
      "created_utc": 1741231777.0,
      "replies": []
    },
    {
      "id": "mg9xf0v",
      "author": "Fragrant-Wrangler-99",
      "body": "Oh brother",
      "score": 4,
      "created_utc": 1741234490.0,
      "replies": []
    },
    {
      "id": "mg9kxgm",
      "author": "wingspantt",
      "body": "Hoping it's true. Brother is the one good printer company that has never done anything bad for consumers.",
      "score": 7,
      "created_utc": 1741229773.0,
      "replies": [
        {
          "id": "mga1j7f",
          "author": "ReleventReference",
          "body": "Never done anything bad for consumers YET.",
          "score": 4,
          "created_utc": 1741236198.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mga98g8",
      "author": "firedrakes",
      "body": "love how most comments never read the story and lie it was based on",
      "score": 5,
      "created_utc": 1741239613.0,
      "replies": []
    },
    {
      "id": "mgagr3k",
      "author": "loosebolts",
      "body": "In some sort of defence, all the examples in the article I read this morning do seem to point to shitty quality third party cartridges rather than intentional action by Brother.",
      "score": 7,
      "created_utc": 1741243448.0,
      "replies": []
    },
    {
      "id": "mga5l6v",
      "author": "Wazza17",
      "body": "Turn off printer updates. The manufacturer’s can’t be trusted not to prevent you using non genuine inks.",
      "score": 2,
      "created_utc": 1741237959.0,
      "replies": []
    },
    {
      "id": "mgacj26",
      "author": "francisdemarte",
      "body": "I have a brother scanner laser printer combo that stopped working with my 3rd party cart one day. I opened a newer 3rd party toner cartridge and swapped the on the chip and button battery and it started working again. So maybe a a half truth.",
      "score": 2,
      "created_utc": 1741241227.0,
      "replies": []
    },
    {
      "id": "mgauxsy",
      "author": "Berkut22",
      "body": "Et tu, Brother?",
      "score": 2,
      "created_utc": 1741251857.0,
      "replies": []
    },
    {
      "id": "mgay7m5",
      "author": "Electric_Emu_420",
      "body": "Well that's it. Good game everyone.\n\nPrinters are dead.",
      "score": 2,
      "created_utc": 1741253912.0,
      "replies": []
    },
    {
      "id": "mgaytes",
      "author": "nadiaco",
      "body": "HP used to do this, may still...",
      "score": 2,
      "created_utc": 1741254294.0,
      "replies": []
    },
    {
      "id": "mgb4xzq",
      "author": "MJDeebiss",
      "body": "mi hermano?",
      "score": 2,
      "created_utc": 1741257996.0,
      "replies": [
        {
          "id": "mgdtae2",
          "author": "davidbernhardt",
          "body": "Hey hermano!",
          "score": 2,
          "created_utc": 1741289884.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mgbi7wm",
      "author": "jusjes77",
      "body": "This is true. Tried to use third party ink and it will not allow initial printing, when you bypass the initial denial, printing is subpar. By Brother, you won’t be missed.",
      "score": 2,
      "created_utc": 1741264650.0,
      "replies": []
    },
    {
      "id": "mgc2t0r",
      "author": "bbmaster123",
      "body": "oh I completely misread that at first  \nJust waking up, read that as \\**someone's*\\* brother installed a fw update to their own printer to block their own 3rd party ink. Maliciously I suppose. I'm sure someone has done that!\n\nugh not them too!",
      "score": 2,
      "created_utc": 1741272037.0,
      "replies": []
    },
    {
      "id": "mgcjczw",
      "author": "cheeseanator12",
      "body": "I literally just updated my printer yesterday, Christ sakes man .",
      "score": 2,
      "created_utc": 1741276913.0,
      "replies": []
    },
    {
      "id": "mgcoute",
      "author": "sluttyman69",
      "body": "My HP is almost 20 years old. Can’t get parts getting hard to get ink still works great.",
      "score": 2,
      "created_utc": 1741278545.0,
      "replies": []
    },
    {
      "id": "mgcp6m6",
      "author": "Remarkable-NPC",
      "body": "why people update in the first place?\n\ni work in company where i make sure no one is updating anything \n\nif it work don't fix it",
      "score": 2,
      "created_utc": 1741278638.0,
      "replies": []
    },
    {
      "id": "mgcsgcs",
      "author": "AnalogFeelGood",
      "body": "Is it only on newer printers or all of them? I have an L2720-DW.",
      "score": 2,
      "created_utc": 1741279563.0,
      "replies": []
    },
    {
      "id": "mgctc2b",
      "author": "n3u7r1n0",
      "body": "Hp also denied it until they made it their official company policy",
      "score": 2,
      "created_utc": 1741279809.0,
      "replies": []
    },
    {
      "id": "mgcugd0",
      "author": "Eclectophile",
      "body": "My Epson quietly does not care. It has ink well tanks to fill instead of the cartridges. Any ink will do.",
      "score": 2,
      "created_utc": 1741280119.0,
      "replies": []
    },
    {
      "id": "mgcygmz",
      "author": "ogrefab",
      "body": "Whose brother?",
      "score": 2,
      "created_utc": 1741281250.0,
      "replies": []
    },
    {
      "id": "mgebifd",
      "author": "yourboymisha",
      "body": "I’ve had a brother laser for 3 years, haven’t changed the toner ONCE and it has printed over 1000 pages no doubt. It’s been dropped, water spilled, full of dust and only a week ago I got a low toner notification",
      "score": 2,
      "created_utc": 1741294986.0,
      "replies": []
    },
    {
      "id": "mgehy5w",
      "author": "mingkee",
      "body": "I have Brothers 9300 bought few years ago and I never replace toner.\n\nI'd prefer stock for reliability",
      "score": 2,
      "created_utc": 1741296787.0,
      "replies": []
    },
    {
      "id": "mgekoxw",
      "author": "l1lpiggy",
      "body": "I stopped updating my Brother printer, and I haven’t had any issues for years. \n\nThe updates don’t add features, and they only create new problems especially with generic cartridges.",
      "score": 2,
      "created_utc": 1741297566.0,
      "replies": []
    },
    {
      "id": "mgekxx5",
      "author": "thebarkbarkwoof",
      "body": "I wanted to buy a network wireless printer / scanner. I'll never touch another HP Product but was thinking about Brother.  Now I'm not sure what to buy",
      "score": 2,
      "created_utc": 1741297637.0,
      "replies": []
    },
    {
      "id": "mgf761k",
      "author": "Fine-Philosophy8939",
      "body": "They’re lying.",
      "score": 2,
      "created_utc": 1741304760.0,
      "replies": []
    },
    {
      "id": "mgfdt97",
      "author": "_not_quite_there_yet",
      "body": "FFS, I thought Brother was the last vestige of something resembling an ethical printer company. \n\nI guess the capitalism squeeze comes for everyone in the end.\n\nI'll reserve judgement until I see this isn't a mistake.",
      "score": 2,
      "created_utc": 1741307137.0,
      "replies": []
    },
    {
      "id": "mgfi61w",
      "author": "updatelee",
      "body": "I don’t know. I’ll probably still stick with them. The all in one bw laser on my desk has pumped out almost 20k of documents and just keeps going. I don’t think I’ve ever owned Better $200 printer. The thing is a work horse for the money",
      "score": 2,
      "created_utc": 1741308697.0,
      "replies": []
    },
    {
      "id": "mgg74gl",
      "author": "TI_69_",
      "body": "Oh BROTHER theSE GUYS STINK",
      "score": 2,
      "created_utc": 1741317546.0,
      "replies": []
    },
    {
      "id": "mggex54",
      "author": "GollyWow",
      "body": "Every time I see this kind of report I am so thankful I have an old Canon inkjet.  And aftermarket cartridges.",
      "score": 2,
      "created_utc": 1741320464.0,
      "replies": []
    },
    {
      "id": "mgismxn",
      "author": "llDurbinll",
      "body": "You either die a hero or you live long enough to see yourself become a villain.",
      "score": 2,
      "created_utc": 1741360680.0,
      "replies": []
    },
    {
      "id": "mg9idqp",
      "author": "sonic10158",
      "body": "![gif](giphy|d8Pc2OZPJ1isbZkKki|downsized)",
      "score": 5,
      "created_utc": 1741228868.0,
      "replies": []
    },
    {
      "id": "mga7f4h",
      "author": "ertbvcdfg",
      "body": "HP did that to me twice! And through printer in dumpster.",
      "score": 3,
      "created_utc": 1741238777.0,
      "replies": [
        {
          "id": "mgaj55d",
          "author": "NerdBot9000",
          "body": "Which dumpster did you throw it through?",
          "score": 3,
          "created_utc": 1741244760.0,
          "replies": [
            {
              "id": "mgaokvj",
              "author": "ertbvcdfg",
              "body": "Yours",
              "score": -4,
              "created_utc": 1741247907.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mga1cy1",
      "author": "None",
      "body": "[deleted]",
      "score": 3,
      "created_utc": 1741236123.0,
      "replies": [
        {
          "id": "mgb22wm",
          "author": "yaypal",
          "body": "I absolutely give Brother the benefit of the doubt here over randos because of their track record. They're like Costco, everybody else in the industry choose to be pieces of shit for more money and companies like these stand out as ones who follow the ethical practice when given the choice.",
          "score": 3,
          "created_utc": 1741256294.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mga2ulp",
      "author": "petmechompU",
      "body": "Et tu, Brother?\n\nOh good, not.",
      "score": 3,
      "created_utc": 1741236763.0,
      "replies": []
    },
    {
      "id": "mgahwlg",
      "author": "AdoptedRanger",
      "body": "Love them or hate them, they're still family",
      "score": 4,
      "created_utc": 1741244076.0,
      "replies": []
    },
    {
      "id": "mg9bstv",
      "author": "Aero_naughty",
      "body": "brother got us bricked up",
      "score": 2,
      "created_utc": 1741226587.0,
      "replies": []
    },
    {
      "id": "mgaveiu",
      "author": "None",
      "body": "Brother,eew. What's this? Eew",
      "score": 4,
      "created_utc": 1741252151.0,
      "replies": []
    },
    {
      "id": "mgaib9a",
      "author": "yarash",
      "body": "I dont think I've ever seen a printer that automatically updated its firmware without asking for approval. Sure, potentially, whatever software is installed on a pc/server, but never the firmware.",
      "score": 2,
      "created_utc": 1741244297.0,
      "replies": [
        {
          "id": "mgavumn",
          "author": "sid2k",
          "body": "They have auto updates on by default.",
          "score": 2,
          "created_utc": 1741252427.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mg9it5l",
      "author": "Trixielarue2020",
      "body": "That’s one hell of a coincidence, then, huh?",
      "score": 3,
      "created_utc": 1741229022.0,
      "replies": [
        {
          "id": "mga4x6p",
          "author": "im_thatoneguy",
          "body": "I can be not-a-coincidence and also not deliberate.\n\nIf the 3rd party ink cartridges are untested a firmware update could brick your printer even if it’s not a “if 3rdParty then { brick(); }” line of code just because the cartridge is non standard and therefore is doing something the firmware doesn’t expect.",
          "score": 8,
          "created_utc": 1741237665.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mga270q",
      "author": "Samurai_Stewie",
      "body": "Who started this rumor? HP?\n\n![gif](giphy|l2Z84eFooeHJu)",
      "score": 3,
      "created_utc": 1741236481.0,
      "replies": [
        {
          "id": "mgb59in",
          "author": "None",
          "body": "You really think corporations are your buddy?\n\nHere's what brother emailed me back after I asked why I couldn't just print black and white docs.\n\n\"Basically, your Brother machine is designed to stop ALL printing operations when any of the ink cartridges are empty. This is to ensure the life of the print head and maintain premium print quality. If the unit were to continue printing, print jobs and cleaning cycles would suck air from the empty cartridge and damage the print head.\"",
          "score": 1,
          "created_utc": 1741258181.0,
          "replies": [
            {
              "id": "mgbwabh",
              "author": "Samurai_Stewie",
              "body": "Get a brother color laser printer and you can print in black and white for years with no issues and it doesn’t use any of your color toner.\n\nThe issue is ink printers in general.",
              "score": 1,
              "created_utc": 1741269893.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mg9d638",
      "author": "cmdrtheymademedo",
      "body": "Nah they bricked them just like every other company because they don’t want you using third party ink    Pretty sure there’s even a clause in the terms of service about it       I call shenanigans",
      "score": 2,
      "created_utc": 1741227061.0,
      "replies": [
        {
          "id": "mgahk3r",
          "author": "nicuramar",
          "body": "You know this because… you’re a psychic?",
          "score": 2,
          "created_utc": 1741243886.0,
          "replies": [
            {
              "id": "mgb5eie",
              "author": "None",
              "body": "From brother customer support:\n\nBasically, your Brother machine is designed to stop ALL printing operations when any of the ink cartridges are empty. This is to ensure the life of the print head and maintain premium print quality. If the unit were to continue printing, print jobs and cleaning cycles would suck air from the empty cartridge and damage the print head.\n\n\nThird party ink doesn't have the chip so brother can't see ink levels. So the printer will also refuse to print.",
              "score": 0,
              "created_utc": 1741258262.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mg9iu4m",
      "author": "xbbgun",
      "body": "But the shareholders Bob who's helping them out!",
      "score": 1,
      "created_utc": 1741229031.0,
      "replies": []
    },
    {
      "id": "mga4b4d",
      "author": "stickybond009",
      "body": "Bro",
      "score": 1,
      "created_utc": 1741237394.0,
      "replies": []
    },
    {
      "id": "mgaepj5",
      "author": "rh130",
      "body": "I was about to buy a new color laser jet printer.   I decided to buy a twelve year old one on eBay instead.  Ridiculous what these companies are doing these days.",
      "score": 1,
      "created_utc": 1741242351.0,
      "replies": []
    },
    {
      "id": "mgam0x7",
      "author": "spacedublin",
      "body": "Had to downgrade mine a few months back, was a pain in the ass. Works great now, just blocked updates been fine ever since, minus the usual printer being a printer issues.",
      "score": 1,
      "created_utc": 1741246406.0,
      "replies": []
    },
    {
      "id": "mgark4n",
      "author": "ConnorFin22",
      "body": "Xerox it is",
      "score": 1,
      "created_utc": 1741249719.0,
      "replies": []
    },
    {
      "id": "mgasn5t",
      "author": "34TH_ST_BROADWAY",
      "body": "Yeah pretty suspicious wording.",
      "score": 1,
      "created_utc": 1741250405.0,
      "replies": []
    },
    {
      "id": "mgatiwv",
      "author": "MisterStorage",
      "body": "I had trouble with some E-Z Ink color toner cartridges in my L3770CDW a few years ago, seemingly after a firmware update. After unsuccessfully trying various things I contacted E-Z Ink. They promptly sent free replacement cartridges that worked and I haven’t had a problem since. Will be on the lookout for any new glitches.",
      "score": 1,
      "created_utc": 1741250973.0,
      "replies": []
    },
    {
      "id": "mgaygfu",
      "author": "None",
      "body": "I own a L3770cdw and im quite happy. Hopefully they don’t fuckup",
      "score": 1,
      "created_utc": 1741254066.0,
      "replies": []
    },
    {
      "id": "mgb3os4",
      "author": "ThirtyMileSniper",
      "body": "Ah shit. Brother as well?",
      "score": 1,
      "created_utc": 1741257256.0,
      "replies": []
    },
    {
      "id": "mgb3v1y",
      "author": "biirudaichuki",
      "body": "Did I just read «Brother turns heel»? Good enough for me, 10/10 article!",
      "score": 1,
      "created_utc": 1741257361.0,
      "replies": []
    },
    {
      "id": "mgb4sv5",
      "author": "yantheman3",
      "body": "Damn I was just looking for color laser printers from Brother too. Guess I'll buy something else.",
      "score": 1,
      "created_utc": 1741257914.0,
      "replies": []
    },
    {
      "id": "mgb7f8p",
      "author": "Dalton387",
      "body": "You know, if third party ink was actually an issue, they’d be happy if you used it. It would mess up your printer, they can say it voids the warranty, and you need to buy a new one.",
      "score": 1,
      "created_utc": 1741259418.0,
      "replies": []
    },
    {
      "id": "mgb7rl7",
      "author": "Desert-Noir",
      "body": "OP’s brother is a real dick!",
      "score": 1,
      "created_utc": 1741259613.0,
      "replies": []
    },
    {
      "id": "mgb8xh6",
      "author": "KTMan77",
      "body": "The after market ink cartridges I bought online don't work in the brother printer I just bought. It's the newer version of their ink jet with faxing. They physically fit in and when one is plugged in it see it but then immediately tell you to change it when the door is closed. ",
      "score": 1,
      "created_utc": 1741260247.0,
      "replies": []
    },
    {
      "id": "mgberno",
      "author": "Darksol503",
      "body": "Dude tell your mom….. /s",
      "score": 1,
      "created_utc": 1741263135.0,
      "replies": []
    },
    {
      "id": "mgbhx4j",
      "author": "Kuzkuladaemon",
      "body": "No it's 100% true. Fuckin scumbags.",
      "score": 1,
      "created_utc": 1741264524.0,
      "replies": []
    },
    {
      "id": "mgbi2me",
      "author": "puntinoblue",
      "body": "Mine works fine with third party ink: HP disinformation warfare perhaps ",
      "score": 1,
      "created_utc": 1741264589.0,
      "replies": []
    },
    {
      "id": "mgbo1xh",
      "author": "spartys15",
      "body": "They did it",
      "score": 1,
      "created_utc": 1741266987.0,
      "replies": []
    },
    {
      "id": "mgbubgt",
      "author": "SyxxFtH8",
      "body": "That doesn't work for me, Brother.",
      "score": 1,
      "created_utc": 1741269214.0,
      "replies": []
    },
    {
      "id": "mgbvqr2",
      "author": "trumpvid-19",
      "body": "That’s why I will hang onto my old printer as long as I can",
      "score": 1,
      "created_utc": 1741269705.0,
      "replies": []
    },
    {
      "id": "mgbx3xu",
      "author": "chumlySparkFire",
      "body": "We trust Brother shit printer maker ?   Not so much",
      "score": 1,
      "created_utc": 1741270175.0,
      "replies": []
    },
    {
      "id": "mgbyt79",
      "author": "yulbrynnersmokes",
      "body": "It prints. It scans. It copies. It faxes 📠 \n\nWhat is new firmware gonna do for me?",
      "score": 1,
      "created_utc": 1741270743.0,
      "replies": []
    },
    {
      "id": "mgfto6m",
      "author": "roadrunner440x6",
      "body": "I stopped using my Brother MFC-J895DW after about the third time.  EVERY time I go to print something I  need to buy new ink cartridges.  I have never bought 3rd-party, always Brother brand.  And every time I need to print 1-2 pages it requires new cartridges.  I have stopped printing from home, and go to the library and use their printers for about 15 cents a copy.",
      "score": 1,
      "created_utc": 1741312795.0,
      "replies": []
    },
    {
      "id": "mgfw2fz",
      "author": "walkerofwabes",
      "body": "This is why I won’t ever by an HP printer again. Brother now too. Should be illegal",
      "score": 1,
      "created_utc": 1741313637.0,
      "replies": []
    },
    {
      "id": "mgg7fdq",
      "author": "None",
      "body": "I’m going to complain to Father",
      "score": 1,
      "created_utc": 1741317656.0,
      "replies": []
    },
    {
      "id": "mggdqis",
      "author": "pak9rabid",
      "body": "But they were, all of them, deceived, for another firmware was made.\n\nIn the land of Bridgewater, in the conference rooms of HQ, the Dark Manager conversed in secret a master strategy, to betray all users. And into this strategy he poured his cruelty, his malice and his will to dominate all Brother printer ink.",
      "score": 1,
      "created_utc": 1741320005.0,
      "replies": []
    },
    {
      "id": "mgjp1ur",
      "author": "azure_apoptosis",
      "body": "I’m just confused as to why people are upset. I’ve had a brother MCF model for a while and hated it the whole time.",
      "score": 1,
      "created_utc": 1741370009.0,
      "replies": []
    },
    {
      "id": "mgl2dve",
      "author": "cubert73",
      "body": "Hmm... I have noticed the colors on my Brother color laser are pretty wonky... I'll need to do more testing.",
      "score": 1,
      "created_utc": 1741385004.0,
      "replies": []
    },
    {
      "id": "mgongv3",
      "author": "Fit-Anything1417",
      "body": "this is why I never update any of my stuff\n\nfrom phones to laptops even on my brother 420\n\nI mean I get that it for security but screw that",
      "score": 1,
      "created_utc": 1741442800.0,
      "replies": []
    },
    {
      "id": "mgp2vqs",
      "author": "Real_TSwany",
      "body": "fuck Brother. I bought their first party ink, replaced all the cartridges with the brand new stuff, and it immediately told me i was out of yellow and cyan. an absolute joke",
      "score": 1,
      "created_utc": 1741448132.0,
      "replies": []
    },
    {
      "id": "mg9tnsl",
      "author": "pirate135246",
      "body": "Enshitification strikes again",
      "score": 1,
      "created_utc": 1741233001.0,
      "replies": []
    },
    {
      "id": "mg9m786",
      "author": "Fred_Oner",
      "body": "Well hopefully they fix it if they're deny it then, you can't fool people just by saying \"no you.\" The fact that it works at time is wild, and I'm already in a boycott mood so adding brother to the list will be easy af. (:",
      "score": 1,
      "created_utc": 1741230232.0,
      "replies": []
    },
    {
      "id": "mg9uesu",
      "author": "rasalghul4leader",
      "body": "What are you gonna do, sue me?\n\nGood luck printing it",
      "score": 1,
      "created_utc": 1741233294.0,
      "replies": []
    },
    {
      "id": "mgax6zy",
      "author": "One-Earth9294",
      "body": "The key to a happy life is just never needing to use a printer for anything.",
      "score": 1,
      "created_utc": 1741253268.0,
      "replies": []
    },
    {
      "id": "mgbx3o9",
      "author": "InkyBlacks",
      "body": "Not a fan of brother printers anymore.  Especially the color laser.  Quality is poor and they have no drivers for Mac or Windows.  It's all airprint for Mac.  Which means options like tray, papersize, etc are not available typically.  It's junk now.\n\n  \nBought a Canon laser.  Never had an issue with them and the print quality is 100X better.",
      "score": 1,
      "created_utc": 1741270172.0,
      "replies": []
    },
    {
      "id": "mgc4cle",
      "author": "Evening_Tree1983",
      "body": "I have to take the opportunity to say that despite the Reddit hivemind I've had an HP Office Jet for 7 years and it's worked perfectly for the whole time, I can print from any device, any issue is quickly resolved with a driver update, the ink, while expensive, hasn't gone up in cost. \n\nThis was the printer I could afford, and with it we launched a small business that literally saved us during the pandemic. Not saying they're the best brand ever but they are way over hated, and Brother isn't in everyone's budget.",
      "score": 1,
      "created_utc": 1741272520.0,
      "replies": []
    },
    {
      "id": "mggi6tc",
      "author": "dfwr",
      "body": "In the grand scheme of things, who the fuck cares about a cheap ass printer",
      "score": 1,
      "created_utc": 1741321792.0,
      "replies": []
    },
    {
      "id": "mg9o14e",
      "author": "AndYetAnotherUserID",
      "body": "Every f’n month my Brother ink jet starts beeping just begging to have a firmware update. Thankfully, it’s easy to press one key to deny. But even if I wanted the dang update, it’s nearly impossible to enter the “password” that’s attached to the rear in teeny tiny print using the printer toggle pad. Points off for nagging.",
      "score": 0,
      "created_utc": 1741230897.0,
      "replies": []
    },
    {
      "id": "mg9qdx6",
      "author": "GoochTwain",
      "body": "![gif](giphy|Q3Li1BpwTpTfq)",
      "score": 0,
      "created_utc": 1741231765.0,
      "replies": []
    },
    {
      "id": "mg9vbx6",
      "author": "Gr3yt1mb3rw0LF068",
      "body": "I had brother cartridges in it and it bricked mine. Looking at a eco tank should never have to worry aboot that again.",
      "score": 0,
      "created_utc": 1741233654.0,
      "replies": []
    },
    {
      "id": "mga0vxm",
      "author": "hanginglimbs",
      "body": "![gif](giphy|bhWobE8jkmGha)",
      "score": 0,
      "created_utc": 1741235921.0,
      "replies": []
    },
    {
      "id": "mg9ghuy",
      "author": "sexaddic",
      "body": "Who are you gonna believe? Me or your lying eyes?",
      "score": -1,
      "created_utc": 1741228213.0,
      "replies": []
    },
    {
      "id": "mg9ladb",
      "author": "LittleYelloDifferent",
      "body": "You’re brother sucks",
      "score": 0,
      "created_utc": 1741229902.0,
      "replies": []
    },
    {
      "id": "mg9o6xd",
      "author": "Joebranflakes",
      "body": "![gif](giphy|rYEAkYihZsyWs)",
      "score": 0,
      "created_utc": 1741230956.0,
      "replies": []
    },
    {
      "id": "mg9tclt",
      "author": "A_Concerned_Viking",
      "body": "Step-Brother vibes",
      "score": 0,
      "created_utc": 1741232881.0,
      "replies": []
    },
    {
      "id": "mg9yxwg",
      "author": "Zachisawinner",
      "body": "![gif](giphy|INFsxmaFWTn1u)",
      "score": 0,
      "created_utc": 1741235113.0,
      "replies": []
    },
    {
      "id": "mgb6xmr",
      "author": "Anony_Nemo",
      "body": "This is why nobody should allow anything but their computer (and then heavily moderate that as well.) to touch the internet at all by any connection methods, internet access for devices should be auto opt-out not auto opt-in for exactly this reason, connecting a device to the internet means the corporation assumes full remote control and ownership of the device and will do whatever they're told to do with them by the corporate heads, because from the company's perspective they still believe they own the device, and consider you, the actual owner, as a renter or subscriber, demoting you to someone who can be thrown out on a moment's notice.\n\nAlways be sure to block, or take the time to physically disable, (carefully so that you can reverse if absolutely needed.) devices from accessing the internet... the specter of malicious hacks etc. is a boogeyman used to scare & bully the Public into needless updates that load more bugs and backdoors into something rather than actually fix or repair any serious issue for it for the majority of the time.  Be aware of everything your devices do, what their microchips and circuit boards do, force background processes to show themselves and don't let even one data packet out of your sight if it can be helped, because companies can & will use whatever means they deem necessary to abuse you, the end-user, for their own enrichment, or even to be petty.  If they can break a device you purchased just to force you to buy another one, they will without a second thought, and care little for the aftermath.\n\nTo the above ends, there's videos on how to physically disable many things, from cameras to microphones and gps chips, but for software also you can learn how to equip your computer & router with a redirect/\"blocker\" called a \"hosts\" file, here's a guide on how to do that: https://archive.ph/GImk2 and, this is one of the best ones out there: https://archive.ph/saC7w along with https://archive.ph/3ftbp  Fo course you can use any text editor you like to go through the files and customize them as you like, you can also use a packet watcher/\"sniffer\" to see where bits of data go with websites you frequent to find out where ad etc. domains are, what they're called, and then add them to your hosts file for redirecting.  This of course can be added to a computer and to a router as well to add an additional layer of redirection protection, its not a perfect solve, but it helps.",
      "score": 0,
      "created_utc": 1741259138.0,
      "replies": []
    },
    {
      "id": "mg9p1ld",
      "author": "stlouisraiders",
      "body": "Well if you’re using ink then why buy a brother? They’re known for very cheap and long lasting laser printers. I’ve never seen an inkjet model in person.",
      "score": -4,
      "created_utc": 1741231270.0,
      "replies": [
        {
          "id": "mgahg52",
          "author": "cloud9ineteen",
          "body": "This is about color laser printers. By ink they mean toner.",
          "score": 1,
          "created_utc": 1741243826.0,
          "replies": []
        }
      ]
    }
  ]
}