{
  "post": {
    "title": "NVIDIA grants RTX 5060 drivers access to media willing to publish 'previews'",
    "author": "a_Ninja_b0y",
    "id": "1koygro",
    "score": 681,
    "created_utc": 1747503119.0,
    "selftext": "",
    "num_comments": 63,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1koygro/nvidia_grants_rtx_5060_drivers_access_to_media/"
  },
  "comments": [
    {
      "id": "mstuq65",
      "author": "Durahl",
      "body": "Everyone should just band together and Review it like: *\"Our testers cannot recommend it at this moment in time!\"*  \nNvidia: *\"But we haven't given you the drivers yet!?\"*  \nEveryone: \n\n![gif](giphy|6YNMn8b4O9IxW)",
      "score": 320,
      "created_utc": 1747505059.0,
      "replies": [
        {
          "id": "msuzk1t",
          "author": "Rabo_McDongleberry",
          "body": "Mad props for Simon Phoenix gif.",
          "score": 51,
          "created_utc": 1747518786.0,
          "replies": [
            {
              "id": "mswpk4q",
              "author": "GammaDealer",
              "body": "The murder/death/killer?!",
              "score": 11,
              "created_utc": 1747544266.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mswaf5q",
          "author": "BevansDesign",
          "body": "But if they badmouth the maker of a product (for good reason) then they won't get free stuff anymore. And that's exactly why companies give out free stuff in the first place.",
          "score": 10,
          "created_utc": 1747537046.0,
          "replies": []
        },
        {
          "id": "msx9tbb",
          "author": "howardhus",
          "body": "you underestimate how dependent people are on Nvidia.. also how dependent reviewers are on Nvidia.\n\n\nNvidia behaves this way because they have the muscle to do so.\n\nNvidia: \"You dont like it? just go to our competitors...\"\n\nYou:  \"wh- what competitors?? you dont have any!\"\n\n\nNvidia: \"EXACTAMUNDO!\"",
          "score": -6,
          "created_utc": 1747556310.0,
          "replies": [
            {
              "id": "mszroey",
              "author": "StarsMine",
              "body": "Amd has literally always been an option, and now so is Battlemage Intel.",
              "score": 2,
              "created_utc": 1747592464.0,
              "replies": []
            },
            {
              "id": "mszn63j",
              "author": "luttman23",
              "body": "Except the competitors are looking tasty at the moment, at the same time that Nvidia is looking pretty wank",
              "score": 2,
              "created_utc": 1747591047.0,
              "replies": [
                {
                  "id": "mt00tmn",
                  "author": "howardhus",
                  "body": "except: no they aint.\n\nNVidia is nr 1 at AI, linux and gaming.\nAMD is behing at Gaming and linux and almost nowhere in AI.\n\nIntel is sleeping on all of them. \n\nDo i wish it was different? sure! does it help to close my eyes and pretend? mybe not",
                  "score": -5,
                  "created_utc": 1747595397.0,
                  "replies": [
                    {
                      "id": "mt2htl9",
                      "author": "Francobanco",
                      "body": "Yes, nvidia number one at Linux\n\nAmd falling behind the the Linux Grand Prix\n\nThe way you talk about this doesn’t really make it sound like you know the market for GPUs very well",
                      "score": 1,
                      "created_utc": 1747627669.0,
                      "replies": [
                        {
                          "id": "mt31gvj",
                          "author": "howardhus",
                          "body": "Market... you mean the one where Nvidia is number one, AMD falls behind and Intels is just a speckle?\n\nhttps://www.fortunebusinessinsights.com/gaming-gpu-market-111215\n\n\nyes i do... and have the sources. \n\nyour argument is? right none.. you just came to write stuff. But maybe you have some sources",
                          "score": 1,
                          "created_utc": 1747638490.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mt1be33",
          "author": "cetootski",
          "body": "![gif](giphy|OrIA09Ue7r6EUOrMqm|downsized)",
          "score": 0,
          "created_utc": 1747610983.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msuynbj",
      "author": "PARANOIAH",
      "body": "Waste of sand.",
      "score": 63,
      "created_utc": 1747518469.0,
      "replies": []
    },
    {
      "id": "mstpffy",
      "author": "Hattix",
      "body": "Nvidia's really not proud of this one.",
      "score": 157,
      "created_utc": 1747503383.0,
      "replies": [
        {
          "id": "msw51lc",
          "author": "Takyomi",
          "body": "Yep, pretty shady tactic. Handing out early access only to friendly media who'll play ball with \"previews\" instead of honest reviews. They know what they're doing.",
          "score": 39,
          "created_utc": 1747534759.0,
          "replies": []
        },
        {
          "id": "msu1f7l",
          "author": "sargonas",
          "body": "They probably don’t even care enough to have an opinion. Gaming/Desktop gpus are a fraction of a fraction of their income these days compared to enterprise sales.",
          "score": -76,
          "created_utc": 1747507298.0,
          "replies": [
            {
              "id": "msu1o6y",
              "author": "Hattix",
              "body": "22% of revenue last I checked.\n\nThat's not a majority, but it is also not a fraction of a fraction.",
              "score": 76,
              "created_utc": 1747507382.0,
              "replies": [
                {
                  "id": "msvcka2",
                  "author": "Pluckytoon",
                  "body": "22% means that they prob consider it quite important, it’s a fucking lot of money",
                  "score": 28,
                  "created_utc": 1747523506.0,
                  "replies": [
                    {
                      "id": "msvpebn",
                      "author": "GeorgeRRZimmerman",
                      "body": "$11.35 billion in FY 2025. \n\nYep, fraction of a fraction for sure.",
                      "score": 12,
                      "created_utc": 1747528363.0,
                      "replies": []
                    },
                    {
                      "id": "msxlghb",
                      "author": "TragiccoBronsonne",
                      "body": "Maybe they should stop fucking around then. Oh wait, people are still buying? Then maybe they won't.",
                      "score": -1,
                      "created_utc": 1747563653.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msu94z6",
                  "author": "sargonas",
                  "body": "As of last quarter their gaming desktop GPUs revenue, specific way, was 6.8%. While reports don’t indicate with the exact profit from that revenue is, it has to be assumed it’s 3% or less. Their datacenter revenue is 90% of revenue as well.\n\nIn the last two years their total revenue has gone from 7 Billion to 42, 38 of that 42 billion of that is data center/enterprise sales.\n\nThe explosive growth of enterprise/data center sales means that they could take a huge hit on consumer GPUs over 4 fiscal quarters, and still come out higher than they started a fiscal year and meet most of their growth expectations by making up the difference in enterprise sales. The exponential growth, and the seemingly continualness of it as of last quarter, speaks to this.",
                  "score": 5,
                  "created_utc": 1747509912.0,
                  "replies": [
                    {
                      "id": "msvla9h",
                      "author": "Bloody_Sunday",
                      "body": "That doesn't mean they are disregarding their prestigious leading position in gaming GPUs at all.\n\nI hope you don't actually mean or think that Nvidia will ignore its years-long leading position in GPU sales, and its considerable associated revenue and prestige. Or that it has any intention of giving it up to its competitor(s).\n\nThere's no way this market position and revenue can be considered to be either negligible or even worse, one to simply give up.",
                      "score": 7,
                      "created_utc": 1747526724.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "msu3w0h",
                  "author": "techieman33",
                  "body": "That’s revenue, not profit. And I’m guessing they make much higher profit margins on the AI stuff. Wouldn’t be surprised if graphics cards were closer to 5% of actual profits.",
                  "score": -10,
                  "created_utc": 1747508136.0,
                  "replies": [
                    {
                      "id": "msu6ogi",
                      "author": "zoobrix",
                      "body": "Their consumer graphics cards were 13% of total revenue so in terms of profit it would almost certainly be less than 5% of their total profits but if Nvidia suddenly lost it all somehow losing 13% of that revenue and the corresponding profits would make for a brutal year financially and their stock price would take a huge hit. Now given the lack of competition that's not going to happen but when the market expects constant growth losing over 10% of your business would still be considered a big hit regardless of how well other divisions were doing.",
                      "score": 3,
                      "created_utc": 1747509077.0,
                      "replies": []
                    },
                    {
                      "id": "msu48t0",
                      "author": "ItsAMeUsernamio",
                      "body": "Big chunk of that would also be from the Switch and from this year Switch 2.",
                      "score": 2,
                      "created_utc": 1747508254.0,
                      "replies": []
                    },
                    {
                      "id": "msu4m18",
                      "author": "Hattix",
                      "body": "Yes, absolutely.\n\nTheir game is still selling silicon, so they don't want to flood the market with H100s, as then the price customers are willing to pay will drop.\n\nIn GAAP you cannot go from \"this product line\" to \"5% of actual profits\" when the same overheads and R&D are responsible for all product lines.",
                      "score": 2,
                      "created_utc": 1747508377.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msvtfc2",
      "author": "jjayzx",
      "body": "Before you could just slap the card ID into the ini file and install the driver. Can you not do this anymore?",
      "score": 25,
      "created_utc": 1747529987.0,
      "replies": [
        {
          "id": "msw42dg",
          "author": "Wahjahbvious",
          "body": "Oh, man. Memory unlocked. It's been a hot minute since I last felt a need to do that.",
          "score": 18,
          "created_utc": 1747534347.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mszt3hi",
      "author": "AEternal1",
      "body": "This is how you get shill only content creators that nobody wants to watch",
      "score": 3,
      "created_utc": 1747592917.0,
      "replies": []
    },
    {
      "id": "mszly1d",
      "author": "brand_momentum",
      "body": "Absolutely shameful, can't believe how people still bend over for Nvidia...",
      "score": 3,
      "created_utc": 1747590672.0,
      "replies": []
    },
    {
      "id": "mt15c43",
      "author": "jcdoe",
      "body": "I’m guessing they’re using frame gen and AI upscaling to replace actual cores in budget cards. \n\nMakes sense if you’ve never played a video game.  Why cram all of those expensive CUDA cores onto your GPU when you can use AI?  Last I heard, frame gen can make 2 frames out of every 1, and 720p upscales to 1080p nicely.  So all you should really need to manufacture are cards that can generate 10 FPS @ 720p.  We can make those hella cheap and make a fortune! /s\n\nYeah, these guys really suck.  They’re controlling the reviews because they don’t want people to see the sleight of hand under the hood.  \n\nThat RX 7900 XTX looks better and better each day…",
      "score": 3,
      "created_utc": 1747608779.0,
      "replies": []
    },
    {
      "id": "msv8puh",
      "author": "shotouw",
      "body": "As Somebody with a small Budget who was waiting for the 5060 non ti to finally replace His gtx1070:\nIf they are that Desperate to influence the early Test results, i smell Shit and i'll actually Take a Look at the Intel GPUs again. Already got Burned on the iirc gtx970 fiasco Back then .\nMy guess: either the drivers are Not good enough yet for non-dlss Games or the Performance in General is Just not sufficient without dlss, so they Limited the Game choice.",
      "score": 24,
      "created_utc": 1747522138.0,
      "replies": [
        {
          "id": "msvhhhe",
          "author": "LouBerryManCakes",
          "body": "What is your process of determining which words to capitalize and which to leave lower case? Random word in the middle of the sentence: capitalize that shit. Literally the word \"I\": nah fuck that leave it lower case.",
          "score": 83,
          "created_utc": 1747525273.0,
          "replies": [
            {
              "id": "mswy2u1",
              "author": "shotouw",
              "body": "Other commenter was right, German autocorrection",
              "score": 16,
              "created_utc": 1747549069.0,
              "replies": [
                {
                  "id": "msx0i8v",
                  "author": "LouBerryManCakes",
                  "body": "Thanks, didn't expect to learn something. Sorry for being a dick.",
                  "score": 14,
                  "created_utc": 1747550546.0,
                  "replies": [
                    {
                      "id": "msx0y01",
                      "author": "shotouw",
                      "body": "It's alright, with AI talking over comments and Posts, we try everything to categorize it for ourselves :)",
                      "score": 8,
                      "created_utc": 1747550811.0,
                      "replies": []
                    },
                    {
                      "id": "msxjn7e",
                      "author": "YeahlDid",
                      "body": "You weren't being a dick. It was a good question. Keep that spirit for next time you see one of those posts without any capital letters at all. Those are annoying.",
                      "score": 5,
                      "created_utc": 1747562546.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mswbbu5",
              "author": "Dere_",
              "body": "it's common for people from many other countries to do this when typing in english, especially germans! (a quick look at his profile i saw something about germany, so maybe he is from there!)",
              "score": 17,
              "created_utc": 1747537443.0,
              "replies": [
                {
                  "id": "mswm5vf",
                  "author": "LouBerryManCakes",
                  "body": "Thanks, I didn't know that.",
                  "score": 6,
                  "created_utc": 1747542521.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msvo84d",
          "author": "swisstraeng",
          "body": "did you consider the intel B580? What's your CPU?",
          "score": 8,
          "created_utc": 1747527888.0,
          "replies": [
            {
              "id": "mswy9hz",
              "author": "shotouw",
              "body": "That's my consideration yeah. Got a 5700x3d so that should (roughly) be a fit",
              "score": 4,
              "created_utc": 1747549182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msvufoq",
          "author": "Haelphadreous",
          "body": "It's probably just that 8GB is no longer enough memory, I honestly thought it was fine for 1080p and some 1440p gaming until the 5060 Ti reviews came out and I saw just how bad the 8 GB 5060 Ti was even at 1080p in a surprising number of games. I honestly didn't expect 8gb to have issues like this for at least a few more years.\n\n[https://www.techspot.com/review/2980-nvidia-geforce-rtx-5060-ti-8gb/](https://www.techspot.com/review/2980-nvidia-geforce-rtx-5060-ti-8gb/)\n\nThe Intel B580 is a decent choice if you can find it for close to MSRP and your CPU is newer and fairly high end, it has some CPU overhead issues though so older CPU's really seem to hold it back in some games.\n\nMaybe the 9060 XT 16 GB is going to have an aggressive price point and be good and have decent stock and sell for close to MSRP, that's a lot of maybes but it looks like we should find out a lot more in the near future.\n\n[https://www.pcgamer.com/hardware/graphics-cards/amd-all-but-confirms-the-rx-9060-xt-will-be-announced-on-may-21/](https://www.pcgamer.com/hardware/graphics-cards/amd-all-but-confirms-the-rx-9060-xt-will-be-announced-on-may-21/)\n\nOther than that you could hunt for a bargain last gen or even 2 gen old card, as long as your getting at least 12GB of memory it could be a decent option. A quick check on BestBuy's website found some 6800 (non XT) 16 gb cards on clearance for $386, as long as you have a decent PSU and don't mind that it's not super power efficient it's a pretty solid card.\n\n\\*Edit - I also found some new 3060 12GB cards going for right around $300, amazing how long certain cards can stay relevant.\n\nGood luck with things I hope you manage to find a good budget option that will last you for a while.",
          "score": 11,
          "created_utc": 1747530395.0,
          "replies": [
            {
              "id": "msxcmf6",
              "author": "shotouw",
              "body": "Thank you so much for all that additional info!   \nDidn't even have the 9060 xt on my watchlist but as I will wait for benchmarks of the 5060 anyways, I can just as well wait for what AMD has to offer and if they are trying to milk the dried up market or if they try to undercut Nvidia. \n\nFor older gens, PSU is decent but my girlfriend ist gaming as well so the heat-production in a smaller room is rather the problem. I also don't want to miss out on newer features so latest generation definetly has it pros.\n\nFor CPU, im running a 5700x3D so that should still be decent to deal with some overhead.  \nIm also gaming in 1080p so far, hoping to get some 60fps without DLSS to hopefully get to 144fps with DLSS, depending on the game.   \nBut the 8GB will be limiting at some point as, in addition to textures, the AI stuff should use some VRAM as well, right?   \nBut I'll wait for the 5060 benchmarks as well, just a shame they dont have a 12GB Vram version of the non ti but I guess, that would screw with their 5060ti 8GB version.",
              "score": 2,
              "created_utc": 1747558101.0,
              "replies": [
                {
                  "id": "msxfoo8",
                  "author": "rincewin",
                  "body": ">so the heat-production in a smaller room is rather the problem.\n\n> I also don't want to miss out on newer features so latest generation definetly has it pros.\n\nBased on these viewpoints I would go with the 5060ti 16GB. Yeah I know its a good 120-150€ pricier than the regular 5060, but in the long term, this would be the safest investment due to the bigger VRAM and the feature set.\n\nOr you can wait another year and hope for a 5060 super with 12GB VRAM.",
                  "score": 2,
                  "created_utc": 1747560045.0,
                  "replies": []
                },
                {
                  "id": "mt0u3so",
                  "author": "Haelphadreous",
                  "body": "Depending on how you end up deciding to go, the B580 seems to run reasonably well on a 5700x3D, [https://www.youtube.com/watch?v=00GmwHIJuJY](https://www.youtube.com/watch?v=00GmwHIJuJY) Hardware unboxed video, they test the 5700x3D in the second half, it's a solid budget option if you can find one close to MSRP which is $249. 12GB of memory is a huge bonus, in the MSRP price range, the card is not perfect the reviews I have looked at show performance being very good in some games and kinda low in others, but near MSRP it's definitely excellent value. \n\nThe 9060 XT is 100% on my radar, best case looks like performance only a bit lower than the 5060 Ti, but in a rumored MSRP range between $329 and $379 for the 16 GB version, with significant stock for launch, but how much of that is accurate is still very much up in the air, but if it's all true it might be a really strong value option.\n\nAFAIK GDDR7 has 3 GB modules available, but they are currently pretty scarce and prices are elevated, when/if production ramps up and prices normalize it would make sense to start seeing Nvidia offer 12 GB versions of their 8 GB cards and 24 GB versions of their 16 GB cards, but that might be a while.",
                  "score": 2,
                  "created_utc": 1747604848.0,
                  "replies": [
                    {
                      "id": "mt6hw0v",
                      "author": "shotouw",
                      "body": "Just checked Back with the b580, seems Like it would Run decent with the 5700x3D BUT my Board Has 16 pcie3 lanes of which the b580 would only use 8.\nSo that would be crap again. Ah i dont Like this at all lol, seems Like a bigger Upgrade would be needed for decent Performance. So now the 9060xt is my Last Hope for now.",
                      "score": 1,
                      "created_utc": 1747685326.0,
                      "replies": [
                        {
                          "id": "mtb2muv",
                          "author": "Haelphadreous",
                          "body": "That's kind of a bummer, rumors are that the 9600 XT will have a full 16 lanes [https://www.tweaktown.com/news/105215/amd-rx-9060-xt-gpu-rumored-to-have-16-pcie-5-0-lanes-avoiding-nvidias-rtx-5060-8gb-blunder/index.html](https://www.tweaktown.com/news/105215/amd-rx-9060-xt-gpu-rumored-to-have-16-pcie-5-0-lanes-avoiding-nvidias-rtx-5060-8gb-blunder/index.html) hopefully we will have full details about the card in the near future.",
                          "score": 1,
                          "created_utc": 1747753674.0,
                          "replies": [
                            {
                              "id": "mtb6prg",
                              "author": "shotouw",
                              "body": "Lets Hope there is a good pricetag on it!",
                              "score": 2,
                              "created_utc": 1747754867.0,
                              "replies": [
                                {
                                  "id": "mtei6kz",
                                  "author": "Haelphadreous",
                                  "body": "I am pretty sure it's going to have a good MSRP, I just hope it's actually available for near MSRP this time.",
                                  "score": 1,
                                  "created_utc": 1747792181.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mtf7vmm",
                          "author": "Haelphadreous",
                          "body": "[https://www.tomshardware.com/pc-components/gpus/amd-radeon-rx-9060-xt-launches-on-june-5-starting-at-usd299](https://www.tomshardware.com/pc-components/gpus/amd-radeon-rx-9060-xt-launches-on-june-5-starting-at-usd299)\n\nGood news it looks like it's 16x, MSRP seems ok if the card actually sells for close to it.",
                          "score": 1,
                          "created_utc": 1747802601.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msw00ij",
          "author": "aToiletSeat",
          "body": "Go Intel. It will probably be as good or better than a 5060 and you don't support this bullshit",
          "score": 5,
          "created_utc": 1747532671.0,
          "replies": []
        },
        {
          "id": "mswdtdo",
          "author": "typeguyfiftytwix",
          "body": "If you're desperate enough to buy intel GPUs why not just buy an AMD one? They actually work and aren't from a company with recent legendary class fuckups.",
          "score": 7,
          "created_utc": 1747538547.0,
          "replies": [
            {
              "id": "msx2uzx",
              "author": "mrthenarwhal",
              "body": "It never ceases to amaze me how people will do anything and everything before they consider buying an AMD GPU",
              "score": 8,
              "created_utc": 1747551972.0,
              "replies": [
                {
                  "id": "msxbvcb",
                  "author": "shotouw",
                  "body": "As answered to the guy above, the reason is the 12GB Vram of the B580 that no AMD card (IIRC) can offer at that price point.   \nYes, the 5060 would also only have 8GB but I'd consider it if the performance is still decent enough, as they offer better drivers (for now) than intel.",
                  "score": 2,
                  "created_utc": 1747557627.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msxbqlz",
              "author": "shotouw",
              "body": "VRAM is the answer. The B580 is (IIRC) the only GPU that offers 12GB at that price point (german prices)",
              "score": 2,
              "created_utc": 1747557543.0,
              "replies": []
            },
            {
              "id": "msxeax9",
              "author": "rincewin",
              "body": "I've looked up the prices in Germany; you can have a [B580](https://www.mindfactory.de/search_result.php?search_query=intel+arc+b580) for ~300€ or less, while the cheapest [7700XT](https://www.mindfactory.de/search_result.php/search_query/radeon+rx+7700xt/listing_sort/6) is 400+€. And according to TechPowerUp, the 7700XT only 10 percent faster",
              "score": 1,
              "created_utc": 1747559161.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msx7jgc",
          "author": "k0c-",
          "body": "these are all binned down higher end nvidia cards, basically garbage.",
          "score": 1,
          "created_utc": 1747554891.0,
          "replies": []
        },
        {
          "id": "mswgjao",
          "author": "tlst9999",
          "body": "Just buy a 4060. You're on a budget anyway.",
          "score": -3,
          "created_utc": 1747539796.0,
          "replies": [
            {
              "id": "msxbnks",
              "author": "shotouw",
              "body": "Na, no reason to go back to an older generation imho. With all the new stuff (like the new DLSS version) mostly being supported by at most 1 older generation, id rather go new gen.",
              "score": 2,
              "created_utc": 1747557490.0,
              "replies": [
                {
                  "id": "msy6jxp",
                  "author": "sh1boleth",
                  "body": "But a 4060 supports the latest DLSS? Even the 20 series does.\n\nThe only difference is Frame Gen, 3X and 4x on 50 series. Only 2x on 40 series (not present on 30 or 20)",
                  "score": 1,
                  "created_utc": 1747573886.0,
                  "replies": [
                    {
                      "id": "msyc40h",
                      "author": "shotouw",
                      "body": "Yep it does but i guess whatever the next Feature is, it might be in the 60 and 50 series with the 40 Not supported. So id rather get a 50 series :)",
                      "score": 1,
                      "created_utc": 1747575981.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mt55hio",
      "author": "trekxtrider",
      "body": "Kinda makes me want to make a list of all the media outlets that sold out for drivers, a dark list if you will, maybe even black.",
      "score": 2,
      "created_utc": 1747671086.0,
      "replies": []
    }
  ]
}