{
  "post": {
    "title": "Implantable device could save diabetes patients from dangerously low blood sugar | The new implant carries a reservoir of glucagon that can be stored under the skin and deployed during an emergency — with no injections needed.",
    "author": "chrisdh79",
    "id": "1mevjfj",
    "score": 196,
    "created_utc": 1754052348.0,
    "selftext": "",
    "num_comments": 38,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mevjfj/implantable_device_could_save_diabetes_patients/"
  },
  "comments": [
    {
      "id": "n6cab8m",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1754052348.0,
      "replies": []
    },
    {
      "id": "n6dbmu1",
      "author": "se7envii7",
      "body": "USA: $400,000\nRest of world: $5",
      "score": 33,
      "created_utc": 1754063581.0,
      "replies": []
    },
    {
      "id": "n6dqdc9",
      "author": "Key-Web5678",
      "body": "I've seen this before and I have questions:\n\nThe implant is good for what? Four doses? So what happens when you run out? Do you like get the old one removed and replaced?\n\nSeems insanely invasive.",
      "score": 10,
      "created_utc": 1754067833.0,
      "replies": [
        {
          "id": "n6e1qyn",
          "author": "TheShryke",
          "body": "I believe the idea is that this is just for an emergency situation, not routine doses. You would keep treating the condition normally but if something goes wrong this would kick in.",
          "score": 8,
          "created_utc": 1754071023.0,
          "replies": [
            {
              "id": "n6e6095",
              "author": "Key-Web5678",
              "body": "That breeds another question then. Glucagon has a shelf life.  Usually it's a year. So does that mean it has to be routinely replaced?",
              "score": -1,
              "created_utc": 1754072260.0,
              "replies": [
                {
                  "id": "n6e6b9c",
                  "author": "Severe-Caregiver4641",
                  "body": "Read the article. It says it would require yearly replacement and they are working on a multi dose reservoir. As someone with seizures related to blood sugar, this doesn't sound too invasive at all.",
                  "score": 12,
                  "created_utc": 1754072349.0,
                  "replies": []
                },
                {
                  "id": "n6e69c6",
                  "author": "TheShryke",
                  "body": "Did you read the article? The answer is in there.",
                  "score": 6,
                  "created_utc": 1754072334.0,
                  "replies": [
                    {
                      "id": "n6e6ipo",
                      "author": "Key-Web5678",
                      "body": "I'll read it again I might of missed it. I apologize for my mistake.",
                      "score": 2,
                      "created_utc": 1754072410.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n6itl4o",
          "author": "Slartibeeblebrox",
          "body": "Agreed. Why not build it into those blood sugar monitoring devices people wear on their arms as part of an insulin pump?",
          "score": 1,
          "created_utc": 1754140668.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6csxia",
      "author": "Asmarterdj",
      "body": "Now imagine how many lives you could same with the same device, but with Narcan for opioid overdoses triggered by low oxygen saturation.",
      "score": 5,
      "created_utc": 1754058220.0,
      "replies": [
        {
          "id": "n6dflsk",
          "author": "Rogendo",
          "body": "Or how many prisoners you can drug if it’s implanted when they are processed",
          "score": 1,
          "created_utc": 1754064723.0,
          "replies": []
        },
        {
          "id": "n6d9mai",
          "author": "MetaStressed",
          "body": "Patent that shit ASAP",
          "score": 0,
          "created_utc": 1754063008.0,
          "replies": [
            {
              "id": "n6d9y4i",
              "author": "Asmarterdj",
              "body": "Nah, I don’t want to make money off a idea to help people.",
              "score": 2,
              "created_utc": 1754063102.0,
              "replies": [
                {
                  "id": "n6dm2kv",
                  "author": "MetaStressed",
                  "body": "Then don’t. If you patent it you can gift it to a nonprofit and stop other unscrupulous types from taking advantage.",
                  "score": 2,
                  "created_utc": 1754066590.0,
                  "replies": [
                    {
                      "id": "n6dtrq5",
                      "author": "11b_Zac",
                      "body": "Isn't that what happened with insulin or something like that? Patented, given away for basically free for the benefit on mankind, then charged up what wazzu.",
                      "score": 2,
                      "created_utc": 1754068792.0,
                      "replies": []
                    },
                    {
                      "id": "n6hkvbz",
                      "author": "other_usernames_gone",
                      "body": "Patenting something is super expensive.\n\nPlus, the expensive part isn't the idea. It's doing the R&D to make it real.\n\nNormally medical patents aren't for the idea, it'll be for some key part of it. E.g. in this case the patent would be for a small implantable oxygen sensor. Insulin patents aren't for insulin nowadays, its for the specific method they're using to produce it. \n\nAlthough I'm guessing you having patented the broad strokes would stop someone else innovating on it without your permission, you'd need to check with a patent attorney.\n\nYou've got to design/source a low oxygen sensor small enough to be implanted. Then design the rest of the system to use that sensor to decide when to deploy the narcan. Then design a package for it that can be sterilised and implanted. \n\nThen comes testing. You have to get medical approval which means proving the device will never trigger for anything but an overdose (what if someone is hiking up a mountain? Will it trigger? What if someone drowns? Will it trigger and make the situation worse?). Is the dose right? Can you fit the right dose in your device? Is the right dose small enough to be implanted?\n\nFrom an ethics side would a patient having one of these mean they're more likely to overdose because they know the device will save them, making them less cautious?\n\nThen you've got to convince people to let this get implanted into them.\n\nNone of these problems are impossible to solve, but they're not cheap. A non profit wouldn't be able to afford it.\n\nThe chaotic neutral method is to just publicly publish the idea (which OP already has), you can't patent an idea that's already public so no-one else can patent it. While you avoid the cost of a patent lawyer. Although again they might just patent a key part of the more detailed design, like I mentioned earlier.\n\nAlso *maybe* the idea is unpatentable because it's now public knowledge, you'd need to check with a patent attorney.",
                      "score": 1,
                      "created_utc": 1754117422.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n6eky5u",
      "author": "UnlikelyOpposite7478",
      "body": "Imagine your pancreas just getting a tiny backup tank installed.",
      "score": 1,
      "created_utc": 1754076659.0,
      "replies": []
    },
    {
      "id": "n6enm53",
      "author": "AK_Sole",
      "body": "Attention doctors working in East Africa:\n\n•\t⁠Can I get one of these for my adoptive mother in Sauri, Kenya? She continues to have emergency room visits due to severe diabetic conditions. Docs there can’t seem to get her properly regulated/treated.\nI’m afraid for her life, and she’s a matriarch of her community—a powerful voice for positive change.\nWe do not want to lose her to something treatable.",
      "score": 1,
      "created_utc": 1754077457.0,
      "replies": []
    },
    {
      "id": "n6eyyxb",
      "author": "GrallochThis",
      "body": "Now do THC, I hate it when my blood levels get too low.",
      "score": 1,
      "created_utc": 1754080848.0,
      "replies": []
    },
    {
      "id": "n6ga30x",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1754096733.0,
      "replies": [
        {
          "id": "n6hfoyw",
          "author": "trustmeim18",
          "body": "If people have this fail, their blood sugar would be much lower than that. This would function when people are dangerously hypoglycemic, 180 is nbd",
          "score": 1,
          "created_utc": 1754114567.0,
          "replies": []
        },
        {
          "id": "n6hgucy",
          "author": "hindusoul",
          "body": "That’s gonna be a big nope",
          "score": 1,
          "created_utc": 1754115197.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6dzxaz",
      "author": "Tenletters_Long",
      "body": "How much?",
      "score": 0,
      "created_utc": 1754070509.0,
      "replies": [
        {
          "id": "n6e1hd6",
          "author": "TheShryke",
          "body": "Only an American would ask that",
          "score": 1,
          "created_utc": 1754070947.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6cocgc",
      "author": "bakeacake45",
      "body": "And what in hell makes you think an average American with diabetes can afford this.\n\nRemember when you see good news about medical advances, they are not for you. You will never be afforded the same care available to only 3% of Americans",
      "score": -8,
      "created_utc": 1754056872.0,
      "replies": [
        {
          "id": "n6cuf7g",
          "author": "wastedmytwenties",
          "body": "Well fuck the other 194 countries I guess?",
          "score": 14,
          "created_utc": 1754058653.0,
          "replies": []
        },
        {
          "id": "n6cr4na",
          "author": "TheShryke",
          "body": "There's always the rest of the world...",
          "score": 12,
          "created_utc": 1754057695.0,
          "replies": [
            {
              "id": "n6gh5lf",
              "author": "bakeacake45",
              "body": "With even our old allies shutting doors in the face of our dictator…not for long",
              "score": 1,
              "created_utc": 1754099353.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n6d6of5",
          "author": "pataconconqueso",
          "body": "Well people have diabetes in other countries that are not the US and that have affordable healthcare.",
          "score": 11,
          "created_utc": 1754062165.0,
          "replies": [
            {
              "id": "n6ghcib",
              "author": "bakeacake45",
              "body": "Too true!, but a large portion of Americans cannot. I suppose that’s ok with you?",
              "score": -1,
              "created_utc": 1754099425.0,
              "replies": [
                {
                  "id": "n6h603x",
                  "author": "pataconconqueso",
                  "body": "Well y’all voted yourself into that mess, it doesnt mean others in the world shouldnt have it because Americans cant",
                  "score": 2,
                  "created_utc": 1754109615.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n6d7248",
          "author": "Smerkabewrl420",
          "body": "r/americanproblems",
          "score": 8,
          "created_utc": 1754062274.0,
          "replies": []
        },
        {
          "id": "n6eua6p",
          "author": "According_Bid2084",
          "body": "Move to a not fascist country that cares enough for its people to offer health care …",
          "score": 1,
          "created_utc": 1754079453.0,
          "replies": []
        },
        {
          "id": "n6hxvre",
          "author": "Dapper_Otters",
          "body": "If Americans can't have it, no one can!",
          "score": 1,
          "created_utc": 1754125092.0,
          "replies": []
        }
      ]
    }
  ]
}