{
  "post": {
    "title": "Brain implant at UC Davis translates thoughts into spoken words with emotion | Creating natural speech from neural signals in milliseconds",
    "author": "chrisdh79",
    "id": "1lp2zsk",
    "score": 1533,
    "created_utc": 1751379817.0,
    "selftext": "",
    "num_comments": 93,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lp2zsk/brain_implant_at_uc_davis_translates_thoughts/"
  },
  "comments": [
    {
      "id": "n0ritep",
      "author": "whoisnumbertwo",
      "body": "No way could I ever have this in my head and be present in polite company. Straight up digital Tourette syndrome.",
      "score": 257,
      "created_utc": 1751380134.0,
      "replies": [
        {
          "id": "n0s55bp",
          "author": "Next_Firefighter7605",
          "body": "Imagine trying to shop and everyone has one of those going off.\n\n“I want pizza”\n\n“Broccoli”\n\n“Ew, what’s on that guys elbow!?”\n\n“Butts!”\n\n“99,98,97”\n\n“Baby shark do do do”",
          "score": 105,
          "created_utc": 1751386434.0,
          "replies": [
            {
              "id": "n0shdgo",
              "author": "AHRA1225",
              "body": "For any parent baby shark do do do is stuck forever",
              "score": 26,
              "created_utc": 1751389837.0,
              "replies": [
                {
                  "id": "n0u6hc6",
                  "author": "OsmeOxys",
                  "body": "It just keeps repeating *Baby shark do do do.* Non stop all day every day and every night. The more you hear it the deeper in your mind and now permanent it gets. *Baby shark do do do.* Your body failing you, you cannot control it. You cannot stop it. *Baby shark do do do*.",
                  "score": 9,
                  "created_utc": 1751407237.0,
                  "replies": [
                    {
                      "id": "n19g071",
                      "author": "Suthabean",
                      "body": "Ring ring ring ring ring ring ring .... BANANA PHOONNEEE.",
                      "score": 2,
                      "created_utc": 1751609244.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0t50mv",
              "author": "makemeking706",
              "body": "\"Damn, girl. You poop with that butt?\"\n\n\nWtf did you say to me? ",
              "score": 18,
              "created_utc": 1751396348.0,
              "replies": [
                {
                  "id": "n0ttm5y",
                  "author": "StinkyPeenky",
                  "body": "I bet that ass can fart 😈",
                  "score": 8,
                  "created_utc": 1751403391.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0tvwp2",
              "author": "FewHorror1019",
              "body": "Then they all change to \n\n“Baby shark do do do do do”",
              "score": 3,
              "created_utc": 1751404053.0,
              "replies": []
            },
            {
              "id": "n0shdh1",
              "author": "The_Barbelo",
              "body": "What do you think it would say with those of us who don’t have inner monologues?…I wonder if it’s it able to turn imagery into words as well?? Man, I don’t want to expose anyone to the hellscape that is my mind.",
              "score": 5,
              "created_utc": 1751389837.0,
              "replies": [
                {
                  "id": "n0tp9wl",
                  "author": "Starfox-sf",
                  "body": "You don’t have one?",
                  "score": 1,
                  "created_utc": 1751402167.0,
                  "replies": [
                    {
                      "id": "n0ts5tq",
                      "author": "The_Barbelo",
                      "body": "The brain implant or the inner monologue? lol. No, neither.",
                      "score": 1,
                      "created_utc": 1751402979.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0ssst6",
              "author": "skedone",
              "body": "To be fair I that is my train of thought 24/7 and I don't have a filter so chip would do nothing lol",
              "score": 1,
              "created_utc": 1751392911.0,
              "replies": []
            },
            {
              "id": "n0v2th1",
              "author": "scrangos",
              "body": "They would also trigger eachother into some more progressively demented spiral",
              "score": 1,
              "created_utc": 1751418182.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0sysmz",
          "author": "kalirion",
          "body": "From the article, this is triggered when the person is trying to speak, not just thinking thoughts.",
          "score": 13,
          "created_utc": 1751394593.0,
          "replies": [
            {
              "id": "n0tgexo",
              "author": "Hubbardia",
              "body": "Reading past the headline? Nyeh!",
              "score": 4,
              "created_utc": 1751399649.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0rke84",
          "author": "addamee",
          "body": "Hehehe yeah, it’s one part stuff of dreams, one part stuff of (my) nightmares ",
          "score": 5,
          "created_utc": 1751380601.0,
          "replies": []
        },
        {
          "id": "n0z29qo",
          "author": "the_rainy_smell_boys",
          "body": "Don’t give this to someone with intrusive thoughts OCD either",
          "score": 2,
          "created_utc": 1751475714.0,
          "replies": []
        },
        {
          "id": "n0sr553",
          "author": "ZeroCharistmas",
          "body": "Mine would be constantly making the noise that AI SpongeBob makes when he glitches. Not because the AI is actually glitching though, that's just what my brain feels like.",
          "score": 1,
          "created_utc": 1751392457.0,
          "replies": []
        },
        {
          "id": "n0ukbpy",
          "author": "Alienhaslanded",
          "body": "If I'm disabled and can barely move or talk, that's fine by me.",
          "score": 1,
          "created_utc": 1751411761.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0rhxjr",
      "author": "chrisdh79",
      "body": "From the article: A new technology developed at the University of California, Davis, is offering hope to people who have lost their ability to speak due to neurological conditions. In a recent clinical trial, a man with amyotrophic lateral sclerosis was able to communicate with his family in real time using a brain-computer interface (BCI) that translates his neural activity into spoken words, complete with intonation and even simple melodies.\n\nUnlike previous systems that convert brain signals into text, this BCI synthesizes actual speech almost instantaneously. The effect is a digital recreation of the vocal tract, enabling natural conversation with the ability to interrupt, ask questions, and express emotions through changes in pitch and emphasis. The system's speed – translating brain activity into speech in about one-fortieth of a second – means the user experiences little to no conversational delay, a significant improvement over older text-based approaches that often felt more like sending text messages than having a voice call.\n\nThe technology works by implanting four microelectrode arrays into the region of the brain responsible for speech production. These arrays record the electrical activity of hundreds of individual neurons as the participant attempts to speak. The neural data is then transmitted to external computers equipped with advanced artificial intelligence algorithms. These algorithms have been trained using data collected while the participant tried to say specific sentences displayed on a screen. By matching patterns of neural firing to the intended speech sounds at each moment, the system learns to reconstruct the user's voice from brain signals alone.\n\nOne of the remarkable features of the UC Davis system is its expressiveness. The participant was not only able to generate new words that the system had not encountered before, but also to modulate the tone of his synthesized voice to indicate questions or emphasize specific words.\n\nThe technology could even detect when he was trying to sing, allowing him to produce short melodies. In tests, listeners could understand nearly 60 percent of the synthesized words, a dramatic improvement over the 4 percent intelligibility when the participant attempted to speak unaided.",
      "score": 75,
      "created_utc": 1751379873.0,
      "replies": [
        {
          "id": "n0sk7cb",
          "author": "__redruM",
          "body": "That really sounds like science fiction.  I could imagine “yes” and “no” being possible, but they actually train an AI to recognize words not encountered previously.  Amazing bordering on unbelievable, but AI finally has a good application.",
          "score": 39,
          "created_utc": 1751390594.0,
          "replies": [
            {
              "id": "n0temn1",
              "author": "tempest_87",
              "body": "Ai solved the protein folding problem. So its already done something amazing and really good.\n\nRemember downloading a folding program that you could just run and help solve medical science problems? Remeber how it got pretty big then just suddenly disappeared? That's because AI solved the problem. Veritasium did a great video on it.",
              "score": 29,
              "created_utc": 1751399133.0,
              "replies": [
                {
                  "id": "n0z02rq",
                  "author": "blaizek90",
                  "body": "Folding@HOME on PS3 was so dope",
                  "score": 4,
                  "created_utc": 1751475104.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0u4wnj",
              "author": "hotlavatube",
              "body": "A decade or so back, I read about some research into using brain scanning/imaging for interrogation. They had hoped to recreate what images and words the person was thinking about. If I recall, they had limited success with massive caveats. If I recall correctly, the process required extensive training with willing subjects and was not generalizable. \n   \nThere was a [Ted Talk](https://www.youtube.com/watch?v=mMDuakmEEV4) on a similar subject.",
              "score": 3,
              "created_utc": 1751406754.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0uczpi",
          "author": "Fredasa",
          "body": "I like how even in 2025 we're pretty much left wanting, having to visualize mentally what the tech looks like in progress based on whatever brief description is provided, even though, you know, video has been a thing for a little while.",
          "score": 4,
          "created_utc": 1751409336.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0rlvsc",
      "author": "cbessette",
      "body": "Speaking as a somewhat old dude, controlling/ connecting to computers with THOUGHT was something I never could have imagined as a teen.  People always talk about \"In the future we will be able to...\".  \nThis kind of technology gives me the feeling of actually having arrived at \"the future\".\n\n*Any sufficiently advanced technology is indistinguishable from magic* \\-Arthur C. Clarke",
      "score": 38,
      "created_utc": 1751381039.0,
      "replies": [
        {
          "id": "n0s40fw",
          "author": "Hettie933",
          "body": "As another somewhat old person, fine but what about the jet packs;)",
          "score": 8,
          "created_utc": 1751386116.0,
          "replies": [
            {
              "id": "n0sl7wf",
              "author": "WldHunt",
              "body": "Unfortunately, we're far away from mass produced jetpacks, we have the technology (like there's a guy in Dubai flying around in a jetpack), but people can barely drive their cars, what do you think will happen when they start flying?",
              "score": 7,
              "created_utc": 1751390867.0,
              "replies": [
                {
                  "id": "n0smw0v",
                  "author": "Hettie933",
                  "body": "I think personal vehicles are a bad solution to most transportation problems. That said, if there were a quiet working jet pack with long range, I’d be willing to be that guinea pig;)",
                  "score": 2,
                  "created_utc": 1751391316.0,
                  "replies": [
                    {
                      "id": "n0t8k6t",
                      "author": "Whodisbehere",
                      "body": "Until some form of anti gravity is invented “quiet” and “jet pack” will almost certainly never be a thing, sadly. Moving air is loud.",
                      "score": 8,
                      "created_utc": 1751397369.0,
                      "replies": [
                        {
                          "id": "n0tqx55",
                          "author": "Hettie933",
                          "body": "Lucid dreaming it is, lol.",
                          "score": 2,
                          "created_utc": 1751402632.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n15rfds",
              "author": "Goddamn_Grongigas",
              "body": "Soon. (please)",
              "score": 2,
              "created_utc": 1751562908.0,
              "replies": []
            },
            {
              "id": "n0sxjq3",
              "author": "JohnnyOnslaught",
              "body": "We've had them for years.\n\nhttps://www.youtube.com/watch?v=sgtyHS59d_c",
              "score": 1,
              "created_utc": 1751394241.0,
              "replies": []
            },
            {
              "id": "n0s8b42",
              "author": "cbessette",
              "body": "I guess jet packs first appeared in the 1960s so while impressive, they still don't blow my mind like interfacing the human brain to machines.  That still seems like magic to me.    \n  \nI can see that this technology could evolve into so many boons for humanity.  Imagine if paralyzation could be cured? The blind to see again, the lame to walk?  Maybe even one day transfer consciousness?",
              "score": 1,
              "created_utc": 1751387327.0,
              "replies": [
                {
                  "id": "n0sm5gu",
                  "author": "Hettie933",
                  "body": "I don’t want to live forever, but I would like to fly before I go (and the jet packs available are not quite what I imagined as a child). I hope here in the US the war against science calms down a bit so we can have all these things and more.",
                  "score": 1,
                  "created_utc": 1751391117.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0s6ij7",
              "author": "wirebug201",
              "body": "And drinking champagne in my tux with a beautiful woman in my autonomous anti-gravity car?",
              "score": -1,
              "created_utc": 1751386820.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0squyk",
      "author": "None",
      "body": "What happens when you stop paying the subscription?",
      "score": 19,
      "created_utc": 1751392381.0,
      "replies": [
        {
          "id": "n0tqb3c",
          "author": "PlantAstronaut",
          "body": "Ads",
          "score": 9,
          "created_utc": 1751402459.0,
          "replies": [
            {
              "id": "n0ufmlq",
              "author": "Deadz315",
              "body": "Then you can no longer work because you don't have direct control over what you may say.",
              "score": 3,
              "created_utc": 1751410203.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0rwhmj",
      "author": "yoppee",
      "body": "I want this for my dog",
      "score": 7,
      "created_utc": 1751384039.0,
      "replies": [
        {
          "id": "n0s67s5",
          "author": "RevolutionCute3023",
          "body": "Wonder how's that work? How much of English versus sounds do dogs understand",
          "score": 3,
          "created_utc": 1751386736.0,
          "replies": []
        },
        {
          "id": "n0vyvax",
          "author": "thegreatpotatogod",
          "body": "First you'd have to convince your dog to \"try to say specific sentences displayed on a screen\", which would certainly be a challenge lol. I suppose you could use it or something similar to translate key thoughts like \"food\" or similar though, but only with as much accuracy and precision as you currently have at interpreting your dog's thoughts",
          "score": 1,
          "created_utc": 1751430225.0,
          "replies": []
        },
        {
          "id": "n0ws8tc",
          "author": "serrations_",
          "body": "Imagine this for fish or cats!",
          "score": 1,
          "created_utc": 1751446068.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0s7a9n",
      "author": "Velissari",
      "body": "I wonder if/how this would work with dreams or someone with schizophrenia. I imagine it wouldn’t function with those parts of the brain not associated directly with speech, but perhaps in the future the technology could target those areas?",
      "score": 6,
      "created_utc": 1751387037.0,
      "replies": []
    },
    {
      "id": "n0s8q75",
      "author": "360walkaway",
      "body": "I have a constant feed of music going on in my head that will never end. There's no way having this would end well for me... like right now, I have had Godsmack's \"Sick of Life\" on loop in my head for the last couple of hours. Yesterday, it was \"Encounter Elite\" from the *Sea of Stars* soundtrack.",
      "score": 8,
      "created_utc": 1751387445.0,
      "replies": [
        {
          "id": "n0sb7st",
          "author": "Riffsalad",
          "body": "I get random ass annoying songs from my childhood that pop into my head. It already drives me insane this would be worse.",
          "score": 3,
          "created_utc": 1751388147.0,
          "replies": [
            {
              "id": "n0se6v7",
              "author": "360walkaway",
              "body": "This is the song that never ends?",
              "score": 3,
              "created_utc": 1751388974.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0sovf3",
          "author": "GamerNumba100",
          "body": "LMAO encounter elite is funny. Great OST.",
          "score": 1,
          "created_utc": 1751391848.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0sg3wr",
      "author": "CaveManta",
      "body": "I wonder how it handles the user speaking different languages, and especially how it handles languages that rely on tone, like Chinese dialects.",
      "score": 2,
      "created_utc": 1751389496.0,
      "replies": []
    },
    {
      "id": "n0tiwwl",
      "author": "mar_iguanas",
      "body": "Targeted advertising is gonna love this",
      "score": 2,
      "created_utc": 1751400366.0,
      "replies": []
    },
    {
      "id": "n0uffr3",
      "author": "Collapse2043",
      "body": "Wow. A cure for aphasia. My Mom couldn’t speak from brain cancer. Now my Dad can’t speak from a stroke. This would be a God send.",
      "score": 2,
      "created_utc": 1751410140.0,
      "replies": []
    },
    {
      "id": "n0uqzmw",
      "author": "_byetony_",
      "body": "This is the Musk product isnt it? His bullshit was being tested there",
      "score": 2,
      "created_utc": 1751413974.0,
      "replies": []
    },
    {
      "id": "n0seous",
      "author": "h3adie",
      "body": "Yeah imagine trying to have a serious conversation and suddenly blurting out every random thought that pops into your head. Would make job interviews absolutely terrifying",
      "score": 3,
      "created_utc": 1751389111.0,
      "replies": [
        {
          "id": "n0ss8mm",
          "author": "Jiopaba",
          "body": "People keep saying this, but it's working as a replacement for the vocal cords.  If they're recording the right part of the brain then it should only be intercepting signals that are actually trying to get sent there, and not just every random thought in your head.\n\nIt's not really *reading his mind* like it's psychic, it's just intercepting signals headed to broken machinery and trying to parse them correctly.",
          "score": 11,
          "created_utc": 1751392756.0,
          "replies": [
            {
              "id": "n0u5qbe",
              "author": "slackmaster2k",
              "body": "And even if it doesn’t work that way, I can imagine a solution consisting of a “hold to talk” button.\n\nIt is kind of funny though to think of what a blessing and a curse it would be if it was really designed in a way that the person could never turn it off.  And oops they didn’t think of a volume knob either….",
              "score": 5,
              "created_utc": 1751407007.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0vttsq",
      "author": "Pryoticus",
      "body": "As the father of an autistic son this is pretty exciting. As an American on the verge of democracy’s collapse, this is pretty terrifying.",
      "score": 1,
      "created_utc": 1751428066.0,
      "replies": []
    },
    {
      "id": "n0t51np",
      "author": "infamous_merkin",
      "body": "The opposite of a Mel Gibson movie in which he hears the unspoken thoughts of others.\n\nHere there’s zero filter on the thinker?",
      "score": 1,
      "created_utc": 1751396356.0,
      "replies": []
    },
    {
      "id": "n0ti1ea",
      "author": "i_dont_do_you",
      "body": "Well, fuck, here we go… just a thought",
      "score": 1,
      "created_utc": 1751400116.0,
      "replies": []
    },
    {
      "id": "n0ti2y1",
      "author": "Slimee",
      "body": "Okay, now do dogs.",
      "score": 1,
      "created_utc": 1751400129.0,
      "replies": []
    },
    {
      "id": "n0vdei6",
      "author": "dxpeday",
      "body": "Is the user able to control what thoughts are spoken? Otherwise it could be rather embarrassing.",
      "score": 1,
      "created_utc": 1751421899.0,
      "replies": []
    },
    {
      "id": "n0we49z",
      "author": "traytablrs36",
      "body": "https://www.cbsnews.com/amp/sanfrancisco/news/controversy-grow-over-uc-davis-monkey-brain-research-involving-elon-musks-neuralink/",
      "score": 1,
      "created_utc": 1751437857.0,
      "replies": []
    },
    {
      "id": "n0wv6ul",
      "author": "Sogda",
      "body": "Can I put it on my dog",
      "score": 1,
      "created_utc": 1751447809.0,
      "replies": []
    },
    {
      "id": "n10pfz2",
      "author": "Oregonrider2014",
      "body": "Maybe its because im on mobile and it didnt load. Is there no video of this in the article? I wanna hear what it sounds like!",
      "score": 1,
      "created_utc": 1751493056.0,
      "replies": []
    },
    {
      "id": "n12vx99",
      "author": "Gilgaberry",
      "body": "\"Man, that lady's got a huge a\\*\\*.\"  \"That could be anyone's thoughts, fat a\\*\\*.\"  - Bender (Futurama)\n\nI'd either be beaten half to death in an alleyway, or in jail pretty quick.",
      "score": 1,
      "created_utc": 1751521728.0,
      "replies": []
    },
    {
      "id": "n0teywy",
      "author": "AdDue7140",
      "body": "Imagine the kinds of torture people could inflict if they are able to hack it or manipulate it.",
      "score": 1,
      "created_utc": 1751399232.0,
      "replies": [
        {
          "id": "n0tft1w",
          "author": "nimix133",
          "body": "This is why we cannot have cool things.",
          "score": 1,
          "created_utc": 1751399475.0,
          "replies": []
        },
        {
          "id": "n0v8a24",
          "author": "dmleblanc",
          "body": "Look into the targeted individual community. A technology or methodology like this is already being employed and abused, at a more sophisticated level.",
          "score": 1,
          "created_utc": 1751420128.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0rnirg",
      "author": "DarthWoo",
      "body": "So how long until it ends up going from implant to a remote sensor that can be used to eavesdrop on private thoughts?",
      "score": -2,
      "created_utc": 1751381520.0,
      "replies": [
        {
          "id": "n0siznx",
          "author": "Esc777",
          "body": "If you can remotely sensor microcurrents literally cells apart from each other at a distance you’d probably win multiple Nobel prizes. \n\nThat would be literal magic. ",
          "score": 6,
          "created_utc": 1751390269.0,
          "replies": []
        },
        {
          "id": "n0s44zx",
          "author": "AlwaysRushesIn",
          "body": "The military is already prototyping, I'm sure.",
          "score": 2,
          "created_utc": 1751386153.0,
          "replies": []
        },
        {
          "id": "n0scigm",
          "author": "Riffsalad",
          "body": "Probably not long. That was one thing I was thinking while reading the article is that this is probably a big step forward to understanding and being able to decode brain waves.",
          "score": 2,
          "created_utc": 1751388508.0,
          "replies": [
            {
              "id": "n0tc19e",
              "author": "EyebrowZing",
              "body": "What would be interesting to see is how much commonality there is between different brains thinking the same things, or are two individual's brains different enough that the model would need to start from scratch with each person.",
              "score": 1,
              "created_utc": 1751398372.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0s6rmq",
          "author": "wirebug201",
          "body": "We’re on to you! Pam Bondi knows your dirty thoughts!",
          "score": 1,
          "created_utc": 1751386891.0,
          "replies": []
        },
        {
          "id": "n0s7yll",
          "author": "Hereiamhereibe2",
          "body": "Always the Pessimist huh",
          "score": 1,
          "created_utc": 1751387229.0,
          "replies": [
            {
              "id": "n0sa2fq",
              "author": "DarthWoo",
              "body": "It's really just the natural progression of any such technology. Even as far back as when I was a kid many decades ago, it just made sense that brain signals would eventually be able to be translated to speech. What starts out as something needing an invasive implant often moves on to just being a wearable sensor, then eventually something that doesn't even need to touch you. When those factors collide, it's almost inevitable that its most insidious application will occur.",
              "score": 2,
              "created_utc": 1751387825.0,
              "replies": [
                {
                  "id": "n0sp140",
                  "author": "Hettie933",
                  "body": "People are downvoting you, but for real the militaries are always on the newest tech first, and with far more money than other groups. If there is a way to use this to kill people or influence politics, they will have it up and running waaay before we hear about it. Even just having the ability to remotely shock people in the brains would be huge for them. Absolutely pro-science, but it is always good to be clear-eyed about the way things work in practice. Ethical considerations are so important for this kind of tech!",
                  "score": 4,
                  "created_utc": 1751391891.0,
                  "replies": []
                },
                {
                  "id": "n0schld",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1751388501.0,
                  "replies": [
                    {
                      "id": "n0stwa8",
                      "author": "DuchessJulietDG",
                      "body": "brain waves are detectable outside a person’s skull.  and our bodies/brains themselves are electrical.",
                      "score": 1,
                      "created_utc": 1751393215.0,
                      "replies": [
                        {
                          "id": "n0t30ac",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1751395782.0,
                          "replies": [
                            {
                              "id": "n0t4jhr",
                              "author": "Pets_Are_Slaves",
                              "body": "Google \"non-invasive BCI\".",
                              "score": 1,
                              "created_utc": 1751396213.0,
                              "replies": [
                                {
                                  "id": "n0t51xt",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 0,
                                  "created_utc": 1751396358.0,
                                  "replies": [
                                    {
                                      "id": "n0v9z8x",
                                      "author": "Pets_Are_Slaves",
                                      "body": "Absolutely not, I just read your quote. Next time, quote all the relevant context.",
                                      "score": 1,
                                      "created_utc": 1751420719.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0sg1n9",
          "author": "calpi",
          "body": "How exactly do you think that would be possible in any way?\n\n\nUnless you're suggesting that the implant would be used to transfer thoughts?",
          "score": -1,
          "created_utc": 1751389480.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0szwol",
      "author": "averagehousegoblin",
      "body": "I wonder how/if this could help children and people with autism who have been diagnosed as non-verbal.",
      "score": 0,
      "created_utc": 1751394909.0,
      "replies": [
        {
          "id": "n0tue3w",
          "author": "LoriLuckyHouse",
          "body": "As the parent of a non-speaking child that was my first thought. My second was how quickly this could be used to completely ignore the bodily autonomy of non-speakers. I’d love to be able to communicate with my son more easily, but would hate to do so in a way that disregards his communication preferences and makes him feel uncomfortable and unloved for who he is.",
          "score": 3,
          "created_utc": 1751403613.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0t7tup",
      "author": "Powerful_Document872",
      "body": "Oh lovely, now the world gets to hear my intrusive thoughts!",
      "score": 0,
      "created_utc": 1751397159.0,
      "replies": []
    },
    {
      "id": "n0t8o1a",
      "author": "Psychological-Arm505",
      "body": "No thank you.",
      "score": 0,
      "created_utc": 1751397400.0,
      "replies": []
    },
    {
      "id": "n0w63zt",
      "author": "SocialSuicideSquad",
      "body": "#NO WAY THIS COULD BE USED IN AN EVIL FASHION, DEFINITELY ALL OK",
      "score": 0,
      "created_utc": 1751433658.0,
      "replies": []
    },
    {
      "id": "n0x4anm",
      "author": "alcoholic_jogging",
      "body": "It's amazing. But I guess that not every thought is meant to be spoken😂",
      "score": 0,
      "created_utc": 1751452798.0,
      "replies": []
    }
  ]
}