{
  "post": {
    "title": "Nvidia GeForce RTX 5070 Ti review: a cheaper RTX 4080",
    "author": "a_Ninja_b0y",
    "id": "1it68gd",
    "score": 624,
    "created_utc": 1739973902.0,
    "selftext": "",
    "num_comments": 202,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1it68gd/nvidia_geforce_rtx_5070_ti_review_a_cheaper_rtx/"
  },
  "comments": [
    {
      "id": "mdm8wtg",
      "author": "dzone25",
      "body": "Sure, \"cheaper\" with zero available at MSRP - gotchu.",
      "score": 982,
      "created_utc": 1739975010.0,
      "replies": [
        {
          "id": "mdmnqld",
          "author": "ownage516",
          "body": "When I bought a 2070 super in 2019, I should’ve known that would’ve been my last nvidia gpu. Fuck me for wanting to run games on a 1440p monitor",
          "score": 190,
          "created_utc": 1739979551.0,
          "replies": [
            {
              "id": "mdn1ap3",
              "author": "None",
              "body": "[removed]",
              "score": 97,
              "created_utc": 1739983303.0,
              "replies": [
                {
                  "id": "mdn92ov",
                  "author": "Dabidokun",
                  "body": "I built in 2019 and got an RTX 2070 super, and this is exactly my situation.",
                  "score": 46,
                  "created_utc": 1739985394.0,
                  "replies": [
                    {
                      "id": "mdrsiwv",
                      "author": "tommyk1210",
                      "body": "Same - 2070S is just about managing to hang on now",
                      "score": 3,
                      "created_utc": 1740040442.0,
                      "replies": [
                        {
                          "id": "me3evp6",
                          "author": "The_Jimmeh",
                          "body": "Idk I’m still happy with my 2070 super, I don’t really play AAA games though",
                          "score": 3,
                          "created_utc": 1740190170.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mds7si4",
                      "author": "ObeyReaper",
                      "body": "My people lol.",
                      "score": 1,
                      "created_utc": 1740049571.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mdnm5xo",
                  "author": "CamGoldenGun",
                  "body": "I'm still running on a 1080 with a CPU that isn't Win 11 compatible... At least the 4080 Super is 100% better than my 1080... will still cost me about $1000 but it beats paying the crazy prices for a 5090.",
                  "score": 23,
                  "created_utc": 1739988902.0,
                  "replies": [
                    {
                      "id": "mdnrvws",
                      "author": "Rage_Like_Nic_Cage",
                      "body": "Good luck finding a 4080s for anything less than like $1300 right now.  It’s a shitshow",
                      "score": 14,
                      "created_utc": 1739990432.0,
                      "replies": [
                        {
                          "id": "mdntwx3",
                          "author": "CamGoldenGun",
                          "body": "damnit... now I'm looking at 4070 super's...",
                          "score": 1,
                          "created_utc": 1739990974.0,
                          "replies": [
                            {
                              "id": "mdo3eya",
                              "author": "Rage_Like_Nic_Cage",
                              "body": "If you’re not big on ray tracing, jumping to AMD might be a better move. I just upgraded last week from a GTX 1070 to an RX 7900xtx and have not been regretting it at all",
                              "score": 8,
                              "created_utc": 1739993523.0,
                              "replies": [
                                {
                                  "id": "mdo63j5",
                                  "author": "CamGoldenGun",
                                  "body": "I've been thinking about it. I had a 6850 back in the day but I think I upgraded a lot earlier with that one so might have put me off of them for awhile.",
                                  "score": 1,
                                  "created_utc": 1739994243.0,
                                  "replies": []
                                },
                                {
                                  "id": "mdrazgd",
                                  "author": "runnerofshadows",
                                  "body": "Especially true if you're also looking at switching to Linux at windows 10 eol. Though Nvidia linux drivers are actually improving.",
                                  "score": 1,
                                  "created_utc": 1740030728.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mdo05en",
                              "author": "thatstonedtrumpguy",
                              "body": "Just gotta buy it for $100 over MSRP :):):)",
                              "score": 1,
                              "created_utc": 1739992648.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mdns63q",
                      "author": "WatteOrk",
                      "body": "> I'm still running on a 1080 with a CPU that isn't Win 11 compatible\n\nThere are ~~dozens~~ hundreds of us. I havent finally decided yet if I want to upgrade this year, but Im seriously considering to switch to an AMD GPU and linux",
                      "score": 5,
                      "created_utc": 1739990507.0,
                      "replies": [
                        {
                          "id": "mdoommv",
                          "author": "newredditsucks",
                          "body": "Damn.  Just looked, and my 1080TI is circa 2018.  \nI *really* don't want to go AMD, but may be due for something new soon.",
                          "score": 1,
                          "created_utc": 1739999170.0,
                          "replies": [
                            {
                              "id": "me037pd",
                              "author": "phony_sys_admin",
                              "body": "1080ti gang here. Looking to maybe upgrade when GTA6 comes out but not *super* stoked about current GPU pricing. My Asus Strix was $700 then and now that's considered mid-range pricing 🫤\n\nChecking old emails my card was delivered on 9/27/17. Wow 😲",
                              "score": 2,
                              "created_utc": 1740151874.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mdqdjk8",
                      "author": "mjtwelve",
                      "body": "Think of it this way - Win11 upgrade reminders and forced upgrades and various hullshit just looks at your CPU and fucks off without you needing to do anything. That’s a big plus. I don’t need to worry about M$ installing a new OS if I fail to opt out or opt in or click the wrong button buried ten tabs deep in a random part of the OS.",
                      "score": 3,
                      "created_utc": 1740017708.0,
                      "replies": [
                        {
                          "id": "mdql8a4",
                          "author": "CamGoldenGun",
                          "body": "well it's an ITX build so I can move it behind the TV and make the dumb TV smart, might make it Linux. But still getting more expensive to build an upgrade lol",
                          "score": 2,
                          "created_utc": 1740020383.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mdqamrv",
                      "author": "bigdaddy2292",
                      "body": "I have the gtx 1060 6gb and still kicking, so i feel ya. I won't play a lot of games. I wanna get into it until I build a new rig, but it's hard to justify the cost",
                      "score": 1,
                      "created_utc": 1740016716.0,
                      "replies": []
                    },
                    {
                      "id": "mdu17u8",
                      "author": "TheRetardedGoat",
                      "body": "Same situation as me, it was just about budget back in the day now it's about availability and whether you want to overstretch or wait",
                      "score": 1,
                      "created_utc": 1740072025.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mdnw8xm",
                  "author": "MmmmMorphine",
                  "body": "Unless (and probably even if, frankly) running LLMs is a core part of your use, why not just go for amd?\n\nDon't think they've released their entire new series (i mean what, 2 products?) yet so it might be worth waiting, but regardless. Seems close enough to mid-level 50 series for like half the price",
                  "score": 5,
                  "created_utc": 1739991599.0,
                  "replies": [
                    {
                      "id": "mdp1pef",
                      "author": "314159bits",
                      "body": "The drivers are so bad and baggy. I’ve had loads of driver issues on win10 and 11 with my Radeon.",
                      "score": -5,
                      "created_utc": 1740002687.0,
                      "replies": [
                        {
                          "id": "mdpoql9",
                          "author": "dsp457",
                          "body": "I had countless issues with my AMD RX 5700 XT. I am very happy to report that after a year of use, I've had no such issues with my RX 7900 XTX. I could not be happier with it. I wouldn't say the drivers are much of an issue these days.",
                          "score": 4,
                          "created_utc": 1740009586.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mdqmas1",
                  "author": "Cynical_Cyanide",
                  "body": "What nonsense are yout talking about wrt. '10 owners' and '20 owners' etc.\n\n\nThere's a world of difference between a 1060 3GB & 1080 ti, a 2060 and 2080 ti, and 3060 and 3090 ti. A flagship from the previous tier stomps the 60 of the next tier, so what utter nonsense is it to talk about entire series as if they're all in the same bucket? Sitting on e.g. a 2080 ti (roughly equal to 3070 but with more vram) isn't as bad as sitting on a 3060 or even a 3070.\n\n\nEverything else you said is roughly correct, but the level of want for a new card for a given person is based on a hell of a lot more than which two digits their existing card starts with.",
                  "score": 3,
                  "created_utc": 1740020755.0,
                  "replies": []
                },
                {
                  "id": "mdny1zs",
                  "author": "sonicvash",
                  "body": "thats pretty much where im at. running a 1060  6 gb. most seem to agree that the 50 series sucks shit but i gotta upgrade to something",
                  "score": 2,
                  "created_utc": 1739992086.0,
                  "replies": []
                },
                {
                  "id": "mdoo6bh",
                  "author": "namorblack",
                  "body": "Im at Sapphire 5700XT Nitro which I bought for 379'ish euro incl 25% VAT. Looking at these prices, I'm beyond in shock. 7900 XTX is at 1149 euro (incl 25% VAT) and 5070 ti is 1289 euro (incl 25% VAT). \n\nI could buy 3x 5700XTs for the price of one card today. \nIm not even touching 5090 pricing which costs what I bought my whole PC for 6 years ago (3900X / 5700XT / X570 AORUS Master) \n\nWhat the fuck.",
                  "score": 2,
                  "created_utc": 1739999048.0,
                  "replies": []
                },
                {
                  "id": "mdnpp8z",
                  "author": "_Zekken",
                  "body": "For what its worth, I bought a used 3070 ~1.5 years ago as an upgrade to my 1070 (was after 40 series launched) and its absolutely been fine ever since. Im also not 100% positive it wasnt used for mining. (Seller said it wasnt but he could have lied of course). \n\nId be fairly confident that if you bought a used 40 series you'd be fine, especially since the mining craze has died off a lot.",
                  "score": 1,
                  "created_utc": 1739989844.0,
                  "replies": []
                },
                {
                  "id": "mdnxjmc",
                  "author": "Nalcomis",
                  "body": "It’s only underwhelming if you OWN a 40 series already.  Any 50 series is going to run laps around your current card.",
                  "score": 1,
                  "created_utc": 1739991948.0,
                  "replies": []
                },
                {
                  "id": "mdpr7wc",
                  "author": "Annonimbus",
                  "body": "Do you consider buying a 5090? I've a 4k monitor (with a 2070, lol) and wanted to finally use its full potential but the hot running cables are really scary and I think about going for a 5080 instead :/",
                  "score": 1,
                  "created_utc": 1740010365.0,
                  "replies": []
                },
                {
                  "id": "mdrhnkz",
                  "author": "D0z3rD04",
                  "body": "Why don't you look at amd or Intel. I know right now both are hard to come by but they offer cards with the same performance as a 4080 for less money. It doesn't make sense to limit yourself to one brand. I know my 7900xtx was cheaper than a 4080 super at the time and performs the same at 1080p. The biggest downside is the ray tracing equivalent is not as good compared to Nvidia, we are talking frames being cut by a 1/4 or more for alot of games. Fsr isn't as good either with ghosting issues in some games but not in others.",
                  "score": 1,
                  "created_utc": 1740034146.0,
                  "replies": []
                },
                {
                  "id": "mds14s3",
                  "author": "abzlute",
                  "body": "I honestly don't understand the issue. To upgrade your current rig, just get an older (and now relatively cheaper) 30 or 40 series. I'm fairly certain you can get a 4060 or 4070 that would outperform your 2080 well enough, or 3080 or even 3070. Or wait for the 50 series to be out long enough for sufficient availability.",
                  "score": 1,
                  "created_utc": 1740045672.0,
                  "replies": []
                },
                {
                  "id": "mdwbt2e",
                  "author": "millsy98",
                  "body": "My 1080 ti wants to die but it outlived the rest of the system I put it in originally.",
                  "score": 1,
                  "created_utc": 1740095324.0,
                  "replies": []
                },
                {
                  "id": "mgbe7u0",
                  "author": "GrabNatural8385",
                  "body": "The amd cards seem to have great reviews and easy to get. Just get one of those",
                  "score": 1,
                  "created_utc": 1741262883.0,
                  "replies": []
                },
                {
                  "id": "mdnqsgv",
                  "author": "Egyptian-Mastigure",
                  "body": "Did a rebuild a lil over a year ago with a 13700k. Had a 3070ti with only 8bg. Sold that card and got a deal on a MSI RTX 4080 super for little over $1000. After seeing the prices and how the 50 series proces and performance, I’m lucky I got one when I did. This shit is crazy. They made the market like this on purpose",
                  "score": 1,
                  "created_utc": 1739990138.0,
                  "replies": [
                    {
                      "id": "mdpiaea",
                      "author": "reality_bytes_",
                      "body": "Once the gpu is sold after the initial purchase, it doesn’t benefit the company at all. If anything, they want stock levels high enough for more people to purchase, not less. The issue is production. They release hardware before there’s enough stock to fulfill as many orders as needed. Anyone thinking companies are doing this on purpose are short sighted. Foundaries and production of wafers is expensive, and they don’t want to over produce, nor under produce. “Artificial scarcity”, paper launches, etc… make absolutely no sense in the way people think this works. \n\nIf they had the capacity, they would release it. Scalpers don’t benefit nvidia, AMD, or Intel. They do not profit from this at all, it’s unfortunately a side effect of needing to make shareholders happy by saying “we released something!”… even though they know damn well they can’t get the binning or capacity rolled out in time for a decent launch.",
                      "score": 3,
                      "created_utc": 1740007540.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mdnos2a",
                  "author": "CaptainDouchington",
                  "body": "Its time we all realized that there has been almost no true advancement in the tech since the 10 series. Everything is some gimmicky shit to sell overpriced cards for stock value.\n\nGame developers arent even attempting optimization so you need the biggest boy on the block to push by it.",
                  "score": -5,
                  "created_utc": 1739989612.0,
                  "replies": []
                },
                {
                  "id": "mdofiz7",
                  "author": "happy-cig",
                  "body": "Just turn down settings, I went from a 1070 to a 4070S and honestly could've done without upgrading.  Only reason why I upgraded was bc a friend sold it to me brand new for $550 taxes included (which was $500 pretax).\n\n  \nOverwatch is my primary comp shooter and it gets 165fps+ at 1440p with adjusted settings.\n\n  \nMost games are playable at 60+.",
                  "score": -4,
                  "created_utc": 1739996758.0,
                  "replies": [
                    {
                      "id": "mdoph0i",
                      "author": "_Dreamer_Deceiver_",
                      "body": "I went from a 970 to 4070. It was an acceptable upgrade. I can actually play some modern games.",
                      "score": 4,
                      "created_utc": 1739999398.0,
                      "replies": []
                    },
                    {
                      "id": "mdqip0u",
                      "author": "Christopher135MPS",
                      "body": "I moved from a 1660 super to a 4070ti, only moved because drivers were starting to become an issue for the 1660. \n\nAgree with you, the upgrade was underwhelming. The only difference was I could squeeze an extra 20-30fps on full settings, and access to some of the AI stuff like DLSS etc.",
                      "score": 1,
                      "created_utc": 1740019488.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mdne62y",
                  "author": "cokespyro",
                  "body": "I can’t believe you took the time to write all of this.  There have been ample opportunities to buy both the 30 series and 40 series at MSRP over the past two years.  The only time that wasn’t the case was during Covid and during the launch of the 40 series.\n\nDo you seriously expect software to never evolve and never require more processing power than it does the day you buy your hardware?  Your 2080 will be 7 years old this year.  Even consoles don’t last that long in most cases.\n\nBy the summer you’ll easily be able to grab a 50 series at MSRP, at which point you can grab a 5070 for $549 or 5070 Ti for $749.  You should get used to using DLSS and frame generation because that is the future of gaming whether you like it or not.",
                  "score": -17,
                  "created_utc": 1739986761.0,
                  "replies": [
                    {
                      "id": "mdngve3",
                      "author": "None",
                      "body": "[removed]",
                      "score": 16,
                      "created_utc": 1739987487.0,
                      "replies": [
                        {
                          "id": "mdocsf5",
                          "author": "cokespyro",
                          "body": "I didn’t type much compared to the fit you threw.  Bottom line is you might as well give up PC gaming if you can’t justify another $600 after 7 years to keep up with modern technology.",
                          "score": -1,
                          "created_utc": 1739996030.0,
                          "replies": [
                            {
                              "id": "mduw09e",
                              "author": "None",
                              "body": "[removed]",
                              "score": 2,
                              "created_utc": 1740080392.0,
                              "replies": [
                                {
                                  "id": "mdwcit4",
                                  "author": "cokespyro",
                                  "body": "The only thing I don’t get is how you expect to continue being a PC gamer if you aren’t willing to ever upgrade due to pricing you don’t like.",
                                  "score": 1,
                                  "created_utc": 1740095556.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mdndh66",
                  "author": "Rektw",
                  "body": "In the same situation as you with a 2080ti, but I snagged a 5080 off best buy anyway. I've been really happy with it, my only problem is..the rest of my PC is dated. I don't have a 4k monitor but play on a 3440x1440 ultrawide and it's good enough for me.",
                  "score": -2,
                  "created_utc": 1739986573.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdovydt",
              "author": "SteakandTrach",
              "body": "My secret is a massive backlog of older games. I'm still contentedly getting around to good games I simply didn't have time for previously. Makes my card last longer. I would honestly recommend simply going for a used 3080 or 3080ti. Market is pretty soft on those at the moment.",
              "score": 5,
              "created_utc": 1740001123.0,
              "replies": [
                {
                  "id": "mdr01yx",
                  "author": "justaguy394",
                  "body": "r/patientgamers ftw!",
                  "score": 2,
                  "created_utc": 1740025923.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdnctj4",
              "author": "SwimmingAbalone9499",
              "body": "?. my non super still holds up like crazy",
              "score": 3,
              "created_utc": 1739986396.0,
              "replies": [
                {
                  "id": "mdneneb",
                  "author": "ownage516",
                  "body": "It's for sure holding up, but part of me wants to upgrade to run cyberpunk on the highest settings and all that",
                  "score": 5,
                  "created_utc": 1739986889.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdnrgrc",
              "author": "cortlong",
              "body": "3080s are cheap af now. Go cop one. Best GPU I’ve owned.",
              "score": 3,
              "created_utc": 1739990319.0,
              "replies": []
            },
            {
              "id": "mdqnzdt",
              "author": "kronosdev",
              "body": "I’m running a 2060 and 2k looks just fine for me. Stock cooler too. Maybe swap your thermal paste and clean out the dust bunnies lad.",
              "score": 0,
              "created_utc": 1740021352.0,
              "replies": []
            },
            {
              "id": "mdr2m03",
              "author": "iDontRagequit",
              "body": "Ive been gaming in 1440p on a 1070 for the past 5 years with no issues, I run high graphics 60 fps on pretty much all games",
              "score": 0,
              "created_utc": 1740026984.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdo2cp7",
          "author": "OMGItsCheezWTF",
          "body": "The reviews from the usual suspects (GN, JTC, Hardware Unboxed etc) seems to be \"don't bother, they aren't worth the price above MSRP you'll actually buy them for\"",
          "score": 8,
          "created_utc": 1739993237.0,
          "replies": []
        },
        {
          "id": "mdpke8v",
          "author": "reality_bytes_",
          "body": "“Cheaper” for $900 msrp? \n\nNow they’re just trying to see how much consumers are willing to pay for a gpu. I wish people would stave off the temptation for a few months to show that charging exorbitant prices for games is something we would fight back on. Mid range needs to go back to $500-$700. This $900+ for something that isn’t even at the top of performance is asinine. \n\nPlease people, let the scalpers sit on their stock and sweat while their credit card payments come due. Please… let this roll until the whole industry gets the hint that playing games might be fun, but it isn’t worth these prices…",
          "score": 3,
          "created_utc": 1740008208.0,
          "replies": []
        },
        {
          "id": "mdqxi1m",
          "author": "staind47",
          "body": "Yeah after tax most 5070ti will be over 1K lol that’s crazy",
          "score": 2,
          "created_utc": 1740024893.0,
          "replies": []
        },
        {
          "id": "mdnv2po",
          "author": "ExpoAve17",
          "body": "exactly",
          "score": 1,
          "created_utc": 1739991283.0,
          "replies": []
        },
        {
          "id": "mdoa9fe",
          "author": "gorginhanson",
          "body": "But that's exactly how 4080 was (and still is) too.",
          "score": 1,
          "created_utc": 1739995351.0,
          "replies": [
            {
              "id": "mdqq5zw",
              "author": "ThePretzul",
              "body": "Yeah, except the 4080 was sold for prices 20-40% above a starting MSRP of $1,100 instead of 20-40% above a starting MSRP of $750.\n\nKinda like getting only getting shot with a .50 cal instead of a howitzer.",
              "score": 1,
              "created_utc": 1740022134.0,
              "replies": [
                {
                  "id": "mdqsfu8",
                  "author": "gorginhanson",
                  "body": "Well there you go then. It's technically better, the best kind of better.",
                  "score": 1,
                  "created_utc": 1740022965.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdnq074",
          "author": "TheSmJ",
          "body": "I agree and it's annoying. But this is more or less how things have been since the 30 series' release and it's what we need to learn to expect. Actual availability at MSRP won't happen until 2 or 3 quarters after release.\n\nYou can either get pissed off about it, or plan accordingly.",
          "score": 0,
          "created_utc": 1739989927.0,
          "replies": [
            {
              "id": "mdntbfn",
              "author": "dzone25",
              "body": "No - they should either be prepared with the stock / supply or just raise the MSRP on launch if it's not actually going to hit it for another 6-9 months.",
              "score": 1,
              "created_utc": 1739990816.0,
              "replies": [
                {
                  "id": "mdnyoqx",
                  "author": "TheSmJ",
                  "body": "Sure. But they won't. 🤷",
                  "score": -1,
                  "created_utc": 1739992257.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdm92zn",
      "author": "ArchusKanzaki",
      "body": "I mean, a cheaper 4080 is all I want....\n\nBut its only \"technically\". It will be more expensive than 4080, and probably will end up be priced same as 4080 Super.",
      "score": 189,
      "created_utc": 1739975067.0,
      "replies": [
        {
          "id": "mdmc2e3",
          "author": "Trust_n01",
          "body": "What? The 4080 Super was $200 cheaper (on paper) than the regular 4080.",
          "score": 48,
          "created_utc": 1739976027.0,
          "replies": [
            {
              "id": "mdmd5oe",
              "author": "ArchusKanzaki",
              "body": "Yeah, but 5080 is being sold for at least 30% higher than 4080 Super, going from around 1500$ for 4080 Super (before all the stocks gone anyway) to 2000$ for 5080. \n\nAnd yeah, I meant a cheaper 4080 Super.... But if my guess is correct, 5070 Ti will be sold at same price as 4080 Super, and its not even better than that card. At best only similar.",
              "score": 28,
              "created_utc": 1739976373.0,
              "replies": [
                {
                  "id": "mdp1gq5",
                  "author": "fullup72",
                  "body": "And this is exactly why Intel is selling their $250 GPUs like hotcakes. \n\nMight not be as fast, but they are affordable and somewhat available.",
                  "score": 4,
                  "created_utc": 1740002619.0,
                  "replies": [
                    {
                      "id": "mdpyq2h",
                      "author": "watch-obsessed",
                      "body": "Which one is the Intel GPU with best price/performance ratio?",
                      "score": 1,
                      "created_utc": 1740012762.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdmy20d",
              "author": "None",
              "body": "What the hell does “on paper” mean in this context. Either it was sold cheaper or not.",
              "score": -6,
              "created_utc": 1739982419.0,
              "replies": [
                {
                  "id": "mdmzwlr",
                  "author": "farklespanktastic",
                  "body": "MSRP vs actual prices",
                  "score": 15,
                  "created_utc": 1739982924.0,
                  "replies": []
                },
                {
                  "id": "mdr1zog",
                  "author": "Agamemnon323",
                  "body": "New gpu just dropped.\n\nMSRP is $800. \n\nNational supply: 7\n\nBut don’t worry, you can buy one made by our other suppliers! \n\nOther suppliers price: $1200\n\nThat’s what “on paper” means.",
                  "score": 3,
                  "created_utc": 1740026726.0,
                  "replies": []
                },
                {
                  "id": "mdmzse7",
                  "author": "General_Jeevicus",
                  "body": "first time buying gpu?",
                  "score": 8,
                  "created_utc": 1739982892.0,
                  "replies": []
                },
                {
                  "id": "mdrrzh1",
                  "author": "tartare4562",
                  "body": "Welcome to last 4 years where GPU at suggested retail price are perpetually sold out and real prices change all the time.",
                  "score": 1,
                  "created_utc": 1740040111.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdn00n1",
          "author": "GrayDaysGoAway",
          "body": "> Its more expensive than 4080\n\nLol what? That's not even remotely close to true. The 5070ti msrp is $550 cheaper than the OG 4080 was.",
          "score": -12,
          "created_utc": 1739982955.0,
          "replies": [
            {
              "id": "mdn05lh",
              "author": "ArchusKanzaki",
              "body": "I should change it to \"would be\" and 4080 to 4080 Super....",
              "score": 2,
              "created_utc": 1739982992.0,
              "replies": [
                {
                  "id": "mdn19g9",
                  "author": "GrayDaysGoAway",
                  "body": "Nah, that's still not based in reality. I've seen plenty of people over on /r/nvidia who snagged 50 series cards at msrp. The same will be true with this one.\n\nJust because impatient people are being taxed by some retailers / scalpers, that doesn't mean the card suddenly has a different price. Be patient, keep an eye out, and you can get these cards for the announced prices.",
                  "score": -9,
                  "created_utc": 1739983294.0,
                  "replies": [
                    {
                      "id": "mdn60fj",
                      "author": "jrsedwick",
                      "body": ">plenty of people\n\nThere are dozens of them, DOZENS I SAY!",
                      "score": 10,
                      "created_utc": 1739984570.0,
                      "replies": [
                        {
                          "id": "mdn6kxg",
                          "author": "GrayDaysGoAway",
                          "body": "I'm willing to bet that 99.9% of you parroting that shit in every one of these threads never even tried to get one of these cards. You just saw an article saying they sold out and went \"hurr they're unobtanium durr.\"",
                          "score": -10,
                          "created_utc": 1739984724.0,
                          "replies": [
                            {
                              "id": "mdn84v3",
                              "author": "jrsedwick",
                              "body": "I make one troll comment and now I'm \"parroting in every thread\"? Good grief, you need a nap and a cookie.\n\nFWIW I have looked at 5080 availability and prices over the last couple of weeks and while they may not technically be unobtanium if you're willing to devote tens of hours to finding one, but I haven't been able to find one ready to ship. Newegg, Amazon, MC, and BestBuy. Not a single 5080. Covid is over, there's no excuse for this.\n\nEdit : u/GrayDaysGoAway blocked me as well. When did people get so soft that all they can do is sling a salty comment and run away?",
                              "score": 8,
                              "created_utc": 1739985141.0,
                              "replies": [
                                {
                                  "id": "mdnbq60",
                                  "author": "GrayDaysGoAway",
                                  "body": "You may not be but in every thread you're blind if you haven't seen the endless comments circlejerking about this in every one of these threads. Nobody can actually discuss the cards because of you jokers clogging up the comment sections with your shitty trolling. \n\nSorry my criticism of you struck a nerve but it doesn't mean I need a nap. Grow up and get over yourself.",
                                  "score": -2,
                                  "created_utc": 1739986103.0,
                                  "replies": [
                                    {
                                      "id": "mdpehco",
                                      "author": "going-deep-10",
                                      "body": "Whyd you block him?",
                                      "score": 1,
                                      "created_utc": 1740006367.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mdnaeel",
                      "author": "bibober",
                      "body": ">Be patient, keep an eye out, and you can get these cards for the announced prices.\n\nlmao\n\nedit: guy replied to me with the saltiest shit ever and then blocked me.  typical nvidia boot-throater",
                      "score": 3,
                      "created_utc": 1739985749.0,
                      "replies": [
                        {
                          "id": "mdnbh9y",
                          "author": "GrayDaysGoAway",
                          "body": "I did. Just because you've had bad luck doesn't change the facts of the matter. Take your worthless butthurt comments elsewhere, thanks.",
                          "score": 0,
                          "created_utc": 1739986037.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mdnct5u",
                      "author": "Paweron",
                      "body": "There are no founders editions of the 5070ti, so there  is noone selling them at msrp",
                      "score": 1,
                      "created_utc": 1739986393.0,
                      "replies": [
                        {
                          "id": "mdndrgv",
                          "author": "GrayDaysGoAway",
                          "body": "I know at least PNY has one at msrp, that pricing was confirmed by Microcenter just a few days ago. I'm sure there are others too.",
                          "score": 0,
                          "created_utc": 1739986651.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdm6ssl",
      "author": "Dude-e",
      "body": "Yeah,,, already hard to justify even if it was actually sold at MSRP. And we KNOW it’ll probably have price tag at least 30% higher than MSRP",
      "score": 59,
      "created_utc": 1739974312.0,
      "replies": [
        {
          "id": "mdmh5rj",
          "author": "Millendra",
          "body": "yeep, at this point, MSRP is just a suggestion. Expecting that markup for sure.",
          "score": -18,
          "created_utc": 1739977627.0,
          "replies": [
            {
              "id": "mdmku5y",
              "author": "DomNhyphy",
              "body": "Not to be \"that guy\" but MSRP literally stands for manufacturer's suggested retail price.",
              "score": 46,
              "created_utc": 1739978717.0,
              "replies": []
            },
            {
              "id": "mdmzog2",
              "author": "rnnd",
              "body": "Yup MSRP is just a suggestion. 😂",
              "score": 13,
              "created_utc": 1739982863.0,
              "replies": []
            },
            {
              "id": "mdnf26w",
              "author": "Zandalaria",
              "body": "I wonder what the ‘S’ is in MSRP?",
              "score": 9,
              "created_utc": 1739987000.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdm80qj",
          "author": "Andulias",
          "body": "I dunno, all things considered, it seems like the best card out of arguably a rather weak lineup.",
          "score": -9,
          "created_utc": 1739974721.0,
          "replies": []
        },
        {
          "id": "mdn4nnr",
          "author": "GrayDaysGoAway",
          "body": "You can get both the 5090 and 5080 at msrp if you're not an impatient idiot. The same will be true here. Stop acting like scalper bullshit is the official pricing.",
          "score": -16,
          "created_utc": 1739984206.0,
          "replies": [
            {
              "id": "mdno2rh",
              "author": "entyfresh",
              "body": "Some of us have lives and can’t literally camp outside of a store to get computer parts",
              "score": 9,
              "created_utc": 1739989417.0,
              "replies": [
                {
                  "id": "mdnoo11",
                  "author": "GrayDaysGoAway",
                  "body": "Even if I had the time to camp out like that I wouldn't. I got mine online from Best Buy. Took me all of about five minutes of sitting at my computer.",
                  "score": -7,
                  "created_utc": 1739989572.0,
                  "replies": [
                    {
                      "id": "mdnt1eg",
                      "author": "entyfresh",
                      "body": "If you stopped and spent 30 seconds thinking about what would happen if everyone followed your advice, you might realize how useless it is.",
                      "score": 7,
                      "created_utc": 1739990740.0,
                      "replies": [
                        {
                          "id": "mdnulv3",
                          "author": "GrayDaysGoAway",
                          "body": "Lmao everyone already *is* doing the same thing, genius. And it's been this way for virtually every major piece of new tech for five years now btw. If you think this shit is hard to come by you should've tried buying a PS5 shortly after release. This is NOTHING in comparison.",
                          "score": -2,
                          "created_utc": 1739991159.0,
                          "replies": [
                            {
                              "id": "mdo4lo9",
                              "author": "entyfresh",
                              "body": "lol keep on licking those boots",
                              "score": 1,
                              "created_utc": 1739993841.0,
                              "replies": [
                                {
                                  "id": "mdocvsv",
                                  "author": "GrayDaysGoAway",
                                  "body": "I'm licking boots because I'm not sitting here whining like a butthurt little baby about something I can't control?\n\nLol nah, you're just a 🤡. I'm glad you can't find a GPU at an affordable price. You don't deserve nice things.",
                                  "score": 0,
                                  "created_utc": 1739996054.0,
                                  "replies": [
                                    {
                                      "id": "mdojlm8",
                                      "author": "entyfresh",
                                      "body": "Good luck dealing with those emotional problems you’ve got, fam. Lmao, imagine getting this worked up over a thread about graphics cards",
                                      "score": 2,
                                      "created_utc": 1739997842.0,
                                      "replies": [
                                        {
                                          "id": "mdojuwj",
                                          "author": "GrayDaysGoAway",
                                          "body": "Way to project. I'm not the one calling people bootlickers just because they don't agree with me about the availability of a GPU. You need help, and a lot of it. And I hope you do not have good luck getting it.",
                                          "score": 3,
                                          "created_utc": 1739997910.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mdnayye",
              "author": "bibober",
              "body": "I was \"in line\" within less than a second of every best buy 5090 FE restock so far, and yet I still did not get one. Stop downplaying the issue.",
              "score": 9,
              "created_utc": 1739985902.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdmei0j",
      "author": "-TheArchitect",
      "body": "Gamernexus just dropped a video saying not to buy. Watching now",
      "score": 81,
      "created_utc": 1739976796.0,
      "replies": [
        {
          "id": "mdqp3j8",
          "author": "MiddleBodyInjury",
          "body": "Curious how the new radeons perform",
          "score": 4,
          "created_utc": 1740021752.0,
          "replies": [
            {
              "id": "mds781y",
              "author": "HerniatedHernia",
              "body": "It’s what I’m waiting on. Got the itch to upgrade my rig to a SFF but waiting on reviews to see if i do or wait.",
              "score": 2,
              "created_utc": 1740049251.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mdmdaju",
      "author": "Blapanda",
      "body": "I am still going to buy a 7900xtx, if intel is not coming up with something almost or as powerful as or even more powerful than the 4090 at a reasonable price.\nThe fucking 4090 still costs 2200 € after years, while the 7900xtx costs around 850 €, and thats just 7-15% less Performance. I don't give a shit about Nvidia anymore, my 2080 rtx is the last card from that company, they can go and screw themselves over with their unreasonable prices for non-existent hardware (you are only paying for the damn AI crap)!",
      "score": 51,
      "created_utc": 1739976416.0,
      "replies": [
        {
          "id": "mdnuddq",
          "author": "None",
          "body": "Just bought a 7900xtx and I’m very happy.. really good card and would recommend the swap from Nvidia to AMD to anyone.",
          "score": 18,
          "created_utc": 1739991097.0,
          "replies": [
            {
              "id": "mdplyvx",
              "author": "ArrogantWinner",
              "body": "I switched from Nvidia to AMD when I got a 6800xt in 2021. The card performs well for the most part, but AMD's software is way worse than Nvidia's. The software issues alone are making me want to switch back to Nvidia",
              "score": 0,
              "created_utc": 1740008713.0,
              "replies": [
                {
                  "id": "mdqsjfq",
                  "author": "Elfalpha",
                  "body": "Things are better than they used to be, but there's always something with AMD cards.\n\nOften it will be a specific game that hasn't done as good a job testing on AMD than Nvidia. That's not really AMD's fault, and the more cards they sell the better that issue will get, but it's still a thing that doesn't happen with Nvidia.",
                  "score": 6,
                  "created_utc": 1740023001.0,
                  "replies": [
                    {
                      "id": "mdvc3x2",
                      "author": "alman12345",
                      "body": "Yep…I still play Titanfall 2 occasionally on custom northstar servers and the energy siphon fps bug on the 7900 XTX was awful. DXNavi also occasionally caused shader stutters in a handful of games, my AMD experience was rough.",
                      "score": 2,
                      "created_utc": 1740084850.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mdy7ec6",
          "author": "scuffling",
          "body": "I decided I'm done with these Nvidia antics and went team red. I picked up a 7900xtx last month for $950. It was the 24gb Asrock phantom gaming OC edition. It's a nice upgrade from my 1080ti 11gb.",
          "score": 2,
          "created_utc": 1740121062.0,
          "replies": []
        },
        {
          "id": "mdpu3t0",
          "author": "kevinzeroone",
          "body": "RT performance is sub-par.",
          "score": 2,
          "created_utc": 1740011279.0,
          "replies": []
        },
        {
          "id": "mdr5k2y",
          "author": "Happydenial",
          "body": "I own one and for raw non ray tracing performance it’s freaking fantastic! And honestly ray tracing is like 3D tvs.. I’ve never played a game and thought “this sucks.. if only it had ray tracing” also just look at RDR2.. no ray tracing in site and wow is that beautiful.. so yeah I’m happy with it.. I just wished AI stuff worked ok..",
          "score": 1,
          "created_utc": 1740028233.0,
          "replies": []
        },
        {
          "id": "mdmnmfb",
          "author": "Initial_Green9278",
          "body": "Lol that’s just a hate comment and nothing to do with prices. 5070 Ti has the same price as 7900XTX after bumped msrp but performs better",
          "score": -59,
          "created_utc": 1739979517.0,
          "replies": [
            {
              "id": "mdmq7ms",
              "author": "gcracks96",
              "body": "It doesn't perform better tho..",
              "score": 27,
              "created_utc": 1739980248.0,
              "replies": [
                {
                  "id": "mdmqg40",
                  "author": "Initial_Green9278",
                  "body": "It does. Many comparison videos and ofc all downvotes are from AMD fans as always.",
                  "score": -56,
                  "created_utc": 1739980314.0,
                  "replies": [
                    {
                      "id": "mdmtask",
                      "author": "gcracks96",
                      "body": "I just watched GN video and the only time a 5070ti beats a 7900xtx is in efficiency, not performance 💀",
                      "score": 36,
                      "created_utc": 1739981105.0,
                      "replies": [
                        {
                          "id": "mdnjaqq",
                          "author": "Blapanda",
                          "body": "People like him will never comply to real given technical facts. He is just here about to simp for Nvidia, trust me.\n\nYou are wasting your time by replying someone who accepted extreme premium prices for less performance and less overall \"I got to hold some good shit in my hands\"-type of premium ware in their own hands. It's like people buying steel case $90+ premium edition games without the damn game (CD / DVD) inside it and calling it \"superb!\".",
                          "score": 16,
                          "created_utc": 1739988131.0,
                          "replies": [
                            {
                              "id": "mdnk3f0",
                              "author": "gcracks96",
                              "body": "Yeah I know, I just love to bait the glazers with saying even more stupid sh*t than they already say.",
                              "score": 9,
                              "created_utc": 1739988344.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mdnm1i4",
                      "author": "Gloriathewitch",
                      "body": "jensen huang isn't gonna pick you bro, nvidia and all corporations don't care about us",
                      "score": 8,
                      "created_utc": 1739988869.0,
                      "replies": []
                    },
                    {
                      "id": "mdoi3cy",
                      "author": "CradleRobin",
                      "body": "Did you not watch Gamers Nexus? It really doesn't and one you can buy right now.",
                      "score": 6,
                      "created_utc": 1739997441.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdnyenl",
      "author": "authorizedscott",
      "body": "Cheaper… right…",
      "score": 6,
      "created_utc": 1739992181.0,
      "replies": []
    },
    {
      "id": "mdma8if",
      "author": "TheBowerbird",
      "body": "Meanwhile, back in reality... The Verge has always been garbage.  \n[https://www.reddit.com/r/pcmasterrace/comments/1it6a3u/do\\_not\\_buy\\_the\\_nvidia\\_rtx\\_5070\\_ti/](https://www.reddit.com/r/pcmasterrace/comments/1it6a3u/do_not_buy_the_nvidia_rtx_5070_ti/)",
      "score": 39,
      "created_utc": 1739975442.0,
      "replies": [
        {
          "id": "mdmpsty",
          "author": "AzorAhai1TK",
          "body": "Just wait for MSRP lol..",
          "score": -14,
          "created_utc": 1739980133.0,
          "replies": [
            {
              "id": "mdmqx10",
              "author": "thedoc90",
              "body": "Doubt it will ever be msrp.",
              "score": 11,
              "created_utc": 1739980444.0,
              "replies": [
                {
                  "id": "mdmr37w",
                  "author": "AzorAhai1TK",
                  "body": "That's an absurd thing to believe for a 70 class card. Just blindly doomering.",
                  "score": -16,
                  "created_utc": 1739980491.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdnndjt",
      "author": "eXodiquas",
      "body": "When did we start to pay more than 1000 dollars for a consumer grade GPU? lol",
      "score": 6,
      "created_utc": 1739989229.0,
      "replies": []
    },
    {
      "id": "mdmf9td",
      "author": "ADtotheHD",
      "body": "Downvote this on the title alone. It is NOT cheaper.",
      "score": 24,
      "created_utc": 1739977038.0,
      "replies": [
        {
          "id": "mdnrt49",
          "author": "Sakushiii",
          "body": "it's also not a 4080. In all comparisons its between a 4070ti super and 4080 if not closer to the 4070ti super.",
          "score": 13,
          "created_utc": 1739990411.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdmkoyt",
      "author": "Onetimehelper",
      "body": "I hope all consumers know by now that the MRSP is not real. Easily add 20-30% on top + more. \n\nIt is a more expensive 4080 with FGx4 instead of x2 (which you need high frame rates at baseline for anyways), improved AI (which free Deepseek is better than any local LLM you make with this) and smooth motion (which you can turn on your TV if you’re into the soap opera effect). \n\nThis gen is a joke and it’s a shame AMD isn’t capitalizing on this with better prices. ",
      "score": 23,
      "created_utc": 1739978675.0,
      "replies": [
        {
          "id": "mdn8g6e",
          "author": "Eokokok",
          "body": "I hope all Redditors knows that buying over MRSP because you want it and don't want to wait a few months is on you. Consumer decisions being terrible are still consumer decisions, not sellers issue.",
          "score": 11,
          "created_utc": 1739985226.0,
          "replies": [
            {
              "id": "mds4krb",
              "author": "Nagemasu",
              "body": "> I hope all Redditors knows that buying over MRSP\n\nFE cards are limited stock and few AIB GPU's are ever MSRP, and when they are, they often come with various corners being cut. The profit margin on AIB GPU if sold at NVIDIA's pricing is tiny which is often why we see them making these wild designs like the SUPRM that cost so much more than  the cheaper versions of the same GPU.",
              "score": 1,
              "created_utc": 1740047717.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdorr42",
          "author": "BalooBot",
          "body": "I really wish nvidia would strongarm retailers into following msrp. Many companies do this already, sony for example couldn't keep ps5's on the shelves for literal years, but you never saw their prices jacked up by retailers. All they would have to do is add a clause in their sales contract, and retailers either agree or don't receive stock. It wouldn't cost them anything, they're not the ones making bank by jacking up the prices, and it would be a huge gain in terms of their reputation as a company and help develop brand loyalty.",
          "score": 1,
          "created_utc": 1740000005.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdn5fpf",
      "author": "Niibler",
      "body": "The Verge forgot to check the real prices....",
      "score": 5,
      "created_utc": 1739984415.0,
      "replies": []
    },
    {
      "id": "mdnp7ja",
      "author": "Sentient545",
      "body": "\"Cheaper\"... I'd like to see The Verge actually try to find one of these things for $750.",
      "score": 4,
      "created_utc": 1739989714.0,
      "replies": []
    },
    {
      "id": "mdn9mvo",
      "author": "CaveManta",
      "body": "So basically, the 5080 is the 4080 Super but with less availability and more scalping... And the 5070 Ti is the cheaper 4080. The model numbers are being upscaled, as usual.",
      "score": 3,
      "created_utc": 1739985544.0,
      "replies": []
    },
    {
      "id": "mdna68s",
      "author": "stqui",
      "body": "I’m still gaming on my 1080 ti and hoped that I would be able to upgrade to a 5000 series card. Guess I’ll have to wait some more…",
      "score": 3,
      "created_utc": 1739985688.0,
      "replies": [
        {
          "id": "mdng51b",
          "author": "AileStriker",
          "body": "If you snag one at MSRP (PNY and Asus should have a model at launch) it would be some of the best price/performance you can get right now with 7900xtx prices way up and the used market being an absolute shit show",
          "score": -1,
          "created_utc": 1739987291.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdngfi9",
      "author": "RailGun256",
      "body": "\"cheaper\" I call BS",
      "score": 3,
      "created_utc": 1739987369.0,
      "replies": []
    },
    {
      "id": "mdmhydf",
      "author": "Va1crist",
      "body": "It’s not cheaper …",
      "score": 9,
      "created_utc": 1739977871.0,
      "replies": []
    },
    {
      "id": "mdm8dug",
      "author": "OriVerda",
      "body": "Ti? Shouldn't those come out much later?",
      "score": 10,
      "created_utc": 1739974842.0,
      "replies": [
        {
          "id": "mdm911b",
          "author": "luaps",
          "body": "this started last gen when nvidia wanted to release two 4080s, one 16gb and one 12gb. they caught so much flak for that, that they renamed the 4080 12gb to 4070Ti. seems they are doing the same thing again. \n\nfun fact: this is how we ended up with the ungodly name of 4070 Ti Super.",
          "score": 26,
          "created_utc": 1739975049.0,
          "replies": []
        },
        {
          "id": "mdm8mdn",
          "author": "MCA2142",
          "body": "Honestly, Nvidia product names no longer mean anything.",
          "score": 45,
          "created_utc": 1739974918.0,
          "replies": []
        },
        {
          "id": "mdmc5be",
          "author": "Marcos340",
          "body": "What you mean? Usually the later SKU is the Super, which is meant as a refresh, Ti is to denote a different die being used but close to the regular model.",
          "score": 3,
          "created_utc": 1739976052.0,
          "replies": [
            {
              "id": "mdmd613",
              "author": "Sargatanas2k2",
              "body": "Usually? They have only been using the \"super\" branding at all since the 1660. Before that it was only Ti.",
              "score": 3,
              "created_utc": 1739976377.0,
              "replies": [
                {
                  "id": "mdnqhhi",
                  "author": "_Zekken",
                  "body": "No they havent. I had a GTX 660 Super waay back in the day, so the Super branding isnt new",
                  "score": 1,
                  "created_utc": 1739990056.0,
                  "replies": [
                    {
                      "id": "mdnrdoj",
                      "author": "Sargatanas2k2",
                      "body": "There was an EVGA 660 Superclocked edition but there was absolutely not a Geforce 660 Super. There WAS  a 1660 Super but that was mentioned and far more recent.",
                      "score": 1,
                      "created_utc": 1739990296.0,
                      "replies": [
                        {
                          "id": "mdnvqgb",
                          "author": "_Zekken",
                          "body": "I have just re checked, you are correct it was a Superclocked. \n\nFooled myself by 10 years of memory and super in the name. Oof",
                          "score": 2,
                          "created_utc": 1739991460.0,
                          "replies": [
                            {
                              "id": "mdnwas0",
                              "author": "Sargatanas2k2",
                              "body": "No worries mate, no harm done.",
                              "score": 1,
                              "created_utc": 1739991612.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mdnmwv6",
                  "author": "darkmacgf",
                  "body": "The 1660 is ancient now. That card's 6 years old.",
                  "score": 0,
                  "created_utc": 1739989104.0,
                  "replies": [
                    {
                      "id": "mdnnte7",
                      "author": "Sargatanas2k2",
                      "body": "It was EOL'd last year, hardly ancient and graphics cards have been around a LOT longer than 6 years. The Ti4600 came out in 2003.",
                      "score": 2,
                      "created_utc": 1739989347.0,
                      "replies": []
                    },
                    {
                      "id": "mds55fc",
                      "author": "Nagemasu",
                      "body": "Brother the 1080ti is 8 years old and only just becoming obsolete. *That's* ancient. The 1660 might not be powerful, but that doesn't make it ancient.",
                      "score": 2,
                      "created_utc": 1740048057.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdmrczw",
      "author": "TheLegendD4RK",
      "body": "It's not even cheaper 4080 if the msrp was real, it has same performance as 4080 in some cases and same performance as 4070ti super in others, specially what Nvidia says their GPUs are great at ray tracing!, this gpu is just another disappointing card from this generation.",
      "score": 6,
      "created_utc": 1739980567.0,
      "replies": []
    },
    {
      "id": "mdmsgrh",
      "author": "EnderB3nder",
      "body": "\\*out of stock",
      "score": 2,
      "created_utc": 1739980873.0,
      "replies": []
    },
    {
      "id": "mdngfn7",
      "author": "LuckyBahamut",
      "body": "Running a 1070 on an Alienware because it was the only way I could upgrade my PC during the Bitcoin mining craze. Now thanks to the AI boom, I still can't even find a 4070 Ti Super. \n\nGuess I'll just never be able to play games that have come out in the last 5 years at 1440p on a setting higher than \"Low\"?",
      "score": 2,
      "created_utc": 1739987370.0,
      "replies": []
    },
    {
      "id": "mdrkyom",
      "author": "MrMuunster",
      "body": "Reminder that newer 70's class used to have better performance than older 80's class card, Don't settle for garbo.",
      "score": 2,
      "created_utc": 1740035967.0,
      "replies": []
    },
    {
      "id": "mdmgwln",
      "author": "Giodude12",
      "body": "It ain't gonna be cheaper, it lacks physx, it'll be harder to find for a while and if it's anything like the 5080/90 it might blow up.\n\nI think I'm good.",
      "score": 3,
      "created_utc": 1739977550.0,
      "replies": [
        {
          "id": "mdmpx76",
          "author": "AzorAhai1TK",
          "body": "It only lacks 32 bit physx, only for games like 11-15 years old.",
          "score": 4,
          "created_utc": 1739980167.0,
          "replies": [
            {
              "id": "mdna2dm",
              "author": "Giodude12",
              "body": "Nearly all games using physx are 32 bit and CPU physx drops frame rates by a lot even on modern systems. \n\nIt's not a gigantic deal breaker but these cards are facing a death by a thousand papercuts",
              "score": 0,
              "created_utc": 1739985660.0,
              "replies": [
                {
                  "id": "mdnsu9p",
                  "author": "volfin",
                  "body": "Nobody has made a 32 bit game in over a decade.",
                  "score": 2,
                  "created_utc": 1739990687.0,
                  "replies": [
                    {
                      "id": "mdnwjyq",
                      "author": "gtsgunner",
                      "body": "How old is borderlands 2? That was the primo physx game for me back in the day.",
                      "score": 2,
                      "created_utc": 1739991679.0,
                      "replies": [
                        {
                          "id": "mdo906q",
                          "author": "UnknownCode",
                          "body": "2012...so over a decade",
                          "score": 2,
                          "created_utc": 1739995016.0,
                          "replies": [
                            {
                              "id": "mdoxapq",
                              "author": "gtsgunner",
                              "body": "Yeah it's a game I'd still play and would be kind of annoyed that suddenly on my new gpu I can't run physx on it because \"game is old\"",
                              "score": 2,
                              "created_utc": 1740001485.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mdoqmlq",
                      "author": "keklol69",
                      "body": "I’m pretty sure Fallout 4 squeezes in (just).",
                      "score": 1,
                      "created_utc": 1739999707.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdnkohg",
      "author": "CamiloArturo",
      "body": "It might have an MSRP of $100, still it’s going to be sold for $2000 or not available in any site in the world",
      "score": 2,
      "created_utc": 1739988503.0,
      "replies": []
    },
    {
      "id": "mdpxiq4",
      "author": "ChefCurryYumYum",
      "body": "It's NOT cheaper. \n\nDon't believe me?\n\nGo try to buy one.",
      "score": 2,
      "created_utc": 1740012375.0,
      "replies": []
    },
    {
      "id": "mdndeo5",
      "author": "The_Pandalorian",
      "body": "Imagine being a so-called \"tech journalist\" in 2025 and believing that MSRPs exist in the 5000 series GPU world.",
      "score": 1,
      "created_utc": 1739986555.0,
      "replies": []
    },
    {
      "id": "mdngl5f",
      "author": "clockworkred360",
      "body": "I’m so glad I decided to upgrade from a 3060 to a 4070 super before these 50 series launched tbh",
      "score": 1,
      "created_utc": 1739987411.0,
      "replies": []
    },
    {
      "id": "mdnlh78",
      "author": "IrishBehemoth",
      "body": "Just bought a 6800 xt for my new build never been happier. Gonna give Nvidia a few generations to come back to reality before considering one of their cards again",
      "score": 1,
      "created_utc": 1739988718.0,
      "replies": []
    },
    {
      "id": "mdnlovq",
      "author": "Gloriathewitch",
      "body": "pcpartpicker has 4080S for 1100 \n\n\nthis is not cheaper.",
      "score": 1,
      "created_utc": 1739988775.0,
      "replies": []
    },
    {
      "id": "mdo324t",
      "author": "Rogerjak",
      "body": "Buying a 6800xt in 2023 for 600 euros was the best decision I've ever made in terms of PC building.",
      "score": 1,
      "created_utc": 1739993425.0,
      "replies": []
    },
    {
      "id": "mdo4vd0",
      "author": "Chronotaru",
      "body": "I bought a used RTX 2080 full desktop system for 450€ to play a few VR games I wanted that weren't on my PS5. I think I'm fine leaving these cards to other people.",
      "score": 1,
      "created_utc": 1739993915.0,
      "replies": []
    },
    {
      "id": "mdoig46",
      "author": "Kitakitakita",
      "body": "great, now make it available for purchase",
      "score": 1,
      "created_utc": 1739997535.0,
      "replies": []
    },
    {
      "id": "mdp3n0o",
      "author": "Jase_the_Muss",
      "body": "![gif](giphy|h0MTqLyvgG0Ss)\n\nTell that to MSI et al.",
      "score": 1,
      "created_utc": 1740003220.0,
      "replies": []
    },
    {
      "id": "mdpni31",
      "author": "MicahBurke",
      "body": "Gold, cheaper than platinum.",
      "score": 1,
      "created_utc": 1740009197.0,
      "replies": []
    },
    {
      "id": "mdpo873",
      "author": "cream_of_human",
      "body": "Correction:\n\nA same priced slightly worse 4080",
      "score": 1,
      "created_utc": 1740009426.0,
      "replies": []
    },
    {
      "id": "mdppl0h",
      "author": "MyMicGoBoom",
      "body": "I'm gonna die with this 3090 ti",
      "score": 1,
      "created_utc": 1740009850.0,
      "replies": []
    },
    {
      "id": "mdqhpcv",
      "author": "SuperMarioBrother64",
      "body": "I'm in the market for a new GPU. Ideally, I'd like a 5080, but I k ow those will be impossible to find for a while. If I walk into Best Buy and they have a 5070ti for MSRP of $750, I'd buy it",
      "score": 1,
      "created_utc": 1740019142.0,
      "replies": []
    },
    {
      "id": "mdqiqhh",
      "author": "Arandul",
      "body": "I mean, nothing drove me away from the “PC Master Race” into the arms of console peasantry faster than the insane costs of cards and builds in general over the last few years.  No amount of frames are worth it at this point.",
      "score": 1,
      "created_utc": 1740019503.0,
      "replies": []
    },
    {
      "id": "mdquxjg",
      "author": "Fire_Lord_Cinder",
      "body": "Alternative take: it’s a worse 4080 super for about the same price",
      "score": 1,
      "created_utc": 1740023898.0,
      "replies": []
    },
    {
      "id": "mds7kx1",
      "author": "ohiocodernumerouno",
      "body": "4090 barely hits 240hz. seems like once the 50's series launch my 4090 can finally hit 240hz on low settings.",
      "score": 1,
      "created_utc": 1740049452.0,
      "replies": []
    },
    {
      "id": "mdu30yt",
      "author": "SetoXlll",
      "body": "Following",
      "score": 1,
      "created_utc": 1740072527.0,
      "replies": []
    },
    {
      "id": "mdx9slz",
      "author": "NoUsername868",
      "body": "I was so keen on buying an Intel arc b580 to test. Can't find one anywhere.",
      "score": 1,
      "created_utc": 1740107326.0,
      "replies": []
    },
    {
      "id": "me2dvlh",
      "author": "a4moondoggy",
      "body": "ive watched about 20 youtube vids on this release that address how msrp no longer matters...i dont think the verge got the memo",
      "score": 1,
      "created_utc": 1740175269.0,
      "replies": []
    },
    {
      "id": "mee6k4u",
      "author": "jarofcomics77",
      "body": "i’m about to to unretire my gtx 970 cuz my rx580 died and I don’t have money for new stuff",
      "score": 1,
      "created_utc": 1740339743.0,
      "replies": []
    },
    {
      "id": "mex5mxq",
      "author": "ADKiller1",
      "body": "Cheaper where? I only see it at about 1200+ dollars compared to 4080 super at about 800",
      "score": 1,
      "created_utc": 1740591771.0,
      "replies": []
    },
    {
      "id": "mdn3ivw",
      "author": "Reggitor360",
      "body": "*the more expensive 4070Ti Super 5%.",
      "score": 1,
      "created_utc": 1739983902.0,
      "replies": []
    },
    {
      "id": "mdnsx4i",
      "author": "saposapot",
      "body": "Even at 749 it’s still a very expensive card so a bit irrelevant for 80% of folks. I’ll keep waiting to the mid and lower tiers to see how this generation goes. \n\nThis actually doesn’t look too bad if the price is that one",
      "score": 1,
      "created_utc": 1739990708.0,
      "replies": []
    },
    {
      "id": "mdmq2y9",
      "author": "AzorAhai1TK",
      "body": "It feels like this entire thread doesn't get the concept of waiting for MSRP. Price will come down, you don't need the card Day 1.",
      "score": -1,
      "created_utc": 1739980211.0,
      "replies": [
        {
          "id": "mdmxoay",
          "author": "Kujen",
          "body": "The way the tariffs and inflation are going they may never sell at that MSRP ever again. At least for the US.",
          "score": 9,
          "created_utc": 1739982315.0,
          "replies": [
            {
              "id": "mdn3x64",
              "author": "Oh_ffs_seriously",
              "body": ">At least for the US.\n\n5080s go for 50% over MSRP, at least, here in the Eastern Europe.",
              "score": 6,
              "created_utc": 1739984009.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdrv0de",
          "author": "OMGItsCheezWTF",
          "body": "Cards 2 generations old are still selling at over MSRP because Nvidia is tightly controlling stock of them, for instance the 4000 series was essentially removed from stores in the run up to the 5000 series launch.",
          "score": 1,
          "created_utc": 1740041975.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdobdn4",
      "author": "Noxious89123",
      "body": "Bullshit review, they're not really cheaper.",
      "score": 0,
      "created_utc": 1739995653.0,
      "replies": []
    },
    {
      "id": "mdr6218",
      "author": "ZarafFaraz",
      "body": "My GTX 1080 Ti still serves me well. Never felt the need to upgrade.",
      "score": 0,
      "created_utc": 1740028455.0,
      "replies": [
        {
          "id": "mduf23w",
          "author": "EconomistSuper7328",
          "body": "My 1070 is still holding up.",
          "score": 2,
          "created_utc": 1740075788.0,
          "replies": []
        }
      ]
    }
  ]
}