{
  "post": {
    "title": "Alef aeronautics’ drivable flying car takes flight for the first time",
    "author": "diacewrb",
    "id": "1iumsi7",
    "score": 1925,
    "created_utc": 1740129229.0,
    "selftext": "",
    "num_comments": 323,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iumsi7/alef_aeronautics_drivable_flying_car_takes_flight/"
  },
  "comments": [
    {
      "id": "mdyn281",
      "author": "iwishihadnobones",
      "body": "Is this not just a big drone in a car skin?",
      "score": 775,
      "created_utc": 1740130146.0,
      "replies": [
        {
          "id": "mdyow8i",
          "author": "le66669",
          "body": "Looks like it. With some super lightweight bicycle wheels.",
          "score": 308,
          "created_utc": 1740131248.0,
          "replies": [
            {
              "id": "me2kwsq",
              "author": "Knut79",
              "body": "Lol yeah. \"Protecting our intellectual scs...uh.. Property \"...\n\nYou have to be Nigeria mail cmvicti. Level of naive to buy into this.",
              "score": 29,
              "created_utc": 1740177366.0,
              "replies": []
            },
            {
              "id": "me00mao",
              "author": "PrestigiousEvent7933",
              "body": "There was video somewhere on TikTok and it sounded like it too",
              "score": 25,
              "created_utc": 1740151120.0,
              "replies": [
                {
                  "id": "me1iaxp",
                  "author": "azlan194",
                  "body": "Did you click the link of the post? Theres video there as well. No need to go to TikTok.",
                  "score": 21,
                  "created_utc": 1740166143.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me3xq16",
              "author": "manga311",
              "body": "Why would you need big wheels if you are flying.",
              "score": 1,
              "created_utc": 1740197229.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdzacm8",
          "author": "Xenobsidian",
          "body": "Yes! Technically it’s a multicopter since a drone would be unmanned. But nonetheless, nothing earthshaking here.",
          "score": 70,
          "created_utc": 1740142240.0,
          "replies": [
            {
              "id": "me01mt2",
              "author": "JaggedMetalOs",
              "body": "Are we actually sure someone is riding it in that video though? It looks so flimsy and unstable I'm not convinced it can actually carry a person...",
              "score": 25,
              "created_utc": 1740151415.0,
              "replies": [
                {
                  "id": "me0vcmn",
                  "author": "unfinishedtoast3",
                  "body": "Ya the founder dude is in there.\n\nI watched an interview with him on BBC I want to say, last week. He wouldn't let them film the inside of the \"car\" wouldn't allow them close ups or even let them get within like 50 feet of it.\n\n\nThen he jumped in it and flew like 15 feet above the ground while another car drove under him. He said it could also be driven like a normal car, but he didn't show that and I absolutely doubt it has a standard engine AND drone fans.\n\n\nIt's just a massive drone in a car shell",
                  "score": 50,
                  "created_utc": 1740159750.0,
                  "replies": [
                    {
                      "id": "me2a2zp",
                      "author": "TPlain940",
                      "body": ">I watched an interview with him on BBC I want to say, last week. He wouldn't let them film the inside of the \"car\" wouldn't allow them close ups or even let them get within like 50 feet of it.\n\nThe ol' Theranos strategy.",
                      "score": 32,
                      "created_utc": 1740174183.0,
                      "replies": [
                        {
                          "id": "mgzyn2s",
                          "author": "Human-Assumption-524",
                          "body": "I mean it is an actual vehicle. Whether or not it meets the specifications they claim or actually makes it to production (which neither will probably be the case) is another thing. In the case of Theranos they never even had a prototype just hype.",
                          "score": 1,
                          "created_utc": 1741601046.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "me21r1j",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 15,
                      "created_utc": 1740171820.0,
                      "replies": [
                        {
                          "id": "me5qav9",
                          "author": "JKdriver",
                          "body": "I was JUST thinking that. Or every other world changing IPO recently. Just a scam.",
                          "score": 3,
                          "created_utc": 1740230074.0,
                          "replies": []
                        },
                        {
                          "id": "me4povm",
                          "author": "greenskinmarch",
                          "body": "Also sounds like a beehive. Seems like it would make you go deaf.",
                          "score": 3,
                          "created_utc": 1740210810.0,
                          "replies": []
                        },
                        {
                          "id": "me2n96h",
                          "author": "Minimum-Web-6902",
                          "body": "Maybe it has a transmission to go from drone to car?",
                          "score": 1,
                          "created_utc": 1740178077.0,
                          "replies": [
                            {
                              "id": "me30b4i",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1740182296.0,
                              "replies": [
                                {
                                  "id": "me3i53v",
                                  "author": "Minimum-Web-6902",
                                  "body": "That’s what I’m saying 4 motors right 2 drive shafts and a “transmission” that lets you switch from flying to driving. That would be fairly easy.",
                                  "score": 2,
                                  "created_utc": 1740191354.0,
                                  "replies": [
                                    {
                                      "id": "me8td7v",
                                      "author": "cvelde",
                                      "body": "I would imagine there is probably not an enormous amount of weight/cost/space savings to be found there, I imagine rpm and torque requirements for the two are wildly different and you could just have another motor instead of some huge transmission.",
                                      "score": 1,
                                      "created_utc": 1740263952.0,
                                      "replies": [
                                        {
                                          "id": "me8tu7d",
                                          "author": "Minimum-Web-6902",
                                          "body": "It would t even have to be that large they both use rotational force , for example the car boat has the exact same thing",
                                          "score": 1,
                                          "created_utc": 1740264104.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "me21leq",
                      "author": "psilent",
                      "body": "Yeah most likely they cant drive it yet, from the other images there seems to be nothing near the wheels that might be a motor.\n\nId still take a giant single seater drone though that sounds fun.",
                      "score": 1,
                      "created_utc": 1740171775.0,
                      "replies": []
                    },
                    {
                      "id": "me2lao4",
                      "author": "Knut79",
                      "body": "It's fairly easy to fake all that. Especially when the pilot of the drone inside the empty opaque shell is visible in the videos.",
                      "score": 1,
                      "created_utc": 1740177482.0,
                      "replies": []
                    },
                    {
                      "id": "me2n3e4",
                      "author": "Minimum-Web-6902",
                      "body": "Maybe it’s an electric car?",
                      "score": 1,
                      "created_utc": 1740178028.0,
                      "replies": [
                        {
                          "id": "me80eju",
                          "author": "antpile11",
                          "body": "Yes, it says it is in the article.",
                          "score": 1,
                          "created_utc": 1740255013.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "me31d6p",
                      "author": "bonafidebob",
                      "body": "There’s going to be a really long haul to get to crash protection while driving something like this on surface streets.   This looks like it would shatter with even a small front/side/rear impact test.  Maybe if they (somehow) register it as a motorcycle they can get around that?",
                      "score": 1,
                      "created_utc": 1740182649.0,
                      "replies": []
                    },
                    {
                      "id": "me63iu8",
                      "author": "Eleventy22",
                      "body": "Same with the spot I saw on the PBS News Hour. It reeked of snake oil",
                      "score": 1,
                      "created_utc": 1740234790.0,
                      "replies": []
                    },
                    {
                      "id": "me8cs0d",
                      "author": "selfishshishkabob",
                      "body": "This is every demo of these flying vehicles now. Only a couple are even semi-viable, most just barely make it off the ground for 10 seconds on an ideal day flown by the one guy that can stay perfectly balanced.",
                      "score": 1,
                      "created_utc": 1740258785.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "me0uo0n",
                  "author": "Xenobsidian",
                  "body": "That’s actually true. Who knows. It is supposed to carry one, but the first Tesla models were supposed to drive for more than a few minutes but they couldn’t. It was all a scam and this might be too. Jut to remind everyone that Elon was always full of shit.",
                  "score": 8,
                  "created_utc": 1740159564.0,
                  "replies": [
                    {
                      "id": "me1gci8",
                      "author": "Meleesucks11",
                      "body": "Remember the trains that were funded and later scrapped? Where the money go ELON?",
                      "score": 8,
                      "created_utc": 1740165592.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "me0ycoc",
              "author": "MarlonShakespeare2AD",
              "body": "Well. Not until it crashes.",
              "score": 3,
              "created_utc": 1740160573.0,
              "replies": []
            },
            {
              "id": "me2l2uj",
              "author": "Knut79",
              "body": "Oh this opaque thin plastic shell is very very much unmanned. You can even see the pilot with the cl troller on the ground...",
              "score": 3,
              "created_utc": 1740177416.0,
              "replies": []
            },
            {
              "id": "me4vjmm",
              "author": "ILikeCutePuppies",
              "body": "The cool thing is that the car sides become wings so that it can actually have more than a few minutes of flight time.  We'll that is the idea at least.  They are a long way off.",
              "score": 1,
              "created_utc": 1740214085.0,
              "replies": [
                {
                  "id": "me4wdgk",
                  "author": "Xenobsidian",
                  "body": "This will not take of (pun not intended) any when soon, because it does not solve any problem better than stuff we already have. It will be an expensive toy at best.",
                  "score": 1,
                  "created_utc": 1740214563.0,
                  "replies": [
                    {
                      "id": "me6oxe3",
                      "author": "ILikeCutePuppies",
                      "body": "You have a way of flying over the traffic congested city without switching vehicles?",
                      "score": 1,
                      "created_utc": 1740241463.0,
                      "replies": [
                        {
                          "id": "me6uagz",
                          "author": "Xenobsidian",
                          "body": "You don’t want to fly, you want to place the traffic in three dimensions. This technology is called bridges and tunnels. And for longer flights we have helicopters and airplanes. The issue with this concept is, it’s neither a good car, since most of it is an empty plastic shell, nor is it a good aircraft since it has to carry the extra weight of the empty plastic shell, wheels and what else it needs to pretend to be a car.\n\nIt’s like Swiss army knife, yes you have many options but neither of them is nearly as good as the dedicated tools would be.",
                          "score": 1,
                          "created_utc": 1740242979.0,
                          "replies": [
                            {
                              "id": "me6x02w",
                              "author": "ILikeCutePuppies",
                              "body": "You can't walk outside to your helicopter unless you are mega rich.  Planes only fly to certain places at certain times and sometimes you are sitting at the airport longer than the flight takes.  I have literally driven to Vagas from the airport in LA and gotten to the hotel before the plane I was going to take landed.\n\nThen you have to fly to dedicated ports and switch to a car, that's not anything like being able to drive to a dedicated fly location and immediately take off, then land and continue on your way.  There are significant amounts of downtime in between.\n\nThey will never be able to build enough bridges etc... to solve traffic.  Bridges/roads require a huge amount of investment, time, and negotiations, and often, they are just cancelled.  It's never going to be a good solution.\n\nI would consider this car closer to a motorbike.  You aren't gonna be using it exactly like a car, but it does take 2 passengers and has more protection than a motor bike with its protective dome.\n\nIt's still in very early concept phase, and it's probably not going to work well without using the most bleeding edge technology for motors and batteries.  I am not putting money on it, but I could see a company succeeding in this area at some point.",
                              "score": 1,
                              "created_utc": 1740243722.0,
                              "replies": [
                                {
                                  "id": "me6zful",
                                  "author": "Xenobsidian",
                                  "body": "Let me rephrase that, you don’t want to fly over the traffic, you want the traffic to work properly, and there are plenty of ways to achieve this. This thing will never be a commercial solution. Just imagine you want to fly over the traffic jam and the guy three cars before you takes off at the same time. Crash! Or imagine you can fly for three minutes but the line is so long that you can’t get a place to lend before you run out of energy? Crash!\n\nAnd we haven’t even started what licenses and legal requirements you need to operate the thing in the first place.\n\nI am sure, at one point it will be a a product you can buy, but it will be a rich people’s toy with very little practical applications. A dedicated multicopter that never tries to be a car, or sufficiently developed autonomous cars with a coordinated system that avoids traffic jams will be soooooo much more useful for the general customer.",
                                  "score": 1,
                                  "created_utc": 1740244399.0,
                                  "replies": [
                                    {
                                      "id": "me727tb",
                                      "author": "ILikeCutePuppies",
                                      "body": "I don't think initially these cars will be used the way in the video.  They'll drive to dedicated spots for taking off.  You might be able to get one at your home.  You'll also be able to land in dedicated spots.  I think it will be a long time until one is hopping over cars.\n\nThis is the same with other car planes that already are lisensed.  Licensing the owner of these things is not new. There are phase and they work with the FAA.  Initally, the vehicle requires a person have a pilot license.\n\nI agree that initially, the wealthy will have these, but that's how things normally work with technology.  Initally, only the wealth had cars.  I don't agree that it will never be able commerial solution.  We already have car planes that are purchasable see PAL-V.\n\nThere is always someone saying it won't work, and then 20 years later, it is common place.  I remember people laughing at the first delivery drones, for example, and now there are millions of drone deliveries a day.",
                                      "score": 1,
                                      "created_utc": 1740245180.0,
                                      "replies": [
                                        {
                                          "id": "me7hlpt",
                                          "author": "Xenobsidian",
                                          "body": ">I don’t think initially these cars will be used the way in the video.  They’ll drive to dedicated spots for taking off.  You might be able to get one at your home.  You’ll also be able to land in dedicated spots.  I think it will be a long time until one is hopping over cars.\n\nThis concept already exist for pure multicopter that does not waste recourses on the car part.\n\n>This is the same with other car planes that already are lisensed.  Licensing the owner of these things is not new. There are phase and they work with the FAA.  Initally, the vehicle requires a person have a pilot license.\n\nYes, and all of this concepts are just expensive toys.\n\n>I agree that initially, the wealthy will have these, but that’s how things normally work with technology.  Initally, only the wealth had cars.  I don’t agree that it will never be able commerial solution.  We already have car planes that are purchasable see PAL-V.\n\nBefore this will become commercially meaningful you already have commercials meaningful mylticopter services and autonomic cabs that solve the problem. It will not make sense to combine them.\n\n>There is always someone saying it won’t work, and then 20 years later, it is common place. \n\nAs you mentions, there are flying car concepts since decades and they never worked. But not because it is technically impossible, it obviously is, but because the actual problem it solves is solved easier another way and that will not change. The only possibility is, that tech billionaires take over and let the infrastructure of fall apart, then you need a vehicle that individually overcomes the issue. Under such circumstances it would start to make sense.\n\n>I remember people laughing at the first delivery drones, for example, and now there are millions of drone deliveries a day.\n\nThe delivery drones make sense under certain circumstances, but in other areas, where other forms of delivery work better, drones still have a hard time.",
                                          "score": 1,
                                          "created_utc": 1740249564.0,
                                          "replies": [
                                            {
                                              "id": "me7lbm4",
                                              "author": "ILikeCutePuppies",
                                              "body": "Divery drones really didn't exist 20 years ago.  Just because it doesn't exist now doesn't mean it won't in the future.  In the case of delivery drones, sure, they don't solve all cases, but they are expanding fast into more cases.  There were 800 though drone deliveries in 2023, and there are going to be millions in 2025.  By 2030 probably we'll probably be in the hundreds of millions of drone deliveries.\n\nIn the case of flying cars, no the current technology being used did not exist, and technology is a huge part of the hurdle.   Vtols and flying cars are much cheaper to develop today, for example, with better performance and safety characteristics which is needed for a technology to move towards increased adoption.",
                                              "score": 1,
                                              "created_utc": 1740250626.0,
                                              "replies": [
                                                {
                                                  "id": "me7odcg",
                                                  "author": "Xenobsidian",
                                                  "body": "You don’t quite get the point. The technology is secondary. There have been flying cars since decades. Just the demand for them is not there. Maybe a desire, sometimes, but if you consider all the hurdles it comes with, you suddenly think twice about it.\n\nWith drones it is completely different. They are comparably cheep, became reliable and improve a certain aspect of delivery cheeper than the alternatives could. That’s why they seem to be successful. The flying car, however, there will hardly ever be a demand that justifies the problems it has. Is it possible to build? Sure! Does it make a lot of sense? No.",
                                                  "score": 1,
                                                  "created_utc": 1740251503.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "me14y4m",
              "author": "GrynaiTaip",
              "body": "Multicopter is a drone that uses more than one propeller for lift. Regular typical ones are usually quadcopters.",
              "score": 1,
              "created_utc": 1740162399.0,
              "replies": [
                {
                  "id": "me19tzo",
                  "author": "Xenobsidian",
                  "body": "A drone is an unmanned vehicle, but this is at least supposed to be manned. Quadcopers are vehicles with four (exactly four, since quad means four) propeller.\n\nMylticopter are vehicles with any nimble of propeller more than one. I don’t know exactly how many propeller this thing has but if memory serves it was at least two, which is why I picked this term.",
                  "score": 4,
                  "created_utc": 1740163753.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "me29z1t",
          "author": "cloud1445",
          "body": "it’s a car in the same way that three kids stood on top of each other while wearing a trench coat are an adult.",
          "score": 12,
          "created_utc": 1740174152.0,
          "replies": []
        },
        {
          "id": "mdz7ulw",
          "author": "graesen",
          "body": "Drone means unmanned. Maybe quadcopter?",
          "score": 12,
          "created_utc": 1740141200.0,
          "replies": [
            {
              "id": "me0irtj",
              "author": "BizzyM",
              "body": "Drone should mean unmanned and autonomous.   \nThese are Remote or Radio Controlled (RC), but RC seems to mean almost exclusively \"toy\".\n\nQuadcopter should just apply to the method of locomotion; 4 rotors.  Quadcopter Drone vs RC quadcopter depending on method of control.",
              "score": 1,
              "created_utc": 1740156275.0,
              "replies": [
                {
                  "id": "me0ljsi",
                  "author": "Scurro",
                  "body": "RC hobbyists tried correcting the usage of \"drone\" from the public years ago.\n\nDrone is now just the go to word for anything small that flies without a human inside, even if the \"drone\" requires a human 100% of the time to operate.",
                  "score": 1,
                  "created_utc": 1740157045.0,
                  "replies": [
                    {
                      "id": "me194cg",
                      "author": "Elios000",
                      "body": "at this points its any thing thats mulit rotor with fixed pitch props... still nothing but gadget bombs to scam people for money \n\nthey do nothing you cant already do with helicopter",
                      "score": 1,
                      "created_utc": 1740163556.0,
                      "replies": [
                        {
                          "id": "me22ts3",
                          "author": "Scurro",
                          "body": "Nowadays fixed wing RC aircraft are also being called drones.",
                          "score": 1,
                          "created_utc": 1740172126.0,
                          "replies": []
                        },
                        {
                          "id": "me2m0r2",
                          "author": "Knut79",
                          "body": "That's not remotely true though. Anyone who's been flying rc for decades will tell you how wrong that is.",
                          "score": 0,
                          "created_utc": 1740177701.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "me2lu0r",
                      "author": "Knut79",
                      "body": "Except drone had mean rc craft for a couple of decades before that so w they were wrong. \n\nThe original use of drones where target practice rc planes. And towed planes and ships behind kilometer long cables for life fire target practice and weapons tests.",
                      "score": 1,
                      "created_utc": 1740177645.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "me2lk0z",
                  "author": "Knut79",
                  "body": "No drone doesn't mean autonomous. Just unmanned. Or rather remotely operated in some way",
                  "score": 1,
                  "created_utc": 1740177562.0,
                  "replies": [
                    {
                      "id": "me2ndcz",
                      "author": "BizzyM",
                      "body": "[oh?](https://www.dictionary.com/browse/drone)",
                      "score": 0,
                      "created_utc": 1740178112.0,
                      "replies": [
                        {
                          "id": "me4c9k6",
                          "author": "Knut79",
                          "body": "Dictionaries are surprisingly not a good source for accurate information.",
                          "score": 0,
                          "created_utc": 1740203644.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "me1bonw",
          "author": "True-Bandicoot3880",
          "body": "Right? Annoying that this is even an article",
          "score": 2,
          "created_utc": 1740164271.0,
          "replies": []
        },
        {
          "id": "me3mp6p",
          "author": "None",
          "body": "But it’s got wheels! It’s a car!",
          "score": 2,
          "created_utc": 1740193016.0,
          "replies": []
        },
        {
          "id": "me5zk12",
          "author": "Go_Nadds",
          "body": "It's actually three children in a trench coat.",
          "score": 2,
          "created_utc": 1740233449.0,
          "replies": []
        },
        {
          "id": "mdz6na8",
          "author": "One_Olive_8933",
          "body": "TBF, looks better than a cyber truck",
          "score": 7,
          "created_utc": 1740140687.0,
          "replies": [
            {
              "id": "me3xnru",
              "author": "lemonade_eyescream",
              "body": "that's a really low bar to clear lol",
              "score": 5,
              "created_utc": 1740197204.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me415fz",
          "author": "Treats",
          "body": " Crazy how much publicity this BS is getting",
          "score": 1,
          "created_utc": 1740198662.0,
          "replies": []
        },
        {
          "id": "me610oh",
          "author": "kurotech",
          "body": "If I don't see it drive it's not a car just a drone with wheels instead of feet lol",
          "score": 1,
          "created_utc": 1740233952.0,
          "replies": []
        },
        {
          "id": "me6npxl",
          "author": "gomurifle",
          "body": "And a drone is just a mini-quadcopter. So this is just a light weight quadcopter. ",
          "score": 1,
          "created_utc": 1740241088.0,
          "replies": []
        },
        {
          "id": "me98dzw",
          "author": "asheraze",
          "body": "I’ve heard many saying this about this vehicle but when we do figure out functional flying cars, won’t they just be big drones that can also drive on land and fit people?",
          "score": 1,
          "created_utc": 1740268938.0,
          "replies": [
            {
              "id": "me9y3ct",
              "author": "iwishihadnobones",
              "body": "I, mean, we'd be better off making a driving helicopter than a flying car",
              "score": 1,
              "created_utc": 1740277881.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mgzyehx",
          "author": "Human-Assumption-524",
          "body": "What exactly would a flying car be if not essentially a drone that is rideable and also able to drive along the ground?\n\nWhen it comes to evtols people weirdly seem to fall into a sort of \"no true scotsman\" argument.",
          "score": 1,
          "created_utc": 1741600905.0,
          "replies": [
            {
              "id": "mgzyncd",
              "author": "iwishihadnobones",
              "body": "Whats evtols?",
              "score": 1,
              "created_utc": 1741601050.0,
              "replies": [
                {
                  "id": "mh00s6v",
                  "author": "Human-Assumption-524",
                  "body": "Electric Take of and Landing vehicles. Basically electric helicopters/tiltrotors and \"flying cars\".\n\nA huge push in the modern aerospace industry is trying to replace existing fleets of aircraft with electric or low emission alternatives. For short duration flights they've found that vehicles that combine the vertical take off and landing capabilities of helicopters with the lifting body configuration of airplanes for horizontal flight allows for some of the best energy efficiency. Also because electric motors use fewer moving parts and maintenance some companies having been exploring them for use as air taxis or emergency vehicles which is where the comparison to flying cars comes in.  Since they would be small short trip vehicles that would be used within city limits but travel through the air.",
                  "score": 1,
                  "created_utc": 1741602311.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mdzmk7s",
          "author": "NoTourist5",
          "body": "flying by propeller driven dc batteries",
          "score": 1,
          "created_utc": 1740146693.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdyt7z1",
      "author": "JaggedMetalOs",
      "body": "Uh huh, so it's a drone that can barely hover and looks about as sturdy as wet toilet paper in a road / air accident.\n\n\nThis is just investor-bait.",
      "score": 214,
      "created_utc": 1740133813.0,
      "replies": [
        {
          "id": "mdzxry9",
          "author": "Patagonia202020",
          "body": "Anyone who watches this video and invest a single dime deserves to lose everything. That was so scary looking, like something a school science project in seventh grade would amount to",
          "score": 44,
          "created_utc": 1740150276.0,
          "replies": []
        },
        {
          "id": "me2jsm8",
          "author": "Corgiboom2",
          "body": "Most prototypes are investor-bait",
          "score": 5,
          "created_utc": 1740177026.0,
          "replies": [
            {
              "id": "me3dl3s",
              "author": "JaggedMetalOs",
              "body": "Yeah but some prototypes have a much more plausible path to a real product than others.",
              "score": 4,
              "created_utc": 1740189701.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me18byu",
          "author": "Elios000",
          "body": "> Sturdy as wet toilet paper in a road / air accident.\n\nwelcome to any thing that flys. this the big part why will never have flying cars or mulit rotors that will carry people",
          "score": 17,
          "created_utc": 1740163338.0,
          "replies": [
            {
              "id": "me3y0ue",
              "author": "lemonade_eyescream",
              "body": "Yup. Sturdy materials = more weight. Until a better propulsion system is invented that also doesn't require a fuckton of fuel, I doubt these will ever be more than flimsy ultralight craft.",
              "score": 6,
              "created_utc": 1740197354.0,
              "replies": []
            },
            {
              "id": "me3ec7e",
              "author": "JaggedMetalOs",
              "body": "> welcome to any thing that flys\n\n\nThat CRJ900 that flipped over in Toronto recently did pretty well, we're taking at least toilet paper tube here :)",
              "score": 1,
              "created_utc": 1740189973.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me3p71b",
          "author": "TheGreatKonaKing",
          "body": "Good thing most current drivers are extremely safe reliable",
          "score": 4,
          "created_utc": 1740193924.0,
          "replies": []
        },
        {
          "id": "me3c5xc",
          "author": "noodlesalad_",
          "body": "It looks like a school project",
          "score": 3,
          "created_utc": 1740189196.0,
          "replies": []
        },
        {
          "id": "me87jaj",
          "author": "sigridsnow",
          "body": "Who even wants this kinda thing any more? I literally just want to have a home, a garden and a vehicle to get groceries or a walkable shop and even that seems far fetched. These kind of projects are so unhelpful right now in my opinion when basic shit is unattainable for so many.",
          "score": 2,
          "created_utc": 1740257172.0,
          "replies": []
        },
        {
          "id": "me1ilkr",
          "author": "azlan194",
          "body": "Not to mention with those flimsy bicycle wheels, it also fails as a regular car, lol.",
          "score": 1,
          "created_utc": 1740166226.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdymu1y",
      "author": "igby1",
      "body": "Can we just skip ahead to teleportation",
      "score": 105,
      "created_utc": 1740130011.0,
      "replies": [
        {
          "id": "mdynjm2",
          "author": "passwordstolen",
          "body": "Those transportation tubes in Futurama look pretty cool.",
          "score": 50,
          "created_utc": 1740130439.0,
          "replies": [
            {
              "id": "mdzm6gl",
              "author": "None",
              "body": "And the suicide booths",
              "score": 20,
              "created_utc": 1740146563.0,
              "replies": [
                {
                  "id": "me0puxi",
                  "author": "MVPizzle_Redux",
                  "body": "Anywhere is a suicide booth if you try hard enough",
                  "score": 12,
                  "created_utc": 1740158242.0,
                  "replies": [
                    {
                      "id": "me0tc8l",
                      "author": "jacwub",
                      "body": "especially a certain political rally",
                      "score": -3,
                      "created_utc": 1740159199.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "me0ftq2",
                  "author": "FairlySuspicious",
                  "body": "We already got those, just gotta set them up in public spaces.",
                  "score": 3,
                  "created_utc": 1740155454.0,
                  "replies": []
                },
                {
                  "id": "me3r7nf",
                  "author": "Captainwumbombo",
                  "body": "25 cents is a hell of a deal, I think that was a pretty innacurate prediction. They would definitely upcharge it to at least $5.",
                  "score": 2,
                  "created_utc": 1740194679.0,
                  "replies": []
                },
                {
                  "id": "me70sx2",
                  "author": "CoeurdAssassin",
                  "body": "[Switzerland’s one step ahead of ya!](https://apnews.com/article/switzerland-suicide-capsule-sarco-exit-international-4bd25665896e4fc41986aed6e1752e60)",
                  "score": 2,
                  "created_utc": 1740244781.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mdz7d9c",
              "author": "NoseMuReup",
              "body": "Unless you don't know how to get off, like a ski lift.",
              "score": 3,
              "created_utc": 1740140997.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdzeqtn",
          "author": "rkcth",
          "body": "I read a short science fiction piece once and the premise was that teleporters worked by creating a clone of you that thinks it’s the original and then is supposed to destroy the original since it’s no longer a legal entity, but that instead they use the originals as slaves, so you would walk into a teleporter, and you would then be whisked off to a slave colony.  Even just the idea of me being destroyed so a copy can live sounds awful and I’m convinced that’s how any teleporter would work in actuality.",
          "score": 21,
          "created_utc": 1740143926.0,
          "replies": [
            {
              "id": "me10ml8",
              "author": "DadJokeBadJoke",
              "body": "I'll pass.  I've seen what happens when the copier gets jammed",
              "score": 5,
              "created_utc": 1740161204.0,
              "replies": []
            },
            {
              "id": "mdzzryi",
              "author": "igby1",
              "body": "Sounds like the movie >!The Prestige!<",
              "score": 4,
              "created_utc": 1740150871.0,
              "replies": [
                {
                  "id": "me0ldka",
                  "author": "Alkyan",
                  "body": "Also pretty much how transporters in star trek work.  Your completely disintegrated and then a new you is built from the scanned data, like how the replicator makes food.",
                  "score": 5,
                  "created_utc": 1740156998.0,
                  "replies": [
                    {
                      "id": "me3xpcv",
                      "author": "money_loo",
                      "body": "Except that one time they accidentally left the real Riker behind on some planet and it cloned him on the enterprise.",
                      "score": 1,
                      "created_utc": 1740197221.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "me0f9xy",
          "author": "Jota769",
          "body": "Nah I read Stephen King’s The Jaunt, I’m good.",
          "score": 5,
          "created_utc": 1740155301.0,
          "replies": []
        },
        {
          "id": "mdz9320",
          "author": "AtariAtari",
          "body": "No, you have to live through the bad drivers to bad flyers stage first.\n\n![gif](giphy|P1PemPnyp4g1i)",
          "score": 5,
          "created_utc": 1740141724.0,
          "replies": []
        },
        {
          "id": "me2uln2",
          "author": "None",
          "body": "So long as it doesnt kill us each time.",
          "score": 2,
          "created_utc": 1740180408.0,
          "replies": []
        },
        {
          "id": "me4fra0",
          "author": "Upstairs_Onion5104",
          "body": "cx-4 density shift moscovium-299",
          "score": 1,
          "created_utc": 1740205410.0,
          "replies": []
        },
        {
          "id": "me6nvkr",
          "author": "gomurifle",
          "body": "You try the machine first! ",
          "score": 1,
          "created_utc": 1740241138.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdynpdz",
      "author": "zandadoum",
      "body": "Airplanes are falling outta the sky all over USA and now we wanna add millions of cars to that? xD",
      "score": 84,
      "created_utc": 1740130537.0,
      "replies": [
        {
          "id": "me1jm3l",
          "author": "ExoSierra",
          "body": "People can’t even be trusted in cars on the ground. Mfers gonna be drunk flying into buildings and shit",
          "score": 7,
          "created_utc": 1740166514.0,
          "replies": [
            {
              "id": "me22iht",
              "author": "ISLAndBreezESTeve10",
              "body": "Nope.   Just hit the auto-pilot.  “Hey siri… take me home.”    Out",
              "score": 3,
              "created_utc": 1740172038.0,
              "replies": []
            },
            {
              "id": "me2sozn",
              "author": "a_latvian_potato",
              "body": "\"Sir, a second car has hit the tower...\"",
              "score": 2,
              "created_utc": 1740179785.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdyopxj",
          "author": "dandeeago",
          "body": "But cars have airbags, planes do not, so.. cars in the sky should be a lot safer.",
          "score": 27,
          "created_utc": 1740131144.0,
          "replies": [
            {
              "id": "mdyrj3l",
              "author": "MadK9TheReal1",
              "body": "😂😂😂",
              "score": 3,
              "created_utc": 1740132816.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mdzgc6g",
          "author": "blackop",
          "body": "![gif](giphy|gKfyusl0PRPdTNmwnD)",
          "score": 8,
          "created_utc": 1740144516.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdytxqv",
      "author": "mudokin",
      "body": "We already have flying cars. They are called helicopters. They have been engineered to be as safe and efficient as possible.\n\nFlying cars are undesirable until we fix the noise they make and the power they use.\nIt costs much more energy to lift something up from the ground than to move it on wheels. At least when it'd only a couple passengers.\n\nI dint want these thing flying around, unless we find a way to make them as silent and save as a normal car.\nImagine the noise pollution from all that, no thanks, the normal traffic is already utterly annoying.",
      "score": 60,
      "created_utc": 1740134231.0,
      "replies": [
        {
          "id": "me0auf5",
          "author": "SedatedAndAmputated",
          "body": "Typically, a flying car is thought of as a car that flies.  It’s pretty self explanatory.  I’ve never seen any helicopters driving down the road.  Have you?",
          "score": 15,
          "created_utc": 1740154045.0,
          "replies": [
            {
              "id": "me1iuv5",
              "author": "mudokin",
              "body": "You may be right, but look at that thing, this is a remote control drone in car form.\n\nThey claim 110 miles flight range and 200 miles road range, but if you look at the top view, that this is a capsule that houses 2 people, surrounded by nothing, it's just an empty grid with 4 propellers and 4 wheels. There is zero space for batteries.\n\nThey have 4 people easily lift the thing so it can't be heavy. Even the SMART EV car battery is 170kilos, and only gives that car a rage if 160 kilometers, this is smoke and mirrors.\n\nBest thing is they are taking preorders.",
              "score": 16,
              "created_utc": 1740166300.0,
              "replies": [
                {
                  "id": "me1ka17",
                  "author": "SedatedAndAmputated",
                  "body": "It’s more of a car than a helicopter is.",
                  "score": -1,
                  "created_utc": 1740166702.0,
                  "replies": [
                    {
                      "id": "me23xui",
                      "author": "Camerotus",
                      "body": "From what is shown in the video its driving capabilities match those of a helicopter: zero.",
                      "score": 9,
                      "created_utc": 1740172446.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "me2xxqi",
              "author": "OneBigBug",
              "body": ">Typically, a flying car is thought of as a car that flies.\n\n> I’ve never seen any helicopters driving down the road.\n\n...Is that actually what people think of when they think of flying cars?\n\nLike, I realize it's pithy and all, but thinking back to all the science fiction I've ever seen that had \"flying cars\", many of them were not particularly suited to ground transport. [Flying car](https://thejetsons.fandom.com/wiki/Flying_Car), [flying car](https://www.youtube.com/watch?v=5KSwXWH-Sj0), [hover car.](https://futurama.fandom.com/wiki/Beta_Romeo)\n\nA flying car is a car that flies, but the part of the thing that makes it a car is the fact that it's got a passenger cabin, and can be operated by members of the general public, not that it can also be operated on the roads.",
              "score": 4,
              "created_utc": 1740181516.0,
              "replies": [
                {
                  "id": "me2yhu1",
                  "author": "SedatedAndAmputated",
                  "body": "A helicopter is not a car.",
                  "score": -1,
                  "created_utc": 1740181699.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me17z8r",
              "author": "Elios000",
              "body": "i have its called hover taxi.... you can just fly few inches off the ground... you still have ALL the same issues. ever seen 2 cars hit at 60mph? ever seen whats left of light aircraft after it hits something? do you want to be hit by a SUV in whats effectively a light aircraft?",
              "score": 2,
              "created_utc": 1740163240.0,
              "replies": [
                {
                  "id": "me1ducd",
                  "author": "SedatedAndAmputated",
                  "body": "Yeah, I don’t think it’s a good idea.  I never said it was.  I was simply pointing out that a helicopter is not a car.",
                  "score": 2,
                  "created_utc": 1740164883.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me9ssx9",
              "author": "Username43201653",
              "body": "Yeah I 100% want some a-hole sandblasting my roof as he flies over me. Totally cool. The bonus being when he crash lands on my roof. If you think cybertrucks are being vandalized...",
              "score": 1,
              "created_utc": 1740275956.0,
              "replies": []
            },
            {
              "id": "me0rb6n",
              "author": "imreallyfreakintired",
              "body": "This thing looks so thin, one fender bender will render it useless.  Hardly a car.",
              "score": 1,
              "created_utc": 1740158642.0,
              "replies": [
                {
                  "id": "me0wgnt",
                  "author": "SedatedAndAmputated",
                  "body": "I’m not advocating for this.  Just pointing out that a helicopter is not a car.",
                  "score": 1,
                  "created_utc": 1740160055.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me1uii2",
              "author": "Dirty_Dragons",
              "body": "It's crazy how many people miss that point.\n\nIf a vehicle cannot do what a car can, drive on the road, it's not a flying car.\n\nThe other issue is size. The smallest helicopters and airplanes are massive compared to cars. If you can't land the vehicle then drive and park it in a normal garage, it's not a flying car.",
              "score": 1,
              "created_utc": 1740169620.0,
              "replies": [
                {
                  "id": "me1xu4b",
                  "author": "SedatedAndAmputated",
                  "body": "You would think the name “flying car” would be pretty self explanatory but I guess I forgot how uncommon common sense is.",
                  "score": -2,
                  "created_utc": 1740170674.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "me47pty",
          "author": "Hendlton",
          "body": "> It costs much more energy to lift something up from the ground than to move it on wheels.\n\nWith the exceptions of rough terrain, snow or water. Yeah, I'm aware that flying cars are a terrible idea, but something that floats slightly off the ground could still be useful. We have hovercraft but those have been around for a long time. Maybe something better can be made.",
          "score": 1,
          "created_utc": 1740201501.0,
          "replies": [
            {
              "id": "me4z5tp",
              "author": "Slick424",
              "body": "> something that floats slightly off the ground could still be useful.\n\n[Ground-effect vehicle](https://en.wikipedia.org/wiki/Ground-effect_vehicle) already exist",
              "score": 1,
              "created_utc": 1740216149.0,
              "replies": []
            }
          ]
        },
        {
          "id": "me05mhy",
          "author": "Dirty_Dragons",
          "body": "Can you drive a helicopter down the street?",
          "score": 0,
          "created_utc": 1740152565.0,
          "replies": [
            {
              "id": "me14hij",
              "author": "chickyslay",
              "body": "Can you drive a car in a helicopter",
              "score": 4,
              "created_utc": 1740162272.0,
              "replies": [
                {
                  "id": "mekddgd",
                  "author": "bigWeld33",
                  "body": "Can you drive a helicopter, or fly a car?",
                  "score": 1,
                  "created_utc": 1740423745.0,
                  "replies": []
                },
                {
                  "id": "me1bt5s",
                  "author": "Dirty_Dragons",
                  "body": "What is that supposed to even mean?",
                  "score": 0,
                  "created_utc": 1740164306.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me1cozn",
              "author": "mudokin",
              "body": "No need to if the flying part would actually work properly and efficiently.",
              "score": 0,
              "created_utc": 1740164555.0,
              "replies": [
                {
                  "id": "me1tb5r",
                  "author": "Dirty_Dragons",
                  "body": "What?\n\nHow is that a flying **car** then if it can't do a what a car can? It would still need to be parked. Do you expect people to pick up their children from school in a helicopter?\n\nWhy do you think that everybody doesn't have a heli now? They are just as good as cars right?",
                  "score": 2,
                  "created_utc": 1740169267.0,
                  "replies": []
                },
                {
                  "id": "me1u7i2",
                  "author": "SedatedAndAmputated",
                  "body": "Oh, got it.  You just completely misunderstand the point.",
                  "score": 1,
                  "created_utc": 1740169529.0,
                  "replies": [
                    {
                      "id": "me22x79",
                      "author": "mudokin",
                      "body": "You will never be able to use it like they show. Imagine taking of in traffic to fly over an accident, as they show in one of their videos. You would send shit everywhere, you would damage all the cars around you with stones and debris. Well that will even happen if you take of anywhere within the city. This thing will send all the loose stuff lying around on the streets and walkways flying around.\n\nSo IF that comes to reality, we will still need a lot of landing places, People will have to drive there, to be allowed to lift of for flight, and if these get mainstream you will have to wait in line to do so, you know like in an airport, because any accident within the air is potentially a catastrophic one.\n\nThis is a pipe dream of a grifter\n\nEDIT: You aren't even allowed to fly a drown everywhere. Why would this thing be better.",
                      "score": 3,
                      "created_utc": 1740172154.0,
                      "replies": [
                        {
                          "id": "me27asp",
                          "author": "SedatedAndAmputated",
                          "body": "I never said it’s practical and I never said I’m for it.  I don’t know how I could dumb this down any further for you.\n\n*A helicopter is not a car.*\n\nThat’s it.  That is literally all I was saying.",
                          "score": 0,
                          "created_utc": 1740173395.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mgzz221",
          "author": "Human-Assumption-524",
          "body": "I'm so sick of this braindead gotcha talking point.\n\nYeah helicopters exist, most evtols are intended to be a better helicopter (This thing not included).\n\nUnless you believe helicopters simply can never possibly be improved upon there is a market for a better,cheaper,quieter,safer helicopter.",
          "score": 0,
          "created_utc": 1741601294.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me0f589",
      "author": "questionableco",
      "body": "NBC news report on this was hilarious. They wouldn’t let them film the cockpit, they had to stay really far away when filming, and they never saw a pilot get in or out of it lol. This looks like a giant scam, and not even a competent one.",
      "score": 10,
      "created_utc": 1740155265.0,
      "replies": [
        {
          "id": "me16ypn",
          "author": "Elios000",
          "body": "all \"flying cars\" / any thing trying use multi rotor shit are. we have helicopters already you dont see millions of them flying around.. take a guess why",
          "score": 6,
          "created_utc": 1740162959.0,
          "replies": []
        },
        {
          "id": "me2ljfl",
          "author": "Independent-Win-4187",
          "body": "The CEO looks like the equivalent of bad guy ceo villian",
          "score": 1,
          "created_utc": 1740177556.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdyo92y",
      "author": "BERND_HENNING",
      "body": "An 'ultra light version'...OK. Add a single passenger of 70 kg and some safety measures to not make that thing straight up suicidal in real traffic + a battery for the supposed range of 200 miles on the streets and then show a wobbly little hop like that again. \n\nIts cool that someone keeps tinkering with flying 'cars' but that just looks like nothing more than a few connected drones with some ultra light carbon Fiber hat.",
      "score": 40,
      "created_utc": 1740130866.0,
      "replies": [
        {
          "id": "mdzqqtp",
          "author": "veloace",
          "body": "Not ‘ultra light’ it says ‘ultralight’ in the article which is different. An ultralight is defined in 14 CFR Part 103 as an aircraft that is under certain weight and performance requirements and therefore does not require a pilot’s license to fly (when flown in certain areas). I haven’t done any research on this vehicle yet, but I assume they built an ultralight version as a proof-of-concept so they wouldn’t have to go throw the certification process for their flying car to get an airworthiness certificate.\n\n\nEdited to add: Looked into it more and it looks like they’re flying under a Special Airworthiness Certificate. Still, it looks like they’re testing the software and related systems, so a cheaper version is better to test with. ",
          "score": 18,
          "created_utc": 1740148069.0,
          "replies": [
            {
              "id": "me2q107",
              "author": "haarschmuck",
              "body": "No way they are making a FAA compliant ultralight as the max weight is 254lbs.",
              "score": 2,
              "created_utc": 1740178935.0,
              "replies": [
                {
                  "id": "me2yf75",
                  "author": "veloace",
                  "body": "Agreed. I went back and did some research and they are flying under a Special Airworthiness Certificate.",
                  "score": 1,
                  "created_utc": 1740181674.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "me07yhu",
              "author": "BERND_HENNING",
              "body": "Oh thats interesting, thank you for the insight. Sounds like it would apply to something like drones? I still wonder what concept they are trying to proof though since this seems to be vastly different from what they're trying do. Couldn't they just test an actual prototype (given that they have one) on private property like in a factory hall or something? The only thing that this seems to proof is that a few interconnected drones with an extremely light load can take off vertically, fly a few meters and land and i feel like i've seen that years ago. But i'm no expert so i'm honestly curious how this is worth a message.",
              "score": 1,
              "created_utc": 1740153228.0,
              "replies": [
                {
                  "id": "me0em4m",
                  "author": "veloace",
                  "body": "So, in the US regardless if you are on private property or not, you’re on part of the National Airspace System, so you have to abide by the FAA rules regardless (whether it be drones, manned aircraft, rockets, balloons, etc) so even if they wanted to make a full-size version and test it on their property, it would still require them to obtain an “experimental” airworthiness certificate. That process is somewhat complicated but it isn’t that bad, as amateur homebuilders often go that route, but it is a lot more work than just not getting an airworthiness certificate, which is what you can do with an ultralight. Furthermore, if you certify an airplane as experimental, you can do more with it BUT it must be flown as an ultralight.\n\n\nSo, for this product, the ultralight has two advantages.\n\n1) It’s cheaper, and quicker, so they really can just throw it together real quick to see if it even works. If the concept does, then they can put the work towards building a fully operational (larger) aircraft.\n\n2) An ultralight does not require the operator to have a pilot’s license, so in that aspect it is a much true “flying car.” If it was any larger and NOT an ultralight, it really wouldn’t be a flying car anymore as the operator would need a pilot’s license. So it’s just an airplane at that point.\n\nAlso, if they are short on funding and a small company, the ultralight prototype is a great way to show it can be done without going completely broke.\n\n\n\nAs for drones, this is borrowing drone technology for the manned space; which is great, but a manned drone is no longer a drone. And you’re right, it’s nothing particularly groundbreaking, it just sounds like nerds having fun. Which, I don’t know the size of the company, but if it is just a few people getting together to build this, and not something done by a large aerospace company, it is a pretty impressive feat. ",
                  "score": 2,
                  "created_utc": 1740155116.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mdys0ji",
      "author": "None",
      "body": "![gif](giphy|3o7TKvFKwclJQDY30A|downsized)",
      "score": 13,
      "created_utc": 1740133100.0,
      "replies": []
    },
    {
      "id": "mdymnsh",
      "author": "jcliment",
      "body": "We don't have enough vehicle incidents in a two-dimensional environment, now we want drivers to become pilots.\n\nOk.",
      "score": 22,
      "created_utc": 1740129907.0,
      "replies": [
        {
          "id": "mdytp15",
          "author": "Tankerrex",
          "body": "Every worker in aviation regulation bodies are gonna be on suicide watch after flying cars are mainstream",
          "score": 3,
          "created_utc": 1740134090.0,
          "replies": [
            {
              "id": "mdyvluf",
              "author": "pafrac",
              "body": "Don't worry about it, we don't need em, I mean, it's not as if all the sackings lately made any difference ...",
              "score": 3,
              "created_utc": 1740135185.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "me28jdh",
      "author": "Live_Ad_9019",
      "body": "“Alef Aeronautics builds drone shaped like a car”. There, fixed your stupid headline.",
      "score": 6,
      "created_utc": 1740173743.0,
      "replies": []
    },
    {
      "id": "me0dpql",
      "author": "edistthebestcat",
      "body": "People have a hard time driving in two dimensions, please don’t give them another direction not to bother to look in.",
      "score": 5,
      "created_utc": 1740154863.0,
      "replies": []
    },
    {
      "id": "me2jckz",
      "author": "Toisty",
      "body": "Can we just have safe, reliable and effective public transportation? Wealthy elite people's allergy to the normal human interaction is pathological at this point.",
      "score": 3,
      "created_utc": 1740176894.0,
      "replies": []
    },
    {
      "id": "mdym8nv",
      "author": "depressedbananaslug",
      "body": "Hey my boyfriend worked on that car back when it was armada aeronautics :)",
      "score": 10,
      "created_utc": 1740129657.0,
      "replies": [
        {
          "id": "me16q25",
          "author": "BrothStapler",
          "body": "Same here, I was at their Santa Clara office. We just did a lot of 3d printer mold processing for carbon fiber panels.",
          "score": 1,
          "created_utc": 1740162893.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me25cbb",
      "author": "Camerotus",
      "body": "Can we just stop trying to make 70s sci-fi movie ideas real things? There is absolutely zero rationale behind making a vehicle that can both drive and fly car shaped, aside from \"it looks cool in the movies\". Why would the optimal design just be a car with an oversized leaf lower attached to it?!",
      "score": 3,
      "created_utc": 1740172844.0,
      "replies": []
    },
    {
      "id": "mdymf99",
      "author": "Novemberai",
      "body": "Only a matter of time before the battery dies or the car otherwise malfunctions while airborne and falls on someone. \n\n\"What? A flying squirrel hit your face and caused you to involuntarily commit mans-laughter?\"",
      "score": 5,
      "created_utc": 1740129766.0,
      "replies": [
        {
          "id": "mdz723o",
          "author": "iwishihadnobones",
          "body": "Man's laughter?",
          "score": 5,
          "created_utc": 1740140865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdym1x2",
      "author": "f8tel",
      "body": "\"car\"",
      "score": 5,
      "created_utc": 1740129546.0,
      "replies": []
    },
    {
      "id": "mdzmoqr",
      "author": "Ste4mer",
      "body": "![gif](giphy|3Z1b90nxAVj7C7YS5G)",
      "score": 5,
      "created_utc": 1740146736.0,
      "replies": []
    },
    {
      "id": "mdyp8hf",
      "author": "Tywele",
      "body": "The second clip in the video looks so much like CGI.",
      "score": 2,
      "created_utc": 1740131452.0,
      "replies": []
    },
    {
      "id": "mdyqu5t",
      "author": "ottoIovechild",
      "body": "There goes our insurance rates",
      "score": 2,
      "created_utc": 1740132402.0,
      "replies": []
    },
    {
      "id": "me24rvd",
      "author": "Jaymac720",
      "body": "I don’t trust people to operate cars in two dimensions. I can’t imagine what’ll happen when we add the third plus the worse handling",
      "score": 2,
      "created_utc": 1740172682.0,
      "replies": []
    },
    {
      "id": "me2arnl",
      "author": "maazen",
      "body": "it's KITT's turbo boost in slow motion!",
      "score": 2,
      "created_utc": 1740174379.0,
      "replies": []
    },
    {
      "id": "me2as14",
      "author": "InternalStriking574",
      "body": "It looks so much like the Weasley's.",
      "score": 2,
      "created_utc": 1740174381.0,
      "replies": []
    },
    {
      "id": "me2d6lp",
      "author": "Girthtanin",
      "body": "The dukes did that much.",
      "score": 2,
      "created_utc": 1740175069.0,
      "replies": []
    },
    {
      "id": "me2fjpa",
      "author": "TheRabidGoose",
      "body": "I couldn't care about having flying cars when the world is about to implode.",
      "score": 2,
      "created_utc": 1740175760.0,
      "replies": []
    },
    {
      "id": "me2fql8",
      "author": "TheFoxandTheSandor",
      "body": "RONALD WEASLEY?!!!!!",
      "score": 2,
      "created_utc": 1740175817.0,
      "replies": []
    },
    {
      "id": "me2ph7o",
      "author": "haarschmuck",
      "body": "No such thing as a “flying car”.\n\nMoment it leaves the ground the FAA takes over and you need a pilots license (except for ultralight/parachutes). \n\nLegally this is a plane that can drive on the roads, not the other way around.",
      "score": 2,
      "created_utc": 1740178761.0,
      "replies": []
    },
    {
      "id": "me2qjtz",
      "author": "Nervous_Team6362",
      "body": "Imagine how much time you could save from traveling 3 miles an hour in the air",
      "score": 2,
      "created_utc": 1740179100.0,
      "replies": []
    },
    {
      "id": "me2sagu",
      "author": "nexusjuan",
      "body": "You know people are all like \"wheres my flying car?\", until someone makes a flying car and they're like \"no, nope, uh uh I'm not getting into that death-trap.\"",
      "score": 2,
      "created_utc": 1740179654.0,
      "replies": []
    },
    {
      "id": "me38emd",
      "author": "Lawls91",
      "body": "If that's a car then [I've been driving since the age of 5](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Frzccf2juiid11.jpg).",
      "score": 2,
      "created_utc": 1740184996.0,
      "replies": []
    },
    {
      "id": "me3v9f9",
      "author": "ishook",
      "body": "5 drones in a trench coat.",
      "score": 2,
      "created_utc": 1740196243.0,
      "replies": [
        {
          "id": "me3yp57",
          "author": "ShiamondDamrock",
          "body": "😂",
          "score": 1,
          "created_utc": 1740197637.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me3xd22",
      "author": "None",
      "body": "[deleted]",
      "score": 2,
      "created_utc": 1740197082.0,
      "replies": [
        {
          "id": "me5o943",
          "author": "ChodaRagu",
          "body": "Have you seen the traffic in Dallas?",
          "score": 1,
          "created_utc": 1740229278.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me4m58s",
      "author": "Professional-Eye-771",
      "body": "Drives like a plane, flys like a car, tada!",
      "score": 2,
      "created_utc": 1740208816.0,
      "replies": []
    },
    {
      "id": "me89rwx",
      "author": "AgainstMenzingers",
      "body": "Harry and Ron are about to get in SO much trouble.",
      "score": 2,
      "created_utc": 1740257858.0,
      "replies": []
    },
    {
      "id": "me8k6pw",
      "author": "None",
      "body": "Looks like a scam to fraud investors so they can attempt to make real one",
      "score": 2,
      "created_utc": 1740261069.0,
      "replies": []
    },
    {
      "id": "mebfko4",
      "author": "DazzaTheComic",
      "body": "The average fat American family will not get this off the ground !",
      "score": 2,
      "created_utc": 1740303424.0,
      "replies": []
    },
    {
      "id": "mdylqif",
      "author": "Boop0p",
      "body": "[No thanks](https://www.youtube.com/watch?v=6fcWOivJ6bs)",
      "score": 4,
      "created_utc": 1740129357.0,
      "replies": []
    },
    {
      "id": "mdz5fky",
      "author": "None",
      "body": "That's fucking stupid",
      "score": 3,
      "created_utc": 1740140156.0,
      "replies": []
    },
    {
      "id": "mdyy2eu",
      "author": "kanabalizeHS",
      "body": "I dont think flying cars thst uses any propeller is the answer. It has to be a novel levitation mechanism",
      "score": 2,
      "created_utc": 1740136538.0,
      "replies": []
    },
    {
      "id": "mdyz3ui",
      "author": "igneus",
      "body": "![gif](giphy|qGxSPzJtYXFhS)",
      "score": 2,
      "created_utc": 1740137089.0,
      "replies": [
        {
          "id": "me0wnkl",
          "author": "springsilver",
          "body": "[Skycutter!!!](https://youtu.be/fvISPdqwfSQ?si=9JAZzZPfRRXnEqpw)",
          "score": 2,
          "created_utc": 1740160108.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mdz2elj",
      "author": "pedsmursekc",
      "body": "So, what signal will we use for hopscotch mode and how do we prioritize who gets to hop whom, and when?",
      "score": 1,
      "created_utc": 1740138749.0,
      "replies": []
    },
    {
      "id": "mdz2hfo",
      "author": "Sassy-irish-lassy",
      "body": "Can it even function as a normal car?",
      "score": 1,
      "created_utc": 1740138788.0,
      "replies": []
    },
    {
      "id": "mdz3fbr",
      "author": "408wij",
      "body": "Needs a musical horn that plays Dixie but slowly ",
      "score": 1,
      "created_utc": 1740139235.0,
      "replies": []
    },
    {
      "id": "mdz4alq",
      "author": "CaveManta",
      "body": "It's those flying cars we were supposed to have long ago!",
      "score": 1,
      "created_utc": 1740139639.0,
      "replies": []
    },
    {
      "id": "mdz80ox",
      "author": "thisisfuxinghard",
      "body": "Is the future here yet",
      "score": 1,
      "created_utc": 1740141273.0,
      "replies": []
    },
    {
      "id": "mdz927i",
      "author": "Madmandocv1",
      "body": "Fake photo.",
      "score": 1,
      "created_utc": 1740141714.0,
      "replies": []
    },
    {
      "id": "mdzau5v",
      "author": "Xenobsidian",
      "body": "As Neil deGrasse Tyson said, we already have two technologies who achieve what this is good for. We call them bridges and tunnels!",
      "score": 1,
      "created_utc": 1740142430.0,
      "replies": []
    },
    {
      "id": "mdzdb4i",
      "author": "amander823",
      "body": "Ford Anglia if I ever saw one.",
      "score": 1,
      "created_utc": 1740143388.0,
      "replies": []
    },
    {
      "id": "mdzg7cs",
      "author": "Baazar",
      "body": "We got flying cars before we got GTA6",
      "score": 1,
      "created_utc": 1740144467.0,
      "replies": []
    },
    {
      "id": "mdziibh",
      "author": "zoedot",
      "body": "Oh goody, more midair collisions.",
      "score": 1,
      "created_utc": 1740145301.0,
      "replies": []
    },
    {
      "id": "mdzlwtf",
      "author": "Infra-Man777",
      "body": "![gif](giphy|e2QYPpUe8WmpG)\n\nFinally.",
      "score": 1,
      "created_utc": 1740146471.0,
      "replies": []
    },
    {
      "id": "mdzoxjg",
      "author": "piratecheese13",
      "body": "The FAA needs more employees",
      "score": 1,
      "created_utc": 1740147483.0,
      "replies": []
    },
    {
      "id": "mdzoy5w",
      "author": "Ok_Here-we-go",
      "body": "A car that is worse than the Cybertruck? Impossible…",
      "score": 1,
      "created_utc": 1740147489.0,
      "replies": []
    },
    {
      "id": "mdzsx2j",
      "author": "None",
      "body": "2nd time not 1st time.  The article forgot to mention the 1st time was [by some good old boys who never meaning no harm.](https://youtu.be/67gig0f4HLo?si=G-_iMrdCsOxJrMAR)",
      "score": 1,
      "created_utc": 1740148766.0,
      "replies": []
    },
    {
      "id": "mdzu9tr",
      "author": "Spare_Town6161",
      "body": "This = inferior car + inferior plane",
      "score": 1,
      "created_utc": 1740149192.0,
      "replies": []
    },
    {
      "id": "mdzus8k",
      "author": "Unrelated_gringo",
      "body": "That's not really a car though.",
      "score": 1,
      "created_utc": 1740149351.0,
      "replies": []
    },
    {
      "id": "mdzxtmg",
      "author": "DunedweIIer",
      "body": "![gif](giphy|eppZg5SmXd5Na5QXZu)",
      "score": 1,
      "created_utc": 1740150291.0,
      "replies": []
    },
    {
      "id": "mdzy0en",
      "author": "drewjsph02",
      "body": "When I was a kid in the 80s, flying cars were so cool and I could not wait.\n\nNow that I’m an Adult and know how most people drive…. NO THANK YOU. I do not want the idiots I see on the highway flying cars over my home.",
      "score": 1,
      "created_utc": 1740150348.0,
      "replies": []
    },
    {
      "id": "me03a6c",
      "author": "Dangerous-Coconut-49",
      "body": "All the future neighborhoods are acoustically f*ckd. We thought freeways were bad.",
      "score": 1,
      "created_utc": 1740151894.0,
      "replies": []
    },
    {
      "id": "me04l09",
      "author": "SubstanceObjective42",
      "body": "That’s a drone in a Jetsons Halloween costume.",
      "score": 1,
      "created_utc": 1740152269.0,
      "replies": []
    },
    {
      "id": "me05ea4",
      "author": "Dirty_Dragons",
      "body": "Now that is what a flying car should be, a vehicle that can also drive on the ground. No, a helicopter is not a flying car because it can't drive. Airplanes don't count because they are too big. A flying car has to fit in a lane on the street. \n\nOf course this is still an early prototype.",
      "score": 1,
      "created_utc": 1740152500.0,
      "replies": []
    },
    {
      "id": "me0733y",
      "author": "dfgdfgadf4444",
      "body": "LAME",
      "score": 1,
      "created_utc": 1740152980.0,
      "replies": []
    },
    {
      "id": "me07wvw",
      "author": "anagraminals",
      "body": "Just some good ol’ boys.",
      "score": 1,
      "created_utc": 1740153214.0,
      "replies": []
    },
    {
      "id": "me08d3f",
      "author": "Th3Batman86",
      "body": "This is terrible. People get into so many accidents just driving on a flat surface. Give them all directions to ignore and we are fucked. \n\nAlso, drones are loud AF. No one wants this!! Give us fucking healthcare and clean water.",
      "score": 1,
      "created_utc": 1740153342.0,
      "replies": []
    },
    {
      "id": "me0ah93",
      "author": "Mothra3",
      "body": "Holy moly!! It works!! But how???",
      "score": 1,
      "created_utc": 1740153941.0,
      "replies": []
    },
    {
      "id": "me0bp9o",
      "author": "Alseen_I",
      "body": "Flying cars are out, jetpacks are the new hotness",
      "score": 1,
      "created_utc": 1740154290.0,
      "replies": []
    },
    {
      "id": "me0em5n",
      "author": "whalebacon",
      "body": "IDK about anyone else, but I always figured we would figure out maglev or antigrav instead of Big Ass Fans for flying cars and stuff. Oh well.",
      "score": 1,
      "created_utc": 1740155116.0,
      "replies": []
    },
    {
      "id": "me0ihqm",
      "author": "Underwater_Karma",
      "body": "this thing is less of a flying car, and more of a quadracopter drone with a car shaped hat.  forget showing it fly, let's see it drive.  \n\nand considering how well established drone tech is, this thing looks very unstable.",
      "score": 1,
      "created_utc": 1740156196.0,
      "replies": []
    },
    {
      "id": "me0kinx",
      "author": "linuxliaison",
      "body": "This thing doesn't even have a proper transmission...",
      "score": 1,
      "created_utc": 1740156759.0,
      "replies": []
    },
    {
      "id": "me0kvb4",
      "author": "iwellyess",
      "body": "It looks like shit",
      "score": 1,
      "created_utc": 1740156857.0,
      "replies": []
    },
    {
      "id": "me0oy7p",
      "author": "rohowsky",
      "body": "What a fucking scam LOL",
      "score": 1,
      "created_utc": 1740157991.0,
      "replies": []
    },
    {
      "id": "me0s0wq",
      "author": "TryingT0Wr1t3",
      "body": "Is this using quadcopter approach to flying? I thought it would need more runway to take flight but it looks more like a quadcopter - and it has no wings or backup plan to power failure.",
      "score": 1,
      "created_utc": 1740158837.0,
      "replies": []
    },
    {
      "id": "me0tbto",
      "author": "That-Makes-Sense",
      "body": "I applaud their efforts, but this just doesn't look practical at all.  It's going to be a lousy flying vehicle, and a lousy car.  Just like the amphicar and the aerocar - when you try to design a vehicle for two completely different environments, they're going to suck at both.  Notice how they don't show it driving around.\n\nI would be very surprised if this vehicle could pass any NHTSA crash tests.  And if it was designed to pass the crash tests, it would be too heavy to fly.  Look at small airplanes, and how thin their structures and exteriors are.  And that's with winged aircraft which require much less power to fly than VTOLs.\n\nThis design is DOA.",
      "score": 1,
      "created_utc": 1740159196.0,
      "replies": [
        {
          "id": "me1nq36",
          "author": "wishod",
          "body": "This design is just an investor cash grab, its sole purpose is milking money as long as possible. ",
          "score": 1,
          "created_utc": 1740167665.0,
          "replies": [
            {
              "id": "me1w05v",
              "author": "That-Makes-Sense",
              "body": "You might be right.  It just seems so obvious that it's a bad design.\n\nFull disclosure, I have a small investment in Joby.  They're making an EVTOL, without the \"car\" part.  I think they have a good design.  I think the EVTOL's could eventually replace many helicopters.",
              "score": 1,
              "created_utc": 1740170086.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "me0u9os",
      "author": "Straight_Ace",
      "body": "People already drive like shit on the ground, doing it in the sky is gonna be incredibly dangerous",
      "score": 1,
      "created_utc": 1740159455.0,
      "replies": []
    },
    {
      "id": "me0vx35",
      "author": "Bender_2024",
      "body": "The flying car will never be widespread for one simple reason.  Maintenance.  Think about some of the janky bodge job fixes you see on the road.  Better yet go over to r/Justrolledintotheshop and see some of the stuff that people bring in.  An aircraft is an order of magnitude more complex with tolerances far less forgiving than any road car.  Still people will treat them like their lawnmowers and never change the oil until the engine siezes and it falls out of the sky like a brick.",
      "score": 1,
      "created_utc": 1740159906.0,
      "replies": []
    },
    {
      "id": "me0yojk",
      "author": "c4ndyman31",
      "body": "World’s quietest passenger vehicle lmfao",
      "score": 1,
      "created_utc": 1740160663.0,
      "replies": []
    },
    {
      "id": "me0zbg6",
      "author": "kona_boy",
      "body": "Americans will do everything but use a fucking train",
      "score": 1,
      "created_utc": 1740160836.0,
      "replies": []
    },
    {
      "id": "me1470a",
      "author": "feverfaucet",
      "body": "Bruh, read the room, planes are going down left and right, the FAA is practically shutting down, who’s gonna get into one of these things?",
      "score": 1,
      "created_utc": 1740162191.0,
      "replies": []
    },
    {
      "id": "me14ask",
      "author": "MonkeySafari79",
      "body": "Who wouldn't like to get all the dirt from the streets flying through his windows.",
      "score": 1,
      "created_utc": 1740162220.0,
      "replies": []
    },
    {
      "id": "me15xzc",
      "author": "charles_yost",
      "body": "Dat some Kitty Hawk shit, right there!",
      "score": 1,
      "created_utc": 1740162674.0,
      "replies": []
    },
    {
      "id": "me16jt8",
      "author": "Elios000",
      "body": "now make it pass safety tests... lol good luck",
      "score": 1,
      "created_utc": 1740162844.0,
      "replies": []
    },
    {
      "id": "me16y3b",
      "author": "L0neStarW0lf",
      "body": "About 10 years late, these were supposed to arrive in 2015.",
      "score": 1,
      "created_utc": 1740162955.0,
      "replies": []
    },
    {
      "id": "me1720z",
      "author": "oxynaz",
      "body": "I been saying for a long time that we should be hovering, imagine all the savings on pavement.",
      "score": 1,
      "created_utc": 1740162985.0,
      "replies": []
    },
    {
      "id": "me1e0cg",
      "author": "mexi_exe",
      "body": "I’ve been wondering for a while whether we could use metallic plates to achieve movement. If it were possible, I feel like it would drastically help improve battery life.",
      "score": 1,
      "created_utc": 1740164930.0,
      "replies": []
    },
    {
      "id": "me1erxn",
      "author": "PositiveAd3624",
      "body": "RONALD WEASLEY",
      "score": 1,
      "created_utc": 1740165148.0,
      "replies": []
    },
    {
      "id": "me1eu5o",
      "author": "doiwantacookie",
      "body": "Before gta6",
      "score": 1,
      "created_utc": 1740165166.0,
      "replies": []
    },
    {
      "id": "me1goxq",
      "author": "Xephhpex",
      "body": "Great way to clear a small traffic jam",
      "score": 1,
      "created_utc": 1740165690.0,
      "replies": []
    },
    {
      "id": "me1i6g7",
      "author": "txredgeek",
      "body": "Anybody wanna buy a bridge?",
      "score": 1,
      "created_utc": 1740166108.0,
      "replies": []
    },
    {
      "id": "me1jp4r",
      "author": "ghostdogs2",
      "body": "I predict utter chaos if this becomes a reality.  I barely survive driving to and from work everyday.",
      "score": 1,
      "created_utc": 1740166538.0,
      "replies": []
    },
    {
      "id": "me1jtzc",
      "author": "multisubcultural1",
      "body": "Jet packs, J. E. T. Packs!",
      "score": 1,
      "created_utc": 1740166576.0,
      "replies": []
    },
    {
      "id": "me1l32g",
      "author": "TimingAndBodyControl",
      "body": "That thing is so stupid looking lol",
      "score": 1,
      "created_utc": 1740166927.0,
      "replies": []
    },
    {
      "id": "me1mx1c",
      "author": "Hoodi216",
      "body": "My boss thinks self driving flying cars are like 2 years away from being the dominant form of travel. Theres no way. It would be sick if we had it like the Jetsons but look at this, its unsteady, slow, looks pretty flimsy, looks difficult to fly it 30 feet.\n\nGotta start somewhere but its not happening any time soon.",
      "score": 1,
      "created_utc": 1740167439.0,
      "replies": []
    },
    {
      "id": "me1rqiw",
      "author": "beeniecal",
      "body": "None of us will be able to afford it.",
      "score": 1,
      "created_utc": 1740168816.0,
      "replies": []
    },
    {
      "id": "me1soio",
      "author": "Darkstool",
      "body": "Oh ffs, we can't even pilot vehicles without being assholes, adding a 3rd dimension to be an asshole in is a terrible idea.",
      "score": 1,
      "created_utc": 1740169088.0,
      "replies": []
    },
    {
      "id": "me1xhj2",
      "author": "talex365",
      "body": "Every time I see something like this it has all of the worst traits of both a car and a drone without being able to competently do either of those jobs. Is there evidence that this one is any different or is this another one of those silly $1,000,000 boondoggles that will never pan out?",
      "score": 1,
      "created_utc": 1740170565.0,
      "replies": []
    },
    {
      "id": "me1zbo1",
      "author": "Bungle001",
      "body": "I've been seeing videos like this since the 80's.  This is a cash grab targeted at people dumb enough to invest.",
      "score": 1,
      "created_utc": 1740171122.0,
      "replies": []
    },
    {
      "id": "me2094a",
      "author": "ovumtime",
      "body": "Drunk driving is about to get crazy",
      "score": 1,
      "created_utc": 1740171395.0,
      "replies": []
    },
    {
      "id": "me23r7p",
      "author": "PresidentialCamacho",
      "body": "A thousand orders will come from Ukraine to cross the Dnipro river.",
      "score": 1,
      "created_utc": 1740172392.0,
      "replies": []
    },
    {
      "id": "me26nhv",
      "author": "None",
      "body": "Oh great, a drone with useless wheels on it. Let's call it a flying car!",
      "score": 1,
      "created_utc": 1740173214.0,
      "replies": []
    },
    {
      "id": "me27yc1",
      "author": "jrob321",
      "body": "As shitty, and selfishly, and distractedly as people already drive on the road in their cars, do we really want those idiots up in the sky? \n\nNavigating powerlines alone will tally some pretty high death toll numbers no matter how \"safe\" they drive their \"we we're promised these back in 2000\" flying cars...",
      "score": 1,
      "created_utc": 1740173577.0,
      "replies": [
        {
          "id": "me2f2ez",
          "author": "CheezeLoueez08",
          "body": "Ya. Cool tech but this shouldn’t become a norm. Like you said, people are horrible on the roads. We’re just not ready for this as a population. I think in most/all countries.",
          "score": 1,
          "created_utc": 1740175620.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me2rdu1",
      "author": "Hydrogen_vs_Battery",
      "body": "The inventor has some stiff competition.  This aircraft doesn't need 🛞's!\n\nhttps://www.liftaircraft.com/",
      "score": 1,
      "created_utc": 1740179366.0,
      "replies": []
    },
    {
      "id": "me2zcbd",
      "author": "The_Pandalorian",
      "body": "Looks like a shitty $20 toy, but just bigger.",
      "score": 1,
      "created_utc": 1740181977.0,
      "replies": []
    },
    {
      "id": "me31m7l",
      "author": "Naive-Home6785",
      "body": "What the flying fuck is this?!  No thanks.",
      "score": 1,
      "created_utc": 1740182734.0,
      "replies": []
    },
    {
      "id": "me3bowp",
      "author": "w3b_d3v",
      "body": "Why does it have 4 wheels if it’s primary purpose is to fly? Honestly could cut off about 25% on each end and have a much more efficient flying machine.",
      "score": 1,
      "created_utc": 1740189022.0,
      "replies": []
    },
    {
      "id": "me3dw3k",
      "author": "chengstark",
      "body": "Not interested. It will always be worse than a car and worse than a plane, and more expensive than two combined",
      "score": 1,
      "created_utc": 1740189811.0,
      "replies": []
    },
    {
      "id": "me3ge2d",
      "author": "waitingOnMyletter",
      "body": "I’ve always said this; “As poorly as people drive on the ground, flying cars have always been and will always be nightmare fuel.”\n\nLike imagine you’re just on a jog and a car lands on you or your in the park and a car just slams into the playground like a meteor wiping out a neighborhood of kids on the swing set. You’re in your living room and your main floor windows just get harry pottered. Like now multiply this into major metropolitan areas.",
      "score": 1,
      "created_utc": 1740190719.0,
      "replies": []
    },
    {
      "id": "me3j527",
      "author": "bpmdrummerbpm",
      "body": "As a child of the 90s, I grew up believing we’d be living in the futuristic world as portrayed in Blade Runner, Star Wars, Back to the Future, and the Fifth Element, when, and only when, we had flying cars.",
      "score": 1,
      "created_utc": 1740191716.0,
      "replies": [
        {
          "id": "me3oxtv",
          "author": "Amplith",
          "body": "I thought the same thing with personal communicators on 70 and 80’s sci -fi shows/movies that had the tiny screens where you could see the person…FaceTime kinda snuck up and took away the “awe” of all of that.",
          "score": 1,
          "created_utc": 1740193833.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me3m6nv",
      "author": "drumonit",
      "body": "Insurance will be a deal breaker.",
      "score": 1,
      "created_utc": 1740192831.0,
      "replies": []
    },
    {
      "id": "me3nsac",
      "author": "None",
      "body": "Oh so that’s what the NJ drones were 😂",
      "score": 1,
      "created_utc": 1740193412.0,
      "replies": []
    },
    {
      "id": "me3qmrw",
      "author": "Tonyy13",
      "body": "Lemme guess. Their testing facility is in New Jersey where the UFO craze and sightings were?",
      "score": 1,
      "created_utc": 1740194457.0,
      "replies": []
    },
    {
      "id": "me3qn8g",
      "author": "Nomaddj-1964",
      "body": "Investigators scam.",
      "score": 1,
      "created_utc": 1740194462.0,
      "replies": []
    },
    {
      "id": "me3sgyp",
      "author": "DefectiveCorpus",
      "body": "Yes, because humans are so great at driving on one plane. Definitely need flying cars. 🙃",
      "score": 1,
      "created_utc": 1740195162.0,
      "replies": []
    },
    {
      "id": "me3x4xi",
      "author": "Suneo88",
      "body": "Now we know what was flying over NJ.",
      "score": 1,
      "created_utc": 1740196990.0,
      "replies": []
    },
    {
      "id": "me3zrsc",
      "author": "Enlightened_Doughnut",
      "body": "Let’s like feed and shelter people in need. Maybe?",
      "score": 1,
      "created_utc": 1740198086.0,
      "replies": []
    },
    {
      "id": "me47yln",
      "author": "Eccentric_Algorythm",
      "body": "Lolololollll we can barely keep old people and drunks off the road as it is. Now we might have drunk flyers and 90 y/os who can’t see FLYING. no thanks. I’m staying inside.",
      "score": 1,
      "created_utc": 1740201611.0,
      "replies": []
    },
    {
      "id": "me49s7w",
      "author": "halp_mi_understand",
      "body": "There’s no “rear end fender benders” in this. You’re a body in a paper envelope.",
      "score": 1,
      "created_utc": 1740202454.0,
      "replies": []
    },
    {
      "id": "me4bzls",
      "author": "Historical_Animal_17",
      "body": "Looks as silly and unstable as the Avrocar 60 years ago. What a scientific advancement!",
      "score": 1,
      "created_utc": 1740203509.0,
      "replies": []
    },
    {
      "id": "me4e3k2",
      "author": "Ornery_Day_6483",
      "body": "I love the dust it kicks up when jumping the guy in front!",
      "score": 1,
      "created_utc": 1740204562.0,
      "replies": []
    },
    {
      "id": "me4ecdz",
      "author": "WeDieYoung__",
      "body": "flying cars they said",
      "score": 1,
      "created_utc": 1740204686.0,
      "replies": []
    },
    {
      "id": "me4g8w4",
      "author": "CuriousAndOutraged",
      "body": "just stay far away... if the driver somehow mimics how most drivers drive on solid land, better stay far from these drivers.",
      "score": 1,
      "created_utc": 1740205663.0,
      "replies": []
    },
    {
      "id": "me4jjl2",
      "author": "Brownstown75",
      "body": "It flew, about 30 feet...",
      "score": 1,
      "created_utc": 1740207409.0,
      "replies": []
    },
    {
      "id": "me5gpgm",
      "author": "Spagman_Aus",
      "body": "There’s 4 kids on a bmx each under that plastic cover.",
      "score": 1,
      "created_utc": 1740225920.0,
      "replies": []
    },
    {
      "id": "me5j1aw",
      "author": "Jordan-Goat1158",
      "body": "Tart",
      "score": 1,
      "created_utc": 1740227023.0,
      "replies": []
    },
    {
      "id": "me5jey5",
      "author": "Ulos",
      "body": "Arthur Weasley approves.",
      "score": 1,
      "created_utc": 1740227198.0,
      "replies": []
    },
    {
      "id": "me5rgw1",
      "author": "kfractal",
      "body": "Good luck to them. Looks goofy af.",
      "score": 1,
      "created_utc": 1740230520.0,
      "replies": []
    },
    {
      "id": "me5ruee",
      "author": "Unfair_Bunch519",
      "body": "Is this the one that does the flippy thing?",
      "score": 1,
      "created_utc": 1740230660.0,
      "replies": []
    },
    {
      "id": "me5stja",
      "author": "35183518",
      "body": "Someone will load it wrong and stall the machine",
      "score": 1,
      "created_utc": 1740231023.0,
      "replies": []
    },
    {
      "id": "me5td3y",
      "author": "35183518",
      "body": "I guess you're not listening to music in that car or sitting on your porch while they're flying by",
      "score": 1,
      "created_utc": 1740231223.0,
      "replies": []
    },
    {
      "id": "me5ztxv",
      "author": "cripblip",
      "body": "Doing everything they can to avoid good mass transit",
      "score": 1,
      "created_utc": 1740233545.0,
      "replies": []
    },
    {
      "id": "me60cwv",
      "author": "Moist_Blueberry_5162",
      "body": "For some reason I thought it would get me where I’m going faster than if I had just walked…",
      "score": 1,
      "created_utc": 1740233726.0,
      "replies": []
    },
    {
      "id": "me6bo8a",
      "author": "MediocreSupreme",
      "body": "Old news. Ron drove one into a tree like 20 years ago. \n\n\nEdit: a letter",
      "score": 1,
      "created_utc": 1740237399.0,
      "replies": []
    },
    {
      "id": "me6izn6",
      "author": "notoriously909",
      "body": "Flying range of 110 miles and a driving range of 200 miles? As an aerospace R&D guy with 25 years of experience, I have serious doubts about those numbers.",
      "score": 1,
      "created_utc": 1740239612.0,
      "replies": []
    },
    {
      "id": "me6l2gr",
      "author": "VenusValkyrieJH",
      "body": "I will say.. many times in my car .. sitting in traffic, I have wished for this very thing. That being said- the actual prospect of flying cars is terrifying.",
      "score": 1,
      "created_utc": 1740240230.0,
      "replies": []
    },
    {
      "id": "me6o93a",
      "author": "Aurelius5150",
      "body": "Nope, sorry. This ain’t it.",
      "score": 1,
      "created_utc": 1740241254.0,
      "replies": []
    },
    {
      "id": "me7kprs",
      "author": "Relaxmf2022",
      "body": "Please. No. Texans are awful enough on the road.\n\nTexans with side to side, back and forth, *and* up and down? \n\nIt will be raining Cletuses in no time.",
      "score": 1,
      "created_utc": 1740250455.0,
      "replies": []
    },
    {
      "id": "me7ybws",
      "author": "eyelikeit40",
      "body": "Be great in a traffic jam!",
      "score": 1,
      "created_utc": 1740254398.0,
      "replies": []
    },
    {
      "id": "me89n5v",
      "author": "citizin-x",
      "body": "We just don’t have the technology for this yet. And I literally mean that our technology cannot accomplish this. Let alone the computing power necessary to run it all. \n\nWe would need a technological breakthrough in a much quieter, safer and more efficient means of propulsion / levitation. Nothing gas powered or electric is going to get us flying cars.\n\nBut, I appreciate that there are companies out there trying to push us forward on this. Baby steps.",
      "score": 1,
      "created_utc": 1740257818.0,
      "replies": []
    },
    {
      "id": "me8eyzb",
      "author": "None",
      "body": "Can I please just travel on bus 2 miles and it not take 3 hours and 3 transfers? \nJfc",
      "score": 1,
      "created_utc": 1740259461.0,
      "replies": []
    },
    {
      "id": "me8fo1a",
      "author": "IanRevived94J",
      "body": "https://youtu.be/a2tDOYkFCYo?si=qMsQH5WU6bKq_D3n\n\nThis is from 3 years ago",
      "score": 1,
      "created_utc": 1740259676.0,
      "replies": []
    },
    {
      "id": "me985dz",
      "author": "drnemmo",
      "body": "That's just a drone painted as a car.",
      "score": 1,
      "created_utc": 1740268857.0,
      "replies": []
    },
    {
      "id": "me99gnc",
      "author": "Alucardspapa",
      "body": "![gif](giphy|MVU2q8gaqMDr6wE2x1|downsized)\n\nAbout damn time!",
      "score": 1,
      "created_utc": 1740269299.0,
      "replies": []
    },
    {
      "id": "me9dkh4",
      "author": "Konstant_kurage",
      "body": "Very dangerous, you go first.",
      "score": 1,
      "created_utc": 1740270671.0,
      "replies": [
        {
          "id": "me9gc0w",
          "author": "SaintBrutus",
          "body": "I bet it’s safer than a Tesla /s lol",
          "score": 1,
          "created_utc": 1740271600.0,
          "replies": []
        }
      ]
    },
    {
      "id": "me9ef55",
      "author": "CovidBorn",
      "body": "This is just a grift to raise capital. Thats not a car in even the loosest sense of the word.",
      "score": 1,
      "created_utc": 1740270955.0,
      "replies": []
    },
    {
      "id": "me9le2j",
      "author": "johnwilkesbandwith",
      "body": "Woof on the design but I support the effort.",
      "score": 1,
      "created_utc": 1740273334.0,
      "replies": []
    },
    {
      "id": "me9nbbr",
      "author": "pauliewalnuts64",
      "body": "Dweebmobile",
      "score": 1,
      "created_utc": 1740274004.0,
      "replies": []
    },
    {
      "id": "me9r7pd",
      "author": "Fun-Opportunity-8394",
      "body": "You're a car, Harry!",
      "score": 1,
      "created_utc": 1740275395.0,
      "replies": []
    },
    {
      "id": "mea10eq",
      "author": "HarryLewisPot",
      "body": "If you think roads are congested, imagine never being able to look at the sky again.",
      "score": 1,
      "created_utc": 1740278952.0,
      "replies": []
    },
    {
      "id": "mea1ee4",
      "author": "Nfeatherstun",
      "body": "This will never cease to be a bad idea",
      "score": 1,
      "created_utc": 1740279098.0,
      "replies": []
    },
    {
      "id": "meab5r3",
      "author": "OldWrangler9033",
      "body": "Looks like wanna be car, that's essentially a drone with token landing wheels.  Only way this thing a \"car\" if drives like one.  \"Quack like a duck, Walk like duck, and Fly like a Duck.\"",
      "score": 1,
      "created_utc": 1740282833.0,
      "replies": []
    },
    {
      "id": "meajmzv",
      "author": "MrBahhum",
      "body": "Look at all the dust it kicks up on the street. That thing looks like it will crash in a good gust of wind. What a terrible year for aviation.",
      "score": 1,
      "created_utc": 1740286299.0,
      "replies": []
    },
    {
      "id": "meat67j",
      "author": "AndromedaFire",
      "body": "This is like the tech bro version of the inflatable and fake tanks they used in ww2 to fool the nazis. \n\nSome investor has probably threatened to pull out if the company doesn’t show progress so they made this bullshit.",
      "score": 1,
      "created_utc": 1740290718.0,
      "replies": []
    },
    {
      "id": "meat97l",
      "author": "BeebleBoxn",
      "body": "I use to draw that when I was a kid.",
      "score": 1,
      "created_utc": 1740290761.0,
      "replies": []
    },
    {
      "id": "meb27d0",
      "author": "raisingstorm",
      "body": "Great Scott! Incidents of sky rage have multiplied exponentially in the USA! In other news, the AutoFlug allows flying cars to drive up to Mach 4!",
      "score": 1,
      "created_utc": 1740295598.0,
      "replies": []
    },
    {
      "id": "meb6z8u",
      "author": "No-Cupcake370",
      "body": "At this point, who cares about the flying cars anymore?",
      "score": 1,
      "created_utc": 1740298354.0,
      "replies": []
    },
    {
      "id": "meb86vm",
      "author": "xMETRIIK",
      "body": "Unless it's antigravity alien technology I don't want it.",
      "score": 1,
      "created_utc": 1740299063.0,
      "replies": []
    },
    {
      "id": "mecfn54",
      "author": "TheStockFatherDC",
      "body": "I need one the size of a house than can float, go under water, and hover for days at a time.",
      "score": 1,
      "created_utc": 1740321019.0,
      "replies": []
    },
    {
      "id": "mecg72i",
      "author": "None",
      "body": "The airplanes aren’t even flying right anymore don’t do this lol",
      "score": 1,
      "created_utc": 1740321212.0,
      "replies": []
    },
    {
      "id": "meeug0n",
      "author": "Aiku",
      "body": "\"the cockpit only has enough room for one and a half people.\"\n\nWhich half wants to go?",
      "score": 1,
      "created_utc": 1740346828.0,
      "replies": []
    },
    {
      "id": "mdz2vva",
      "author": "tree_washer",
      "body": "Them Duke boys would like ta have a word with y’all",
      "score": 1,
      "created_utc": 1740138980.0,
      "replies": []
    },
    {
      "id": "mdzoyc1",
      "author": "TheOmCollector",
      "body": "![gif](giphy|eppZg5SmXd5Na5QXZu)",
      "score": 1,
      "created_utc": 1740147490.0,
      "replies": []
    },
    {
      "id": "mdz08gh",
      "author": "OnboardG1",
      "body": "This should be in r/upliftingnews",
      "score": -1,
      "created_utc": 1740137670.0,
      "replies": []
    },
    {
      "id": "mdz58vv",
      "author": "blinkrenking",
      "body": "Why doesn't it kick up any dust when flying over that dirt? I'm sceptical this is real, not to mention it's hardly a car.",
      "score": -1,
      "created_utc": 1740140073.0,
      "replies": []
    }
  ]
}