{
  "post": {
    "title": "Microsoft Needs to Make Affordable 5G Surface Laptops a Reality",
    "author": "dapperlemon",
    "id": "1mfuxdg",
    "score": 0,
    "created_utc": 1754152510.0,
    "selftext": "",
    "num_comments": 23,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mfuxdg/microsoft_needs_to_make_affordable_5g_surface/"
  },
  "comments": [
    {
      "id": "n6jtena",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1754152510.0,
      "replies": []
    },
    {
      "id": "n6jui3y",
      "author": "DustyMoo",
      "body": "This is super, super niche, I travel a lot and I just use phone tethering for connectivity in public places, I'm already paying for mobile service, why pay more for another service on my laptop that I know that I won't utilise much.\n\n There hasn't been a time where I had gone out of my way to buy a second physical SIM card for a 4g / 5g enabled tablet either.",
      "score": 26,
      "created_utc": 1754152857.0,
      "replies": [
        {
          "id": "n6k2ke5",
          "author": "Bderken",
          "body": "I made this same argument on the Apple subreddit and got downvoted to hell. I barely want to pay for my watches cellular connection, let alone my laptops. Those $10/m add up. Rather use my phones connection.",
          "score": 4,
          "created_utc": 1754155424.0,
          "replies": [
            {
              "id": "n6k5x6u",
              "author": "TehOwn",
              "body": "Apple users just love spending money.",
              "score": 1,
              "created_utc": 1754156457.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n6jv8an",
      "author": "JoseMinges",
      "body": "The answer is tether to your phone. You're going to the park with your laptop, but you somehow decided to leave your phone at home?\n\n\nOk.\n\n\nSomeone desperately needed to write an article.",
      "score": 21,
      "created_utc": 1754153091.0,
      "replies": [
        {
          "id": "n6jy227",
          "author": "dandylover1",
          "body": "Not everyone is addicted to his phone.  Half the time, I forget I even have one.  But I am always on my computer.  Granted, it's a Toughpad FZ-M1 MK3, which is a seven-inch tablet, and even with my keyboard, it still fits comfortably into a small bag.  It also has a slot for a sim card.  It's a bit different from a large laptop, but this could work with a proper umpc.",
          "score": -15,
          "created_utc": 1754154017.0,
          "replies": [
            {
              "id": "n6jymgj",
              "author": "neil470",
              "body": "There’s a difference between being addicted to your phone and using common sense to take advantage of cellular service you already pay for..",
              "score": 12,
              "created_utc": 1754154204.0,
              "replies": [
                {
                  "id": "n6jz3mu",
                  "author": "dandylover1",
                  "body": "Fair enough, but it's one extra thing to carry.    In my case, I also use an external keyboard with it, so that makes two.  But it can certainly be done.  Technically, though, you could also just use data on a sim card and get one of those services that allow you to make and receive calls on your computer, so that's another option.",
                  "score": -9,
                  "created_utc": 1754154362.0,
                  "replies": [
                    {
                      "id": "n6k2cf6",
                      "author": "Bderken",
                      "body": "Peak Redditor right here. \n\nYou take your laptop places you don’t take your phone?",
                      "score": 8,
                      "created_utc": 1754155356.0,
                      "replies": []
                    },
                    {
                      "id": "n6k3sca",
                      "author": "drae-",
                      "body": "You're not bringing your phone anyway?\n\nAre you just trying to be contrarian?",
                      "score": 6,
                      "created_utc": 1754155799.0,
                      "replies": [
                        {
                          "id": "n6m7m3j",
                          "author": "dandylover1",
                          "body": "No.  But if I did, that would be two extra things.  And someone above my comment mentioned battery life of the phone, which makes complete sense.  But one could also use a hotspot, which are very small.",
                          "score": -1,
                          "created_utc": 1754181604.0,
                          "replies": [
                            {
                              "id": "n6mema1",
                              "author": "drae-",
                              "body": "You're trying to say you don't take your phone with you when you go places?\n\nAnd you wonder why we're expressing doubt?",
                              "score": 2,
                              "created_utc": 1754184245.0,
                              "replies": [
                                {
                                  "id": "n6miqxp",
                                  "author": "dandylover1",
                                  "body": "Humans can go places without their phones!  Isn't that amazing?  The only things I really use my phone for are to call/text my mother and one or two friends, to check the weather, and to read printed things via ocr.  If I absolutely don't have a computer nearby, I might use it to research something on the Internet or to record a simple mp3, but that's extremely rare.  If I had to choose something technological to take with me, it would be my Toughpad and keyboard.  The only reason I would bring a phone is for emergency purposes, since I can't use other people's phones without Talkback or Voiceover turned on.  And even if they were, I don't use a touchscreen to type or dial numbers.",
                                  "score": 0,
                                  "created_utc": 1754185845.0,
                                  "replies": [
                                    {
                                      "id": "n6mspop",
                                      "author": "drae-",
                                      "body": ">Humans can go places without their phones!\n\nNo shit.\n\nBut they don't.",
                                      "score": 1,
                                      "created_utc": 1754189737.0,
                                      "replies": [
                                        {
                                          "id": "n6msumt",
                                          "author": "dandylover1",
                                          "body": "Well, this one can and does.  And some people don't even have or want a smart phone.",
                                          "score": 1,
                                          "created_utc": 1754189793.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n6jtxan",
      "author": "drae-",
      "body": "Microsoft doesn't *need* to do anything.\n\nAnd I highly doubt some Gizmodo blogger has greater insight to market trends then Microsoft who spends tens of millions on market research and feasibility studies. Nor do they know about the costs to implement or the logistics necessary to integrate such into their supply chain.\n\nStuff like\n\n>It shows that if users want a laptop that can connect to the internet without relying on spotty public or Starbucks Wi-Fi, they need to pay through the nose. \n\nJust pisses me off, tethering your fucking phone is absolutely an option. Ignoring the obvious solution just to create a *greed* narrative is fucking dumb.\n\nSo tired of this tone. So arrogant.",
      "score": 19,
      "created_utc": 1754152673.0,
      "replies": []
    },
    {
      "id": "n6jwjm3",
      "author": "CamiloArturo",
      "body": "Can’t think of anything I need less in my laptop than this. It’s right next to the app which monitors how many times I wear pants by putting my right leg vs left leg first",
      "score": 2,
      "created_utc": 1754153517.0,
      "replies": []
    },
    {
      "id": "n6k2i8q",
      "author": "shifty_coder",
      "body": "Why? Every major carrier has unlimited data with mobile hotspot. If you need a laptop to work while you travel, chances are you already have a smartphone with a major carrier.\n\nThe need for a cellular antenna in a tablet or laptop had long since passed.",
      "score": 2,
      "created_utc": 1754155406.0,
      "replies": [
        {
          "id": "n6k6snt",
          "author": "IronFrogger",
          "body": "(very recently) I had bought a laptop to replace the COO's old laptop and they told me \"I can't use this unless it has a cellular modem\". I asked about tethering and they said they didn't want to go through the effort of that. Anyway, so that laptop went to someone else 🤷",
          "score": 1,
          "created_utc": 1754156727.0,
          "replies": []
        },
        {
          "id": "n6kapki",
          "author": "Dan-in-Va",
          "body": "I use a cellular enabled Dell laptop daily. It works using the antenna in the laptop screen and doesn’t burn down my phone’s battery. The speed of battery burn while tethering is the biggest reason I seek this integration.\n\nMicrosoft Surface Pros and Dell notebooks (both business Intel cellular versions) have been my go-to for this capability for the past 10 years. I’m waiting for a 5G version.",
          "score": 1,
          "created_utc": 1754157958.0,
          "replies": [
            {
              "id": "n6krg91",
              "author": "nuttierthanafruitcak",
              "body": "so spend lots extra on a 5G laptop instead of a few dollars for a powerbank.",
              "score": 2,
              "created_utc": 1754163535.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n6lyy67",
      "author": "HammerCurls",
      "body": "Any employee that needs this likely has a company phone with HotSpot capability and access to dedicated mobile HotSpot upon request.",
      "score": 1,
      "created_utc": 1754178365.0,
      "replies": []
    },
    {
      "id": "n6msyl1",
      "author": "Darthalicious",
      "body": "Okay, but real talk: what is so great or even good about Surface laptops? I've dealt with a few for clients over the years and I have been sorely unimpressed. They just feel like the geeky kid who imitates the popular kid (MacBook) but just doesn't have the right stuff to be cool. It's been a couple years since I handled one, they actually any better now?",
      "score": 1,
      "created_utc": 1754189838.0,
      "replies": []
    }
  ]
}