{
  "post": {
    "title": "Apple Is Developing a Brain-Computer Interface",
    "author": "a_Ninja_b0y",
    "id": "1klq2qq",
    "score": 114,
    "created_utc": 1747152983.0,
    "selftext": "",
    "num_comments": 81,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1klq2qq/apple_is_developing_a_braincomputer_interface/"
  },
  "comments": [
    {
      "id": "ms44ej4",
      "author": "cedande",
      "body": "It's probably harder to name a monolithic tech company that is not developing one.",
      "score": 101,
      "created_utc": 1747153128.0,
      "replies": [
        {
          "id": "ms47tf1",
          "author": "appleburger17",
          "body": "Yeah if you’re a huge tech company you pretty much have to be working on things like this even if you never develop a product.",
          "score": 32,
          "created_utc": 1747154127.0,
          "replies": [
            {
              "id": "ms5cjwu",
              "author": "kurotech",
              "body": "Patents alone make it worth it for them development of a product is only half the value",
              "score": 11,
              "created_utc": 1747165882.0,
              "replies": []
            },
            {
              "id": "ms4lsnx",
              "author": "cedande",
              "body": "Even Gabe N of Valve started a company to develop this tech back in 2019.",
              "score": 7,
              "created_utc": 1747158152.0,
              "replies": [
                {
                  "id": "msskg3z",
                  "author": "focus_puffer",
                  "body": "you're maybe thinking of valve x openbci x tobii collab",
                  "score": 1,
                  "created_utc": 1747489923.0,
                  "replies": [
                    {
                      "id": "msstcre",
                      "author": "cedande",
                      "body": "This is the company that he co-founded https://starfishneuroscience.com/team/",
                      "score": 1,
                      "created_utc": 1747493025.0,
                      "replies": [
                        {
                          "id": "mstc09j",
                          "author": "focus_puffer",
                          "body": "interesting, this went under my radar",
                          "score": 1,
                          "created_utc": 1747499092.0,
                          "replies": [
                            {
                              "id": "mstsew2",
                              "author": "cedande",
                              "body": "They don't really seem to have many if any major announcements. Not that I've been looking though, I was just told about the company a week or so ago.",
                              "score": 1,
                              "created_utc": 1747504316.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms4wl2u",
              "author": "WinglyBap",
              "body": "Why though?",
              "score": 3,
              "created_utc": 1747161227.0,
              "replies": [
                {
                  "id": "ms65r72",
                  "author": "sans-delilah",
                  "body": "A brain to computer interface for gaming makes total sense for the VALVE founder.",
                  "score": 8,
                  "created_utc": 1747174707.0,
                  "replies": []
                },
                {
                  "id": "ms6a3wc",
                  "author": "Stompedyourhousewith",
                  "body": "Paradigm. If you're not part of the future, you're part of the past.   \n*Things tech ceos said in the late 90s*",
                  "score": 7,
                  "created_utc": 1747176177.0,
                  "replies": []
                },
                {
                  "id": "ms4xyne",
                  "author": "appleburger17",
                  "body": "Tons of reasons. They don’t want to get caught years behind on a technology that could pop. Or they might discover something that leads the way. Or they might develop patents that others license.",
                  "score": 11,
                  "created_utc": 1747161618.0,
                  "replies": []
                },
                {
                  "id": "ms766od",
                  "author": "Oddyssis",
                  "body": "It's very hard to do and the company that breaks the code is going to be a kajillionaire, and the ones who were at least working on it will have enough experience and technology to catch up quickly and not be totally dusted.",
                  "score": 3,
                  "created_utc": 1747187364.0,
                  "replies": []
                },
                {
                  "id": "ms7ag9q",
                  "author": "ElJanitorFrank",
                  "body": "Nobody said the overarching reason:\n\n$",
                  "score": 2,
                  "created_utc": 1747188884.0,
                  "replies": []
                },
                {
                  "id": "mvaxr0x",
                  "author": "GuardianDom",
                  "body": "Gabe Newell initially started researching it to suppress motion sickness in VR, going to incorporate it into the headset straps.",
                  "score": 1,
                  "created_utc": 1748723517.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms5nu6w",
          "author": "andynator1000",
          "body": "Amazon, Meta, Microsoft, IBM, Oracle, etc.",
          "score": 4,
          "created_utc": 1747169120.0,
          "replies": [
            {
              "id": "ms9dj5h",
              "author": "Seeteuf3l",
              "body": "Your brain runs with Java now",
              "score": 1,
              "created_utc": 1747226239.0,
              "replies": []
            },
            {
              "id": "ms9bpnn",
              "author": "val_tuesday",
              "body": "How do you know? Any one person can’t possibly know about all secret projects in all those companies.\n\n\nAlso at least Meta has public projects at least close to this tech, it’s not a stretch to imagine they have secret ones working on this directly.",
              "score": -1,
              "created_utc": 1747225549.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms8tjvb",
          "author": "NorysStorys",
          "body": "ARM, easy.",
          "score": 3,
          "created_utc": 1747217242.0,
          "replies": []
        },
        {
          "id": "ms8fsug",
          "author": "Spara-Extreme",
          "body": "Alphabet",
          "score": 1,
          "created_utc": 1747208670.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms4f0n4",
      "author": "firedmyass",
      "body": "*CIA licking its chops…*",
      "score": 18,
      "created_utc": 1747156198.0,
      "replies": []
    },
    {
      "id": "ms4i8df",
      "author": "Jamie00003",
      "body": "Imagine Siri….stuck in your brain! Revolutionary",
      "score": 16,
      "created_utc": 1747157139.0,
      "replies": [
        {
          "id": "ms5eqo5",
          "author": "zffjk",
          "body": "I’d be quickly leaving my brain in that case.",
          "score": 8,
          "created_utc": 1747166513.0,
          "replies": []
        },
        {
          "id": "ms5xb18",
          "author": "ABucin",
          "body": "with ads!",
          "score": 7,
          "created_utc": 1747172014.0,
          "replies": [
            {
              "id": "ms95pxu",
              "author": "Confident-Pop-9256",
              "body": "Unskippable ads!",
              "score": 2,
              "created_utc": 1747223151.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms4rh4v",
      "author": "ambermage",
      "body": "This is just going to turn into \"disabled people shouldn't get benefits because they can get a brain implant and get a job.\"",
      "score": 21,
      "created_utc": 1747159762.0,
      "replies": [
        {
          "id": "ms6i51u",
          "author": "TehOwn",
          "body": "Honestly, if this enabled me to work a full-time job without destroying my health then I'd be all for it. I have no doubt that I could find a job in a field that I would enjoy if I was fully capable.\n\nThis is highly unlikely to do that for me but if it was possible for others then great. Just don't take away their support until they can actually achieve it.",
          "score": 14,
          "created_utc": 1747178929.0,
          "replies": []
        },
        {
          "id": "ms66875",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1747174865.0,
          "replies": [
            {
              "id": "ms683bx",
              "author": "TheStupendusMan",
              "body": "Because what will happen is the safety net will get ripped away and no support for the devices will be offered. We see this already with mobility devices, prosthetics, medicine, etc etc.\n\nHell, you're also hoping the devices don't stop working. Or, worse, turned off without warning [because they aren't profitable.](https://futurism.com/neoscope/bionic-eye-implants-expire)\n\nImmediately made me think of a side quest in Deus Ex where a woman needs an upgrade in order to compete on a level playing field, but being poor it turns into indentured servitude.",
              "score": 10,
              "created_utc": 1747175492.0,
              "replies": [
                {
                  "id": "ms6us9q",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1747183354.0,
                  "replies": [
                    {
                      "id": "ms705i5",
                      "author": "TheStupendusMan",
                      "body": "That's not the point at all. Even slightly. Hell, here's where your obtuse angle to it all falls apart: Your counter-argument holds no water *because people struggle to access those life-changing devices now*.\n\nNobody is saying the tech is inherently bad. What we're saying is that *now* and *going back decades* we've had life-changing tech and our current systems choose profit over people 99 times out of 100. Doesn't matter the nation, doesn't matter the party. We need to ensure this doesn't turn into \"Oh, we can stop funding healthcare because the free market provideth!\" as usual. \n\nTo quote James Baldwin, \"Anyone who has ever struggled with poverty knows how extremely expensive it is to be poor.\"",
                      "score": 4,
                      "created_utc": 1747185265.0,
                      "replies": [
                        {
                          "id": "ms7asbe",
                          "author": "ElJanitorFrank",
                          "body": "I think you may have also gone off into the reeds and missed the original point. Availability was never part of the conversation - trading benefits for ability was.",
                          "score": 1,
                          "created_utc": 1747189004.0,
                          "replies": [
                            {
                              "id": "ms7e32r",
                              "author": "TheStupendusMan",
                              "body": "I have not:\n\n1. We see examples in the past and today of people being denied access to many, many things that will make them productive members of society, for lack of a better term. For ease of focus, I'm only talking medically. Everything from crutches to pacemakers to hearing aids.\n2. I linked an article about this exact subject. Read it. When the company deemed the medical devices allowing people to regain sight weren't profitable, they turned them off without warning. Want a more recent example? DOGE cut funding to a wide swath of medical research mid-study - many people are currently stuck with devices in them that don't work, unsure if they'll even be removed.\n3. I think you're missing the point. My original comment was that governments adore cutting social safety nets so that people have to look to private alternatives. It happens with medicine, it happens with hospitals, etc etc. You *cannot* talk about tech being beneficial without talking about access. So, if the government goes \"Hurray! Robot arms are a thing! Screw old prosthetics!\" well, guess what? Robot arms are fucking expensive and your funding (that your taxes cover!) doesn't cover the gap at best or straight up vanished at worst.\n4. So, now we're seeing in medicine what we see elsewhere: The rich don't break a sweat, the majority have to take on debt or worse - remember the guy who died *rationing his insulin*?\n\nWith that, I'm done saying the same thing in three different ways, respectfully. Have a great evening. Play, read or watch some sci-fi for increasingly prophetic takes on the near-future. I recommend Transmetropolitan.\n\n![gif](giphy|8GWsFYsl1dfjy)",
                              "score": 1,
                              "created_utc": 1747190204.0,
                              "replies": [
                                {
                                  "id": "ms87p96",
                                  "author": "ElJanitorFrank",
                                  "body": "Not to shepherd's hook you back in but I think the error isn't that you missed the point, but rather jumped the gun. We're trying to ask the initial question of if its moral and you're trying to list potential technical problems down the line. It isn't about potential or possibility, its about the fundamental principle. Maybe you're too pragmatic of a thinker and the miscommunication led to some friction.\n\nIn the question of 'is it agreeable to take away benefits from disabled people if they regain their ability\" *your* points would be a slippery slope fallacy. Slippery slopes are not illogical themselves - your points aren't necessarily wrong - but you are not answering the actual question being asked.\n\nI don't know if you get impatient with philosophy or what have you, but its a little ridiculous not to respect the fact that not everyone is attempting to get the same things out of a conversation that you are. I think about 99.9% of people recognize that the appropriate response to someone having a conversation you don't want to have is to keep scrolling, not come at them with a bulleted list of why their musings aren't logistically sound.",
                                  "score": 0,
                                  "created_utc": 1747203769.0,
                                  "replies": [
                                    {
                                      "id": "ms9kcg0",
                                      "author": "TheStupendusMan",
                                      "body": "The irony of walking into a room, telling someone they're wrong then getting upset when you're presented with facts and precedent.\n\n![gif](giphy|Dhjv0Y8WoM3Oo)",
                                      "score": 0,
                                      "created_utc": 1747228662.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms4sv3s",
      "author": "bonesnaps",
      "body": "\"You do not have the permissions required to repair your own brain-computer as you do not reside in the EU. \n\n\nPlease upgrade to the iCloud+ subscription and visit an Apple authorized iFixit Store to recover your memories.\"",
      "score": 11,
      "created_utc": 1747160164.0,
      "replies": []
    },
    {
      "id": "ms4qxhx",
      "author": "Jodelbert",
      "body": "Doubt it'll work on some people since they're lacking a critical component for this to function. Me included lol",
      "score": 6,
      "created_utc": 1747159606.0,
      "replies": [
        {
          "id": "ms6ih9k",
          "author": "TehOwn",
          "body": "At least you've got a computer!",
          "score": 3,
          "created_utc": 1747179044.0,
          "replies": [
            {
              "id": "msbh93r",
              "author": "trickman01",
              "body": "“What’s a computer?”",
              "score": 2,
              "created_utc": 1747248865.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms4dwni",
      "author": "vfdfnfgmfvsege",
      "body": "please don't.",
      "score": 12,
      "created_utc": 1747155879.0,
      "replies": []
    },
    {
      "id": "ms46l6e",
      "author": "nemuro87",
      "body": "iMe X Pro",
      "score": 5,
      "created_utc": 1747153767.0,
      "replies": []
    },
    {
      "id": "ms4irik",
      "author": "EdCenter",
      "body": "I want the Apple Brain 5! (imho, iPhone 5 was the best iphone, fight me)..",
      "score": 3,
      "created_utc": 1747157291.0,
      "replies": [
        {
          "id": "ms8ilug",
          "author": "Fiveby21",
          "body": "They need to give Siri a brain before they go messing with ours…",
          "score": 1,
          "created_utc": 1747210438.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms6o206",
      "author": "half-baked_axx",
      "body": "'Sorry, this non-Apple device is not compatible with your auditory canal'.",
      "score": 4,
      "created_utc": 1747180945.0,
      "replies": []
    },
    {
      "id": "ms6b526",
      "author": "dB_Manipulator",
      "body": "iThink",
      "score": 2,
      "created_utc": 1747176527.0,
      "replies": []
    },
    {
      "id": "ms68ug3",
      "author": "TheStupendusMan",
      "body": "They announce the iBrain 2 Pro Max and suddenly you have brain fog.\n\nThey push an update and suddenly all you can hear is U2.\n\nThey change ports on the new version and now you can't see your kids.\n\nThe jokes just write themselves.\n\n![gif](giphy|Z9cRCMdAMzXi25dwhE)",
      "score": 4,
      "created_utc": 1747175750.0,
      "replies": []
    },
    {
      "id": "ms4r2h5",
      "author": "ChainLC",
      "body": "a 2 button mouse?",
      "score": 2,
      "created_utc": 1747159646.0,
      "replies": []
    },
    {
      "id": "ms5qvza",
      "author": "crispyfrybits",
      "body": "Failed augmented vision release\n\nStill doesn't have any skin in the AI game and had to rollback their AI news titles for being hilariously inaccurate\n\nThinks they can manage to implement a brain to computer interface",
      "score": 2,
      "created_utc": 1747170009.0,
      "replies": []
    },
    {
      "id": "ms6qnz2",
      "author": "Dolatron",
      "body": "Will it be compatible with Apple VR?",
      "score": 1,
      "created_utc": 1747181868.0,
      "replies": []
    },
    {
      "id": "ms6w7rd",
      "author": "tkhan456",
      "body": "Which will be abruptly canceled in 5 years after they spend $100bn on it",
      "score": 1,
      "created_utc": 1747183865.0,
      "replies": []
    },
    {
      "id": "ms70o57",
      "author": "Difficult_Ad2864",
      "body": "Only, 100k for a limited time !",
      "score": 1,
      "created_utc": 1747185449.0,
      "replies": []
    },
    {
      "id": "ms72gye",
      "author": "emilio8x",
      "body": "It was bound to happen. All tech companies want this ultimately. This last decade, the whole point of portable tech was to make technology an extension of us. Smartphones, we can’t live without it, almost part of us. Same with apple watch. Already wearing it the whole day, technically part of us too. All of this is a slow preparation for the brain interface. Public isn’t ready yet so they go step by step. End goal is trans humanism or the moment we become real slaves to the authorities. \n\nMay be a stretch but i think there’s a reason why hollywood has been pushing superhero movies this last decade or so. They are all augmented beings with « super powers ». They want to make it seem cool but it’s an unconscious preparation for trans humanism. If mass population think its cool to be augmented, then it will be easier for them to sell the brain interface. Even Klaus Schwab, founder of World Economic Forum said in an interview that this is the next step for the human species. You can find it easily on YouTube.",
      "score": 1,
      "created_utc": 1747186093.0,
      "replies": []
    },
    {
      "id": "ms7617s",
      "author": "artpile",
      "body": "So... the mortgage on the house as a down-payment on the pre-order???",
      "score": 1,
      "created_utc": 1747187312.0,
      "replies": []
    },
    {
      "id": "ms7gqhp",
      "author": "PaulSarlo",
      "body": "Are they doing a Pantheon? Because this super feels like they're doing a Pantheon. Are we gonna find out they fucking cloned Jobs?",
      "score": 1,
      "created_utc": 1747191214.0,
      "replies": []
    },
    {
      "id": "ms95l3b",
      "author": "Spagman_Aus",
      "body": "Apple always seems to be playing catchup these days.",
      "score": 1,
      "created_utc": 1747223094.0,
      "replies": [
        {
          "id": "msobvyt",
          "author": "evilbarron2",
          "body": "Apple has never been first with a product since the Mac. That’s not their strategy.",
          "score": 1,
          "created_utc": 1747422790.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms99ijl",
      "author": "Sndr666",
      "body": "vr not taking off is prob a sign we'll have none of that future malarkey anymore.",
      "score": 1,
      "created_utc": 1747224697.0,
      "replies": []
    },
    {
      "id": "mshrn4p",
      "author": "DontWreckYosef",
      "body": "They can’t even fix a glitchy Siri after 10 years. You are telling me that brain interface is next?",
      "score": 1,
      "created_utc": 1747333973.0,
      "replies": [
        {
          "id": "mshxvo2",
          "author": "__Loot__",
          "body": "Its low bandwidth so you cant play complex games with it at least for now",
          "score": 2,
          "created_utc": 1747335846.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msjct3j",
      "author": "NotJimIrsay",
      "body": "Isn’t that what Neuralink is also doing?",
      "score": 1,
      "created_utc": 1747351772.0,
      "replies": []
    },
    {
      "id": "mskyum9",
      "author": "-Ricky-Stanicky-",
      "body": "So not only will they sell your data, they'll sell your thoughts.",
      "score": 1,
      "created_utc": 1747375945.0,
      "replies": [
        {
          "id": "msobbk8",
          "author": "evilbarron2",
          "body": "Apple doesn’t sell data. They will leverage every bit of data they get to customize their services and content, but they absolutely don’t sell data. They even sanitize the search requests they send to Google - they won’t even share data with partners.",
          "score": 0,
          "created_utc": 1747422617.0,
          "replies": [
            {
              "id": "msq30kv",
              "author": "-Ricky-Stanicky-",
              "body": "Sell, leak, handle unsafely. It's all the same.",
              "score": 1,
              "created_utc": 1747444891.0,
              "replies": [
                {
                  "id": "msqjyho",
                  "author": "evilbarron2",
                  "body": "It really, really isn’t.",
                  "score": 0,
                  "created_utc": 1747451587.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msou7dx",
      "author": "dtitov",
      "body": "It will cost you an arm and a leg and will give you seizures, but you will get to unlock your Iphone with your brain!",
      "score": 1,
      "created_utc": 1747428398.0,
      "replies": []
    },
    {
      "id": "ms5kbnv",
      "author": "None",
      "body": "![gif](giphy|fi1OSRrXEBeW47K5Ke)\n\nSome should tell Tim Apple that we already have a Brain-Computer interface and it works just fine.",
      "score": 1,
      "created_utc": 1747168101.0,
      "replies": []
    },
    {
      "id": "ms55kzf",
      "author": "slothtolotopus",
      "body": "Imagine your brain and body as a smartphone. All that comes with it and more. The future is fucking abysmal. We are become borg",
      "score": 1,
      "created_utc": 1747163831.0,
      "replies": []
    },
    {
      "id": "ms57qe1",
      "author": "707Guy",
      "body": "EyePhone",
      "score": 1,
      "created_utc": 1747164459.0,
      "replies": []
    },
    {
      "id": "ms6ja55",
      "author": "VincentNacon",
      "body": "Trying really hard to get ready to brainwash people in the far future, aren't they?",
      "score": 1,
      "created_utc": 1747179316.0,
      "replies": []
    },
    {
      "id": "ms4vexd",
      "author": "SaiyanRajat",
      "body": "But they still can't fix their crap mouse and keyboard?",
      "score": 0,
      "created_utc": 1747160893.0,
      "replies": [
        {
          "id": "ms5oejg",
          "author": "codeyman2",
          "body": "That is why they are working on brain computer interface.. so they can make you like their keyboards and mice..",
          "score": 2,
          "created_utc": 1747169283.0,
          "replies": [
            {
              "id": "msrhroe",
              "author": "akeean",
              "body": "It'll come with a proprietary port so you can plug and keep your magic mouse on the top of your head and use your brain to click that one button and charge the device at the same time.",
              "score": 1,
              "created_utc": 1747470045.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms4fhz4",
      "author": "PKblaze",
      "body": "And everyone will jump on board because they have to keep up with whatever Apple is doing.",
      "score": 0,
      "created_utc": 1747156339.0,
      "replies": []
    },
    {
      "id": "ms5af78",
      "author": "stedun",
      "body": "I’m sure they’ll just use it to pump advertisements directly into my cranium.",
      "score": 0,
      "created_utc": 1747165264.0,
      "replies": []
    },
    {
      "id": "ms630wo",
      "author": "Mando_calrissian423",
      "body": "I can’t wait to pay for a subscription to access my memories!",
      "score": 0,
      "created_utc": 1747173807.0,
      "replies": []
    },
    {
      "id": "ms4p7os",
      "author": "Dulse_eater",
      "body": "Stop it",
      "score": -1,
      "created_utc": 1747159112.0,
      "replies": []
    },
    {
      "id": "ms4oufj",
      "author": "dreamer_Neet",
      "body": "Siri let me out!!\nSorry I can’t do that.",
      "score": 0,
      "created_utc": 1747159008.0,
      "replies": []
    },
    {
      "id": "ms4s53w",
      "author": "Heuli77",
      "body": "At least I won‘t need an iCloud+ Upgrade",
      "score": 0,
      "created_utc": 1747159954.0,
      "replies": []
    },
    {
      "id": "ms4tk03",
      "author": "coolpapa2282",
      "body": "Wel, we can at least hope this will slow down their R&D on the Torment Nexus.",
      "score": 0,
      "created_utc": 1747160363.0,
      "replies": []
    },
    {
      "id": "ms5ypl2",
      "author": "pxr555",
      "body": "Also an electric car. Well, not anymore.",
      "score": 0,
      "created_utc": 1747172447.0,
      "replies": []
    },
    {
      "id": "ms73fbx",
      "author": "Wilsongav",
      "body": "Revolutionary!  How do they come up with these ideas!!!",
      "score": 0,
      "created_utc": 1747186427.0,
      "replies": []
    }
  ]
}