{
  "post": {
    "title": "HP avoids monetary damages over bricked printers in class-action settlement | HP has previously paid millions for bricking printers, but not this time.",
    "author": "chrisdh79",
    "id": "1jfd4n8",
    "score": 2245,
    "created_utc": 1742432790.0,
    "selftext": "",
    "num_comments": 165,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jfd4n8/hp_avoids_monetary_damages_over_bricked_printers/"
  },
  "comments": [
    {
      "id": "miq2uro",
      "author": "tifosiv122",
      "body": "\"Under the settlement agreement, HP doesn’t admit to any wrongdoing. It also won’t pay any monetary relief to customers impacted by the November 2020 firmware update.\n\nHowever, HP agreed to pay $5,000 each to Mobile Emergency Housing Corp., Performance Automotive & Tire Center, and David Justin Lynch, who was eventually added to the complaint, “to compensate them for the services they performed on behalf of the classes,” HP said. It will also pay $725,000 in attorneys’ fees and expenses.\n\nA win for HP users comes from the company's legal commitment to allow users of specific printers to decline firmware updates that would push Dynamic Security.\"\n\n--------------------------------\nWow the lead plaintiffs got $5k and everyone else got a \"commitment\". Lawyers got $725k.",
      "score": 657,
      "created_utc": 1742434137.0,
      "replies": [
        {
          "id": "miq3y0v",
          "author": "Sasquatters",
          "body": "Lawyers always win",
          "score": 335,
          "created_utc": 1742434516.0,
          "replies": [
            {
              "id": "miq56ye",
              "author": "McFizzlechest",
              "body": "In class actions suits, they’re often the only winners.",
              "score": 187,
              "created_utc": 1742434956.0,
              "replies": [
                {
                  "id": "miqeug6",
                  "author": "okram2k",
                  "body": "You don't like your occasional $2.50 class action settlement after yet another corporation causes irreparable harm to the country?",
                  "score": 69,
                  "created_utc": 1742438370.0,
                  "replies": [
                    {
                      "id": "mit56gl",
                      "author": "lkn240",
                      "body": "I got 300 or 400 dollars for those shitty Mac butterfly keyboards.\n\nBest class action settlement ever",
                      "score": 12,
                      "created_utc": 1742484269.0,
                      "replies": []
                    },
                    {
                      "id": "miqpoxv",
                      "author": "MyLastAcctWasBetter",
                      "body": "I mean, you do realize that the alternative to no class actions is no accountability, right? Our legislatures aren’t doing  shit about anything and won’t enact any meaningful commercial regulations in the near to distant future. Without class actions, consumers would have no ability to take on large companies given the cost to win ratio— their damages just aren’t that large. Class actions ensure that companies can’t harm consumers in micro transactions without some recourse. And the more people who join the suit, the more leverage the class has. \n\nThe system isn’t perfect and it’s only growing more limited with infinite arbitration clauses. But it’s sure as shit better than nothing. \n\nIf you think companies are shit with the existence of class actions, imagine how much exponentially shittier they would be without any means of mass accountability. \n\nAnd that’s saying nothing about the injunctive forms of class action relief.",
                      "score": 18,
                      "created_utc": 1742442735.0,
                      "replies": [
                        {
                          "id": "mit0lpt",
                          "author": "TheAspiringFarmer",
                          "body": "$740,000 is hardly \"Accountability\" to a company the size of HP.",
                          "score": 23,
                          "created_utc": 1742482917.0,
                          "replies": [
                            {
                              "id": "mit14d2",
                              "author": "MyLastAcctWasBetter",
                              "body": "Yeah no shit. Which is why the title of this post literally reads “avoids monetary damages.” It’s almost as if a single suit of its type can’t be considered emblematic of the entire system.",
                              "score": 8,
                              "created_utc": 1742483072.0,
                              "replies": [
                                {
                                  "id": "mixnctj",
                                  "author": "Soulsunderthestars",
                                  "body": "Lol please tell me you think this isn't the first and only time this has happened, what? 😂",
                                  "score": 2,
                                  "created_utc": 1742539613.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mit4j4s",
                          "author": "TheRealLazloFalconi",
                          "body": "The alternative is judges actually making damages damaging to the company, and more importantly, it's shareholders. When the awarded amounts are so low, that just becomes the cost of doing business, a line item the same way company cars or electric bills is.",
                          "score": 9,
                          "created_utc": 1742484081.0,
                          "replies": [
                            {
                              "id": "mit89rt",
                              "author": "MyLastAcctWasBetter",
                              "body": "Bro do you know how class actions work? Judges don’t “make the damages.” Class actions almost NEVER go to trial because it benefits neither side. Thus, the two sides negotiate over settlements and then at the very end, the judge holds a hearing to determine whether to approve the settlement. But the judge can’t just magically supersede their negotiations and demand the company pay more. He can deny the settlement if he thinks it’s in the class’ best interest, but there are several factors the judge considers to make this judgement. And he doesn’t get to then demand more money from the company.\n\nYou’re suggesting that single judges should have power that they just don’t. If you want actual penalties to be imposed, I’m with you 10,000%. But this is something that CONGRESS must enact.\n\nAnd just FYI, even extremely high punitive damages can be predicted and factored into the cost of doing business. If it’s predictable, it’s factored. Thus, when a company chooses not to take some shitty action, they’ve determined the cost of litigation/penalties is too high to be worth it. And when they choose to take an action, they’ve made the other calculation. The only way to counteract this analysis would be through introduction of unpredictability and uncapped punitive damage awards. And I hate to break it to you, but most states have passed legislation preventing those. And the Supreme Court has also held that they should be calculable.",
                              "score": 2,
                              "created_utc": 1742485178.0,
                              "replies": [
                                {
                                  "id": "mitky7r",
                                  "author": "TheRealLazloFalconi",
                                  "body": "Look, my point was that just because that's the way it works today, it's is not a binary choice between \"Class actions where you get a pittance,\" and nothing. Society is entirely made up, and we could make it differently.",
                                  "score": 5,
                                  "created_utc": 1742488874.0,
                                  "replies": [
                                    {
                                      "id": "mitr6mi",
                                      "author": "MyLastAcctWasBetter",
                                      "body": "lol",
                                      "score": -1,
                                      "created_utc": 1742490649.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "miq9o8y",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 86,
                  "created_utc": 1742436513.0,
                  "replies": [
                    {
                      "id": "miqfkhz",
                      "author": "McFizzlechest",
                      "body": "The whole idea behind a class action suit is that you have many plaintiffs each with relatively small claims. Individuals would be powerless against a large corporation on their own. Judges don’t initiate class actions suits. Lawyers do and often at the urging of plaintiffs who are looking for compensation. While I won’t deny that defendants in class action suits can be punished, that’s not the sole purpose.  Lawyers always get paid first though and there’s usually nothing left for plaintiffs.",
                      "score": 31,
                      "created_utc": 1742438639.0,
                      "replies": [
                        {
                          "id": "miqnlqc",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 11,
                          "created_utc": 1742441838.0,
                          "replies": [
                            {
                              "id": "mir885o",
                              "author": "fuqdisshite",
                              "body": "that isn't a fair take.\n\na few years ago i cut two toes off my foot due to using a faulty tool.\n\n~~the jury awarded me 18k$.~~\n\nEdit for clarity: i was awarded 18k$.\n\nmy lawyer got 10k$ and i got 8k$ \n\ni was REQUIRED to have a lawyer.\n\nthe case was open and shut and never saw a court room.  \n\nif i was allowed to walk in to the court and file my papers as an individual then i would have gotten that other 10k$, but, like i said, i was NOT ALLOWED to be my own lawyer because rules.\n\nthat should not be the case.  everyone in the world knows that i only cut my toes off because the faulty tool.  why am i required to give someone 60% of what the state believes is owed to me when there is no question who the villain is?",
                              "score": 9,
                              "created_utc": 1742452652.0,
                              "replies": [
                                {
                                  "id": "mirt5bh",
                                  "author": "passwordstolen",
                                  "body": "You got a crappy lawyer. He should have negotiated damages + legal fees.",
                                  "score": 14,
                                  "created_utc": 1742466041.0,
                                  "replies": [
                                    {
                                      "id": "misceg4",
                                      "author": "Trisa133",
                                      "body": "Yeah, it should’ve been higher. And the lawyer ripped him off. The normal payout for lawyers in these cases are 1/3 of total. Less if it’s a massive case.",
                                      "score": 5,
                                      "created_utc": 1742474954.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "misuyoc",
                                  "author": "bobtheman04",
                                  "body": "How did a jury award you $18k if it never saw a court room?",
                                  "score": 7,
                                  "created_utc": 1742481218.0,
                                  "replies": [
                                    {
                                      "id": "mit5i11",
                                      "author": "lkn240",
                                      "body": "Right?  There would be no award - it would be a negotiated settlement.... that he could have refused and gone to trial over.",
                                      "score": 2,
                                      "created_utc": 1742484363.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mit8y2l",
                                      "author": "fuqdisshite",
                                      "body": "the wording may be off.\n\nwhoever made the decision only asked if OSHA was in agreement with what had happened and why and the award was, like i said, a maths problem with set variables.  once they got the okay from OSHA that the laws were broken and knew the answer to the maths, it was over.  no jury needed, just a default judgment for a predetermined amount.",
                                      "score": 1,
                                      "created_utc": 1742485373.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mj614bj",
                  "author": "alidan",
                  "body": "because high profile ones that pay little are the ones that the big corps want you to see, lets not look at when was it Volkswagen or was it bmw lied about emission standards and everyone owing one of those cars got the entire value of the car in a settlement as if the car was brand new regardless of your purchase price. \n\nthey don't want you to go through a costly for them court battle. hell, our roof was put up by people who sold us shit, the class action eventually divided up the companies assets and gave them out, I don't believe we were re embarrassed the full cost of the roof, but that company went bankrupt along with some degree of jail time for the owners after the fact.",
                  "score": 1,
                  "created_utc": 1742660977.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "miqyetw",
              "author": "night-shark",
              "body": "The funny thing is, lawyers get all the flack for this and certainly to a good extent, that is justified. But having been a litigator, it's insane how many clients **insist** on moving ahead with costly, lengthy litigation, just for the \"principle\", contrary to advice.\n\nClients would hire us, we'd advise them that litigation is expensive and that they were better off pursuing alternative options or just letting it go. Then they'd insist on litigating. Then when we'd send them the bill, they'd complain and complain. Then when they got a lukewarm or even bad outcome, they'd blame us.\n\nSo glad to get out of that.\n\nLawyers can but those clients suck worse. lol.",
              "score": 9,
              "created_utc": 1742446934.0,
              "replies": [
                {
                  "id": "mit5rjn",
                  "author": "lkn240",
                  "body": "I mean the real problem is that litigation is so expensive.  It's complete bullshit that the court system is basically reserved only for the wealthy in a lot of cases.\n\nGranted - that's not something that's the fault of most lawyers - they are just dealing with the market/system as it exists",
                  "score": 7,
                  "created_utc": 1742484439.0,
                  "replies": []
                },
                {
                  "id": "mitjvhc",
                  "author": "SwingingtotheBeat",
                  "body": "It’s like the system is rigged to favor corporations, the wealthy, and all the attorneys that are a part of that system over regular people.\n\nThat being the case, lawyers absolutely deserve a share of the blame.",
                  "score": 6,
                  "created_utc": 1742488559.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "miuhyz1",
              "author": "Garconanokin",
              "body": "Let’s not forget, the billionaires also won in this case",
              "score": 1,
              "created_utc": 1742498316.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miqot3d",
          "author": "yulbrynnersmokes",
          "body": "No free credit monitoring? Throw me a bone here.",
          "score": 17,
          "created_utc": 1742442350.0,
          "replies": []
        },
        {
          "id": "mir5w9q",
          "author": "ChiefStrongbones",
          "body": "How is this even a \"class\"?  The only ones receiving damages are the named plaintiffs.",
          "score": 19,
          "created_utc": 1742451218.0,
          "replies": []
        },
        {
          "id": "mis58g7",
          "author": "Lagulous",
          "body": "Hp never getting another dollar outta me",
          "score": 7,
          "created_utc": 1742472031.0,
          "replies": []
        },
        {
          "id": "mirji8g",
          "author": "iwonttolerateyou2",
          "body": "The art of lying gets you infinite money",
          "score": 3,
          "created_utc": 1742460029.0,
          "replies": []
        },
        {
          "id": "misjl40",
          "author": "SmartWonderWoman",
          "body": "Don’t buy HP. Easy peasy.",
          "score": 4,
          "created_utc": 1742477539.0,
          "replies": [
            {
              "id": "mix1486",
              "author": "julie78787",
              "body": "I bought a different brand printer for that very reason.\n\nThen HP bought that company.",
              "score": 2,
              "created_utc": 1742528239.0,
              "replies": [
                {
                  "id": "miyg8i9",
                  "author": "SmartWonderWoman",
                  "body": "Oh no! That sucks!",
                  "score": 1,
                  "created_utc": 1742556688.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mis703j",
          "author": "edward_ge",
          "body": "HP paid $725K to lawyers but couldn’t spare a $5 ink voucher for users, pretty telling where their priorities are.",
          "score": 2,
          "created_utc": 1742472789.0,
          "replies": []
        },
        {
          "id": "miq3vbz",
          "author": "ShadowTacoTuesday",
          "body": "If HP steps up to the plate to push the envelope on that commitment to the next level you have yourself a deal!  I can play lawyer too, where’s my $725K?",
          "score": -1,
          "created_utc": 1742434491.0,
          "replies": [
            {
              "id": "miq4bms",
              "author": "tifosiv122",
              "body": "Sounds like a super commitment. Kind of like a promise ring?",
              "score": 3,
              "created_utc": 1742434651.0,
              "replies": []
            },
            {
              "id": "miqwz1d",
              "author": "SCP-Agent-Arad",
              "body": "We pinky promise not to do the thing we keep getting caught doing and keep saying we won’t do again, for realsies this time.",
              "score": 2,
              "created_utc": 1742446179.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mirhsg8",
          "author": "predat3d",
          "body": "Everyone who isn't an idiot or hopelessly lazy needs to opt out of this settlement. ",
          "score": -2,
          "created_utc": 1742458867.0,
          "replies": []
        },
        {
          "id": "miq5mqs",
          "author": "Freethecrafts",
          "body": "Getting a commitment not to do a thing seems huge.",
          "score": -3,
          "created_utc": 1742435107.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miq06vj",
      "author": "copelcwg",
      "body": "Horrible Products\nHorrible People\nHP™️",
      "score": 308,
      "created_utc": 1742433212.0,
      "replies": [
        {
          "id": "miq5f9h",
          "author": "Neuro_88",
          "body": "Yes. We all should avoid HP products the best we can.",
          "score": 55,
          "created_utc": 1742435035.0,
          "replies": [
            {
              "id": "miqmw9v",
              "author": "joshdgreat1",
              "body": "Switched to Epson years ago and haven’t looked back. Still haven’t had to buy ink yet.",
              "score": 17,
              "created_utc": 1742441542.0,
              "replies": [
                {
                  "id": "miqt6jx",
                  "author": "varitok",
                  "body": "My parents use an Epson, print multiple times a day for work and that thing took over years to run out of its first cartridge and you just fill it up yourself.",
                  "score": 8,
                  "created_utc": 1742444326.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mirs8n6",
              "author": "o2bprincecaspian",
              "body": "Boycotting this dogshit company since 2003. I advise everyone else to do the same.",
              "score": 3,
              "created_utc": 1742465526.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mirf3js",
          "author": "WillingPlayed",
          "body": "I’ll never buy anything HP",
          "score": 8,
          "created_utc": 1742457063.0,
          "replies": []
        },
        {
          "id": "mir5rmv",
          "author": "biscuitmachine",
          "body": "I agree about their printers, but their laptops can be pretty good. Have a budget gaming laptop from them and it's quite solid.\n\nThey can go fuck themselves with regards to printers though. Got a Canon laser printer and it's been great. Toner is amazing cost wise.",
          "score": 2,
          "created_utc": 1742451138.0,
          "replies": [
            {
              "id": "mix9msd",
              "author": "huyanh995",
              "body": "HP stands for Hinge Problems with their laptops.",
              "score": 2,
              "created_utc": 1742531981.0,
              "replies": [
                {
                  "id": "mj33qmi",
                  "author": "biscuitmachine",
                  "body": "I mean, I've had a Lenovo whose hinge failed. If it's a mechanical part in a budget laptop, it's probably going to be a point of failure.\n\nDoing some googling I think you're talking about this type: https://www.reddit.com/r/laptops/comments/1bnn9dl/my_laptop_is_coming_apart_at_the_hinges_on_the/\n\nThankfully the one I got from them doesn't have a hinge that's quite like that. It's just a very traditional and simple one. I hate that type of design anyway. I was specifically looking for laptops that didn't have that sort of hinge because it just looked like a disaster waiting to happen to me. Many MSI laptops that were inexpensive but I saw they had that type of hinge design but in two smaller areas on the left and right and all I could think was, \"Yeah that's gonna break\".",
                  "score": 1,
                  "created_utc": 1742610936.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "miv43l1",
          "author": "Scruffy725",
          "body": "That company and everyone who works at it/enables it are pieces of crap. Especially my old college teacher Jack. He's a massive asshole and I'm ecstatic that he got fired.",
          "score": 1,
          "created_utc": 1742504687.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miqhjdh",
      "author": "OcotilloWells",
      "body": "They claim it is to protect people from getting hacked by the chips on the ink cartridges. If HP didn't put them on in the first place, it wouldn't be an issue. Also unlikely to even be possible.\n\nNote: Unlikely doesn't mean it can't be done.",
      "score": 57,
      "created_utc": 1742439382.0,
      "replies": [
        {
          "id": "miqn3xs",
          "author": "None",
          "body": "Are there any case studies that discuss that particular vector of attack? It seems a bit far-fetched.\n\nAnyway, I’d like to know why my little Canon laser will only print lewd boobies after installing this third party toner cartridge.",
          "score": 7,
          "created_utc": 1742441630.0,
          "replies": [
            {
              "id": "miqpvks",
              "author": "Tek_Freek",
              "body": "Supplier with a sense of humor?",
              "score": 4,
              "created_utc": 1742442816.0,
              "replies": [
                {
                  "id": "mir4q31",
                  "author": "None",
                  "body": ";-)",
                  "score": 1,
                  "created_utc": 1742450511.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mismfc9",
              "author": "Mr_ToDo",
              "body": "Kind of hard to search for that.\n\nBut from what I can see it looks like the answer is the same solid maybe as when I started\n\nSo I found this:\n\nhttps://www.action-intell.com/2022/10/05/hp-bug-bounty-program-finds-reprogrammable-chips-open-printers-to-malware/\n\nIt talks about a cartridge vulnerability. The problem is that it's a report on malware that HP themselves reported as part of the bug bounty program. And it seems they didn't want to release any real proper details on it.\n\nI mean it's a buffer overflow. But so what. What is it targeting, how does it gain persistence, and while not part of a vulnerability knowing what was wrong would go a long way to knowing what they did to fix it assuming that this wasn't the thing that locked people into OEM only ink anyway.",
              "score": 2,
              "created_utc": 1742478504.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miqpnyi",
      "author": "Osiris_Raphious",
      "body": "This is technofuedlaism in action, the wealthy and corporate class are a different class of citizens. If any small company intentionally bricks a product or servicey they are charged under the full extent of the law and consumer protection. But HP is exempt because its huge and will cause market issues if it were to set a precedent. \n\nGoes to show there is no free market, and we need to hold our gov accountable so it can regulate entire society. And not BE regulated by the 1% for their profits.",
      "score": 41,
      "created_utc": 1742442724.0,
      "replies": [
        {
          "id": "miqu3sh",
          "author": "edwardphonehands",
          "body": "That's just a cute word for capitalism happening to us.",
          "score": 2,
          "created_utc": 1742444760.0,
          "replies": [
            {
              "id": "mir0ips",
              "author": "Osiris_Raphious",
              "body": "Yea but lord and serf class with corporations through technology. Actual capital owners arent even a consideration anymore",
              "score": 7,
              "created_utc": 1742448077.0,
              "replies": [
                {
                  "id": "mis4jfz",
                  "author": "edwardphonehands",
                  "body": "I've read the argument and find it specious. First, cloudalists/HP/etc are just predictable and predicted monopolistic/oligopolistic capitalists. This is not a deviation from capitalism, simply capitalism. Second, serfs are literally bound to the land for life whereas a long cloud contract is 3 years, about as long as a printer lasts. \n\nIf the proletariat of the imperial core needs to feel special and use the term \"serf\" to develop sub-par class consciousness that will do nothing more that drive us back to the Democrats/Labor/etc., it's technically better than nothing.",
                  "score": -2,
                  "created_utc": 1742471730.0,
                  "replies": [
                    {
                      "id": "mishf6j",
                      "author": "Osiris_Raphious",
                      "body": "lol you think yourself a capitalist? Who here owns any real capital... because the owners of the voting shares of HP also most likley own voting shares in other tech behemoths. Whilst you work all your life to servitude of the debt you need to accumulate just to participate in the economy that is no longer designed for you, but for the owner class... if all yiu have left is the hope to go 'back to better than nothing' you didnt learn history and the reason why democracy was a farse sold to us whilst the lords of the modern day lands once again coopted the governance of the land to have you the proletariat work all week whilst they live in decadence and stress free lives.",
                      "score": 1,
                      "created_utc": 1742476779.0,
                      "replies": [
                        {
                          "id": "misx4st",
                          "author": "edwardphonehands",
                          "body": "Slow down. I'm not calling myself a capitalist. I'm saying capitalism is bad. I'm saying calling a predictable outcome of capitalism some novel form of feudalism only obfuscates solutions. It pretends that everything was fine a few years ago and that electoralism works.",
                          "score": 1,
                          "created_utc": 1742481881.0,
                          "replies": [
                            {
                              "id": "misy950",
                              "author": "Osiris_Raphious",
                              "body": "I too was skeptical, but then i saw elon throw two salutes, with the tech billionaire ceos front and center sitting next to trump on his presedential innaguration... I changed my mind...",
                              "score": 1,
                              "created_utc": 1742482215.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mit64xj",
                      "author": "lkn240",
                      "body": "My HP laser printer has been going fine for over 10 years at this point (and it's from before they started all this bullshit)",
                      "score": 1,
                      "created_utc": 1742484549.0,
                      "replies": [
                        {
                          "id": "mita6k0",
                          "author": "edwardphonehands",
                          "body": "Fair. The article did say \"ink *and toner*.\" Yes, laser printers are durable goods whereas inkjets are only semi-durable. If that's the same as being bonded to toil the land your ancestors worked, fine, it's not the proletarianization of the \"middle class,\" but an entirely new techno-feudalism thing.",
                          "score": 1,
                          "created_utc": 1742485731.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "miygqb4",
          "author": "Christopher135MPS",
          "body": "The day we gave banks and investment firms billions and billions of dollars because they were “too big to fail”, we let the corporations know they were untouchable. They could push the rules. They could gamble with millions or ordinary citizens money. They could make terrible business deals. It didn’t matter, because no one would let them collapse. \n\nI’ve heard and read the supposed disaster that allowing them to fail would have caused. But bailing them out has still been ruinous.",
          "score": 1,
          "created_utc": 1742556917.0,
          "replies": [
            {
              "id": "miz5a22",
              "author": "Osiris_Raphious",
              "body": "In any other society, when the gov of the people has to buy out an entire industry, that industry becomes nationalised. But in america....well.... elon throwing fascist salutes on live tv didnt wake people up, i dont know what will...",
              "score": 1,
              "created_utc": 1742566041.0,
              "replies": [
                {
                  "id": "mizln76",
                  "author": "Christopher135MPS",
                  "body": "The size of the subsidies state and federal governments in Australia give you mining corporations…. For a measly royalties tax…. And they don’t even pay much tax…. Jesus just mine the resources ourselves!!!",
                  "score": 1,
                  "created_utc": 1742570926.0,
                  "replies": [
                    {
                      "id": "mj26uqc",
                      "author": "Osiris_Raphious",
                      "body": "yeah we are being massively exploited in australia... thats for sure. But we should do the mining what we did to power and transport and water rights, have one massive gov company, split it into two or three and regulate it heavily. Works for keeping wages fair and work going. Instead of offshoring profits and resources...",
                      "score": 2,
                      "created_utc": 1742598944.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mq09qjw",
          "author": "ThermalDeviator",
          "body": "Republicans want this crap. They wont do a thing but make it easier for companies to rip us off.",
          "score": 1,
          "created_utc": 1746102267.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miq07i0",
      "author": "Shaggyfries",
      "body": "F HP, I’ll never buy another hp printer or product for that matter. Hate my hp printer but don’t need it bad enough to replace yet even though it barely prints just b&w as a color printer, they suck.",
      "score": 73,
      "created_utc": 1742433218.0,
      "replies": []
    },
    {
      "id": "miq5kuj",
      "author": "None",
      "body": "[removed]",
      "score": 18,
      "created_utc": 1742435089.0,
      "replies": [
        {
          "id": "miq9jjz",
          "author": "Boltrag",
          "body": "Does he like Mario by chance?",
          "score": 11,
          "created_utc": 1742436468.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miq2sle",
      "author": "MagicOrpheus310",
      "body": "FUCK HP",
      "score": 54,
      "created_utc": 1742434116.0,
      "replies": [
        {
          "id": "miqd6bi",
          "author": "B_Reele",
          "body": "Couldn’t have said it better. I loved dumping our HP printer for a Brother.",
          "score": 11,
          "created_utc": 1742437762.0,
          "replies": [
            {
              "id": "mir4oul",
              "author": "Low_key_disposable",
              "body": "Sadly recently brother has fallen to the greed side as reported from Louis Rossman. \n\nSource: https://youtu.be/bpHX_9fHNqE?si=xazjLyn3DBdRkq-h",
              "score": 15,
              "created_utc": 1742450491.0,
              "replies": [
                {
                  "id": "mitnu2x",
                  "author": "B_Reele",
                  "body": "Well that is unfortunate. Bummer.",
                  "score": 1,
                  "created_utc": 1742489699.0,
                  "replies": []
                },
                {
                  "id": "miuodag",
                  "author": "Pitiful-Climate8977",
                  "body": "I thought they walked this back already",
                  "score": 1,
                  "created_utc": 1742500166.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mivblk4",
              "author": "TheBadGuyBelow",
              "body": "I trashed every HP printer I owned a long time ago and now have 3 Brother printers in my house. When I come across the laser printers in the thrift stores, I run a quick check on the page count, and usually buy them to give to people I know so that they can ditch their dog shit HP printers too.\n\nI don't even have to pay for toner since I get it all on Amazon Vine for free, in exchange for an honest review. Even if I did have to pay for it, the 3rd party toner works perfectly fine and is dirt cheap anyhow.",
              "score": 3,
              "created_utc": 1742506962.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mipzyyj",
      "author": "arwinda",
      "body": "But is the exec returning the payouts and bonuses for \"increasing revenue\" a couple of quarters ago? Of course not.",
      "score": 12,
      "created_utc": 1742433138.0,
      "replies": []
    },
    {
      "id": "miqff59",
      "author": "brickyardjimmy",
      "body": "They managed to disable my scanner. They got rid of the driver and the last time I updated my system it required I use a new web-based interface rather than a local driver. That new interface allows me to print but not to scan. I called them. They told me to suck eggs.",
      "score": 13,
      "created_utc": 1742438583.0,
      "replies": [
        {
          "id": "mivcd8h",
          "author": "Bawkalor",
          "body": "I used to be able to scan to .PDF straight to a flash drive.  It was low or out of ink one day and wouldn't scan.  It became dumpster fodder that afternoon. \n\nI have steadfastly refused to have anything to do with HP since then.",
          "score": 2,
          "created_utc": 1742507190.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miq3md5",
      "author": "SonOfNod",
      "body": "Honestly, if you are buying HP at this point you deserve what you get. It’s a garbage product by a crap company.",
      "score": 40,
      "created_utc": 1742434403.0,
      "replies": []
    },
    {
      "id": "mir4ytu",
      "author": "Somepotato",
      "body": "That settlement is fishy as fuck. There's no way they didn't get anything behind closed doors.",
      "score": 9,
      "created_utc": 1742450655.0,
      "replies": []
    },
    {
      "id": "miqx6ak",
      "author": "nope100500",
      "body": "Should the suing lawyers even be allowed to settle class action cases in such manner? Get the affected people a proper payout or gtfo. ",
      "score": 5,
      "created_utc": 1742446284.0,
      "replies": []
    },
    {
      "id": "miq8p3i",
      "author": "PlayingDoomOnAGPS",
      "body": "TBH, if you buy an HP printer, that's on you. I also don't feel all that bad for people who got burned on Hawktua or Trump's crypto scams either. It's one thing to get scammed but it's a whole other thing to not do a basic internet search before spending money. If stupid hurt more, maybe we'd have less of it.",
      "score": 23,
      "created_utc": 1742436175.0,
      "replies": [
        {
          "id": "miqfjty",
          "author": "r31ya",
          "body": "i bought HP printer for my office once, \n\nit came with super maddening software that ever encounter. the software is intentionally gimped, many useful manual setting is removed and we only could rely on its (buggy) automated setting.\n\nafter it somehow reinstall itself in my laptop over a dozen times, i chuck that printer to other department and replace it with Epson and later Brother.",
          "score": 8,
          "created_utc": 1742438632.0,
          "replies": [
            {
              "id": "miqjk3k",
              "author": "PlayingDoomOnAGPS",
              "body": "Forgetting all hardware and consumable concerns, HP and Epson are two mfgs I will never EVER deal with on any machine under my personal control for *software* reasons alone. I'd rather [insert whatever the worst scatological reference that most turns your stomach here] than have HP or Epson software installed on any system belonging to anyone I didn't truly hate. And I'd even warn off *some* of the people I hate.",
              "score": 4,
              "created_utc": 1742440180.0,
              "replies": [
                {
                  "id": "miqkqyq",
                  "author": "r31ya",
                  "body": "previously i use Canon.\n\nand because i used to canon, when i tried to fix something on HP printer. Ok, go to printer setting and find that option... where the hell is the option setting?\n\n\\*10 minute of clicking around and slowly decend to madness\\*\n\n\"what the f\\*ck is this piece of shit software!?\"\n\n\"yes, we use dynamic IP, stop reinstalling your f\\*cking self everything i reconnect to the wifi!\"",
                  "score": 3,
                  "created_utc": 1742440660.0,
                  "replies": [
                    {
                      "id": "miuqy3p",
                      "author": "The_Bucket_Of_Truth",
                      "body": "I have a canon and will probably never buy an inkjet printer again in my life.  I got this last one during the pandemic because I also didn't have a lot of space.  I stopped buying ink for it because whether I print 4 pages or 100 it still just says it's out of ink as if it has a timer in it rather than a capacity.  I know ink cartridges can \"dry out\" theoretically so maybe someone can explain that is happening, but it's just stupid to pay for the ink for as often as I actually used it.",
                      "score": 1,
                      "created_utc": 1742500890.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "miqzodc",
                  "author": "korewednesday",
                  "body": "I’m genuinely interested in your complaints with Epson?  That’s what I got to replace my drop-kicked HP, and so far the software has all been pretty easy to navigate and just worked.  \n\nWhat should I keep an eye out/prepare myself for?",
                  "score": 4,
                  "created_utc": 1742447616.0,
                  "replies": [
                    {
                      "id": "mistzvb",
                      "author": "PlayingDoomOnAGPS",
                      "body": "It's been various things over the years but mostly boil down to detection issues (software can't find the device), conflicts (software breaks something else on the system), or privileges (software requiring admin rights to do day to day things standard users should be able to do).",
                      "score": 1,
                      "created_utc": 1742480920.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mis2rlo",
                  "author": "Fantasy_masterMC",
                  "body": "I managed to avoid installing HPsmart on my own device when using my sister's printer (during the time I lived with her) for years by setting up a virtual printer that was IP-linked to the actual device. Still not entirely sure how I managed this, as I have no clue about the underlying mechanics, but it worked for ages, until eventually I had to re-do it every time I wanted to use the printer, so I caved and installed the shite-ware. Barely helped at all, ofc, but since I was moving out again anyway it didn't really matter.\n\nNow I live 100m away from a printshop, and the rare few times I actually have to print something are worth it for not having to deal with any bullshit (I dont need to print anything frequently enough to justify buying a quality printer, same for scanning)",
                  "score": 2,
                  "created_utc": 1742470941.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "miqz6n5",
          "author": "Luxuriosa_Vayne",
          "body": "you really think the avarage Joe really knows the difference between 10 different Printer manufacturers? People walk into a store and ask for a printer, the dumbass workers at the store barely know any more\n\nSucks that you can't just buy something and be happy with it, always shit to look out for it's getting really tiring",
          "score": 6,
          "created_utc": 1742447348.0,
          "replies": []
        },
        {
          "id": "miqgdia",
          "author": "blarghsplat",
          "body": "Comparing consumer products to speculative assets like crypto is one of the stupider comparisons Ive seen. Don't do that. Basic consumer protections against this sort of heinous bullshit is the sort of thing that governments should do, with hefty fines and vigorous enforcement.    \n    \nExpecting everyone to google the reputation of the company of every consumer product they buy before buying them is fucking ridiculous.",
          "score": 4,
          "created_utc": 1742438942.0,
          "replies": [
            {
              "id": "miqhyaj",
              "author": "PlayingDoomOnAGPS",
              "body": "> Basic consumer protections against this sort of heinous bullshit is the sort of thing that governments should do, with hefty fines and vigorous enforcement\n\nI don't disagree. \n\n>Expecting everyone to google the reputation of the company of every consumer product they buy before buying them is fucking ridiculous\n\nHow the fuck so? I do! I was at least *attempting* it in print before the internet! If the information wasn't a simple query from whatever search engine you have set for whatever your browser of choice is away from you then MAYBE? But these same people are sharing Trumpanzee memes from their phones in the middle of Walmart. \n\nIf they can *spread* bullshit but not make the most basic query to identify it... I'm not *completely* without sympathy. But I've got a lot more worthy candidates ahead of them in line.",
              "score": -3,
              "created_utc": 1742439543.0,
              "replies": [
                {
                  "id": "mir7fer",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1742452155.0,
                  "replies": [
                    {
                      "id": "mist6l2",
                      "author": "PlayingDoomOnAGPS",
                      "body": "So you don't have HP printers in Australia?",
                      "score": 1,
                      "created_utc": 1742480666.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "miqbq0m",
          "author": "adisharr",
          "body": "That's a questionable comparison.",
          "score": 2,
          "created_utc": 1742437240.0,
          "replies": []
        },
        {
          "id": "mir8915",
          "author": "iiiinthecomputer",
          "body": "How does Joe Average know though? That's the problem.",
          "score": 2,
          "created_utc": 1742452668.0,
          "replies": [
            {
              "id": "misswvk",
              "author": "PlayingDoomOnAGPS",
              "body": "Search engines? YouTube? Hell, I'm sure if you ask TikTok if you should buy an HP printer, you'll quickly get the correct answer. Even a few seconds of research can expose these things. It's easy as hell to do, even in the store, from your phone. I do it all the time. If someone doesn't, it's hard to feel too much sympathy. It's like walking out in the street without looking both ways.",
              "score": 1,
              "created_utc": 1742480583.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miu69vt",
          "author": "mytransthrow",
          "body": "all the printers are fucked now even brother.",
          "score": 1,
          "created_utc": 1742494952.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miqbcme",
      "author": "NilesGuy",
      "body": "Turn off updates in settings when dealing with HP products",
      "score": 4,
      "created_utc": 1742437108.0,
      "replies": []
    },
    {
      "id": "mit6fmf",
      "author": "Prudent_Valuable603",
      "body": "I’m no longer buying HP printers. I’m fine with the ET-2850 Epson printer I bought at Costco.",
      "score": 5,
      "created_utc": 1742484636.0,
      "replies": []
    },
    {
      "id": "miqjiqp",
      "author": "Necx999",
      "body": "I would consider buying a old-fasioned type writer over owning a HP printer..  Etch a sketch Images rather than HP Garbage.",
      "score": 3,
      "created_utc": 1742440164.0,
      "replies": []
    },
    {
      "id": "miqkvii",
      "author": "earthlingtomartian",
      "body": "I was just about to buy an hp printer for work.  Not going to now.",
      "score": 3,
      "created_utc": 1742440711.0,
      "replies": [
        {
          "id": "miqpjxz",
          "author": "Tek_Freek",
          "body": "Brother laser. Never buy an ink printer.\n\nTo show the value of laser over ink I have an HP 1200 series b/w laser. I obtained it used in 2010 when a client got labels stuck in it and wanted a new printer even after I told them I could clean it. I have drivers that work with new versions of Windows and a print server to capture files and send them to the printer. I buy toner on eBay for pennies compared to ink carts.\n\nIt's been our default printer for 15 years.\n\nI would not buy an HP now ink or laser.",
          "score": 7,
          "created_utc": 1742442673.0,
          "replies": [
            {
              "id": "mir594s",
              "author": "Somepotato",
              "body": "Brother laser for small business and personal text prints, canon for color, xerox for large business.\n\nNever ever HP",
              "score": 4,
              "created_utc": 1742450829.0,
              "replies": []
            },
            {
              "id": "miqsy83",
              "author": "earthlingtomartian",
              "body": "My boss’s only requirement is that it is quiet and prints.",
              "score": 3,
              "created_utc": 1742444215.0,
              "replies": [
                {
                  "id": "misjhyp",
                  "author": "Tek_Freek",
                  "body": "I'm trying to figure out he's talking about you or a printer.",
                  "score": 2,
                  "created_utc": 1742477508.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mit6bto",
              "author": "lkn240",
              "body": "Yep - my old HP color laser printer is great - no issues with it and like you I've had it forever.  10+ years",
              "score": 1,
              "created_utc": 1742484604.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miqmtbb",
      "author": "Chaz-in-NE",
      "body": "Being retired, it is very rare to need anything printed. The ink jet dried out too fast so we bought a Brothers laser. That failed too. Now if I need to print something I email it to myself. At the library, they print it for 10¢.  There section of books and CD are 50¢ so I get one and tell them to keep the change. \n\nMy HP laptop failed in three years so I won’t buy anything from them again.",
      "score": 3,
      "created_utc": 1742441509.0,
      "replies": [
        {
          "id": "mjcgk1c",
          "author": "this_dudeagain",
          "body": "I've never had a brother printer fail.",
          "score": 1,
          "created_utc": 1742752860.0,
          "replies": [
            {
              "id": "mm4abht",
              "author": "Chaz-in-NE",
              "body": "Congrats! It worked for a while, then wouldn’t recognize the password to print. The password is on the machine and just stopped working. I had my wife try too, in case it was my error",
              "score": 1,
              "created_utc": 1744153102.0,
              "replies": [
                {
                  "id": "mm4l0yb",
                  "author": "this_dudeagain",
                  "body": "Should be able to factory reset.",
                  "score": 1,
                  "created_utc": 1744156734.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "miqw7sx",
      "author": "eddiespaghettio",
      "body": "HP printers have been so notoriously shit for so long that at this point it’s your fault if you bought an HP printer. It’s like falling for one of those IRS gift card scams.",
      "score": 3,
      "created_utc": 1742445802.0,
      "replies": []
    },
    {
      "id": "miqzp4e",
      "author": "thegulo13",
      "body": "I got burned by HP over a document scanner. Waited for the update, the software has it classified as a printer instead. So now I did the humane thing by having it recycled. Now I’m thinking about getting an Epson. Never again will I buy anything HP!",
      "score": 3,
      "created_utc": 1742447628.0,
      "replies": [
        {
          "id": "mirgqum",
          "author": "InfernalGod",
          "body": "Epson eco tank fucks!",
          "score": 1,
          "created_utc": 1742458163.0,
          "replies": [
            {
              "id": "mirh73b",
              "author": "thegulo13",
              "body": "Love the enthusiasm but just to be clear I’m talking about a document scanner not a printer and my disdain for HP in general.",
              "score": 2,
              "created_utc": 1742458469.0,
              "replies": [
                {
                  "id": "mirhbk2",
                  "author": "InfernalGod",
                  "body": "Ah, I don’t know too much in that regard. Best of luck mate!",
                  "score": 2,
                  "created_utc": 1742458552.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "miurgbo",
              "author": "The_Bucket_Of_Truth",
              "body": "Unless you're needing to print photos or something where I assume liquid and ink jet style printers are still superior, I think laser is unrivaled.  We have an ecotank and while it is better than inkjet for someone who doesn't print super often (cause it retains most of the fluid), we still had issues where I had to run a bunch of services to unclog it from not being used often enough.  Laser just works.",
              "score": 1,
              "created_utc": 1742501033.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "miraahj",
      "author": "General_Benefit8634",
      "body": "I have a print shop near me. They are open 16 hours a day, 7 days a week (which is crazy because normally, in Germany) everything is closed Sunday’s (except spätis and florists). 7 cents a page. Totally worth it to allow me to forever delete any printer / scanner.",
      "score": 3,
      "created_utc": 1742453929.0,
      "replies": [
        {
          "id": "mis33p4",
          "author": "Fantasy_masterMC",
          "body": "The one near me isn't open QUITE as much, but its 100m away and if I manage to avoid the service fee it's also quite affordable.",
          "score": 1,
          "created_utc": 1742471092.0,
          "replies": []
        }
      ]
    },
    {
      "id": "misrrby",
      "author": "HowCouldYouSMH",
      "body": "Why are they STILL in business?? I stopped buying HP 15-20 years ago when they started this shite. I loved their product before this",
      "score": 3,
      "created_utc": 1742480221.0,
      "replies": []
    },
    {
      "id": "misu5pt",
      "author": "neuromonkey",
      "body": "Brother laser printers are cheap and great.",
      "score": 3,
      "created_utc": 1742480968.0,
      "replies": []
    },
    {
      "id": "mit3hbc",
      "author": "Manofthedown",
      "body": "Corporatist fascism",
      "score": 3,
      "created_utc": 1742483770.0,
      "replies": []
    },
    {
      "id": "mir5lmg",
      "author": "silverbolt2000",
      "body": "Only an idiot willingly buys HP products.\n\nNo one can really claim ignorance of HP’s business practices these days.",
      "score": 5,
      "created_utc": 1742451039.0,
      "replies": []
    },
    {
      "id": "miq64e3",
      "author": "Nyoka_ya_Mpembe",
      "body": "Me looking at their printers in store: Not this time. ",
      "score": 2,
      "created_utc": 1742435281.0,
      "replies": []
    },
    {
      "id": "miqe4hs",
      "author": "kneel0001",
      "body": " Bought a replacement HP for my old HP. The latest model of what I had… my old one was great for so many years… new one is a lightweight piece of junk… and you have run it through an app…. Really?",
      "score": 2,
      "created_utc": 1742438108.0,
      "replies": []
    },
    {
      "id": "miqjio3",
      "author": "DoubleJumps",
      "body": "The last HP printer I had pushed me over the edge.  \n\nOne day, I just opened the window, took out the screen, and shoved that thing out, to fall from the second story window onto concrete.\n\nThis didn't break it enough, so I went out and finished the job with my foot and a hammer. \n\nI have avoided all HP products since.",
      "score": 2,
      "created_utc": 1742440164.0,
      "replies": [
        {
          "id": "misfhg2",
          "author": "blackdynomitesnewbag",
          "body": "![gif](giphy|l2SpMDbxk09bYpGPC)",
          "score": 2,
          "created_utc": 1742476090.0,
          "replies": []
        },
        {
          "id": "mir76ut",
          "author": "snapeyouinhalf",
          "body": "My husband threw his HP off the deck before we got married. I got him a Canon to replace it with and the printer has been safe ever since.",
          "score": 1,
          "created_utc": 1742452008.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miqno92",
      "author": "narcisslol",
      "body": "What’s the best alternative brand to buy?",
      "score": 2,
      "created_utc": 1742441869.0,
      "replies": [
        {
          "id": "miqoaqx",
          "author": "GustavSnapper",
          "body": "There is none. Even brother is headed down this route. If you can get one of the ink tank ones it’s the best option still but all brands are now garbage.",
          "score": 5,
          "created_utc": 1742442134.0,
          "replies": []
        },
        {
          "id": "misjcs8",
          "author": "Tek_Freek",
          "body": "Brother laser. Do not buy any printer that uses ink.",
          "score": 4,
          "created_utc": 1742477458.0,
          "replies": []
        },
        {
          "id": "mir7bna",
          "author": "snapeyouinhalf",
          "body": "Canon",
          "score": 2,
          "created_utc": 1742452090.0,
          "replies": []
        },
        {
          "id": "mixvena",
          "author": "RealisticEntity",
          "body": "I have an OKI colour laser printer (MC361). Bought it in 2012-2013 (a long time ago now), and it's still going strong. I've only replaced the toner cartridges once. Granted, I don't print all that often, but the toner never dries out and the printer has had no issues at all. I'm sure I would have gone though a few ink jet printers and 20+ ink cartridge replacements by now if I hadn't gotten the OKI.",
          "score": 1,
          "created_utc": 1742544706.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mirag76",
      "author": "Crowdfunder101",
      "body": "Let me guess, they weren’t able to print out any of the evidence?",
      "score": 2,
      "created_utc": 1742454028.0,
      "replies": []
    },
    {
      "id": "mis3rfg",
      "author": "25electrons",
      "body": "This right here is why I sold my HP stock and I’ll never own another HP device.",
      "score": 2,
      "created_utc": 1742471386.0,
      "replies": []
    },
    {
      "id": "misbxrq",
      "author": "phaedruszamm1",
      "body": "I threw mine in the trash",
      "score": 2,
      "created_utc": 1742474773.0,
      "replies": []
    },
    {
      "id": "mist64w",
      "author": "Panda-Maximus",
      "body": "Just dont buy HP. This shit is nothing new.",
      "score": 2,
      "created_utc": 1742480663.0,
      "replies": []
    },
    {
      "id": "mitzt4d",
      "author": "crawdadicus",
      "body": "They paid the right judge this time.",
      "score": 2,
      "created_utc": 1742493069.0,
      "replies": []
    },
    {
      "id": "miv12q6",
      "author": "XEnd77",
      "body": "Bricked my printer right as I connected wifi.Few years back. It doesn't recognize the HP printer from HP!",
      "score": 2,
      "created_utc": 1742503793.0,
      "replies": []
    },
    {
      "id": "mixe35d",
      "author": "TakeTheWheelTV",
      "body": "Fuck HP. I threw mine out and will never in my life buy any HP product.",
      "score": 2,
      "created_utc": 1742534229.0,
      "replies": []
    },
    {
      "id": "mpnsgwp",
      "author": "SmedlyB",
      "body": "Business as usual in the US. Sure would be nice if the US had some kind of a Consumer Protection agency.",
      "score": 2,
      "created_utc": 1745935175.0,
      "replies": []
    },
    {
      "id": "miq7zga",
      "author": "FacepalmFullONapalm",
      "body": "Play stupid games, win stupid prizes. Gambling with hp is a stupid game.",
      "score": 2,
      "created_utc": 1742435928.0,
      "replies": []
    },
    {
      "id": "miqhj6t",
      "author": "Morgin187",
      "body": "Don’t buy this crap unless you like to waste your earned money. Laser printers last long just don’t buy from HP or Dell they’re scum",
      "score": 1,
      "created_utc": 1742439380.0,
      "replies": []
    },
    {
      "id": "miqrd2k",
      "author": "edthesmokebeard",
      "body": "2 shockers:\n\nHP sucks\n\nLawyers win",
      "score": 1,
      "created_utc": 1742443480.0,
      "replies": []
    },
    {
      "id": "mirqeut",
      "author": "latortillablanca",
      "body": "What codswallop",
      "score": 1,
      "created_utc": 1742464452.0,
      "replies": []
    },
    {
      "id": "misiydt",
      "author": "Soulpatch7",
      "body": "What about Epson? How has it avoided these claims?",
      "score": 1,
      "created_utc": 1742477314.0,
      "replies": []
    },
    {
      "id": "mivdedq",
      "author": "Anishinaapunk",
      "body": "At this point, I have no sympathy for anyone who still buys an HP printer and then exclaims, \"HP ripped me off!\" \n\nHP has become the Nigerian Prince of printer companies, and anyone buying from them when their malfeasance has been widely known for years is just blithely giving away their money to scammers.",
      "score": 1,
      "created_utc": 1742507501.0,
      "replies": []
    },
    {
      "id": "mivz6rl",
      "author": "Supermkcay",
      "body": "Lawyers always win!",
      "score": 1,
      "created_utc": 1742514437.0,
      "replies": []
    },
    {
      "id": "mj582y8",
      "author": "Nalfzilla",
      "body": "So never buy HP, got it",
      "score": 1,
      "created_utc": 1742651447.0,
      "replies": []
    },
    {
      "id": "mja35rc",
      "author": "rolfraikou",
      "body": "So, now that Brother also sucks, is there ANY printer that doesn't suck out there?\n\nIt seems wild to me that not one company is willing to come forward and destroy all the competition by just letting you use and own a printer.",
      "score": 1,
      "created_utc": 1742717690.0,
      "replies": []
    },
    {
      "id": "mjgv4yd",
      "author": "smashjohn486",
      "body": "And this is why I haven’t bought an HP printer in… 25 years.",
      "score": 1,
      "created_utc": 1742819726.0,
      "replies": []
    },
    {
      "id": "miq6dpb",
      "author": "Far_Standard_700",
      "body": "There is no dealing with Putin- you just have to beat him.",
      "score": 0,
      "created_utc": 1742435371.0,
      "replies": []
    },
    {
      "id": "miqv75k",
      "author": "kruecab",
      "body": "Brother printers are cheap and feature rich with a minimal amount of bullshit.",
      "score": 0,
      "created_utc": 1742445293.0,
      "replies": []
    }
  ]
}