{
  "post": {
    "title": "The World’s Most Prolific Retro Handheld Maker Just Stopped U.S. Shipments",
    "author": "chrisdh79",
    "id": "1k4f004",
    "score": 6904,
    "created_utc": 1745245976.0,
    "selftext": "",
    "num_comments": 392,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k4f004/the_worlds_most_prolific_retro_handheld_maker/"
  },
  "comments": [
    {
      "id": "mo9j1ad",
      "author": "darkwoodframe",
      "body": "Tried to get curling (sport) equipment from Canada last week, they stopped shipments too.  This is happening everywhere.\n\nBuy your specialized equipment while you still can, if you still can.",
      "score": 1537,
      "created_utc": 1745246740.0,
      "replies": [
        {
          "id": "mo9zfza",
          "author": "Platinumdogshit",
          "body": "Doesn't the granite for those stones come from like once very specific island?",
          "score": 198,
          "created_utc": 1745252500.0,
          "replies": [
            {
              "id": "moa662p",
              "author": "darkwoodframe",
              "body": "Yes, off the coast of Scotland.  You literally cannot make a proper curling rock with stone from anywhere else.\n\nNow try telling a whole nation of curlers they need to use one stone at home but will need to use international standards when playing anywhere else.  And curlers love to travel.\n\nCutting off that supply would wreck the entire sport.  At the very least, it's about to get more expensive.  Nothing else can be done.  Nothing.",
              "score": 234,
              "created_utc": 1745254509.0,
              "replies": [
                {
                  "id": "moadvm5",
                  "author": "CO_PC_Parts",
                  "body": "is this going to turn into one of those Adobe/Australia thing where american curlers are going to fly to Scotland and then buy their stones and fly home?\n\nIf you don't know Adobe products used to be so expensive in Australia you could fly the US first class, purchase the software, fly home and still save money.  Same with Americans and hip replacements in Spain.",
                  "score": 161,
                  "created_utc": 1745256723.0,
                  "replies": [
                    {
                      "id": "moaepxu",
                      "author": "darkwoodframe",
                      "body": "Those stones are 44 lbs and you need 16 to make a set enough for a game.  I don't see that as feasible.   Not for the rocks, anyway.",
                      "score": 90,
                      "created_utc": 1745256966.0,
                      "replies": [
                        {
                          "id": "moaft4d",
                          "author": "CO_PC_Parts",
                          "body": "Yeah I figured it'd be pretty comical if a long line of people were all checking heavy ass bags after a single day turn around flight.",
                          "score": 62,
                          "created_utc": 1745257277.0,
                          "replies": [
                            {
                              "id": "mocoxi2",
                              "author": "luffydkenshin",
                              "body": "And, each stone is $600 each. Us American curlers are in for a rough patch we cant sweep.",
                              "score": 41,
                              "created_utc": 1745282744.0,
                              "replies": [
                                {
                                  "id": "mocqeg0",
                                  "author": "darkwoodframe",
                                  "body": "We're being left out in the cold.",
                                  "score": 15,
                                  "created_utc": 1745283252.0,
                                  "replies": [
                                    {
                                      "id": "mocqkfb",
                                      "author": "luffydkenshin",
                                      "body": "Its just gonna be HARRRRRD HARD HAAAAAAARD for us for a little while, for sure.",
                                      "score": 16,
                                      "created_utc": 1745283312.0,
                                      "replies": [
                                        {
                                          "id": "mocrqkm",
                                          "author": "darkwoodframe",
                                          "body": "I wish they'd lay OFFFFFFF OFFFFFFF the tariffs :/",
                                          "score": 7,
                                          "created_utc": 1745283723.0,
                                          "replies": [
                                            {
                                              "id": "mocs0c8",
                                              "author": "luffydkenshin",
                                              "body": "On the button with that one.",
                                              "score": 2,
                                              "created_utc": 1745283815.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mog8dkp",
                              "author": "marcus_centurian",
                              "body": "Something similar happened on a flight I was on. A bowling league had a tournament and all of their custom bowling balls were in the cargo hold, so the flight was like half full to accommodate the weight.",
                              "score": 1,
                              "created_utc": 1745337623.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "moead15",
                          "author": "polopolo05",
                          "body": "I dont know why you cant use different materials.",
                          "score": -2,
                          "created_utc": 1745308455.0,
                          "replies": [
                            {
                              "id": "mof5qas",
                              "author": "darkwoodframe",
                              "body": "Weight, you need stones that won't break apart, etc.",
                              "score": 1,
                              "created_utc": 1745325323.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mobujzb",
                      "author": "SarcasticOptimist",
                      "body": "Medical tourism for US citizens is pretty common. I'm considering Korea for eye surgery. It's why we have an Italian Plumber.",
                      "score": 28,
                      "created_utc": 1745272408.0,
                      "replies": [
                        {
                          "id": "mocdhfz",
                          "author": "BigBeeOhBee",
                          "body": "![gif](giphy|atQF1zaSGq8s8)",
                          "score": 14,
                          "created_utc": 1745278784.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "modinh2",
                      "author": "bunnybash",
                      "body": "It wasn’t first class, but yes the story is true, it was cheaper to fly to America in economy and buy adobe software. Then the internet made it real cheap. Australia flies its skull and cross bones flag. ",
                      "score": 10,
                      "created_utc": 1745293540.0,
                      "replies": [
                        {
                          "id": "moersnh",
                          "author": "like_sharkwolf_drunk",
                          "body": "Can’t say I blame them.  I did for photoshop once a looooooong time ago.  I get software that calibre being a little expensive, but it’s probably one of the most pirated programs ever because of it.  I believe you can make something expensive enough even corporate boot lickers will go “Heyyyy wait a minute.   I licked your boots though?” Similar situation with software John deer tractors run on.   American farmers were ordering Ukrainian hacked software, having it shipped to them and running their tractors on it.  That’s the America I’m proud of personally.",
                          "score": 6,
                          "created_utc": 1745319220.0,
                          "replies": [
                            {
                              "id": "moo1u8o",
                              "author": "drake90001",
                              "body": "[They were buying Ukrainian John Deere service tools which was then cracked (stripped of drm) and sold on the black market to anyone willing to.](https://www.vice.com/en/article/why-american-farmers-are-hacking-their-tractors-with-ukrainian-firmware/)\n\n>Deere charges $230, plus $130 an hour for a technician to drive out and plug a connector into their USB port to authorize the part.\n\n> I went searching for one of the forums where pirated John Deere firmware is sold. After I found it, I couldn’t do much of anything without joining. I was sent an email with instructions, which required me to buy a $25 dummy diagnostic part from a third-party website. Instead of the part, I was sent a code to join the forum\n\nFunnily enough it’s possible to do the same in the US with Ford vehicles. I hacked my 2013 ford explorer using a knock off Ford scan tool (ELM32) and free software similar to the dealership software that can do the same thing. Turns out Ford puts GPS modules in every vehicle and just disable navigation. I changed a 4 to a 9 and put a $15 maps SDcard off amazon, and bobs your uncle.",
                              "score": 1,
                              "created_utc": 1745438802.0,
                              "replies": [
                                {
                                  "id": "mqf0wj5",
                                  "author": "like_sharkwolf_drunk",
                                  "body": "That’s sick man.  Jail broke ford.  Respect brother.  Subscriptions are getting insane.  The concept you can buy a thing but not the rights to use it indefinitely or modify it is insane to me.",
                                  "score": 2,
                                  "created_utc": 1746299107.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "moh0wc7",
                          "author": "iknowwhoyourmotheris",
                          "body": "And now I bought affinity.  Fuck adobe.",
                          "score": 3,
                          "created_utc": 1745345862.0,
                          "replies": [
                            {
                              "id": "moixvlz",
                              "author": "bunnybash",
                              "body": "Same!! Lifetime license, actually affordable and easier to use. And I use Davinci resolve for video. ",
                              "score": 3,
                              "created_utc": 1745367436.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mof78db",
                      "author": "rtakehara",
                      "body": "I don’t know how it is today, but some time ago here in Brazil, it was cheaper to fly to the USA, buy an iPhone, stay in a hotel for the night and come back on the next day than to just buy locally.",
                      "score": 1,
                      "created_utc": 1745325892.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "moavhkv",
                  "author": "thegreedyturtle",
                  "body": "There's always something that can be done. In fact the answer here is obvious. It wouldn't be difficult to convince a US customs agent that the 49.8 lb rocks in both of your checked bags and carryon are just decorative pieces given to you free by your host!\n\n\nNGL though, we're about to see some legit smuggling routes down from Canada.",
                  "score": 23,
                  "created_utc": 1745261851.0,
                  "replies": [
                    {
                      "id": "moet5ft",
                      "author": "like_sharkwolf_drunk",
                      "body": "People smuggle too much and the CIA will get their feelings hurt that they weren’t invited. \n\nSincerely, a lot of money is about to be made from new smuggling opportunities opening up.   It’s about get get crazy.   Smuggling in prohibition got plenty crazy.",
                      "score": 10,
                      "created_utc": 1745319893.0,
                      "replies": [
                        {
                          "id": "moew415",
                          "author": "beren12",
                          "body": "The one big difference with prohibition is people could easily make liquor at home or in the woods",
                          "score": 3,
                          "created_utc": 1745321290.0,
                          "replies": [
                            {
                              "id": "moews0r",
                              "author": "thegreedyturtle",
                              "body": "And there was still a ton of liquor smuggled in anyway.",
                              "score": 1,
                              "created_utc": 1745321597.0,
                              "replies": [
                                {
                                  "id": "moewubn",
                                  "author": "beren12",
                                  "body": "Yeah, but nothing like the domestic amounts consumed",
                                  "score": 2,
                                  "created_utc": 1745321626.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mob5y79",
                      "author": "Rockergage",
                      "body": "For a while I was planning to take a weekend trip up to Canada to get the switch 2, because after conversion rates, taxes etc it still equaled out for me to buy a switch 2 at the original price before any tariffs got applied. Yeah I’d need to buy a hotel/train ticket up to Vancouver but largely for a weekend getaway it would be a pleasantry and nice vacation. \n\nThen the conversion rates started to change, the Canadian dollar was at about .68-.69 per U.S. Dollar, on average, it’s climbed to .72 and probably will keep going up if the dollar continues to weaken. Like sure it’s only increased like 30$ less in favor of me as an American but basically ever .01$ is going to cost me 10$ on this 1000$ overall purchase. If it gets up to .8 then I’m paying over 100$ extra.",
                      "score": 8,
                      "created_utc": 1745264962.0,
                      "replies": [
                        {
                          "id": "modeuhp",
                          "author": "frankyseven",
                          "body": "You still need to pay tariffs when you bring it back into the US.",
                          "score": -1,
                          "created_utc": 1745291974.0,
                          "replies": [
                            {
                              "id": "modf2h7",
                              "author": "Rockergage",
                              "body": "No I don’t, Canada to USA allows me to bring back 800$ usd without customs assuming I spend 48 hours in there.",
                              "score": 4,
                              "created_utc": 1745292065.0,
                              "replies": [
                                {
                                  "id": "moe96gf",
                                  "author": "Lennox403",
                                  "body": "For now",
                                  "score": 3,
                                  "created_utc": 1745307695.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mofvial",
                              "author": "Molwar",
                              "body": "Take it out and don't bring the packaging back.",
                              "score": 2,
                              "created_utc": 1745333872.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moaj4js",
                  "author": "wizzard419",
                  "body": "Pair with that it's playerbase probably isn't as large as other sports, there likely is no push to change this. While thousands of curlers in the US are impacted, it's probably not going to push for change.",
                  "score": 28,
                  "created_utc": 1745258219.0,
                  "replies": [
                    {
                      "id": "mobpg33",
                      "author": "speculatrix",
                      "body": "They're caught between a rock and a hard place",
                      "score": 18,
                      "created_utc": 1745270791.0,
                      "replies": [
                        {
                          "id": "mocla0o",
                          "author": "hexcor",
                          "body": "BOOOOOOOOOOOOOOOOO, take my up vote\n\n(sigh, and my axe)",
                          "score": 0,
                          "created_utc": 1745281468.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moa8gis",
                  "author": "Platinumdogshit",
                  "body": "And Americans would fall behind competitively since they're forced to use a non standard rock or pay more for the legal one. Idk how much curlers really make and how worth it it is to them.",
                  "score": 20,
                  "created_utc": 1745255168.0,
                  "replies": [
                    {
                      "id": "moavkrk",
                      "author": "thegreedyturtle",
                      "body": "Curlers make money?",
                      "score": 14,
                      "created_utc": 1745261877.0,
                      "replies": [
                        {
                          "id": "moew5uz",
                          "author": "beren12",
                          "body": "Soros pays them, too",
                          "score": 3,
                          "created_utc": 1745321313.0,
                          "replies": [
                            {
                              "id": "moewuz5",
                              "author": "thegreedyturtle",
                              "body": "Thanks, Obama.",
                              "score": 2,
                              "created_utc": 1745321634.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moap5uh",
                  "author": "None",
                  "body": "that sucks. There must be at least 5 of you",
                  "score": 4,
                  "created_utc": 1745259984.0,
                  "replies": []
                },
                {
                  "id": "mobvzpz",
                  "author": "ariukidding",
                  "body": "But but but, businesses are rushing to get back to the US? Billions and billions and billions. I dont have the facts but Kings don’t lie do they?",
                  "score": 1,
                  "created_utc": 1745272878.0,
                  "replies": []
                },
                {
                  "id": "moamhuk",
                  "author": "CamiloArturo",
                  "body": "I didn’t know that and it’s the best fact Ive heard this year hehehe. I’m going to look it up because it’s awesome",
                  "score": 1,
                  "created_utc": 1745259201.0,
                  "replies": []
                },
                {
                  "id": "moazb39",
                  "author": "iiiinthecomputer",
                  "body": "The US will just redefine the sport to its own local supply. Then demand everyone else convert to the US version.\n\nThat's what it usually does.",
                  "score": 0,
                  "created_utc": 1745262987.0,
                  "replies": [
                    {
                      "id": "modflv2",
                      "author": "frankyseven",
                      "body": "Yeah, that ship has sailed for the US.",
                      "score": 3,
                      "created_utc": 1745292285.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mocbuli",
              "author": "FluffTheMagicRabbit",
              "body": "Ailsa Craig, Scotland.\n\nLess island, more big round rock in the sea. Plug of an extinct volcano exposed by the sea.\n[img](https://www.livebreathescotland.com/article_images/ailsa-craig4.webp)",
              "score": 5,
              "created_utc": 1745278234.0,
              "replies": [
                {
                  "id": "mod9m8j",
                  "author": "Lazy_meatPop",
                  "body": "That's a boob with nipple showing.",
                  "score": 2,
                  "created_utc": 1745289948.0,
                  "replies": [
                    {
                      "id": "moew9j2",
                      "author": "beren12",
                      "body": "We just called those boobs",
                      "score": 1,
                      "created_utc": 1745321361.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mo9npsv",
          "author": "hardy_83",
          "body": "Didn't a major shipping company stop doing shipments over $800 to the US recently?",
          "score": 261,
          "created_utc": 1745248158.0,
          "replies": [
            {
              "id": "moa8ybr",
              "author": "blazze_eternal",
              "body": "They might stop all together now that there is no minimum exemption. I assume they'll have thousands of canceled shipments once people realize they are paying 3x more for shipping than the products.",
              "score": 99,
              "created_utc": 1745255310.0,
              "replies": [
                {
                  "id": "mobx3o4",
                  "author": "FatalExceptionError",
                  "body": "DHL stopped shipments to the US over $800 due to Trump making the paperwork requirements more burdensome for anything over $800.  The admin is planning to increase the paperwork for items even cheaper than $800, so DHL is expected to stop shipping cheaper items when that happens.",
                  "score": 29,
                  "created_utc": 1745273250.0,
                  "replies": [
                    {
                      "id": "modwn89",
                      "author": "LittleNobody60",
                      "body": "This would destroy UK/Europe to US eCom correct?",
                      "score": 4,
                      "created_utc": 1745300106.0,
                      "replies": [
                        {
                          "id": "moezyv4",
                          "author": "FatalExceptionError",
                          "body": "It will further the destruction of US trade.",
                          "score": 5,
                          "created_utc": 1745322988.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moc3c95",
                  "author": "lost_send_berries",
                  "body": "The change on the minimum is only for shipping from China",
                  "score": 0,
                  "created_utc": 1745275367.0,
                  "replies": [
                    {
                      "id": "modwtqe",
                      "author": "spiced_life",
                      "body": "Anything made in china, not just coming directly from china.",
                      "score": 3,
                      "created_utc": 1745300206.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mo9ogg6",
              "author": "TTWBB_V2",
              "body": "DHL i think",
              "score": 159,
              "created_utc": 1745248381.0,
              "replies": [
                {
                  "id": "mo9qsih",
                  "author": "d3gaia",
                  "body": "Yes, it was DHL. ",
                  "score": 67,
                  "created_utc": 1745249084.0,
                  "replies": [
                    {
                      "id": "moaos2x",
                      "author": "King_Tamino",
                      "body": "Big oof. DHL is huge",
                      "score": 30,
                      "created_utc": 1745259871.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mobqiou",
              "author": "Odd_Shock421",
              "body": "DHL Get used to this. This is what the USA voted for. Or rather say thanks to the 36% who couldn’t be bothered to vote.",
              "score": 22,
              "created_utc": 1745271124.0,
              "replies": [
                {
                  "id": "moddl03",
                  "author": "MisterRipster",
                  "body": "Harris would've been so much better",
                  "score": 1,
                  "created_utc": 1745291464.0,
                  "replies": [
                    {
                      "id": "modknm3",
                      "author": "Programmdude",
                      "body": "I don't know if this is sarcasm or not, but...\n\n* She wouldn't have started a trade war with the entire world at the same time.\n* She wouldn't have started a recession.\n* She wouldn't have threatened to invade not one, not two, but three of the US's allies.\n* She wouldn't have attempted to lift sanctions on a country that's off committing war crimes in europe.\n\nThere's heaps of other things I'm forgetting, but she could have done literally nothing and would have been a better president.",
                      "score": 31,
                      "created_utc": 1745294375.0,
                      "replies": [
                        {
                          "id": "moemig2",
                          "author": "Aelig_",
                          "body": "The fact you're leaving out the absolute worst thing the US is doing right now is why the US is allowed to be a fascist country. \n\nPutting people in death camps is orders of magnitude more fucked up than everything else.",
                          "score": 12,
                          "created_utc": 1745316306.0,
                          "replies": [
                            {
                              "id": "moi0fi0",
                              "author": "Programmdude",
                              "body": "I'm not american, so I guess I focused on stuff that was closer to impacting me more than immigrants to the US. I don't think they're death camps yet though (though please link a source if I'm wrong), I think it's closer to \"just\" a concentration camp. Still horrific though.",
                              "score": 1,
                              "created_utc": 1745356404.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "moa8d8o",
              "author": "None",
              "body": "[deleted]",
              "score": 25,
              "created_utc": 1745255141.0,
              "replies": [
                {
                  "id": "moab1hj",
                  "author": "ExtremeCreamTeam",
                  "body": "Please, allow me to unshittify your link: \n\nhttps://www.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
                  "score": 76,
                  "created_utc": 1745255913.0,
                  "replies": [
                    {
                      "id": "moasctg",
                      "author": "CrippledAnatomy",
                      "body": "You took out barely 10characters. Calm down hero",
                      "score": -91,
                      "created_utc": 1745260928.0,
                      "replies": [
                        {
                          "id": "mobenkz",
                          "author": "Skullcrimp",
                          "body": "Learn what amp is before commenting. https://brave.com/privacy-updates/18-de-amp/",
                          "score": 24,
                          "created_utc": 1745267550.0,
                          "replies": [
                            {
                              "id": "mobij5a",
                              "author": "MultiVerseAlex",
                              "body": "The irony of linking a brave browser article about privacy is hilarious considering they have a long history of bad privacy decisions. And amp isn’t any more harmful than anything else you might use from google. Gmail, phones, YouTube, Waze etc. this is just fear mongering. Amp isn’t a force it’s a choice you can make as a dev. They do it because it’s easier not because google has a gun to the head of every dev online. Don’t use google search and don’t click links online and you eliminate 99% of amp links.",
                              "score": 2,
                              "created_utc": 1745268683.0,
                              "replies": [
                                {
                                  "id": "mobls4l",
                                  "author": "Skullcrimp",
                                  "body": "I'm aware of Brave's issues, yet they're still correct about amp. \n\n> Don't click links\n\nHow about instead I do click links, unless they're amp links in a reddit thread, in which case I educate the poster. \n\n:)",
                                  "score": 8,
                                  "created_utc": 1745269655.0,
                                  "replies": [
                                    {
                                      "id": "mobo540",
                                      "author": "MultiVerseAlex",
                                      "body": "You didn’t educate anything. Ben saw I Fuentes they didn’t click your link. You did and solved nothing",
                                      "score": -12,
                                      "created_utc": 1745270383.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mobksae",
                                  "author": "emongu1",
                                  "body": "\"Amp is just as bad as everything else google does\" is not the gotcha you think it is.",
                                  "score": 13,
                                  "created_utc": 1745269351.0,
                                  "replies": [
                                    {
                                      "id": "mobp6h3",
                                      "author": "CrippledAnatomy",
                                      "body": "They didn’t say just as bad. They said no more harmful. Very different things\n\nYou’re tracked more simply owning an android phone than any amp links can provide. Ever watched YouTube? Sorry more data was compromised than amp. Ever connected to a buddies WiFi who uses Gmail. Sorry all your data is already gone. No need for amp. \n\nTo draw the line at amp when you’re already been compromised is silly. Imagine if when the spy gets caught and his identity found out. They just, pretend you can’t see them still and keep the mask on. That’s what you’re doing here. You already gave them everything. Amp isn’t doing anything that wasn’t already accomplished",
                                      "score": 1,
                                      "created_utc": 1745270706.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mobz1wu",
                                  "author": "QuickQuirk",
                                  "body": "I justread the article, and the position seems weird to me:\nSince the domain is still 'cnn.com' (or other company), that means *cnn* has explicitly worked with google to host that content - as google can't just add a subdomain without their permission.\n\nWhich means that it's, well, legitimate, and the way the original site wants it presented.\n\nWhat am I missing here?",
                                  "score": -2,
                                  "created_utc": 1745273907.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "moasqug",
                          "author": "hacksong",
                          "body": "Google AMP sucks. He did the Lord's work.",
                          "score": 50,
                          "created_utc": 1745261043.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "moblmh4",
              "author": "mrdeworde",
              "body": "Personal shipments; they'll still do B2B, though subject to delays.",
              "score": 1,
              "created_utc": 1745269606.0,
              "replies": []
            },
            {
              "id": "mobti6c",
              "author": "MephistosGhost",
              "body": "DHL",
              "score": 1,
              "created_utc": 1745272072.0,
              "replies": []
            },
            {
              "id": "mobuzms",
              "author": "Jqnighthawk24",
              "body": "Yes, DHL",
              "score": 1,
              "created_utc": 1745272550.0,
              "replies": []
            },
            {
              "id": "mobwm24",
              "author": "17175RC7",
              "body": "DHL.  Saw a story on it yesterday.",
              "score": 1,
              "created_utc": 1745273085.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moctjek",
          "author": "WebHead1287",
          "body": "Doesn’t even need to be specialized. Dell and Lenovo have paused shipments into the US. In the same year Windows 10 reaches EOL. \n\nThis trade war is going to be so far reaching at catastrophic.",
          "score": 20,
          "created_utc": 1745284347.0,
          "replies": []
        },
        {
          "id": "mo9zx5p",
          "author": "Nephroidofdoom",
          "body": "Guess it’s finally time to move on the Steamdeck I’ve been sleeping on for 2 years.",
          "score": 39,
          "created_utc": 1745252647.0,
          "replies": [
            {
              "id": "moan5gb",
              "author": "None",
              "body": "I got mine in January of this year. \n\nIt'll take about 4 hours before you forget what it was like without it.",
              "score": 12,
              "created_utc": 1745259393.0,
              "replies": []
            },
            {
              "id": "moa1vc6",
              "author": "Silly_Elevator_3111",
              "body": "You won’t regret it",
              "score": 21,
              "created_utc": 1745253239.0,
              "replies": []
            },
            {
              "id": "moadppx",
              "author": "redbluemmoomin",
              "body": "those are made in China too..I'd buy one quick.",
              "score": 24,
              "created_utc": 1745256676.0,
              "replies": []
            },
            {
              "id": "moa3pbr",
              "author": "Castle-dev",
              "body": "Do it, they’re great",
              "score": 15,
              "created_utc": 1745253788.0,
              "replies": []
            },
            {
              "id": "moawf12",
              "author": "tha_dank",
              "body": "It took me all of like 3 months of having my anbernic that I was like…what’s this steam deck you speak of?? lol it’s literally the coolest thing I’ve ever owned in my life. \n\nAnd while 1.5 years later I’m grown more accustomed to it, it still blows my butthole open on a weekly basis when I fire up something else and like holy fuck this looks so good on here. \n\nFucking doom 2016 and wolfenstein running like 70-90 fps while on high-max setttings is just sickening. It’s so dope.",
              "score": 3,
              "created_utc": 1745262127.0,
              "replies": []
            },
            {
              "id": "moc29uo",
              "author": "ScumLikeWuertz",
              "body": "go OLED, I swear it's a life changing experience",
              "score": 2,
              "created_utc": 1745275005.0,
              "replies": [
                {
                  "id": "modn7mm",
                  "author": "Equivalent-Bet-8771",
                  "body": "OLED is woke liberal bullshit. Real men use TN displays with burnt pixels!",
                  "score": 1,
                  "created_utc": 1745295506.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mod4c4e",
              "author": "AusGeno",
              "body": "Do it quick before it gets the tariff kiss of death too.  I haven't touched any of my other retro handlhelds since getting the SD.",
              "score": 1,
              "created_utc": 1745288074.0,
              "replies": [
                {
                  "id": "moet2cw",
                  "author": "nocturnalcat87",
                  "body": "Can you play retro games on the stream deck?",
                  "score": 1,
                  "created_utc": 1745319851.0,
                  "replies": [
                    {
                      "id": "moeurf2",
                      "author": "AusGeno",
                      "body": "Oh hell yeah",
                      "score": 1,
                      "created_utc": 1745320666.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "moccuw6",
              "author": "curryslapper",
              "body": "or the Legion Go!",
              "score": -1,
              "created_utc": 1745278570.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moa6ydi",
          "author": "SpartanKwanHa",
          "body": "good on them, Canada that is. USA is an abusive partner",
          "score": 14,
          "created_utc": 1745254734.0,
          "replies": []
        },
        {
          "id": "mobrn3y",
          "author": "strings___",
          "body": "Orange Julius said you guys don't need anything from Canada. So we are going to trade someplace else. Sorry, not sorry",
          "score": 4,
          "created_utc": 1745271479.0,
          "replies": []
        },
        {
          "id": "mobk8fb",
          "author": "creepilincolnbot",
          "body": "I’m not good at anything",
          "score": 1,
          "created_utc": 1745269186.0,
          "replies": []
        },
        {
          "id": "mocosu1",
          "author": "luffydkenshin",
          "body": "Yep, same. I was saving for a new broom and BAM. Deepest regrets sent my way. Looks like my Goldline AirX will have to last me…",
          "score": 1,
          "created_utc": 1745282700.0,
          "replies": []
        },
        {
          "id": "moczee5",
          "author": "Adrolak",
          "body": "Yep. I bought two spare air cylinders and scuba fill valves while I could.",
          "score": 1,
          "created_utc": 1745286384.0,
          "replies": []
        },
        {
          "id": "mogci8x",
          "author": "abhulet",
          "body": "I'm having shipments of industrial equipment components stopped or held due to the tariffs at my US based manufacturing plant.",
          "score": 1,
          "created_utc": 1745338833.0,
          "replies": []
        },
        {
          "id": "moaqo17",
          "author": "FewHorror1019",
          "body": "Aren’t curling players kinda rich? I don’t see poor people playing it",
          "score": -4,
          "created_utc": 1745260429.0,
          "replies": [
            {
              "id": "mock048",
              "author": "tampering",
              "body": "The most expensive thing about curling is if you like to have beer and chicken wings after the weekly league game.   \n  \nIn Canada, it is a sport of normal people and in a lot of rural Canada its a rite of winter.",
              "score": 3,
              "created_utc": 1745281022.0,
              "replies": []
            },
            {
              "id": "moatyjz",
              "author": "darkwoodframe",
              "body": "At my club, it's $200 for an 8-week season, and they provide all the equipment, if you don't have your own.  You might be thinking of hockey.  Curling is not expensive, if you have a local club.",
              "score": 7,
              "created_utc": 1745261401.0,
              "replies": []
            },
            {
              "id": "moc129v",
              "author": "Utter_Rube",
              "body": "Head over to any small town with a curling rink and you'll see plenty",
              "score": 2,
              "created_utc": 1745274587.0,
              "replies": []
            },
            {
              "id": "modim6o",
              "author": "pterencephalon",
              "body": "My small town curling club in the Midwest is 2x bigger than the one that serves most of Massachusetts. There's probably 5 families in my hometown you could call rich. It's a very middle class sport there. I picked it up because it was a school sport offered at my high school (along with stuff like basketball and football) - paid $40 for the year with next to no equipment costs. More expensive as an adult out on the east coast, but here most people are middle class/upper middle class working professionals.",
              "score": 1,
              "created_utc": 1745293525.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moaw39i",
      "author": "Narradisall",
      "body": "The moment you started getting a whiff of tariffs if you had any big ticket items you wanted or anything specialist, that was the chance.\n\nGoing to be a nightmare to navigate for the foreseeable future.",
      "score": 148,
      "created_utc": 1745262028.0,
      "replies": [
        {
          "id": "mob1h1r",
          "author": "DaoFerret",
          "body": "Just replaced my NAS about a month ago for just that reason.\n\nWas keeping an eye out for a new computer, but that may be sidelined for a while.",
          "score": 27,
          "created_utc": 1745263629.0,
          "replies": []
        },
        {
          "id": "mobkp6z",
          "author": "Microraptors",
          "body": "I had a laptop from 2016 that was going but getting hard to play games. Been meaning to replace it for awhile.\n\nLenovo had a good black Friday sale and trump team had already started the tarrifs threats.\n\nMade me say fuck it and get it, 40 series GPU should last me a good two administrations worth of idiots.\n\nThen, I seen that news of the meat contracts being fucked about with and I eat a lot of meat. So went and got a new standing freezer and bought a half cow.\n\nI treat every threat they make as they are going to do it. So far been a good strategy.",
          "score": 20,
          "created_utc": 1745269325.0,
          "replies": []
        },
        {
          "id": "moclzfj",
          "author": "sarhoshamiral",
          "body": "If you haven't done this, you still have some time but yes if you were planning to upgrade your PC, car, appliances etc do it now.\n\nThere is a good chance not only it will get harder to find those things, they will be more expensive as well and borrowing will get more expensive too.",
          "score": 6,
          "created_utc": 1745281713.0,
          "replies": []
        },
        {
          "id": "moc9hyg",
          "author": "bellj1210",
          "body": "laptop is teh only thing left on my list.  Otherwise i buy most stuff 2nd hand... but i suspect garage sales will be less common and more expensvie to find stuff.",
          "score": 1,
          "created_utc": 1745277444.0,
          "replies": []
        },
        {
          "id": "mof271s",
          "author": "Sea_Oil_8389",
          "body": "This is what I did. I went out and bought a car. I knew mine was going to be too expensive to repair even before tariffs in a few months even if it made it for the next few months. I didn’t want to chance taking my time and paying thousands more when cars are already so expensive.",
          "score": 1,
          "created_utc": 1745323919.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9hhf5",
      "author": "joestaff",
      "body": "That's funny, I was literally looking at the Retroid Pocket 5 for handheld PS2 gameplay and was wondering if folks were even receiving shipments from these handheld makers right now.\n\n\nGuess this answers that.",
      "score": 467,
      "created_utc": 1745246265.0,
      "replies": [
        {
          "id": "mo9jbbq",
          "author": "rehabkickrocks",
          "body": "You can still order a retroid pocket in America but I wouldn’t wait.",
          "score": 122,
          "created_utc": 1745246825.0,
          "replies": []
        },
        {
          "id": "mocm42d",
          "author": "Ba_Dum_Tssssssssss",
          "body": "Damn most American's don't realise how fucking good they had it.\n\nI was looking at the exact same system this morning too. If I purchased it from the UK official companywebsite, it would have cost me £220. If I purchased it from the companies Aliexpress store, £208. If I purchased it from their American website it would have cost ONLY £165.\n\nThey have the biggest economy in the world AND get better prices for all their goods that aren't raw materials/commodities than anywhere else. Apparently that's not good enough.",
          "score": 76,
          "created_utc": 1745281758.0,
          "replies": [
            {
              "id": "mocpclo",
              "author": "joestaff",
              "body": "The US had some crazy trade deal that made shipping to the US super cheap.\n\n\nOrdering something from China to the literal middle of the country cost about $4. Shipping that same exact thing one state over costs $15",
              "score": 34,
              "created_utc": 1745282886.0,
              "replies": [
                {
                  "id": "mocz5el",
                  "author": "AirFryerAreOverrated",
                  "body": "Technically that has nothing to do with the trade agreements and everything to do with the Universal Postal Union agreements. Something about when a developing country sends a package to a developed country, they only have to pay a small fee and the rest of the local cost (as in, shipping cost within the receiving country) is covered by the receiving country.",
                  "score": 23,
                  "created_utc": 1745286297.0,
                  "replies": [
                    {
                      "id": "modv913",
                      "author": "alidan",
                      "body": "I think there was a very specific deal with china, there was a point where it was cheaper to ship wood from canada to china and then import from china when the cut down area and where it was going was about 100 miles away by land. \n\ngood ideas in principal but abused to hell and back in practice.",
                      "score": 5,
                      "created_utc": 1745299352.0,
                      "replies": [
                        {
                          "id": "moe7qzf",
                          "author": "Jaquemart",
                          "body": "So good for the environment!",
                          "score": 4,
                          "created_utc": 1745306756.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mocscvz",
                  "author": "Ba_Dum_Tssssssssss",
                  "body": "Insane thing is that's excluding shipping too! If I ordered it from the UK site and paid shipping it would be £240 in total, if what you're saying is true an American would pay not even £170.",
                  "score": 2,
                  "created_utc": 1745283936.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "modzwik",
              "author": "2roK",
              "body": "Don't forget that the pay a quarter of what other nations pay for gas, yet are the loudest to complain about the prices.",
              "score": 9,
              "created_utc": 1745301950.0,
              "replies": [
                {
                  "id": "moewnnd",
                  "author": "beren12",
                  "body": "To be fair, we probably have to drive the most",
                  "score": 3,
                  "created_utc": 1745321541.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "modl0de",
              "author": "Programmdude",
              "body": "Wouldn't the US version be before tax, so americans still have to pay sales tax on it after they buy it? The UK (and almost the rest of the fucking world) pays sales tax straight away.\n\nI still think the US one would have come out ahead, depending on the state, but not by nearly as much.",
              "score": 3,
              "created_utc": 1745294527.0,
              "replies": [
                {
                  "id": "moex6de",
                  "author": "Ba_Dum_Tssssssssss",
                  "body": "It would still be ahead by a lot even after that, ranges from 2% to 8% so if we just assume 5% as a middle point that's still only £170-£175 in GBP compared to £220 in the UK before shipping.",
                  "score": 2,
                  "created_utc": 1745321777.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "moe91e4",
              "author": "SpeedflyChris",
              "body": "Bear in mind that the UK pricing probably includes VAT, where US pricing won't include any sales tax.",
              "score": 2,
              "created_utc": 1745307603.0,
              "replies": [
                {
                  "id": "moewqrr",
                  "author": "Ba_Dum_Tssssssssss",
                  "body": "True but that'll only be another 5-6% on top, I think the highest rate is 10%.",
                  "score": 1,
                  "created_utc": 1745321581.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mofwcwx",
              "author": "Seamilk90210",
              "body": "To be fair, the US doesn't have a federal sales tax/VAT, and our federal social services are quite sparse as a result. No universal healthcare, paid maternity leave, required paid (or even unpaid) vacation/sick days, required benefits to part-time workers, short-term disability, [any breaks during the workday](https://webapps.dol.gov/elaws/whd/flsa/screen6.asp), job security, etc. So we had access to cheap goods, but everything else came out of our own pocket and our basic labor rights are quite low.\n  \nYou pay sales tax on imports the same as you would on domestic stuff, and I think that's honestly pretty fair. I wouldn't mind that system here if I got the same benefits you did.\n\nNow America will have a 145% tax on imports, AND we don't have social services. The best of both worlds! 8)",
              "score": 2,
              "created_utc": 1745334123.0,
              "replies": []
            },
            {
              "id": "mohzt1k",
              "author": "pbetc",
              "body": "*Watch me crank dat Soulja Boy?*",
              "score": 1,
              "created_utc": 1745356210.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moecihc",
          "author": "MetikMas",
          "body": "Mine got delivered about a week ago",
          "score": 1,
          "created_utc": 1745309862.0,
          "replies": []
        },
        {
          "id": "moe1cd6",
          "author": "ihavequestionzzzzzz",
          "body": "Off topic but I love your little avatar face!",
          "score": 1,
          "created_utc": 1745302798.0,
          "replies": []
        },
        {
          "id": "mo9j474",
          "author": "Delta8ttt8",
          "body": "Have you ever played a psp?",
          "score": -109,
          "created_utc": 1745246765.0,
          "replies": [
            {
              "id": "mo9nu27",
              "author": "Trexador96",
              "body": "PSPs dont run PS2 games, only a handful of them got ported.",
              "score": 60,
              "created_utc": 1745248194.0,
              "replies": [
                {
                  "id": "mo9xlv4",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1745251923.0,
                  "replies": [
                    {
                      "id": "mo9zk8p",
                      "author": "Trexador96",
                      "body": "The vita still isn’t powerful enough for PS2, heck it can barely run N64.",
                      "score": 20,
                      "created_utc": 1745252537.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mobamxg",
              "author": "Hes_gonna_drop_that",
              "body": "What an odd thing to say",
              "score": 8,
              "created_utc": 1745266364.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mo9p08e",
      "author": "grammar_nazi_zombie",
      "body": "Hot damn. I was just looking at these this morning.",
      "score": 91,
      "created_utc": 1745248548.0,
      "replies": [
        {
          "id": "moa27aj",
          "author": "-Badger3-",
          "body": "As of right now at least, they’re still all over Aliexpress. I’m guessing you’ll still be able to get them from Chinese resellers, they’re just not selling them wholesale to American retailers.",
          "score": 18,
          "created_utc": 1745253340.0,
          "replies": [
            {
              "id": "mob3ybu",
              "author": "theturtlemafiamusic",
              "body": "Anbernic handles wholesale through Alibaba. This article is specifically about their official store on their website no longer shipping to the USA. You used to be able to buy an Anbernic console from their website directly instead of using Aliexpress (anyone outside the US still can).\n\nYou can buy from Aliexpress, but if it doesn't arrive before May you'll have to pay the new import fees to get it released from customs.\n\nYou can also currently buy any remaining stock from their US warehouse, but once that runs out they're not shipping more into the country.",
              "score": 13,
              "created_utc": 1745264372.0,
              "replies": [
                {
                  "id": "moh5lj6",
                  "author": "i_suckatjavascript",
                  "body": "I need a link to buy from their US warehouse please 🙏",
                  "score": 1,
                  "created_utc": 1745347255.0,
                  "replies": [
                    {
                      "id": "moihohy",
                      "author": "THCv3",
                      "body": "You can find them all over amazon",
                      "score": 1,
                      "created_utc": 1745361981.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "moe1euj",
              "author": "ihavequestionzzzzzz",
              "body": "They’re probably about to raise the price quite a bit no?",
              "score": 1,
              "created_utc": 1745302838.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moc3alx",
          "author": "SoLuscious",
          "body": "Anyone know if they'll start shipping through resellers instead? Or is this permanent?",
          "score": 3,
          "created_utc": 1745275352.0,
          "replies": []
        },
        {
          "id": "modpc4c",
          "author": "kakka_rot",
          "body": "It's a big hobby of mine, they're a ton of fun to dink around with.\n\n/r/SBCGaming is the main sub",
          "score": 2,
          "created_utc": 1745296464.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mode65s",
      "author": "LeCrushinator",
      "body": "People are about to find out that many thousands of products stop shipping to the U.S.",
      "score": 22,
      "created_utc": 1745291699.0,
      "replies": []
    },
    {
      "id": "mo9hel7",
      "author": "MagicBoyUK",
      "body": "Vote for a 🤡, get a 🤡 show.",
      "score": 989,
      "created_utc": 1745246241.0,
      "replies": [
        {
          "id": "mo9kc9q",
          "author": "Not_Bears",
          "body": "The dude bankrupt casinos... anyone that thought this was going to go well essentially admitted they're fucking stupid and spent too much time online.",
          "score": 390,
          "created_utc": 1745247137.0,
          "replies": [
            {
              "id": "mo9wxww",
              "author": "djshadesuk",
              "body": "Yep. Casinos are pretty much legalised robbery. How do you even f\\*\\*k that up?!?",
              "score": 100,
              "created_utc": 1745251711.0,
              "replies": [
                {
                  "id": "moa53a8",
                  "author": "rocketmonkee",
                  "body": "> How do you even f**k that up?!?\n\nIntentionally.  He used other people's money to build them, drew whatever salary and stripped any assets he could, then shifted any debt he had to them as they collapsed and he moved on.  Trump had no intention of ever *running* casinos.",
                  "score": 111,
                  "created_utc": 1745254194.0,
                  "replies": [
                    {
                      "id": "moaj447",
                      "author": "Rockglen",
                      "body": "Supposedly the casino his wife Ivana ran was successful.  Then he opened another one to compete with it, which cannibalized profits from both.\n\nHim feeling small then making a dumb & self-defeating decision is very on-brand.",
                      "score": 56,
                      "created_utc": 1745258215.0,
                      "replies": []
                    },
                    {
                      "id": "mob5lre",
                      "author": "yet-another-account0",
                      "body": "Don't forget laundering rubles.",
                      "score": 14,
                      "created_utc": 1745264859.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "moab4dr",
                  "author": "NotAComplete",
                  "body": "Money laundering for the Russian mob.",
                  "score": 11,
                  "created_utc": 1745255936.0,
                  "replies": []
                },
                {
                  "id": "mo9y2ok",
                  "author": "tbarlow13",
                  "body": "Not just once or twice either.",
                  "score": 19,
                  "created_utc": 1745252071.0,
                  "replies": []
                },
                {
                  "id": "moa0q8y",
                  "author": "JoeSicko",
                  "body": "Greed",
                  "score": 9,
                  "created_utc": 1745252894.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mocllnj",
              "author": "hexcor",
              "body": "The Apprentice did so much harm to the world. They portrayed him as a business expert.",
              "score": 10,
              "created_utc": 1745281579.0,
              "replies": []
            },
            {
              "id": "moa4rpj",
              "author": "2tofu",
              "body": "Casinos lose money all the time. Just because the actual table games make money doesn’t mean it covers all their expenses.",
              "score": -25,
              "created_utc": 1745254100.0,
              "replies": [
                {
                  "id": "moa6czf",
                  "author": "Black-Shoe",
                  "body": "Just another pump and dump grift.",
                  "score": 16,
                  "created_utc": 1745254565.0,
                  "replies": []
                },
                {
                  "id": "moakdja",
                  "author": "Cute_Commission_8281",
                  "body": "These people have no idea what it takes to run a business.",
                  "score": -12,
                  "created_utc": 1745258582.0,
                  "replies": [
                    {
                      "id": "mob092b",
                      "author": "Tsobe_RK",
                      "body": "Might be, but Trump sure as hell doesn't know",
                      "score": 17,
                      "created_utc": 1745263265.0,
                      "replies": []
                    },
                    {
                      "id": "mobqcbi",
                      "author": "KyleMcMahon",
                      "body": "Neither does trump",
                      "score": 5,
                      "created_utc": 1745271070.0,
                      "replies": []
                    },
                    {
                      "id": "moe5moh",
                      "author": "Madness_Reigns",
                      "body": "It's because they assume Trump was attempting to run a buisness while in reality he was trying to fleece people.",
                      "score": 2,
                      "created_utc": 1745305418.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mobh8vl",
          "author": "ReticlyPoetic",
          "body": "This is planned. Billionaires silently doubling their money on the side when this is all over.",
          "score": 17,
          "created_utc": 1745268310.0,
          "replies": []
        },
        {
          "id": "moap2vs",
          "author": "RefractedCell",
          "body": "Turning America into a third world country to own the libs.",
          "score": 18,
          "created_utc": 1745259960.0,
          "replies": []
        },
        {
          "id": "mo9lut6",
          "author": "puertomateo",
          "body": "Vote for an asshole, get a shitshow.",
          "score": 48,
          "created_utc": 1745247591.0,
          "replies": []
        },
        {
          "id": "modnlzx",
          "author": "markb144",
          "body": "Sucks for the 30% of us who voted against the dipshit, but I suppose we deserve it",
          "score": 3,
          "created_utc": 1745295690.0,
          "replies": []
        },
        {
          "id": "mohhqie",
          "author": "That_Bank_9914",
          "body": "Except, not everyone voted for him",
          "score": -2,
          "created_utc": 1745350876.0,
          "replies": [
            {
              "id": "mohiutq",
              "author": "MagicBoyUK",
              "body": "Everyone having to vote for a candidate is called a dictatorship.\n\nThe 🤡 got more votes under the electoral college system, therefore won. Welcome to democracy.",
              "score": 4,
              "created_utc": 1745351211.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9lx7i",
          "author": "None",
          "body": "[removed]",
          "score": -257,
          "created_utc": 1745247611.0,
          "replies": [
            {
              "id": "mo9mnjk",
              "author": "johnny5canuck",
              "body": "Florida:  Lowers working age from 16 to 14.",
              "score": 59,
              "created_utc": 1745247835.0,
              "replies": []
            },
            {
              "id": "mo9mxnh",
              "author": "GladObject2962",
              "body": "I'm not even American and I know raising minimum wage was attainable prior to any tariffs that have been put in place. Republicans just would rather put the cost of increased wages on the population rather than the corporations that can afford it",
              "score": 74,
              "created_utc": 1745247921.0,
              "replies": []
            },
            {
              "id": "mo9mfx8",
              "author": "MagicBoyUK",
              "body": "You do realise your MAGA hat was made in China, right?",
              "score": 124,
              "created_utc": 1745247769.0,
              "replies": [
                {
                  "id": "mo9spju",
                  "author": "kurotech",
                  "body": "And that the reason we have all the cheap shit we do is because we chose to export production to lower costs to begin with this isn't China coming in and taking anything it's corporations sending your jobs overseas and taking advantage of any cost cutting they can no more no less",
                  "score": 32,
                  "created_utc": 1745249653.0,
                  "replies": []
                },
                {
                  "id": "mobvzg2",
                  "author": "opeth10657",
                  "body": "They also don't realize that a lot of 'american made' stuff still uses chinese imports, and just gets assembled here.\n\nWe just don't have the manufacturing setup here to make any of this stuff.",
                  "score": 4,
                  "created_utc": 1745272876.0,
                  "replies": [
                    {
                      "id": "moc9212",
                      "author": "Kichigai",
                      "body": "So much. Mechanics will tell you that things like Genuine BMW Parts and Chinese-made parts come out of the same factory, the difference is the quality control testing done for each brand.",
                      "score": 1,
                      "created_utc": 1745277297.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mo9q7a9",
                  "author": "PotassiumBob",
                  "body": "Got'em",
                  "score": 7,
                  "created_utc": 1745248909.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mo9q9nf",
              "author": "Silverlisk",
              "body": "Yeah, this just shows how little you understand economics at all. \n\nYou can raise wages because you're primarily a service economy, that doesn't tie into the cheap products of video game consoles from a manufacturing economy. \n\nGlobalisation is economies at scale. Even within a country that has zero in and out trade with minimum wage rules, individual areas will trade for what they need with others and some areas can have higher wages than others due to those areas producing goods or services that have increased training costs or just being of higher value to the market currently. \n\nThe US was on the cutting edge of technological progress, trusted with military production and distribution, had the whole world hedging their bets in favour of it by LITERALLY banking on the US dollar and hitching their economy to the wellbeing of yours, all the way from the richest economies, to the poorest, either via trade and the owning of debt or by the need of humanitarian aid. \n\nThe US could call itself the centre of the world, because it was, we relied on the US for sure, but that also meant we were willing to do just about anything to keep you guys going, it's why the US has been such a rich country this whole time with the most millionaires and billionaires worldwide. \n\nAll Trump's doing is ending that. You won't have the freedom to raise wages because you won't have the wealth. \n\nThe reason wages weren't being raised before was due to political decisions being made internally by your country to avoid taxing their wealth base in order to fund your country's own costs. Your country was still the richest in the world. You just distributed it unevenly. \n\nWhat Trump is doing is mixing up internal and external politics and acting like the rest of the world is to blame for your misfortune and you MAGA lot are all eating it up and all it's gonna do, is devalue your currency, lower your global purchasing power and your value to the global economy, it'll raise inflation and cause runaway debt costs and make everyone else try to hedge their bets elsewhere, taking away the support the US economy was built on. \n\nPeople are scrambling to try and re-establish the old ways right now, they will keep trying whilst they find other ways because they hope when Trump leaves sanity can be restored, but the longer this goes on, the worse it's gonna get for the US. It'll suck for everyone else sure, but we can always establish a new order around someone else and the US will have to either bend themselves around that new order or go down swinging out at everyone. I guess it'll be the latter, but that'll either end badly for the US or just for everyone in general. \n\nStill isn't gonna be good for the US in any scenario.",
              "score": 65,
              "created_utc": 1745248928.0,
              "replies": [
                {
                  "id": "mob5kol",
                  "author": "OprahsSaggyTits",
                  "body": "That guy reads at like a kindergarten level, ain't no way he's reading all that",
                  "score": 18,
                  "created_utc": 1745264850.0,
                  "replies": []
                },
                {
                  "id": "mob738d",
                  "author": "ironsnoot",
                  "body": "Honestly my only hope as an American is that Trump is losing the billionaires that actually rule our country billions on billions of dollars. Maybe they have some larger plan in the works. But if they don’t, there’s a good chance that they’ll give Donald the boot because he’s not good for business. Fuck knows the democrats aren’t going to pull their own weight on this one.",
                  "score": 7,
                  "created_utc": 1745265298.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mo9mn2r",
              "author": "Skitz-Scarekrow",
              "body": "That's your takeaway? The bafoon is killing trade to the US, with no domestic alternatives. Red states are rolling back child labor protection. So don't worry, your grandchildren will be building cheap tech for slave wages; **if** those manufacturing facilities are *ever built.*",
              "score": 45,
              "created_utc": 1745247831.0,
              "replies": [
                {
                  "id": "mo9v3ti",
                  "author": "None",
                  "body": "[removed]",
                  "score": -77,
                  "created_utc": 1745251093.0,
                  "replies": [
                    {
                      "id": "mo9x8ey",
                      "author": "Skitz-Scarekrow",
                      "body": "The alternative is to reign in billionaires and corporations who sent the jobs away in the first place. \n\nThe alternative is to raise taxes on the afformentioned parasite class so the standard of living can be increased and offset the cost of domestic manufacturing in regards to wages.\n\nThe alternative is to vote out the political puppets from all facets of government that have allowed and propagated the crippling of American industry at the expense of the 99%. The conservatives gutting the nation and the neolibs responding with shrugs, all to the benefit of their owners.\n\nThe alternative, first and foremost, should have never allowed a conman rapist (convicted, not implied) into the office of president.\n\nIf you think the complaints boil down to the availability dime-a-dozen handheld console, you're fooling yourself.",
                      "score": 33,
                      "created_utc": 1745251803.0,
                      "replies": [
                        {
                          "id": "mo9zcsj",
                          "author": "None",
                          "body": "[removed]",
                          "score": -35,
                          "created_utc": 1745252473.0,
                          "replies": [
                            {
                              "id": "mo9zw4b",
                              "author": "Skitz-Scarekrow",
                              "body": "Yes. Democrats have worked with, or at least permitted, Republicans to undo any progress made in the 20th century.",
                              "score": 19,
                              "created_utc": 1745252638.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "moantin",
                      "author": "Melichorak",
                      "body": "Yeah, like the one Trump made and then marked it as a bad deal and broke it?",
                      "score": 7,
                      "created_utc": 1745259588.0,
                      "replies": []
                    },
                    {
                      "id": "mo9y9aq",
                      "author": "ChangeVivid2964",
                      "body": "> Many of our socioeconomic and political problems can be traced back to poorly negotiated trade deals\n\nBut Trump negotiated those deals.  What makes you think he'll get a better deal this time?  He has a long history of getting pretty bad deals.",
                      "score": 14,
                      "created_utc": 1745252129.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mo9nkc9",
              "author": "Wiggie49",
              "body": "![gif](giphy|bjWMBnLxiux1Ea9JMS)",
              "score": 27,
              "created_utc": 1745248112.0,
              "replies": []
            },
            {
              "id": "mo9qf18",
              "author": "ClassytheDog",
              "body": "Every MAGA’s response to Trump’s stupidity is “Dem’s always be…..” like they know they won’t be able to convince anyone he is smart. I mean, the dude thinks windmills give you cancer, tariffed a bunch of penguins, etc.",
              "score": 26,
              "created_utc": 1745248973.0,
              "replies": []
            },
            {
              "id": "moa7fpz",
              "author": "quickasawick",
              "body": "Republicans: America has too much debt!\n\nAlso Republicams: We need to lower taxes for the ultra-rich!\n\nMAGA Republicans: OK, so we collect tariffs on the everyday purchases made by everyday Americans to take more of their money while telling them we are \"cutting taxes\" and they're all too stupid to realize they've been gamed. Heck, they'll keep electing us into office if we just keep saying \"we're fiscally conservative.\"\n\nRepublican voters: Right on! Oh, and child labor in China something, something. Cause foreign child welfare is of obviously a very important issue to us. (Kindly ignore our cheers for the \"America First\" shutdown of USAID.)",
              "score": 14,
              "created_utc": 1745254872.0,
              "replies": []
            },
            {
              "id": "mo9mydn",
              "author": "richrgamr",
              "body": "Terrible take\n\nRepublicans effectively cut us off from our biggest manufacturing lifeline (that corporations helped set up because they didn’t want to pay Americans minimum wage) without taking into consideration that we have absolutely no infrastructure to build anything, let alone a cheap video game console\n\nMaybe raising minimum wage is one step of what should have been a multi step program to get manufacturing back in the US?",
              "score": 27,
              "created_utc": 1745247927.0,
              "replies": []
            },
            {
              "id": "moa2dha",
              "author": "None",
              "body": "Good job regurgitating propaganda. Anbernic isn’t using child labor. You should try learning before you speak.",
              "score": 6,
              "created_utc": 1745253390.0,
              "replies": []
            },
            {
              "id": "mo9rf28",
              "author": "williwolf8",
              "body": "You are aware Trump would likely lower the working age, right?",
              "score": 11,
              "created_utc": 1745249272.0,
              "replies": [
                {
                  "id": "mo9vdvl",
                  "author": "None",
                  "body": "[removed]",
                  "score": -16,
                  "created_utc": 1745251195.0,
                  "replies": [
                    {
                      "id": "mo9ye2b",
                      "author": "ChangeVivid2964",
                      "body": "Nah, Americans are the type of people who voted for a guy whinging about \"people eating the dogs and cats\".  Democrats need to double down and go dumber.  Way dumber.",
                      "score": 12,
                      "created_utc": 1745252171.0,
                      "replies": [
                        {
                          "id": "mob8mwe",
                          "author": "ironsnoot",
                          "body": "Or at least grow a spine. Dems really refuse to dig their heels in and fight for literally anything no matter how vital it is for their voters. Absolutely shameful.",
                          "score": 4,
                          "created_utc": 1745265759.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mob8ph6",
                      "author": "paintbucketholder",
                      "body": "Hold on. Your thought process is\n\n>he has correctly identified a pain point for Americans\n\n\"shit is too expensive!!\"\n\n>and proposing alternative solutions\n\n\"let's introduce child labor to make shit less expensive!!!\"\n\nYour idea to compete with third world countries on insanely low prices is to introduce child labor in the U.S.?",
                      "score": 6,
                      "created_utc": 1745265781.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mo9mq93",
              "author": "sassiest_sasquatch",
              "body": "Whatever it takes for you to cope",
              "score": 13,
              "created_utc": 1745247857.0,
              "replies": []
            },
            {
              "id": "moa5f9o",
              "author": "flatroundworm",
              "body": "I highly doubt any children worked on your retro handheld. Shenzhen is an extremely professional manufacturing economy these days - Deng isn’t in charge anymore.",
              "score": 5,
              "created_utc": 1745254291.0,
              "replies": []
            },
            {
              "id": "moa5129",
              "author": "ProfSquirtle",
              "body": "[Republicans:](https://i.imgur.com/sbAG47S.jpeg)",
              "score": 6,
              "created_utc": 1745254176.0,
              "replies": []
            },
            {
              "id": "mobhs6e",
              "author": "notthatguypal6900",
              "body": "Republican: We need this country run like a business.\nAlso Republicans: Let elect a felon who has bankrupt a casino and a variety of other business.",
              "score": 2,
              "created_utc": 1745268467.0,
              "replies": [
                {
                  "id": "mobxqzs",
                  "author": "MagicBoyUK",
                  "body": "He bankrupted three casinos. He'd just prefer to count them as one. 🤣",
                  "score": 2,
                  "created_utc": 1745273469.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "moa58lz",
              "author": "TylerDTA",
              "body": "Child labor in China is bullshit propaganda.  China's economy is dicking America's right now. Your kids kids will be the ones doing child labor for China. America is a dumpster.",
              "score": 5,
              "created_utc": 1745254238.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moa4l53",
          "author": "Zyrooth",
          "body": "Circus is the word you were looking for",
          "score": -25,
          "created_utc": 1745254046.0,
          "replies": [
            {
              "id": "moa5d8b",
              "author": "MagicBoyUK",
              "body": "You've never seen a Clown show at the Circus? \n\nAt least engage your brain before pressing the keys. 😆",
              "score": -14,
              "created_utc": 1745254275.0,
              "replies": [
                {
                  "id": "moac9jq",
                  "author": "feartheoldblood90",
                  "body": "Both of you need to calm down, this is a dumb thing to bicker over lol",
                  "score": 9,
                  "created_utc": 1745256262.0,
                  "replies": [
                    {
                      "id": "mocd22u",
                      "author": "curryslapper",
                      "body": "described reddit haha",
                      "score": 1,
                      "created_utc": 1745278638.0,
                      "replies": []
                    },
                    {
                      "id": "moae5v0",
                      "author": "MagicBoyUK",
                      "body": "I'm so calm I could go for a nap about now.\n\nPointing out a logical black hole in someone's smart arse comment isn't bickering. 😘",
                      "score": -5,
                      "created_utc": 1745256805.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "moc8pkg",
                  "author": "msully89",
                  "body": "There was a clown the last time I went to the circus",
                  "score": -1,
                  "created_utc": 1745277181.0,
                  "replies": [
                    {
                      "id": "moc9ir9",
                      "author": "MagicBoyUK",
                      "body": "Was the clown part of a clown show? 🤦‍♂️",
                      "score": 1,
                      "created_utc": 1745277451.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mod6na1",
      "author": "deschain_19195",
      "body": "Pretty soon Mexican cartels are going to start smuggling regular goods instead of drugs into the US",
      "score": 18,
      "created_utc": 1745288867.0,
      "replies": [
        {
          "id": "moi9wcl",
          "author": "kafelta",
          "body": "They're already doing that with eggs",
          "score": 5,
          "created_utc": 1745359379.0,
          "replies": []
        },
        {
          "id": "mop8iau",
          "author": "TerracottaCow",
          "body": "Hey! :-)",
          "score": 1,
          "created_utc": 1745452238.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9j3xp",
      "author": "internetlad",
      "body": "I figured that SBCs were gonna be early in the chopping block with the tarrifs. \n\n\nStill considering most of them are gutted phone parts stuck in a new case we won't be completely starving for a while.",
      "score": 136,
      "created_utc": 1745246763.0,
      "replies": [
        {
          "id": "mo9pp48",
          "author": "DeathByPetrichor",
          "body": "Apparently both SBCs and the Indie Board Game market are being hit extremely hard. It’s pretty sad to see tbh.",
          "score": 47,
          "created_utc": 1745248757.0,
          "replies": [
            {
              "id": "mob1ao9",
              "author": "DrScience-PhD",
              "body": "telescope prices went up like 60% during his first term. I'm scared what they'll look like in a year.",
              "score": 4,
              "created_utc": 1745263576.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moajpoc",
          "author": "punklinux",
          "body": "One of my clients is, or was, expanding the US market for the new RISC-V technology, and it has come to a grinding halt because of this.  Some of their conservative markets tell them, \"then build factories in the US to make them, it's not rocket surgery!\"  Really? With what parts will we build these factories? With what machinery? With what materials? Where do you think all these come from for \"made in the USA,\" dumbass?",
          "score": 30,
          "created_utc": 1745258388.0,
          "replies": [
            {
              "id": "mob33fg",
              "author": "Morlik",
              "body": "reply pause observation file mountainous compare strong resolute aback chunky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 19,
              "created_utc": 1745264114.0,
              "replies": [
                {
                  "id": "moc9xrj",
                  "author": "bellj1210",
                  "body": "but but reasons.... there is never a response that makes sense to that.  Even if you were to build a US factory, it would focus on minimum wage in states with poor labor laws- so they will be jobs most americans have no interest in.  they would be a step below working as an amazon delivery driver.",
                  "score": 9,
                  "created_utc": 1745277588.0,
                  "replies": []
                },
                {
                  "id": "moblfr7",
                  "author": "UboaNoticedYou",
                  "body": "When he announced his tarrif plan I was floored but thought to myself \"Well... if he aggresively funds government contracts to build new manufacturing infrastructure, this might actually work if he can balance aggression with diplomacy,\" and that's a scary fucking thought to have!\n\nBut nope! As soon as he said companies \"have enough money to build it themselves\" I knew this plan was doomed. Makes you think if he ever wanted to increase U.S. manufacturing capacity in the first place! :P",
                  "score": 11,
                  "created_utc": 1745269550.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mobxv1n",
              "author": "mrjackspade",
              "body": "With what employees? Americans are no longer educated enough to build their own equipment due to the rising costs of secondary education.",
              "score": 5,
              "created_utc": 1745273506.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9pks3",
          "author": "Framed-Photo",
          "body": "That is a huge misrepresentation of what most of these devices are lol.",
          "score": 65,
          "created_utc": 1745248721.0,
          "replies": [
            {
              "id": "mo9r3y4",
              "author": "internetlad",
              "body": "Never thought it was weird that most of the chips used on these machines and the screens are curiously similar to ~2yo phones?",
              "score": -10,
              "created_utc": 1745249180.0,
              "replies": [
                {
                  "id": "mo9ra93",
                  "author": "Irapotato",
                  "body": "Me when inexpensive, well documented components are used in more than one specific device:",
                  "score": 64,
                  "created_utc": 1745249232.0,
                  "replies": []
                },
                {
                  "id": "mobxla0",
                  "author": "mrjackspade",
                  "body": "So was the original Switch SOC, that doesn't mean Nintendo was building them out of broken down phones.",
                  "score": 9,
                  "created_utc": 1745273415.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo9nbxk",
          "author": "GeorgeRRZimmerman",
          "body": "What phones use rockchip processors?",
          "score": 24,
          "created_utc": 1745248041.0,
          "replies": []
        },
        {
          "id": "mob9en0",
          "author": "silentcrs",
          "body": "\\>Still considering most of them are gutted phone parts stuck in a new case we won't be completely starving for a while.\n\nTell me you don't understand a market by saying you understand the market.",
          "score": 4,
          "created_utc": 1745265992.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9go5v",
      "author": "chrisdh79",
      "body": "From the article: As I reported just last week, cheap-yet-awesome retro handhelds are being marched to the guillotine in the name of Trump tariffs. One of the first companies to have its head on the block is also one of the most prolific. Handheld maker Anbernic told customers Sunday that it would stop all direct shipments to U.S. customers, at least until President Donny finally offers any clarity on how much people will pay in import duties for products from China.\n\nAnbernic is known for its enormous library of handheld video game emulation hardware. These handhelds are able to use console emulators—essentially full video game consoles translated into software—to play new homebrew titles as well as digital copies of older games, known as ROMS. In a page describing the new shipping policy, Anbernic said “due to changes in U.S. tariff policies, we will be suspending all shipping from China to the United States starting today. We strongly recommend prioritizing products shipped from our U.S. warehouse.”\n\nUntil today Anbernic let customers ship products either directly from China or from it’s U.S. warehouse, where supplies were more limited but products would ship out faster. It’s unclear how long the current supply of consoles in the U.S. will last. I reached out to Anbernic for comment, but did not immediately hear back. The handheld maker said it would update customers when it received “confirmed updates regarding import duties.”\n\nFortunately there’s more than one way to get a console from Anbernic. You might still be able to find its products on Amazon, or AliExpress. The dropshipping site typically sells these handhelds for much cheaper than you could get elsewhere, too. The classic Anbernic RG35XX Plus Game Boy-like device goes for $48 on AliExpress, $50 on the Anbernic site, and a whopping $80 on Amazon. As American supplies dwindle we can assume those prices will increase.",
      "score": 68,
      "created_utc": 1745246015.0,
      "replies": [
        {
          "id": "moa7mb1",
          "author": "DirectlyTalkingToYou",
          "body": "Why not just sell them but on checkout theres a line that says the Tariff amount. Have it right above  the tax line.",
          "score": 9,
          "created_utc": 1745254926.0,
          "replies": [
            {
              "id": "moa94y6",
              "author": "ortrademe",
              "body": "> at least until President Donny finally offers any clarity on how much people will pay in import duties for products from China.\n\nThe tariffs are changing daily. Tariffs are paid when the shipment arrives on US shores. A business can't know what the rate will be on any given day, let alone in weeks when it gets there.",
              "score": 40,
              "created_utc": 1745255363.0,
              "replies": [
                {
                  "id": "moazeei",
                  "author": "KalashnikittyApprove",
                  "body": "In the end that would be your problem as a consumer, if you're buying directly from them, since you'd be the one presented with the bill. \n\nWhat I don't know is whether you could, at this point, refuse to accept the package and let it go back, creating costs for the company.",
                  "score": 1,
                  "created_utc": 1745263015.0,
                  "replies": [
                    {
                      "id": "mobmwgt",
                      "author": "Accendor",
                      "body": "The damage to your brand is much worse when this happens to your customers and you tell them \"yeah, thats your problem\" . Not even stating the amount of debate this will start and how this will negatively affect your support workers as well. It's much easier and safer to just not sell there.",
                      "score": 3,
                      "created_utc": 1745270000.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "moai2kf",
              "author": "Dirty_Harold182",
              "body": "You'd know if you actually read the article.",
              "score": 9,
              "created_utc": 1745257918.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moe4n4v",
      "author": "blightsteel101",
      "body": "We can expect a lot more of this in the next few months. Guy in office is dumber than a sack of rocks.",
      "score": 7,
      "created_utc": 1745304812.0,
      "replies": []
    },
    {
      "id": "moazdbd",
      "author": "New_Combination_7012",
      "body": "Remember when it was only kinder surprise eggs you couldn’t buy in the US? It’s turning into peasantsville",
      "score": 10,
      "created_utc": 1745263006.0,
      "replies": []
    },
    {
      "id": "mocuel3",
      "author": "Wang_Fire2099",
      "body": "Got a Miyoo for $80 and have access to thousands of classic games",
      "score": 6,
      "created_utc": 1745284645.0,
      "replies": []
    },
    {
      "id": "moe2wg2",
      "author": "silentrocco",
      "body": "You get what you voted for.",
      "score": 5,
      "created_utc": 1745303741.0,
      "replies": []
    },
    {
      "id": "mod7kwa",
      "author": "Seamilk90210",
      "body": "I just don't get what the end game of these tariffs are. Does Trump really think American companies have the capability to make consumer electronics with zero notice?\n\nBe prepared for a $300 TI-84 PLUS calculator, because even the monopoly Texas Instruments can't be [bothered to manufacture early 2000's tech here](http://www.datamath.org/Graphing/TI-84PLUS_SE.htm).",
      "score": 8,
      "created_utc": 1745289201.0,
      "replies": [
        {
          "id": "mofm8po",
          "author": "Candle1ight",
          "body": ">Does Trump really think\n\nClearly not",
          "score": 7,
          "created_utc": 1745331059.0,
          "replies": [
            {
              "id": "mog15l4",
              "author": "Seamilk90210",
              "body": "Ugh. Why did Congress give the President this power? Lol.",
              "score": 1,
              "created_utc": 1745335556.0,
              "replies": []
            }
          ]
        },
        {
          "id": "modr9m4",
          "author": "None",
          "body": "[removed]",
          "score": 5,
          "created_utc": 1745297358.0,
          "replies": [
            {
              "id": "mog0mui",
              "author": "Seamilk90210",
              "body": "Right now a new TI-84 PLUS is $145 at Staples, and roughly $115 on Amazon. So not quite $300, but pretty outrageous for something that felt old and expensive in 2004. \n\n\n>But they'll do what they can get away with.\n\n100%. I think that's true with just about every company, though.",
              "score": 1,
              "created_utc": 1745335406.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mo9ij2z",
      "author": "None",
      "body": "Wow Anbernic is a big deal in the handheld community, this is a bummer. They make some great devices.",
      "score": 15,
      "created_utc": 1745246588.0,
      "replies": []
    },
    {
      "id": "mo9uc2j",
      "author": "J-W-L",
      "body": "\n\nSo I was watching a depression food recipe YouTube and they were talking about Hoover stew. This is my new hobby.. Watching depression era cooking on YouTube.\nAnyway one of the featured recipes was called Hoover stew. It was called this because \n Hoover was widely blamed for the 1930s economic depression. Further research lead me to something called the smoot Hawley tariff act. I didn't know anything about this so it was interesting to learn about and it is easy to see how it is applicable here. \nExcept in Hoover's case I don't think he was trying to purposefully bankrupt the American people to hand over the country to the tech bros.. in trump's case he seems to be doing it to \"show\" he's protecting American interests but I'm reality it was already good and now it's garbage. Anyway.. Here is a brief summary of the act.\n\nThe Smoot-Hawley Tariff Act, officially the Tariff Act of 1930, was a U.S. law enacted on June 17, 1930, that significantly raised import duties on over 20,000 foreign goods. It was championed by Senator Reed Smoot and Representative Willis C. Hawley, with the primary goal of protecting American farmers and industries from foreign competition during the onset of the Great Depression.\nHere are the key facts about the Smoot-Hawley Tariff Act:\n * Protectionist Measure: Its main aim was to shield domestic producers by making imported goods more expensive.\n * High Tariff Rates: The act increased tariffs to some of the highest levels in U.S. history, averaging around a 20% increase on dutiable imports. Some tariffs were raised as high as 50%.\n * Wide Scope: It applied to a vast range of goods, both agricultural and manufactured.\n * Triggered Retaliation: A major consequence was that many foreign countries retaliated by imposing their own tariffs on American exports.\n * Contributed to Trade Decline: This trade war led to a dramatic decline in international trade. U.S. exports and imports both plummeted by significant amounts. Global trade decreased by an estimated 65% between 1929 and 1934.\n * Worsened the Great Depression: While the Act didn't cause the Great Depression, most economists agree that it significantly worsened its severity and prolonged the economic downturn both in the U.S. and globally. It reduced demand for goods, led to business closures, and exacerbated unemployment.\n * Nearly Unanimous Opposition from Economists: Over 1,000 economists signed a petition urging President Hoover to veto the bill, warning of its negative economic consequences.\n * Political Motivations: Despite the economic warnings, political pressure from various domestic industries seeking protection led to its passage.\n * A Symbol of Protectionism: The Smoot-Hawley Tariff Act has become a lasting symbol of the dangers of protectionist trade policies and is often cited as an example of how tariffs can backfire.\n * Shift Towards Free Trade: In the years following the Great Depression, the U.S. shifted towards policies of trade liberalization, beginning with the Reciprocal Trade Agreements Act of 1934.\nIn essence, the Smoot-Hawley Tariff Act of 1930 was a protectionist measure intended to help American industries but ultimately contributed to a global trade war and deepened the economic crisis of the Great Depression.",
      "score": 26,
      "created_utc": 1745250709.0,
      "replies": []
    },
    {
      "id": "mo9pv1s",
      "author": "Piett_1313",
      "body": "My Retroid Pocket Flip 2 just shipped this morning… glad it got out while it could.",
      "score": 11,
      "created_utc": 1745248807.0,
      "replies": []
    },
    {
      "id": "mod50d8",
      "author": "AusGeno",
      "body": "Boardgames and retro handheld companies are copping a battering because of this. People actually losing their jobs and livelihoods thanks to the mad king of america.",
      "score": 3,
      "created_utc": 1745288300.0,
      "replies": [
        {
          "id": "moitntn",
          "author": "Hawkmonbestboi",
          "body": "Yeup. I'm probably going to lose my business over all this.",
          "score": 2,
          "created_utc": 1745366000.0,
          "replies": [
            {
              "id": "moixys1",
              "author": "AusGeno",
              "body": "That really sucks, sorry to hear that mate.",
              "score": 2,
              "created_utc": 1745367467.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moe191f",
      "author": "ihavequestionzzzzzz",
      "body": "I went to the hospital today and had to get an IV for an MRI. All of the plastic or otherwise little trinkets they use to do all of that are bound to rise in price 😞",
      "score": 3,
      "created_utc": 1745302743.0,
      "replies": [
        {
          "id": "mpsrr2b",
          "author": "Chronotaru",
          "body": "This is a very important comment. A retro handheld doesn't really matter, just a toy at the end of the day. Actual life saving medical equipment is going to be affected too.",
          "score": 1,
          "created_utc": 1745994759.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moeurxu",
      "author": "mishdabish",
      "body": "I was watching a political commentator yesterday and he said, \"look around your homes and how much stuff is from China? Well we don't have anything from America here\"",
      "score": 3,
      "created_utc": 1745320673.0,
      "replies": [
        {
          "id": "moezez5",
          "author": "ToonaSandWatch",
          "body": "Hell, a fair amount of your produce didn’t either.",
          "score": 3,
          "created_utc": 1745322753.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moc6rsq",
      "author": "Kellic",
      "body": "If you didn't vote or voted for him:  This is your fault.  \\*mic drop\\*  Walks away.",
      "score": 16,
      "created_utc": 1745276530.0,
      "replies": [
        {
          "id": "moc9vv9",
          "author": "None",
          "body": "[deleted]",
          "score": -3,
          "created_utc": 1745277571.0,
          "replies": [
            {
              "id": "moctgfz",
              "author": "kstick10",
              "body": "Those people should be humiliated. Not sure what your point is.",
              "score": 2,
              "created_utc": 1745284317.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moat2o8",
      "author": "JFCMFRR",
      "body": "Bunch of kids on my kid's ice skating team had their orders for new skate boots from Canada cancelled.",
      "score": 4,
      "created_utc": 1745261138.0,
      "replies": []
    },
    {
      "id": "moazqgk",
      "author": "Few_Newspaper1778",
      "body": "Canada is stopping lots of business with the states too. They’re unreliable and can’t be trusted. Trump showed what he could do with tariffs.\n\nFool us once, we won’t be tricked again",
      "score": 8,
      "created_utc": 1745263115.0,
      "replies": [
        {
          "id": "mob5w72",
          "author": "ironsnoot",
          "body": "Still hoping that they’ll boot him out so we can get to repairing our image because it’s probably going to be a while before anyone trusts the US again.",
          "score": 5,
          "created_utc": 1745264946.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mocib1j",
      "author": "EitherChannel4874",
      "body": "Every country in the world should stop shipping anything to the USA. It may teach their future arsehole politicians not to be so damn idiotic.",
      "score": 8,
      "created_utc": 1745280432.0,
      "replies": []
    },
    {
      "id": "moczm7r",
      "author": "doom_slayer69",
      "body": "I bought one a week ago…. I hope it made it out. 🫡",
      "score": 2,
      "created_utc": 1745286460.0,
      "replies": []
    },
    {
      "id": "mod9psm",
      "author": "firsmode",
      "body": "Anbernic is known for its enormous library of handheld video game emulation hardware. These handhelds are able to use console emulators—essentially full video game consoles translated into software—to play new homebrew titles as well as digital copies of older games, known as ROMS. In a page describing the new shipping policy, Anbernic said “due to changes in U.S. tariff policies, we will be suspending all shipping from China to the United States starting today. We strongly recommend prioritizing products shipped from our U.S. warehouse.”",
      "score": 2,
      "created_utc": 1745289985.0,
      "replies": []
    },
    {
      "id": "moecwp7",
      "author": "i-dont-snore",
      "body": "Good :) great to see people are dumping the US, i cannot wait for the pre US supremacy world. Definitely going to be a better place",
      "score": 2,
      "created_utc": 1745310124.0,
      "replies": []
    },
    {
      "id": "moa0wui",
      "author": "Lone_Wookiee",
      "body": "Holy shit I'm so glad I got my RG35XXSP in February. That thing rocks.",
      "score": 6,
      "created_utc": 1745252950.0,
      "replies": []
    },
    {
      "id": "moa5oms",
      "author": "Wonderful-Day-3301",
      "body": "Welcome to the third world Americans. It’s gonna be a miserable experience buying local alternatives that are subpar and expensive",
      "score": 12,
      "created_utc": 1745254368.0,
      "replies": [
        {
          "id": "moafqw4",
          "author": "None",
          "body": "[deleted]",
          "score": 19,
          "created_utc": 1745257260.0,
          "replies": [
            {
              "id": "moc6iuh",
              "author": "MyHusbandIsGayImNot",
              "body": "It doesn't help that people mean \"developing nations\" when they say \"third world\" and it makes the whole thing confusing.\n\n[Third world simply means a country that wasn't on either side of the cold war. ](https://en.wikipedia.org/wiki/Third_World)\n\nAlthough with Trump wanting to leave NATO you could actually argue that makes the US part of the third world.",
              "score": 3,
              "created_utc": 1745276448.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mob44av",
      "author": "ironsnoot",
      "body": "I occasionally buy spare parts from overseas and some shops straight up have a little message that says “this store doesn’t ship to this address” for me. That definitely wasn’t there before.🥲",
      "score": 3,
      "created_utc": 1745264421.0,
      "replies": []
    },
    {
      "id": "mo9snzp",
      "author": "Mehhish",
      "body": "Don't worry, if they stop shipments for only a month, I'm sure they'll try to sell us the 30 different models that we missed!",
      "score": 4,
      "created_utc": 1745249641.0,
      "replies": []
    },
    {
      "id": "moborbq",
      "author": "MaryJaneAndMaple2",
      "body": "Everyone everywhere should be stopping shipments to the USA",
      "score": 7,
      "created_utc": 1745270574.0,
      "replies": []
    },
    {
      "id": "mo9mzy8",
      "author": "PornstarVirgin",
      "body": "Mod retro! A really good game boy color emulator",
      "score": 3,
      "created_utc": 1745247940.0,
      "replies": [
        {
          "id": "moasmf0",
          "author": "HotCoffee017",
          "body": "Fuck that and fuck Palmer Luckey, that's just supporting a company that supports the clown who caused this mess, just put together an FPGBC.",
          "score": 9,
          "created_utc": 1745261007.0,
          "replies": [
            {
              "id": "mobyjpc",
              "author": "mrjackspade",
              "body": "> Fundraising for Donald Trump\n> In September 2016, Luckey donated $10,000 to an organization called \"Nimble America\" with the stated purpose of \"educating the community on our ideals of America First, Smart Trade, Legal Immigration, and Ethical Behavior.\" Luckey offered to match further contributions from r/The_Donald users for 48 hours after the announcement. Luckey later issued an apology, stating on his Facebook page, \"I am deeply sorry that my actions are negatively impacting the perception of Oculus and its partners.\" He stated that he acted independently, not as a representative of Oculus VR. The Wall Street Journal later reported that Luckey had been pressured into making this statement as a condition of employment.\n> \n> In October 2020, Luckey hosted a fundraiser for Donald Trump at his home in Lido Isle, Newport Beach, with the president in attendance. The fundraiser had tickets ranging from $2,800 per person to $150,000 per couple, and there were gatherings both for and against President Trump in Newport Beach outside during the event.\n> \n> On June 8, 2024, Luckey co-hosted another fundraiser for Trump at the home of health insurance company co-founder John Word, where donors spent up to $100,000 per person to attend.\n> \n> Donations to the Republican Party\n> Luckey has donated to the campaigns of dozens of Republican political candidates, including U.S. Senator Ted Cruz and candidates for the U.S. House of Representatives. He has also donated to a large number of Republican- and conservative-affiliated organizations, including the National Republican Congressional Committee, the 2017 Presidential Inaugural Committee, Mike Pence's Great America Committee, and many state Republican Party chapters.\n> \n>",
              "score": 7,
              "created_utc": 1745273738.0,
              "replies": []
            },
            {
              "id": "mob3d1c",
              "author": "PornstarVirgin",
              "body": "He caused the mess? What happened",
              "score": 2,
              "created_utc": 1745264195.0,
              "replies": [
                {
                  "id": "mob5mge",
                  "author": "ironsnoot",
                  "body": "I assume they’re talking about Trump enacting the\nabsolutely nuts tariffs that caused this problem in the first place. Not sure what it has to do with this Palmer guy.",
                  "score": 3,
                  "created_utc": 1745264865.0,
                  "replies": [
                    {
                      "id": "mob66f8",
                      "author": "PornstarVirgin",
                      "body": "I know Lucky Palmer is pro orange man so the logic makes sense",
                      "score": 6,
                      "created_utc": 1745265030.0,
                      "replies": [
                        {
                          "id": "mobuyg7",
                          "author": "kryst4line",
                          "body": "That and him being a weapon dealer, for example",
                          "score": 2,
                          "created_utc": 1745272540.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "moatxbc",
      "author": "boogermike",
      "body": "I grabbed one of these a few months ago, to run retro game emulators. Glad I grabbed one, while I could, although I haven't really used it much.    \n  \nIt was only $40 shipped from China, and arrived in a week...those days are clearly over.",
      "score": 2,
      "created_utc": 1745261390.0,
      "replies": []
    },
    {
      "id": "moa32i9",
      "author": "raven726",
      "body": "Glad I went ahead and got the RG405M back in October.",
      "score": 1,
      "created_utc": 1745253600.0,
      "replies": []
    },
    {
      "id": "mob0dxj",
      "author": "Eldritch_Doodler",
      "body": "Wow, and here I am playing my Anbernic sp. glad I got it a few months ago!",
      "score": 1,
      "created_utc": 1745263305.0,
      "replies": []
    },
    {
      "id": "mob69no",
      "author": "Spicy-icey",
      "body": "Ugh guess I’m not upgrading my 351V anytime soon.",
      "score": 1,
      "created_utc": 1745265056.0,
      "replies": []
    },
    {
      "id": "mob9uza",
      "author": "tianavitoli",
      "body": "now you'll finally be able to tell your wife these games aren't worthless",
      "score": 1,
      "created_utc": 1745266129.0,
      "replies": []
    },
    {
      "id": "mobknix",
      "author": "UboaNoticedYou",
      "body": "What a shame! We are finally in an interesting world of tech again and cool niche products like this might be killed off. Lame!\n\nSooooo glad I preordered my Retroid Pocket Flip 2 to beat the tarrifs. I hate doing that with tech but I honestly have no regrets, it's awesome.",
      "score": 1,
      "created_utc": 1745269311.0,
      "replies": [
        {
          "id": "mocdmu0",
          "author": "AstralProjection77",
          "body": "Didja put it in ya donger?",
          "score": 1,
          "created_utc": 1745278833.0,
          "replies": [
            {
              "id": "moiint6",
              "author": "UboaNoticedYou",
              "body": "wouldn't fit :(",
              "score": 1,
              "created_utc": 1745362312.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mohdqok",
          "author": "Mr_Jewfro",
          "body": "I doubt they'll be killed off -- they're just going to become unavailable in the US. There's a large market outside of that :)",
          "score": 1,
          "created_utc": 1745349676.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mobwebe",
      "author": "Beginning-Paper7685",
      "body": "Just got my RG4xx H today!!!",
      "score": 1,
      "created_utc": 1745273013.0,
      "replies": []
    },
    {
      "id": "mobxo4j",
      "author": "toeonly",
      "body": "My buddy got me a rg34xx for my birthday a feww weeks ago I love that thing.",
      "score": 1,
      "created_utc": 1745273441.0,
      "replies": []
    },
    {
      "id": "moddacn",
      "author": "Nernoxx",
      "body": "I waited too long to go after a pocket 5 and now I guess I’ll wait until this all blows over.  Not surprised but disappointed.  Glad I ordered my RG35XX+ back at the beginning of the year before all this crap started.",
      "score": 1,
      "created_utc": 1745291351.0,
      "replies": []
    },
    {
      "id": "modsla6",
      "author": "WhereAreMyDarnPants",
      "body": "Loving my [RG556](https://anbernic.com/products/rg556). They were ~$180 just a couple of weeks ago. Already up to $269 on Amazon, and that stock is going to go quick. If you’re on the fence, it’s still absolutely worth $269 imo. \n\nToo bad. I was really looking forward to the [RG557](https://youtu.be/qgDRj9LVfmA).",
      "score": 1,
      "created_utc": 1745298018.0,
      "replies": []
    },
    {
      "id": "moemg7d",
      "author": "agent_fuzzyboots",
      "body": "damn, that sucks.\n\n\nmaybe it's time to take a European or Asian vacation and buy electronics?\n\nbefore when i wanted to buy something more expensive i went to Florida on vacation and ordered stuff from Amazon or from B&H Photo and video.",
      "score": 1,
      "created_utc": 1745316269.0,
      "replies": []
    },
    {
      "id": "mofs3wu",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1745332862.0,
      "replies": [
        {
          "id": "moghqy8",
          "author": "Chiguy2792",
          "body": "Squirrel!",
          "score": 1,
          "created_utc": 1745340368.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moj0rpx",
      "author": "RealOfficerHotPants",
      "body": "God dammit, I fucking love anbernic",
      "score": 1,
      "created_utc": 1745368448.0,
      "replies": []
    },
    {
      "id": "mopuvip",
      "author": "BestPaleontologist43",
      "body": "Im so glad I got mines ahead of this trade war. Goodluck retroid bros and sis",
      "score": 1,
      "created_utc": 1745460007.0,
      "replies": []
    },
    {
      "id": "moa7fhv",
      "author": "ciccioig",
      "body": "I want all the nerds of the US to vote blue in mass: the real revenge of the nerds.",
      "score": -4,
      "created_utc": 1745254870.0,
      "replies": [
        {
          "id": "moat02r",
          "author": "ahzzyborn",
          "body": "If they come up with a platform better than Kamala f’n Harris that may happen lol",
          "score": -9,
          "created_utc": 1745261117.0,
          "replies": [
            {
              "id": "mob1g1f",
              "author": "None",
              "body": "[deleted]",
              "score": 4,
              "created_utc": 1745263621.0,
              "replies": [
                {
                  "id": "mobj574",
                  "author": "ahzzyborn",
                  "body": "No but what the dems have been throwing out there isn’t going to sway many of the red votes. Can’t just rely on, ‘we’ll I’m better than orange man’",
                  "score": -3,
                  "created_utc": 1745268864.0,
                  "replies": [
                    {
                      "id": "mobln51",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 6,
                      "created_utc": 1745269612.0,
                      "replies": [
                        {
                          "id": "modaxpd",
                          "author": "ahzzyborn",
                          "body": "Party shouldn’t even exist if that’s their platform. They need to EARN votes not be given",
                          "score": 2,
                          "created_utc": 1745290443.0,
                          "replies": [
                            {
                              "id": "modbehq",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1745290620.0,
                              "replies": [
                                {
                                  "id": "modbiv5",
                                  "author": "ahzzyborn",
                                  "body": "Never said I voted for him",
                                  "score": 3,
                                  "created_utc": 1745290666.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "moatiiu",
      "author": "skyerosebuds",
      "body": "Bro in 1938 the Nazis were getting unpopular in civilised nations.  This is how it goes.",
      "score": 2,
      "created_utc": 1745261269.0,
      "replies": [
        {
          "id": "mob4tyk",
          "author": "rebbsitor",
          "body": "How it went - the past is rarely a reliable guide for the future.  People look at Nazi Germany as a parallel, but the US isn't post-WWI Germany.  We're not in a depressed economy further crushed by war reparations and hopelessness.",
          "score": 6,
          "created_utc": 1745264631.0,
          "replies": [
            {
              "id": "mobshqi",
              "author": "RustywantsYou",
              "body": "Give it a year. They know what they need to do and they're doing it\n\n\nEdit : actually, give it six months",
              "score": 5,
              "created_utc": 1745271749.0,
              "replies": []
            },
            {
              "id": "moxo5x2",
              "author": "Terrible_Duty_7643",
              "body": "Reality is rarely important, it's what you feel that carries the most weight, and Americans feel that the economy was depressed, and Trump has given them a simple explanation of why, and it's because they have been ripped off.",
              "score": 1,
              "created_utc": 1745567828.0,
              "replies": []
            },
            {
              "id": "mob521p",
              "author": "skyerosebuds",
              "body": "True.  You’ve got waaaay less reason to be arseholes.  But arseholes you have become.",
              "score": 2,
              "created_utc": 1745264697.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moe4foj",
      "author": "consumeshroomz",
      "body": "I’m still waiting for these tariffs to directly affect me in a major way. However, unlike trump voters, I don’t need to be directly affected by something to feel empathy for others and understand that it’s bad. \n\nYeah it’s video games today. Tomorrow it might impact my nicotine addiction (vapes).  Which is also the industry I work in so that could really fuck me. But lord help everyone once it impacts my coffee. I can let go of vaping. But I will do all sorts of things to get myself a cup of coffee. Ever seen a man turn to sex work to get a small cold brew? You’re about to. Gay for pay? Nah! Gay for coffee? “Whatever you want, Daddy!”",
      "score": 1,
      "created_utc": 1745304687.0,
      "replies": [
        {
          "id": "mos4lp0",
          "author": "goldfingas",
          "body": "lol",
          "score": 1,
          "created_utc": 1745499315.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mofshnp",
      "author": "None",
      "body": "The US is turning into North Korea",
      "score": 1,
      "created_utc": 1745332976.0,
      "replies": [
        {
          "id": "mp00mx1",
          "author": "Wild-Ruin5463",
          "body": "average redditor opinion.",
          "score": 0,
          "created_utc": 1745600558.0,
          "replies": [
            {
              "id": "mp23ck8",
              "author": "None",
              "body": "And you're so special, lol",
              "score": 1,
              "created_utc": 1745623681.0,
              "replies": [
                {
                  "id": "mp36eej",
                  "author": "Wild-Ruin5463",
                  "body": "not living in north korea makes me feel pretty special yes.",
                  "score": 1,
                  "created_utc": 1745637717.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mohaxzo",
      "author": "Unlimitles",
      "body": "I like how this is worded so that the culprit behind why this is happening isn’t lambasted. \n\nBut it’s completely the fault of the idiot we have running the country. \n\nIts due to the trade war he started in his first term and then reinitiated his second time around. \n\nI’m so sick of the stupidity of ignoring the reality of things because if biases and dumb bs. \n\nHe’s turning things into a hellhole and what we are supposed to ignore it because the simple minded babies that make up his base want to say “don’t talk politics” when they don’t want to admit they fkd us up by their decisions?",
      "score": 1,
      "created_utc": 1745348844.0,
      "replies": []
    },
    {
      "id": "moakkpq",
      "author": "jackishere",
      "body": "It’s paused until people understand what’s going on with tariffs. It’s not that us shipments are stopping indefinitely. Stop dooming",
      "score": -5,
      "created_utc": 1745258640.0,
      "replies": []
    },
    {
      "id": "mo9ob0e",
      "author": "YnotBbrave",
      "body": "Misleading title. They still ship from their US warehouse, and while the article says it is not clear how long supplies would last” supplies can be refurbished if there is demand with the new price level (that is, including taarifs) - they only stopped drop shipping directly from China",
      "score": -24,
      "created_utc": 1745248335.0,
      "replies": [
        {
          "id": "moap74t",
          "author": "Decipher",
          "body": "“US Shipments” means shipments bound for the US. Not within the US. It’s not misleading at all.",
          "score": 5,
          "created_utc": 1745259995.0,
          "replies": [
            {
              "id": "mob0yue",
              "author": "YnotBbrave",
              "body": "Well it misled me when *I* read it because it implies that you can’t get the item, not that you have to order it from the same merchant U.S. warehouse",
              "score": 1,
              "created_utc": 1745263479.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mos0qu4",
      "author": "jktribit",
      "body": "I can do everything this cheap plastic toy can do on my phone. This is no loss. Legit Gameboy are stilling being sold on ebay and at game stop.",
      "score": 0,
      "created_utc": 1745497929.0,
      "replies": []
    },
    {
      "id": "mo9udtg",
      "author": "None",
      "body": "[deleted]",
      "score": -4,
      "created_utc": 1745250759.0,
      "replies": [
        {
          "id": "mo9xx78",
          "author": "TheRealTHIB",
          "body": "crazy world, I was on Britannica learning about the great depression this morning.",
          "score": 2,
          "created_utc": 1745252022.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mob7ymi",
      "author": "kuebel33",
      "body": "Someone needs to make up an excuse for this shit gibbon to stop this tariff bullshit and have someone else to blame for it so he can act like he was right all along.",
      "score": -2,
      "created_utc": 1745265559.0,
      "replies": []
    },
    {
      "id": "mobafej",
      "author": "MrScooterComputer",
      "body": "Lmao oh no we can’t get game boys anymore oh nooooooo",
      "score": -15,
      "created_utc": 1745266300.0,
      "replies": [
        {
          "id": "mobx3n5",
          "author": "Alarming_Addition131",
          "body": "Broski, what sub is this?",
          "score": 4,
          "created_utc": 1745273250.0,
          "replies": []
        },
        {
          "id": "mocyq6b",
          "author": "TheInfiniteArchive",
          "body": "You're posting on a  subreddit about Gadgets.... Are you ok?",
          "score": 2,
          "created_utc": 1745286153.0,
          "replies": [
            {
              "id": "mod1fdo",
              "author": "Duplicity-",
              "body": "These losers just out themselves lmao",
              "score": 0,
              "created_utc": 1745287084.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mocb969",
      "author": "B16B0SS",
      "body": "I know someone (from china) who imports lots of stuff for friends by air via china to Canada - often cheaper than aliexpress or temu and same or better quality\n\nI wonder if she could do something to serve the american public through canada",
      "score": -1,
      "created_utc": 1745278033.0,
      "replies": []
    },
    {
      "id": "moa6s6p",
      "author": "00k5mp",
      "body": "Use your phone and a Bluetooth controller, idk why these handhelds are so popular, just a waste of money if you have a phone that can run everything already.",
      "score": -24,
      "created_utc": 1745254686.0,
      "replies": [
        {
          "id": "moabyq5",
          "author": "tylerbrainerd",
          "body": "because if I'm going to carry a bluetooth controller, i might as well carry a dedicated device and not burn my phone battery?",
          "score": 17,
          "created_utc": 1745256176.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mocez8b",
      "author": "prettybluefoxes",
      "body": "Less landfill is a good thing.",
      "score": -7,
      "created_utc": 1745279289.0,
      "replies": [
        {
          "id": "mocycss",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1745286024.0,
          "replies": [
            {
              "id": "modo6iy",
              "author": "prettybluefoxes",
              "body": "Not American",
              "score": 1,
              "created_utc": 1745295948.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "moa1x8k",
      "author": "Crimson_Raven",
      "body": "Oh no\n\n*boots Emulator on my phone*\n\nAnyway",
      "score": -33,
      "created_utc": 1745253255.0,
      "replies": [
        {
          "id": "moxp7dr",
          "author": "Terrible_Duty_7643",
          "body": "And you phone is made in Springfield, oh wait.",
          "score": 1,
          "created_utc": 1745568475.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9nidx",
      "author": "mollyringwald420",
      "body": "I can’t stand all these garbage emulator devices. Good riddance",
      "score": -93,
      "created_utc": 1745248095.0,
      "replies": [
        {
          "id": "mo9pbd7",
          "author": "Awsomethingy",
          "body": "If you weren’t using them, then what harm is there in knowing that other people out there enjoy them and love playing games on them? Are you really so upset by people enjoying themselves that doesn’t affect you? You just can’t stand their happiness?",
          "score": 31,
          "created_utc": 1745248642.0,
          "replies": [
            {
              "id": "mo9q7wj",
              "author": "mollyringwald420",
              "body": "lol come on man",
              "score": -53,
              "created_utc": 1745248914.0,
              "replies": [
                {
                  "id": "mob2yud",
                  "author": "Awsomethingy",
                  "body": "? Come on? Please explain",
                  "score": 6,
                  "created_utc": 1745264076.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo9qewt",
          "author": "makingnoise",
          "body": "When is the last time you used one?  I picked up a cheap-ass powkiddy v90 and it's crap, but for the price (under $20) it was worth it.  I also picked up an Anbernic RGCubeXX and the build quality and functionality is over-the-top, pretty damn good for $60.",
          "score": 11,
          "created_utc": 1745248971.0,
          "replies": []
        },
        {
          "id": "moa3cmk",
          "author": "chronoswing",
          "body": "Couldn't have a more wrong opinion about these if you tried. Abernics and miyoo are certainly not garbage. There are certainly a huge amount of cheap shit sold on ebay and Amazon that are garbage but these ain't it.",
          "score": 5,
          "created_utc": 1745253684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moa2sk1",
      "author": "Drabenb",
      "body": "Oh good lord. What are kids going to do? Go outside? Use their imaginations? Oh boy we can’t lose our handheld electronics.",
      "score": -39,
      "created_utc": 1745253518.0,
      "replies": [
        {
          "id": "moa31ex",
          "author": "Ironxgal",
          "body": "But if kids go outside, then the good folks on the Nextdoor app will complain about kids being seen in public and at parks! Can’t have that can we?",
          "score": 15,
          "created_utc": 1745253591.0,
          "replies": [
            {
              "id": "moajmvp",
              "author": "forlorn_junk_heap",
              "body": "remember: knocking on the door is considered probable cause to be murdered by someone!",
              "score": 5,
              "created_utc": 1745258366.0,
              "replies": [
                {
                  "id": "mobafk3",
                  "author": "Ironxgal",
                  "body": "Haha! Whoops I forgot about that. All of the above sounds like attractive reasons to send our children outside and take devices away.  -_- \n\nBut Foreal though, as a parent, I don’t feel that comfortable letting my kid hang out with friends at parks, or the mall as it seems like a decent amount of people have problems with the idea of unsupervised teens existing while not in their house?! We got curfews at malls, the cinemas, the skate parks..and rules against everything. My grandparents have some WILD stories about shit kids did for “fun” in their day. Things that I’d get shot for lol. (Ding dong ditch, egging things,lemonade stands, shooting BB guns in the driveway, cow tipping (I know. Don’t ask.) Bon fires in the woods with beer, parties, Etc. \nI remember being able to play at the school playgrounds on weekends. Now? It’s trespassing and kids have been arrested for this. \n\nwhen I was 16, I used to go to the mall, movies, or a library with friends. I used to bike across town to visit my boyfriend over summer break! At the mall I used to love getting chik fil a with my girls, check out guys, gossip, window shop, or try on shit we want our parents to buy later. Now? I’ll take my kid to the mall but I will not drop him off at the mall. I’ll drop him off at a restaurant but I don’t want him leaving the table until I’m already parked outside to pick him up. I warn him against loitering outside even if it’s just to wait for a ride. I seriously worry someone will get ridiculous and I don’t want to end up on the news with a dead child. I joke bout Nextdoor but I couldn’t believe the hostility towards teens having the AUDACITY to go to the park, the mall, the icecream shop, the cinema, or riding the metro. Shit, in my experience It’s always a grown ass man on the metro with his phone on speaker forcing us to listen to the convo he’s having. The teens have AirPods and are quiet bc they’re buried in their screen.",
                  "score": -1,
                  "created_utc": 1745266302.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "moa6jhn",
              "author": "Drabenb",
              "body": "lol",
              "score": -10,
              "created_utc": 1745254617.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mob3z2l",
      "author": "DoubleShot027",
      "body": "Oh noooooo not the little poker machines :0",
      "score": -14,
      "created_utc": 1745264378.0,
      "replies": []
    },
    {
      "id": "mo9ud3r",
      "author": "J-W-L",
      "body": "\n\nSo I was watching a depression food recipe YouTube and they were talking about Hoover stew. This is my new hobby.. Watching depression era cooking on YouTube.\nAnyway one of the featured recipes was called Hoover stew. It was called this because \n Hoover was widely blamed for the 1930s economic depression. Further research lead me to something called the smoot Hawley tariff act. I didn't know anything about this so it was interesting to learn about and it is easy to see how it is applicable here. \nExcept in Hoover's case I don't think he was trying to purposefully bankrupt the American people to hand over the country to the tech bros.. in trump's case he seems to be doing it to \"show\" he's protecting American interests but I'm reality it was already good and now it's garbage. Anyway.. Here is a brief summary of the act.\n\nThe Smoot-Hawley Tariff Act, officially the Tariff Act of 1930, was a U.S. law enacted on June 17, 1930, that significantly raised import duties on over 20,000 foreign goods. It was championed by Senator Reed Smoot and Representative Willis C. Hawley, with the primary goal of protecting American farmers and industries from foreign competition during the onset of the Great Depression.\nHere are the key facts about the Smoot-Hawley Tariff Act:\n * Protectionist Measure: Its main aim was to shield domestic producers by making imported goods more expensive.\n * High Tariff Rates: The act increased tariffs to some of the highest levels in U.S. history, averaging around a 20% increase on dutiable imports. Some tariffs were raised as high as 50%.\n * Wide Scope: It applied to a vast range of goods, both agricultural and manufactured.\n * Triggered Retaliation: A major consequence was that many foreign countries retaliated by imposing their own tariffs on American exports.\n * Contributed to Trade Decline: This trade war led to a dramatic decline in international trade. U.S. exports and imports both plummeted by significant amounts. Global trade decreased by an estimated 65% between 1929 and 1934.\n * Worsened the Great Depression: While the Act didn't cause the Great Depression, most economists agree that it significantly worsened its severity and prolonged the economic downturn both in the U.S. and globally. It reduced demand for goods, led to business closures, and exacerbated unemployment.\n * Nearly Unanimous Opposition from Economists: Over 1,000 economists signed a petition urging President Hoover to veto the bill, warning of its negative economic consequences.\n * Political Motivations: Despite the economic warnings, political pressure from various domestic industries seeking protection led to its passage.\n * A Symbol of Protectionism: The Smoot-Hawley Tariff Act has become a lasting symbol of the dangers of protectionist trade policies and is often cited as an example of how tariffs can backfire.\n * Shift Towards Free Trade: In the years following the Great Depression, the U.S. shifted towards policies of trade liberalization, beginning with the Reciprocal Trade Agreements Act of 1934.\nIn essence, the Smoot-Hawley Tariff Act of 1930 was a protectionist measure intended to help American industries but ultimately contributed to a global trade war and deepened the economic crisis of the Great Depression.",
      "score": -18,
      "created_utc": 1745250742.0,
      "replies": []
    },
    {
      "id": "moamsbo",
      "author": "Sad-Band2124",
      "body": "Oh no, not my handheld that benefits none of the hard working folks who actually made the original game platform!\n\nWhat will I ever do without this?\n\n*opens emulator app on phone*\n\nWhat ever shall I do! I’m lost…",
      "score": -24,
      "created_utc": 1745259286.0,
      "replies": [
        {
          "id": "moap3eq",
          "author": "Aramis444",
          "body": "Ah yes, let me just go and purchase a new PS2 along with new games, all of which are completely available for purchase, and thus benefitting the “hard working folks who actually made the original game platform”. It’s so wonderful that I can purchase all of these items new at this point in time.",
          "score": 7,
          "created_utc": 1745259964.0,
          "replies": []
        },
        {
          "id": "moaok3e",
          "author": "ognarMOR",
          "body": "What psycho does emulation on a phone?",
          "score": 3,
          "created_utc": 1745259806.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9n65r",
      "author": "MasahChief",
      "body": "Oh no… anyways.",
      "score": -67,
      "created_utc": 1745247992.0,
      "replies": []
    },
    {
      "id": "mocmwti",
      "author": "babayetu_babayaga",
      "body": "Y'all can stop being feminised, go out and make your own retro consoles!",
      "score": -13,
      "created_utc": 1745282039.0,
      "replies": [
        {
          "id": "mofc295",
          "author": "OddNothic",
          "body": "Sure, let me just go order those components to build one… *Made in China*\n\nOkay, let’s try just banging rocks together and see what comes from that…I’ll get back to you.",
          "score": 1,
          "created_utc": 1745327655.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9o1sb",
      "author": "buds1",
      "body": "Everybody hating trump. U realize ur alternative was Kamala.. I take tariffs.",
      "score": -115,
      "created_utc": 1745248259.0,
      "replies": [
        {
          "id": "mo9ruix",
          "author": "lucid-node",
          "body": "Yeah, god forbid we endure her laugh instead of financial collapse and global instability. Truly a nightmare scenario.",
          "score": 30,
          "created_utc": 1745249399.0,
          "replies": [
            {
              "id": "mob0igv",
              "author": "buds1",
              "body": "Because we did so well when she was vice president. If she was willing to sit behind Biden, she's not the answer. Honestly fuck trump too, but I rather have this storm and fight for a better tomorrow, then Biden puppet ass. Either way fuck them, just my two cents.",
              "score": -5,
              "created_utc": 1745263343.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9tx1t",
          "author": "heatlesssun",
          "body": ">Everybody hating trump. U realize ur alternative was Kamala.. I take tariffs.\n\nEither you don't really understand the impact of these tariffs and that they aren't going to produce net new jobs with the jobs that will be lost or perhaps something else.",
          "score": 20,
          "created_utc": 1745250030.0,
          "replies": [
            {
              "id": "mob4h4z",
              "author": "ironsnoot",
              "body": "Based on this guy’s responses I don’t think he understands the impact of most things.",
              "score": 4,
              "created_utc": 1745264526.0,
              "replies": []
            },
            {
              "id": "mob26ab",
              "author": "buds1",
              "body": "I absolutely don't understand anything 🤣 just smart enough to tie my shoes and work hard for my family. I grew up tough, was an anarchist. Never followed politics, just my heart. Like emenim said, if I offended you, good, because I still don't give a fuck 🤣 I say this shit to people in real life and they don't say shit, but reddit has the answers. Reddit for president 🤣 hope everyone has a blessed day. Back to enjoying my day off, with my kids at the beach 🫠",
              "score": -7,
              "created_utc": 1745263837.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9pr6z",
          "author": "Awsomethingy",
          "body": "And a recession. And alienation from the global economy. And ending our alliances. And cutting gov programs from medicaid to social security. And using tax payer money for personal expenses.\n\nYou took a lot",
          "score": 36,
          "created_utc": 1745248775.0,
          "replies": [
            {
              "id": "mo9rxeh",
              "author": "BedBugger6-9",
              "body": "Yes, but he owned the libs! 🤪",
              "score": 19,
              "created_utc": 1745249423.0,
              "replies": [
                {
                  "id": "mo9skhg",
                  "author": "Sonic1899",
                  "body": "Owned himself, first",
                  "score": 5,
                  "created_utc": 1745249612.0,
                  "replies": []
                },
                {
                  "id": "moajlpl",
                  "author": "Decipher",
                  "body": "Let’s be real. Things are getting so expensive that he could only rent the libs.",
                  "score": 2,
                  "created_utc": 1745258356.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mo9ugg0",
              "author": "mollyringwald420",
              "body": "If you didn’t vote for them, then what harm is there in knowing that other people out there enjoy them and love owning libs? Are you really so upset by people enjoying themselves that doesn’t affect you? You just can’t stand their happiness?",
              "score": -35,
              "created_utc": 1745250809.0,
              "replies": [
                {
                  "id": "mo9uy17",
                  "author": "Awsomethingy",
                  "body": "Bro. It *is* affecting me. My income dropped 70% because of the tarrifa",
                  "score": 17,
                  "created_utc": 1745251032.0,
                  "replies": []
                },
                {
                  "id": "mo9uvzj",
                  "author": "48HourBoner",
                  "body": "Lol come on man",
                  "score": 14,
                  "created_utc": 1745251010.0,
                  "replies": [
                    {
                      "id": "mo9vlxv",
                      "author": "mollyringwald420",
                      "body": "Haha omg I feel like I’ve been here before",
                      "score": -17,
                      "created_utc": 1745251274.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mo9uyfu",
                  "author": "Awsomethingy",
                  "body": "Bro. It *is* affecting me. My income dropped 70% because of the tarries. I went from comfortable living to facing homelessness. I have no idea what the fuck you’re talking about with them just being in their own world ‘owning the libs’",
                  "score": 1,
                  "created_utc": 1745251036.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo9r63z",
          "author": "AutistcCuttlefish",
          "body": "Man you must *really* hate women if you are willing to take the complete destruction of the soft power of the united states just so that one wouldn't become the president.",
          "score": 20,
          "created_utc": 1745249198.0,
          "replies": []
        },
        {
          "id": "moa7b4q",
          "author": "chronoswing",
          "body": "Imagine being this stupid.",
          "score": 13,
          "created_utc": 1745254836.0,
          "replies": [
            {
              "id": "mob32vf",
              "author": "buds1",
              "body": "Imagine being so stupid you drop ur keys in the trunk and post about it t, then call someone else stupid. Stupid 😂",
              "score": -2,
              "created_utc": 1745264109.0,
              "replies": [
                {
                  "id": "mobwzve",
                  "author": "chronoswing",
                  "body": "Imagine digging through years of someone’s posts, finding a story about keys, and thinking you did something. That’s not a roast, that’s a full-blown obsession. Rent-free doesn’t even cover it—I'm living in your head with utilities included.",
                  "score": 2,
                  "created_utc": 1745273215.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo9twrw",
          "author": "SilverrFoxx-",
          "body": "You know.... It's more than just the tariffs, right?",
          "score": 13,
          "created_utc": 1745250026.0,
          "replies": [
            {
              "id": "mo9vkb3",
              "author": "vezwyx",
              "body": "Well you see, legal documented immigrants aren't actually people when they say something bad about Supreme Leader Donald. Therefore when he ignores silly constitutional rights like due process or whatever, it's not bad and I don't care. Me losing money from tariffs is the only bad thing here  \n-this guy, probably",
              "score": 9,
              "created_utc": 1745251258.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9yof6",
          "author": "ChangeVivid2964",
          "body": "Largest tax increase in US history.  Except this time the taxes really are just going into some rich king's pocket, instead of back into the community.  They're bragging about it.",
          "score": 11,
          "created_utc": 1745252262.0,
          "replies": []
        },
        {
          "id": "mo9qui7",
          "author": "vezwyx",
          "body": "You're not among friends here. I would have taken Kamala over Donald for basically every policy they have",
          "score": 17,
          "created_utc": 1745249101.0,
          "replies": [
            {
              "id": "mob4r91",
              "author": "ironsnoot",
              "body": "I would have taken a randomly selected golden retriever over Donald, frankly.",
              "score": 4,
              "created_utc": 1745264609.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo9tt7v",
          "author": "-Swampthing-",
          "body": "You mean Kamala who was vice president while we had the most successful economy ever?  Yeah, that Kamala.  Back when everyone had great 401(k)s and had room to retire?  When thousands of federal employees still had their jobs?  When foreign countries still received aid from the USA for their starving and critically injured people?  When allies cared for us instead of pointing fingers and laughing at us?  Oh hell, yes… Today is much better than it was back then.   What a fucking idiot.",
          "score": 16,
          "created_utc": 1745249975.0,
          "replies": []
        },
        {
          "id": "mo9yuzc",
          "author": "gman5852",
          "body": "Unfortunately most of us are capable of realizing Trump was significantly worse than single handedly tanking our economy and foreign relationships.\n\nThe fact that you can't is something I wouldn't be proud of.",
          "score": 7,
          "created_utc": 1745252319.0,
          "replies": []
        },
        {
          "id": "mobjc07",
          "author": "idontdownvotebeagles",
          "body": "u dum broseph?",
          "score": 2,
          "created_utc": 1745268921.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mo9s6tj",
      "author": "Horzzo",
      "body": "You mean the cheap bootleg devices that skirt IP and copyright laws? Good riddens.",
      "score": -52,
      "created_utc": 1745249501.0,
      "replies": [
        {
          "id": "moapoem",
          "author": "chronoswing",
          "body": "Yeah, how dare people enjoy classic games that the original publishers don’t even sell anymore. Better let them rot in a vault forever so you can feel morally superior about 30-year-old ROMs. Real hero stuff.",
          "score": 4,
          "created_utc": 1745260137.0,
          "replies": [
            {
              "id": "moaqojl",
              "author": "Horzzo",
              "body": "Most of these games are still for sale on their respective digital platforms. I don't know why people think it's okay for companies to straight up sell stolen games. If this were a US company it would have been shut down years ago.",
              "score": -10,
              "created_utc": 1745260433.0,
              "replies": [
                {
                  "id": "moawl5g",
                  "author": "EvilDuncan",
                  "body": "These companies sell the hardware, not the games. Well, the reputable ones do, at least.",
                  "score": 2,
                  "created_utc": 1745262178.0,
                  "replies": []
                },
                {
                  "id": "mocow15",
                  "author": "chronoswing",
                  "body": "Most of these games aren’t for sale, and the ones that are are buried under overpriced, low-effort ports or locked behind subscriptions. Nobody’s stealing anything—they’re preserving what the original publishers abandoned. If you're more upset about emulation than corporate neglect, your priorities are backwards.",
                  "score": 1,
                  "created_utc": 1745282730.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "moavjs3",
          "author": "Paksarra",
          "body": "They don't just run bootleg games. I have Vampire Survivors and Steam Link on my handheld.\n\n\nThey also explicitly don't *sell* stolen games. It's just a small Android tablet in a controller case. If you choose to load it up with pirated games that's your own decision.",
          "score": 2,
          "created_utc": 1745261869.0,
          "replies": []
        },
        {
          "id": "mobjan2",
          "author": "idontdownvotebeagles",
          "body": "found the bootlicker lol",
          "score": 1,
          "created_utc": 1745268909.0,
          "replies": []
        }
      ]
    }
  ]
}