{
  "post": {
    "title": "Lenovo Chromebook Plus 14 review: the new king of Chromebooks",
    "author": "dapperlemon",
    "id": "1lv6h74",
    "score": 60,
    "created_utc": 1752025194.0,
    "selftext": "",
    "num_comments": 30,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lv6h74/lenovo_chromebook_plus_14_review_the_new_king_of/"
  },
  "comments": [
    {
      "id": "n23ixly",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752025195.0,
      "replies": []
    },
    {
      "id": "n23kv54",
      "author": "w1n5t0nM1k3y",
      "body": "I guess if you're Ok with he limits of a Chromebook but want something nice then this might make sense. But I don't think most people would want to spend this much on a computer and then run into limitations of what you can do because it doesn't run a more feature complete operating system like Windows or Mac OS.",
      "score": 28,
      "created_utc": 1752025843.0,
      "replies": [
        {
          "id": "n23pmol",
          "author": "CandyCrisis",
          "body": "When I was working at Google I had a really high-end Chromebook for a while and it was actually way more capable than I expected. I kind of miss it. https://youtu.be/sOn2CX3BnT0?si=AGbgDANVlLVtFQqz",
          "score": 16,
          "created_utc": 1752027448.0,
          "replies": [
            {
              "id": "n290a95",
              "author": "misak_",
              "body": "...you miss Google Pixelbook? Maybe Ive used some kind of different one, but it SUCKED for remote work during covid. Small screen for the form factor, low-end camera, it would overheat during calls and grind to a halt if I tried to present anything. It had \"Intel i7\" CPU so it should be capable, right? Nope, that was just a deceptive marketing, as i7-7Y75 is on par with i3-7100U when it comes to performance. I would often choose \"Gmail Basic HTML\" because even the standard Gmail webapp could be laggy. I do not miss it.",
              "score": 9,
              "created_utc": 1752095665.0,
              "replies": [
                {
                  "id": "n29et8k",
                  "author": "CandyCrisis",
                  "body": "I always plugged it into a 4K monitor. I heard others talk about overheating but mine never had that issue. Maybe I just got lucky.",
                  "score": 4,
                  "created_utc": 1752100033.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n269dl9",
          "author": "RoundTableMaker",
          "body": "I don’t really know what the limitations are at this point. Almost everything can be ran in the cloud. What are people running into as limitations? If i need anything serious i will run on a vps. Yea gaming is crap but it’s crap on macbooks and windows computers. You end up on Nvidia streaming service for all of them. And even if you get a laptop with a gpu it’s going to be trash in a year or two.",
          "score": -16,
          "created_utc": 1752068299.0,
          "replies": [
            {
              "id": "n26kmbo",
              "author": "Ratr96",
              "body": "Lol this comment is so full of shit I had to call a plumber",
              "score": 8,
              "created_utc": 1752071597.0,
              "replies": [
                {
                  "id": "n27ko3s",
                  "author": "RoundTableMaker",
                  "body": "Great imagination but still can’t figure out how to utilize a Chromebook.  😂",
                  "score": -2,
                  "created_utc": 1752081489.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n26ac8l",
              "author": "w1n5t0nM1k3y",
              "body": "If you're going to pay for a VPS then go ahead, but that's an extra cost that you have to pay monthly.  \n\nMy son has a Windows Laptop and it plays games just fine. Mostly Marvel Rivals right now. Lots of other games run fine too. It's a year and a half old at this point and has zero problems.\n\nChromebooks are fine if they fit your needs, but there's a lot of stuff that just works better local. I like to be able to do various programming tasks using locally installed databases and Visual Studio or other IDEs.",
              "score": 4,
              "created_utc": 1752068595.0,
              "replies": [
                {
                  "id": "n2hbvc9",
                  "author": "RoundTableMaker",
                  "body": "GPUs tend to deteriorate fast on laptops. Macbook air might be the sweet spot.",
                  "score": 0,
                  "created_utc": 1752201514.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2ettbf",
      "author": "just_chilling_too",
      "body": "That’s like saying you’re the tallest midget in the room",
      "score": 5,
      "created_utc": 1752172883.0,
      "replies": []
    },
    {
      "id": "n23qdsj",
      "author": "motohaas",
      "body": "I didn't know that chrome books were still around.\nThe ones that the kids good for school work were useless pieces of shit",
      "score": 13,
      "created_utc": 1752027706.0,
      "replies": [
        {
          "id": "n244zmt",
          "author": "barfplanet",
          "body": "I wouldn't want one as my main machine, but now that they can run Linux apps and Android apps, they're pretty reasonable machines. Web based Office apps are getting much better also. \n\nI'll stick with my Linux machine, but the next computers for my wife and kid will 100% be Chromebooks.",
          "score": 8,
          "created_utc": 1752033191.0,
          "replies": [
            {
              "id": "n381zzi",
              "author": "punIn10ded",
              "body": "Add in older people too. I replaced my parents windows laptop with a Chromebox attached to the back of a monitor. Now I never have any helpdesk functions to perform.",
              "score": 1,
              "created_utc": 1752565277.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n23s6ul",
          "author": "PresentSquirrel",
          "body": "For the same price as the cheapo chromebooks that kids got in school, do you honestly think anything windows would be any better? \n\nI bought a $300 chromebook and it has been very pleasant to use. No hiccups even with 15+ tabs open and music streaming, and an external monitor plugged in as well.",
          "score": 9,
          "created_utc": 1752028341.0,
          "replies": [
            {
              "id": "n23y5or",
              "author": "CharlesP2009",
              "body": "I’d def prefer a $300 Chromebook over a $500 Windows machine.",
              "score": 7,
              "created_utc": 1752030505.0,
              "replies": [
                {
                  "id": "n262sa9",
                  "author": "Matty9180",
                  "body": "It 100% depends on your use case. I personally will never buy a chrome book but for people that are just using them for basic computer functions they should be just fine.",
                  "score": 4,
                  "created_utc": 1752066177.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2qy19f",
          "author": "danielv123",
          "body": "Yeah, when you buy a 100$ laptop you kinda get what you pay for.",
          "score": 1,
          "created_utc": 1752336767.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2n68sd",
      "author": "Manderlin99",
      "body": "This Chromebook is very appealing for someone who travels a lot and is focused on little more than writing and consuming media entertainment. Its simplicity is its appeal.",
      "score": 2,
      "created_utc": 1752278166.0,
      "replies": []
    },
    {
      "id": "n2bskw2",
      "author": "shade010",
      "body": "Lenovo is king of nothing but trouble. We managed a lot of the windows based Lenovos for clients and they were trouble",
      "score": 2,
      "created_utc": 1752134616.0,
      "replies": []
    },
    {
      "id": "n2i48f7",
      "author": "crymachine",
      "body": "I'm still using my original Chromebook flip because it's portable and does what I need it to when I'm out, but god damn. Every so often I go and look how old it is, how much it costs, and then can't believe what these modern do nothing devices cost.",
      "score": 1,
      "created_utc": 1752213842.0,
      "replies": []
    },
    {
      "id": "n6457kn",
      "author": "Lee_Benj003",
      "body": "The new king for doing simple tasks, I'd say. ChromeOS seems more for the simpler stuff like browsing and using some AI and ChatGPT, maybe playing some light games, and working across the Google Workspace (which I mostly use for work, it's great). Overall, a device for someone who wants something simpler for work and can do so within its limits.\n\nAnd I don't really need that, but for those so who do, it looks good enough. I haven't really heard of heating issues or battery issues in this one, but one issue is that the speakers are not up to the mark compared to the rest of the hardware. It's portable and comfortable to carry too. It's great that they used an OLED screen, not super bright for working outside, but solid otherwise. The camera isn't a highlight, but Chromebooks aren't camera-centric devices anyway. As for performance - the Kompanio Ultra SoC is fast and smooth, and UFS4 and 256 storage are good, the essentials for good performance have been given.\n\nThe battery is a highlight, I've heard it lasts almost a full day of work, and some overnight.\n\nThey could've given microSD, but the headphone jack is there at least :)\n\nI wouldn't have minded something like this in Uni.\n\n  \nedit- grammar",
      "score": 1,
      "created_utc": 1753939604.0,
      "replies": []
    },
    {
      "id": "n2vqrci",
      "author": "Nail_Biterr",
      "body": "I've always thought of a Chromebook to be kind of like a $150 web-based computer. But for $750, couldn't you just get an actual laptop?",
      "score": 1,
      "created_utc": 1752406057.0,
      "replies": []
    },
    {
      "id": "n26l9pa",
      "author": "Paulyoceans",
      "body": "Great, can’t wait to support this and get asked why I can’t do what other computers can do for work.",
      "score": -1,
      "created_utc": 1752071785.0,
      "replies": []
    },
    {
      "id": "n4o891n",
      "author": "olismismi",
      "body": "from the moment you see its sleek design and vibrant 14-inch OLED screen, you know it’s something special. The display’s sharp 1920x1200 resolution paired with a 16:10 aspect ratio makes working, streaming, or just browsing really enjoyable - everything looks crisp and colorful. What’s impressive is how smooth this Chromebook runs with Mediatek chip inside. I wasn’t expecting the kind of performance that feels close to high-end Intel or AMD machines, but it handles multitasking with ease and stays cool without a noisy fan. The battery life is a bonus, easily lasting through a full day of heavy use, which makes it perfect for students or professionals on the go.\n\nThe keyboard and overall build quality feel premium without the bulk, and little touches like the fingerprint sensor and Dolby Atmos support add to the experience. Plus, AI powered features Lenovo rolled out make managing tabs and projects way easier. So yeah, plus 14 strikes a great balance of power, portability, and style... definitely worth checking out if you want a smooth and premium ChromeOS experience.",
      "score": 0,
      "created_utc": 1753255268.0,
      "replies": []
    },
    {
      "id": "n4o8nm2",
      "author": "BrownLucas123",
      "body": "This is really a great chromebook. My sister Lora has it she visited me a week ago she can't stop bragging about the overall performance. She said during the sleepover she tried to play some songs in her chromebook and with quad speakers with Dolby Atmos it's really amazing.  With, Kompanio Ultra SoC and long battery life the Lenovo chromebooks 14 Plus is amazing. I guess if I ever change my current one, I will replace with this one",
      "score": 0,
      "created_utc": 1753255493.0,
      "replies": []
    },
    {
      "id": "n24xydl",
      "author": "Mooseymax",
      "body": "I can’t believe google axed their domain service before chromebooks",
      "score": -5,
      "created_utc": 1752047468.0,
      "replies": [
        {
          "id": "n25tfp1",
          "author": "tdubeau",
          "body": "I bet the same teams and skillsets were being utilized on the domain service as Chromebook development. ",
          "score": 1,
          "created_utc": 1752062902.0,
          "replies": []
        }
      ]
    }
  ]
}