{
  "post": {
    "title": "Powerplay 2: Logitech made its magic mousepad cheaper instead of better",
    "author": "Movecanz",
    "id": "1ixx21d",
    "score": 1403,
    "created_utc": 1740495849.0,
    "selftext": "",
    "num_comments": 207,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ixx21d/powerplay_2_logitech_made_its_magic_mousepad/"
  },
  "comments": [
    {
      "id": "mepzulm",
      "author": "NycAlex",
      "body": "I bought the original powerplay mat as soon as it came out in jan 2019\n\nIt still goes today, i have not charged a single wireless mouse in over 6 years\n\nI have used all of these on the same powerplay mat:\n\nG502, g703, g900, g903, g pro, g pro superlight, superlight2, g502 hero, g502x plus\n\nWas well worth the $100 i paid for the mat\n\nEdit: just read the article\n\nBuiltin charging cable instead of removable usb, this sucks\n\nBut here is the big one:\n\nPowerplay 2 no longer has a builtin wireless receiver.\n\nOn powerplay 1 mat, i only need to sync mouse to powerplay mat, only mat needs to connect usb to my pc.\n\nOn new powerplay mat 2, you have to use usb dongle that comes with your mouse as well as plug in usb cable from mat. Fuck that, this is some backwards bullshit. Now this bullshit requires 2 usb ports for the same shit",
      "score": 390,
      "created_utc": 1740500051.0,
      "replies": [
        {
          "id": "meqacrs",
          "author": "semibiquitous",
          "body": "wtf? how did they sign off on selling new version product with LESS features. Reading this, and especially last two bullet points make this a significant downgrade.",
          "score": 192,
          "created_utc": 1740503056.0,
          "replies": [
            {
              "id": "mesbcxg",
              "author": "None",
              "body": "[deleted]",
              "score": 100,
              "created_utc": 1740523686.0,
              "replies": [
                {
                  "id": "meu7yvq",
                  "author": "None",
                  "body": "World is so shit today, if it’s not subscription based it has to be tier based, or both.",
                  "score": 26,
                  "created_utc": 1740547528.0,
                  "replies": []
                },
                {
                  "id": "mf2ugha",
                  "author": "TRex-XXII",
                  "body": "they should make it so you can also charge your phone on it, i dont see how it could be better then the first one",
                  "score": 0,
                  "created_utc": 1740668389.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "meqf8o2",
          "author": "Buttknucks",
          "body": "Same, bought one a while after getting a wireless mouse and never looked back. \n\nA selling point for me was definitely the built in receiver. No connection issues because it’s always right next to the mouse, and I like that it feels like an all in one system. Wild that they didn’t put a USB port on the base of the pad for the connector at least.",
          "score": 31,
          "created_utc": 1740504444.0,
          "replies": [
            {
              "id": "mer3br9",
              "author": "Nalcomis",
              "body": "That really is the kicker. This shitty receivers are susceptible to all kinds of interference, and the back of your pc behind all the components is the worst place for it.  The receiver being 3” from my hand was absolutely a huge selling point.  That and the pad has an antenna bigger than the entire Lightspeed usb thing.",
              "score": 22,
              "created_utc": 1740511206.0,
              "replies": []
            }
          ]
        },
        {
          "id": "meu52su",
          "author": "dwehlen",
          "body": "*Nine* mice in six years? Sounds like the mat eats mice's souls. . .",
          "score": 19,
          "created_utc": 1740546256.0,
          "replies": [
            {
              "id": "mew57oa",
              "author": "-FourOhFour-",
              "body": "Tbf the first few seem like they liked the quality but not the model, then the g max line they liked the mouse but wanted the better versions, before returning back to the upgraded version of the g502.\n\nI'd have sucked it up and dealt with a mouse I was content with longer but I can 100% see the logic on the swaps, I know I went through 3 mmo mice in 3 years before finally settling on my current which has all the features I wanted.",
              "score": 3,
              "created_utc": 1740581244.0,
              "replies": [
                {
                  "id": "mmi1x9j",
                  "author": "MistSecurity",
                  "body": "What’s you settle on? Considering picking up a second mouse for MMO style games.",
                  "score": 1,
                  "created_utc": 1744339644.0,
                  "replies": [
                    {
                      "id": "mmk848m",
                      "author": "-FourOhFour-",
                      "body": "If you don't have an mmo mouse already get a cheap one and force yourself to use it for simple things first (forward, back, mute, etc) see if you're comfortable with the mouse before getting a good one. I personally hardly use the mmo side of the mouse now but thats partly due to me cutting back on mmos due to life and even when i do play I barely touch them as it's no longer a muscle memory. They're great mice if you need extra hot keys but it really depends on how you are if you can get the moust out of them.\n\nAs for actual recommendations, Naga line was what I used from razer, decent quality interchangeable side piece so I wasn't stuck with the mmo setup, they also have a dedicated model that has freespin and wireless (afaik only big company between Logitech, Corsair and Razer to have that setup) but name is escaping me which is what I currently use. The Logitech mmo mouse was fine but felt it got dirtier than it should and was harder to clean than I'd have liked, and I don't think I used a corsair and if I did it was brief, faintly recall their design not seeming very ergonomic to me",
                      "score": 1,
                      "created_utc": 1744378912.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mf3blhx",
              "author": "AshelyLil",
              "body": "Oh you poor soul.\n\nYou have not seen the world of top tier gaming mice.\n\nThere's people who bought nine mice in the last year alone.",
              "score": 3,
              "created_utc": 1740673451.0,
              "replies": []
            },
            {
              "id": "mewa2wf",
              "author": "windsorHaze",
              "body": "And here I am sitting over here in my corner still rocking the proteus core.",
              "score": 2,
              "created_utc": 1740582755.0,
              "replies": []
            }
          ]
        },
        {
          "id": "met4ylc",
          "author": "Liatin11",
          "body": "damn so no improvements, shits just worse… well glad the powerplay 1 is durable. think ive had mine for 2 years",
          "score": 5,
          "created_utc": 1740533243.0,
          "replies": [
            {
              "id": "msny0oe",
              "author": "polo2006",
              "body": "6 years here, still rocking beside the \"mat\" I had to replace once due to fraid edges.",
              "score": 2,
              "created_utc": 1747418565.0,
              "replies": [
                {
                  "id": "mvfg2dn",
                  "author": "Rapdactyl",
                  "body": "7 years here, have always just used my own mousepads. I saw there was a 2 and came upon this thread..why would they ever downgrade a product??",
                  "score": 1,
                  "created_utc": 1748791550.0,
                  "replies": []
                },
                {
                  "id": "my64c21",
                  "author": "BoutchooQc",
                  "body": "Which mat did you go with ?  \nI'm thinking of the G240 rubber (Can't find the PET one)\n\n  \nLet me know :)",
                  "score": 1,
                  "created_utc": 1750115898.0,
                  "replies": [
                    {
                      "id": "mym8aut",
                      "author": "polo2006",
                      "body": "I got the original mat as a replacement from logitech when I contacted support.",
                      "score": 1,
                      "created_utc": 1750334358.0,
                      "replies": [
                        {
                          "id": "mymeoq7",
                          "author": "BoutchooQc",
                          "body": "I tried too, and they couldn't help me. No longer sold :(",
                          "score": 1,
                          "created_utc": 1750336821.0,
                          "replies": [
                            {
                              "id": "mymidaz",
                              "author": "polo2006",
                              "body": "wow really? glad i bough spares then :D still have one left in case my original breaks down.",
                              "score": 1,
                              "created_utc": 1750338128.0,
                              "replies": [
                                {
                                  "id": "mymj17i",
                                  "author": "BoutchooQc",
                                  "body": "Yeah they offered me a 30% coupon, and was thinking of getting the G240. They are 1mm thick vs the stock 2mm one. So I'm not sure it affect stuff.",
                                  "score": 1,
                                  "created_utc": 1750338360.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mf2ahjj",
          "author": "nighteyes_wolf",
          "body": "still rocking my powerplay after getting it at launch though both of the surfaces have been destroyed lol.  been using a thinner desk mat that I drape over the powerplay.  It's funny but not funny that they're pulling this back handed 'sack tap' with the 'new and improved' powerplay 2.  sigh....never stop being innovative Logi...",
          "score": 1,
          "created_utc": 1740661450.0,
          "replies": []
        },
        {
          "id": "mf2qh67",
          "author": "invent_or_die",
          "body": "Wow, great comment. 👍  Logi, you fucked us trying to save a USB connecter. A new Logi LOW. Some marketing genius should be FIRED. This was a great product.",
          "score": 1,
          "created_utc": 1740667113.0,
          "replies": []
        },
        {
          "id": "mfjdi7a",
          "author": "jh30uk",
          "body": "FYI it launched Aug 2017 (I pre-ordered it along with the G903 mouse).",
          "score": 1,
          "created_utc": 1740881669.0,
          "replies": []
        },
        {
          "id": "mg11rso",
          "author": "poopyfacebsbdb",
          "body": "Would you recommend on finding a Power play V1? i was wanting to get into power play set up but from everything here V2 is hot garbage haha.  is it worth getting V2 or should i just roam around Ebay for V1?",
          "score": 1,
          "created_utc": 1741121894.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mepsrx2",
      "author": "Tudar87",
      "body": "I have a the power play mouse pad and g903 mouse to match.  \n\nI bought it on a whim and laughed at the gimmick of removing a cable from my mouse but now having to plug in my mouse pad.  \n\nI quickly changed my mind and have been a happy user for years.",
      "score": 344,
      "created_utc": 1740497982.0,
      "replies": [
        {
          "id": "meptj5y",
          "author": "ChoMar05",
          "body": "I had 3 G903 in the span of 1 1/2 years. They all failed with various symptoms of broken buttons. I mean, they were refunded under warranty without issue, but it still was the last logitech product I got.",
          "score": 91,
          "created_utc": 1740498205.0,
          "replies": [
            {
              "id": "meq6o0m",
              "author": "hydroptix",
              "body": "Yep, had two start experiencing the dreaded double clicking issue. Found out I could buy the switches on Amazon and they're ~~pretty easy to replace~~ able to be replaced without soldering for the g903 specifically. Still annoying it needs to be done at all. ",
              "score": 14,
              "created_utc": 1740502010.0,
              "replies": [
                {
                  "id": "mer2zpd",
                  "author": "BrunoEye",
                  "body": "Yeah, my G900 has worked flawlessly for 6 years since I replaced the switches.",
                  "score": 2,
                  "created_utc": 1740511113.0,
                  "replies": []
                },
                {
                  "id": "mesbck5",
                  "author": "frn",
                  "body": "I wouldn't say it's easy. The whole thing is designed to make the switches the hardest thing to get to. Had to remove most of the surprisingly numerous components to get at them, and its almost impossible not to bend the battery in the process. Took me about 2 hours in total.\n\nThe how-to video on YouTube is 45 mins long with cuts and fast-forward sections. And it only covers the dissasembly.\n\nhttps://youtu.be/Sm5quIn6UCM?si=hKjc9uRFZPxlgKOE",
                  "score": 2,
                  "created_utc": 1740523683.0,
                  "replies": [
                    {
                      "id": "mesgj7n",
                      "author": "hydroptix",
                      "body": "I guess by \"easy\" I meant there's no soldering required. I do remember it being pretty time consuming.",
                      "score": 2,
                      "created_utc": 1740525296.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mepu1rk",
              "author": "Tudar87",
              "body": "Only issues I've had is keys wearing down on my WASD on the g915 keyboard. Which if I'm being honest happened on all of my keyboards after a few years.  \n\nNot saying these are great by any means, especially for the price, just saying I havent had any issues.",
              "score": 26,
              "created_utc": 1740498357.0,
              "replies": [
                {
                  "id": "merrpev",
                  "author": "Emu1981",
                  "body": ">keys wearing down on my WASD\n\nDouble-shot PBT keycaps are the solution to this - the question is whether you can get them for your particular keyboard.  The keycaps on my old MK750 are still looking pretty much brand new after 6 years of heavy usage.  Even the keycaps on my old g910 that I had to toss because of bounce on a lot of the keys was fine after 5 years.  All the previous keyboards that I had used ended up with the majority of the legends wearing off and I used to joke that they were security keyboards because way too many people don't know how to touch type lol",
                  "score": 8,
                  "created_utc": 1740518039.0,
                  "replies": []
                },
                {
                  "id": "merfr3x",
                  "author": "Mental_Tea_4084",
                  "body": "Double shot key caps never lose their lettering. That only happens with cheaply made boards",
                  "score": 10,
                  "created_utc": 1740514697.0,
                  "replies": []
                },
                {
                  "id": "meq6woi",
                  "author": "NorCalAthlete",
                  "body": "My S key wore away stupidly fast compared to all prior keyboards I’ve had. It works fine but the enamel / paint / whatever wore away and it’s mostly clear. I use the keyboard for both work and gaming and have a habit of saving constantly so it gets a lot of usage.",
                  "score": 2,
                  "created_utc": 1740502079.0,
                  "replies": [
                    {
                      "id": "meqshmh",
                      "author": "RuneMason1",
                      "body": "Something something don't back down, instead hold w. Haha. Jk.",
                      "score": 7,
                      "created_utc": 1740508178.0,
                      "replies": [
                        {
                          "id": "meqxtkf",
                          "author": "NorCalAthlete",
                          "body": ":( playing helldivers definitely has me backing up more than most other games lol. Getting swarmed and backing up while magdumping / firing nonstop is a frequent occurrence.",
                          "score": 3,
                          "created_utc": 1740509666.0,
                          "replies": [
                            {
                              "id": "mer3m3p",
                              "author": "lonewolf13313",
                              "body": "Retreating?  Thats not very democratic of you.  Off to the freedom camp!",
                              "score": 3,
                              "created_utc": 1740511286.0,
                              "replies": [
                                {
                                  "id": "mer661h",
                                  "author": "NorCalAthlete",
                                  "body": "It’s not retreating! It’s tactically increasing the number of shots the arc thrower can fire thus increasing the number of undemocratic bugs I can kill at a time.",
                                  "score": 2,
                                  "created_utc": 1740512006.0,
                                  "replies": [
                                    {
                                      "id": "mev9knw",
                                      "author": "Ezures",
                                      "body": "Right! Advancing backwards increases the engagement time, which means more time for democracy's weapons to be effective. \n\nTotally Brass approved!",
                                      "score": 1,
                                      "created_utc": 1740568875.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "meqybfm",
                              "author": "RuneMason1",
                              "body": "Indeed. Haven't played much of it but I can imagine that being the case",
                              "score": 2,
                              "created_utc": 1740509805.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "meqrz7g",
                  "author": "Snowleopard1469",
                  "body": "I don't know if you have experienced this, but i just got the g915 keyboard, and it's doing double presses of some buttons like S.  It's really annoying. My old one didn't used to do this.",
                  "score": 1,
                  "created_utc": 1740508036.0,
                  "replies": []
                },
                {
                  "id": "mer1eh0",
                  "author": "Pretty_Wonder_3927",
                  "body": "In that case maybe get a keyboard with swappable key caps next time. That way you can easily replace the key caps when the writing is worn off.",
                  "score": 1,
                  "created_utc": 1740510669.0,
                  "replies": [
                    {
                      "id": "mes4ir1",
                      "author": "skorps",
                      "body": "G915 keyboard has replaceable caps but they are non-standard. I got some third party ones because the caps break easily and my cats like to knock my stuff around. I’ve been happy with the board in general but the caps are a weak point",
                      "score": 1,
                      "created_utc": 1740521665.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mes04sr",
                  "author": "enraged768",
                  "body": "The only keyboard that I've owned were this didn't happen was a mionix zibal keyboard but this keyboard wasn't for everyone you had to really type no half ass keypressin I actually think it improved my typing but again wasn't the most enjoyable experience in the beginning. It was built like a damn tank though.",
                  "score": 1,
                  "created_utc": 1740520401.0,
                  "replies": []
                },
                {
                  "id": "mesaigg",
                  "author": "kepaa",
                  "body": "I have the Logitech full size g keyboard.  I love it.  Only problem is the 6 on the num pad doesn’t work.  I could have gone with a return, but I was lazy.  I just use the other 6",
                  "score": 1,
                  "created_utc": 1740523430.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mernukl",
              "author": "Pingondin",
              "body": "The last good Logitech gaming mouse I had was the original G5. I got a G500 that started double clicking after 18 months, it was replaced under warranty by Logitech with a G500s, same problem after 2 years. Then I got a G502s which also started double clicking after less than 6 months... I gave up and stopped buying Logitech mice.",
              "score": 1,
              "created_utc": 1740516964.0,
              "replies": []
            },
            {
              "id": "mes7q9z",
              "author": "aberrod",
              "body": "Jesus christ, I'm happy to see at least one other person with the same problems I've had with Logitech.  My experience with them for mice, and headsets for years was absolute garbage.  Multiple G series mice a year, multiple headsets a year, and every time I've complained about it on the internets, its always \"WTF logitech is made of adamantium bro.\"",
              "score": 1,
              "created_utc": 1740522603.0,
              "replies": [
                {
                  "id": "meueuw1",
                  "author": "PM_ME_ONE_EYED_CATS",
                  "body": "I used to always buy Logitech, but after the constant breaking down of mice and keyboards it’s just not worth the hassle.",
                  "score": 2,
                  "created_utc": 1740550890.0,
                  "replies": []
                },
                {
                  "id": "mfemkdk",
                  "author": "Zeraru",
                  "body": "Logitech is on my shit list for all the hardware faults, feature removals and straight up deception I've experienced across their product lineup in the last decade. \nBefore that they were fine.",
                  "score": 2,
                  "created_utc": 1740820471.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mer4vc9",
              "author": "oldbern",
              "body": "You click with your mouse? In this economy?",
              "score": 0,
              "created_utc": 1740511641.0,
              "replies": []
            },
            {
              "id": "meq7fam",
              "author": "thesaltystaff",
              "body": "I mean, on the other end of the spectrum, I've had a G903 for 6 years, and the only issue I've had is one of the side buttons and the right-click started double-clicking last year. $25 and about 30m of repair work and it's good as new, but dirty. \n\nI only wish that the g700s was as modular on the inside. I was rustier with my soldering iron skills back then and ended up frying the board for the left mouse-click, otherwise I never would have replaced it.\n\nEventually I may replace the internal battery, but it still lasts several days of me using it 3-ish hours per day. I may pick up the mat instead...",
              "score": 0,
              "created_utc": 1740502225.0,
              "replies": [
                {
                  "id": "meqmiet",
                  "author": "ChoMar05",
                  "body": "5 years till failure (or requiring a soldering iron) still isn't a quality item or the other end of the spectrum, though. I mean, the G903 seems to have fallen in price quite a bit, but it's still double the price of a keychron. And on the other end of the spectrum is my MX Master which is still in regular office use. Logitech quality has fallen drastically in recent years while the price hasn't.",
                  "score": 4,
                  "created_utc": 1740506490.0,
                  "replies": [
                    {
                      "id": "meqr0gr",
                      "author": "thesaltystaff",
                      "body": "The G903 is all plug and play daughter boards for the buttons, the soldering iron comment was specifically the G700s. And when you can *usually* find it on sale for ~$50 or in my case, $30 new, it's a pretty good deal IMO.\n\nAlso, with the tiniest bit of digging, the expected life expectancy of a mouse is 2-5 years. With mine hitting the top end (and I anticipate outlasting it) I'm pretty happy with it.",
                      "score": 1,
                      "created_utc": 1740507766.0,
                      "replies": [
                        {
                          "id": "meuosn5",
                          "author": "ChoMar05",
                          "body": "The life expectancy of mice doesn't have to be 2-5 years. Thats just for the \"Premium gamer market\" and \"Designer market\" where people have lots of disposable income and are willing to spend it. The cheapest Office mice usually last 5 years and when they fail its usually due to the cable breaking. Older gaming mice or wireless mice usually just don't fail, especially if they have replaceable batteries. And it's not like they fail because the high-end premium sensor or something is on the edge of what is technologically possible. They fail because the tac-switches, a cheap, well developed item, are of the lowest quality possible, maybe even designed to fail. As I said, I still have an MX Master and all my previous gaming and office mice (all logitech, including 2 MX 1000 which I still have somewhere) were retired after 7 years or so because I wanted something new, not because they broke. And yeah, it's not just logitech. But if I have to deal with enshittification and possible designed obsolescence, I'm going with the cheapest option, and that's never logitech.",
                          "score": 1,
                          "created_utc": 1740556423.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "merdmvs",
          "author": "toomuchsoysauce",
          "body": "Same except with the G502x. It's been a godsend. Before I'd have to remember to charge the mouse at night but now I completely ignore/forget about it. I also like how they include the hard and soft surface as I find myself rotating pretty regularly.",
          "score": 5,
          "created_utc": 1740514100.0,
          "replies": []
        },
        {
          "id": "meqlryi",
          "author": "_northernlights_",
          "body": "Exactly me",
          "score": 3,
          "created_utc": 1740506283.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mepwxxb",
      "author": "SoapyMacNCheese",
      "body": "TLDR:\n\n* $20 cheaper\n\n* Includes one mouse pad instead of 2 (no hard pad)\n\n* The charging area goes closer to the corners of the pad\n\n* Not cross compatible with existing powerplay 1 pucks\n\n* Removed the RGB Logitech \"G\" Logo\n\n* Went from Micro USB to a fixed cable\n\n* No more built in Lightspeed mouse dongle\n\nThe loss of the built in dongle is annoying but understandable, they have multiple different lightspeed dongles for their gaming mice now, so whatever they included wouldn't work for everybody. However, they should have added a USB passthrough in its place. Having it use USB-C instead of a fixed cable would have also been better.",
      "score": 183,
      "created_utc": 1740499201.0,
      "replies": [
        {
          "id": "meq4l5y",
          "author": "Psaltus",
          "body": "This is.... Bad.\n\nId rather pay more for more features. Having the built-in light speed dongle was a major selling point in me buying the first mousepad. Having a detachable cable is whatever, but at least it makes it fixable if the cable ever breaks.\n\nThis is by-and-large a downgrade. They shouldn't call this a \"2\", they should call this a \"lite\"",
          "score": 92,
          "created_utc": 1740501420.0,
          "replies": [
            {
              "id": "mes8eay",
              "author": "Bucket81",
              "body": "I bet they are doing this for comparability. If they come out with better connectivity in a dongle it will work with the pad. But it should be cheaper...",
              "score": 9,
              "created_utc": 1740522801.0,
              "replies": [
                {
                  "id": "meweudu",
                  "author": "SoapyMacNCheese",
                  "body": "That's exactly what it is about I think. They've already come out with better connectivity in the form of the Pro Lightspeed receiver. It provides up to 8khz polling rate for some of their higher end gaming mice, but I don't think it is backwards compatible with regular lightspeed mice. So they'd either have to build multiple variants of the powerplay for the different connectivity methods or include multiple receivers in the pad with a toggle between them. Removing the feature was the cleaner (and cheaper) solution for them, especially when you consider all the tech support mess it would cause for them when little Timmy buys the wrong one or has the toggle set wrong for their mouse.\n\nHowever, they easily could have just put a USB port on the powerplay for you to easily plug your mouse's receiver into as a middle ground solution. Practical and Future proof.\n\nThis things should at least be $30 cheaper than the outgoing model IMO with all the cost savings they've done.",
                  "score": 3,
                  "created_utc": 1740584185.0,
                  "replies": [
                    {
                      "id": "mforboz",
                      "author": "cloud9ineteen",
                      "body": "It is definitely $30 cheaper if not more, just not to the end customer.",
                      "score": 1,
                      "created_utc": 1740956578.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzwzwby",
          "author": "Azuvector",
          "body": "I agree that the dongle/puck compatibility being able to be changed independently of the power play charger is probably a necessary thing. (That said, fairly inexcusable that they couldn't just have a USB C port on the powerplay hardware that you could plug your dongle into there.)\n\nHaving a built in USB cable instead of a port to plug into is an iffy decision as well. Usually a hallmark of lower quality products. That said, it's not terrible, and getting away from micro USB is a good thing. Just wish it'd gone USB C instead.\n\nPersonally, I switched to hard mouse pads years ago and have never looked back, so while I don't mind the inclusion of only a soft pad, they don't clearly indicate a compatible hard pad to use instead (as an add on accessory instead), which is a problem for me.\n\nThe rest sounds good, but those aren't minor issues.",
          "score": 2,
          "created_utc": 1750958196.0,
          "replies": [
            {
              "id": "mzx567f",
              "author": "SoapyMacNCheese",
              "body": "yes at very least they should offer a compatible hard pad as an addon. Most people probably used the soft pad so it makes sense not to pack in both and have to build it into the price.\n\nThe way they've handled that along with the way they've gone about all these other changes (remove the built in dongle but not add a USB for the passthrough, remove microUSB but go with a fixed cable instead of USB-C) screams that this is primarily a cost cutting update and they aren't passing much of the savings on to the consumer.\n\nGranted maybe this is just them trying to keep up with inflation without having to increase the cost for the consumer, but it still leaves a bad impression.",
              "score": 1,
              "created_utc": 1750959628.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mepmzmx",
      "author": "RollingThunderPants",
      "body": "I mean, why make something so good you won't have to replace it for years when you can just make schlock that has to be replaced all the time?",
      "score": 236,
      "created_utc": 1740496245.0,
      "replies": [
        {
          "id": "mepongh",
          "author": "Silegna",
          "body": "I'm still using a Logitech Mouse I bought in 2013...a simple USB mouse. It has had zero issues.",
          "score": 69,
          "created_utc": 1740496755.0,
          "replies": [
            {
              "id": "mepp9ra",
              "author": "SwrdBreak",
              "body": "Yeah not all companies caught on back then, now they all make cheap shit that breaks they all got the memo.",
              "score": 39,
              "created_utc": 1740496942.0,
              "replies": [
                {
                  "id": "meppjns",
                  "author": "Silegna",
                  "body": "Hell, I still have an old Logitech USB Gamepad from that time, and it *still* works. No contact issues, no drift.",
                  "score": 9,
                  "created_utc": 1740497025.0,
                  "replies": [
                    {
                      "id": "mepprbh",
                      "author": "SwrdBreak",
                      "body": "Yeah honestly logitech made alot of good solid products.  Even today i still consider them a good manufacturer.  But like all companies, they have to cut somewhere to get more money.",
                      "score": 7,
                      "created_utc": 1740497088.0,
                      "replies": [
                        {
                          "id": "mepzc9b",
                          "author": "drmirage809",
                          "body": "They still make rock solid peripherals. My old G502 lasted me 10 years and they apparently still make the exact same mouse. So I just bought another one.",
                          "score": 2,
                          "created_utc": 1740499905.0,
                          "replies": [
                            {
                              "id": "meus77q",
                              "author": "afterworld2772",
                              "body": "Counterpoint. I've had 2 G502 mice and they both got double click issues within 3 years each",
                              "score": 1,
                              "created_utc": 1740558457.0,
                              "replies": []
                            },
                            {
                              "id": "mzx0xrl",
                              "author": "Azuvector",
                              "body": "I also had a G400 for years, as well as an MX500 and MX518.\n\nConversely, I've had 2 G 502 Xs that I've had to warranty within six months. (The scroll wheel has a rubber tire/band around it for traction, that can get deformed and start impinging against the chassis, preventing it from turning.)",
                              "score": 1,
                              "created_utc": 1750958476.0,
                              "replies": []
                            },
                            {
                              "id": "meqjb0w",
                              "author": "rtb001",
                              "body": "The wireless G604 is my goto productivity mouse thanks to its long battery life and copious buttons,  but sadly Logi discontinued that mouse and has not released a replacement unlike the wired G502 which has been kept on production for more than a decade now",
                              "score": 1,
                              "created_utc": 1740505595.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mepuzly",
                  "author": "danny12beje",
                  "body": "Dunno. Logitech mice seem to hold up really well with time. Even the new ones, I can't feel anything different in terms of build quality (comparing Mx Master 3 to a 3s, g502 wired to wireless).",
                  "score": 11,
                  "created_utc": 1740498631.0,
                  "replies": [
                    {
                      "id": "meqipxv",
                      "author": "HakimeHomewreckru",
                      "body": "I was a big Logitech fanboy since the mx510. Had 3 newer mice break in just 2 years. They replaced my Mx master 3s just last week because the clicks weren't registering anymore. Had a g502 dongle melt to a liquid in the socket. I pulled it out with the plastic hardened in the shape of the usb. The quality is much lower but at least they still offer good service.",
                      "score": 8,
                      "created_utc": 1740505430.0,
                      "replies": [
                        {
                          "id": "meqlr7g",
                          "author": "gounatos",
                          "body": "That was my experience too. Mice would start double clicking in the two year mark. Unacceptable really for 80-100 euro Mice. Stopped buying them after the third one.",
                          "score": 8,
                          "created_utc": 1740506277.0,
                          "replies": [
                            {
                              "id": "meruauj",
                              "author": "kooldude700",
                              "body": "Yeah unfortunately they use a stupid switch in some of their popular high end mice models that just ends up double clicking. \n\nHave never had the issue happen to me (mx vertical and m720 triathlon) but have had a friend with the old g502 and sibling with the mx anywhere 3 who got that issue",
                              "score": 3,
                              "created_utc": 1740518766.0,
                              "replies": []
                            },
                            {
                              "id": "merbdjl",
                              "author": "nathism",
                              "body": "I made work buy the two I've had over 10 years.  The first still worked but I figured I should get a new one before it died.",
                              "score": 3,
                              "created_utc": 1740513464.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "meqaanf",
                  "author": "SmokelessSubpoena",
                  "body": "Idk, Glorious makes some really solid products, same with Ducky, but I tend to avoid major name brands for this exact issue.",
                  "score": 1,
                  "created_utc": 1740503039.0,
                  "replies": []
                },
                {
                  "id": "mesnhvy",
                  "author": "Warskull",
                  "body": "I don't think I've ever replaced a Logitech mouse due to it breaking. Their stuff lasts.\n\nMy M705 is 6.5 years old and just as good as when I bought it. The thing runs for an absurd amount of time on two AA batteries, I think I replaced them 3 times. My G502 lasted 5 years and only got replaced because they made a new wireless version in 2019, the wheel still worked but was showing some wear. My G502 wireless lasted another 5 years and got replaced because the newer version was on sale that had some upgrades like lower weight. I had Logitech mice before that and I can't recall a single one failing. I end up buying a new mouse for other reasons before they do.\n\nIn comparison Razer mice had about a 2 year lifespan before they started having major issues, sometimes sooner. Back then you didn't have a choice, the OG Deathadder's sensor was so much better than the competition you just dealt with it.\n\nCheap products that fall apart is not one of Logitech's flaws.",
                  "score": 0,
                  "created_utc": 1740527554.0,
                  "replies": []
                },
                {
                  "id": "meqj2hu",
                  "author": "Oops_I_Cracked",
                  "body": "I have 2 Logitech mice that are roughly 3 and 5 years old and work as well as the day I bought them. I’ve had issues with longevity from *other* brands, including Razer and Corsair, but even new Logitech stuff has proven resilient in my experience.",
                  "score": 0,
                  "created_utc": 1740505528.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "meqe7gm",
              "author": "nagi603",
              "body": "And sadly none of their newer mice have that kind of staying power. (And then there is the software, of course)",
              "score": 8,
              "created_utc": 1740504152.0,
              "replies": []
            },
            {
              "id": "meqfy1t",
              "author": "b20015",
              "body": "Got you beat, bought a cordless Logitech MX Laser in 2005 from Fry’s Electronics. It was like $125 or $150, their big flagship mouse around that time. It is still my main mouse in my office, still a fantastic functional device, though the cradle charger is finicky as we move into our 20th year here.",
              "score": 2,
              "created_utc": 1740504644.0,
              "replies": [
                {
                  "id": "meqn38n",
                  "author": "In-All-Unseriousness",
                  "body": "The Logitech MX1000 mouse is literally military grade. While I've replaced it ages ago for PC gaming with a G402, I still use it for my laptop because I can't stand touchpads. Battery still holds like new, but yeah, the charger needs fiddling around.\n\nI bought it around the same period as you, but I got it along with the MX5000 keyboard. Sadly the keyboard doesn't really hold up, because with the introduction of Win7 it was lagging and losing connection a lot.\n\nThey honestly don't make electronics like they used to, now it's all designed to fail within 3 or 5 years.",
                  "score": 1,
                  "created_utc": 1740506655.0,
                  "replies": [
                    {
                      "id": "meqy1hs",
                      "author": "b20015",
                      "body": "Same experience, use it the same way, with my work laptop in my home office. It holds a charge forever. It was one of my first adult purchases where I bought the best one available and it’s held up amazingly.",
                      "score": 1,
                      "created_utc": 1740509727.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mepxl83",
              "author": "LtRapman",
              "body": "Mine is from 2006.",
              "score": 1,
              "created_utc": 1740499391.0,
              "replies": []
            },
            {
              "id": "meqk59k",
              "author": "Strongit",
              "body": "Still have my Logitech G9 from 18 years ago, still works without an issue",
              "score": 1,
              "created_utc": 1740505828.0,
              "replies": []
            },
            {
              "id": "meqt106",
              "author": "getmoneygetpaid",
              "body": "I'm on my 9th Logitech replacement since 2013 under warranty. They're wireless, but the wireless part never fails.\n\nOn the 603, the wheel click failed every time.\n\nOn the Pro X Super light, on half of them, the wheel click stopped. On all of them, the white paint finish peeled in the exact same spot under my little finger.\n\nI'm a digital designer so we use middle click-and-hold a LOT for panning around design documents.\n\ntl;Dr Logitech quality sucks but their replacement policy is legit.",
              "score": 1,
              "created_utc": 1740508331.0,
              "replies": [
                {
                  "id": "mer7qxy",
                  "author": "306bobby",
                  "body": "I have loved my razer mice, but my friends hyped up logi\n\nGot myself a g502, and it's been an **ok** mouse, but is already showing more wear than my 5 year old razer.\n\nIdk if I bought at the wrong time, got a dud, or this is a trend, but it's caused me to hold off on buying Logitech again",
                  "score": 1,
                  "created_utc": 1740512453.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mepzfp0",
          "author": "FightOnForUsc",
          "body": "I’ve had an MX Master 3 for 5 years and it’s the best mouse I’ve ever used and I have 0 issues with it",
          "score": 11,
          "created_utc": 1740499931.0,
          "replies": [
            {
              "id": "meq0y7e",
              "author": "narwhal_breeder",
              "body": "I just had to take my 3S apart after a year and replace the mouse one button via hot air desoldering. Its a common issue and Logitec does not sell replacement mouse 1 boards.\n\nLogitec uses the Panasonic EVQ-P0D07K as its mouse one button - its rated to 1 Million presses, which is 5-10 times less than the switches other mouse companies use, and you can *easily* exceed it with daily use after a year or two.\n\nI replaced it with a Kalih switch, which cost $0.29, that is rated for 10M presses. The difference in price between a 10M rated a 1M rated switch is often less than 5 cents at volume, 8 cents for a 20M rated switch.\n\nFinding that out thats the level of cost cutting, on Logitechs $100 premium mouse, is definitely a reason why I won't ever be buying another one.\n\nCounting down the days until the magnetic scroll wheel patents expire.",
              "score": 14,
              "created_utc": 1740500372.0,
              "replies": [
                {
                  "id": "mesjkto",
                  "author": "ABetterKamahl1234",
                  "body": "> Finding that out thats the level of cost cutting\n\nNGL, that sounds like *most* cost cutting to me. You might be surprised how many cut costs are just shaving pennies per unit, simply because at volume it might save tens or hundreds of thousands a month.",
                  "score": 1,
                  "created_utc": 1740526265.0,
                  "replies": [
                    {
                      "id": "mesm3f8",
                      "author": "narwhal_breeder",
                      "body": "I am very aware - I work in the consumer electronics space. \n\nWhen you are cost cutting, you are usually trying to reduce costs that *don't impact the functionality of targeted longevity of the device*, with your efforts scaled to where the product is in the lineup (a shitty switch is probably OK in the cheapest $5 mouses available). \n\nIts generally expected that consumer electronics products that cost more *last longer* \\- making them survive just past the warranty period is a great way to earn short term profits at the expense of your brand image, which takes many years to build in the first place.",
                      "score": 2,
                      "created_utc": 1740527092.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "meq621v",
              "author": "judokalinker",
              "body": "I love my Logitech revolution/Master nice, but after awhile the rubber on the scroll wheel always starts to degrade on me.",
              "score": 1,
              "created_utc": 1740501837.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mepvazb",
          "author": "architect___",
          "body": "Uninformed comment. The new PowerPlay is backwards compatible, and the old one is reliable. I'm still using mine. Heck, I tore it down to its PCB and coils so I could use it under a larger mousepad, and it's still performing flawlessly.\n\nI agree there are at least 3 obvious improvements that could/should have been made to PowerPlay 2, but I will admit I never expected the price to come down. Really, they just shouldn't treat this like a new product. It's the same thing, just slightly thinner, cheaper, and it doesn't come with the hard surface option.",
          "score": 13,
          "created_utc": 1740498725.0,
          "replies": [
            {
              "id": "meqn8iq",
              "author": "parisidiot",
              "body": "hmm, this article says the puck isn't compatible between versions. you tested it yourself i'm guessing?",
              "score": 1,
              "created_utc": 1740506696.0,
              "replies": [
                {
                  "id": "meqqpej",
                  "author": "architect___",
                  "body": "[Official product page](https://www.logitechg.com/en-us/products/gaming-mouse-pads/powerplay-2.947-000001.html) and description of their [YouTube video](https://www.youtube.com/watch?v=3QCNDfWjljQ).",
                  "score": -2,
                  "created_utc": 1740507678.0,
                  "replies": [
                    {
                      "id": "merl5kz",
                      "author": "SpellingPhailure",
                      "body": "You are misreading it. The previously power play compatible mice are compatible with power play 2, the coins are not. It even says as much in the FAQ.",
                      "score": 6,
                      "created_utc": 1740516221.0,
                      "replies": [
                        {
                          "id": "merntc8",
                          "author": "architect___",
                          "body": "Gotcha. Interesting detail, although it doesn't change the fact that it still works with all previous products, meaning it's not about making you buy the new version like the uninformed commenter said.",
                          "score": -3,
                          "created_utc": 1740516954.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "meq09h2",
          "author": "newhereok",
          "body": "I think you just described why",
          "score": 1,
          "created_utc": 1740500172.0,
          "replies": [
            {
              "id": "meq7025",
              "author": "RollingThunderPants",
              "body": "And therein lies the humor",
              "score": 1,
              "created_utc": 1740502105.0,
              "replies": [
                {
                  "id": "meqaqjw",
                  "author": "newhereok",
                  "body": "Woosh for me, not for thee",
                  "score": 2,
                  "created_utc": 1740503166.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "meugwjv",
          "author": "-Badger3-",
          "body": "I just replaced my G502 after several years and the cables on the new ones aren’t braided anymore.",
          "score": 1,
          "created_utc": 1740551970.0,
          "replies": []
        },
        {
          "id": "meqvx76",
          "author": "FlyingBishop",
          "body": "The whole point of the mousepad is so you don't have to change the batteries all the time. If you have to replace the mousepad more often than the mouse it is a total waste of money.",
          "score": 1,
          "created_utc": 1740509139.0,
          "replies": []
        }
      ]
    },
    {
      "id": "meq0w01",
      "author": "whatmakesagoodname",
      "body": "“Now my mouse requires two USB ports” - the future is stupid",
      "score": 16,
      "created_utc": 1740500354.0,
      "replies": []
    },
    {
      "id": "met2n1i",
      "author": "None",
      "body": "I can't trust Logitech for anything anymore. Even their g502 falls apart faster and faster every generation. Garbage company that produces plastic garbage that falls apart",
      "score": 5,
      "created_utc": 1740532482.0,
      "replies": [
        {
          "id": "mzxxd6y",
          "author": "nikkog28",
          "body": "old g502 lasted me 6 years before the rubber started disintegrating. Current, more expensive G502 X Plus lasted 2 years before the rubber started disintegrating with the added bonus of the side buttons double clicking on a mouse with \"double click proof\" main buttons. Sorry for reviving a dead post but im so annoyed.",
          "score": 1,
          "created_utc": 1750967697.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mepv0wu",
      "author": "None",
      "body": "This seems to be happening with a lot of their product. They don't realize there are other companies more than willing to fill the space when gamers get tired of it.",
      "score": 9,
      "created_utc": 1740498641.0,
      "replies": []
    },
    {
      "id": "meqej4o",
      "author": "Elios000",
      "body": "and its fail.  taking the TX out and not having USB C on the pad HARD PASS",
      "score": 4,
      "created_utc": 1740504243.0,
      "replies": []
    },
    {
      "id": "mer7d8m",
      "author": "Crazy_Passage_8553",
      "body": "I’ve had power play for 5 years with no issues. Love it!",
      "score": 3,
      "created_utc": 1740512346.0,
      "replies": []
    },
    {
      "id": "meqc3x2",
      "author": "StanielReddit",
      "body": "Anybody have any suggestions for non Logitech, Razer, SteelSeries, etc. “gAmInG” mice?  I bought a Logitech G602 which had 6 thumb buttons (great not only for gaming, but for spreadsheet shortcuts like copy/paste/enter/tab).  This mouse was shit from the start (battery draining after only a couple days) and Logitech support could not help resolve the issue.  They then sent me a free G604 which was their new version of the same G602.  4 years later, all the rubber has peeled off the mouse (which is a super common issue) and now they don’t make any such mouse with 6 thumb buttons.  They make other mice that have 10-12 buttons, but that’s unnecessary in my case.  I only really want 6.   \n\nThe same is true of other companies as well.  It seems like they either make mice with 2-4 thumb buttons, or 10+ buttons.  Any lesser known reputable brands out there that might solve my issues?  I’ve also has several Logitech and SteelSeries “gaming” keyboards that have built in macro functions—all have been junk in terms of longevity, but I’m aware of alternatives that are much better like Keychron (which is where I’m headed when my current SteelSeries shits the bed).\n\nDo such niche companies exist for mice as well or am I screwed?",
      "score": 5,
      "created_utc": 1740503556.0,
      "replies": [
        {
          "id": "mesi1c9",
          "author": "img_tiff",
          "body": "r/MouseReview. Might become a new obsession.",
          "score": 2,
          "created_utc": 1740525779.0,
          "replies": []
        },
        {
          "id": "merham9",
          "author": "SephYuyX",
          "body": "Microsoft and Dell mice are excellent.",
          "score": 0,
          "created_utc": 1740515133.0,
          "replies": []
        },
        {
          "id": "mevckv5",
          "author": "DogAteMyCPU",
          "body": "Lamzu and pulsar are pretty good newcomers and have great prices",
          "score": 0,
          "created_utc": 1740570417.0,
          "replies": []
        }
      ]
    },
    {
      "id": "meppv0e",
      "author": "Less_Party",
      "body": "The whole charging mat thing just seems like a solution in search of a problem considering I need to charge my mouse like once every 3 months. I guess ultralight gaming mice are in fashion right now so maybe this will let those get away with smaller/lighter batteries but at that point just go back to a wired mouse so you can have no battery whatsoever.",
      "score": 23,
      "created_utc": 1740497119.0,
      "replies": [
        {
          "id": "mepq4q6",
          "author": "FreddyVanJeeze",
          "body": "Yeah I think it's targeted to gamers. I have a g502x and I need charging every 1-2 days",
          "score": 25,
          "created_utc": 1740497198.0,
          "replies": [
            {
              "id": "meps3uv",
              "author": "itsVanquishh",
              "body": "I’ve got the glorious model-o wireless and even with rgb off I’m charging this thing every 2 days. What’s even crazier is the only game I play is Black Ops 6… with a controller.. the only use the mouse gets is in between matches when scrolling discord or YouTube…",
              "score": 3,
              "created_utc": 1740497785.0,
              "replies": [
                {
                  "id": "meptw88",
                  "author": "Aviel5990",
                  "body": "Then you should lower your mouse Herz. The higher the number the more battery it will drain",
                  "score": 4,
                  "created_utc": 1740498311.0,
                  "replies": [
                    {
                      "id": "mer0jm9",
                      "author": "CrapsLord",
                      "body": "The mice might die if you lower its Herz",
                      "score": 1,
                      "created_utc": 1740510428.0,
                      "replies": [
                        {
                          "id": "mezdyvq",
                          "author": "twirling-upward",
                          "body": "Die, Bart, Die",
                          "score": 1,
                          "created_utc": 1740614662.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mepv3pl",
              "author": "danny12beje",
              "body": "Mx master 3. I charge it every 2 months.",
              "score": 7,
              "created_utc": 1740498663.0,
              "replies": [
                {
                  "id": "mer276g",
                  "author": "BevansDesign",
                  "body": "Exactly the same for me. I have no idea *what* a mouse is doing that it needs to be on a pad that is constantly charging it. No game needs the precision that some of these \"gamer\" mice offer. You don't need atomic-scale movement scanning.",
                  "score": 1,
                  "created_utc": 1740510891.0,
                  "replies": [
                    {
                      "id": "merzm19",
                      "author": "peoplejustwannalove",
                      "body": "Truth be told, while I haven’t tested, it’s probably best for their ultralight mice, since there is no way those mice have great battery life. Had my charge pad and a g502 since 2020, and swapped to the pro x 2, since I was getting conscious about how much gunk a g502 collects",
                      "score": 1,
                      "created_utc": 1740520254.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mepwufp",
                  "author": "User9705",
                  "body": "Same, ultimate mode for work and play",
                  "score": 1,
                  "created_utc": 1740499172.0,
                  "replies": [
                    {
                      "id": "mepxfth",
                      "author": "danny12beje",
                      "body": "Ikr. \n\n\nIt's comfortable and I can switch from PC to work laptop in a click whenever needed. Love it.",
                      "score": 2,
                      "created_utc": 1740499347.0,
                      "replies": []
                    },
                    {
                      "id": "mevf2zs",
                      "author": "ShoebarusNCheverlegs",
                      "body": "You actually use it for gaming? It’s an incredible mouse for work but seems way too heavy to game. I’ll have to give it a try tho.",
                      "score": 1,
                      "created_utc": 1740571610.0,
                      "replies": [
                        {
                          "id": "mevf7jw",
                          "author": "User9705",
                          "body": "lol heavy? Depends maybe on what gaming you do. But has been great for my needs.",
                          "score": 1,
                          "created_utc": 1740571669.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "meqf6pd",
              "author": "Elios000",
              "body": "you can extend that lot but turning down the reporting speed btw",
              "score": 2,
              "created_utc": 1740504429.0,
              "replies": []
            },
            {
              "id": "mepwwq5",
              "author": "WynterKnight",
              "body": "I just got my first wireless gaming mouse, a razer basilisk pro of some sort.\n\nI am amazed that it only needs an hour or two of charging each week, and I'm on my PC 5-8 hours a day gaming.\n\nI was super worried about battery inconvenience, but I literally move the cord from my Ps5 controller to the mouse before I go to work one day a week and I never even come close to running out of battery.",
              "score": 1,
              "created_utc": 1740499191.0,
              "replies": []
            }
          ]
        },
        {
          "id": "meprowg",
          "author": "None",
          "body": "[deleted]",
          "score": 19,
          "created_utc": 1740497661.0,
          "replies": [
            {
              "id": "mepuceo",
              "author": "Less_Party",
              "body": "Ah yeah fair enough.",
              "score": 5,
              "created_utc": 1740498443.0,
              "replies": []
            },
            {
              "id": "mepxnsa",
              "author": "Atalantius",
              "body": "Isn’t that what mouse bungees were for? Arguably I play relatively high-sens so I don’t move the mouse much",
              "score": 3,
              "created_utc": 1740499413.0,
              "replies": [
                {
                  "id": "meq68we",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1740501891.0,
                  "replies": [
                    {
                      "id": "mesbnp1",
                      "author": "Atalantius",
                      "body": "Huh. I’ve been using Deathadders since forever, might switch to a Mamba or something.",
                      "score": 1,
                      "created_utc": 1740523776.0,
                      "replies": [
                        {
                          "id": "meurc07",
                          "author": "IIlIIlIIlIlIIlIIlIIl",
                          "body": "There's wireless DeathAdders.",
                          "score": 2,
                          "created_utc": 1740557926.0,
                          "replies": [
                            {
                              "id": "mfa9brl",
                              "author": "Atalantius",
                              "body": "wait rly? Dang, I might switch",
                              "score": 1,
                              "created_utc": 1740763998.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mepwe5h",
          "author": "architect___",
          "body": "Wrong. The only way mice can need such seldom charging is by using tech with a low polling rate, like Bluetooth. It works fine for office work, but it's terrible for gaming as it adds a ton of latency.\n\nGaming mice use 2.4 GHz for the connection because it has the same latency as a wired connection, but as a consequence it drains battery far faster. Gaming mice, when used on that spectrum, drain battery in a matter of days, not weeks or months. PowerPlay is absolutely a creature comfort, but so is having a decent mouse in the first place. It means you will never accidentally be stuck having to play wired, swap a battery, or take a break to charge.",
          "score": 9,
          "created_utc": 1740499039.0,
          "replies": [
            {
              "id": "meq071v",
              "author": "TrptJim",
              "body": "There are mice out there with decent battery life and good performance. The Logitech G305 lasts quite a long time on a AA battery with a 1000hz polling rate.",
              "score": 2,
              "created_utc": 1740500153.0,
              "replies": [
                {
                  "id": "meqr8ls",
                  "author": "architect___",
                  "body": "> Logitech G305\n\n250 hours according to Logitech. I agree that's decent, although it would need changed every 20-25 days if you use it for work plus casual gaming. Still, it doesn't change the fact that you'll have to stop and change a battery, which may mean running around your house or going to the store to buy one. Yeah it's not the end of the world, but my point is the convenience of PowerPlay is that you will never, ever, ever be interrupted with that type of thing.",
                  "score": 1,
                  "created_utc": 1740507830.0,
                  "replies": []
                },
                {
                  "id": "meuf7lv",
                  "author": "puffbro",
                  "body": "It’s quite heavy with AA though.",
                  "score": 1,
                  "created_utc": 1740551073.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "meurj8k",
              "author": "IIlIIlIIlIlIIlIIlIIl",
              "body": ">Gaming mice use 2.4 GHz for the connection because it has the same latency as a wired connection\n\nI do wonder how latency is impacted when you're using multiple wireless peripherals that use 2.4GHz but are incompatible (such as from different brands.\n\nSurely there's gotta be some downside to having a wireless mouse, keyboard, headset, and your WiFi's 2.4 band running at the same time.",
              "score": 1,
              "created_utc": 1740558047.0,
              "replies": [
                {
                  "id": "mevx512",
                  "author": "architect___",
                  "body": "Yeah, you'd think so. Sounds like something you could probably figure out by googling it, or looking at patents. Maybe asking Grok or something",
                  "score": 0,
                  "created_utc": 1740578581.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mepy0bt",
          "author": "kenpurachicken",
          "body": "I have a wireless gaming mouse that has a charging dock. It gets placed on the dock when not in use and battery life has never been an issue. I like wireless peripherals because I don’t like wires on the desk. The Powerplay and similar products have never made sense to me.",
          "score": 2,
          "created_utc": 1740499516.0,
          "replies": []
        },
        {
          "id": "mepzz2w",
          "author": "drmirage809",
          "body": "That’s what I do. Wired mouse will never run out of batteries.",
          "score": 2,
          "created_utc": 1740500087.0,
          "replies": []
        }
      ]
    },
    {
      "id": "meq8mol",
      "author": "Ascian5",
      "body": "As an old man, they've been doing this for the last 25 years across their entire portfolio. Nothing new here. There are some nice products here and there, but you can do so much better, for so much less, and without all the invasive software that these big brands and \"gamer gear\" have.",
      "score": 2,
      "created_utc": 1740502564.0,
      "replies": []
    },
    {
      "id": "meqcqn0",
      "author": "Supermkcay",
      "body": "I had one, and it didn't last.",
      "score": 2,
      "created_utc": 1740503734.0,
      "replies": []
    },
    {
      "id": "mern028",
      "author": "luttman23",
      "body": "Now requires 2 USB slots. No more wireless mouse receiver built in, so it requires two full-size USB, one for the fixed cable pad and one for the mouse’s dongle. Nah.",
      "score": 2,
      "created_utc": 1740516732.0,
      "replies": [
        {
          "id": "meuta86",
          "author": "IIlIIlIIlIlIIlIIlIIl",
          "body": "They should have at least made it a 1-port hub do you could plug your own receiver in (though not sure if tjay would have been cheaper than integrating it).",
          "score": 2,
          "created_utc": 1740559130.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mesnud0",
      "author": "SomeFuckingMillenial",
      "body": "Not having the light speed wireless dongle included is a staggering omission.",
      "score": 2,
      "created_utc": 1740527667.0,
      "replies": []
    },
    {
      "id": "metaeoz",
      "author": "funsized_fireball",
      "body": "This the type of shit that caused Oceangate",
      "score": 2,
      "created_utc": 1740535044.0,
      "replies": []
    },
    {
      "id": "mey8muk",
      "author": "Fiv3Score",
      "body": "Damn that sucks that it's not as good. But this thing is actually available and approved in Canada, unlike the last model. Interesting. I might try it out",
      "score": 2,
      "created_utc": 1740602523.0,
      "replies": []
    },
    {
      "id": "mezv9oz",
      "author": "None",
      "body": "All good products degrade in quality over time instead of improve. The company always wants more profits. Once you have a good selling product with brand recognition, there's no payback in making it \"better\". The easiest way to increase profits is to release a new version that's cheaper to make than the old version. This applies to all products ever.",
      "score": 2,
      "created_utc": 1740620292.0,
      "replies": []
    },
    {
      "id": "mepoy6p",
      "author": "fire2day",
      "body": "Can I get it in Canada this time?",
      "score": 4,
      "created_utc": 1740496845.0,
      "replies": []
    },
    {
      "id": "merjb09",
      "author": "epidemica",
      "body": "The powerplay mat needed no changes. I’ve had mine since launch, and completely forget I have a mouse that has a battery in it. Of course they would bork it up.",
      "score": 2,
      "created_utc": 1740515706.0,
      "replies": [
        {
          "id": "meuco1h",
          "author": "Vinnie_Vegas",
          "body": "I also forgot this, because I feel like I replace the battery in my mouse every 2 years.",
          "score": 1,
          "created_utc": 1740549773.0,
          "replies": []
        }
      ]
    },
    {
      "id": "meqrdix",
      "author": "EverGamer1",
      "body": "Can someone explain to me why there are mouse pads that cost more than 10 bucks? I’ve been using an 8 dollar one for a year now almost every single day and I’ve had no issues, besides a little bit of stretching that doesn’t actually cause issues. I can’t fathom paying more than $10 for a mouse pad, why are there ones that are $50 or more?",
      "score": 1,
      "created_utc": 1740507867.0,
      "replies": [
        {
          "id": "merywsk",
          "author": "gaige23",
          "body": "Um because they’re awesome.",
          "score": 5,
          "created_utc": 1740520057.0,
          "replies": [
            {
              "id": "merz00y",
              "author": "EverGamer1",
              "body": "In what way? They have a nice label?",
              "score": 2,
              "created_utc": 1740520082.0,
              "replies": [
                {
                  "id": "merz9ms",
                  "author": "gaige23",
                  "body": "Bigger. Better materials.",
                  "score": 2,
                  "created_utc": 1740520158.0,
                  "replies": [
                    {
                      "id": "meufkhv",
                      "author": "puffbro",
                      "body": "It’s because there’s electronic inside. You can buying a equivalent Logitech mousepad without power play flow much cheaper.",
                      "score": 1,
                      "created_utc": 1740551260.0,
                      "replies": []
                    },
                    {
                      "id": "merzp15",
                      "author": "EverGamer1",
                      "body": "Which does what? Also I just went on Walmart and they sell massive ones for 11 dollars, or 20 with wrist support.",
                      "score": 1,
                      "created_utc": 1740520277.0,
                      "replies": [
                        {
                          "id": "mes576n",
                          "author": "gaige23",
                          "body": "I mean you spent $8. Why not just use the surface of your desk. Your lap?  An old sheet.",
                          "score": 2,
                          "created_utc": 1740521864.0,
                          "replies": [
                            {
                              "id": "mes5mtn",
                              "author": "EverGamer1",
                              "body": "Would you answer the question of how spending $50 or over on a mouse pad is better? Better at what, appearance?",
                              "score": -5,
                              "created_utc": 1740521991.0,
                              "replies": [
                                {
                                  "id": "mes7pdi",
                                  "author": "Accide",
                                  "body": "They kind of already answered you. Variety of styles and materials you wouldn't find strictly in Walmart. People like what they like.\n\nWhy ever buy clothes from anywhere else when you can get it cheap at Walmart?",
                                  "score": 5,
                                  "created_utc": 1740522595.0,
                                  "replies": [
                                    {
                                      "id": "mesd4le",
                                      "author": "EverGamer1",
                                      "body": "I’m not really judging, I’m just saying that I don’t see much point to the expense. It’d be like buying a backpack for $50 dollars that’ll last 2 years, or a Gucci backpack for a couple thousand that’ll last 2 years. To me it just doesn’t make sense to buy the latter.",
                                      "score": -4,
                                      "created_utc": 1740524225.0,
                                      "replies": [
                                        {
                                          "id": "mesdqem",
                                          "author": "gaige23",
                                          "body": "If it’s about saving money why buy one at all. \n\nIf it’s a matter of worth that’s relative to the individual.",
                                          "score": 2,
                                          "created_utc": 1740524412.0,
                                          "replies": [
                                            {
                                              "id": "mesei4o",
                                              "author": "EverGamer1",
                                              "body": "Well yeah, it’s about benefit measured alongside cost. If the $50 dollar one had a shit ton of things that made it worth it, then I might’ve bought it. But if the 8 dollar one does the same as the 50 dollar one, I don’t see need for the 50 dollar one. It’d be like having a choice between buying 2 exact identical cars but on is a thousand cheaper, there’s no reason not to buy the cheaper one over the more expensive one.",
                                              "score": 0,
                                              "created_utc": 1740524655.0,
                                              "replies": [
                                                {
                                                  "id": "mesjy70",
                                                  "author": "gaige23",
                                                  "body": "You keep projecting your worth to others. That isn’t how it works. \n\nEnjoy your Wal-Mart mousepad and I’ll enjoy my Superlight 2 on Proplay with my LGG Neptune Pro pad. \n\nAgain, different people have different worth values. If we didn’t no one would buy Corvettes since any car with four tires and an engine can get you back and forth.",
                                                  "score": 0,
                                                  "created_utc": 1740526386.0,
                                                  "replies": [
                                                    {
                                                      "id": "meslgq3",
                                                      "author": "EverGamer1",
                                                      "body": "Look, I don’t mean to be projecting worth, I’m projecting that I just don’t get it. Also it isn’t a Walmart mousepad, it was an 8 dollar mouse pad I bought from a razor store at the mall, I asked what was there most 5 dollar mousepad after seeing the price of others and they gave me the one I have now.",
                                                      "score": 2,
                                                      "created_utc": 1740526884.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "meush9g",
                  "author": "IIlIIlIIlIlIIlIIlIIl",
                  "body": "Better materials that:\n\n* Last longer\n* Have less friction, allowing the mouse to glide more smoothly \n* \"Feel\" nicer (subjective)\n* Have better grip to the table\n* You get the option of many more materials that have vastly different feels, such as literal glass pads if that's your style\n\nAlso better construction that:\n\n* Looks nicer/less cheap\n* Doesn't deform as much (edges don't start \"peeling\" up)\n* Lasts longer\n* Gives you more freedom in relation to how thick you want the pad, how squishy/hard, etc.\n* More niche sizing, particularly in the ultra XL space\n\nCheap mats are basically all thin and made out of the same materials. The only change when going for cheap is indeed pretty much just the label, but the options start opening up at the high end.",
                  "score": 1,
                  "created_utc": 1740558630.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mescg6e",
          "author": "bonesnaps",
          "body": "Hardpads are a dream to use compared to shitty cloth mousepads.\n\nI have high quality deskpads I use to dampen the sound of my custom keyboard, but I wouldn't even use those for my mouse lol. Got too used to a good hardpad.",
          "score": 1,
          "created_utc": 1740524017.0,
          "replies": [
            {
              "id": "meseqt5",
              "author": "EverGamer1",
              "body": "Hardness does sound nice, I’d probably pay a bit more for one of those.",
              "score": 1,
              "created_utc": 1740524731.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mepo490",
      "author": "None",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1740496592.0,
      "replies": [
        {
          "id": "mepox07",
          "author": "None",
          "body": "Yes.",
          "score": 1,
          "created_utc": 1740496836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "meqksg9",
      "author": "shafe123",
      "body": "On a related note, any suggestions for a mouse similar to the G903 but not Logitech? Mine is getting kind of old / beaten up.",
      "score": 1,
      "created_utc": 1740506008.0,
      "replies": []
    },
    {
      "id": "mer2nhu",
      "author": "Nalcomis",
      "body": "Damn that’s really disappointing.  It’s a really good product that works as advertised.  Not sure why they’ve made it worse.",
      "score": 1,
      "created_utc": 1740511018.0,
      "replies": []
    },
    {
      "id": "mervv50",
      "author": "bonzaisushi",
      "body": "I was a happy powerplay user for a couple years than i sat down one day and static shocked my powerplay and it no longer works. I've given up after that hah.",
      "score": 1,
      "created_utc": 1740519199.0,
      "replies": []
    },
    {
      "id": "metambr",
      "author": "ricecanister",
      "body": "Wish the mx master would support powerplay",
      "score": 1,
      "created_utc": 1740535117.0,
      "replies": []
    },
    {
      "id": "metdlt4",
      "author": "Bob_the_peasant",
      "body": "Hope my version 1 doesn’t ever give up, this looks horrible.  The v1 + G903 has been going strong since launch for me and it has been amazing.",
      "score": 1,
      "created_utc": 1740536115.0,
      "replies": []
    },
    {
      "id": "metm432",
      "author": "F34RTEHR34PER",
      "body": "I just got the powerplay mat and Pro X Superlight 2 for $179 combo deal via best buy.  No need for me to buy another.",
      "score": 1,
      "created_utc": 1740538987.0,
      "replies": []
    },
    {
      "id": "meu6s0l",
      "author": "Noctornal-Panda",
      "body": "Just bought the last powerplay mat lol",
      "score": 1,
      "created_utc": 1740546997.0,
      "replies": []
    },
    {
      "id": "mf91uyj",
      "author": "Falch93",
      "body": "I wish they made a 50x50 cm version as this is too small for my low sens fps games.",
      "score": 1,
      "created_utc": 1740750879.0,
      "replies": []
    },
    {
      "id": "mfj4sbn",
      "author": "PESER6",
      "body": "Dear Logitech, please change the name of this to powerplay lite and rerelease the powerplay 2 with option for a bigger surface area, thinner (I mean, why not), add a usb port, keep the transmitter, upgrade to usb c port, maybe add magnetic holders for the mousepads so that they do not slide around and I think that's good enough.",
      "score": 1,
      "created_utc": 1740878598.0,
      "replies": []
    },
    {
      "id": "mvzewjj",
      "author": "Rika__",
      "body": "i was waiting for them to update it to usb-c... then they made it a permanently attached cable :/",
      "score": 1,
      "created_utc": 1749056897.0,
      "replies": []
    },
    {
      "id": "meq5hzx",
      "author": "PapaSmurf1502",
      "body": "That's every Logitech product.",
      "score": 1,
      "created_utc": 1740501680.0,
      "replies": []
    },
    {
      "id": "mer6w6e",
      "author": "trainbrain27",
      "body": "Batteries are pretty cheap and last several months if they're not being used to light up the outside of the mouse.\n\nI haven't used a mousepad in a couple decades.\n\nAs you can tell, I'm not gamer enough to be in the target market.",
      "score": 1,
      "created_utc": 1740512211.0,
      "replies": []
    },
    {
      "id": "mesxxxb",
      "author": "PmMeUrNihilism",
      "body": "Did Logitech get bought out by private equity or something? Any news about them in the last couple of years has mostly been shit.",
      "score": 1,
      "created_utc": 1740530952.0,
      "replies": []
    },
    {
      "id": "mepoa8o",
      "author": "Galahad_the_Ranger",
      "body": "Cheaper is better",
      "score": 0,
      "created_utc": 1740496642.0,
      "replies": []
    },
    {
      "id": "meqafpa",
      "author": "Jarvdoge",
      "body": "There's a magnetic charging dock thing which you can get for around £15 on Amazon - gives you somewhere to store the mouse when not in use and charges it for you too. I've been using one for years without issue and I'd say it's a much more convenient solution which is also significantly cheaper.",
      "score": 0,
      "created_utc": 1740503080.0,
      "replies": []
    },
    {
      "id": "merbesi",
      "author": "SteveImNot",
      "body": "Gamers products are all so stupid to me. Ya’ll can’t win rainbow 6 without a plug in mouse pad, led gaming chair that looks like a gen 10 mega evolution Pokémon, and mechanical keyboard that sounds like you’re driving a steam roller over bubble wrap?? For the price of $2000?? Like I guess it’s just the side effect of tech bros having money",
      "score": -5,
      "created_utc": 1740513473.0,
      "replies": []
    },
    {
      "id": "meqbnul",
      "author": "Semen_K",
      "body": "Gee just buy a small usb adapter to extend the charging port and magnetic usb cable to snap in overnight to charge. Costs you 10 bucks instead of 100",
      "score": -1,
      "created_utc": 1740503430.0,
      "replies": []
    },
    {
      "id": "mepnwpf",
      "author": "McCheesing",
      "body": "![gif](giphy|UiH6lsIgUhZU7uNKFR)",
      "score": -2,
      "created_utc": 1740496527.0,
      "replies": []
    },
    {
      "id": "mepv8b4",
      "author": "positivcheg",
      "body": "How else could the companies “grow”? It’s literally an infinite money glitch. Money getting printed, companies print items with quite defined expiration dates and exchange it for money. They control when will they get the next payment from you when you buy the item.\n\nFunniest thing when company make cheaper items but sell it for higher price. Inflation they said :)",
      "score": -4,
      "created_utc": 1740498701.0,
      "replies": []
    },
    {
      "id": "mepqmq8",
      "author": "Jig909",
      "body": "Lmao who pays for a mouse pad",
      "score": -23,
      "created_utc": 1740497346.0,
      "replies": [
        {
          "id": "meprick",
          "author": "Dron41k",
          "body": "Everyone who needs one I guess.",
          "score": 10,
          "created_utc": 1740497607.0,
          "replies": []
        },
        {
          "id": "meprcgw",
          "author": "Pocok5",
          "body": "The people who don't want to have a shitty plastic mousepad, or a mouse that sticks to the table and picks up hand grease onto the sliders. That said a 20$ steelseries mousepad is already top quality. No need for RGB and whatnot, it only complicates washing it.",
          "score": 6,
          "created_utc": 1740497558.0,
          "replies": [
            {
              "id": "mepscie",
              "author": "itsVanquishh",
              "body": "The steel series rgb mousepad lasted me 3 years. Could’ve lasted longer but I replaced it after the left side rgb went out",
              "score": 2,
              "created_utc": 1740497856.0,
              "replies": []
            },
            {
              "id": "meqis2l",
              "author": "Jig909",
              "body": "I use my mouse on the table",
              "score": 1,
              "created_utc": 1740505447.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mepryo0",
          "author": "JoeDawson8",
          "body": "I started using a trackball.  Fits in more places",
          "score": 1,
          "created_utc": 1740497743.0,
          "replies": []
        }
      ]
    }
  ]
}