{
  "post": {
    "title": "In a recent study, a group unveiled a backpack prototype that nearly eliminates the vertical inertial forces of the load inside. The bag’s design significantly reduces the amount of energy required by the user to carry it.",
    "author": "Sariel007",
    "id": "1hjbhuj",
    "score": 2150,
    "created_utc": 1734793184.0,
    "selftext": "",
    "num_comments": 227,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hjbhuj/in_a_recent_study_a_group_unveiled_a_backpack/"
  },
  "comments": [
    {
      "id": "m35i4yp",
      "author": "SteakandTrach",
      "body": "You can accomplish something similar by doing what my old military drill instructor would yell at us for: “Quit your be-boppin’!” which meant stop having such a bouncy walk. Walk smoothly so you aren’t sending that pack up and down as you perambulate down the trail. \n\nIt’s a real thing. You could easily spot the people that had a lot of up-and-down motion while they hike.",
      "score": 893,
      "created_utc": 1734797652.0,
      "replies": [
        {
          "id": "m35yylu",
          "author": "reddituseronebillion",
          "body": "Now put on 120lbs of shit and walk through hilly forests for a decade then get told your back issues aren't service related.",
          "score": 758,
          "created_utc": 1734803524.0,
          "replies": [
            {
              "id": "m36f8sa",
              "author": "MiniSpaceHamstr",
              "body": "Dude, sorry to hear that. I would suggest going on VA.gov and apply for disability again. Keep trying. It's worth it.",
              "score": 192,
              "created_utc": 1734809065.0,
              "replies": [
                {
                  "id": "m37jfa6",
                  "author": "ColdPorridge",
                  "body": "Not VA.gov, use your local DAV, they’re great. They know how to get claims approved.",
                  "score": 157,
                  "created_utc": 1734823922.0,
                  "replies": [
                    {
                      "id": "m37jwqt",
                      "author": "miller91320",
                      "body": "👆this. They’re so easy to work with.",
                      "score": 27,
                      "created_utc": 1734824111.0,
                      "replies": []
                    },
                    {
                      "id": "m37so47",
                      "author": "MiniSpaceHamstr",
                      "body": "That's true in some places. It all depends on the person. \n\nI didn't my entire retirement claim online myself. It's really easy these days to do it yourself. You can file all of the documents yourself, track your claim online, and even call and check on your claim if you want. \n\nOnce you fill out the online forms, they will contact you to schedule your appointments. Then once those are done, they contact you with the results.\n\nIt's really very easy to do it yourself. But the DAV is definitely a resource I encourage you to pursue if it's what your are more comfortable with. Irregardlessly, file your claim as soon as you can.",
                      "score": 13,
                      "created_utc": 1734827634.0,
                      "replies": []
                    },
                    {
                      "id": "m37vyny",
                      "author": "swb502",
                      "body": "What's DAV?",
                      "score": 8,
                      "created_utc": 1734828991.0,
                      "replies": [
                        {
                          "id": "m37yxz5",
                          "author": "goat_penis_souffle",
                          "body": "Disabled American Veterans",
                          "score": 16,
                          "created_utc": 1734830256.0,
                          "replies": []
                        },
                        {
                          "id": "m3annk9",
                          "author": "Cheshire-Kate",
                          "body": "DAV's not here, man",
                          "score": 5,
                          "created_utc": 1734882702.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m3eelbt",
                  "author": "967-387",
                  "body": "I want to do this because my back and knees are fucked but I got out almost 10 years ago and have 0 documentation because I was young dumb and wanted to \"tough it out\"",
                  "score": 4,
                  "created_utc": 1734933290.0,
                  "replies": [
                    {
                      "id": "m3eex4k",
                      "author": "MiniSpaceHamstr",
                      "body": "Just do it. Depending on what your MOS was, many claims are considered \"presumptive.\" Meaning they just presume that you will have these problems if you served in that MOS.",
                      "score": 3,
                      "created_utc": 1734933475.0,
                      "replies": [
                        {
                          "id": "m3efavs",
                          "author": "967-387",
                          "body": "11B so yeah probably. I'll look into it maybe",
                          "score": 1,
                          "created_utc": 1734933695.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m39yx0n",
              "author": "None",
              "body": "Uhhh we have the best healthcare and love our military a whole bunch, so you must be a bot or commie /s",
              "score": 5,
              "created_utc": 1734872033.0,
              "replies": []
            },
            {
              "id": "m36yfdd",
              "author": "Zech08",
              "body": "Or how about moving 100amp power cables in uneven ground back and forth. Nope job roles absolutely cant cause injury lol...",
              "score": 15,
              "created_utc": 1734815957.0,
              "replies": []
            },
            {
              "id": "m3cj9gg",
              "author": "uwey",
              "body": "But you got “tower of the power” patches and brotherhood for life, maybe a free knee replacement at Womack after so many jumps…\n\nStill not service related.",
              "score": 1,
              "created_utc": 1734905353.0,
              "replies": []
            },
            {
              "id": "m36ri8p",
              "author": "None",
              "body": "[deleted]",
              "score": -21,
              "created_utc": 1734813437.0,
              "replies": [
                {
                  "id": "m36vgm0",
                  "author": "reddituseronebillion",
                  "body": "I'm Canadian, man.",
                  "score": 17,
                  "created_utc": 1734814872.0,
                  "replies": [
                    {
                      "id": "m36xp2k",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -16,
                      "created_utc": 1734815691.0,
                      "replies": [
                        {
                          "id": "m36y3t4",
                          "author": "reddituseronebillion",
                          "body": "I have no idea I'd you're dumb or trolling.",
                          "score": 16,
                          "created_utc": 1734815840.0,
                          "replies": [
                            {
                              "id": "m36zja8",
                              "author": "ApocalypsePopcorn",
                              "body": "Yes.",
                              "score": 3,
                              "created_utc": 1734816359.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m36y2fy",
                          "author": "Yepimjosh",
                          "body": "Nah they just take care of all of their citizens regardless 🤷🏼‍♂️",
                          "score": 8,
                          "created_utc": 1734815825.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m36l94d",
              "author": "None",
              "body": "[removed]",
              "score": -43,
              "created_utc": 1734811177.0,
              "replies": [
                {
                  "id": "m36m1k1",
                  "author": "WhiteSox02",
                  "body": "Big words from a weeb who plays Magic online",
                  "score": 16,
                  "created_utc": 1734811454.0,
                  "replies": [
                    {
                      "id": "m38g1mb",
                      "author": "Ok-Discussion-77",
                      "body": "? Why are you bashing on someone for being a geek while being a geek yourself (Star Wars)?  Let go of the self hate or stop projecting.",
                      "score": 2,
                      "created_utc": 1734837636.0,
                      "replies": [
                        {
                          "id": "m38hj22",
                          "author": "WhiteSox02",
                          "body": "It’s not bashing him for being a geek - it’s bashing him for trying to attack someone for serving in the military.",
                          "score": 1,
                          "created_utc": 1734838320.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m3a4t08",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1734875010.0,
                      "replies": [
                        {
                          "id": "m3a55ja",
                          "author": "WhiteSox02",
                          "body": "Easy there, DND boy.",
                          "score": 1,
                          "created_utc": 1734875175.0,
                          "replies": [
                            {
                              "id": "m3a5h7g",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1734875329.0,
                              "replies": [
                                {
                                  "id": "m3a5xd3",
                                  "author": "WhiteSox02",
                                  "body": "Who gives a shit? Clearly you. Care less about what people say online.",
                                  "score": 1,
                                  "created_utc": 1734875542.0,
                                  "replies": [
                                    {
                                      "id": "m3a6c9r",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1734875737.0,
                                      "replies": [
                                        {
                                          "id": "m3a6s3f",
                                          "author": "WhiteSox02",
                                          "body": "Adios, champ. Don’t forget to shower tonight.",
                                          "score": 1,
                                          "created_utc": 1734875940.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m36n67n",
                  "author": "reddituseronebillion",
                  "body": "Really? You think they tell you about that shit when you join? \n\nI was also joking around, it's basically a meme amongst army retirees.",
                  "score": 11,
                  "created_utc": 1734811858.0,
                  "replies": [
                    {
                      "id": "m36nhko",
                      "author": "None",
                      "body": "[removed]",
                      "score": -30,
                      "created_utc": 1734811970.0,
                      "replies": [
                        {
                          "id": "m36p6x1",
                          "author": "reddituseronebillion",
                          "body": "Go back under your bridge.",
                          "score": 9,
                          "created_utc": 1734812599.0,
                          "replies": [
                            {
                              "id": "m36ptgp",
                              "author": "None",
                              "body": "[removed]",
                              "score": -18,
                              "created_utc": 1734812829.0,
                              "replies": [
                                {
                                  "id": "m36rdr0",
                                  "author": "Goolsby",
                                  "body": "That's hilarious, you got em.",
                                  "score": 7,
                                  "created_utc": 1734813393.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m36w5ji",
                          "author": "Spittax",
                          "body": "I’m so sure that if this dude got his hands on you you would squeal and piss yourself lmao",
                          "score": 4,
                          "created_utc": 1734815125.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m36tgae",
          "author": "thekeffa",
          "body": "In the British military we call this \"Dead weight\".\n\nThe idea that in order to make your equipment feel lighter and more carryable and to stop it bouncing up and down your back, you basically spread the weight around your pack (Called a \"Bergan\" in British military parlance) with the emphasis being that the heavier things are nearer the top (So higher up on your back). You also make it so that your weight cannot move by stuffing all the air gaps between equipment with soft things, like your poncho, waterproofs, spare clothes and anything else soft.\n\nYou test it by jumping up and down with the bag on. If you feel anything moving in there when you jump, you have dead weight and you need to fix it.\n\nThe difference between a bag that is packed in this way and a bag that just has stuff thrown in and able to move around is like night and day. The well packed bag that avoids dead weight is barely an inconvenience (Up to a point of course, there is no trick in the world that is going to make you not notice 55kg) whereas the badly packed back with lots of dead weight is a relentless torture device on a loaded march.\n\nPack your bag so you have no dead weight, and your back will thank you in the future when you are old (Or at least it won't be as bad as it might be).",
          "score": 35,
          "created_utc": 1734814143.0,
          "replies": [
            {
              "id": "m393i2v",
              "author": "mr_trashbear",
              "body": "Can you explain why you put heavier things up top? Wouldn't that lead to a more, well, top heavy load that would be less stable, and therefore more prone to bouncing/movement?",
              "score": 8,
              "created_utc": 1734850182.0,
              "replies": [
                {
                  "id": "m3a84kw",
                  "author": "achillies665",
                  "body": "It should be heavier things near the back. Never heard of up top, but we always packed it with the heaviest stuff was as close to your back as possible.",
                  "score": 15,
                  "created_utc": 1734876550.0,
                  "replies": [
                    {
                      "id": "m3aut3z",
                      "author": "mr_trashbear",
                      "body": "Yeah, that's how I've always packed stuff. Heavier stuff towards the middle/bottom and closer towards the body. \"Avoid the void\" still definitely applies though.",
                      "score": 3,
                      "created_utc": 1734885223.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m39mewu",
                  "author": "quick_justice",
                  "body": "I never being to British military but my hypothesis is that on balance heavier things will prevent lighter things on the bottom from moving about by power of gravity.\n\nI don’t know if this is more or less important than resulting slightly higher centre of mass, but it should work in terms of stabilising the load.",
                  "score": 1,
                  "created_utc": 1734863752.0,
                  "replies": []
                },
                {
                  "id": "m3apv9p",
                  "author": "StreetlampEsq",
                  "body": "You want it closer to your center of gravity, so heavier items towards the back lower down, but since you're leaning forward to offset the pack, the top section curves towards your center of gravity.\n\nEdit: btw, have no idea what I'm talking about.",
                  "score": 1,
                  "created_utc": 1734883487.0,
                  "replies": []
                },
                {
                  "id": "m3axmg7",
                  "author": "thekeffa",
                  "body": "Yes certainly. Top in this case refers to it in a 3D sense in both the horizontal and vertical planes, so further up the back towards the head and also closer to your back (The idea being that the \"Front\" of the pack is closest to your back) in the horizontal sense.\n\nThe reason that you put the heavier things nearer the top (In the vertical sense) is that the top is essentially the middle of the back for most people and in a process I myself do not fully understand, it counteracts the motion of the hips when walking, leading to a more stable weight on your back. There is a downside to this which is leaning over and picking up the bag is harder but that generally is a lesser consideration.\n\nIt should be pointed out clearly that **even** weight distribution with all air gaps packed out so it is immovable weight is the actual sought after end result. Your bag should not be top heavy even with the heavy items at the top, but if that is not achievable, it's better for the bag to weigh a bit more at the top than at the bottom.\n\nMy PTI instructor said it best. \"If your bag feels like its stuffed full of heavy pillows you have done it right\".",
                  "score": 1,
                  "created_utc": 1734886194.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35yh2i",
          "author": "IM_OK_AMA",
          "body": "The videos of these things in use are hilarious because the models have to maintain a certain rhythm with the backpack, which seems like more work than just carrying the weight properly.",
          "score": 15,
          "created_utc": 1734803353.0,
          "replies": []
        },
        {
          "id": "m35x14n",
          "author": "CozySlum",
          "body": "Same principle elite marathon runners follow when mastering their running form. Even a cm too high of a vertical bounce in stride is over a kilometer of wasted energy and motion over the course of the marathon. ",
          "score": 13,
          "created_utc": 1734802858.0,
          "replies": []
        },
        {
          "id": "m35mfte",
          "author": "Significant-Mango300",
          "body": "Good point, imagine securing the bag well helps with things not bouncing around as much or wrapping heavy items around a bubble wrap or cushion of some sort",
          "score": 43,
          "created_utc": 1734799134.0,
          "replies": [
            {
              "id": "m35n42v",
              "author": "SteakandTrach",
              "body": "It’s more about the energy requirement of your muscles to accelerate the bag upward followed by the compressive forces on the vertebral discs and knee joints to halt the falling of the bag on its way back down. Walk smooth, use less energy and suffer less wear and tear.",
              "score": 56,
              "created_utc": 1734799362.0,
              "replies": [
                {
                  "id": "m35s0ro",
                  "author": "facemanbarf",
                  "body": "Had a classmate in high school who walked so smoothly in this manner it looked like he was traveling on moving walkway like in airports. Especially, if he just passed a class window. No up and down at all. Like a ghost.",
                  "score": 55,
                  "created_utc": 1734801091.0,
                  "replies": [
                    {
                      "id": "m361q6q",
                      "author": "anutron",
                      "body": "Shaggy from old school Scooby Doo",
                      "score": 20,
                      "created_utc": 1734804493.0,
                      "replies": [
                        {
                          "id": "m368wd4",
                          "author": "ChimneySwiftGold",
                          "body": "Gagagaga-ghost!!!!!",
                          "score": 6,
                          "created_utc": 1734806910.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m36j64g",
                      "author": "qOJOb",
                      "body": "We had a kid in school who walked like that. People called him Scooter",
                      "score": 9,
                      "created_utc": 1734810442.0,
                      "replies": []
                    },
                    {
                      "id": "m37fts0",
                      "author": "olcrazypete",
                      "body": "This is marching band kids. To play and walk at the same time gotta learn heal to toe smoothness.",
                      "score": 8,
                      "created_utc": 1734822465.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m35ngwi",
                  "author": "Significant-Mango300",
                  "body": "I get that part totally, just wondering if internal dampening by with cushions around items and secured well helps…that’s all",
                  "score": 3,
                  "created_utc": 1734799481.0,
                  "replies": [
                    {
                      "id": "m35pi3r",
                      "author": "SteakandTrach",
                      "body": "Not really, especially considering modern packs are compressive, meaning you buy the pack to fit the volume you plan to carry, so rarely will someone be hiking with a 60L pack with 40L in it. And if you do carry less than your pack will hold,  you’ll be cinching down all the straps so that everything is still compressed so that it’s tight. Stuff doesn’t really shift that much in a backpack. Padding that isn’t between your body and the straps is just added volume and weight.",
                      "score": 16,
                      "created_utc": 1734800190.0,
                      "replies": [
                        {
                          "id": "m35w2jr",
                          "author": "CjBoomstick",
                          "body": "I don't think I see backpacks without compression straps ever anymore. At least, they're on every backpack that isn't just your generic school bag.",
                          "score": 6,
                          "created_utc": 1734802527.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m35s2p7",
              "author": "god_peepee",
              "body": "always secure the bag",
              "score": 3,
              "created_utc": 1734801111.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m36eq80",
          "author": "SerDuckOfPNW",
          "body": "I always thought the “quit bouncing” was for appearance. Never knew there was a practical reason for it.",
          "score": 8,
          "created_utc": 1734808893.0,
          "replies": [
            {
              "id": "m36namt",
              "author": "raspberryharbour",
              "body": "The buttocks of the soldier ahead of you can become a distraction",
              "score": 14,
              "created_utc": 1734811902.0,
              "replies": [
                {
                  "id": "m36pw9f",
                  "author": "SerDuckOfPNW",
                  "body": "Let them eat cake",
                  "score": 6,
                  "created_utc": 1734812857.0,
                  "replies": [
                    {
                      "id": "m36qnbt",
                      "author": "Oddyssis",
                      "body": "Eat cake indeed",
                      "score": 2,
                      "created_utc": 1734813127.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m38qwmx",
                  "author": "Vladimir_Putting",
                  "body": "Ah, the old trail twerk.",
                  "score": 1,
                  "created_utc": 1734842781.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m398liq",
              "author": "Northbound-Narwhal",
              "body": "It is for appearance.",
              "score": 1,
              "created_utc": 1734853692.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m36kbes",
          "author": "Konstant_kurage",
          "body": "I spent my teens and twenties climbing big walls and ice covered mountains. There a huge difference between a properly loaded, fit, tied down and tight pack vs one that’s loose and not loaded or sized properly. That’s literally what all the straps are for.",
          "score": 6,
          "created_utc": 1734810850.0,
          "replies": []
        },
        {
          "id": "m35ti4p",
          "author": "fitzbuhn",
          "body": "Thank you.  I take my perambulation seriously.",
          "score": 10,
          "created_utc": 1734801618.0,
          "replies": []
        },
        {
          "id": "m38o66l",
          "author": "Capital_Historian685",
          "body": "Your Garmin can help with that, by giving you your \"vertical oscillation,\" and showing you how bad yours is compared to others.",
          "score": 5,
          "created_utc": 1734841424.0,
          "replies": []
        },
        {
          "id": "m37i02v",
          "author": "XXLARPER",
          "body": "\"Be-boppin' like you're back on the block!\" I haven't heard that term in 30 years LOL",
          "score": 3,
          "created_utc": 1734823354.0,
          "replies": []
        },
        {
          "id": "m36klgu",
          "author": "Metal-Alligator",
          "body": "That would be me… I bounce on the ball of my foot without realizing it… so like a mini calf raise with every step.\n\nMy wife would look for my head bobbing up n down when we broke from formations like when we got back from Afghanistan",
          "score": 3,
          "created_utc": 1734810947.0,
          "replies": []
        },
        {
          "id": "m36vv07",
          "author": "xinorez1",
          "body": "*'He's beboppin and scattin and I'm losing it!!!'*",
          "score": 3,
          "created_utc": 1734815018.0,
          "replies": []
        },
        {
          "id": "m365p2y",
          "author": "SelfSniped",
          "body": "I hike with the goal of being quiet. Keeping footsteps quiet means slowing down a little and putting thought into your movement and foot placement. Quiet is smooth. Smooth is efficient.",
          "score": 4,
          "created_utc": 1734805827.0,
          "replies": [
            {
              "id": "m366gn0",
              "author": "SteakandTrach",
              "body": "And smooth is fast.",
              "score": 2,
              "created_utc": 1734806091.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m363x2e",
          "author": "HaloGuy381",
          "body": "You have a point. I tend to have a bouncier gait (weird autistic walking thing combined with a habit of trying to step lightly to not be noticed by family), and I’ve been working on toning it down; between the satchel I bring to work with supplies for myself and the printer we use for markdown label printing in the store, I’m wrecking my back by swinging too much. \n\nIt’s unfortunate, because another reason I have such a spirited movement is to cover up the depressed shamble I otherwise would default to; I’m in customer service and I need to look alert and engaged without being too intense, and acting peppy is one way to do that.",
          "score": 4,
          "created_utc": 1734805222.0,
          "replies": []
        },
        {
          "id": "m3676ey",
          "author": "Prineak",
          "body": "BUT I MUST DANCE!",
          "score": 2,
          "created_utc": 1734806332.0,
          "replies": []
        },
        {
          "id": "m36ak5f",
          "author": "throwawayifyoureugly",
          "body": "But what if I like to preambulate?",
          "score": 1,
          "created_utc": 1734807471.0,
          "replies": []
        },
        {
          "id": "m36px5i",
          "author": "Lawlcopt0r",
          "body": "Sure, but this could still be useful by walking uphill, I imagine you can't really control your bounce then",
          "score": 1,
          "created_utc": 1734812866.0,
          "replies": []
        },
        {
          "id": "m3741v6",
          "author": "mysecondaccountanon",
          "body": "In dance classes, our instructors would also constantly tell us to have less bounciness in our movements, as it’s not only better for our bodies and less likely to tire us out, but also looks better!",
          "score": 1,
          "created_utc": 1734818018.0,
          "replies": []
        },
        {
          "id": "m377738",
          "author": "CigarLover",
          "body": "As a tall fat guy this is so hard to not do. People make fun of my walk at work ._.",
          "score": 1,
          "created_utc": 1734819168.0,
          "replies": []
        },
        {
          "id": "m3b9cwo",
          "author": "kurotech",
          "body": "Yea I roll my foot instead of stepping it's less impact overall and has helped my back pain a fair bit as well",
          "score": 1,
          "created_utc": 1734890170.0,
          "replies": []
        },
        {
          "id": "m36cxb9",
          "author": "None",
          "body": "Walking smooth requires constant muscle engagement. Natural strides have bounce specifically to conserve energy. You are using the same amount of energy walking smooth as the person with bounce in their step. \n\nThese backpacks allow for natural efficient walking.",
          "score": -1,
          "created_utc": 1734808275.0,
          "replies": []
        },
        {
          "id": "m36r9em",
          "author": "Goolsby",
          "body": "I'd tell that drill instructor to lose his bad attitude.",
          "score": -1,
          "created_utc": 1734813349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m358f6e",
      "author": "FeedMeSoma",
      "body": "I saw a video on this or something very similar and it didn’t really work in real life conditions",
      "score": 243,
      "created_utc": 1734794118.0,
      "replies": [
        {
          "id": "m360l48",
          "author": "Mama_Skip",
          "body": "I've seen it posted on both the design and hiking subreddits and people tore it apart.\n\nBasically the inertial benefits do not nearly outweigh the cost of the additional weight of the rail/bearing system and easily breakable moving parts being a risk on the trail. If the designers were actually hikers themselves, they'd know that every Ounce is precious and everything needs to be extremely durable. \n\nAnd if you're hiking with your backpack bobbing up and down, your form is wrong anyway.",
          "score": 155,
          "created_utc": 1734804096.0,
          "replies": [
            {
              "id": "m363545",
              "author": "POOP-Naked",
              "body": "But have you ever seen a bird move? This backpack mimics BIRD HEAD STABILIZATION!! Don’t you want to be a bird on the trail, flying your way to the peak!?!?!?!?!!?\n\n![gif](giphy|fKwpeyXg2rBPa)",
              "score": 48,
              "created_utc": 1734804960.0,
              "replies": [
                {
                  "id": "m381c3u",
                  "author": "Davesterific",
                  "body": "Oh my god, I’m pooping naked right now! Do you believe in coincidence?",
                  "score": 10,
                  "created_utc": 1734831249.0,
                  "replies": [
                    {
                      "id": "m3b2upc",
                      "author": "CovidBorn",
                      "body": "This is simply a high likelihood while on Reddit, as my current situation backs up.",
                      "score": 3,
                      "created_utc": 1734887967.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m37h0dl",
              "author": "DigitalPriest",
              "body": "Eh, the designers probably know that.  They're not catering to hardcore hikers, they're catering to the buy-hards who want to *look* like hikers.  They'll happily take those rubes' money.",
              "score": 11,
              "created_utc": 1734822948.0,
              "replies": [
                {
                  "id": "m37ofka",
                  "author": "Mama_Skip",
                  "body": "That's fair. Weekend warrior types. \n\nStill a huge amount of even those types look at total weight. It's one of the first items of info presented when selling backpacks/bags/chairs/tents/etc",
                  "score": 4,
                  "created_utc": 1734825926.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35h8lp",
          "author": "DookieShoez",
          "body": "![gif](giphy|AaQYP9zh24UFi)",
          "score": 41,
          "created_utc": 1734797339.0,
          "replies": []
        },
        {
          "id": "m360fut",
          "author": "MINKIN2",
          "body": "Yeah, I am not exactly what people would call an ultralight backpacker but looking at that thing makes me want to cut the handle off my toothbrush! How heavy is that?!",
          "score": 9,
          "created_utc": 1734804047.0,
          "replies": [
            {
              "id": "m37081n",
              "author": "ApocalypsePopcorn",
              "body": "Heavy enough that *not* using it makes me feel like I could justify taking a chair or two.",
              "score": 5,
              "created_utc": 1734816614.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m363amn",
          "author": "PocketNicks",
          "body": "Yeah, I also watched some Mythbusters style YouTube video where this was thoroughly tested and the physics didn't match the claim.",
          "score": 7,
          "created_utc": 1734805013.0,
          "replies": []
        },
        {
          "id": "m35qp4f",
          "author": "feral2112",
          "body": "Just reading about it and looking at the photo, it's going to be a long time before this gets into a Jansport.",
          "score": 7,
          "created_utc": 1734800619.0,
          "replies": []
        },
        {
          "id": "m36vxj3",
          "author": "Alikyr",
          "body": "IIRC, the one I saw came to the conclusion that over flat ground, it's okay, but as soon as you have to go up or down a hill, it becomes awful. The vertical inertial dampening just actively works against the direction you're going.",
          "score": 3,
          "created_utc": 1734815044.0,
          "replies": []
        },
        {
          "id": "m38c641",
          "author": "Kuli24",
          "body": "Yep, the only way it was alright was if you got into a rhythm, but if you break that rhythm it's awkward and awful.",
          "score": 1,
          "created_utc": 1734835853.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m358sge",
      "author": "bl8ant",
      "body": "r/deathstranding is going to like this.",
      "score": 65,
      "created_utc": 1734794255.0,
      "replies": [
        {
          "id": "m361jss",
          "author": "MCA2142",
          "body": "Keep on keeping on.",
          "score": 16,
          "created_utc": 1734804431.0,
          "replies": []
        },
        {
          "id": "m36epuh",
          "author": "grimreeper1995",
          "body": "This is going to completely revolutionize strand-type gaming.",
          "score": 23,
          "created_utc": 1734808890.0,
          "replies": []
        },
        {
          "id": "m36rj00",
          "author": "sneekystick97",
          "body": "👍👍👍👍",
          "score": 4,
          "created_utc": 1734813444.0,
          "replies": [
            {
              "id": "m36w16d",
              "author": "bl8ant",
              "body": "👍+20 \n\nYou received 20 likes from BallzLord69420 for your ladder.",
              "score": 8,
              "created_utc": 1734815080.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m389lol",
          "author": "ihatefuckingcoding",
          "body": "Tomorrow will finally be in my hands",
          "score": 4,
          "created_utc": 1734834721.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m365my4",
      "author": "DiamondKrash",
      "body": "![gif](giphy|ZMpBuMZxHULdfaPDvd)",
      "score": 19,
      "created_utc": 1734805806.0,
      "replies": []
    },
    {
      "id": "m3776ex",
      "author": "ExplosiveDisassembly",
      "body": "Ah, yes. This again. \n\nThere was a Kickstarter years back with this concept. The bag would counter the forces and kind of gyroscopically stabilize the load. It worked pretty well from what I saw of it. It kept the forces on your shoulder relatively constant. \n\nExcept...no one walks (let alone hikes) with a consistent cadence so it's never truly in sync. This means you'll likely be working against it as much as it's working with you. And, as anyone who has done backpacking knows, you don't backpack with enough speed to throw your pack about. The added weight of a system like this would be more noticeable than the benefits.",
      "score": 17,
      "created_utc": 1734819160.0,
      "replies": [
        {
          "id": "m39mdol",
          "author": "PristineBaseball",
          "body": "Yeah even a small electric motor + driver is gonna be noticeable",
          "score": 2,
          "created_utc": 1734863726.0,
          "replies": [
            {
              "id": "m3azjks",
              "author": "ExplosiveDisassembly",
              "body": "Especially nowadays. Backpackers want a week's worth of gear to be under 30 pounds. A small frame and motor would ruin that. \n\nOr you backpack like me with external frame packs and you just put up with 70 lbs of gear, and deal with the pain so you can camp like kings once you get there. \n\nI think there are some long distance running events where this could be useful, but it's a highly nice product at best.",
              "score": 1,
              "created_utc": 1734886842.0,
              "replies": [
                {
                  "id": "m3azuy0",
                  "author": "PristineBaseball",
                  "body": "How about a system that is capturing that energy to charge a battery instead of drive a motor .",
                  "score": 1,
                  "created_utc": 1734886951.0,
                  "replies": [
                    {
                      "id": "m3b07lw",
                      "author": "ExplosiveDisassembly",
                      "body": "Solar oe a hand crank would probably be better and lighter.",
                      "score": 1,
                      "created_utc": 1734887070.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m3dqw5f",
          "author": "noots-to-you",
          "body": "What if the target application is to reduce energy consumption in robots, carrying heavy burdens while running in places that are too rough for treads?",
          "score": 1,
          "created_utc": 1734922065.0,
          "replies": [
            {
              "id": "m3dttlv",
              "author": "ExplosiveDisassembly",
              "body": "Then the walking would be uneven and irregular, which the backpack doesn't work well with.",
              "score": 1,
              "created_utc": 1734923286.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m35hjlp",
      "author": "mumblesthemeek",
      "body": "This is an ad",
      "score": 117,
      "created_utc": 1734797444.0,
      "replies": [
        {
          "id": "m36ykzx",
          "author": "MonsterGuitarSolo",
          "body": "Sir, you are in r/gadgets. The whole sub is an ad.",
          "score": 71,
          "created_utc": 1734816012.0,
          "replies": []
        },
        {
          "id": "m37g9nr",
          "author": "Northern23",
          "body": "Let's downvote it then.",
          "score": 6,
          "created_utc": 1734822645.0,
          "replies": []
        },
        {
          "id": "m37xwyb",
          "author": "Emik8800",
          "body": "Thank you Jimmy",
          "score": 1,
          "created_utc": 1734829823.0,
          "replies": []
        },
        {
          "id": "m38sw68",
          "author": "None",
          "body": "An ad for the Harbin Institute of Technology?",
          "score": 0,
          "created_utc": 1734843834.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m35lokv",
      "author": "kagethemage",
      "body": "Gunna have us running around like death stranding",
      "score": 12,
      "created_utc": 1734798873.0,
      "replies": []
    },
    {
      "id": "m35fs8y",
      "author": "Wise-Activity1312",
      "body": "It doesn't reduce the energy imparted to the wearer of items jostling of bouncing up and down.\n\nIt simply distributes the peaks of that energy smoothly across a longer time.\n\nSame total energy as a regular backpack.\n\nExcept for this one has all the extra crap that increases the overall weight.",
      "score": 88,
      "created_utc": 1734796826.0,
      "replies": [
        {
          "id": "m35re3m",
          "author": "restform",
          "body": "Distributing the peaks probably would reduce the overall energy expenditure from the user though, no? If you're not raising the bag as frequently, then that should be a net decrease in energy",
          "score": 8,
          "created_utc": 1734800868.0,
          "replies": [
            {
              "id": "m3652bk",
              "author": "Noleta",
              "body": "No. Imagine a curve of energy exertion. If this pack weighed nothing it would essentially clip the peaks of the curve and fill in some of the valleys.  Overall energy,  (or area below the curve), remains constant.    \n\n\nBut this pack is not weightless.  So although the curve is smoothed out,  it's offset upwards with more overall energy required.    \n\n\nWorse than that,  it's tuned for certain weights and certain walking gates.  If not in that range then the oscillating can actually amplify the peaks and valleys on the curve. It's snake oil.  ",
              "score": -3,
              "created_utc": 1734805611.0,
              "replies": [
                {
                  "id": "m368ct9",
                  "author": "whatnowwproductions",
                  "body": "This is not true because the additional effort necessary for the peak of movements requires significantly more energy than keeping a constant where you're more efficient.",
                  "score": 7,
                  "created_utc": 1734806726.0,
                  "replies": [
                    {
                      "id": "m36a62w",
                      "author": "Noleta",
                      "body": "You're only looking at half the walk. That same arguement can be made to say that the valleys (when the mass is in freefall) consume less energy than a constant load.     \n\n\nThis isn't a magic design,  it's just mass moving over distance, same work. Moreenergy is going to be spent with extra dead weight.   \n\n\nIf this wasn't snake oil then militaries would have implemented it years ago. There have been many evaluations and yet no permanent deployments.  ",
                      "score": 2,
                      "created_utc": 1734807336.0,
                      "replies": [
                        {
                          "id": "m36agqd",
                          "author": "whatnowwproductions",
                          "body": "That's fair. I'd like to see some more in depth studies about it.",
                          "score": 1,
                          "created_utc": 1734807439.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m36oo1b",
                      "author": "Wise-Activity1312",
                      "body": "False.",
                      "score": -1,
                      "created_utc": 1734812406.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m36dm5j",
                  "author": "baicai18",
                  "body": "Ita a prototype, but ignore the tuning for a second.\n\nEnergy is force * distance. When walking horizontal energy to move pack is going to remain constant.\n\nHowever it takes energy to lift the pack on each step up to thr peak. Then when at peak, gravity does its job and drops the pack, so a person has to expend extra energy to counteract the kinetic enrergy of the pack coming back down, so there is absolutely a savings considering just the mass of the pack. Its why a lot of hikers will try to move smoothly with no bob to achieve a smiliar thing. Where the benefits come over just forcing yourself not to bob is that our natual human gait has evolved to use our muscles most efficiently with a slight bob, so forcing no bob saves energy, but we lose muscle efficiency. This prototype pack could help maintain those energy savings while allowing you to walk with a normal bobbing gait for muscle efficiency\n\n\nOf course, whether that energy savings can counteract the energy needed to haul the extra frame and battery weight is another matter",
                  "score": 2,
                  "created_utc": 1734808511.0,
                  "replies": []
                },
                {
                  "id": "m388hqh",
                  "author": "restform",
                  "body": "But when moving up and down, is the bag not just acting like a store of energy in that as you move lower relative to the bag, the bags potential energy increases and as you raise yourself bag to the level of the bag, the potential energy decreases, as opposed to that energy not coming out of your legs?\n\nThe way I see it, if the bag decreases the amount of lateral movements, then quite simply it will be decreasing energy expendituring.\n\nI do agree this may not actually function so smoothly in real world terrain but that's a bit besides the point of the convo.",
                  "score": 2,
                  "created_utc": 1734834236.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m36oklu",
              "author": "Wise-Activity1312",
              "body": "No. \n\nSource: Law of Conservation of Energy.\n\n\n\n\nIf you make $200 today and $0 tomorrow, you made $200.\n\nIf I pay you the average, you get $100/day, and $200 total.\n\nHigh school children are taught this. It's fucking odd to have to explain this to an adult.",
              "score": -7,
              "created_utc": 1734812371.0,
              "replies": [
                {
                  "id": "m3876h1",
                  "author": "restform",
                  "body": "Damn, relax. \n\nMy point was more that this bag genuinely seems like it's conserving energy, whereas normally, if a bag falls lower to the ground, you are losing energy that needs to be reapplied again.\n\nIf you're bag is bouncing up and down, that bouncing motion is literally only possible as a result of energy being expended, you are overcoming inertia and fighting gravity moreso than something that remains stationary. \n\nWhen you step down, and the \"new\" bag is sliding up relative to your torso, it's effectively increasing its potential energy and when you move back up, that energy is being taken from the potential energy stored in the bag rather than your legs. \n\nThat's my first intuitive assumption of how this works, at least. I'm happy to be wrong, but based on your reply, I'm not convinced you have a good understanding of it either.",
                  "score": 1,
                  "created_utc": 1734833680.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m365utr",
          "author": "None",
          "body": "Meh. I had a rigid metal frame that I would mount by backpack onto. Nice thick padding on the contact points. Nice gap for airflow all down my back. Minimal rubbing. Perfect shoulder and waist straps. Loads of mounting points to strap alsorts of crazy shit to it. Best thing I ever bought. Even if it was a kg or so extra weight.",
          "score": 1,
          "created_utc": 1734805882.0,
          "replies": [
            {
              "id": "m370vva",
              "author": "ApocalypsePopcorn",
              "body": "Get an Osprey with the Airspeed harness. It hits all those points at half the weight or less.",
              "score": 1,
              "created_utc": 1734816861.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m35ndsz",
      "author": "vpesh",
      "body": "Saw a video of prototype years ago. Like 10 years or so. \nAnd come to look at article. And guess what ?\nThis is Chinese again. \nEndless Chinese bs on Reddit.",
      "score": 9,
      "created_utc": 1734799453.0,
      "replies": []
    },
    {
      "id": "m35nmnb",
      "author": "ToMorrowsEnd",
      "body": "This has been attempted over and over.   You can even buy one and be disappointed.\nhttps://www.hoverglidepacks.com/\n\nThey do not actually work well.  Friend of mine had one and utterly hated it 3 days into a long hike.  all that stuff adds so much weight to the whole pack.",
      "score": 7,
      "created_utc": 1734799536.0,
      "replies": []
    },
    {
      "id": "m36d18v",
      "author": "LOUD-AF",
      "body": "I'll just stick with my trusty [Flextrek Whipsnake](https://www.youtube.com/watch?v=ZAtzN_ScKXY) thanks.",
      "score": 7,
      "created_utc": 1734808311.0,
      "replies": []
    },
    {
      "id": "m35ix77",
      "author": "NovaHorizon",
      "body": "Videogame inventory",
      "score": 7,
      "created_utc": 1734797925.0,
      "replies": []
    },
    {
      "id": "m35fgat",
      "author": "AceKetchup11",
      "body": "How much does it weigh, and how much can it carry?",
      "score": 4,
      "created_utc": 1734796708.0,
      "replies": [
        {
          "id": "m3f10ft",
          "author": "Pristinox",
          "body": "Too much, and not enough.",
          "score": 2,
          "created_utc": 1734948056.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m35rb2p",
      "author": "Shekster",
      "body": "Sam Porter Bridges would like to know your location...",
      "score": 5,
      "created_utc": 1734800838.0,
      "replies": []
    },
    {
      "id": "m35ltco",
      "author": "robertomeyers",
      "body": "This is why many who work with loads carried will quickly discover that keeping their torso stable with no up and down motion, by a technique of walking or running knees bent slightly under you, will minimize the load impact. \n\nNext time you are in your car on a bumpy road, loosen your chest belt lean forward past vertical, you will see how much easier it is.",
      "score": 3,
      "created_utc": 1734798920.0,
      "replies": [
        {
          "id": "m35mftq",
          "author": "Dedspaz79",
          "body": "Ahh someone whose ruckmarched.",
          "score": 2,
          "created_utc": 1734799134.0,
          "replies": [
            {
              "id": "m35mlyw",
              "author": "robertomeyers",
              "body": "Absolutely intuitive when you’re loaded :-) pun intended.",
              "score": 2,
              "created_utc": 1734799191.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m35rfg2",
      "author": "Kal_Wikawo",
      "body": "Mark rober did a review on these products and essentially said it wasnt worth it",
      "score": 3,
      "created_utc": 1734800881.0,
      "replies": []
    },
    {
      "id": "m36casy",
      "author": "None",
      "body": "It's spelled marketing campaign, not recent study.",
      "score": 3,
      "created_utc": 1734808060.0,
      "replies": []
    },
    {
      "id": "m36ll4v",
      "author": "Thee_Sinner",
      "body": "[If its not used by Steve Climber, I dont want it.](https://www.youtube.com/watch?v=ZAtzN_ScKXY)",
      "score": 3,
      "created_utc": 1734811293.0,
      "replies": [
        {
          "id": "m390j17",
          "author": "CarryOnRTW",
          "body": "Not sure I could dominate my environment with this.",
          "score": 1,
          "created_utc": 1734848252.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m37f8qz",
      "author": "Auzor",
      "body": "And how much does the system weigh?",
      "score": 3,
      "created_utc": 1734822229.0,
      "replies": []
    },
    {
      "id": "m358y65",
      "author": "Burpreallyloud",
      "body": "This idea is so old I remember seeing something exactly like this about 2530 years ago. It was gonna revolutionize everything to do with hiking and all that type of stuff but never ever made it into production because it would cost too much.",
      "score": 6,
      "created_utc": 1734794317.0,
      "replies": []
    },
    {
      "id": "m35a2pq",
      "author": "blackout-loud",
      "body": "Did anyone actually read the article: *Researchers have leveraged recent discoveries of quantum entanglement that shifts the bag's weight juxtaposed to earth's gravitational force. Using a series of micro-sonic generators that produce a precise frequency of electromagnetic energy, the bag becomes negatively charged which causes its overall weight to feel much lighter to its wearer.*\n\nIt's gets better: *\"The contents of the bag are essentially being sent into sort of a pocket dimension\", one of the researches related. \"It presents a stage for new and innovative technologies that we are eagerly studying for other applications*\"\n\nWow if this is legit, my dream of an ME universe is closer than I thought....yea I'll see myself out.",
      "score": 26,
      "created_utc": 1734794738.0,
      "replies": [
        {
          "id": "m35dfc9",
          "author": "serotoninOD",
          "body": "Wait, what? I just read the whole article and it doesn't say any of that.",
          "score": 32,
          "created_utc": 1734795985.0,
          "replies": [
            {
              "id": "m39ty7w",
              "author": "LOUD-AF",
              "body": "You're reading the 2030 archived version. It's 2071 now. catch up slowpoke. Check your calendar.",
              "score": 1,
              "created_utc": 1734869021.0,
              "replies": []
            },
            {
              "id": "m35eurt",
              "author": "blackout-loud",
              "body": "You couldn't have missed it, it was literally in the first paragraphs!...jk jk",
              "score": -16,
              "created_utc": 1734796494.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m35ciso",
          "author": "Leap_Kill_Reset",
          "body": "Never have I seen such bullshit pseudoscience buzzword vomit",
          "score": 76,
          "created_utc": 1734795656.0,
          "replies": [
            {
              "id": "m35kub8",
              "author": "None",
              "body": "That’s because the journal article doesn’t say any of those words. It’s just a mechanical dampener with some AI prediction properties to help optimize load bearing for wearer comfort.",
              "score": 13,
              "created_utc": 1734798585.0,
              "replies": []
            },
            {
              "id": "m35f6fm",
              "author": "HugeHouseplant",
              "body": "No it’s a literal pocket dimension supported by science you just don’t understand it so you’re calling to pseudoscience.  \n\nIt’s magic",
              "score": 13,
              "created_utc": 1734796610.0,
              "replies": [
                {
                  "id": "m35ghle",
                  "author": "None",
                  "body": "We did it. We fuckin did it. Bags of holding are finally real",
                  "score": 18,
                  "created_utc": 1734797075.0,
                  "replies": [
                    {
                      "id": "m35mk94",
                      "author": "SumonaFlorence",
                      "body": "Haris Pilton would be pleased.",
                      "score": 3,
                      "created_utc": 1734799174.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m38wpvl",
                  "author": "Wonderful_Common_520",
                  "body": "Ive got a raging pocket dimension right now",
                  "score": 2,
                  "created_utc": 1734845973.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m35cr4f",
              "author": "blackout-loud",
              "body": "Say you loved it!",
              "score": 7,
              "created_utc": 1734795740.0,
              "replies": []
            },
            {
              "id": "m35kxhj",
              "author": "LuckyEmoKid",
              "body": "Did *you* read the article?",
              "score": 2,
              "created_utc": 1734798615.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m35dyjp",
          "author": "16sardim",
          "body": "I-Is this a meme? Chat help I can’t tell anymore. It’s not in…not in the article I",
          "score": 12,
          "created_utc": 1734796175.0,
          "replies": [
            {
              "id": "m35jdym",
              "author": "Narananas",
              "body": "I think it's based on how Google described their new chip",
              "score": 3,
              "created_utc": 1734798086.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m35kwtu",
          "author": "None",
          "body": "[deleted]",
          "score": 9,
          "created_utc": 1734798609.0,
          "replies": [
            {
              "id": "m35qeko",
              "author": "blackout-loud",
              "body": "That's the joke 🤣",
              "score": -7,
              "created_utc": 1734800513.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m35bof2",
          "author": "ledbedder20",
          "body": "ME?",
          "score": 4,
          "created_utc": 1734795351.0,
          "replies": [
            {
              "id": "m35c0mr",
              "author": "Educational-Mess-508",
              "body": "Mass Effect",
              "score": 4,
              "created_utc": 1734795474.0,
              "replies": [
                {
                  "id": "m35dqsr",
                  "author": "ledbedder20",
                  "body": "Ahhhh....thank you",
                  "score": 3,
                  "created_utc": 1734796098.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35ha5r",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1734797354.0,
          "replies": [
            {
              "id": "m35hlkm",
              "author": "blackout-loud",
              "body": "Yea, that was the joke",
              "score": 2,
              "created_utc": 1734797464.0,
              "replies": [
                {
                  "id": "m35i9fz",
                  "author": "Solcaer",
                  "body": "wait that’s pretty funny",
                  "score": 2,
                  "created_utc": 1734797695.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35mvkk",
          "author": "Fermi_Amarti",
          "body": "Is that really what it says? Lol Still. You can't trick me. I'm still too lazy to click the link. Lol",
          "score": 2,
          "created_utc": 1734799282.0,
          "replies": [
            {
              "id": "m35q9og",
              "author": "blackout-loud",
              "body": "😂 take the bait dammit",
              "score": 2,
              "created_utc": 1734800463.0,
              "replies": [
                {
                  "id": "m35r3yp",
                  "author": "Fermi_Amarti",
                  "body": "Sonofabich i knew it. You fucking liar.",
                  "score": 2,
                  "created_utc": 1734800767.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35vzpr",
          "author": "Awkward-Customer",
          "body": "No matter what you say, you're not gonna convince me to read the article and I'm just gonna take you at your word that the text you \"quoted\" actually comes from the article :-p",
          "score": 2,
          "created_utc": 1734802499.0,
          "replies": []
        },
        {
          "id": "m36ysn1",
          "author": "eisbock",
          "body": "I gotta say, I applaud the lack of /s. You know you've succeeded when you get dozens of angry replies to what should be an obvious joke.",
          "score": 2,
          "created_utc": 1734816088.0,
          "replies": [
            {
              "id": "m3726j9",
              "author": "blackout-loud",
              "body": "Thank you. I'm glad someone appreciated my efforts and actually got the joke.",
              "score": 1,
              "created_utc": 1734817337.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m35e0tu",
          "author": "Hushwater",
          "body": "That's all bullshit and it's the same one on shock absorbers from several years ago that added more weight then just having a regular backpack.",
          "score": 1,
          "created_utc": 1734796198.0,
          "replies": []
        },
        {
          "id": "m35k8is",
          "author": "Significant-Ad1890",
          "body": "So you telling me that this has nothing to do with AI and has whatsoever nothing related to AI? This is a shitty product.",
          "score": 1,
          "created_utc": 1734798377.0,
          "replies": []
        },
        {
          "id": "m35ca5d",
          "author": "danielv123",
          "body": "I am sorry wtf that's way way more weird than what I expected.",
          "score": 0,
          "created_utc": 1734795569.0,
          "replies": []
        },
        {
          "id": "m35e9rf",
          "author": "Podrick_Targaryen",
          "body": "I'm surprised it's not run by AI.  Needs more buzzwords.",
          "score": -1,
          "created_utc": 1734796286.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m35h1rj",
      "author": "pokipc",
      "body": "Reminds me of when we had hoverboards as a kid!!!  There was one dude, a bit of a tool, who had one with power…. Can’t remember his name….",
      "score": 2,
      "created_utc": 1734797273.0,
      "replies": []
    },
    {
      "id": "m35i6d7",
      "author": "Noodly_Appendage_24",
      "body": "Even if it does what it says it does, I doubt it would even be enough to negate the extra weight of all the stuff that makes it do the things it supposedly does.",
      "score": 2,
      "created_utc": 1734797665.0,
      "replies": []
    },
    {
      "id": "m35ibr9",
      "author": "KrazyBobby",
      "body": "Oh man I hope I see it on sale at Walmart soon!",
      "score": 2,
      "created_utc": 1734797718.0,
      "replies": []
    },
    {
      "id": "m36wlcg",
      "author": "None",
      "body": "Been done before and it's crap. Gimmicks",
      "score": 2,
      "created_utc": 1734815285.0,
      "replies": []
    },
    {
      "id": "m36zzkk",
      "author": "Tofukjtten",
      "body": "This was done 15 fucking years ago why is this being posted as if it's new?",
      "score": 2,
      "created_utc": 1734816524.0,
      "replies": []
    },
    {
      "id": "m373v77",
      "author": "Usernametaken1121",
      "body": "Paid promotions are acceptable content for this sub? Wow, what a disgrace.",
      "score": 2,
      "created_utc": 1734817951.0,
      "replies": []
    },
    {
      "id": "m3752u4",
      "author": "daakadence",
      "body": "Put a jetpack on that and now we're talkin'",
      "score": 2,
      "created_utc": 1734818385.0,
      "replies": []
    },
    {
      "id": "m375vlv",
      "author": "IrishHambo",
      "body": "![gif](giphy|ZMpBuMZxHULdfaPDvd)",
      "score": 2,
      "created_utc": 1734818679.0,
      "replies": []
    },
    {
      "id": "m37edwg",
      "author": "Intrigued1423",
      "body": "I call bullcrap. If the load is 100lbs no matter how you redistribute to load for gate or balance, it’s still 100lbs.",
      "score": 2,
      "created_utc": 1734821894.0,
      "replies": []
    },
    {
      "id": "m37pcbx",
      "author": "Craic-Den",
      "body": "[I've seen this prototype before](https://youtu.be/jqzbU6OTVUg?si=TF2BLng39GrXiojv)",
      "score": 2,
      "created_utc": 1734826297.0,
      "replies": []
    },
    {
      "id": "m37stvf",
      "author": "Icy_Celebration1200",
      "body": "The position of the load can be adjusted by the electromagnetic damping force from motors without consuming additional electrical energy",
      "score": 2,
      "created_utc": 1734827699.0,
      "replies": []
    },
    {
      "id": "m37wqjd",
      "author": "Jim_84",
      "body": "Marketing BS. It takes the exact same amount of energy to carry an particular amount of weight a particular distance. The only difference a backpack can make is comfort.",
      "score": 2,
      "created_utc": 1734829319.0,
      "replies": []
    },
    {
      "id": "m390c2m",
      "author": "CarryOnRTW",
      "body": "The Law of Conservation of Energy and Steve Climber would like to talk to this group in China.",
      "score": 2,
      "created_utc": 1734848131.0,
      "replies": []
    },
    {
      "id": "m35dkdv",
      "author": "Rabo_McDongleberry",
      "body": "This sounds like such bullshit. Is this written by a hallucinating AI?",
      "score": 4,
      "created_utc": 1734796034.0,
      "replies": [
        {
          "id": "m35hiry",
          "author": "Solcaer",
          "body": "what part sounds like bullshit? Just seems somewhat overengineered to me",
          "score": -1,
          "created_utc": 1734797436.0,
          "replies": [
            {
              "id": "m35it2i",
              "author": "HyruleanGentleman",
              "body": "The part where the physics sounds like complete bullshit",
              "score": 2,
              "created_utc": 1734797886.0,
              "replies": [
                {
                  "id": "m35njmn",
                  "author": "Solcaer",
                  "body": "which. part.",
                  "score": 2,
                  "created_utc": 1734799509.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m35dda7",
      "author": "c4ad",
      "body": "Bag of Holding 2,500gp",
      "score": 2,
      "created_utc": 1734795964.0,
      "replies": []
    },
    {
      "id": "m35dczs",
      "author": "BellsOnNutsMeansXmas",
      "body": "Or just wrap loose shit with bubble wrap. Robotic backpack CEOs hate me for this one simple trick.",
      "score": 1,
      "created_utc": 1734795961.0,
      "replies": []
    },
    {
      "id": "m35en3a",
      "author": "BeersTeddy",
      "body": "Wouldn't a bag suspended on some springs achieve the same goal?",
      "score": 1,
      "created_utc": 1734796418.0,
      "replies": []
    },
    {
      "id": "m35j4wt",
      "author": "PorcelainCeramic",
      "body": "Selling another placebo I see.",
      "score": 1,
      "created_utc": 1734797998.0,
      "replies": []
    },
    {
      "id": "m35ntda",
      "author": "Lott4984",
      "body": "The trouble with backpacks is the center on mass changes as more and more item are placed in the backpack.  This causes you to lean farther forward to compensate for the center of mass moving farther away from your body.  The farther you lean forward the more strain that goes on your lower back.  The closer you can get your center of mass straight up and down lowers strain on your back, because when your spine is aligned more of the weight is distrubuted over your whole spine. It appears by the picture they are using a weight attached to the frame and that the hiker is still leaning forward to compensate for that weight.  But the weight has a center of mass much closer to the hikers back than a fully loaded pack, thus less strain on the hikers back.   If you pack your pack with the heavy objects as close to your back as possible that would reduce the strain on your back.  But that is not easily done.",
      "score": 1,
      "created_utc": 1734799601.0,
      "replies": []
    },
    {
      "id": "m35oh8f",
      "author": "DarklyDreamingEva",
      "body": "And it can be yours for just 3 payments of $5,999!",
      "score": 1,
      "created_utc": 1734799828.0,
      "replies": []
    },
    {
      "id": "m35r1en",
      "author": "2JarSlave",
      "body": "What are you? The gravity police?",
      "score": 1,
      "created_utc": 1734800742.0,
      "replies": []
    },
    {
      "id": "m35trjw",
      "author": "Lsfnzo",
      "body": "![gif](giphy|CglumrQL3ilVGivRHo|downsized)",
      "score": 1,
      "created_utc": 1734801709.0,
      "replies": []
    },
    {
      "id": "m35x9rj",
      "author": "Inform-All",
      "body": "But will it still make a puddle of sweat on my back?",
      "score": 1,
      "created_utc": 1734802941.0,
      "replies": []
    },
    {
      "id": "m36ekjb",
      "author": "ApprehensiveStrut",
      "body": "Would have been great to have for middle school /HS",
      "score": 1,
      "created_utc": 1734808838.0,
      "replies": []
    },
    {
      "id": "m36rgtn",
      "author": "sneekystick97",
      "body": "Sam Bridges rn: 👹",
      "score": 1,
      "created_utc": 1734813422.0,
      "replies": []
    },
    {
      "id": "m36si15",
      "author": "Dorkatron77011",
      "body": "Death Stranding .. is that you?",
      "score": 1,
      "created_utc": 1734813795.0,
      "replies": []
    },
    {
      "id": "m36tfm8",
      "author": "None",
      "body": "They've had this for years. British Army even tried integrating it with the Virtus system. Can't say I knew a single person who actually fitted and used it, but perhaps it makes more sense for civys",
      "score": 1,
      "created_utc": 1734814137.0,
      "replies": []
    },
    {
      "id": "m36weib",
      "author": "Malice_Flare",
      "body": "and, here i thought, people were on our way to create inertial dampeners. heh...",
      "score": 1,
      "created_utc": 1734815216.0,
      "replies": []
    },
    {
      "id": "m371noa",
      "author": "blueeyedkittens",
      "body": "Sounds like they took a damper from a skyscraper and scaled it down to backpack size.",
      "score": 1,
      "created_utc": 1734817145.0,
      "replies": []
    },
    {
      "id": "m373903",
      "author": "None",
      "body": "Doesn’t work in real life scenarios, and this feels like an ad",
      "score": 1,
      "created_utc": 1734817726.0,
      "replies": []
    },
    {
      "id": "m379uaz",
      "author": "No_Commission_8152",
      "body": "RemindMe! 500 days",
      "score": 1,
      "created_utc": 1734820149.0,
      "replies": []
    },
    {
      "id": "m37fiui",
      "author": "Naive-Home6785",
      "body": "What if you want it to be energy inefficient because you are carrying load for exercise!",
      "score": 1,
      "created_utc": 1734822341.0,
      "replies": []
    },
    {
      "id": "m38vscs",
      "author": "elasmonut",
      "body": "Sensible packs have had compression straps for about....I dunno since we could work leather!? Sounds like a computerised paperweight to me.",
      "score": 1,
      "created_utc": 1734845451.0,
      "replies": []
    },
    {
      "id": "m38xqey",
      "author": "None",
      "body": "Yeah, the amount of weight in that frame isnt going to benefit you a whole much.",
      "score": 1,
      "created_utc": 1734846556.0,
      "replies": []
    },
    {
      "id": "m398uj3",
      "author": "WyrlessFreequincy",
      "body": "Death stranding solved this already",
      "score": 1,
      "created_utc": 1734853869.0,
      "replies": []
    },
    {
      "id": "m39qfct",
      "author": "zillskillnillfrill",
      "body": "Don't they have these backpacks in death Stranding?",
      "score": 1,
      "created_utc": 1734866638.0,
      "replies": []
    },
    {
      "id": "m3h6gx8",
      "author": "cloudcity",
      "body": "Basic physics are undefeated folks, this has been tested and proven to be a very dumb product.",
      "score": 1,
      "created_utc": 1734980153.0,
      "replies": []
    },
    {
      "id": "m35b3rm",
      "author": "Short-Stomach-8502",
      "body": "lol",
      "score": 1,
      "created_utc": 1734795148.0,
      "replies": []
    },
    {
      "id": "m35jj1k",
      "author": "dstarr3",
      "body": "So we can cancel out inertia now? That's some Protomolecule shit right there",
      "score": 1,
      "created_utc": 1734798134.0,
      "replies": []
    },
    {
      "id": "m362bwu",
      "author": "corrector300",
      "body": "\n>“Our next steps will involve integrating intelligent algorithms to enable the suspension backpack to adapt to a broader range of movement patterns, such as jumping,” \n\nSmart! Aiming at the world-wide camping-parcour market.",
      "score": 0,
      "created_utc": 1734804694.0,
      "replies": []
    },
    {
      "id": "m36bin9",
      "author": "Electronic-Bear2030",
      "body": "I’ve had something like that for years…I call it “make the wife carry it”. There is literally no stress on anything except my ears…",
      "score": 0,
      "created_utc": 1734807790.0,
      "replies": []
    },
    {
      "id": "m36pbf1",
      "author": "Divinetank",
      "body": "Or you can just pack your bag properly.",
      "score": 0,
      "created_utc": 1734812645.0,
      "replies": []
    },
    {
      "id": "m37g1fo",
      "author": "None",
      "body": "Maybe it’s for robots, not humans, why are all you guys talking about hiking? lol hiking doesn’t make money.",
      "score": 0,
      "created_utc": 1734822551.0,
      "replies": []
    },
    {
      "id": "m39q92d",
      "author": "MoirasPurpleOrb",
      "body": "Such an unnecessary invention.",
      "score": 0,
      "created_utc": 1734866516.0,
      "replies": []
    },
    {
      "id": "m38nzzi",
      "author": "Capital_Historian685",
      "body": "\"...\\[C\\]an reduce energy expenditure more than 11 percent for users, compared to an ordinary backpack.\"  Sounds good.  This will allow hikers to bring a camp chair and an iPad (for movies) and still be under the required 10lb UL weight limit!",
      "score": -1,
      "created_utc": 1734841340.0,
      "replies": []
    }
  ]
}