{
  "post": {
    "title": "It’s time for Logitech to make a real Forever Mouse | Logitech needs to do better than its meager deal with iFixit.",
    "author": "a_Ninja_b0y",
    "id": "1kpefz8",
    "score": 1438,
    "created_utc": 1747553652.0,
    "selftext": "",
    "num_comments": 306,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kpefz8/its_time_for_logitech_to_make_a_real_forever/"
  },
  "comments": [
    {
      "id": "msxasp8",
      "author": "re_carn",
      "body": "4 \"genuine Logitech screws\" for 10 dollars... I would more likely just buy a new mouse from a different vendor.",
      "score": 126,
      "created_utc": 1747556942.0,
      "replies": [
        {
          "id": "msxpxu9",
          "author": "unassumingdink",
          "body": "What's that, like a 100,000% markup?",
          "score": 38,
          "created_utc": 1747566241.0,
          "replies": [
            {
              "id": "msy3ezm",
              "author": "ClearAndPure",
              "body": "Have to cover shipping somehow",
              "score": -11,
              "created_utc": 1747572637.0,
              "replies": [
                {
                  "id": "msyox3r",
                  "author": "10Visionary",
                  "body": "GUYS THIS COMMENT IS A JOKE YOU FUCKING IDIOTS",
                  "score": -26,
                  "created_utc": 1747580245.0,
                  "replies": [
                    {
                      "id": "msza66n",
                      "author": "guyFierisPinky",
                      "body": "get madder",
                      "score": 6,
                      "created_utc": 1747587058.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mszpu32",
          "author": "rabbitthunder",
          "body": "And therein lies the problem. Companies don't want to sell forever products or parts at a reasonable price. Either of those things cannibalises sales. Logitech used to be decent but over the last ~10 years every product I bought from them failed and most of them within the warranty period (2 years in the EU). When my last keyboard died I switched to another brand and when my mouse dies I'll be switching away from Logitech altogether. Forever products would be ideal but looking to Logitech to provide them seems foolish.",
          "score": 14,
          "created_utc": 1747591880.0,
          "replies": [
            {
              "id": "mt0bvlw",
              "author": "hextanerf",
              "body": "Just like every commercial product these days. Fans, clothes, cars, mice",
              "score": 3,
              "created_utc": 1747598994.0,
              "replies": []
            },
            {
              "id": "mt0ttdt",
              "author": "Emu1981",
              "body": "I used to be a huge fan of Logitech products starting with a MX518 mouse about 20 years ago.  My experience from 2014 onwards with Logitech products drove me away from the brand though.  I currently use a Steelseries keyboard and a Corsair mouse which have been working great for years.",
              "score": 3,
              "created_utc": 1747604751.0,
              "replies": []
            },
            {
              "id": "mt0krha",
              "author": "spooooork",
              "body": "> 2 years in the EU\n\nFor about two thirds of the countries in the EU/EEC. [Several have longer](https://i.imgur.com/USXJdvX.png), with Ireland and the UK minus Scotland leading with 6 years (barring changes since Brexit).\n\n[Source](https://www.forbrukereuropa.no/wp-content/uploads/2017/02/Commercial-warranties.pdf)",
              "score": 1,
              "created_utc": 1747601795.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt0p7ta",
          "author": "Avendork",
          "body": "I wish industries would switch to standardised screws that can easily be found in local hardware stores. Its so dumb to pack and ship 4 screws.",
          "score": 4,
          "created_utc": 1747603227.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msx8d0r",
      "author": "ChefJoe98136",
      "body": "I got really good at replacing the omron switches in my Logitech performance mx mice after getting tired of warranty replacements having problems with click drag select actions.",
      "score": 193,
      "created_utc": 1747555398.0,
      "replies": [
        {
          "id": "msxcqpb",
          "author": "SarcoZQ",
          "body": "The fact I know what you're talking about and that I know the exact product# of my Omron switches is testament to the fact things aren't much different on the Razer end.",
          "score": 102,
          "created_utc": 1747558175.0,
          "replies": [
            {
              "id": "msyeeqs",
              "author": "None",
              "body": "[deleted]",
              "score": 16,
              "created_utc": 1747576802.0,
              "replies": [
                {
                  "id": "msz8ev2",
                  "author": "OcculusSniffed",
                  "body": "I didn't even realize how badly I needed to read this thread.  Gonna see what options there are for my G602",
                  "score": 6,
                  "created_utc": 1747586504.0,
                  "replies": []
                },
                {
                  "id": "mt0w721",
                  "author": "Emu1981",
                  "body": ">omron just dont make good switches.\n\nOmron makes at least two tiers of switches and Logitech does not use the top tier ones (apparently the ones made in China are not good but the ones made in Japan are).  The Omron switches in my Corsair mouse are still going fine after over 5 years of heavy usage - the internal battery on the other hand really needs a replacement lol",
                  "score": 5,
                  "created_utc": 1747605553.0,
                  "replies": []
                },
                {
                  "id": "mszkamp",
                  "author": "TheRealSectimus",
                  "body": "Omg I love my g600 and all it's goofy buttons but it's really showing its age. Is this particularly hard to do?",
                  "score": 1,
                  "created_utc": 1747590164.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msxe0oc",
              "author": "Unizzy",
              "body": "Razer aint better quality wise except they give 2 years warranty where I am. So that makes all the difference.",
              "score": 8,
              "created_utc": 1747558981.0,
              "replies": [
                {
                  "id": "msyhmqr",
                  "author": "iswedlvera",
                  "body": "I used to use Razer, but the lasers kept dying every year or so. I once replaced a Lachesis on warranty only to have the second one die shortly after. I moved to Logitech and haven't replaced my mouse in 10 years.",
                  "score": 4,
                  "created_utc": 1747577890.0,
                  "replies": [
                    {
                      "id": "mt2elum",
                      "author": "bonesnaps",
                      "body": "My razer mice have lasted forever.\n\n\nDeath adder v1 is at like 10 years of use, now has a side mouse button that sank in, otherwise still works.\n\n\nBasilisk v2 is at about 4 years use with no issues.",
                      "score": 1,
                      "created_utc": 1747626158.0,
                      "replies": []
                    },
                    {
                      "id": "mt4qzwh",
                      "author": "TheAmorphous",
                      "body": "I was a die-hard Razr supporter for years because they were the only company willing to put out left-handed models. They stopped doing that a long time ago though, unfortunately. Now there are really no good left-handed options at all.",
                      "score": 1,
                      "created_utc": 1747666743.0,
                      "replies": []
                    },
                    {
                      "id": "msyi6h8",
                      "author": "Unizzy",
                      "body": "Yea... Well both company have quality issues imo... But 2 years vs 1 year warranty is where I sit....  My current razer has all it's side rubber padding worn down to bear shell plastic, but I still got 1 year warranty left for the important stuff I guess",
                      "score": 1,
                      "created_utc": 1747578073.0,
                      "replies": [
                        {
                          "id": "msynnyo",
                          "author": "alidan",
                          "body": "I had 7 warranty replacements of my naga, thats when I went to logitech. \n\nsadly logitech discontinued the g600 and I need to deal with switch replacements for the middle click.",
                          "score": 3,
                          "created_utc": 1747579841.0,
                          "replies": [
                            {
                              "id": "msyvzi4",
                              "author": "f-stop4",
                              "body": "The G604 has been my go-to for the past 4 years and I *just* found out they discontinued it like, over a year ago.\n\nHonestly, I'm not surprised because I've gone through three of them and each one has double click switch problems.\n\nI'm looking at the Razer Naga V2 Pro because there doesn't seem to be anything else on the market that matches what the G604 offers but I'm floored it's selling for ~$170...\n\nI'm pretty sure I got my G604 for like $60...",
                              "score": 1,
                              "created_utc": 1747582523.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mt7ky1s",
              "author": "goDie61",
              "body": "Like anything, if you want an enduring product, it's going to come from a brand you don't find at best buy. Endgame gear have a few models with toolless switch replacement, even.",
              "score": 1,
              "created_utc": 1747697991.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxkwcm",
          "author": "TheTerrasque",
          "body": "I've bought logitech mice for a decade, simply because they're the only ones that made good wireless mice with many side buttons. I tried some others but it was always something off for them for my use.\n\nEvery. Single. One have had mouse button problems after a year or two. We're talking like 7 mice here.",
          "score": 34,
          "created_utc": 1747563312.0,
          "replies": [
            {
              "id": "msyahxh",
              "author": "goblue123",
              "body": "Just as a counterpoint… I bought my first MX in 2008 (refurb). I wanted Bluetooth and a snazzy new color so I got a new one in 2017. I’m still using that one. \n\nOf course now that I posted this it’s probably going to break within the week.",
              "score": 7,
              "created_utc": 1747575394.0,
              "replies": [
                {
                  "id": "msyl8t5",
                  "author": "Alloy202",
                  "body": "I still have my master mx 1 from 2015. Still use it fairly regularly.  Nothing wrong with it apart from normal wear.",
                  "score": 2,
                  "created_utc": 1747579075.0,
                  "replies": []
                },
                {
                  "id": "mszsra7",
                  "author": "Aleyla",
                  "body": "I just replaced my mx master that I’ve had since 2017.  Not because it was worn out, just because I wanted a different color.",
                  "score": 1,
                  "created_utc": 1747592808.0,
                  "replies": []
                },
                {
                  "id": "mt0mpvq",
                  "author": "spooooork",
                  "body": "My MX1000 lasted over 15 years",
                  "score": 1,
                  "created_utc": 1747602417.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msxqmze",
              "author": "zkareface",
              "body": "I swapped to Logitech because it's the only brand where the switches hasn't failed me yet. \n\nAt least the g502. Other brands (Qpad, Steelseries, Razer etc) would fail in 3-6 months but Logitech at least lasts few years.",
              "score": 6,
              "created_utc": 1747566618.0,
              "replies": [
                {
                  "id": "msyujn0",
                  "author": "ryzouken",
                  "body": "My g502 is still holding strong after 9 years.",
                  "score": 4,
                  "created_utc": 1747582062.0,
                  "replies": []
                },
                {
                  "id": "msywpmi",
                  "author": "trowayit",
                  "body": "About 5 years ago, I bought three g502s off Amazon when they were on sale for $30.  Two are still in the box in my closet.",
                  "score": 3,
                  "created_utc": 1747582759.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msyzt9t",
              "author": "GrynaiTaip",
              "body": "I use M705 with my laptop, it's the best mouse ever because battery lasts for 2-3 years of daily use. The first one has that same problem after about 5 years, so I bought a new one. That one lasted the same 5 years but now I bought new Omron switches instead of replacing the whole mouse.",
              "score": 1,
              "created_utc": 1747583743.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxsifh",
          "author": "Quithelion",
          "body": "Meanwhile I periodically needed to pry open these Omron mechanical switches to re-bend the metal piece so it become springy again and doesn't double click on single press.\n\nI got fed up, and bought Razer's mouse with optical switches. Works great with a few hiccup of not registering click. Then the effing scroll wheel acting up because of its mechanical design which will rust or clogged with dust, instead of Logitech's optical scroll wheel that worked well.\n\nThese mouse makers need to make up their effing mind when their gaming mice are now cost as much as mechanical keyboards from 10+ years ago.\n\nI don't need 1 million DPI. I need a painless working mouse for the price I paid.",
          "score": 9,
          "created_utc": 1747567610.0,
          "replies": [
            {
              "id": "msy8zjr",
              "author": "crochettankenfaus",
              "body": "you can replace the metal piece with one from a new switch so you dont need to solder a new switch in. switches are <$1 on aliexpress",
              "score": 2,
              "created_utc": 1747574825.0,
              "replies": []
            },
            {
              "id": "mszda96",
              "author": "ToMorrowsEnd",
              "body": "learn how to solder and replace the switches with far better quality ones.  the switches in all mice are the cheapest crap they can get. there is a whole industry around people upgrading gaming mice with very high end switches.",
              "score": 1,
              "created_utc": 1747588026.0,
              "replies": []
            },
            {
              "id": "mt0mifq",
              "author": "MWink64",
              "body": "I've had two Logitech mice develop scroll wheel issues (in addition to failing micro switches) in recent years. One degraded into that disgusting sticky goo. The other just started sporadically going nuts. Their modern mice definitely aren't built to last. Meanwhile, I have a TrackMan Marble that's probably over 20 years old and still works perfectly.",
              "score": 1,
              "created_utc": 1747602352.0,
              "replies": []
            },
            {
              "id": "msyozes",
              "author": "TrptJim",
              "body": "At least Logitech is good on their warranty and lets you keep the old mouse. I get a brand new replacement, and then repair the broken one. I have three G Pro 2's and only bought the first one.",
              "score": 1,
              "created_utc": 1747580266.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msy74k7",
          "author": "LOGPchwan",
          "body": "Do you need solder or anything to replace mouse switches? I've had a 50$ equivalent of local brand wireless mice for almost three years. It's working very well so far, but if the time comes and I don't want to switch, I would like to know if soldering is necessary.",
          "score": 3,
          "created_utc": 1747574109.0,
          "replies": [
            {
              "id": "msylgyx",
              "author": "msherretz",
              "body": "Yes you do, but it isn't difficult. Multiple videos on YT",
              "score": 2,
              "created_utc": 1747579147.0,
              "replies": []
            },
            {
              "id": "mszf9m1",
              "author": "iamacannibal",
              "body": "Soldering is required to replace switches on almost every mouse. There is hot swappable switches now but it's still new and nothing mainstream has that ability. I only know of one mouse that does. \n\nIt's super easy to replace switches though. a $15 solder kit from amazon would have everything needed. \n\nEach switch will have 3 pins. You need to desolder the pins and most kits will come with 2 ways to do that. either a plunger type thing that sucks the solder off once it's hot or solder wick with is basically woven copper that the solder sticks to really well. Both are easy to use. \n\nIt's a really good beginner project for soldering since it's easy and you can learn a few different things when doing it.",
              "score": 2,
              "created_utc": 1747588634.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msyawcy",
          "author": "Pauly_Amorous",
          "body": "> having problems with click drag select actions.\n\nI have to replace an MX Ergo every year or two because of this. Gonnna try out a ProtoArc EM01NL next time though. (No affiliation with the company.)",
          "score": 2,
          "created_utc": 1747575543.0,
          "replies": []
        },
        {
          "id": "msydvtg",
          "author": "jarc1",
          "body": "So as I'm on like my 5th Logitech mouse. What switches do I need to fix the click issue? If you have a sec, send me a link for homework please.",
          "score": 1,
          "created_utc": 1747576616.0,
          "replies": [
            {
              "id": "mt1m14n",
              "author": "ChefJoe98136",
              "body": "There's been a couple of ways to fix it. I ordered a 10 pack of the same model omron switches off ebay many years ago and have used my soldering iron to heat up the old switch pegs while prying with an old soldering pick that came with my ancient radio shack soldering kit. Then I put the new switches into the holes, usually having to heat things up to make room in the hole and add a little fresh solder. There were teardowns and instructions from others to help guide what model to seek out for switches.\n\nSome folks have a solder-less method that involves prying so switch case clips open up and then swapping out the internal leaf spring thing and re-assembly. I do not do that method.",
              "score": 2,
              "created_utc": 1747614926.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt0i18l",
          "author": "Evocatorum",
          "body": "Omron!  That's the brand.  I was trying to recall for a different response, so thanks :-)",
          "score": 1,
          "created_utc": 1747600941.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msyfjbm",
      "author": "lordraiden007",
      "body": "I’d be happy if they just released a refreshed G600. Very few mice fit in its niche, and their lack of production has made prices soar. There isn’t even a viable alternative on the market, and hasn’t been for over a decade.\n\nLuckily the little bastards are robust and extremely resilient to failure, but I’m dreading the day that my mouse finally starts developing some faults, because replacing it will cost hundreds of dollars.",
      "score": 17,
      "created_utc": 1747577195.0,
      "replies": [
        {
          "id": "mszk3ob",
          "author": "Ty_Lee98",
          "body": "Yeah I seriously need another g600 refresh or a better alternative. Something lighter, better sensor, and durable buttons. It's just so useful....",
          "score": 4,
          "created_utc": 1747590107.0,
          "replies": []
        },
        {
          "id": "mt2loxk",
          "author": "Disciple153",
          "body": "Same here.\n\nI started with the 602, and now I have the 604. Unfortunately the switches on my 604 wore out, so I had to replace them. If I wasn't so handy I would have either had to buy one used or buy an inferior mouse (for my purposes).",
          "score": 1,
          "created_utc": 1747629594.0,
          "replies": []
        },
        {
          "id": "mt8ir4l",
          "author": "DustyBottoms1111",
          "body": "Yeah, my g600 started having issues last year and I was lucky enough to find a good condition used one that I will have to hope lasts until they make a new model. Really don't want to have to go back to the Razer Naga when I like the g600 much better.",
          "score": 1,
          "created_utc": 1747710752.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msyfmru",
      "author": "darknezx",
      "body": "My Logitech mice always failed around the 1.5 years mark, with that frustrating click issue where one click became a double click sometimes. Never buying from Logitech again.",
      "score": 49,
      "created_utc": 1747577227.0,
      "replies": [
        {
          "id": "mt09zmc",
          "author": "CelestialFury",
          "body": "It's pretty crazy since I still have a logitech mouse from two decades ago and it still works great.  However, I've become a member of the dark arts of the trackball mice, so it doesn't get much use anymore.",
          "score": 16,
          "created_utc": 1747598382.0,
          "replies": []
        },
        {
          "id": "mt0gktg",
          "author": "Berkut22",
          "body": "My G502 started doing that, so I bought replacement switches. Then it stopped, and hasn't returned. It's been a couple years.\n\nI like to think it realized I was going to open it up and operate on it, and probably do a shitty job of it, and that scared it straight.",
          "score": 8,
          "created_utc": 1747600488.0,
          "replies": []
        },
        {
          "id": "mt0gqp0",
          "author": "wreeper007",
          "body": "I’ve had several so far do that, ended up buying new switches and just soldered them.",
          "score": 1,
          "created_utc": 1747600539.0,
          "replies": [
            {
              "id": "mt2ldk8",
              "author": "darknezx",
              "body": "I'm a hardware repair noob so the thought of using a solder terrifies me. It's a shame because those mice are still in my drawer and I'd love to repair them myself, but practically it feels like they'll stay broken for the next decade. :(",
              "score": 1,
              "created_utc": 1747629435.0,
              "replies": [
                {
                  "id": "mt2no9d",
                  "author": "wreeper007",
                  "body": "I hadn’t soldered for many years but it was a pretty straightforward process. Luckily they’re punched through and not surface mounted so it was pretty simple",
                  "score": 1,
                  "created_utc": 1747630614.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mt8j17z",
          "author": "omp_",
          "body": "The same thing happened with both of my g203s.  The wheel on my steelseries didn't last very long either.  When my Asus allegedly Tuf mouse conks out, I'm just going to buy the cheapest Chinese mouse I can find on Amazon because brand names don't seem to matter much in mouse world.",
          "score": 1,
          "created_utc": 1747710874.0,
          "replies": [
            {
              "id": "mt8x0oe",
              "author": "darknezx",
              "body": "That's exactly what I did. The Chinese mice weren't so great to hold, but they've been nearly indestructible. And once it shows wear and tear I might as well buy a new one, but mostly it doesn't get there because the build quality is decent.",
              "score": 1,
              "created_utc": 1747717431.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msx8xwj",
      "author": "terrytek",
      "body": "I’ve only had one issue with my G903 double clicking but thankfully it happened within warranty and they sent me a new unit circa 2021 and it hasn’t failed me since. Still looks more or less brand new if a bit shinier that’s it. For an 80 dollar ambidextrous mouse I can’t complain about durability (a usb c charge port would be nice though)",
      "score": 36,
      "created_utc": 1747555763.0,
      "replies": [
        {
          "id": "msxjaw7",
          "author": "GravityRabbit",
          "body": "I've had this problem on all 4 of my previous logitech mice, including the one I'm using right now, always outside of warranty. I bought a new switch to replace it instead of buying a new mouse, but haven't taken the time to solder it in yet. I wish they'd use higher quality switches.",
          "score": 15,
          "created_utc": 1747562334.0,
          "replies": [
            {
              "id": "mt0boej",
              "author": "hextanerf",
              "body": "I've only had that problem with their gaming mice. Went through two and decided to go back to m720",
              "score": 1,
              "created_utc": 1747598930.0,
              "replies": []
            },
            {
              "id": "msyh6s0",
              "author": "iswedlvera",
              "body": "Yes, they use the cheap Omron switches made in china instead of the better quality Japanese ones. It's not too hard to desolder and swap them out. my g900 has been my daily driver these last 10 years, and I had to change the switches 2-3 years ago to the Japanese ones. I'm still very happy with the overall quality of the mouse. Switches are consumable products, after all.",
              "score": -2,
              "created_utc": 1747577746.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt0gomd",
          "author": "Evocatorum",
          "body": "The switches they use inside are (or were anyway) cheap to buy and replace \\*\\*(Omrons)\\*\\*.  They just require a bit of skill with a soldering iron and a couple of tools to pull apart the housing.  In fact, converting the charger over to USB-C isn't as difficult as one might think, though, making it look professional is something entirely different.\n\n\\*\\* Edit for clarity\\*\\*",
          "score": 1,
          "created_utc": 1747600521.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxd8f7",
      "author": "Everyone_Suckz_here",
      "body": "MX Master 3S is a masterpiece of a mouse,use it every day and it’s in perfect condition and always works amazing",
      "score": 54,
      "created_utc": 1747558482.0,
      "replies": [
        {
          "id": "msyhm0z",
          "author": "SioBane",
          "body": "My only problem with the MX Master 3 is that the rubber coating eventually starts to break down and goes kind of sticky. I’m on my third one now because of it.",
          "score": 41,
          "created_utc": 1747577884.0,
          "replies": [
            {
              "id": "msys56k",
              "author": "utopicunicornn",
              "body": "I love my MX Master 3 because it just feels so right and perfect for my big hands, but it too suffers from the same issue as my previous Logitech mouse (different model) where the rubber starts to break down. \n\nBut now I’m seriously considering ditching Logitech for good, but I can’t seem to find better options from other manufacturers that don’t utilize any kind of rubber on their mice.",
              "score": 14,
              "created_utc": 1747581291.0,
              "replies": [
                {
                  "id": "msyt1s2",
                  "author": "SioBane",
                  "body": "I am in the exact same boat. I’m actually using a Logitech Lift now and while it doesn’t have the same build quality as the MX Master 3 it is great for long work sessions.",
                  "score": 3,
                  "created_utc": 1747581582.0,
                  "replies": [
                    {
                      "id": "mt6srh3",
                      "author": "pastalex42",
                      "body": "I switched to the MX Ergo for office work and the MX Master 3S for music production and I love them both but I’m not looking forward to the rubber going gnarly",
                      "score": 1,
                      "created_utc": 1747688536.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msypsqx",
              "author": "TheFuriousOtter",
              "body": "This is also something that can’t be repaired by the end-user either.",
              "score": 1,
              "created_utc": 1747580532.0,
              "replies": [
                {
                  "id": "msytox8",
                  "author": "richbum888",
                  "body": "I repaired mine by putting aftermarket grips on the rubber parts and it works pretty good.",
                  "score": 5,
                  "created_utc": 1747581788.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msy0z9f",
          "author": "BinauralBeetz",
          "body": "I chuck my MX Master 3S in my work bag to take to work and never even pay attention to how reckless I am with it and it operates as well as day one. Have had for 4+ years.",
          "score": 8,
          "created_utc": 1747571605.0,
          "replies": [
            {
              "id": "msz45h5",
              "author": "king0demons",
              "body": "My master 3 has been going strong for 5 years with virtually no degredation.",
              "score": 3,
              "created_utc": 1747585135.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mszlegb",
          "author": "LiamNeesonsIsMyShiit",
          "body": "I still use a MX Master 2S daily. Changed the pads on the bottom a while ago, but the rest just keeps on working. Pretty amazing device. Wish it has usb-c though.",
          "score": 2,
          "created_utc": 1747590504.0,
          "replies": []
        },
        {
          "id": "mt006af",
          "author": "Fullertonjr",
          "body": "Still on my original one and haven’t had any issues yet.  Still works great and smooth and just feels comfortable in my hand.",
          "score": 1,
          "created_utc": 1747595189.0,
          "replies": []
        },
        {
          "id": "mt2swjs",
          "author": "TwireonEnix",
          "body": "\tand it’s thick as a brick",
          "score": 1,
          "created_utc": 1747633451.0,
          "replies": []
        },
        {
          "id": "mt9vd38",
          "author": "Duckel",
          "body": "bought my MX518 in 2004 or 2005. costed 50€. doesnt have any issues.",
          "score": 1,
          "created_utc": 1747737838.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msy5zfq",
      "author": "TheBoBiZzLe",
      "body": "I gave up on Logitech.  Not sure why so many downplay the double clicking because… it’s literally unusable when it starts.\n\nGot the roccat air pro and I love it.  Simple, lots of functionality, and it’s quick.  Scroll wheel is strange in some games… but /shrug.",
      "score": 37,
      "created_utc": 1747573663.0,
      "replies": [
        {
          "id": "msyou8s",
          "author": "alidan",
          "body": "because you either get the problem or you never get the problem.\n\nI have it happen 5 times, 2 on out of warranty mice 3 on in warranty. \n\ncompared to razers 4 fucking laser problems, and 3 doubleclick ones in 1 warranty period.",
          "score": 5,
          "created_utc": 1747580220.0,
          "replies": []
        },
        {
          "id": "mt01slu",
          "author": "esach88",
          "body": "Roccat is still around? Cool! I loved their mouse and currently still use their mechanical keyboard. \n\nI had to get rid of the mouse after 2 years due to double clicking. I've been using a Logitech mouse for the last 4 years and it's been flawless.",
          "score": 1,
          "created_utc": 1747595709.0,
          "replies": []
        },
        {
          "id": "mt3swlw",
          "author": "Paltenburg",
          "body": "I have 3 Sharkoon Shark Forces. Great value mice.",
          "score": 1,
          "created_utc": 1747654552.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msyfll7",
      "author": "trn-",
      "body": "I’m truly surprised how many folks here have zero issues with their Logitech products, while I have to buy new MX Masters every 1,5-2 years\n\nIts either the buttons start to crap out or the rubber wears out on the shell and develops a hole and the underlaying plastic parts dig into my thumb.",
      "score": 51,
      "created_utc": 1747577215.0,
      "replies": [
        {
          "id": "msyn7ip",
          "author": "SigsOp",
          "body": "Thats been my problem also, the hardware itself is fine, the rubber just disintegrate…",
          "score": 23,
          "created_utc": 1747579694.0,
          "replies": []
        },
        {
          "id": "msz7dm8",
          "author": "brickmaster32000",
          "body": "You have to realize the difference in scale between people who spend time on their computer a lot and those that don't. I would imagine that, at the lower edge, people who spend a lot of time on their computer probably put miles on their mice 10x fasters. So your 2 years of gaming is going to be equivalent to something like 20 years of use for someone else.",
          "score": 20,
          "created_utc": 1747586174.0,
          "replies": [
            {
              "id": "mt12j4k",
              "author": "superg64",
              "body": "My G502 has been put through so much gaming and heavy usage that many of the buttons that are labeled with G1 G2 G3 etc have had the plastic for those letters worn off completely. My friends have had the original G502s that lasted them a while before breaking but all the new iterations of the G502 they have bought have died way faster.",
              "score": 1,
              "created_utc": 1747607760.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mszjah6",
          "author": "OutInTheBlack",
          "body": "My launch MX518 re-release from 2019 is still perfect. All i've done is replace the feet about a year ago. \n\nMy OG 518 I bought at launch in 2005 lasted about 10 years with no issues other than some fading and peeling.\n\nI had nothing but problems in the 4 years in between where I bounced between Corsairs and Razers.",
          "score": 3,
          "created_utc": 1747589861.0,
          "replies": [
            {
              "id": "mszvwwv",
              "author": "itsfortybelow",
              "body": "At first I was confused when you said 2005 and it lasted 10 years, then I got sad when I realized 2005 was 20 years ago and not 10.",
              "score": 4,
              "created_utc": 1747593825.0,
              "replies": []
            },
            {
              "id": "mszvnzs",
              "author": "Darkhoof",
              "body": "Same here. And now I have a G Pro and it's 5 years and going strong and a MX-Master 3 at work that is just perfect.",
              "score": 1,
              "created_utc": 1747593745.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt0q6dy",
          "author": "EXPOchiseltip",
          "body": "I don’t game. I’m on the computer 8+ hours per day for work and fun. My MX Master is 6 years old. No issues to report.",
          "score": 3,
          "created_utc": 1747603546.0,
          "replies": []
        },
        {
          "id": "mt10cn6",
          "author": "Warskull",
          "body": "I'm the opposite, trying to figure out what people are doing where their mice wear out. Logitech has been the most consistently durable peripherals. I have an MX Master pushing 9 years I use for work. I had an MX518 go like 5 years before I decided to replace it with a G502. That went for 4 years before I replaced it with a G502 lightspeed. Then I replaced that somewhere in the 4 year range because the G502X Lightspeed went on sale.\n\nMeanwhile while I still bought Razer mice, their Death Adder would start having issues after 1-2 years. Hence why I don't buy Razer.",
          "score": 2,
          "created_utc": 1747606986.0,
          "replies": []
        },
        {
          "id": "mszio8i",
          "author": "ensoniq2k",
          "body": "I only have no issues since I don't buy Logitech anymore. Those wireless notebook mice died for Jo apparent reason, now I'm a satisfied Microsoft mouse user.",
          "score": 1,
          "created_utc": 1747589672.0,
          "replies": []
        },
        {
          "id": "mszpmct",
          "author": "mun1990",
          "body": "I guess I got lucky. Got G Pro mouse 3.5 years ago and still going strong with great battery. I think about upgrading to super light 2 but then realize why should I spend money when current mouse is perfectly working. \n\nAnd I abused that mouse like hell. league of legends almost every day for 2-3 hours on average. Although I thankfully stopped playing that game since start of this year",
          "score": 1,
          "created_utc": 1747591812.0,
          "replies": [
            {
              "id": "mszpy0u",
              "author": "trn-",
              "body": "with daily average 8-10 hour use (I work as a graphic designer/3D modeler so I click a lot), they get trashed quickly.",
              "score": 1,
              "created_utc": 1747591915.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt3280t",
          "author": "OneMonk",
          "body": "Ive had to repair my Mx1 3 times but i’ve had it for 7 or 8 years",
          "score": 1,
          "created_utc": 1747638954.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxo463",
      "author": "Oerthling",
      "body": "My M590s keep going.\n\nThe only problem I have with Logitech is that the G915 TKL keyboard wasn't available with USB-C. Micro-USB was already obsolete in 2022 when I bought it.",
      "score": 22,
      "created_utc": 1747565233.0,
      "replies": [
        {
          "id": "mt04qnc",
          "author": "JoostinOnline",
          "body": "Is it really that big of an issue to you? Micro USB is still a viable connector to me. It's cheaper and much easier to replace, and it's not like you need the higher bandwidth offered from USB3.0 on a mouse.",
          "score": 8,
          "created_utc": 1747596677.0,
          "replies": [
            {
              "id": "mt60h29",
              "author": "Oerthling",
              "body": "Yes. I standardized everything on USB-C. Same charger for everything, no adapters.\n\nI almost didn't buy the keyboard just because of the obsolete port.\n\nCheaper? It's not like I'm buying the things. I already have some from other gadgets like laptops.\n\nAlso there is a variant of Murphy's law where your first attempt to plug in a micro-USB is always the wrong way around. ;-)\n\nThe bandwidth hardly matters to me. Network connections are BT and WIFI. It's mostly just charging. Rarely for data transfer.",
              "score": 1,
              "created_utc": 1747680107.0,
              "replies": []
            },
            {
              "id": "mt2p3k8",
              "author": "cdxxmike",
              "body": "For the sake of my sanity in cables, I swore years ago I would not buy a device if it was not available in USB C.\n\nI live in a one cable travel life that I would not break.",
              "score": 0,
              "created_utc": 1747631367.0,
              "replies": [
                {
                  "id": "mt3ymgn",
                  "author": "JoostinOnline",
                  "body": "I do get that. I was thinking of a mouse as being something that stays in one spot though. I stopped using laptops years ago. Anything I'm not moving around, I feel fine using a micro USB connector with.",
                  "score": 2,
                  "created_utc": 1747657022.0,
                  "replies": [
                    {
                      "id": "mt40c0m",
                      "author": "cdxxmike",
                      "body": "One cable life man, never going back.\n\nI refuse to support a manufacturer that can't do something as simple as keep up to date on their connectors.\n\nThe price difference is miniscule.",
                      "score": 0,
                      "created_utc": 1747657712.0,
                      "replies": [
                        {
                          "id": "mt46wci",
                          "author": "JoostinOnline",
                          "body": ">One cable life man, never going back.\n\nBut you're not really just using one cable, are you? You've still probably got a dozen USB C cables, one for each of your devices. And if\n\n>I refuse to support a manufacturer that can't do something as simple as keep up to date on their connectors.\n\nI'm not asking you to. But it's not really simple, either. You can't just swap out a micro USB and USB C connector. That requires a board redesign, and potentially a shell redesign. Modern PCB manufacturering is rarely completely custom these days. A board will be designed to work with a ton of different products for maximum output. That means they only need slim margins to make a profit, and in turn means a much lower cost for the consumer.\n\nWhile the connector prices may not be that much difference in price, it's a lot more work, and that costs money.",
                          "score": 2,
                          "created_utc": 1747660202.0,
                          "replies": [
                            {
                              "id": "mt47883",
                              "author": "cdxxmike",
                              "body": "Money they won't get from me if they can't do something as simple as keep up with the times.\n\nUSB C has been the standard for half a decade at this point.\n\nI made my promise about devices half a decade ago at this point.\n\nIf I am capable of opening their devices and soldering in a USB C connection as I have done on one critical device, why aren't they?",
                              "score": 0,
                              "created_utc": 1747660322.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msxbz9o",
      "author": "wolfiasty",
      "body": "That's not profitable...\n\nAnd if it breaks so often, why not go for other company ?",
      "score": 18,
      "created_utc": 1747557694.0,
      "replies": [
        {
          "id": "msyi8p5",
          "author": "2-buck",
          "body": "Exactly. Does Logitech not have competition?",
          "score": 2,
          "created_utc": 1747578093.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxm0q7",
      "author": "ttubehtnitahwtahw1",
      "body": "Went through several g903 mice doing the annoying as fuck double clicking. Until I realized that razer has the exact same mouse called the basilisk but doesn't use a mechanical switches. Which are the reason Logitech mice fail. Bought it immediately. Been years, havent had a single issue.",
      "score": 5,
      "created_utc": 1747563996.0,
      "replies": [
        {
          "id": "mszm3tq",
          "author": "ShittyFrogMeme",
          "body": "I had the issue on G903s which I kept getting replaced under warranty. Eventually I just did the Japanese Omron switch replacement and it's been going strong for 5 years.",
          "score": 1,
          "created_utc": 1747590721.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxemat",
      "author": "Hoserposerbro",
      "body": "Never had a Logitech product break. Still have two functioning keyboards from 11 years ago. Daily use. My MX mice have never had issue and I have 3",
      "score": 66,
      "created_utc": 1747559363.0,
      "replies": [
        {
          "id": "msydzob",
          "author": "Helpful-Wolverine555",
          "body": "I’ve had two mice with the double click issue. Shit happens.",
          "score": 51,
          "created_utc": 1747576654.0,
          "replies": [
            {
              "id": "mt2m2rt",
              "author": "nightofgrim",
              "body": "I have 4 razers with that. All the same model, so not a knock on Razr in general.",
              "score": 1,
              "created_utc": 1747629788.0,
              "replies": []
            },
            {
              "id": "msyi8rq",
              "author": "Hoserposerbro",
              "body": "What’s the double click issue?",
              "score": 1,
              "created_utc": 1747578094.0,
              "replies": [
                {
                  "id": "msyj8qz",
                  "author": "Helpful-Wolverine555",
                  "body": "https://www.overclockers.com/how-to-fix-infamous-logitech-double-click-problem/\n\nIt’s a pain in the ass when every time you click you end up getting a double click.",
                  "score": 23,
                  "created_utc": 1747578427.0,
                  "replies": [
                    {
                      "id": "msyyhxu",
                      "author": "Davachman",
                      "body": "Fuck that's what mine is doing. I'm trying to edit video clips. Click and drag, and shit keeps getting dropped, and then it grabs something else. Instead of trimming the clip, it let's go and regrabs, and now im not trimming but relocating the clip. Fuck. Lol",
                      "score": 7,
                      "created_utc": 1747583327.0,
                      "replies": [
                        {
                          "id": "mszfirn",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 3,
                          "created_utc": 1747588711.0,
                          "replies": [
                            {
                              "id": "mszgezq",
                              "author": "Davachman",
                              "body": "Cool, I tried that and the percussive maintenance. (Just a few light taps) \n\nIt's only ever an issue when editing as I game on a controller. And I dont have any edits im working on, so it might be a few days before I even confirm the fix. Thank you for the tip.",
                              "score": 1,
                              "created_utc": 1747588986.0,
                              "replies": [
                                {
                                  "id": "mt205gr",
                                  "author": "306bobby",
                                  "body": "Let us know!",
                                  "score": 2,
                                  "created_utc": 1747620218.0,
                                  "replies": [
                                    {
                                      "id": "mt24y1e",
                                      "author": "Davachman",
                                      "body": "Edit: My apologies. I spoke too soon.  It didn't fix it.\n\nEdit 2. After taking it apart, I think I might just replace the part that's malfunctioning.\n\n~~It's better. But there is still a slight issue where it's possible to press enough to produce a click sound, but it doesn't register. That wasn't the case when it was new. But fully pressing down and fully releasing seems to work well after testing it out for a bit.~~",
                                      "score": 1,
                                      "created_utc": 1747622027.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "msymkq6",
                      "author": "therealpogger5",
                      "body": "My last Logitech started doing this recently. Trust was probably the worst brand for it though, started double clicking a few months in. By the time I replaced the thing it'd occasionally register 6 clicks in one press",
                      "score": 3,
                      "created_utc": 1747579494.0,
                      "replies": [
                        {
                          "id": "msynv15",
                          "author": "Helpful-Wolverine555",
                          "body": "I’m on my third Razer Naga Epic. The side plates consistently stop working after a few months. Completed garbage. I have an original Naga wired that lasted me for years before it crapped out on me.",
                          "score": 1,
                          "created_utc": 1747579905.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "msyx2d5",
                      "author": "xXNovusXx",
                      "body": "I saw a reddit thread where someone said to bang it on the desk really hard. I was at the point of being about to buy a replacement so I tried it. Double click fixed permanently",
                      "score": 1,
                      "created_utc": 1747582872.0,
                      "replies": [
                        {
                          "id": "msyyq8j",
                          "author": "Davachman",
                          "body": "Thanks I will try this. Worse case it stops working entirely and i still need a new one anyways.",
                          "score": 1,
                          "created_utc": 1747583399.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msyh1xk",
          "author": "Bigardo",
          "body": "I had a box full of faulty Logitech mice. All of them double clicking or with faulty wheels from the G403/503 era. My last Logitech was a G Pro that also started double clicking within a year.\n\nIt was a widespread issue and they had good customer service, but it's been years and other companies have fixed it. Logitech hasn't.",
          "score": 12,
          "created_utc": 1747577701.0,
          "replies": [
            {
              "id": "msyhyq8",
              "author": "_Deathhound_",
              "body": "My 303 is having the same issue. Easy fix\n\nhttps://www.digikey.com/en/products/detail/omron-electronics-inc-emc-div/D2FC-F-7N-60M/20484328",
              "score": 1,
              "created_utc": 1747578001.0,
              "replies": [
                {
                  "id": "msyi4ad",
                  "author": "Bigardo",
                  "body": "I'd rather buy something that doesn't break.",
                  "score": 8,
                  "created_utc": 1747578053.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msyq3p8",
          "author": "None",
          "body": "Their older stuff is really good. It’s the new stuff having all the issues. I used to exclusively buy their products since they were pretty much founded but now I’m shopping elsewhere",
          "score": 3,
          "created_utc": 1747580630.0,
          "replies": []
        },
        {
          "id": "msyzimy",
          "author": "kermityfrog2",
          "body": "Yeah I have all the old OG MX mice still, just upgraded to have more buttons and features. Still have MX500, MX518, and am currently still using the G500.",
          "score": 1,
          "created_utc": 1747583649.0,
          "replies": []
        },
        {
          "id": "msz3gov",
          "author": "dav0r",
          "body": "Still using my MX510 from 2004....",
          "score": 1,
          "created_utc": 1747584914.0,
          "replies": []
        },
        {
          "id": "mszoz47",
          "author": "NihilisticAngst",
          "body": "Yeah, I have a G502 from 2014 that I've been daily driving since and it's still working great. It did develop a kink in the cable and I repaired it, but I think it was because my cat chewed a hole in the braided cable sleeve.",
          "score": 1,
          "created_utc": 1747591609.0,
          "replies": []
        },
        {
          "id": "mt298dp",
          "author": "SuperPants87",
          "body": "I have a G502 and I accidentally spilled coffee all over it so right click started sticking. I bought another one, but I decided to smack the right click and the old G502 started working. I eventually opened the new one and set the old one aside for me to deep clean later.",
          "score": 1,
          "created_utc": 1747623790.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msx7tc0",
      "author": "Noxious89123",
      "body": "I've never had a Logitech product fail. I've never even worn one out.\n\n\nMy G5 I used for about 15 years still has the original PTFE feet on it, but I've heard of other people wearing them out super fast. Like, wth are people doing to their stuff?\n\n\nHad my G502 Hero a few years now and it still works great. Some of the areas of rubber on the side are becoming smooth, but you know what, I'm not sure I care.\n\n\nThis mouse cost me less than £30, I don't think it's reasonable to expect it to last forever.\n\n\nNow if it was a £120 mouse, I'd feel very differently.",
      "score": 114,
      "created_utc": 1747555058.0,
      "replies": [
        {
          "id": "msxh0r3",
          "author": "ddhuynh",
          "body": "Their mouse is infamous for getting double clicks after being used for a while. I owned 2 G102, 1 G pro, 1 OG G502 all of them were double click after 6 to 12 months. I throw away G102, warranty return GPro and 502  my current G502 hero I void my warranty to replace the switch as soon as I bought it.",
          "score": 16,
          "created_utc": 1747560903.0,
          "replies": [
            {
              "id": "mt0muxh",
              "author": "xGMxBusidoBrown",
              "body": "My 502 is going on 11 years old now. I actually had replaced it with a Corsair dark hero pro but when that broke after 10 months I started using the 502 again and it’s still going.",
              "score": 5,
              "created_utc": 1747602461.0,
              "replies": []
            },
            {
              "id": "mt0cq3o",
              "author": "Noxious89123",
              "body": "Yeah, I've heard about the double click issue, but never experienced it.",
              "score": 2,
              "created_utc": 1747599264.0,
              "replies": []
            },
            {
              "id": "mt0iqfu",
              "author": "Inner-Bread",
              "body": "My G700 did that but $5 is switches from Ali express and a Saturday afternoon and it was good as new",
              "score": 1,
              "created_utc": 1747601156.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxjjjp",
          "author": "Chimwizlet",
          "body": "Every logitech mouse I've used over the last 14 years (excluding my current one) only lasted 1-2 years before the left click was too unreliable to be usable.\n\nThe main reason I bought the G502X was the hope the hybrid switches would solve the issue. Luckily so far I've not had any issues with it, although I've never gotten entirely comfortable with the wheel. It works fine, but I always have the feeling it wouldn't take much for it to break.",
          "score": 8,
          "created_utc": 1747562482.0,
          "replies": [
            {
              "id": "msxoa9u",
              "author": "Oerthling",
              "body": "That must be roughly the age of my M590 - never had a problem with the clicks.",
              "score": 2,
              "created_utc": 1747565329.0,
              "replies": []
            },
            {
              "id": "msxx6y5",
              "author": "NickCharlesYT",
              "body": "Yep...this or the rubberized coating literally disintegrates with even light use. I kept a G604 in my bag for travel because I kept forgetting to transfer my daily mouse to my backpack for use with my laptop. I used it *maybe* 4 hours total over 2 years before it just disintegrated and the next time I pulled it out a chunk of the textured rubber broke off. I'm convinced they do it on purpose, I since switched to a Razer Basilisk V3 Pro and while it hasn't quite been 2 years just yet, it's very obvious that it's holding up just fine under daily heavy use in a way that the Logitech mice I've owned in the past 12 years never did. I don't like Razer as a company in general but I've been forced to buy their peripherals twice now and haven't exactly been disappointed. Well, except for their mechanical keyboard switches, but I kind of expected that going in and planned to replace them in short order regardless.",
              "score": 2,
              "created_utc": 1747569900.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxcpb1",
          "author": "CapricornOneSE",
          "body": "Every MX Master iteration I’ve had has had issues. Gesture button or scroll breaks. ",
          "score": 22,
          "created_utc": 1747558151.0,
          "replies": [
            {
              "id": "msxh2xd",
              "author": "Ill-Construction-209",
              "body": "I love my USB rechargeable MX mice.  The only issue I've had is with the gripper pads on the side coming off.  I like the super smooth scrolling wheel and the weight, size, and shape.",
              "score": 3,
              "created_utc": 1747560942.0,
              "replies": []
            },
            {
              "id": "msyj7vl",
              "author": "uncoolcat",
              "body": "I've had issues with the past two or three iterations of the MX master, but in my case taking them apart and thoroughly cleaning them fixed the issues that I was having (a scroll wheel on two, and thumb button on another). I was convinced the scroll wheel was busted both times, but turns out there was just a lot of compressed debris stuck under the wheel (which was a total PITA to clean).\n\nThe thing that irritates me the most about the MX master 3 and 3s, is the rubber eventually starts to wear away from the palm area and looks sort of like peeling skin, and last time I checked replacement shells were between $20-$40 USD, which is absurd.",
              "score": 2,
              "created_utc": 1747578419.0,
              "replies": []
            },
            {
              "id": "mt0eozm",
              "author": "drykarma",
              "body": "The thumb button always gets pressed in, I have to buy new feet and take it apart to unscrew it every two years. Happened on both my 1 and 2, huge design flaw on a mostly flawless mouse imo",
              "score": 1,
              "created_utc": 1747599893.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxdicm",
          "author": "qa3rfqwef",
          "body": "I've stuck with Logitech for a very long time, but I'd say it's been a mixed bag.\n\n**G502 Original** – Had issues early on with the scroll wheel making odd clicking noises and losing contact with the sensor. Got a replacement, which was fine for just under two years before the scroll wheel stopped working again. Logitech's warranty was excellent, though—they let me pick a new mouse up to a value of around £120 (not sure why they did this but I didn't complain).\n\n**Logitech MX Master** – I admittedly went for the most expensive one I could find without giving it much thought. After less than a year of use, the side buttons snapped into the mouse.\n\n**Logitech G502 Lightspeed** – No issues here. Still have it, and it works to this day. The rubber on the sides has worn away over six years of use, but that’s expected.\n\n**Logitech Pro X Superlight 2 Dex** – I wanted the lightest mouse possible, and this fit the bill. Only had it for a short time so far, but it's an amazing mouse. Highly repairable, too—the rubber sides are replaceable adhesive, and the feet are made of a solid material that’s smooth on my mousepad and doesn’t look like it’ll need replacing anytime soon.\n\n**Logitech Powerplay** – Excellent device that removes the need to ever think about charging my wireless mouse. My only criticism is the mouse mat that sits on top of it—there’s no way to stick it down, so once every few months I have to realign it. Minor issue, though.",
          "score": 27,
          "created_utc": 1747558657.0,
          "replies": [
            {
              "id": "msxduek",
              "author": "Plebius-Maximus",
              "body": ">**Logitech MX Master** – I admittedly went for the most expensive one I could find without giving it much thought. After less than a year of use, the side buttons snapped into the mouse.\n\nHappened to mine too. The MX master 3 I got to replace it is better in that regard, but the rubber is wearing off on the side\n\n>**Logitech G502 Lightspeed** – No issues here. Still have it, and it works to this day. The rubber on the sides has worn away over six years of use, but that’s expected.\n\nSame, got a newer model to replace it but the old is still useable",
              "score": 8,
              "created_utc": 1747558870.0,
              "replies": [
                {
                  "id": "msybg1c",
                  "author": "Roadside_Prophet",
                  "body": "Same. I'm on my 2nd 502, but only cause I saw a limited edition one when I was building my pc that matched my all white color scheme.  Old one still works, and its like 10+ years old at this point.\n\nI've had much worse experiences with Razer and steelseries mice.  Had a razer naga and a basilisk that both lasted less than a year.  Tried a wow themed steelseries, and that one lasted less than 6 months.  \n\nThe only other mouse I've ever owned that lasted multiple years was a madcatz R.A.T. 7, but that company went bankrupt and changed hands, and I haven't tried any of their newer products.  In the end, logitech has been the most reliable by far.  I'm sure they have some duds, but they seem to be better than their competitors.",
                  "score": 1,
                  "created_utc": 1747575745.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msy05du",
              "author": "AsianLyf",
              "body": "I have a glass mousepad over it and it still charges fine, you don't actually need to use the original mousepad for powerplay.",
              "score": 1,
              "created_utc": 1747571240.0,
              "replies": [
                {
                  "id": "msy2ehk",
                  "author": "qa3rfqwef",
                  "body": "I don't. The original was getting a bit grubby and swapped it, but I prefer a smooth silky base underneath my mouse. Not a fan of hard or rough surfaces that some mousemats have.",
                  "score": 1,
                  "created_utc": 1747572216.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mszn592",
              "author": "hushpuppi3",
              "body": "I've been a G502 owner for I don't even know how long and I haven't had any issues apart from the original having mouse wheel problems. I think a lot of them tend to 'ghost' some mwheel inputs but personally its such a non-issue for me that I never really thought about it as a major flaw nor did I do any warranty or returns on mice that developed this issue- plus the ability to unlock the mousewell solved any time my mwheel would eat inputs if I ever needed to scroll a lot.\n\nApart from that, the rubber does EVENTUALLY rub down a little but I've never had them rub down to the plastic or anything, just get a little less textured. I also have a skin condition that causes the skin on my fingertips and palms to sweat a lot and shed frequently and my mousepad is dirty so I basically have the worst case scenario for mice.\n\nI can't say anything about the other mice in their line but the G502 series (all of them, I had a Gen1 and now I have a wireless G502 X) hasn't given me problems and I've owned 3 or 4 versions. I think the G502 was my 2nd ever mouse I used",
              "score": 1,
              "created_utc": 1747591040.0,
              "replies": []
            },
            {
              "id": "mszwml2",
              "author": "doctorcapslock",
              "body": "nobody uses em dashes like this. this is an ai generated comment",
              "score": -1,
              "created_utc": 1747594054.0,
              "replies": [
                {
                  "id": "mt0eh4i",
                  "author": "qa3rfqwef",
                  "body": "The words are all mine, the dashes too. The only thing I have ChatGPT do is clean up the grammar. I don't really see anything wrong with that.",
                  "score": 2,
                  "created_utc": 1747599824.0,
                  "replies": [
                    {
                      "id": "mt0fr3u",
                      "author": "doctorcapslock",
                      "body": "i'm just saying it looks like chatgpt wrote it. if you wrote something, put that into chatgpt, and copied the output, i count that as chatgpt writing it",
                      "score": 1,
                      "created_utc": 1747600229.0,
                      "replies": [
                        {
                          "id": "mt0j0ki",
                          "author": "qa3rfqwef",
                          "body": "Well, so as to avoid any doubt about what I wrote. [Here](https://imgur.com/hozFL9o) is the original text and the output. It really didn't change much.",
                          "score": 1,
                          "created_utc": 1747601244.0,
                          "replies": [
                            {
                              "id": "mt0jwh8",
                              "author": "doctorcapslock",
                              "body": "> Highly repairable, too —\n\nthat's such a chatgpt touch though, you have to admit",
                              "score": 2,
                              "created_utc": 1747601521.0,
                              "replies": [
                                {
                                  "id": "mt0kqc1",
                                  "author": "qa3rfqwef",
                                  "body": "Sure? Again though, I don't see a problem as long as I write it myself beforehand and merely use ChatGPT to tidy up the grammar. I'm not having ChatGPT write it for me.",
                                  "score": 1,
                                  "created_utc": 1747601785.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mt9rq3k",
                  "author": "Dope25",
                  "body": "Troll",
                  "score": 1,
                  "created_utc": 1747735865.0,
                  "replies": []
                },
                {
                  "id": "mt0biu1",
                  "author": "Noxious89123",
                  "body": "Huh, interesting thought. Could be they used ChatGPT to write it for them?",
                  "score": 1,
                  "created_utc": 1747598880.0,
                  "replies": [
                    {
                      "id": "mt0egf1",
                      "author": "doctorcapslock",
                      "body": "chatgpt does like to use em dashes so i wouldn't be surprised",
                      "score": 1,
                      "created_utc": 1747599818.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "msx8rft",
          "author": "WarmFission",
          "body": "I have a Superlight mouse that had its scrollwheel go bad within the first few months and support generously sent me a replacement…whose scrollwheel failed within a month. I am not abusing it at all either so idk whats going on.",
          "score": 9,
          "created_utc": 1747555648.0,
          "replies": [
            {
              "id": "msxg261",
              "author": "spyresca",
              "body": "Yeah, same.  Have owned multiple logi mice and their crap scroll wheels go bad within months.   Just garbage.",
              "score": 2,
              "created_utc": 1747560287.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msx8fvw",
          "author": "Memphisrexjr",
          "body": "Playing FPS. lifting, sliding and gliding. You've been using a mouse from 2007 till 2022 or 2005 till 2020? What are YOU doing with it? That is wild and curious.",
          "score": 16,
          "created_utc": 1747555447.0,
          "replies": [
            {
              "id": "mt08wp0",
              "author": "Noxious89123",
              "body": "Using my PC for anywhere between 4 \\~ 12 hours a day, every day.\n\nSome gaming, but also just general web browsing.\n\nI tend to use a very high DPI setting, and move the mouse on only a small pad, as I have a tiny desk. So that's likely a contributing factor.",
              "score": 1,
              "created_utc": 1747598039.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxa5s9",
          "author": "wheetcracker",
          "body": "I also still game with my original G5 from 2007. I've replaced the pads twice and the cord once. It still works perfectly.\n\nNew in the box ones are over $300 USD on eBay nowadays. It's a fantastic mouse.",
          "score": 2,
          "created_utc": 1747556537.0,
          "replies": [
            {
              "id": "mt09te7",
              "author": "Noxious89123",
              "body": "I really liked mine, and I still have it. The only reason I don't use it any more is that I got a much larger + higher resolution display, and the CPI of the G5 is a bit limited when using such a high DPI display.\n\nIt means that you need to move the mouse much further to get from one side of the screen to the other, and I was getting a bit fed up with that. Once I tried a G502, I couldn't go back.\n\nI use the G502 at around 4200 CPI iirc, whereas my old G5 I think only goes upto about 2000 CPI.",
              "score": 1,
              "created_utc": 1747598327.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxenc7",
          "author": "PhiphyL",
          "body": "Same, I used my G5 from 2006 to 2021, so 15 years. I have been using an MX518 since and it feels like a worthy successor. \n\nAnd still my Func mouse pad from about 2004!",
          "score": 2,
          "created_utc": 1747559382.0,
          "replies": [
            {
              "id": "msy096f",
              "author": "mthomas768",
              "body": "I have an MX 518 in my parts box that I’ve had forever. It just keeps working. The only reason it’s not my main mouse is the pads have worn out.",
              "score": 1,
              "created_utc": 1747571287.0,
              "replies": []
            },
            {
              "id": "mt0cdsk",
              "author": "Noxious89123",
              "body": "Bah, I wish I hadn't given my og MX518 to my ex-gf. I guess it'd just be e-waste at this point, but even so.",
              "score": 1,
              "created_utc": 1747599156.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxkkmf",
          "author": "frostygrin",
          "body": "So many of them have rubber grip that's wearing out in a couple of years.",
          "score": 2,
          "created_utc": 1747563111.0,
          "replies": [
            {
              "id": "mt0d724",
              "author": "Noxious89123",
              "body": "I think it depends a lot on the individual users skin, and how acidic or oily your skin is, and also how clean you keep your hands / if you eat stuff and touch your equipment etc.\n\nI keep all my stuff *very* clean.\n\nWith that said, I have still worn the rubber mostly smooth where my thumb sits. I think I've still got a few years left in it yet though!",
              "score": 1,
              "created_utc": 1747599413.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxe95k",
          "author": "TheGreatDuv",
          "body": "For the past few years I've only had logi products fail 😭.\n\nMy G502 lasted a year before left clicks stopped registering. Bluetooth portable keyboard wouldn't turn on/respond after just a few uses. G29 wheel I got a year and a half out of before either a motor or sensor packed in.\n\nThe only thing that has lasted is a webcam I bought about 8 years ago for university. \n\nThe one thing that has been a pure tank is an old Corsair keyboard that I gave to my dad a few years ago. That thing survived a teenage mes anger in CS:GO. It got beat, had food and drink spilled on and used most of the day, most days of the week. And is still functional to this day\n\nI loved the pre-turtle beach era of roccat. Loved the designs and ergonomics of the Kone mice and they also were pure tanks",
          "score": 2,
          "created_utc": 1747559129.0,
          "replies": []
        },
        {
          "id": "msx8iqt",
          "author": "AsianSteampunk",
          "body": "My G502 lightspeed failed me. then my friend gave me a normal G502 and its in its 2nd year atm.",
          "score": 1,
          "created_utc": 1747555496.0,
          "replies": [
            {
              "id": "msxf9e1",
              "author": "Lurker_81",
              "body": "I had 2 x G502s fail in the space of about 3 years. The scroll wheel was a major design flaw.\n\nMy MX Master has been flawless for several years of daily use at work.",
              "score": 2,
              "created_utc": 1747559772.0,
              "replies": []
            },
            {
              "id": "msxccmp",
              "author": "NewAccount971",
              "body": "Light speed is the weakness. Switched to a regular 502 and it's on its 5th year now",
              "score": 0,
              "created_utc": 1747557928.0,
              "replies": [
                {
                  "id": "msxwtk6",
                  "author": "Torn_Darkness",
                  "body": "This is just anecdotal, my regular g502 only lasted 3 years and the lightspeed I replaced it with is going into year 5 of use (with constant powerplay charging)",
                  "score": 2,
                  "created_utc": 1747569724.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msxd38q",
          "author": "SarcoZQ",
          "body": "I've had two and both sensors crapped out after 1,5 years. \n\n\nGreat that yours is holding up, but they're not as robust as you think. ",
          "score": 1,
          "created_utc": 1747558392.0,
          "replies": []
        },
        {
          "id": "msxeod6",
          "author": "Reaver_XIX",
          "body": "My G9 failed had it from 2007-2014 roughly, got the G502 original one and have had that since and it is still going strong.",
          "score": 1,
          "created_utc": 1747559400.0,
          "replies": [
            {
              "id": "msyjzmg",
              "author": "Mathmagician94",
              "body": "My g9 lasted like 7 years aswell, my g15 keyboard is like 18 years old by now and still works.\n\nThe g203 mouse on the other hand breaks after like 2 to 3 years",
              "score": 2,
              "created_utc": 1747578671.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxg56x",
          "author": "Xtreme976",
          "body": "I have my 502 lightspeed since release, and there are two main things you can do!\n\nI had the switches start double clicking so I bought new ones and soldered them in.\n\nThen the rubber was a mess, down to bare plastic in the thumb area, so I ordered a new skeleton for the mouse.\n\nThe switches were 2€ and the skeleton was 15€.\n\nThe mouse feels brand new, and I get to keep it for a lot longer!",
          "score": 1,
          "created_utc": 1747560340.0,
          "replies": [
            {
              "id": "mt0cm21",
              "author": "Noxious89123",
              "body": "Ooh, where did you get the parts from?\n\nWas the shell a genuine Logitech part, or an aftermarket replacement? Where did you purchase them from?",
              "score": 1,
              "created_utc": 1747599229.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msxlvrg",
          "author": "Dheorl",
          "body": "My current mouse is doing grand. Everything still works as it should and still feels crisp; has lasted much better than the previous razer I had.\n\nMy keyboard on the other hand (G915, so not exactly cheap) has had keys break, the volume dial is completely shot, buttons are getting unresponsive.",
          "score": 1,
          "created_utc": 1747563911.0,
          "replies": []
        },
        {
          "id": "msxnved",
          "author": "egnards",
          "body": "I honestly hated the G502 series and had so many issues with different aspects of mine. Originally bought it to replace a Rat7 mouse years ago because it was a less expensive take on a similar style.\n\nEventually ended up going back to a Rat6 [only because I couldn’t find a rat7 anymore].\n\nThe G502 just felt like a cheap $10 Walmart mouse dressed up in new pretty clothing.",
          "score": 1,
          "created_utc": 1747565094.0,
          "replies": []
        },
        {
          "id": "msxpvde",
          "author": "Doomchick",
          "body": "Because it is ranked one of the best mice I bought 3. They all broke and I never abuse the mice. But the left click broke 2 times",
          "score": 1,
          "created_utc": 1747566203.0,
          "replies": []
        },
        {
          "id": "msybrij",
          "author": "terorvlad",
          "body": "My g502 lightning became unusable once my rubber side broke off completely. With a little photo polymeric resin, a UV light, and a 5$ decal kit from aliexpress, it's even better than before. Switches also had a problem with them loosing clicks while pressed, or double clicking. This was fixed with a bit of solder and some Kailh GM4.0 switches.\n\nWith resin printing being so affordable now, there is little that stands in the way of making it truly fixable",
          "score": 1,
          "created_utc": 1747575858.0,
          "replies": []
        },
        {
          "id": "msyldv9",
          "author": "Critical_Method_2363",
          "body": "The keyboard I got from them stopped working after about two years.",
          "score": 1,
          "created_utc": 1747579119.0,
          "replies": []
        },
        {
          "id": "msypmcc",
          "author": "kingofthesqueal",
          "body": "I broke a ton of mice from online gaming over the years, at once point I was burning through 50-60$ mouse’s once every 6 months.\n\nGuessing I was pressing the clickers too hard during Smite matches but it never felt like it at the time.",
          "score": 1,
          "created_utc": 1747580474.0,
          "replies": []
        },
        {
          "id": "msyxgiy",
          "author": "Blurgas",
          "body": "My 502 Hero acts up once in a while, but I think it depends on how dry the air is.  \nCan't remember how old it is, main issue is trying to pluck cat hair out of gap between the sensor and the body",
          "score": 1,
          "created_utc": 1747582997.0,
          "replies": []
        },
        {
          "id": "msyyxpq",
          "author": "mythrowaway4DPP",
          "body": "Their keyboards (mx) are awesome. They are also delicate … forget changing keys or anything.",
          "score": 1,
          "created_utc": 1747583466.0,
          "replies": []
        },
        {
          "id": "mszr05u",
          "author": "Ok_Belt2521",
          "body": "I got 20 years out of my mx510 before it hit the dust. Damn fine mouse.",
          "score": 1,
          "created_utc": 1747592250.0,
          "replies": []
        },
        {
          "id": "mszvg3t",
          "author": "sshwifty",
          "body": "Same. Rocking my mouse since 2014, used daily. My Corsair keyboard is also still going.\n\nMultiple other mice, webcams, and keyboards well past the 5 year mark. \n\nThere is a reason their stock pays dividends.",
          "score": 1,
          "created_utc": 1747593675.0,
          "replies": []
        },
        {
          "id": "mszxlfm",
          "author": "7thhokage",
          "body": "Had a g5 for bout 15 years as well. Had to replace the cord once, super easy. Ended up getting rid of it cause the scroll wheel down button stopped working cause of, believe it or not, opening new tabs while browsing reddit a fuck ton.",
          "score": 1,
          "created_utc": 1747594367.0,
          "replies": []
        },
        {
          "id": "mt0o6cg",
          "author": "LuckyBlackKnight",
          "body": "My OG superlight’s side buttons stopped working, so I had to get a V2 superlight",
          "score": 1,
          "created_utc": 1747602888.0,
          "replies": []
        },
        {
          "id": "mt0s9u4",
          "author": "rpkarma",
          "body": "My GPX Superlight died, got the horrible double clicking problem \n\nI fixed it by replacing the switches but not eveyrone can do that",
          "score": 1,
          "created_utc": 1747604238.0,
          "replies": []
        },
        {
          "id": "mt6g90j",
          "author": "beefcake8u",
          "body": "Yeah same. I've used exclusively logitech for both IT work and gaming ALOT never had a problem with anything other than the paint chipping a bit on some keyboard keys.",
          "score": 1,
          "created_utc": 1747684829.0,
          "replies": []
        },
        {
          "id": "msxl17v",
          "author": "bdrumev",
          "body": "Calm down mate, Logitech keyboards fail all the time. Last G413 I got had the keys do double pressing in 2 years.",
          "score": 0,
          "created_utc": 1747563397.0,
          "replies": [
            {
              "id": "mt0evlg",
              "author": "Noxious89123",
              "body": "I'm perfectly calm, just stating my own experience :)",
              "score": 1,
              "created_utc": 1747599952.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msyp2e4",
          "author": "StanielReddit",
          "body": "I had a G602.  Never worked right.  Batteries would be dead after **ONE DAY**.  Support ran me around through 2 hours of crap.  Nothing fixed it.  They sent me a G604 instead as a replacement since it was brand new and under warranty.  That mouse lasted for 4-5 years, but left clicking began to fail and **all the rubber peeled off it**.  (Google it, it’s a **super common** issue)\n\nSo to basically say, “Logitech is perfect!  Stop throwing your peripherals at walls!”\n\nYou sound ignorant af tbh ngl imo fwiw.",
          "score": -2,
          "created_utc": 1747580293.0,
          "replies": []
        },
        {
          "id": "msxkvpi",
          "author": "newInnings",
          "body": "You are using a wired mouse.\nThe Logitech wireless mouse with batteries are the ones facing double click  issues.\n\nYour mouse is switched off when pc is off.  Battery mouse are always awake. \n\nIf you drop it, it faces a bigger impact because of weight",
          "score": -6,
          "created_utc": 1747563302.0,
          "replies": [
            {
              "id": "msy8e5g",
              "author": "ZasdfUnreal",
              "body": "My last two m100 mice had double click issues.",
              "score": 1,
              "created_utc": 1747574596.0,
              "replies": [
                {
                  "id": "msyiufh",
                  "author": "DarkDra9on555",
                  "body": "I had two G903 with double click issues",
                  "score": 1,
                  "created_utc": 1747578294.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mt0eog5",
              "author": "Noxious89123",
              "body": "Actually the wired ones can experience the issue too.\n\nFundamentally the issue is caused by the mouse switches being used **far** outside of their specification.\n\nThey are designed for 5 volts, and have a minimum current specification. Because modern mice now use 3.3v logic, it is easier to just run the switches with 3.3v instead of adding complexity to use 5v. The current is also an order or magnitude lower than what the switches are designed for.\n\nA *very* long video about it here, but the most thorough analysis I've seen on the issue: [https://www.youtube.com/watch?v=v5BhECVlKJA](https://www.youtube.com/watch?v=v5BhECVlKJA)\n\nTL;DR, the switches are being used out of spec and mouse manufacturers are too tight with money to want to design the circuits properly.",
              "score": 1,
              "created_utc": 1747599889.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "msxnvf6",
      "author": "2roK",
      "body": "Logitech used to stand for quality. I'm now on my third Superlight 2 because they all have their mouse wheel break after just months of use. Amazon is now refusing a 4th refund. I feel like Logitech used their good name to trick me into buying broken by design garbage.",
      "score": 11,
      "created_utc": 1747565094.0,
      "replies": [
        {
          "id": "mt4dnpk",
          "author": "AK47_10",
          "body": "Thats why I prefer Razer. I used both brands on various products, but Razer legit once sent me new headset after first one broke after THREE years of every day usage. They literally asked only for a receipt that I bought them from verified store (and I did, my local store was listed as their official), and did not ask a single thing. Another thing was my headset was old model, which was discontinued, so they sent me a new one. 2 years and still working. Basically 5 years on a single purchase.",
          "score": 2,
          "created_utc": 1747662560.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxodpf",
      "author": "Skarth",
      "body": "I've been using a logitech g700 for 14 years, and not light use either. Still expecting it to die and pull out a replacement.",
      "score": 3,
      "created_utc": 1747565383.0,
      "replies": []
    },
    {
      "id": "mt30mx4",
      "author": "FrohenLeid",
      "body": "I had my original G502 for 7 years. works perfectly!",
      "score": 3,
      "created_utc": 1747637977.0,
      "replies": [
        {
          "id": "mt350u2",
          "author": "Neb-Maat",
          "body": "Same here. Best mouse i ever had and still working like a charm.",
          "score": 3,
          "created_utc": 1747640718.0,
          "replies": []
        },
        {
          "id": "mt3dp5z",
          "author": "mecatman",
          "body": "Same been using mine for half a decade and it’s still going strong.",
          "score": 2,
          "created_utc": 1747646285.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxfzh1",
      "author": "spyresca",
      "body": "I've had multiple logitech mice have their scroll wheel wear out in mere months.  Won't be buying their crap ever again.",
      "score": 6,
      "created_utc": 1747560240.0,
      "replies": []
    },
    {
      "id": "msxfzuu",
      "author": "yorkspirate",
      "body": "I've had an mx25 for years that I bought second hand and it's still as good as new. Same aged keyboard is also holding up perfectly well and wouldn't have to thing about what brand I'd go for if either needed replacing or I needed an extra set",
      "score": 2,
      "created_utc": 1747560246.0,
      "replies": []
    },
    {
      "id": "msxjjlm",
      "author": "starvald_demelain",
      "body": "Maybe it's just me but I never had issues with old optical mice, even no-name ones, aside from the natural double-clicking issue after too many clicks. 2 years ago I needed a new mouse - the new ones I got and subsequently exchanged with warranty had issues with the scroll wheel (scrolling in the wrong direction sometimes or doing 2 scrolls up and down within one scroll) and early-developing double-left-click. Meanwhile at work there's no-name or old logitech mice that don't exhibit these problems at many different desks in (work-)daily use. I don't know who dropped the ball or if I'm just personally very unlucky but it was annoying to find something new that works.",
      "score": 2,
      "created_utc": 1747562483.0,
      "replies": []
    },
    {
      "id": "msxk9r9",
      "author": "stodal",
      "body": "Had 3 of those mouses G502 - G502x in the past year. Its always the scrolling wheel or double click",
      "score": 2,
      "created_utc": 1747562930.0,
      "replies": []
    },
    {
      "id": "mszc71j",
      "author": "moosefre",
      "body": "why are people ok with teflon and plastic that rubs off on our fingers and desks? apple makes a shite mouse but its the only one making a metal/glass one",
      "score": 2,
      "created_utc": 1747587692.0,
      "replies": []
    },
    {
      "id": "mszcxip",
      "author": "ToMorrowsEnd",
      "body": "I want a titanium mouse. all metal with a steel reinforced cord.  my mouse should be useable as a bolo weapon and then go back to mousing with no damage.",
      "score": 2,
      "created_utc": 1747587919.0,
      "replies": []
    },
    {
      "id": "mt06c4s",
      "author": "None",
      "body": "Forever mouse already exists, it's called a wired mouse. No batteries and Bluetooth to worry, plug and play with every single system and equipment, and they last decades if no shenanigans happens and it is cleaned occasionally.",
      "score": 2,
      "created_utc": 1747597201.0,
      "replies": []
    },
    {
      "id": "mt0cfyk",
      "author": "JBN2337C",
      "body": "My Marble mouse just hit 26 years. It can vote, drink, rent a car, buy cigarettes, or be tried as an adult should it do something terribly wrong.",
      "score": 2,
      "created_utc": 1747599175.0,
      "replies": []
    },
    {
      "id": "mt1hn68",
      "author": "HighHrothgar420",
      "body": "I’m still using my original G502 from 2016 daily. It’s survived everything, including a few rage smacks during intense gaming moments.\n\nThe only thing that’s really worn out is the braided cable sleeve, but honestly, after 8,000+ hours of use, that feels more than fair.\n\nI’ve held off on upgrading since I’ve heard the newer models aren’t as durable.",
      "score": 2,
      "created_utc": 1747613277.0,
      "replies": []
    },
    {
      "id": "mt1ts85",
      "author": "thatlukeguy",
      "body": "Make me an updated G9x, with quality parts (wheel, sensor, cable) and I'll pay a boatload of spacebucks for it.  A BOATLOAD",
      "score": 2,
      "created_utc": 1747617822.0,
      "replies": []
    },
    {
      "id": "mt5bdlx",
      "author": "ertipo",
      "body": "corporations are not here for the long lifespan of their products, but to profit.",
      "score": 2,
      "created_utc": 1747672846.0,
      "replies": []
    },
    {
      "id": "msx8b1j",
      "author": "PlatinumKanikas",
      "body": "Never had an issue with Logitech. Keyboard and mouse always seem to last forever… plus they’re super cheap. I don’t use my computer anymore but I have the same Logitech equipment I originally bought stored away with it.",
      "score": 3,
      "created_utc": 1747555364.0,
      "replies": []
    },
    {
      "id": "msx9tsr",
      "author": "hunnersaginger",
      "body": "G502 is my go-to mouse. G402 before that. I consider them semi-consumable as the rubber parts wear out over time (3-4 years) but I've never had one fail in any way. They are rock solid.\n\nAlso have a G213 keyboard. 9 years old and still going strong.",
      "score": 2,
      "created_utc": 1747556319.0,
      "replies": []
    },
    {
      "id": "msxq1y7",
      "author": "BalerionSanders",
      "body": "I’m just over here buying the same exact trackball a couple of times over 15 years lol 🤷‍♂️ although I do wish they would make the corded version again and save me from the agony of batteries and signal range",
      "score": 2,
      "created_utc": 1747566303.0,
      "replies": [
        {
          "id": "msy5t4w",
          "author": "sgrams04",
          "body": "I have the MX trackball and love it. While I don’t like having to charge it, it’s luckily just infrequent enough that it doesn’t bother me. However, the rubber on the sides is peeling off. I’ve had it for years and years, but it may be time for me to get another soon. ",
          "score": 2,
          "created_utc": 1747573596.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msye9c1",
      "author": "Shadow_Relics",
      "body": "Buying products that are made to last forever defeat the purpose of consumerism in an expanding market. Planned obsolescence is literally the goal of every major corporation that sells you a product. That are made to depreciate and become obsolete with time, so you’ll want to buy the newer better version that comes out next year, or the year after. Look at the IPhone. Every year we get a slightly “better” models that’s also slightly worse. So long as capitalism as a major driving force in a consumer market, there will be no “truly forever” products. A business can’t stay in business forever if they only ever sell one product to anyone.",
      "score": 2,
      "created_utc": 1747576749.0,
      "replies": []
    },
    {
      "id": "msx9t95",
      "author": "argama87",
      "body": "If rather pay 50 bucks for my trackball then replace it when it wears out years later.",
      "score": 1,
      "created_utc": 1747556309.0,
      "replies": []
    },
    {
      "id": "msxyyk0",
      "author": "Mitoria",
      "body": "If someone could do an ifixit breakdown to repair my MX Master so the right click works consistently again I’d appreciate it.",
      "score": 1,
      "created_utc": 1747570709.0,
      "replies": []
    },
    {
      "id": "msy2151",
      "author": "Mobbo2018",
      "body": "It's swiss. But it's not swiss quality.",
      "score": 1,
      "created_utc": 1747572060.0,
      "replies": []
    },
    {
      "id": "msy5c5z",
      "author": "Newtronic",
      "body": "I had my first Logitech MX Master a decade ago.   I don't recall why I replaced it with MX Master 2S; I think there was some deterioration of the click surfaces.  I then replaced the 2S with a  3 because I wanted to standardize on USB-C charging.   The 2S went in my travel bag.   I'm a heavy user of mice and use all the features of the MX daily except for the left right wheel on the side.   Fortunately my Excel files usually go up and down rather than left to right.  I'm really happy with the MX Master and both my 3 from six years ago and the older 2S continue to do the job well.",
      "score": 1,
      "created_utc": 1747573412.0,
      "replies": []
    },
    {
      "id": "msy93z1",
      "author": "elyv297",
      "body": "my g203 is a forever mouse",
      "score": 1,
      "created_utc": 1747574872.0,
      "replies": []
    },
    {
      "id": "msy9mcx",
      "author": "inspire-change",
      "body": "Put a track ball back in it that charges the mouse.   -Full circle",
      "score": 1,
      "created_utc": 1747575063.0,
      "replies": []
    },
    {
      "id": "msycx4d",
      "author": "--Arete",
      "body": "They also need to stop forcing the user to use proprietary software.",
      "score": 1,
      "created_utc": 1747576273.0,
      "replies": []
    },
    {
      "id": "msye6zm",
      "author": "Tall007",
      "body": "Do we have the same mouse?\nI have a 5year old one that looks like death, but functions perfectly",
      "score": 1,
      "created_utc": 1747576726.0,
      "replies": []
    },
    {
      "id": "msygw6q",
      "author": "MrTestiggles",
      "body": "I’m on my 3rd mx in 4 years lol glad you all are hitting the lottery but jfc do I just have shit luck with this brand or what?",
      "score": 1,
      "created_utc": 1747577648.0,
      "replies": []
    },
    {
      "id": "msyo4u2",
      "author": "Pryoticus",
      "body": "I’m genuinely curious, how many people are repairing mouses? I usually lose or replace mine before they break or malfunction. Even if they did break, they’re mostly cheap enough to replace rather than spending the time to repair them. Am I missing something?\n\nFD: I haven’t read the article due to a paywall.",
      "score": 1,
      "created_utc": 1747579992.0,
      "replies": [
        {
          "id": "msyuny6",
          "author": "80HighDefinitions",
          "body": "I didn’t read it either. I have a razer 🤷‍♂️ I bought years ago, corded. I game with it on a pc. This has never been an issue.",
          "score": 1,
          "created_utc": 1747582100.0,
          "replies": []
        },
        {
          "id": "mszj1oq",
          "author": "carenard",
          "body": "I haven't needed to repair a mouse ever.\n\nI started with a mx518... replaced with a G502 proteus core after many many years... simply for a better sensor and design/features I liked... also replaced after many many years with another G502 simply for a newer sensor(otherwise I was going to have to hunt for new rubbers and such for the bottom since it had worn out)...\n\nboth my old mice are stored away as backups since they are still fully functional.\n\nfewer mice than a friend who buys razor junk went through in a couple years(all had double click issues)",
          "score": 1,
          "created_utc": 1747589787.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msyp9ep",
      "author": "CrashNebulaOn_Ice",
      "body": "Please Logi, just design me another trackball mouse. The Ergo was made with such cheap parts, I'm still using the m570.",
      "score": 1,
      "created_utc": 1747580357.0,
      "replies": []
    },
    {
      "id": "msytss6",
      "author": "Vernichtungsschmerz",
      "body": "I have a lift. No real issues. Can be a bit sticky on the click but the ergonomic shape makes it invaluable",
      "score": 1,
      "created_utc": 1747581823.0,
      "replies": []
    },
    {
      "id": "msz006e",
      "author": "Jaxager",
      "body": "I've had my MX Master for about eight years, now. It's been dropped from my old desk about six or seven times, hitting hard tile. It is still working 100%. I bet that the cheaper ones are junk but you get what you pay for.",
      "score": 1,
      "created_utc": 1747583804.0,
      "replies": []
    },
    {
      "id": "msz90v4",
      "author": "BluesRiff",
      "body": "Bring back the G600 you cowards! Rawrrrrrrr!!!!",
      "score": 1,
      "created_utc": 1747586696.0,
      "replies": []
    },
    {
      "id": "msz9cpj",
      "author": "ChaoticSenior",
      "body": "There is a forever mouse. It’s called Steel Series.",
      "score": 1,
      "created_utc": 1747586799.0,
      "replies": []
    },
    {
      "id": "mszak4i",
      "author": "Lenny_Pane",
      "body": "I've had my G502 for ~8 years now. Unfortunately I don't have any trust in modern Logitech, the same way I don't trust HyperX products from after the HP acquisition. So my mouse and headset are both in this odd camp of \"I bought this great product that's lasting me many years, but now the company doesn't make products that last as long\" and I have no clue what model mouse or headset to go with when my current ones eventually die.",
      "score": 1,
      "created_utc": 1747587180.0,
      "replies": []
    },
    {
      "id": "mszcuqo",
      "author": "stacker55",
      "body": "i use corsair scimitars. i just set up discount notifications and pick a new one up any time they're around 30 bucks and keep it handy because i know the middle click and L/R click and hold will eventually go out.",
      "score": 1,
      "created_utc": 1747587895.0,
      "replies": []
    },
    {
      "id": "mszdi9n",
      "author": "iamacannibal",
      "body": "Logitech mice are great until they aren't. They still have click issues that have been a known issue for at least 10 years but they keep using the same shitty design for their switches. Meanwhile you can get a $25 mouse on aliexpress that is just about as good with better switches. The only thing Logitech has that the aliexpress mice don't is the wireless tech. Logitech is ahead of everyone there but for 99.9% of people that doesn't matter. \n\nI bought a mouse last year on aliexpress called a Zaopin Z2 that had hot swappable switches. The shell opened up with a couple screws and the main switches you could pop out and replace super easily. They came with really good switches already but if you wanted to swap them out or they went bad you could do that with no soldering or any fuss other than a couple screws.",
      "score": 1,
      "created_utc": 1747588096.0,
      "replies": []
    },
    {
      "id": "mszgzio",
      "author": "w0ut",
      "body": "I had a logitech mouse that cost €45 or so about 5 years ago. Switch stopped working after 2 years. They used cheap switches in a premium mouse. Never bought anything logitech since and never will.",
      "score": 1,
      "created_utc": 1747589160.0,
      "replies": []
    },
    {
      "id": "mszicu2",
      "author": "THE-BS",
      "body": "I've been using Logitech mice since 1995.  I'm on number 4.  They're the most reliable product i've ever owned.",
      "score": 1,
      "created_utc": 1747589575.0,
      "replies": []
    },
    {
      "id": "mszj672",
      "author": "AccomplishedBother12",
      "body": "Wow they’re ACTUALLY going through with the “subscription mouse” thing? Time to never buy a Logitech product ever again",
      "score": 1,
      "created_utc": 1747589825.0,
      "replies": []
    },
    {
      "id": "mszkaui",
      "author": "BinauralBeetz",
      "body": "My whole workforce is filled with MX series users and not once have I ever heard about Logitech quality issues. I have a feeling this is an unreliable opinion piece.",
      "score": 1,
      "created_utc": 1747590166.0,
      "replies": []
    },
    {
      "id": "mszthll",
      "author": "escalibur",
      "body": "Hipefully EU will step in for this. Here is a hyide how can you fix your Logotech mouse without soldering if you ever need.\n\nhttps://youtu.be/EnrAGbrkcNg",
      "score": 1,
      "created_utc": 1747593045.0,
      "replies": []
    },
    {
      "id": "msztiu9",
      "author": "ActionFigureCollects",
      "body": "Diamond Series you want?",
      "score": 1,
      "created_utc": 1747593056.0,
      "replies": []
    },
    {
      "id": "mszuyqd",
      "author": "Joee0201",
      "body": "Just give me a small USB c dongle that works with my mouse and keyboard.",
      "score": 1,
      "created_utc": 1747593521.0,
      "replies": []
    },
    {
      "id": "mt038tr",
      "author": "xGoP0cpDJytaTN",
      "body": "Keychron M6 is the way to go. Logitech long ago lost their crown. The MX Master series are a nice thought but they don’t last and don’t hold up.",
      "score": 1,
      "created_utc": 1747596181.0,
      "replies": []
    },
    {
      "id": "mt0h44h",
      "author": "DarkDobe",
      "body": "I've had my G502 for years at this point - and a710+ keyboard that is still trucking along.",
      "score": 1,
      "created_utc": 1747600655.0,
      "replies": []
    },
    {
      "id": "mt0xdh9",
      "author": "deeeebait",
      "body": "I’ve used my Logi MX Vertical for 8+ hours a day 5-6 days per week for the last 5 years. Still working great, would buy another. Not sure about others’ experiences but I any tech I can get 5+ years daily driving out of I’m pretty happy with.",
      "score": 1,
      "created_utc": 1747605955.0,
      "replies": []
    },
    {
      "id": "mt105sd",
      "author": "HyP3r_HiPp0",
      "body": "I got a g5 like the one pictured recently and returned it. The wheel was such a wobbly springy cheap plastic piece of shit. I had a g5 before and its a shame to see the quality drop. That last G5 I had to get rid of because the mouse wheel also started malfunctioning and the left click started wearing down. Im really struggling to find a mouse of a shape I like that is not overpriced cheap crap.",
      "score": 1,
      "created_utc": 1747606918.0,
      "replies": []
    },
    {
      "id": "mt18tin",
      "author": "stoneseef",
      "body": "I must be very lucky as I’ve never had issues with any Logitech mice. My g502 is over five years old and my MX518 lasted over ten years. Had a couple razers like the naga and basilisk but I prefer the feel of the logi.",
      "score": 1,
      "created_utc": 1747610053.0,
      "replies": []
    },
    {
      "id": "mt1gb2q",
      "author": "Averill21",
      "body": "I swapped to a custom mechanical keyboard and an endgame gear mouse and they both hold up fantastically. They do cost a bit more than big names but it truly is the “buy 10 dollar boots is cheaper than 5 dollar boots” type thing",
      "score": 1,
      "created_utc": 1747612781.0,
      "replies": []
    },
    {
      "id": "mt1j5o4",
      "author": "RayBansVans",
      "body": "Is the G502 not forever???",
      "score": 1,
      "created_utc": 1747613842.0,
      "replies": []
    },
    {
      "id": "mt1rxjs",
      "author": "archive_anon",
      "body": "Can they just go back to making the g600 again? I don't even care that it breaks every 1 to 2 years, for $30-40 I didn't even mind... I just miss the damn thumbpad with tilt wheel and no other wired mouse does that",
      "score": 1,
      "created_utc": 1747617127.0,
      "replies": []
    },
    {
      "id": "mt1ucu4",
      "author": "aikavari",
      "body": "Gone are the days of \"forever\" stuff.  Things are just built to not last anymore.  Sometimes, I want to give manufacturers the benefit of the doubt but when stuff I own just unceremoniously dies a month after it's listed warranty expires, you know there's something there :-D",
      "score": 1,
      "created_utc": 1747618042.0,
      "replies": []
    },
    {
      "id": "mt1vo8b",
      "author": "mmliu1959demo",
      "body": "My \"forever\" mouse is a cheap a$$ wired one that is on year 4. Even if it dies tomorrow, I will get another cheap wired replacement. How much technology do you need in a mouse?",
      "score": 1,
      "created_utc": 1747618543.0,
      "replies": []
    },
    {
      "id": "mt2lds6",
      "author": "hangbellybroad",
      "body": "have had numerous Logitech mice that failed quickly, year or two, without even much use. also keyboards, little used but non-functional after a couple years. Logitech is trash, ain't gonna buy no more Logitech.",
      "score": 1,
      "created_utc": 1747629438.0,
      "replies": []
    },
    {
      "id": "mt2nm4i",
      "author": "rowmean77",
      "body": "My dyslexic brain thought Logitech had a merger deal with iFixit.\n\n![gif](giphy|xVFxRDL58ibalV2Ut2)",
      "score": 1,
      "created_utc": 1747630583.0,
      "replies": []
    },
    {
      "id": "mt2ont5",
      "author": "Dawg_Prime",
      "body": "and here's me with my 12 year old steel series mouse",
      "score": 1,
      "created_utc": 1747631135.0,
      "replies": []
    },
    {
      "id": "mt2ra7p",
      "author": "tianavitoli",
      "body": "just start making the m305 again. i wouldn't even mind buying a new one every other year",
      "score": 1,
      "created_utc": 1747632549.0,
      "replies": []
    },
    {
      "id": "mt3glk3",
      "author": "imJGott",
      "body": "I just need them to make the G600 in a wireless form.",
      "score": 1,
      "created_utc": 1747648095.0,
      "replies": []
    },
    {
      "id": "mt4bl8p",
      "author": "akeean",
      "body": "I moved to a more humid climate, wich caused my computer mice to develop double clicking issues within 2 years, something I never encountered in the decades before (for me it was always the cables that failed on the Microsoft optical 5 button mice I used until then and those were easy enough to replace).  \n  \nSo I bought a mouse that had toolless switch replacement, only for the mouse wheel decoder on 2 of my mice become erratic after under 2 years and disassembling and cleaning the decoders would only stave off the issue for a few weeks each. :(",
      "score": 1,
      "created_utc": 1747661869.0,
      "replies": []
    },
    {
      "id": "mt5htvi",
      "author": "testcaseseven",
      "body": "I went through three g502 heros in just over a year. I got a razer death adder v2 3 years ago and it's still working just fine. No real degradation either.",
      "score": 1,
      "created_utc": 1747674721.0,
      "replies": []
    },
    {
      "id": "mt7ipx9",
      "author": "givemeyours0ul",
      "body": "I still keep my old 500 series mice working with aftermarket parts from ebay. Cords, slides, logic boards, roller wheels, you name it.",
      "score": 1,
      "created_utc": 1747697214.0,
      "replies": []
    },
    {
      "id": "mt9u6re",
      "author": "OzoraVeki",
      "body": "I have a G900 and it is still going strong after 8 years",
      "score": 1,
      "created_utc": 1747737228.0,
      "replies": []
    },
    {
      "id": "mtihsxt",
      "author": "Homerdk",
      "body": "I loved my MX Master S3 the scroll wheel that keeps on going into infinity. Left click stopped working all the time after a year got a replacement and after just over 2 years it happened again. Now im using a Temu mouse that cost me 10 euros and it has worked for 2 years. So 20 years for the same money. To be fair Temu mice are hit or miss.",
      "score": 1,
      "created_utc": 1747850460.0,
      "replies": []
    },
    {
      "id": "mtks4rk",
      "author": "thespiceismight",
      "body": "What does it mean, forever mouse? I’ve got one form them running 22 years still strong. \n\nI’ve had one of their battery keyboards for 18 years but eventually the key fell off. Sent them a letter asking for a new key and they responded with an entirely new keyboard, for free. Awesome company. ",
      "score": 1,
      "created_utc": 1747875875.0,
      "replies": []
    },
    {
      "id": "mu4dbh7",
      "author": "ohiocodernumerouno",
      "body": "What is wrong with Logitech? cornering the market on fast scrolling and ending production on wireless mice with more than 3 thumb buttons. why?!",
      "score": 1,
      "created_utc": 1748146972.0,
      "replies": []
    },
    {
      "id": "mua3yhb",
      "author": "SendNoodles__",
      "body": "    Cccxzdzzxe@",
      "score": 1,
      "created_utc": 1748228252.0,
      "replies": []
    },
    {
      "id": "msx8r3d",
      "author": "Chihuahua1",
      "body": "Visited a friend recently and his still using a legendary G15, they don't make them like they use too ",
      "score": 1,
      "created_utc": 1747555643.0,
      "replies": []
    },
    {
      "id": "msxabdt",
      "author": "Narezza",
      "body": "My G700s feels like a forever mouse.   Still amazing after 12 years",
      "score": 1,
      "created_utc": 1747556637.0,
      "replies": [
        {
          "id": "msyhwtr",
          "author": "iswedlvera",
          "body": "my G900 has been alive for 10 years. Truly great quality. I can't believe a wireless mouse would survive so long without any battery issues.",
          "score": 2,
          "created_utc": 1747577983.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxie3x",
      "author": "justeedo",
      "body": "My g900 is going strong over 10 years now",
      "score": 1,
      "created_utc": 1747561773.0,
      "replies": []
    },
    {
      "id": "msxqsvl",
      "author": "Spastik2D",
      "body": "My G600 is still going strong almost 6 years in. Worst thing about it right now is some rubber is worn but that’s it. That mouse kicks ass and I wish they made a proper successor.",
      "score": 1,
      "created_utc": 1747566704.0,
      "replies": [
        {
          "id": "msyod9q",
          "author": "alidan",
          "body": "I wish they didn't discontinue it. \n\nI would buy a new one now instead of deal with the half broken one's i have, really need to get around to repairing some of them.",
          "score": 2,
          "created_utc": 1747580067.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxxmpx",
      "author": "Party_Cold_4159",
      "body": "Got my wired G402 still running. Been probably 7 years now? I don’t know how much longer you’d want from these mice.",
      "score": 1,
      "created_utc": 1747570106.0,
      "replies": []
    },
    {
      "id": "msyfryk",
      "author": "Kalicolocts",
      "body": "My logitech has been my daily driver for 12 years with 0 issues. Paid like 50€ on Amazon in 2013 and still going super strong.",
      "score": 1,
      "created_utc": 1747577273.0,
      "replies": []
    },
    {
      "id": "msx6q30",
      "author": "Unizzy",
      "body": "Logitech products always fail right around warranty period... If you are lucky before, if not lucky after .. you then have to fight their CS for their BS...",
      "score": -3,
      "created_utc": 1747554389.0,
      "replies": [
        {
          "id": "msx79fo",
          "author": "ZacMedivh",
          "body": "I've owned multiple Logitech products and the oldest i had needed to be replaced because the rubber and structure has worn off because ive been using it for years. Never had a logitech device fail on me before.",
          "score": 9,
          "created_utc": 1747554719.0,
          "replies": [
            {
              "id": "msx7paz",
              "author": "a_Ninja_b0y",
              "body": "Can concur, owned many logitech products over the years and they have served me well. Although, these are individual experiences and they may vary from person to person.",
              "score": 4,
              "created_utc": 1747554991.0,
              "replies": []
            },
            {
              "id": "msx8s8r",
              "author": "Unizzy",
              "body": "You would be lucky then, or I am unlucky, I have owned various top end mice from them, and everyone failed during warranty expiration period. Maybe I have sweaty hands, but other brands don't seem to have the same problem.",
              "score": -5,
              "created_utc": 1747555663.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msx8eco",
          "author": "provocateur133",
          "body": "I've been lucky to get a few RMA's, they only last me a few years. it's always the double clicking switch issues for me.",
          "score": 5,
          "created_utc": 1747555421.0,
          "replies": [
            {
              "id": "msx9lu4",
              "author": "Unizzy",
              "body": "Yes... I have gotten 5 mice from them in recent memory, 3 had rma right at warranty period. 1 failed right after.\n\nDoubleClick issue.\n\nOne just failed and they refused warranty saying they spotted liquid... I am sure I never got it wet ..",
              "score": 0,
              "created_utc": 1747556178.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msx7rke",
          "author": "Noxious89123",
          "body": "I'm like the other user that replied to you. \n\n\nI've never had a Logitech product fail.",
          "score": 6,
          "created_utc": 1747555029.0,
          "replies": [
            {
              "id": "msx997q",
              "author": "Unizzy",
              "body": "Well going by all the replies on this thread, it seems to be a 50 50 experience? However that ratio skews, if it's not a 95% positive, that means their products are unreliable. \n\nI have only ever bought high end from them, maybe all the tech is more prone to malfunction. I am sure there are lower end mice that will last 10 years, especially if it's for office work or something.",
              "score": 1,
              "created_utc": 1747555958.0,
              "replies": [
                {
                  "id": "mt09asb",
                  "author": "Noxious89123",
                  "body": "The people with bad experiences are always loudest.\n\nMost of the people that use a product without issues, will never post / read / comment about it.",
                  "score": 1,
                  "created_utc": 1747598164.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msx95eu",
      "author": "Laserous",
      "body": "Forever? They can't even manage 5 months.",
      "score": -1,
      "created_utc": 1747555892.0,
      "replies": []
    },
    {
      "id": "msx93sw",
      "author": "mrlr",
      "body": "What Logitech needs to do is fix their K120 keyboard. I've been using mine for over a decade. I bought one for my mum and the letters started wearing off after only a year.",
      "score": 0,
      "created_utc": 1747555864.0,
      "replies": []
    },
    {
      "id": "msxb856",
      "author": "Kitakitakita",
      "body": "of course the g502 would be the mouse they advertise with. I've had to open that sucker up 3 times to fix the left click bug, and its all because there's a little pad inside that's not as think as it should be",
      "score": 0,
      "created_utc": 1747557218.0,
      "replies": []
    },
    {
      "id": "msxjpuk",
      "author": "PsyJak",
      "body": "*meagre",
      "score": 0,
      "created_utc": 1747562591.0,
      "replies": []
    },
    {
      "id": "msy2xcv",
      "author": "radda",
      "body": "But then you wouldn't buy a new one and number wouldn't go up\n\nThink of the shareholders!",
      "score": 0,
      "created_utc": 1747572435.0,
      "replies": []
    },
    {
      "id": "mszkd56",
      "author": "mister2forme",
      "body": "Today's economics are focused around disposable products. Logitech is no different. They are intended to perform for a couple years then be replaced, to keep the consumer cycle alive. \n\nIf they built forever products, that would mean they'd have to do things like innovate new value or people would stop buying once the market was saturated.",
      "score": 0,
      "created_utc": 1747590185.0,
      "replies": []
    },
    {
      "id": "mszoafz",
      "author": "dhalinarkholin",
      "body": "Fuck logitech",
      "score": 0,
      "created_utc": 1747591393.0,
      "replies": []
    },
    {
      "id": "mt0hw4b",
      "author": "Evocatorum",
      "body": "There's a reason why a \"Forever Mouse\" doesn't exist.  It's the same reason why our dishwashers no longer use stainless steel springs in the water compartment or our dryers use sintered bearings instead of actual rollerbearings: *Planned Obsolescence.*\n\nIt *used to be* a way of protecting industries and skilled labor thus ensuring that the craftsman have jobs while those skills are maintained (that was the original argument).  However, the Lightbulb conglomerates made short work of showing how that can  be turned in to serious profit.\n\nThe moral of the story is, if you want a *Forever Mouse*, you'll have to either find someone to make what you want, or make it yourself.  Logitech isn't never going to do it.",
      "score": 0,
      "created_utc": 1747600897.0,
      "replies": []
    },
    {
      "id": "msx8zw6",
      "author": "JohnnyGFX",
      "body": "Ugh… “forever mouse”. Sounds about as hokey as, “forever home”, to me. The only Logitech products that have broke on me were headphones. I still have an original MX518 that still works and it’s 20 years old.",
      "score": -1,
      "created_utc": 1747555797.0,
      "replies": [
        {
          "id": "msxgmsc",
          "author": "Hans_H0rst",
          "body": "Cool for you!\n\nHint: If those things wouldnt break, there would constently be posts about it! [https://www.reddit.com/search/?q=logitech+broke&type=posts&sort=new](https://www.reddit.com/search/?q=logitech+broke&type=posts&sort=new)",
          "score": 2,
          "created_utc": 1747560654.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msxyo51",
      "author": "azure_apoptosis",
      "body": "Meh, Logitech is more entry level users that don’t care. The products fit the user",
      "score": -5,
      "created_utc": 1747570578.0,
      "replies": [
        {
          "id": "msyp5ya",
          "author": "alidan",
          "body": "hardware wise, they are fantastic for the price, software wise, they are 1 step above razor which is hands down the worst software I used that functioned, hell logitech software is the reason I will never buy logitech again.",
          "score": 1,
          "created_utc": 1747580325.0,
          "replies": [
            {
              "id": "mszpmr1",
              "author": "azure_apoptosis",
              "body": "Idk, I had one key that broke on a decent wireless model and they told me it couldn’t be serviced, so that made me go to mechanical",
              "score": 1,
              "created_utc": 1747591816.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}