{
  "post": {
    "title": "Canon publicly discusses the US tariffs: \"we will raise prices\"",
    "author": "diacewrb",
    "id": "1kfbrta",
    "score": 5643,
    "created_utc": 1746452103.0,
    "selftext": "",
    "num_comments": 435,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kfbrta/canon_publicly_discusses_the_us_tariffs_we_will/"
  },
  "comments": [
    {
      "id": "mqpqdnd",
      "author": "MedonSirius",
      "body": "The worst part is the aftermath. Even after dropping the tarrifs...the PRICES WILL STAY!",
      "score": 1622,
      "created_utc": 1746456135.0,
      "replies": [
        {
          "id": "mqpv3vf",
          "author": "None",
          "body": "Exactly this. We’re fucked.",
          "score": 506,
          "created_utc": 1746457550.0,
          "replies": [
            {
              "id": "mqr4fm8",
              "author": "fadeathrowaway",
              "body": "Unless a company can profit more from selling a cheaper device",
              "score": 99,
              "created_utc": 1746470782.0,
              "replies": [
                {
                  "id": "mqr64yw",
                  "author": "subspaceisthebest",
                  "body": "Once a price is established there is not much incentive to innovate to a cheaper price.  \n\nThere are market share considerations that can change this but in an established market, the price will remain.",
                  "score": 149,
                  "created_utc": 1746471282.0,
                  "replies": [
                    {
                      "id": "mqr7vmm",
                      "author": "boyyouguysaredumb",
                      "body": "Imagine saying this about tvs 15 years ago",
                      "score": -52,
                      "created_utc": 1746471794.0,
                      "replies": [
                        {
                          "id": "mqr8y48",
                          "author": "Tepigg4444",
                          "body": "TVs had an absolutely insane profit model shift to get the prices this low, and it’s made them absolutely shit. We do not want that to happen to other products. Any more of this and your toaster will start showing ads while lagging so much your toast burns",
                          "score": 73,
                          "created_utc": 1746472114.0,
                          "replies": [
                            {
                              "id": "mqrf0rp",
                              "author": "GrynaiTaip",
                              "body": "Wait, what? TVs became shit?",
                              "score": 11,
                              "created_utc": 1746473932.0,
                              "replies": [
                                {
                                  "id": "mqrps3n",
                                  "author": "EmperorAcinonyx",
                                  "body": "i think he's referring to the incredibly shitty \"smart\" software and the barebones hardware that can barely run the software at launch",
                                  "score": 56,
                                  "created_utc": 1746477059.0,
                                  "replies": [
                                    {
                                      "id": "mqtihla",
                                      "author": "Scam_Altman",
                                      "body": " I got a big cheap smart TV and hooked up an old raspberry pi to it via HDMI. Is this beating the system?",
                                      "score": 12,
                                      "created_utc": 1746498489.0,
                                      "replies": [
                                        {
                                          "id": "mqtjlm4",
                                          "author": "EmperorAcinonyx",
                                          "body": "hell yeah brother",
                                          "score": 3,
                                          "created_utc": 1746498892.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mqsax5a",
                                  "author": "None",
                                  "body": "Just replaced my TV after 4 years. I read online that 5 years was pretty typical for that model. New tvs are fucking shit.",
                                  "score": 13,
                                  "created_utc": 1746483602.0,
                                  "replies": [
                                    {
                                      "id": "mqth88i",
                                      "author": "Igot1forya",
                                      "body": "When I first got married, I bought a Westinghouse 40\" 1080p LCD screen. I went from a 27\" CRT. That Westinghouse is nearly 18 years old, now. The thing simply will not die, which is surprising considering it has a CFL backlight! It weighs like 75lbs and has a full 2\" bezel around its borders and is a functional space heater when it's running. Contrast that with today's screens. It's freaking incredible how disposable modern TVs are.",
                                      "score": 8,
                                      "created_utc": 1746498031.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mqsrl8e",
                                  "author": "pro-in-latvia",
                                  "body": "Go buy a Samsung TV, I DARE you",
                                  "score": 3,
                                  "created_utc": 1746489195.0,
                                  "replies": [
                                    {
                                      "id": "mqve0lr",
                                      "author": "GrynaiTaip",
                                      "body": "Ads have become shit, but that's not related to the quality of the TV, is it? TVs are way higher resolution, higher quality and cheaper than ever before. Same as PC monitors.",
                                      "score": 2,
                                      "created_utc": 1746533483.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mqy6oiq",
                              "author": "Marquesas",
                              "body": "A cheap TV is just a large display to hook up to the your cheap TV box though. Get a cheap TV with bloatware and an HDMI input and run it off a Mi TV or something.",
                              "score": 2,
                              "created_utc": 1746563690.0,
                              "replies": []
                            },
                            {
                              "id": "mqr9kqd",
                              "author": "boyyouguysaredumb",
                              "body": "I'm saying that established markets can still see prices plummet. Acting like prices will forever stay high and there is no incentive for other companies to profit from selling a cheaper device is ridiculously myopic",
                              "score": 10,
                              "created_utc": 1746472302.0,
                              "replies": [
                                {
                                  "id": "mqrhlru",
                                  "author": "SmPolitic",
                                  "body": "And the other commentor is saying that the companies _will only_ consider to lower prices after demand drops\n\nThe black Friday and superbowl tv sale prices were always still profitable for the manufacturers\n\nThey could have lowered the prices much earlier, instead only lowered them as the cord cutting trends and more subscription streaming services... Curious\n\nIf they can figure out how to increase supply, they will only use that to scale up, keeping the same profit margin until, and only if, demand drops. Is how I read their theory. Few companies optimize their processes and pass the savings down, they \"reinvest\" that increase cost saving into growth or into their bonus.",
                                  "score": 6,
                                  "created_utc": 1746474694.0,
                                  "replies": [
                                    {
                                      "id": "mqrkfq4",
                                      "author": "boyyouguysaredumb",
                                      "body": "Who is “””they””” are you saying tv hardware manufactures are the same people selling streaming services and cable? wtf are you talking about?",
                                      "score": -3,
                                      "created_utc": 1746475514.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mqsppzh",
                                  "author": "Valrika_",
                                  "body": "“Prices will never go down unless consumers are all mindless zombies who ONLY care about price above everything else in which case that’s bad and ruins everything” is such a funny belief. It’s so obvious how much Reddit outrage culture is just people who want to buy premium things thinking that if they yell at other people to not buy things enough they’ll be able to keep buying it at a better price.",
                                  "score": 1,
                                  "created_utc": 1746488570.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mqs1zjt",
                          "author": "LogJamminWithTheBros",
                          "body": "I'm glad the TV that tracks my viewing habits and sells my data is so cheap. Truly wonderful.",
                          "score": 3,
                          "created_utc": 1746480717.0,
                          "replies": [
                            {
                              "id": "mqs685p",
                              "author": "boyyouguysaredumb",
                              "body": "That’s the software on your tv. The Chinese manufacturer churning them out at record low prices couldn’t care less.",
                              "score": -1,
                              "created_utc": 1746482054.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqzbyvh",
                          "author": "azhillbilly",
                          "body": "Man. I should never have gotten rid of my early 00s TV. It was a 2 man lift and not full wall sized, but I have gone through 6 TVs in 15 years now as they just shit the bed faster and faster. \n\nThe price comes down as they are less likely to last, and you pay less, because advertising is pumped into them, so advertisers are subsidizing the price.",
                          "score": 1,
                          "created_utc": 1746576670.0,
                          "replies": [
                            {
                              "id": "mqzh9pk",
                              "author": "boyyouguysaredumb",
                              "body": ">  so advertisers are subsidizing the price.\n\nno they aren't lol. Are you just making shit up?",
                              "score": 1,
                              "created_utc": 1746578550.0,
                              "replies": [
                                {
                                  "id": "mqzlb37",
                                  "author": "azhillbilly",
                                  "body": "You think advertising is free?",
                                  "score": 0,
                                  "created_utc": 1746579979.0,
                                  "replies": [
                                    {
                                      "id": "mqzu780",
                                      "author": "boyyouguysaredumb",
                                      "body": "Do you think that Hisense is making tvs cheaper on Amazon because advertisers are giving them kickbacks? This is an insane MAGA level conspiracy backed up by no evidence lol",
                                      "score": 0,
                                      "created_utc": 1746583039.0,
                                      "replies": [
                                        {
                                          "id": "mqzviwp",
                                          "author": "azhillbilly",
                                          "body": "Umm, since you mention Amazon. Look up how much a kindle is with, and without ads. You can buy one cheaper, if you get ads. \n\nNow, that TV that you bought, that displays ads while you are in the damn options menu, and starts playing ads when in screensaver mode, is cheaper because why?",
                                          "score": 1,
                                          "created_utc": 1746583487.0,
                                          "replies": [
                                            {
                                              "id": "mqzwe9w",
                                              "author": "boyyouguysaredumb",
                                              "body": "that's literally not how it works dude this is embarrassing as fuck for you lol. not everything is a conspiracy... this is brain rot",
                                              "score": 0,
                                              "created_utc": 1746583790.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mrdxxvb",
                          "author": "Wilsongav",
                          "body": "Point to a fact and get down voted. \n\nIf the information you provide isnt with \"The Message\" reddit will flame you to hell.\n\nTariffs are to make trade deals, it's working.   \nAND this points to 1 thing. 1 company. \n\nThere are already other companies moving some manufacturing to the USA.   \nReddit will ignore it. \n\nOnly Orange Man Bad is welcome here.",
                          "score": 0,
                          "created_utc": 1746778863.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mqrjmep",
                  "author": "EquipLordBritish",
                  "body": "Only if you still think we have actual competition here.",
                  "score": 7,
                  "created_utc": 1746475277.0,
                  "replies": [
                    {
                      "id": "mqua90k",
                      "author": "Stopikingonme",
                      "body": "This is the comment that answers **everything** above it. (Thanks lobbyists!!!)",
                      "score": 4,
                      "created_utc": 1746510882.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqtaq8n",
                  "author": "ElderberryMaster4694",
                  "body": "Only if by “cheaper” you mean lower quality but still charge the same",
                  "score": 1,
                  "created_utc": 1746495780.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqxudbo",
              "author": "mycall",
              "body": "Just buy less /s",
              "score": 2,
              "created_utc": 1746560213.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqqdai0",
          "author": "blazze_eternal",
          "body": "Not just because companies are greedy, but because tariffs are dangerously inflationary.",
          "score": 114,
          "created_utc": 1746462943.0,
          "replies": [
            {
              "id": "mqr02ej",
              "author": "AnotherManOfEden",
              "body": "But also because companies are greedy. Prices went up during Covid because of supply chain issues and never went back down. It’s just going to happen again.",
              "score": 126,
              "created_utc": 1746469489.0,
              "replies": [
                {
                  "id": "mqs3rz3",
                  "author": "chinomaster182",
                  "body": "Companies are always greedy, all the time in all contexts, it's how we respond to the prices that set them or not. \n\nFor example, prices for GPUs were scalped to hell and back during the pandemic, after the next generation came out with those same prices and we all responded by... buying every last one of them. \n\nThe latest generation just came out with even higher prices, and the market is eating it up. Same with Switch 2. \n\nSo yeah, the consumer hates price hikes but loves buying, as such, companies love raising prices.",
                  "score": 39,
                  "created_utc": 1746481281.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqr90vy",
              "author": "reginaphalange790",
              "body": "Things can be two things!",
              "score": 16,
              "created_utc": 1746472137.0,
              "replies": []
            },
            {
              "id": "mqtuuhj",
              "author": "capt2phones",
              "body": "This. It’s too bad that there is a significant proportion of this country’s population have little or no understanding about the lasting effects of tariffs.",
              "score": 3,
              "created_utc": 1746503425.0,
              "replies": []
            },
            {
              "id": "mqr5p5n",
              "author": "xerillum",
              "body": "It’s just a little transitory inflation, we’ve had transitory inflation for the last 5 years, nothing new  🙃",
              "score": -9,
              "created_utc": 1746471155.0,
              "replies": [
                {
                  "id": "mqro4p9",
                  "author": "None",
                  "body": "The inflation was transitory, the price levels were not. Inflation is back to normal levels, which is not the same as saying prices are back to what they were. People need to understand that inflation is the rate of change, not the absolute level of the prices.\n\nIn order for prices to go down you'd need deflation, a negative rate of change.",
                  "score": 14,
                  "created_utc": 1746476581.0,
                  "replies": []
                },
                {
                  "id": "mqti3if",
                  "author": "Herkfixer",
                  "body": "It was transitory. Inflation was back down to nearly 2% at the end of Biden's term, which is the target rate for inflation. It already got back to normal before Trump took office. Any new inflation increases are completely on Trump.",
                  "score": 7,
                  "created_utc": 1746498346.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqqs6z5",
          "author": "ReticlyPoetic",
          "body": "Play stupid games, get stupid prices.",
          "score": 10,
          "created_utc": 1746467217.0,
          "replies": [
            {
              "id": "mqrsvxp",
              "author": "artisanrox",
              "body": "🍺🏆",
              "score": 1,
              "created_utc": 1746477967.0,
              "replies": []
            },
            {
              "id": "mqscyik",
              "author": "Annual_Strategy_6206",
              "body": "Fafo",
              "score": 1,
              "created_utc": 1746484283.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqqtxk4",
          "author": "digiorno",
          "body": "Which might be one of the reasons the admin has been asked to do this by the billionaire class. They saw Covid allow them to raise prices, they saw inflation as a reason the raise prices, now they can just blame tariffs. They are going to bleed the American people dry just in time for a lot of old people to die, and their estates will then pass to private equity instead of their children as older Americans incur insane amounts of debt to survive. It’s no secret that tariffs are gonna hit healthcare, especially end of life care incredibly hard.",
          "score": 18,
          "created_utc": 1746467709.0,
          "replies": [
            {
              "id": "mqt2cws",
              "author": "paddenice",
              "body": "Americans will be bled dry because the *voted* for it.",
              "score": 1,
              "created_utc": 1746492883.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq6bpo",
          "author": "Skvall",
          "body": "Stop buying the stuff, prices will only stay if people keep buying.",
          "score": 34,
          "created_utc": 1746460868.0,
          "replies": [
            {
              "id": "mqqe2d6",
              "author": "Glizzy_Cannon",
              "body": "Yeah who needs food or water or clothing",
              "score": 55,
              "created_utc": 1746463171.0,
              "replies": [
                {
                  "id": "mqqpg9v",
                  "author": "lxs0713",
                  "body": "Obviously people are going to need to buy food and water, but when it comes to extra stuff like tech, those markets are definitely going to crash. \n\nWho's going to be buying consoles and cameras when they can barely afford to eat? The prices of those items will have to come down if no one's buying them",
                  "score": 26,
                  "created_utc": 1746466435.0,
                  "replies": [
                    {
                      "id": "mqqy9m1",
                      "author": "AloysSunset",
                      "body": "The prices won’t come down if production costs are high due to tariffs. These will just become even more luxury goods.",
                      "score": 13,
                      "created_utc": 1746468964.0,
                      "replies": [
                        {
                          "id": "mqs4anz",
                          "author": "chinomaster182",
                          "body": "Not necessarily true, stuff can always be cut down in cost to bring it down by using cheaper materials and removing features. Imagine, for example, a car without a infotainment system or AC or any kind of features. \n\nSo we will also be buying shittier stuff with yesterdays prices.",
                          "score": 1,
                          "created_utc": 1746481444.0,
                          "replies": [
                            {
                              "id": "mqs4hlw",
                              "author": "AloysSunset",
                              "body": "Or we'll be buying shittier stuff with tomorrow's prices",
                              "score": 4,
                              "created_utc": 1746481504.0,
                              "replies": [
                                {
                                  "id": "mqs4lqo",
                                  "author": "chinomaster182",
                                  "body": "Of course, that was the norm for many countries back in the 1970s for example.",
                                  "score": 2,
                                  "created_utc": 1746481540.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mqt3e8p",
                              "author": "drstu54",
                              "body": "I WISH I could buy a car without that damned information screen. Please!",
                              "score": 2,
                              "created_utc": 1746493245.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqr89s5",
                      "author": "sybrwookie",
                      "body": "> Who's going to be buying consoles and cameras when they can barely afford to eat? \n\nI can't speak for cameras, but if there's something I've learned in the past 25 years, it's that no matter how many ways people are fucked on cost of video games, enough consumers will shrug their shoulders, maybe make an empty excuse, and spend more.",
                      "score": 3,
                      "created_utc": 1746471912.0,
                      "replies": [
                        {
                          "id": "mqryku7",
                          "author": "TurtleIslander",
                          "body": "that's because video games are still by far the cheapest hobby compared to most other things",
                          "score": 6,
                          "created_utc": 1746479660.0,
                          "replies": []
                        },
                        {
                          "id": "mqrwidi",
                          "author": "CreamdedCorns",
                          "body": "Most people don't know or don't care.",
                          "score": 1,
                          "created_utc": 1746479036.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mqqepzq",
                  "author": "Skvall",
                  "body": "That was not what was discussed.",
                  "score": -12,
                  "created_utc": 1746463365.0,
                  "replies": [
                    {
                      "id": "mqqnafm",
                      "author": "MrTubzy",
                      "body": "Well, what do you think is going to go up in price? Everything is going to go up in price. \n\nThe items that have tariffs on them will go up in price. The companies that make the items that don’t have tariffs on them will see the cost of those with tariffs on them and raise their prices to be close to what those that are being tariffed are.",
                      "score": 13,
                      "created_utc": 1746465826.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqqzzt6",
                  "author": "MosquitoBloodBank",
                  "body": "Yeah, all those assholes buying water from foreign countries should be ashamed",
                  "score": -3,
                  "created_utc": 1746469468.0,
                  "replies": [
                    {
                      "id": "mqr6tmi",
                      "author": "sybrwookie",
                      "body": "Except that if you want to buy water anywhere, it's probably coming to you in Chinese plastic",
                      "score": 2,
                      "created_utc": 1746471482.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqq8tpk",
              "author": "ferola",
              "body": "Do you not need things",
              "score": 20,
              "created_utc": 1746461619.0,
              "replies": [
                {
                  "id": "mqq98qs",
                  "author": "AgsMydude",
                  "body": "I don't need gadgets",
                  "score": -10,
                  "created_utc": 1746461744.0,
                  "replies": [
                    {
                      "id": "mqq9mqc",
                      "author": "ferola",
                      "body": "I don’t either.  Thank goodness nothing else will be affected 🙏",
                      "score": 24,
                      "created_utc": 1746461860.0,
                      "replies": [
                        {
                          "id": "mqqarqg",
                          "author": "MedonSirius",
                          "body": "Lol that's the spirit",
                          "score": 6,
                          "created_utc": 1746462200.0,
                          "replies": [
                            {
                              "id": "mqqgs0a",
                              "author": "AgsMydude",
                              "body": "They are being purposefully obtuse.",
                              "score": -7,
                              "created_utc": 1746463960.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqqgmi4",
                          "author": "AgsMydude",
                          "body": "The context of this comment thread is about gadgets. Sorry you forgot what sub we're in.",
                          "score": -9,
                          "created_utc": 1746463916.0,
                          "replies": [
                            {
                              "id": "mqsbb7v",
                              "author": "None",
                              "body": "And what about the “gadgets” grocery stores use when you check out or the “gadgets” they use to stock shelves? Grocery stores are just going to eat that cost?",
                              "score": 2,
                              "created_utc": 1746483731.0,
                              "replies": [
                                {
                                  "id": "mqteuws",
                                  "author": "AgsMydude",
                                  "body": "The grocery stores I shop at don't buy Cannon cameras",
                                  "score": 1,
                                  "created_utc": 1746497193.0,
                                  "replies": [
                                    {
                                      "id": "mqtf8ii",
                                      "author": "None",
                                      "body": "It’s not just going to be canon bro. Sorry to be the one to break the bad news to you.",
                                      "score": 1,
                                      "created_utc": 1746497328.0,
                                      "replies": [
                                        {
                                          "id": "mqtgsda",
                                          "author": "AgsMydude",
                                          "body": "That's good and all but not what this comment thread was discussing...thanks for the contribution?",
                                          "score": -1,
                                          "created_utc": 1746497873.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqwqm9s",
                      "author": "kptknuckles",
                      "body": "Everyone’s dooming but yeah, we don’t need 80%.of the crap we buy.",
                      "score": 0,
                      "created_utc": 1746548868.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqr0l2g",
              "author": "drumrhyno",
              "body": "What if your business depends on it? What are those of us with small businesses supposed to do? We will have to raise our prices as well.",
              "score": 6,
              "created_utc": 1746469640.0,
              "replies": []
            },
            {
              "id": "mquxhph",
              "author": "jm3400",
              "body": "Canon makes high end camera gear for like… professionals. No one in the United States produces this stuff. It’s not as simple as “just don’t buy it” or “buy it but buy American”",
              "score": 3,
              "created_utc": 1746525508.0,
              "replies": []
            },
            {
              "id": "mqr4j5t",
              "author": "shill779",
              "body": "Yeah, stop buying it. Then the companies go out of business and then we don’t have *stuff* to buy even if wanted it. Win win? #goldenage",
              "score": 6,
              "created_utc": 1746470811.0,
              "replies": [
                {
                  "id": "mqunf5k",
                  "author": "Skvall",
                  "body": "You know there is a middle ground between giving everything they ask for or giving them nothing so they go out of business. If they raise the prices because of tariffs and then dont lower them when tariffs goes away, they have a bigger margin so they can lower prices before going out of business, just force them to do that by not buying until they do it.",
                  "score": 1,
                  "created_utc": 1746519015.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqqgxgs",
              "author": "Zapador",
              "body": "Exactly this. Avoid products that see a hefty price increase. A few percent can be whatever, there's always inflation and prices go up, but if something is suddenly 595$ instead of 495$ that's a clear sign.\n\nMost of these products can be avoided, they're in the nice to have category - cameras, laptops, TVs, gaming consoles and so on. If you absolutely need one of these products because the old one broke then consider buying second hand if at all possible.\n\nYou're right in saying that it is we, the consumers, that in the end get to decide if companies can get away with significantly raising prices or not. \n\nIt's the same reason why there's so little that is manufactured in the US (or Europe for that matter) today, consumers have focused very heavily on price for decades. Had consumers instead focused on \"Made in <insert country here>\" and so on the situation would be completely different today.",
              "score": -9,
              "created_utc": 1746464002.0,
              "replies": [
                {
                  "id": "mqtinwr",
                  "author": "Herkfixer",
                  "body": "Why the hell do I care what country it's made in if it being made in x-country will double the price. I'm not paying more for a superior product. I would be paying more for a printed sticker saying made in x-country. Hell no. I'll pay whoever makes it cheaper so I can by more of other things like food, clothing, etc and still be able to have my entertainment product too. Nothing about a product being made in say.. USA... makes the product inherently better.",
                  "score": 1,
                  "created_utc": 1746498553.0,
                  "replies": [
                    {
                      "id": "mquvefx",
                      "author": "Zapador",
                      "body": "Never said you should or that it is better.",
                      "score": 1,
                      "created_utc": 1746524228.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mqse0o6",
          "author": "meleecow",
          "body": "This is what I keep telling people. All the prices for everything they're going to go up because of a reason and it's going to take away that reason and they're just going to stay the same.... Nothing ever goes down.",
          "score": 3,
          "created_utc": 1746484644.0,
          "replies": []
        },
        {
          "id": "mqs0re7",
          "author": "silver_sofa",
          "body": "You’re missing the big picture. Wages will surely go up to the point that we’ll still be able to live just below the poverty line. This way we can maintain the status quo for another decade or two.",
          "score": 1,
          "created_utc": 1746480335.0,
          "replies": []
        },
        {
          "id": "mqsuzne",
          "author": "D00d_Where_Am_I",
          "body": "It’s called stickiness in economics",
          "score": 1,
          "created_utc": 1746490352.0,
          "replies": []
        },
        {
          "id": "mqsvy0l",
          "author": "LotFP",
          "body": "If people stop buying prices will drop. If people are still willing to pay whatever companies ask clearly there is room in the market to keep increasing the price regardless of the reason (inflation, supply chain issues, tariffs, et al.)",
          "score": 1,
          "created_utc": 1746490678.0,
          "replies": []
        },
        {
          "id": "mqtkndt",
          "author": "Hefty-Strike-6171",
          "body": "Same as they did during Covid and than after Covid when the supply lines broke down. Unchecked Capitalism where profit is everything",
          "score": 1,
          "created_utc": 1746499273.0,
          "replies": []
        },
        {
          "id": "mqumzvu",
          "author": "KououinHyouma",
          "body": "Only if people still buy still things endlessly. Boycott everything. Stick to necessities. Companies will set price to match supply and demand. If price goes up but demand is still high or higher than ever, that’s the new price. If price goes up and demand drops so low that they’re making a fraction of the money they could be, price goes back down.",
          "score": 1,
          "created_utc": 1746518740.0,
          "replies": []
        },
        {
          "id": "mqx46nz",
          "author": "Statharas",
          "body": "Blame the ones for causing this AND allowing this to happen.",
          "score": 1,
          "created_utc": 1746552677.0,
          "replies": []
        },
        {
          "id": "mqxub92",
          "author": "mycall",
          "body": "WORD",
          "score": 1,
          "created_utc": 1746560196.0,
          "replies": []
        },
        {
          "id": "mqq0ozl",
          "author": "None",
          "body": "[removed]",
          "score": -20,
          "created_utc": 1746459211.0,
          "replies": [
            {
              "id": "mqr41gr",
              "author": "None",
              "body": "Not exactly, the excuse is valid, it’s what comes after if tariffs are ever rescinded. Companies are already never going to willingly reduce prices to pre-inflation levels. we’ve already seen it with covid",
              "score": 8,
              "created_utc": 1746470666.0,
              "replies": []
            },
            {
              "id": "mqq38jq",
              "author": "MedonSirius",
              "body": "As always. Sadly, we are the last instance and we will feel it. It's a economical rape",
              "score": 8,
              "created_utc": 1746459956.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqpfnfx",
      "author": "None",
      "body": "Imagine living in a heavily capitalist society and thinking that any company would eat the cost of the tariffs. Especially a 145% tariff",
      "score": 1663,
      "created_utc": 1746452763.0,
      "replies": [
        {
          "id": "mqph152",
          "author": "schuylkilladelphia",
          "body": "Well the fuckin' idiot imposing them still thinks *China* pays the tariffs and we don't need income tax anymore",
          "score": 627,
          "created_utc": 1746453215.0,
          "replies": [
            {
              "id": "mqphii6",
              "author": "rrastelli",
              "body": "Just like Mexico paid for the wall right???",
              "score": 277,
              "created_utc": 1746453371.0,
              "replies": [
                {
                  "id": "mqpryqk",
                  "author": "QuantumStew",
                  "body": "The annoying orange knows he can lie freely to a critical mass of gullible people in the US. He probably can't believe how easy it was.\n\nI'm gonna start selling Americans magic beans. Try and get into that massive gullible market.",
                  "score": 155,
                  "created_utc": 1746456610.0,
                  "replies": [
                    {
                      "id": "mqpsh6f",
                      "author": "syntax138",
                      "body": "Label them maga beans and you’re in.",
                      "score": 53,
                      "created_utc": 1746456764.0,
                      "replies": [
                        {
                          "id": "mqqah3r",
                          "author": "ArchusKanzaki",
                          "body": "Close enough. Welcome back ‘Liberty Cabbage’",
                          "score": 10,
                          "created_utc": 1746462112.0,
                          "replies": []
                        },
                        {
                          "id": "mqq5fi8",
                          "author": "unimpressivegamer",
                          "body": "Make America Gassy Again?",
                          "score": 12,
                          "created_utc": 1746460603.0,
                          "replies": [
                            {
                              "id": "mqsr6yk",
                              "author": "hikikostar",
                              "body": "The gemmiest president \n\n*Tra la la* 🎵",
                              "score": 1,
                              "created_utc": 1746489063.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqt0cyt",
                          "author": "s2rt74",
                          "body": "Freedom beans.",
                          "score": 2,
                          "created_utc": 1746492199.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mqpvzei",
                      "author": "kermityfrog2",
                      "body": "ABC interview proved that Trump actually believes in these lies. He's not actually lying - he's telling his truth.",
                      "score": 7,
                      "created_utc": 1746457813.0,
                      "replies": [
                        {
                          "id": "mqrf3rh",
                          "author": "StarsMine",
                          "body": "Believing a falsehood doesn’t make it true, it just means it’s the least malicious form of misinformation. \n\nBut even then that’s giving to much credit because it willful and intentional ignorance that leads him to believe it, rather then an honest mistake.",
                          "score": 2,
                          "created_utc": 1746473956.0,
                          "replies": [
                            {
                              "id": "mqrkkdk",
                              "author": "kermityfrog2",
                              "body": "My point is that he's not an evil genius telling lies on purpose to mislead. He is dumb and actually believes in his own lies. If there's any logic or strategy in his actions (such as some of his Executive Orders), they are written or planned by someone else and just given to him to sign without reading.",
                              "score": 3,
                              "created_utc": 1746475552.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqtzzp8",
                          "author": "TehOwn",
                          "body": "I must have missed that. How did it prove that he believes his own lies?",
                          "score": 1,
                          "created_utc": 1746505699.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mqpwt3d",
                      "author": "somethrows",
                      "body": "The lies won't survive empty shelves.",
                      "score": 6,
                      "created_utc": 1746458058.0,
                      "replies": [
                        {
                          "id": "mqq8pkc",
                          "author": "Jiopaba",
                          "body": "I distinctly recall during Donald Trump's last presidency that people would take pictures of empty shelves and post them online with captions like \"A Preview of Grocery Stores with Democrat's In Charge.\"  No, dumbasses, that's literally the grocery store you're looking at right now for real with Trump in charge.\n\nThey'll just do the same thing.  Stare reality straight in the face and be like \"Wow, this is so awful, this is what life would be like if *the other side* was in charge.\"",
                          "score": 30,
                          "created_utc": 1746461584.0,
                          "replies": [
                            {
                              "id": "mqscvj9",
                              "author": "The_Lapsed_Pacifist",
                              "body": "Reminds me of the jackass that posted a picture of a tent city during Trumps last run saying that is the future if the Democrats win. Like mate, you took that this morning. I miss the pre internet days, you knew that there were stupid people, no small number of absolute cretins as well, but at least you weren’t slapped around the face with it daily until your faith in humanity was ground down to a withered nub.",
                              "score": 10,
                              "created_utc": 1746484255.0,
                              "replies": [
                                {
                                  "id": "mqu0jpi",
                                  "author": "TehOwn",
                                  "body": "I wish it was only stupid people. Sadly, there are swathes of people of varying intelligence, all the way up to geniuses, who get caught in a trap of disinformation, manipulation and confirmation bias to the point that even they can be fooled, sometimes embarrassingly so. \n\nNo-one is immune.",
                                  "score": 2,
                                  "created_utc": 1746505932.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mqqj1ne",
                              "author": "None",
                              "body": "Just letting you know, if i follow your comment up the chain, it is all similar idea comments that are argumentatively charged, yet all having the same opinion/idea. This is an echo chamber. It must feel great getting the exact response you wanted every time you want. Except you’re adding nothing but anger and frustration without any intention of solving a problem or issue. Quite fascinating to take time doing this.",
                              "score": -26,
                              "created_utc": 1746464613.0,
                              "replies": [
                                {
                                  "id": "mqqmobr",
                                  "author": "Jiopaba",
                                  "body": "Yeah, feels great mate. Glad to come in from the world outside full of hate and strife and literal nazis walking the streets talking about how terrible women are, actually, and be reminded that some people actually do think Trump is an asshole who is ruining everything.\n\nI live in the Southeast and so commiserating with others is a reminder that one day we'll come out of this and I'm not literally the last island of sanity in a fascist hellscape cheering while our dictator dismantle the other branches of government and declares random citizens cartel members and ships them off to die in concentration camps in foreign countries.\n\nIt's called participating in the conversation. Hope your one person crusade against the leftist echo chamber is everything you wished for.\n\nNot every day can be a protest.",
                                  "score": 12,
                                  "created_utc": 1746465651.0,
                                  "replies": []
                                },
                                {
                                  "id": "mqqwyj8",
                                  "author": "CardmanNV",
                                  "body": "Nobody cares what you have to say, and it's not starting now.",
                                  "score": 5,
                                  "created_utc": 1746468582.0,
                                  "replies": []
                                },
                                {
                                  "id": "mqss94u",
                                  "author": "lafayette0508",
                                  "body": "> Quite fascinating to take time doing this.\n\nthe same could be said about your comment. (yes, and mine.)",
                                  "score": 2,
                                  "created_utc": 1746489422.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mqq9b8o",
                          "author": "PluginAlong",
                          "body": "You underestimate the stupidity of the American people.",
                          "score": 8,
                          "created_utc": 1746461764.0,
                          "replies": []
                        },
                        {
                          "id": "mqpxerx",
                          "author": "QuantumStew",
                          "body": "Nah, he'll say something like real patriots grow their own food and fast like Jesus Christ.\n\nAnd the seals will clap.",
                          "score": 9,
                          "created_utc": 1746458237.0,
                          "replies": [
                            {
                              "id": "mqq3uto",
                              "author": "I_AM_AN_AEROPLANE",
                              "body": "No, he will blame biden",
                              "score": 4,
                              "created_utc": 1746460137.0,
                              "replies": [
                                {
                                  "id": "mqqgngg",
                                  "author": "SandoVillain",
                                  "body": "And simultaneously tell us that this is his plan and it's actually a good thing",
                                  "score": 2,
                                  "created_utc": 1746463924.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mqpxn12",
                              "author": "somethrows",
                              "body": "They'll clap when they hear it. They're not gonna clap when they don't have food.\n\nWe are always 3 meals away from revolution.",
                              "score": 1,
                              "created_utc": 1746458305.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqqrg8b",
                          "author": "Raztax",
                          "body": "They will blame the empty shelves on Biden.",
                          "score": 1,
                          "created_utc": 1746467005.0,
                          "replies": []
                        },
                        {
                          "id": "mqs9ble",
                          "author": "militant-moderate",
                          "body": "Oh my sweet sweet summer child…",
                          "score": 1,
                          "created_utc": 1746483066.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mqq6nyi",
                      "author": "xur_ntte",
                      "body": "Is it lie freely and we don’t have any choice I don’t know about you but I haven’t signed a tariff in my life wouldn’t know how to stop one nor does my local politician just saying this is unprecedented and down right ridiculous",
                      "score": 1,
                      "created_utc": 1746460972.0,
                      "replies": []
                    },
                    {
                      "id": "mqqnx1w",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1746466002.0,
                      "replies": [
                        {
                          "id": "mqqw2ld",
                          "author": "QuantumStew",
                          "body": "Would you like some AMERICAN magic beans? Buy 3, and get 2. Deal?",
                          "score": 1,
                          "created_utc": 1746468324.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mqqrugq",
                      "author": "FrozenLogger",
                      "body": "Tell them every 100 beans sold  makes an immigrant disappear.\n\n That's the MAGAgic part.",
                      "score": 1,
                      "created_utc": 1746467117.0,
                      "replies": []
                    },
                    {
                      "id": "mqsh1pf",
                      "author": "Funkmaster_General",
                      "body": "Just say they cure autism. RFK Jr will force every school to serve them for lunch.",
                      "score": 1,
                      "created_utc": 1746485666.0,
                      "replies": []
                    },
                    {
                      "id": "mqss0f6",
                      "author": "lafayette0508",
                      "body": "ah, I've dreamed a bunch over the last decade about what I could make money on if I had no morals",
                      "score": 1,
                      "created_utc": 1746489338.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqpicim",
                  "author": "BUROCRAT77",
                  "body": "The wall that was already there for years prior to said idiot coming into office? That wall?",
                  "score": 28,
                  "created_utc": 1746453641.0,
                  "replies": [
                    {
                      "id": "mqpzs20",
                      "author": "Aramis444",
                      "body": "Surely you don’t mean the wall that has made no difference to people crossing the border into the US? That wall?",
                      "score": 11,
                      "created_utc": 1746458941.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqqhcb0",
                  "author": "AlphaTangoFoxtrt",
                  "body": "This is an actual negotiating tactic.\n\nIf he says \"We're building a wall!\" you say \"We're not building a wall!\"\n\nIf he says \"We're building a wall, and Mexico will pay for it!\" you say \"Mexico is not paying for the wall.\"\n\nYou're no longer arguing whether the wall will be built, but who will pay for it. And that presumes the wall *IS* being built.",
                  "score": 4,
                  "created_utc": 1746464120.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqpj4bg",
              "author": "Reddit_reader_2206",
              "body": "Funny, now that tariff dollars are flowing in, I haven't heard Donnie talking about those income tax cuts....except maybe for the wealthy....",
              "score": 27,
              "created_utc": 1746453892.0,
              "replies": [
                {
                  "id": "mqpmtxv",
                  "author": "pimpbot666",
                  "body": "He says he’ll cut taxes…. Someday. That’s what he does. He holds the football like Lucy, and takes it away when the good stuff is supposed to happen. \n\nI’m amazed his followers still fall for it every time.",
                  "score": 38,
                  "created_utc": 1746455060.0,
                  "replies": [
                    {
                      "id": "mqpp031",
                      "author": "OGAnoFan",
                      "body": "Its a trauma kink. \n\nWeve been conditioned as a species to be subservient. Those with the genetic markers to not, are usually the sociopaths we see in positions of power, forcing the subservience onto the rest of us. \n\nAs a kid i used to think the world had potential for change. Now i see its all the same, always has been the same. The rich and powerful will say the control is out of necessity. Thats the first lie they sold.",
                      "score": 4,
                      "created_utc": 1746455723.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqrvgdv",
                  "author": "suicidaleggroll",
                  "body": "Tariffs offsetting tax cuts never made sense in the first place.  The whole point of tariffs is to encourage local manufacturing.  In other words, the more effective tariffs are, the LESS income the government gets from them.  The end-game of tariffs is no more imports, everything is built domestically, which means zero tariff income, which means all money has to come from income taxes again.",
                  "score": 3,
                  "created_utc": 1746478721.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqqcwnj",
              "author": "blazze_eternal",
              "body": "I questioned this too at first during his campaign, but now it's clear he knows exactly who pays for it, and has admitted on several occasions consumer prices will rise. They would not rise for US consumers if the other country paid the tariff.  \nHe is pushing a sales tax without the word \"tax\", and that's what he likes.",
              "score": 9,
              "created_utc": 1746462829.0,
              "replies": []
            },
            {
              "id": "mqpn77i",
              "author": "D-Rich-88",
              "body": "Oh no, he knows the truth. He’s just a liar and rubes fall for it.",
              "score": 11,
              "created_utc": 1746455173.0,
              "replies": []
            },
            {
              "id": "mqr7465",
              "author": "Gengengengar",
              "body": "youre the idiot if you think he isnt destroying you intentionally.\n\nyoure calling your enemy a big ol dumb dumb while he blasts you in the face repeatedly with a shotgun. youre all too fucking innocent.",
              "score": 3,
              "created_utc": 1746471569.0,
              "replies": []
            },
            {
              "id": "mqqoe38",
              "author": "Asteroth555",
              "body": "He knows how tariffs work. He's just lying to his fans so he doesn't take the blame",
              "score": 3,
              "created_utc": 1746466135.0,
              "replies": []
            },
            {
              "id": "mqq1nbm",
              "author": "jaqattack02",
              "body": "He doesn't actually think that.  It's just the lie he's telling to sell it to the MAGA masses, so they can parrot that to everyone.  He knows it's just a tax hike on all of us.",
              "score": 6,
              "created_utc": 1746459490.0,
              "replies": []
            },
            {
              "id": "mqpq7kd",
              "author": "ColShvotz",
              "body": "Instead we will get raised prices due to tariffs AND income tax.",
              "score": 4,
              "created_utc": 1746456084.0,
              "replies": []
            },
            {
              "id": "mqqdc97",
              "author": "smartah",
              "body": "That still doesn't really make sense. Even if China paid the tariff.... wouldn't they just charge more for the product?",
              "score": 3,
              "created_utc": 1746462958.0,
              "replies": [
                {
                  "id": "mqqf1nl",
                  "author": "pug_subterfuge",
                  "body": "The importer does pay the tariffs. They just increase the price to offset the tariffs cost. So the OP here is technically incorrect as the Chinese company does pay the tariff, just like they pay their employees or pay for materials. They just pass those costs along to the consumer.",
                  "score": 6,
                  "created_utc": 1746463459.0,
                  "replies": [
                    {
                      "id": "mqqs8an",
                      "author": "smartah",
                      "body": "Correct. My point was that EVEN if we accepted Trump's idiotic assertion that China is paying the tariff (or the Chinese company), do we think they'd just not pass that cost along by making the product more expensive to counteract the tariff cost...?\n\n(Edited because I originally misread your comment).",
                      "score": 1,
                      "created_utc": 1746467226.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqpme33",
              "author": "pimpbot666",
              "body": "I think Trump has to know by now that we’ll pay the tariffs, not China. … and he’s just flat out lying to people about it.",
              "score": 6,
              "created_utc": 1746454923.0,
              "replies": [
                {
                  "id": "mqpxo32",
                  "author": "SirKorgor",
                  "body": "He’s known the entire time.",
                  "score": 8,
                  "created_utc": 1746458313.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqq8z1c",
              "author": "ceedub7",
              "body": "He doesn't think that. He just knows his followers believe that ridiculous crap.",
              "score": 2,
              "created_utc": 1746461664.0,
              "replies": []
            },
            {
              "id": "mqqil6l",
              "author": "PopInACup",
              "body": "He also thinks that if we have a trade deficit it's really really bad, but now that there's no trade there's no deficit so it's really really good.  Meanwhile he did nothing to help implement any of that cutoff trade domestically.\n\nIt's like turning on your lawnmower, putting a clamp on handle, and pushing it out into the yard to get the job done.",
              "score": 2,
              "created_utc": 1746464479.0,
              "replies": []
            },
            {
              "id": "mqpqv9i",
              "author": "rsmiley77",
              "body": "He does not REALLY think that.  That’s why in his next breath he talks about all the taxes it’ll bring in.",
              "score": 3,
              "created_utc": 1746456283.0,
              "replies": [
                {
                  "id": "mqqfbfc",
                  "author": "pug_subterfuge",
                  "body": "Tariffs are essentially a sales tax paid by the importer. The costs are ultimately paid by the consumer but it does generate revenue for the govt.",
                  "score": 2,
                  "created_utc": 1746463537.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqqadd8",
              "author": "ArchusKanzaki",
              "body": "Because by Trump’s logic, if you cannot force your supplier to reduce their price by half because of the 145% tariff, that just mean you are poor businessman that cannot negotiate and its not his fault that you are on this position.\n\nSeriously, I really wonder how many will die and corporate got even more consolidated because everyone know that big corporate does not play by same rules. They get to import stuffs without tariff because they got no tariffs since they will get exemption for their importance in economy. Everyone else? Welp….",
              "score": 1,
              "created_utc": 1746462081.0,
              "replies": []
            },
            {
              "id": "mqqral8",
              "author": "Raztax",
              "body": "I'm not so sure trump really believes that. He just needs the idiots who support him to believe it.",
              "score": 1,
              "created_utc": 1746466959.0,
              "replies": []
            },
            {
              "id": "mqqyr97",
              "author": "stln3rd",
              "body": "I don’t think he believes that. I’m pretty sure they are well aware that it’s a consumption tax on Americans. A consumption tax has been a right wing goal for a long long time and they know trying to pass that through Congress wouldn’t work so why not EOs",
              "score": 1,
              "created_utc": 1746469106.0,
              "replies": []
            },
            {
              "id": "mqpkpzb",
              "author": "mario61752",
              "body": "He never thought that.",
              "score": -12,
              "created_utc": 1746454402.0,
              "replies": [
                {
                  "id": "mqpm20f",
                  "author": "schuylkilladelphia",
                  "body": "You can find quotes directly from him saying exactly that for years now.",
                  "score": 6,
                  "created_utc": 1746454819.0,
                  "replies": [
                    {
                      "id": "mqppbgt",
                      "author": "mario61752",
                      "body": "If you really think he's that stupid and clueless you're just as gullible as the MAGAs",
                      "score": -8,
                      "created_utc": 1746455818.0,
                      "replies": [
                        {
                          "id": "mqpwbax",
                          "author": "schuylkilladelphia",
                          "body": "I used to give him the benefit of a doubt, that he was just lying to his base. But he's proven time and time again that he is shockingly stupid. There's no way he was faking that he believed the MS13 annotations were real.",
                          "score": 8,
                          "created_utc": 1746457911.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqqi7v3",
              "author": "None",
              "body": "Dude wtf i’m honestly so astonished that people can somehow be opposed to ending income tax. Throw you’re dumbass party out the window… why would you want to keep paying more taxes?",
              "score": -9,
              "created_utc": 1746464372.0,
              "replies": [
                {
                  "id": "mqqkvuf",
                  "author": "schuylkilladelphia",
                  "body": "Because the alternative is regressive taxation of the middle and lower class\n\nAnd we're already seeing an absolutely mind boggling amount of social services, educational funding, research grants, and environmental/consumer protections being gutted while our current government spends MORE than Biden. Imagine how horrific things would get without taxes?",
                  "score": 3,
                  "created_utc": 1746465143.0,
                  "replies": []
                },
                {
                  "id": "mqr3as1",
                  "author": "Agitated-Country-969",
                  "body": "Uh, where do you think money for road maintenance comes from? Many roads are horrible enough as it is, don't need more. I really hope you don't say gas tax.",
                  "score": 4,
                  "created_utc": 1746470446.0,
                  "replies": [
                    {
                      "id": "mqs10on",
                      "author": "None",
                      "body": "This is a simple minded response",
                      "score": -1,
                      "created_utc": 1746480415.0,
                      "replies": [
                        {
                          "id": "mqs2gob",
                          "author": "Agitated-Country-969",
                          "body": "You didn't answer the question. Where does money for road maintenance come from?",
                          "score": 1,
                          "created_utc": 1746480868.0,
                          "replies": [
                            {
                              "id": "mqt2cgr",
                              "author": "None",
                              "body": "Should it be up to people who are barely able to make a living in this country? To sacrifice a large chunk of their earnings to the federal government? When there are people flying private jets buying their 10th car. Realistically, people shouldn’t be taxed on what they make unless they make an incredible amount of money. Income tax has been flawed from the start and has become more and more appeasing to the rich since it’s inception. Just saying “where do we get the money now” I can actually answer that a million ways.",
                              "score": 1,
                              "created_utc": 1746492879.0,
                              "replies": [
                                {
                                  "id": "mqtt0fu",
                                  "author": "Agitated-Country-969",
                                  "body": "If we don't have income tax, the roads deteriorate and then people don't get to work.  \n\nLike where do we suggest we do get the money for road maintenance then? Thin air?\n\nIn the first place, income tax is progressive so those who make very little are taxed less.",
                                  "score": 2,
                                  "created_utc": 1746502633.0,
                                  "replies": [
                                    {
                                      "id": "mqvt7zw",
                                      "author": "None",
                                      "body": "Yeah so go look at the federal income tax brackets. The billionaires who do pay their taxes (most don’t) pay a maximum of 37%. The average household income would pay around 22-24% in taxes and that is barely enough to get by now. I guess we should all be throwing 1/4 of our salaries away to the government so we can use the roads though. By the way, the cost to make every road in the country perfect would be a couple billion max. I have no idea why you keep mentioning that as if the money can only come from income tax nothing else. Start thinking outside the box, if your small and smooth brain can handle it. You’re trying to make me sound like an idiot when you are lacking any hint of critical thinking skills, as is the same with most people rambling about politics on this platform",
                                      "score": 1,
                                      "created_utc": 1746539008.0,
                                      "replies": [
                                        {
                                          "id": "mqwo74e",
                                          "author": "Agitated-Country-969",
                                          "body": "Maybe you can answer another question. If not having an income tax was so feasible, why do the majority of governments have an income tax (UK, France, Japan, etc.)? Because surely it'd make citizens happier to not have an income tax. I don't see the US as somehow special in getting away with not having one.  \n\nI feel like you live in some fantasy world where you think it's easy to get the billionaires to pay. And LOL if you think that's what either Trump's or Musk's goals are.",
                                          "score": 1,
                                          "created_utc": 1746548168.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mqqkbaf",
                  "author": "mikescott1212",
                  "body": "Did you want to go back to dirt roads and schools built in sheds? No public parks, no firefighters, list goes on",
                  "score": 6,
                  "created_utc": 1746464980.0,
                  "replies": [
                    {
                      "id": "mqrzlhz",
                      "author": "None",
                      "body": "Unconstitutional. There was never supposed to be income tax in America plain and simple. Now we pay minimum 10% that’s if you make nothing. Learn before you speak and stop looking at everything like it’s black and white between 2 parties",
                      "score": 1,
                      "created_utc": 1746479973.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqu1ktn",
                  "author": "thefugue",
                  "body": "Taxes on the wealthy need to rise until they have to vote to assert political power. Just like everyone else.",
                  "score": 1,
                  "created_utc": 1746506404.0,
                  "replies": [
                    {
                      "id": "mqvrt1a",
                      "author": "None",
                      "body": "Agreed and income tax is set up for the opposite",
                      "score": 0,
                      "created_utc": 1746538558.0,
                      "replies": []
                    },
                    {
                      "id": "mqvuz7m",
                      "author": "None",
                      "body": "Wanna talk about unwarranted political power though. You should see how much Israel has on us! Interesting how most billionaires support them too… Look into Aipac. 98% of their funded candidates win their elections! They say this right on their website go look.",
                      "score": 0,
                      "created_utc": 1746539560.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqq8dqn",
              "author": "None",
              "body": "Bro, you really think he doesn’t know exactly what he’s doing? You’re all being played for fools rn.",
              "score": -7,
              "created_utc": 1746461487.0,
              "replies": [
                {
                  "id": "mqqaq96",
                  "author": "schuylkilladelphia",
                  "body": "I'm not MAGA.",
                  "score": 2,
                  "created_utc": 1746462188.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqpsf64",
          "author": "DanTheMan827",
          "body": "The person in charge still thinks companies can just make factories overnight in the USA…\n\nExcept a substantial amount of the equipment needed would have to come from China, and then there’d still be the considerably more expensive domestic labor…\n\nIf companies do make factories in the U.S., they’ll likely be almost fully automated, and what jobs will be created then?",
          "score": 23,
          "created_utc": 1746456747.0,
          "replies": [
            {
              "id": "mqq5xwm",
              "author": "Sellazard",
              "body": "He doesn't think that. \n\nHis plan is  to enrich himself and his cronies. To keep the poor in chaos and instability, while the rich strengthen their positions in the market and politics even more.",
              "score": 12,
              "created_utc": 1746460754.0,
              "replies": []
            },
            {
              "id": "mqu0imq",
              "author": "halpsdiy",
              "body": "Even if you had the equipment there are not enough people with the right skills to build and run factory processes. The US would need to train these people first.",
              "score": 1,
              "created_utc": 1746505919.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq0j6r",
          "author": "SandyTaintSweat",
          "body": "Some companies are raising the prices slightly for every country, and using it to offset the cost of the tariffs in the US. Which essentially means money from non-americans gets indirectly routed to the US government.\n\nNeedless to say, I will not be purchasing from *any* company that pulls that shit, and would encourage others to do the same.",
          "score": 38,
          "created_utc": 1746459163.0,
          "replies": [
            {
              "id": "mqq2bb4",
              "author": "None",
              "body": "Xbox is a good example of what you described",
              "score": 22,
              "created_utc": 1746459685.0,
              "replies": [
                {
                  "id": "mqq2t2o",
                  "author": "SandyTaintSweat",
                  "body": "Sony as well. And Nintendo in the case of Canadians, seeing as how they've raised prices in Canada too, with the excuse that they're trying to stop scalpers and regular consumers from buying up the cheaper Canadian stock.\n\nSo no new game systems for me for a while.",
                  "score": 15,
                  "created_utc": 1746459829.0,
                  "replies": [
                    {
                      "id": "mqqnae9",
                      "author": "SwissArmyKeif",
                      "body": "> trying to stop scalpers and regular consumers from buying up the cheaper Canadian stock.\n\n\nI don't undertand how that excuse supposed to work?\n\nI mean, for the sake of argument lets assume that there is a way to buy XBox in Canada and transfer it to US without a tariff and Sony is afraid that Americans buy out all Canadian XBoxes. \n\nWhy couldn't they re-rute their shipments and send less consoles to US and more to Canada? **Assuming they genuinely want to protect canadian customers and not just price gouge them**. That would be win-win scenario.",
                      "score": 6,
                      "created_utc": 1746465826.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mquklxy",
                  "author": "ExtremeCreamTeam",
                  "body": "Xbox isn't a company. It's a brand. Microsoft is the company.",
                  "score": 1,
                  "created_utc": 1746517193.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqq24j6",
              "author": "None",
              "body": "Which is an interesting strategy, I don’t know how effective it’ll be if they don’t make any sales in those affected regions.",
              "score": 4,
              "created_utc": 1746459629.0,
              "replies": [
                {
                  "id": "mqq3bqe",
                  "author": "SandyTaintSweat",
                  "body": "Not that I agree with it, but my understanding is that the strategy is to not deter any one group of customers with such a big price hike that they won't buy.\n\nIf everyone gets a small price hike, they're hoping enough people will not notice or care. It'll mean being conscious of *why* a certain company is charging what they do, which means research that most people won't bother with.",
                  "score": 6,
                  "created_utc": 1746459982.0,
                  "replies": [
                    {
                      "id": "mqq58hy",
                      "author": "None",
                      "body": "With the Xbox example, they should just cease production of Consoles. This is likely the final nail in Xbox’s coffin in any non US market. Even in the US this price hike will likely have the same affect.",
                      "score": 2,
                      "created_utc": 1746460546.0,
                      "replies": [
                        {
                          "id": "mqqbkzp",
                          "author": "ArchusKanzaki",
                          "body": "The 2TB Xbox Series X is now officially more expensive than PS5 Pro. I really don’t know what Xbox smokes when they make that decision. Even Sony have not increased PS5 pricing (yet).",
                          "score": 3,
                          "created_utc": 1746462440.0,
                          "replies": [
                            {
                              "id": "mqqfb7e",
                              "author": "None",
                              "body": "Does PlayStation manufacture in China? If so pricing will go up. There isn’t a company that will eat a 145% tariff. \n\nEveryone should’ve expected Xbox to raise hardware prices(no matter how shitty it is), them increasing game prices on the other hand was BS.",
                              "score": 2,
                              "created_utc": 1746463536.0,
                              "replies": [
                                {
                                  "id": "mqqh4oe",
                                  "author": "ArchusKanzaki",
                                  "body": "Yes, alot of them are made in China. Some are made in Japan, Vietnam, and Taiwan, but the bulk of production capacity is probably in China. \n\nI think Sony is hoping to ride out the current waves and not trying to raise pricing, by using its current PS5 inventory to stave-off any tariff related shocks, and distribute the shock of the tariff across all its other higher-margin products. They do raise prices, but imo not enough if the 145% tariff is here to stay. There were reports of Xbox being out of stock across alot of retailers and Microsoft probably caught in bad timing to replenish them compared to Sony that probably produces more because it is still selling regardless. If the tariff stays for longer, I think Microsoft will pull from some markets and Sony will need to raise prices too.... But we'll see.",
                                  "score": 1,
                                  "created_utc": 1746464060.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqto56s",
              "author": "JE3146",
              "body": "You literally just described every pharmaceutical company, but opposite.",
              "score": 0,
              "created_utc": 1746500617.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqpiwft",
          "author": "Spiderkingdemon",
          "body": ">and thinking\n\nFull stop right there. He doesn't nor do his followers. Sad.",
          "score": 8,
          "created_utc": 1746453821.0,
          "replies": []
        },
        {
          "id": "mqqg53z",
          "author": "HomeAir",
          "body": "Also even if you make a product 100% in the US and are NOT subject to tariffs somehow.  You would still raise your price because all your competitors are more expensive",
          "score": 3,
          "created_utc": 1746463778.0,
          "replies": []
        },
        {
          "id": "mqpow25",
          "author": "TheHomersapien",
          "body": "The same capitalist society that cheers a president who pays farmers to not grow crops so he can score points by being \"tough\" on \\[insert foreign nation here\\].",
          "score": 5,
          "created_utc": 1746455689.0,
          "replies": []
        },
        {
          "id": "mqqm2g6",
          "author": "Hutcho12",
          "body": "Unfortunately they seem to be. Console makers seem to just be passing on the prices to the rest of the world to maintain US market share.  They clearly see this as temporary.",
          "score": 2,
          "created_utc": 1746465478.0,
          "replies": [
            {
              "id": "mqqnxje",
              "author": "None",
              "body": "That’s not so much them eating the cost, more like they are using other markets to subsidize the US market. \n\nWhich I guess in a way is them eating the cost because they’ve effectively cut themselves completely out of those markets, I’m looking at you Xbox.",
              "score": 3,
              "created_utc": 1746466006.0,
              "replies": []
            },
            {
              "id": "mqqolxv",
              "author": "SilvanSorceress",
              "body": "A huge reason they need to raise prices is to make up for the scale that would have otherwise come from the US market",
              "score": 1,
              "created_utc": 1746466195.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq564v",
          "author": "Zireall",
          "body": "Imagine thinking these prices will go down after the idiot leaves office and a sane person tries to undo what he did…\n\nHe just fucked everyone over and he doesn’t care because he’s 80 years old and is going to die soon. ",
          "score": 1,
          "created_utc": 1746460527.0,
          "replies": [
            {
              "id": "mqs0ykc",
              "author": "rogers_tumor",
              "body": "I got weirdly depressed yesterday when I looked up and saw that he's only 78.\n\nI know. with any other person I probably wouldn't be thinking or saying \"only.\" but that's how it feels. \n\nif he were like 85 I'd be feeling way more optimistic. on the other hand, Vance is a couch-fucking nightmare evangelical. but maybe without the figurehead, they lose some steam... I don't know anymore.",
              "score": 2,
              "created_utc": 1746480398.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq5m6z",
          "author": "PolitelyHostile",
          "body": "Many MAGA idiots also don't see why directly taxing these corporations is a better approach. Apparently that's communism.",
          "score": 1,
          "created_utc": 1746460658.0,
          "replies": []
        },
        {
          "id": "mqqoxwk",
          "author": "DrDerpberg",
          "body": "They might, but only in an industry where prices are set by what people are willing to pay *and* that price is much higher than costs. \n\nSay there's an industry where the cost of getting it made and onto the shelf is 10% of the sticker price, and where sales fall off a cliff if they raise prices... Yeah there they might eat the difference. But I'm not sure how many products like that really exist. Maybe some niche luxury goods where a $1000 thing is sold for $10k, but are those so price sensitive that they'd lose clients if the price became $11k?",
          "score": 1,
          "created_utc": 1746466289.0,
          "replies": []
        },
        {
          "id": "mqqx5sq",
          "author": "Unlucky_Clover",
          "body": "That’s what gets me, this just feels like common sense.",
          "score": 1,
          "created_utc": 1746468641.0,
          "replies": []
        },
        {
          "id": "mqqy6xw",
          "author": "Waqqy",
          "body": "Frustratingly, some companies are actually increasing their prices in other regions, but not the US, to insulate American consumers from the tariffs.",
          "score": 1,
          "created_utc": 1746468942.0,
          "replies": []
        },
        {
          "id": "mqr0v9n",
          "author": "drumrhyno",
          "body": "Also, imagine living in that society and being totally fine with less competition in the market.",
          "score": 1,
          "created_utc": 1746469724.0,
          "replies": []
        },
        {
          "id": "mqt2ns6",
          "author": "Dash_Harber",
          "body": "They bet that the ultra capitalists who will side with literally any cause or ideology to sell their product would suddenly become ultra nationalists and voluntarily lose a bunch of money for no reason is a wild take.",
          "score": 1,
          "created_utc": 1746492989.0,
          "replies": []
        },
        {
          "id": "mqtjh3h",
          "author": "fartsfromhermouth",
          "body": "But they can just onshore all the production and it'll be so cheap and will all have factory jobs",
          "score": 1,
          "created_utc": 1746498846.0,
          "replies": []
        },
        {
          "id": "mqu6dt4",
          "author": "MrsMiterSaw",
          "body": "While this is a perfectly reasonable thing to say in a general discussion that includes China, *this article specifically, is about Canon, a Japanese company*. Their projections are not dire, as they seem to expect a lower 10% tariff on Japan.\n\nI'm not writing to rebuke you, just so that others who may not have read the article understand this is specifically about Japan, not China.",
          "score": 1,
          "created_utc": 1746508794.0,
          "replies": []
        },
        {
          "id": "mqw2yxb",
          "author": "Bunnymancer",
          "body": "I mean, Sony thinks Europe will eat the cost of their US tariffs.\n\nThere are horrible idiots everywhere",
          "score": 1,
          "created_utc": 1746542011.0,
          "replies": []
        },
        {
          "id": "mqpprq8",
          "author": "worotan",
          "body": "Everyone thinks that corporations and their politicians are going to deal with climate change so they don’t have to reduce their consumption, so it’s not the craziest thing people think.",
          "score": 2,
          "created_utc": 1746455953.0,
          "replies": []
        },
        {
          "id": "mqpwtzg",
          "author": "None",
          "body": "[removed]",
          "score": -11,
          "created_utc": 1746458066.0,
          "replies": [
            {
              "id": "mqpzxkb",
              "author": "None",
              "body": "It doesn’t really matter what country is exporting to the US. Very few companies will eat the cost of a tariff regardless of how big the tariff is, no company will eat the cost of the Chinese Tariffs though.",
              "score": 14,
              "created_utc": 1746458986.0,
              "replies": [
                {
                  "id": "mqq2m0n",
                  "author": "None",
                  "body": "[removed]",
                  "score": -13,
                  "created_utc": 1746459772.0,
                  "replies": [
                    {
                      "id": "mqq2xx9",
                      "author": "None",
                      "body": "This is hardly the only example of this happening",
                      "score": 9,
                      "created_utc": 1746459869.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqq5s4u",
              "author": "Jdm783R29U3Cwp3d76R9",
              "body": "That's just for the 90 days pause. It's 24% unless they make a deal. Nothing so far.",
              "score": 3,
              "created_utc": 1746460707.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqpjqrh",
      "author": "Another_Road",
      "body": "It’s stupid af because so many companies are afraid to say “we’re raising prices because of tariffs” because Trump makes it “political” and then people start trying to boycott it. There was a *rumor* of Amazon showing tariff charges separately only for it to be publicly decried by the Trump admin as being unfair and “why didn’t they add on a Biden inflation charge???” as if that makes any damn sense. \n\nIt’s not politics to say higher prices for distributors mean higher prices for consumers.",
      "score": 299,
      "created_utc": 1746454092.0,
      "replies": [
        {
          "id": "mqpnjos",
          "author": "P00slinger",
          "body": "Any taxes should be transparent liken sales taxes are",
          "score": 105,
          "created_utc": 1746455280.0,
          "replies": [
            {
              "id": "mqsu8jx",
              "author": "pixel_of_moral_decay",
              "body": "Unfortunately the definition of “taxes” in a consumer transaction is very specific, and tariffs aren’t.\n\nThat’s one of the pros of VAT system, it’s all the same thing.  Tariffs, sales tax, it’s all the same in every respect.",
              "score": 19,
              "created_utc": 1746490094.0,
              "replies": [
                {
                  "id": "mqsujjf",
                  "author": "P00slinger",
                  "body": "Semantics.\nTaxes, tariffs, fees etc all should be displayed and transparent.",
                  "score": 4,
                  "created_utc": 1746490200.0,
                  "replies": [
                    {
                      "id": "mqsvdnt",
                      "author": "pixel_of_moral_decay",
                      "body": "There’s explicit laws on this, it isn’t semantics as much as you might wish it could be.  Taxes and tariffs are technically two different things implemented different for different purposes.\n\nWhat can be listed on a receipt is also coded into law. It’s not up to a merchant to decide. The definition of tax is very explicit.",
                      "score": 5,
                      "created_utc": 1746490484.0,
                      "replies": [
                        {
                          "id": "mqti09t",
                          "author": "P00slinger",
                          "body": "Dude I’ve bought beer in LA and there a fucking list of shit on the receipt after the base price including a fee that like goes into hospitality staff medical fund and whatever else.",
                          "score": 0,
                          "created_utc": 1746498313.0,
                          "replies": [
                            {
                              "id": "mqtj961",
                              "author": "pixel_of_moral_decay",
                              "body": "That’s specially spelled out in federal state and local law. The merchant doesn’t get a choice.\n\nNYC also allows city/state tax to be split in some circumstances.",
                              "score": 2,
                              "created_utc": 1746498769.0,
                              "replies": [
                                {
                                  "id": "mqtld9g",
                                  "author": "P00slinger",
                                  "body": "Federal state and local…. So let’s say you’re right it means federal doesn’t even have the final say and the White House getting upset about it is irrelevant",
                                  "score": 1,
                                  "created_utc": 1746499541.0,
                                  "replies": [
                                    {
                                      "id": "mqtmc2b",
                                      "author": "pixel_of_moral_decay",
                                      "body": "I don’t think congress is going to sit idle and let state or local governments rule on how federal tariffs aren’t applied.  If anything the courts would step in.",
                                      "score": 0,
                                      "created_utc": 1746499908.0,
                                      "replies": [
                                        {
                                          "id": "mr0fyap",
                                          "author": "P00slinger",
                                          "body": "Also thinking about it the laws wouldn’t apply at all to what is shown at ‘checkout’ on a website.\n\nThe laws also likely say what has to be on an invoice rather than what can’t be given that invoices can have coupons and whatever else on them.",
                                          "score": 1,
                                          "created_utc": 1746591415.0,
                                          "replies": [
                                            {
                                              "id": "mr0g64s",
                                              "author": "pixel_of_moral_decay",
                                              "body": "Courts view checkout the same way as a receipt.  That's well established.  It must have the same information as a receipt with the same degree of detail.",
                                              "score": 1,
                                              "created_utc": 1746591507.0,
                                              "replies": [
                                                {
                                                  "id": "mr0hx48",
                                                  "author": "P00slinger",
                                                  "body": "Where is that precedent ?",
                                                  "score": 0,
                                                  "created_utc": 1746592304.0,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "mr0iwlh",
                                                  "author": "P00slinger",
                                                  "body": "The majority of cases, albeit still all only at a local US District Court level rather than the more authoritative appellate court levels, have held against the theory. A recent decision out of an Illinois federal district court is typical. It dismissed the theory that a web page is a “printed” receipt because it did not conform to the plain meaning of the word “print,” which the court held means a rendition of text onto physical paper. The court held that an e-mail order confirmation sent to a purchaser is not a printed receipt under FACTA, which takes this even further than prior cases that were focused on the web pages that a retail site might display in the course of the sales process.",
                                                  "score": 0,
                                                  "created_utc": 1746592772.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mqvckeb",
                                          "author": "P00slinger",
                                          "body": "It’s not about how they’re applied \nIt’s about transparency to the customer.",
                                          "score": 0,
                                          "created_utc": 1746532891.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mqpqf39",
          "author": "Ehh_littlecomment",
          "body": "Amazon has always shown duties separately to rest of us. It’s just that US didn’t have any significant customs duties for a very long time.",
          "score": 44,
          "created_utc": 1746456148.0,
          "replies": [
            {
              "id": "mqr475b",
              "author": "sanjosanjo",
              "body": "Are you describing Amazon outside the US when you say \"the rest of us\"?  That's interesting to hear.  It makes sense to show taxes separately, even in the US.",
              "score": 5,
              "created_utc": 1746470713.0,
              "replies": [
                {
                  "id": "mqu9p90",
                  "author": "DutchSuperHero",
                  "body": ">That's interesting to hear.  It makes sense to show taxes separately, even in the US.\n\nAs a consumer once you are aware that VAT is being applied (which it basically is across the board with typically few exceptions in Europe) what is the extra benefit of being shown the pre-VAT price?\n\nI know my local VAT is 9% on food & healthcare and 21% on non-food (oversimplified but generally correct for store bought goods), the pre-VAT price of a TV is meaningless to me because as a consumer I'm always paying the full VAT included price (there are a few exceptions but those aren't on store bought goods).",
                  "score": 3,
                  "created_utc": 1746510579.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqqbhi6",
          "author": "Quasic",
          "body": "Trump insisted that the tariffs are a good thing, but simultaneously considers anyone admitting they exist to be personally attacking him.\n\nThis is because he is a very clever man and you're stupid if you can't understand that.",
          "score": 17,
          "created_utc": 1746462411.0,
          "replies": []
        },
        {
          "id": "mqpt1qm",
          "author": "Revoldt",
          "body": "The only “logical” reason I’ve seen Re:Amazon or other retailers not separating out tariff-related increases, is that it will reveal how high their profit margins are. \n\nA 145% tariff is on their cost of goods, not retail price. Etc etc",
          "score": 8,
          "created_utc": 1746456935.0,
          "replies": []
        },
        {
          "id": "mqt5ox8",
          "author": "blahblah19999",
          "body": "If China is eating the tariffs, why does the WH not want the line item on the receipt?",
          "score": 1,
          "created_utc": 1746494046.0,
          "replies": []
        },
        {
          "id": "mqppm7q",
          "author": "Graardors-Dad",
          "body": "Maybe because saying you need to raise prices because you use basically slave labor in countries with very few labor laws or environmental laws so you can lower your labor cost to next to nothing and make insane profit and increase your ceos salaries to 1000x your average worker isn’t really a good look.",
          "score": -30,
          "created_utc": 1746455907.0,
          "replies": [
            {
              "id": "mqpw4ou",
              "author": "HoidToTheMoon",
              "body": "\"Anybody not in America is a slave\" really is a hard bit of brainwashing to break the MAGAs out of.",
              "score": 27,
              "created_utc": 1746457856.0,
              "replies": [
                {
                  "id": "mqpwele",
                  "author": "Graardors-Dad",
                  "body": "Man you are really desperate to defend billionaires huh?",
                  "score": -29,
                  "created_utc": 1746457938.0,
                  "replies": [
                    {
                      "id": "mqpx3ps",
                      "author": "HoidToTheMoon",
                      "body": "See how you had to transition to a non-sequitur to try and hide the fact that your comment was dumb as rocks? That's a clue that you're acting in bad faith or have some cognitive dissonance that you can't bring yourself to confront.",
                      "score": 24,
                      "created_utc": 1746458147.0,
                      "replies": [
                        {
                          "id": "mqpxn8q",
                          "author": "None",
                          "body": "[removed]",
                          "score": -19,
                          "created_utc": 1746458307.0,
                          "replies": [
                            {
                              "id": "mqpxzo0",
                              "author": "HoidToTheMoon",
                              "body": "> I responded in bad faith \n\nSo there's no point in trying to have a conversation with you. All of your comments seem to be made in bad faith. You use misinformation and dishonest arguments pretty much exclusively.",
                              "score": 21,
                              "created_utc": 1746458410.0,
                              "replies": [
                                {
                                  "id": "mqpybxo",
                                  "author": "Graardors-Dad",
                                  "body": "Crying cause your bad faith comment was responded to in bad faith. Lmao what a hypocrite.",
                                  "score": -5,
                                  "created_utc": 1746458511.0,
                                  "replies": [
                                    {
                                      "id": "mqr6b31",
                                      "author": "NyxNyctores",
                                      "body": "You're hopeless",
                                      "score": 3,
                                      "created_utc": 1746471331.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mqqcm45",
                              "author": "adamdoesmusic",
                              "body": "You can’t respond in any other way, don’t lie.",
                              "score": 5,
                              "created_utc": 1746462743.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqpr37r",
              "author": "TheHoneyM0nster",
              "body": "Products already have country of origin printed on them.",
              "score": 10,
              "created_utc": 1746456349.0,
              "replies": [
                {
                  "id": "mqpu4mn",
                  "author": "Graardors-Dad",
                  "body": "Not really the same",
                  "score": -4,
                  "created_utc": 1746457257.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqqd14k",
              "author": "adamdoesmusic",
              "body": "If this was about the CEOs making too much, then we should tax them. \n\nI have friends in China, they’re coming up a lot faster than I ever got to, and probably ever will now that my country’s economy is being intentionally destroyed piece by piece, and the objectively stupidest members of my society are cheering it on. \n\nAnd yes, if someone voted Trump, they’re either ignorant/stupid or evil, there’s no secret third option.",
              "score": 6,
              "created_utc": 1746462866.0,
              "replies": [
                {
                  "id": "mqqdt9p",
                  "author": "Graardors-Dad",
                  "body": "Your friends in China coming up faster than you is argument for tariffs. We are growing their economy while ours shrinks because all our money is going to them. Thats Trump entire point lmao.",
                  "score": -7,
                  "created_utc": 1746463097.0,
                  "replies": [
                    {
                      "id": "mqqemgi",
                      "author": "DoubleJumps",
                      "body": "The US economy was growing until the tariffs.  We just had the first of what will probably be multiple quarters of shrinkage due to tariffs.",
                      "score": 6,
                      "created_utc": 1746463336.0,
                      "replies": [
                        {
                          "id": "mqqfoxq",
                          "author": "Graardors-Dad",
                          "body": "The economy was growing for the 1% but not the rest of us.",
                          "score": -1,
                          "created_utc": 1746463648.0,
                          "replies": [
                            {
                              "id": "mqqhadb",
                              "author": "DoubleJumps",
                              "body": "So how do you want to explain a way that real wage growth was outpacing inflation? \n\nLike you clearly either don't have any of the numbers you're talking about or you are deliberately making things up and ignoring them",
                              "score": 3,
                              "created_utc": 1746464105.0,
                              "replies": [
                                {
                                  "id": "mqqis78",
                                  "author": "Graardors-Dad",
                                  "body": "How do you explain the wealth gap between the 1% and everyone else?",
                                  "score": 0,
                                  "created_utc": 1746464536.0,
                                  "replies": [
                                    {
                                      "id": "mqqiytm",
                                      "author": "DoubleJumps",
                                      "body": "This is a really stupid game.  \n\n\"Wealth inequality exists, therefore the economy is shrinking!\"\n\nAbsolutely nobody should be wasting time with you. You either can't understand these basic concepts or you choose not to",
                                      "score": 2,
                                      "created_utc": 1746464590.0,
                                      "replies": [
                                        {
                                          "id": "mqqkk1o",
                                          "author": "Graardors-Dad",
                                          "body": "I’m sure it sounds stupid when you completely misrepresent my point. Either you are strawmaning my argument or just don’t get it.\n\nLet me spell it out for you. The wealth gap has reached levels not seen since the robber barons days. That’s not a coincidence.",
                                          "score": -1,
                                          "created_utc": 1746465049.0,
                                          "replies": [
                                            {
                                              "id": "mqqt6w6",
                                              "author": "MadBullBen",
                                              "body": "So how would these tariffs help the wage gap exactly? Do you really think that the 1% are going to take a massive pay cut and increase the pay to all of the employees? \n\nThese tariffs hit the small businesses the hardest and those guys aren't the 1%. \n\nBringing back industry is a fine idea, doing it so that no one can prepare for the taxes only helps the rich because it creates an even bigger monopoly with all the smaller companies going out of business",
                                              "score": 2,
                                              "created_utc": 1746467498.0,
                                              "replies": [
                                                {
                                                  "id": "mqqu6x3",
                                                  "author": "Graardors-Dad",
                                                  "body": "It allows American companies to compete with major corporations that use unethical labor to drive down their labor cost. Small business can now compete with cheap Chinese crap that floods our market.",
                                                  "score": 1,
                                                  "created_utc": 1746467782.0,
                                                  "replies": [
                                                    {
                                                      "id": "mqqwzqp",
                                                      "author": "MadBullBen",
                                                      "body": "Small businesses use Chinese parts. You know that the US industry has been going downhill for decades with so much manufacturing going to china, because of that US doesn't have the manufacturing capabilities that companies need. If a company uses some or all Chinese parts then they are gonna struggle hard. \n\nThe electronics industry is literally all china, they have entire supermarkets literally just for components, something which is never seen anywhere else, they have entire sections of the cities just for manufacturing, so everything these companies source from are within 10 minutes drive, the US and Europe as well have zoning laws where this literally cannot happen, instead of a 10 minutes instead it's hours. To get to that stage would literally take decades of very specific planning. Companies may have 10-30 different suppliers all of which are close by, which makes everything very efficient. \n\nThis goes for many other industries too, china is incredibly laid out for manufacturing while the west doesn't have anything like this.\n\nBesides, why would these companies move to the US when they could move to other SEA countries or Mexico where labour costs are way down? \n\nI do agree that people need to be less consumerist, but these tariffs don't just hurt unneeded stuff, they affect absolutely everything, what you eat, drink, protective layers for food, clothes, cooking supplies etc, basic stuff.",
                                                      "score": 3,
                                                      "created_utc": 1746468591.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqqfre2",
                      "author": "adamdoesmusic",
                      "body": "lol you think Trump has plans, or is intelligent enough to play this like a chess game? \n\nThis is what I mean, only stupid/ignorant people believe anything he says.",
                      "score": 4,
                      "created_utc": 1746463668.0,
                      "replies": [
                        {
                          "id": "mqqhyti",
                          "author": "DoubleJumps",
                          "body": "That guy in particular has pretty much not said an accurate thing in this entire sub, about taxation or the economy, to the extent where he's either hopelessly incapable of understanding these things or he's deliberately choosing not to, and either way I wouldn't waste any more time on him",
                          "score": 2,
                          "created_utc": 1746464299.0,
                          "replies": [
                            {
                              "id": "mqr5bcb",
                              "author": "adamdoesmusic",
                              "body": "Fair point. I need to get off of reddit entirely.",
                              "score": 2,
                              "created_utc": 1746471042.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mqqg6n3",
                          "author": "Graardors-Dad",
                          "body": "Yes I do he’s been talking about it for decades now. You can keep calling people stupid but you are the one not putting up a compelling argument against it lmao. Calling people stupid doesn’t make you smart btw.",
                          "score": -6,
                          "created_utc": 1746463790.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqqdsia",
              "author": "thatoneguydudejim",
              "body": "MAGA supporters, champions of workers rights and environmental regulations!! Give me a fucking break",
              "score": 5,
              "created_utc": 1746463091.0,
              "replies": [
                {
                  "id": "mqqefvy",
                  "author": "Graardors-Dad",
                  "body": "Not an argument",
                  "score": -1,
                  "created_utc": 1746463282.0,
                  "replies": [
                    {
                      "id": "mqqf45w",
                      "author": "thatoneguydudejim",
                      "body": "No it’s more of a statement along the lines of “I don’t believe you care about these things for a single second.”",
                      "score": 6,
                      "created_utc": 1746463480.0,
                      "replies": [
                        {
                          "id": "mqqfyyf",
                          "author": "Graardors-Dad",
                          "body": "Ok cool doesn’t mean those two things wouldn’t benefit.",
                          "score": -1,
                          "created_utc": 1746463728.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mqpffje",
      "author": "anxrelif",
      "body": "It’s only a matter of time which is very soon that these policies will destroy 100 year old companies employing thousands of Americans.",
      "score": 388,
      "created_utc": 1746452690.0,
      "replies": [
        {
          "id": "mqpi4hd",
          "author": "Radarker",
          "body": "It's the goal, and we are too cowardly a people to react.",
          "score": 169,
          "created_utc": 1746453569.0,
          "replies": [
            {
              "id": "mqpist8",
              "author": "anxrelif",
              "body": "Lazy and fat too",
              "score": 72,
              "created_utc": 1746453788.0,
              "replies": [
                {
                  "id": "mqps5ff",
                  "author": "Michael_Schmumacher",
                  "body": "That (*at least* the last part)is by design. Check obesity numbers from 40 years ago.",
                  "score": 14,
                  "created_utc": 1746456665.0,
                  "replies": [
                    {
                      "id": "mqpso4d",
                      "author": "waterloograd",
                      "body": "You can blame tobacco companies switching to food from cigarettes",
                      "score": 8,
                      "created_utc": 1746456822.0,
                      "replies": [
                        {
                          "id": "mqptn88",
                          "author": "diacewrb",
                          "body": "Way too many calories in those chocolate cigars and candy cigarettes.",
                          "score": 7,
                          "created_utc": 1746457112.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqq8rfc",
              "author": "None",
              "body": "Wow crazy that people dont want to throw away their jobs or their lives to stand up to a government that’s literally grabbing people and throwing them in unmarked vans and sending them to CECOT. what an incredibly shortsighted comment",
              "score": 7,
              "created_utc": 1746461600.0,
              "replies": [
                {
                  "id": "mqr05mm",
                  "author": "Pyromaniacal13",
                  "body": "Right up there with the \"You have the 2nd Amendment\" comments, forgetting it was written when muskets were peak warfare technology and today the gov't has F35s.",
                  "score": 2,
                  "created_utc": 1746469515.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqpno0d",
              "author": "Jollyjacktar",
              "body": "I wouldn’t necessarily say “cowardly” but probably “conditioned” not to react.",
              "score": 2,
              "created_utc": 1746455317.0,
              "replies": [
                {
                  "id": "mqpp9tv",
                  "author": "OGAnoFan",
                  "body": "We took thousands of years of human social evolution, threw it into that shit book 42 laws of power, and watched the power vaccum get filled by an abhorent void, where there is no empathy, only apathy",
                  "score": 16,
                  "created_utc": 1746455805.0,
                  "replies": []
                },
                {
                  "id": "mqpw25y",
                  "author": "love_glow",
                  "body": "I think, as a populous, we are highly entertained, and stimulated. The dopamine box makes Rome’s bread and circuses look like paint drying.",
                  "score": 0,
                  "created_utc": 1746457835.0,
                  "replies": [
                    {
                      "id": "mqpzzya",
                      "author": "KindBass",
                      "body": "It's kind of funny the amount of times I've seen comments on reddit calling everyone lazy cowards and then you check their profile and see they play video games for like 10 hrs/day.",
                      "score": 4,
                      "created_utc": 1746459005.0,
                      "replies": [
                        {
                          "id": "mqqqyll",
                          "author": "CommodoreAxis",
                          "body": "Well yeah, how do you think we know that so many people are also like this?",
                          "score": 2,
                          "created_utc": 1746466865.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqu6mi0",
              "author": "MrsMiterSaw",
              "body": "It's not the goal. He literally has the mind of a 15 year old kid who missed the freshman year discussion of tariffs in his econ 1 class.\n\n*He really believes this will work*\n\nHe is the worst possible person we could have elected. As a nation, we deserve this.",
              "score": 1,
              "created_utc": 1746508919.0,
              "replies": []
            },
            {
              "id": "mqpswj5",
              "author": "alek_hiddel",
              "body": "How exactly would you propose that we react?  An armed rebellion is exactly what fascists want.  It gives them the excuse to declare martial law, and stop pretending to care about democracy.  \n\nWe’re 3 months in, and haven’t had an election since this started.  We’re protesting, we’re organizing, and hopefully people actually vote.",
              "score": 0,
              "created_utc": 1746456891.0,
              "replies": []
            },
            {
              "id": "mqpqoye",
              "author": "worotan",
              "body": "We’ve had decades of people telling each other that ordinary people can’t do anything, so they don’t have reduce their unsustainable lifestyles.\n\nWe’ve trained ourselves to accept the unacceptable, and voted with our wallets for the decent people in public life to be removed so that they don’t try to reduce our standards of living by dealing with climate change the way climate science tells us. Now we’re left with the worst, but why did anyone think anything else would happen?\n\nWe wanted the freedom to have whatever we wanted if we have the money, and that has enabled the worst corruption to take over. Why is anyone surprised?",
              "score": -4,
              "created_utc": 1746456231.0,
              "replies": [
                {
                  "id": "mqqc1uh",
                  "author": "adamdoesmusic",
                  "body": "I sure as shit didn’t vote for any of this, don’t put that on me. I picked the woman with the funny laugh, and the woman everyone was mad at for some reason.",
                  "score": 3,
                  "created_utc": 1746462577.0,
                  "replies": [
                    {
                      "id": "mqqdqf6",
                      "author": "worotan",
                      "body": "You vote with your wallet every day. People who voted against Trump have been funding the worst corporations for decades, knowing it was destroying our future, and are now surprised that the corporations and their politicians know they can act publicly against ordinary people’s interests and face no consequences.\n\nThe only vote that matters in our system is with your wallet.",
                      "score": -1,
                      "created_utc": 1746463073.0,
                      "replies": [
                        {
                          "id": "mqqg3tu",
                          "author": "adamdoesmusic",
                          "body": "I always figured those sorts of mental gymnastics would have to be generated by an early AI video maker.",
                          "score": 1,
                          "created_utc": 1746463767.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mqplt9e",
          "author": "jumpinpuddles",
          "body": "Also lots of small and medium sized companies that employ thousands of Americans and indirectly support thousands more jobs. I work in the toy industry 😞",
          "score": 26,
          "created_utc": 1746454745.0,
          "replies": [
            {
              "id": "mqqfj7q",
              "author": "Frodojj",
              "body": "I think this will be the biggest impact. Larger companies have more resources and leverage to ride the tarrifs longer. Smaller companies will be hurt much more. Small businesses will be decimated relatively quickly. That benefits the larger companies with reduced competition.\n\nTesla is an example. In the US in Q1 2025, Tesla sold 4-5x more EVs than their largest competitors (In order GM, Hyundai/Kia, Ford, VW...). They actually supported repealing the EV subsidy for consumers because it would hurt everyone else more than themselves. Tesla are also not hurt by the tarrifs as much as their competitors. It's not a coincidence that Musk supported Trump.",
              "score": 14,
              "created_utc": 1746463601.0,
              "replies": [
                {
                  "id": "mqrd01m",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1746473326.0,
                  "replies": [
                    {
                      "id": "mqrel8v",
                      "author": "Frodojj",
                      "body": "* [Musk said he wanted the EV subsidies to end.](https://www.forbes.com/sites/saradorn/2024/12/05/musk-calls-for-ending-electric-vehicle-tax-credit-which-could-help-tesla/)\n\n* [Tesla supported ending the tax credit to hurt their competitors more.](https://www.reuters.com/business/autos-transportation/trumps-transition-team-aims-kill-biden-ev-tax-credit-2024-11-14/)\n\n\nThey want to kill the competition. It’s the same reason Saudi Arabia is increasing oil production. It hurts their competitors who can’t weather the adverse market conditions as well.",
                      "score": 4,
                      "created_utc": 1746473805.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqqg6g0",
              "author": "cythric",
              "body": "Sorry bud, Americans really hate small businesses.",
              "score": 4,
              "created_utc": 1746463788.0,
              "replies": []
            },
            {
              "id": "mqs2gui",
              "author": "None",
              "body": "None of this would have been a big problem if there was like 1 year notice to give companies time to find alternate suppliers",
              "score": 3,
              "created_utc": 1746480870.0,
              "replies": [
                {
                  "id": "mqs3tg1",
                  "author": "jumpinpuddles",
                  "body": "And if it was not an EO done with an emergency power, and subject to the whims of a guy who keeps changing it, pausing, unpausing, going back on deals he made, raising and lowering numbers, exempting smartphones, adding movies...Everyone in my industry is just frozen. No one is going to invest in moving because they don't know where to go, or if it's necessary.",
                  "score": 2,
                  "created_utc": 1746481293.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqrn4vx",
          "author": "smurficus103",
          "body": "Crash everything out, buy the rubble, repeat",
          "score": 3,
          "created_utc": 1746476299.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqpli2d",
      "author": "sillypoolfacemonster",
      "body": "How could anyone have foreseen such a development.  It’s almost like tariffs aren’t free money!",
      "score": 53,
      "created_utc": 1746454647.0,
      "replies": []
    },
    {
      "id": "mqphawv",
      "author": "Astronut325",
      "body": "Remember when Republicans would pride themselves as “free market capitalists?” Pepperidge Farm remembers!\n\nWait, no they don’t. Farmers are also getting screwed right now. And they’re Trump’s Boot Lickers.",
      "score": 104,
      "created_utc": 1746453303.0,
      "replies": [
        {
          "id": "mqpprxx",
          "author": "Graardors-Dad",
          "body": "Remember when democrat said “tax the rich” now suddenly taxing the rich just means that they will pass that cost onto the consumer.",
          "score": -64,
          "created_utc": 1746455955.0,
          "replies": [
            {
              "id": "mqpscut",
              "author": "jajajajajajaja34",
              "body": "Who are the rich being taxed that will pass the burden to the consumer in this situation?",
              "score": 44,
              "created_utc": 1746456728.0,
              "replies": [
                {
                  "id": "mqptm4f",
                  "author": "Graardors-Dad",
                  "body": "Corporations exploiting workers over seas to drive down their labor cost to make more profit?",
                  "score": -36,
                  "created_utc": 1746457103.0,
                  "replies": [
                    {
                      "id": "mqpvqlj",
                      "author": "lmfaorn1998",
                      "body": "I notice you left out any mention of taxation, because no rich people are being burdened by additional taxes. For corporations, the cost of acquiring goods has risen, with no change to their rate of taxation. Learn more at your local high school economics class.",
                      "score": 41,
                      "created_utc": 1746457739.0,
                      "replies": [
                        {
                          "id": "mqpwr3i",
                          "author": "Graardors-Dad",
                          "body": "Why has their cost of acquiring goods risen?",
                          "score": -29,
                          "created_utc": 1746458042.0,
                          "replies": [
                            {
                              "id": "mqpyf81",
                              "author": "lmfaorn1998",
                              "body": "“Tax the rich” and “tariff imported goods” are not synonymous as you seem to believe. Consumers pay the cost of the tariffs, not corporations, not rich people, not the government. Again, high school economics covers this pretty early on.",
                              "score": 36,
                              "created_utc": 1746458538.0,
                              "replies": [
                                {
                                  "id": "mqpz32e",
                                  "author": "Graardors-Dad",
                                  "body": "“The consumers pay them” and why is that? Because the rich force them to just like they would a tax increase. They could easily eat the increase but they won’t because profit margins must remain the same. Same thing if you tax their profits.",
                                  "score": -8,
                                  "created_utc": 1746458735.0,
                                  "replies": [
                                    {
                                      "id": "mqq5oqh",
                                      "author": "codyzon2",
                                      "body": "Wait how would you think this works? What mechanism are you talking about that would push the cost onto the corporations without impacting consumers? Because just asking nicely for a corporation to eat the cost of a tariff is pretty much the dumbest take you could potentially have when talking about this whole situation.\n\n Companies charge based on what they pay for goods, they don't eat the cost and look at it as just paying their fair share, that would destroy a company how would you expect that to work? Do you believe that companies have endless  resources? \n\nThat's why you absolutely have to tax them with actual taxes because that's not something that just gets pushed off as easily on consumers, It also allows for you to completely avoid companies that do pass off their higher tax burden onto customers because usually  we have an alternate to choose from, but with tariffs you're forcing people to pay the company at whatever rate they ask because there is no alternative. \n\nIf you increase the price for American companies to produce a product and make it punitive to choose any non American company but somehow expect the prices not to go up?  Like you're just expecting companies to operate at a loss because of \"reasons\" until the company would most certainly have to close. So in the long run you want to damage all American companies and destroy more jobs while simultaneously costing American consumers more money everyday, seems like a super smart winning strategy.",
                                      "score": 24,
                                      "created_utc": 1746460679.0,
                                      "replies": [
                                        {
                                          "id": "mqq8o3l",
                                          "author": "tykogars",
                                          "body": "There’s zero chance the guy you’re responding to reads even half of that lol",
                                          "score": 17,
                                          "created_utc": 1746461572.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "mqqexc3",
                                          "author": "DoubleJumps",
                                          "body": "I explained to this guy exactly how you can't pass an income tax onto your consumer and quest. He didn't understand it at all, so I wouldn't bother. I don't think this person is either capable of doing so or they are specifically choosing not to.",
                                          "score": 3,
                                          "created_utc": 1746463424.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "mqq96qc",
                                          "author": "Graardors-Dad",
                                          "body": ">Wait how would you think this works? What mechanism are you talking about that would push the cost onto the corporations without impacting consumers? Because just asking nicely for a corporation to eat the cost of a tariff is pretty much the dumbest take you could potentially have when talking about this whole situation.\n\nThe mechanism is not having corporation under cut everyone by having unethical labor practices that normal companies can’t compete with. They can’t just endless raise prices because people will just stop buying stuff. We saw this as inflation was used as an excuse to raise prices above the actual inflation rate.\n\n>Companies charge based on what they pay for goods, they don't eat the cost and look at it as just paying their fair share, that would destroy a company how would you expect that to work? Do you believe that companies have endless  resources?\n\nDo you think companies don’t have a profit margin? I don’t understand this paragraph at all it makes zero sense. You have to balance you profit margins with what people are willing to pay you cant just increase you prices as much as you want and expect people to keep buying stuff that’s not how it works. You demand will absolutely be destroyed if you try to pass off all of the cost onto consumers or they will find an alternative. This is the basis of capitalism.\n\n>That's why you absolutely have to tax them with actual taxes because that's not something that just gets pushed off as easily on consumers, It also allows for you to completely avoid companies that do pass off their higher tax burden onto customers because usually  we have an alternate to choose from, but with tariffs you're forcing people to pay the company at whatever rate they ask because there is no alternative.\n\nThis paragraph makes zero sense and it’s almost like your logic is opposite. First of all you aren’t explaining why a universal tax wouldn’t cause them to pass the cost onto consumers. Also why would there be companies that don’t pass the cost onto consumers? This contradicts what you just said above. Are we just hoping companies will eat a tax increase out of the goodness of their heart? Why would there not be an alternative in the tariff case then? Not only could companies just eat the cost increase like they would with a tax increase but they can also use American based companies that wouldn’t be affected by tariffs. Your argument assumes everything is made outside of America which is not correct.\n\n>If you increase the price for American companies to produce a product and make it punitive to choose any non American company but somehow expect the prices not to go up?  Like you're just expecting companies to operate at a loss because of \"reasons\" until the company would most certainly have to close. So in the long run you want to damage all American companies and destroy more jobs while simultaneously costing American consumers more money everyday, seems like a super smart winning strategy.\n\nThe first sentence is literally the opposite of what tariffs are supposed to do and that literally describes what a flat tax increase would do to companies. I’m so confused. Companies would not operate at a loss their profits would not just be increased. Meanwhile American based companies that don’t use unethical labor would actually be able to compete generating tons of jobs that are not only protected by workers right laws but also environmental jobs and the money would actually stay in our local economy rather then stimulating Chinas. Not only will you have jobs that don’t require a college degree, but you will have tons of engineering, environmental, health and safety jobs as well.",
                                          "score": -1,
                                          "created_utc": 1746461728.0,
                                          "replies": [
                                            {
                                              "id": "mqqdtax",
                                              "author": "codyzon2",
                                              "body": "You are correct that a company would try to pass higher taxes off onto the consumer but  just like how it works now you would have competitors to go to instead so it would be a bad idea for them to do so, they would lose business that they potentially would never regain. their prices would go up, but then you would just choose to go with a cheaper company, that's how the free market works, but you're taking choice away because now we don't have any other alternative, If we're only given the option for higher prices with an American company or outlandishly high prices from a foreign company that's no choice. \n\nyou seem think that America produces everything that they sell. You think because an American corporation is in America that they're making every part of their product. It's like you don't actually know what a supply chain is or how that affects manufacturing and how it affects the cost for the actual company. Most American companies don't actually produce anything in the country, And when they do they mostly source their materials from out of the country, we don't have infrastructure to replace that. That's the biggest part of this whole conversation, we don't have the factories or the infrastructure in place for any of the stuff we're putting tariffs on, not to mention some of the actual resources we need can't be produced here, there are rare earth minerals required for a lot of electronics that we just can't produce. I would really like to see you find a company that makes a product that solely only sources its materials within America.",
                                              "score": 5,
                                              "created_utc": 1746463097.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mqqhaem",
                              "author": "Levantine1978",
                              "body": "Do... do you still not understand what a tariff is? All this posturing and posting and THIS is what you come up with? \n\nJesus, I know your type is ignorant to a fault but you are so confidently, weirdly wrong it's sort of breathtaking.",
                              "score": 9,
                              "created_utc": 1746464105.0,
                              "replies": [
                                {
                                  "id": "mqqj6cp",
                                  "author": "Graardors-Dad",
                                  "body": "Imagine huffing and puffing about me being ignorant when I was trying to prove a point about how the original comment completely missed the point lmao. Maybe reread the whole exchange and you will see the point I’m making.",
                                  "score": -1,
                                  "created_utc": 1746464651.0,
                                  "replies": [
                                    {
                                      "id": "mqqka9k",
                                      "author": "Levantine1978",
                                      "body": "You have long lost whatever point you think you're making. \n\nHere's a tip: if you walk into a room or conversation and everyone treats you like an asshole, it's time to look at the common element.",
                                      "score": 5,
                                      "created_utc": 1746464972.0,
                                      "replies": [
                                        {
                                          "id": "mqqleyb",
                                          "author": "Graardors-Dad",
                                          "body": "Ah the Argumentum ad populum.",
                                          "score": -1,
                                          "created_utc": 1746465295.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqpwjg5",
              "author": "HoidToTheMoon",
              "body": "Income/capital gains tax on wealthy individuals is not the same thing as a \"double the cost\" sales tax.\n\nOne taxes the wealthy the harshest, the other is a regressive flat tax designed to tax the poor the harshest.\n\nWe still believe in taxing the rich. So do the Republicans chanting it at Republican town halls.",
              "score": 26,
              "created_utc": 1746457977.0,
              "replies": [
                {
                  "id": "mqpx0tw",
                  "author": "Graardors-Dad",
                  "body": "So explain why they wouldnt pass on an increased capital gain tax to their consumers to maintain the same profit same way with tariffs?",
                  "score": -4,
                  "created_utc": 1746458123.0,
                  "replies": [
                    {
                      "id": "mqpxjbd",
                      "author": "HoidToTheMoon",
                      "body": "You... you're asking why an income tax on an individual's income doesn't get treated the same was as a flat tax on each product?\n\nIf you're genuinely asking I can break it down for you, but going by your other comments here you seem to be a propagandist more than someone interested in actual dialogue.",
                      "score": 24,
                      "created_utc": 1746458275.0,
                      "replies": [
                        {
                          "id": "mqpysqx",
                          "author": "Graardors-Dad",
                          "body": "The fact that you think you could just tax a billionaires income without taxing their business profits is hilarious considering you said I’m the one who should take a highschool economics class.",
                          "score": -7,
                          "created_utc": 1746458649.0,
                          "replies": [
                            {
                              "id": "mqtgfnx",
                              "author": "HoidToTheMoon",
                              "body": "> considering you said I’m the one who should take a highschool economics class.\n\nI never said that, weirdo. You probably should though, since you don't seem to understand that taxing the income of a single person is very, very different from adding a 25-150% tax on most consumer products.",
                              "score": 4,
                              "created_utc": 1746497749.0,
                              "replies": []
                            },
                            {
                              "id": "mqqula4",
                              "author": "exomachina",
                              "body": "I’m convinced that everyone in this thread thinks that every rich person just has this crazy income stream that can be chipped away at without any effect at all.",
                              "score": -3,
                              "created_utc": 1746467893.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqqbsah",
                      "author": "DoubleJumps",
                      "body": "With tariffs, a company gets taxed on goods before they sell them to a customer, so because it's front loaded, they can make it back by increasing the price of those goods. \n\nThey can't pass on taxes on the money they make AFTER sales because those taxes are a percentage of what they made and charging more doesn't reduce the percentage.  If they were being taxed 20%, they are still being taxed 20% whether they made 10 million or 20 million.  \n\nIt's basic math.\n\nIf I'm making $10 by selling a t-shirt for $10, and I'm taxed 20% on that income, I'm paying $2 in tax.  \n\nAnd if I raise the price of that t-shirt to $12 to make up for that $2, I'm still getting taxed 20% on that income and now I'm paying 2.50 for that shirt.  I will never make the percentage I pay less by charging more.  \n\n You can however, end up making yourself make less money by raising those prices to chase something you'll never catch, by causing consumers to buy less of your product",
                      "score": 5,
                      "created_utc": 1746462500.0,
                      "replies": [
                        {
                          "id": "mqqcjyx",
                          "author": "Graardors-Dad",
                          "body": "So if they have an overall increase of 20% why wouldn’t they just increase their cost 20% to make up for that increase in taxes?",
                          "score": -4,
                          "created_utc": 1746462726.0,
                          "replies": [
                            {
                              "id": "mqqebu5",
                              "author": "DoubleJumps",
                              "body": "... I literally just explained this to you.  That's what that post explains.",
                              "score": 10,
                              "created_utc": 1746463249.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqqjmho",
                      "author": "OddNothic",
                      "body": "You really don’t need understand what Capital Gains taxes are or how they work, do you?\n\nCompanies absolutely do take CGT into consideration when they sell assets. It’s baked into the math of “do I sell this building,” or that IP asset. Any significant impact does hit the bottom line and will find its way into the final price of the goods and services.\n\nBut when the conversation is about ”taxing billionaires,” it is referring to taxing individuals. There are goods or services to raise the price of.\n\nBezos, Musk, et al. don’t personally have anything to raise the price of. They may sit on the board or head a company that doe, but they don’t.\n\nSo a CGT on individuals does not do what you’re suggesting it does.",
                      "score": 6,
                      "created_utc": 1746464782.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqspnwg",
              "author": "Ironcastattic",
              "body": "Lol!!\nLook here class. Someone who is too stupid to understand every single study done on Reaganomics has shown it doesn't work. \nFucking dipshit.",
              "score": 3,
              "created_utc": 1746488550.0,
              "replies": [
                {
                  "id": "mqsqhjm",
                  "author": "Graardors-Dad",
                  "body": "Guess who hates tariffs lmao",
                  "score": 0,
                  "created_utc": 1746488827.0,
                  "replies": [
                    {
                      "id": "mqsri3x",
                      "author": "Ironcastattic",
                      "body": "I don't know or care what you hate. Simply put, \"trickle down\" has shown to be a scam. Taxing billionaires isn't a problem unless you are gullible enough to believe their propaganda rhetoric they shovel out to the stupidest people on earth",
                      "score": 2,
                      "created_utc": 1746489166.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqsf768",
              "author": "DjPersh",
              "body": "Literally the dumbest thing I’ve read on Reddit since I saw a girl asking for proof that the first humans came out of Africa.",
              "score": 2,
              "created_utc": 1746485044.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqprcsy",
      "author": "ptraugot",
      "body": "Of course they are. Just like every other company in the world. Who thought tariffs wouldn’t be passed directly to the consumer? Oh yeah…",
      "score": 21,
      "created_utc": 1746456429.0,
      "replies": []
    },
    {
      "id": "mqpvawu",
      "author": "TheGreatSoup",
      "body": "My whole problem with this, is that companies just prioritize the US and up the prices world wide.  I wish it was only the US that has to pay the consequences of their own actions.",
      "score": 41,
      "created_utc": 1746457608.0,
      "replies": [
        {
          "id": "mqr52om",
          "author": "sanjosanjo",
          "body": "Sony is doing that with the PlayStation.  https://www.theguardian.com/business/2025/apr/14/sony-hikes-playstation-5-price-by-25-as-trump-tariffs-bite",
          "score": 14,
          "created_utc": 1746470971.0,
          "replies": [
            {
              "id": "mqr5hpg",
              "author": "None",
              "body": "Sony is such a terrible company and this is just one more example in a long list",
              "score": 11,
              "created_utc": 1746471094.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq1vu4",
          "author": "SandyTaintSweat",
          "body": "Yeah any company that pulls that is a company I won't buy from anymore. Americans' mistakes are their own. I won't fund the US government by subsidizing the tariffs for American consumers.",
          "score": 17,
          "created_utc": 1746459558.0,
          "replies": [
            {
              "id": "mqq3pou",
              "author": "TheGreatSoup",
              "body": "That has been happening almost like forever. \nIs their way to subsidize their major market.",
              "score": 5,
              "created_utc": 1746460096.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqq5yae",
      "author": "Hola0722",
      "body": "Remember, tariffs started the Revolutionary War.",
      "score": 14,
      "created_utc": 1746460758.0,
      "replies": [
        {
          "id": "mr05504",
          "author": "MasterOfNone011",
          "body": "I’m down",
          "score": 1,
          "created_utc": 1746586973.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqrk6j7",
      "author": "ghec2000",
      "body": "No no no. I heard that we won't be paying these tariffs either directly or indirectly. The counties we imposed them on will pay https://abcnews.go.com/Politics/trumps-top-economic-adviser-hassett-refutes-tariffs-raise/story?id=120523274. /s",
      "score": 12,
      "created_utc": 1746475440.0,
      "replies": [
        {
          "id": "mqu0s31",
          "author": "designateddesignator",
          "body": "You didn't make 90% of the body text /S/S/S /s/s they need more /s to understand sarcssm, bless their hearts /s",
          "score": 1,
          "created_utc": 1746506035.0,
          "replies": []
        },
        {
          "id": "mqrykic",
          "author": "naaktstel",
          "body": "You're kidding, right? Of cause they won't. Trade to other countries will intensify, US will be left behind, just as they wish.",
          "score": 0,
          "created_utc": 1746479657.0,
          "replies": [
            {
              "id": "mqrzt69",
              "author": "ghec2000",
              "body": "That would be what the /s means in internet stuff. 😀",
              "score": 11,
              "created_utc": 1746480039.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqrl6mi",
      "author": "mattyice1095",
      "body": "I work in retail with signage changes. All HP ink in store has gone up at $5+. The dual black and color packs up about $10+. Fuck these Tariffs",
      "score": 14,
      "created_utc": 1746475733.0,
      "replies": []
    },
    {
      "id": "mqpho6l",
      "author": "Mysterious_Lesions",
      "body": "I'm assuming they are raising prices to collect the tariff and not price taking that would affect other countries who are happy to buy products at the current market price.",
      "score": 10,
      "created_utc": 1746453422.0,
      "replies": [
        {
          "id": "mqq49ay",
          "author": "LetsJerkCircular",
          "body": "I’m baffled people read the headline and *comment*—not just read comments, but make comments.\n\nIt says in the article that Canon would continue business as usual in other countries, and it would help people in those countries get equipment that’s on back order.\n\nThere wasn’t any talk about plans to price gouge or take advantage of the situation. They’re raising prices in the US to compensate for tariff costs. They have a couple months of inventory that will be unaffected because it already here. Equipment imported after tariffs kick in will be affected by the increased costs. Other countries aren’t fucking around like us (US), so they’ll be unaffected and possibly benefited by inventory availability due to decrease in US sales.",
          "score": 14,
          "created_utc": 1746460256.0,
          "replies": [
            {
              "id": "mqqr34y",
              "author": "bob_mcbob",
              "body": "Meanwhile Leica just increased prices due to tariffs in in both the United States *and* Canada, \"to maintain price parity\".",
              "score": 5,
              "created_utc": 1746466901.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqq2kgu",
          "author": "Cactuszach",
          "body": "This is the Anakin/Padme meme.",
          "score": 9,
          "created_utc": 1746459760.0,
          "replies": []
        },
        {
          "id": "mqplqkr",
          "author": "None",
          "body": "[deleted]",
          "score": 6,
          "created_utc": 1746454721.0,
          "replies": [
            {
              "id": "mqprdbq",
              "author": "Deranged_Kitsune",
              "body": "Ah, the Sony model.",
              "score": 10,
              "created_utc": 1746456433.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqq2i9o",
      "author": "eddie1996",
      "body": "china is paying the tariffs, right?",
      "score": 9,
      "created_utc": 1746459742.0,
      "replies": [
        {
          "id": "mqs613j",
          "author": "RevealerofDarkness",
          "body": "Right? 😦",
          "score": 2,
          "created_utc": 1746481992.0,
          "replies": []
        },
        {
          "id": "mqrbz8a",
          "author": "Darknessie",
          "body": "I thought they were building the wall, they have the expertise here.",
          "score": 1,
          "created_utc": 1746473019.0,
          "replies": [
            {
              "id": "mqrsnv4",
              "author": "artisanrox",
              "body": "Mexico is building the wall! and also paying for it!",
              "score": 1,
              "created_utc": 1746477901.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqpy8jd",
      "author": "obelix_dogmatix",
      "body": "Why is this news? Did anyone expect differently?",
      "score": 13,
      "created_utc": 1746458483.0,
      "replies": [
        {
          "id": "mqq7udi",
          "author": "superpj",
          "body": "A whole lot of republicans",
          "score": 15,
          "created_utc": 1746461327.0,
          "replies": []
        },
        {
          "id": "mqre9vr",
          "author": "MyRealUser",
          "body": "It's news because most companies are afraid to say that because it will make MAGA mad",
          "score": 6,
          "created_utc": 1746473711.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqsjec0",
      "author": "YaBastaaa",
      "body": "Tariffs killed globalism.",
      "score": 5,
      "created_utc": 1746486459.0,
      "replies": [
        {
          "id": "mquq7cm",
          "author": "Funkula",
          "body": "Globalism is fine actually. It only killed the US economy. \n\nOur shelves might be empty, our stocks may be down, our dollar might be down, we might have lost millions of US jobs, we might have sent prices so high it’ll make 4% inflation seem like childs play, but at least our tariffs killed our economy ourselves! 🇺🇸",
          "score": 6,
          "created_utc": 1746520854.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqrd0mq",
      "author": "Elon_is_a_Nazi",
      "body": "![gif](giphy|10uct1aSFT7QiY)",
      "score": 3,
      "created_utc": 1746473331.0,
      "replies": []
    },
    {
      "id": "mqt3euv",
      "author": "Accomplished_Fun6481",
      "body": "Just like Sony and Microsoft I’m assuming this will be worldwide not just in directly affected locations. Fab",
      "score": 2,
      "created_utc": 1746493250.0,
      "replies": [
        {
          "id": "mqu52vp",
          "author": "Scalybeast",
          "body": "Wait, the price hike on systems is global? I'd understand the US, but what is the justification for the rest of the world?",
          "score": 2,
          "created_utc": 1746508121.0,
          "replies": [
            {
              "id": "mqvfnh4",
              "author": "gman5852",
              "body": "PlayStation regularly raises the prices of their consoles globally before Trump even ran for his second term. People just randomly decided to blame tariffs because it was the relevant thing instead of the more realistic reason being they're a Japanese tech company in a world where the yen is dropping in value significantly.\n\nXbox is probably similar with the USD honestly. We already were seeing games raise in price due to inflation and it'd be silly to assume consoles are no different.\n\nThe bad news meaning we haven't actually seen the tariff increase yet.",
              "score": 3,
              "created_utc": 1746534138.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqwho2g",
      "author": "modulev",
      "body": "I'm boycotting everything non essential. Saving all my $$ for food, bills and retirement.",
      "score": 2,
      "created_utc": 1746546273.0,
      "replies": []
    },
    {
      "id": "mqpetv6",
      "author": "Corgon",
      "body": "Oh that's alright I'll go buy a Kodak instead - said noone ever",
      "score": 4,
      "created_utc": 1746452491.0,
      "replies": []
    },
    {
      "id": "mqpqk8k",
      "author": "MattGraverSAIC",
      "body": "Ha canon will raise the prices, and when the tariffs go away they will not drop the prices. They did this under Obama. They also did it across the board for their service center for labor only.",
      "score": 5,
      "created_utc": 1746456192.0,
      "replies": [
        {
          "id": "mqqbyse",
          "author": "Cramer12",
          "body": "Every company ever does this since forever. See gas crisis",
          "score": 7,
          "created_utc": 1746462553.0,
          "replies": [
            {
              "id": "mqqr7ok",
              "author": "MattGraverSAIC",
              "body": "Not every company",
              "score": -1,
              "created_utc": 1746466937.0,
              "replies": [
                {
                  "id": "mqthod1",
                  "author": "Herkfixer",
                  "body": "Which companies lowered their prices back down after COVID?",
                  "score": 2,
                  "created_utc": 1746498195.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mqqhzr6",
      "author": "Jaquemart",
      "body": "At the same time, it's a guarantee that companies will raise prices on other markets to recoup the losses in the USA.\n\nThank you so much.",
      "score": 2,
      "created_utc": 1746464307.0,
      "replies": [
        {
          "id": "mqsxwbu",
          "author": "Taki_Minase",
          "body": "Boycott them, why subsidise tariffs?",
          "score": 1,
          "created_utc": 1746491355.0,
          "replies": [
            {
              "id": "mquelff",
              "author": "Jaquemart",
              "body": "I'm surely going to boycott anything from the USA.",
              "score": 2,
              "created_utc": 1746513406.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqubjj4",
      "author": "blufin",
      "body": "Having the tariffs as a separate item on pricing would have made it more likely for them to be dropped if there's a trade deal. But Trump didn't like it so that's not going to happen.",
      "score": 2,
      "created_utc": 1746511614.0,
      "replies": []
    },
    {
      "id": "mqphsos",
      "author": "6158675309",
      "body": "I guess Amazon must not own dpreview anymore. Otherwise I’m sure this article would be taken down",
      "score": 2,
      "created_utc": 1746453463.0,
      "replies": []
    },
    {
      "id": "mqqo2nl",
      "author": "wickedplayer494",
      "body": "And then after they raise the prices, now you just won't be able to get a camera.",
      "score": 1,
      "created_utc": 1746466046.0,
      "replies": []
    },
    {
      "id": "mqrh76d",
      "author": "DaisyMa1",
      "body": "I am utterly shocked.",
      "score": 1,
      "created_utc": 1746474575.0,
      "replies": []
    },
    {
      "id": "mqsq0ji",
      "author": "oh_my316",
      "body": "Thanks,  Trump trash. This is on you. 🤬",
      "score": 1,
      "created_utc": 1746488669.0,
      "replies": []
    },
    {
      "id": "mqt51lo",
      "author": "CANNIBAL_M_",
      "body": "I used to contract for Xerox and supplies came from all over the world, not just China, it’s a global company. I can’t help but feel like this is a nail in the coffin for the printing industry. Any still existing mom and pops shops won’t be able to handle this long term. Newsletters, books/manuals, invitations, business cards, flyers, anything printed will be more expensive.",
      "score": 1,
      "created_utc": 1746493818.0,
      "replies": []
    },
    {
      "id": "mqti5iy",
      "author": "indywest2",
      "body": "The only way we see lower prices is a depression hits globally.  This is possible and will bring a lot of pain.",
      "score": 1,
      "created_utc": 1746498366.0,
      "replies": []
    },
    {
      "id": "mqu59k7",
      "author": "snowflake37wao",
      "body": "Fuck that judge oh wait two n’s. Fuck cyan!",
      "score": 1,
      "created_utc": 1746508215.0,
      "replies": []
    },
    {
      "id": "mqzhsyr",
      "author": "xDevman",
      "body": "i guess you're going to sell less cameras then",
      "score": 1,
      "created_utc": 1746578736.0,
      "replies": []
    },
    {
      "id": "mr1vqaf",
      "author": "ayakittikorn",
      "body": "Not just because companies are greedy, but because tariffs are dangerously inflationary.",
      "score": 1,
      "created_utc": 1746619655.0,
      "replies": []
    },
    {
      "id": "mr7zkg8",
      "author": "Craigg75",
      "body": "Stephen Thrasher has entered the conversation",
      "score": 1,
      "created_utc": 1746700342.0,
      "replies": []
    },
    {
      "id": "mqqj43p",
      "author": "Marantula36",
      "body": "Have you had enough of “winning” yet, Murica? 🤦‍♂️",
      "score": 1,
      "created_utc": 1746464633.0,
      "replies": []
    },
    {
      "id": "mqvarx1",
      "author": "Individual_Hotel1490",
      "body": "So instead of big execs who are in the top 5% taking a slight pay cut so us consumers don't take the brunt of the cost wasn't even a thought... thanks",
      "score": 1,
      "created_utc": 1746532143.0,
      "replies": []
    },
    {
      "id": "mqqrht7",
      "author": "Smooth_Influence_488",
      "body": "Rats, I thought they meant Judge Aileen Canon 😂",
      "score": 0,
      "created_utc": 1746467018.0,
      "replies": []
    },
    {
      "id": "mqrq83h",
      "author": "Rhiney6",
      "body": "Fuck Canon. They could probably eat a 150% tariff and still profit 300%.",
      "score": 0,
      "created_utc": 1746477191.0,
      "replies": []
    },
    {
      "id": "mqrye4o",
      "author": "Tegumentario",
      "body": "\"...everywhere, in Europe too! 😈 \"",
      "score": 0,
      "created_utc": 1746479603.0,
      "replies": []
    },
    {
      "id": "mqsnh1y",
      "author": "twigboy",
      "body": "Never waste a good crisis",
      "score": 0,
      "created_utc": 1746487816.0,
      "replies": []
    },
    {
      "id": "mqsoigz",
      "author": "1980-whore",
      "body": "Cannon, the same company that inspired every other company to make personal printers worthless.",
      "score": 0,
      "created_utc": 1746488163.0,
      "replies": []
    },
    {
      "id": "mqtuj5n",
      "author": "BedBugger6-9",
      "body": "I guess I’ll only be able to afford 2 cameras now, not 20…",
      "score": 0,
      "created_utc": 1746503286.0,
      "replies": []
    },
    {
      "id": "mqxxw82",
      "author": "Any-Establishment-15",
      "body": "Here’s what the democrats in my state should say: \n\nThanks to Thom Tillis and GOP tariffs, Canon’s raising prices on printers. Post your receipts with #RepublicanTariffTax and tag @SenThomTillis. Let’s show him how much it’s costing North Carolina families.",
      "score": 0,
      "created_utc": 1746561211.0,
      "replies": []
    },
    {
      "id": "mqy0j3d",
      "author": "Electrical_Height743",
      "body": "Stop buying stuff you don't need.",
      "score": 0,
      "created_utc": 1746561959.0,
      "replies": [
        {
          "id": "mqz9q19",
          "author": "DrivesInCircles",
          "body": "And the stuff we do need?\n\nQuit pretending like this is going to make life better.",
          "score": 1,
          "created_utc": 1746575885.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqpui32",
      "author": "TrickOut",
      "body": "At a certain point consumers need to shrug their shoulders and not buy this over priced crap, inflations, tariffs, supply chain issues I don’t care, it’s not up to us as consumers to make consumer friendly affordable products, that’s on the companies.",
      "score": -12,
      "created_utc": 1746457367.0,
      "replies": [
        {
          "id": "mqqgesd",
          "author": "Candle1ight",
          "body": "I love not eating, being naked, and homeless.\n\nWho exactly do you think isn't affected by these tariffs?",
          "score": 5,
          "created_utc": 1746463855.0,
          "replies": [
            {
              "id": "mqqh3nw",
              "author": "TrickOut",
              "body": "That’s the dumbest shit ive ever read, we are in a post talking about Canon not food and bills. You can’t do anything about the necessities in life it is what it is, but for luxury goods that are sky rocketing in price stop buying that crap.",
              "score": -6,
              "created_utc": 1746464052.0,
              "replies": [
                {
                  "id": "mqqs3x3",
                  "author": "Savings_Base8115",
                  "body": "Alot more than canon is getting affected by tarrifs dumb fuck ",
                  "score": 5,
                  "created_utc": 1746467191.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqpvnhn",
          "author": "TheGreatSoup",
          "body": "So far the whole tariff and inflation in the US is more to pass that accumulated wealth from the boomer to Gen Z.",
          "score": -11,
          "created_utc": 1746457713.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqqlv4n",
      "author": "InTooDeep024",
      "body": "Good thing I have a phone that has a camera",
      "score": -4,
      "created_utc": 1746465421.0,
      "replies": []
    },
    {
      "id": "mqr85h1",
      "author": "the_chosen_one2",
      "body": "NOOO MY TREATS!!",
      "score": -1,
      "created_utc": 1746471876.0,
      "replies": []
    },
    {
      "id": "mqpltlo",
      "author": "legoturtle214",
      "body": "I'm sure they aren't saying what the markup on all those contracts will be. It's like free money!",
      "score": -5,
      "created_utc": 1746454747.0,
      "replies": [
        {
          "id": "mqr09ag",
          "author": "ScientiaProtestas",
          "body": "Even if you want to argue that some companies aren't directly affected by tariffs, and they raise prices using tariffs as an excuse, it is still caused by tariffs.  Or if tariffs raise prices for other companies, and not another, and they raise prices because they don't have low end price competition, it is still because of tariffs.",
          "score": 2,
          "created_utc": 1746469545.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqpv01g",
      "author": "rukioish",
      "body": "The biggest lie the world ever sold the american people was how many luxury goods they needed to be happy.",
      "score": -19,
      "created_utc": 1746457517.0,
      "replies": [
        {
          "id": "mqq9d4b",
          "author": "RedRocksHigh",
          "body": "This is an absolutely dogshit take. We don’t need luxury goods to be happy, but taking away luxury goods is a sure fire way of lowering the general happiness of the country. We need sustainable supply chains to be happy, when those are disrupted then instability and chaos take foothold and we are not happy.",
          "score": 9,
          "created_utc": 1746461779.0,
          "replies": []
        },
        {
          "id": "mqthdrb",
          "author": "Herkfixer",
          "body": "Yes, because people were so happy when they lived like \"Little House of the Prairie\" and the only thing they got for Christmas was a new hat or a new dress. All other money was spent on basic sustenance and they sure were living it up.",
          "score": 2,
          "created_utc": 1746498087.0,
          "replies": []
        },
        {
          "id": "mqrtiio",
          "author": "FarplaneDragon",
          "body": "This doesn't affect just luxury goods. It affects goods that business need to stay up and running. All those computers you see in every business running things? Yeah, those parts are going up in price too, not just consumer goods.",
          "score": 1,
          "created_utc": 1746478149.0,
          "replies": []
        },
        {
          "id": "mqq67vn",
          "author": "joni-draws",
          "body": "We’re a consumer culture. It’s sickening.",
          "score": -5,
          "created_utc": 1746460836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqsnpje",
      "author": "None",
      "body": "No one cares canon sucks. They’ll declare bankruptcy soon",
      "score": -2,
      "created_utc": 1746487894.0,
      "replies": []
    },
    {
      "id": "mqsxr74",
      "author": "12kdaysinthefire",
      "body": "Canon has sucked for a long time, this isn’t surprising they announced a price jack publicly. I’m sure their executives pants all got tighter when they heard about the tariffs.",
      "score": -2,
      "created_utc": 1746491306.0,
      "replies": []
    },
    {
      "id": "mqujipy",
      "author": "None",
      "body": "Cannon is still in business?",
      "score": -2,
      "created_utc": 1746516484.0,
      "replies": []
    },
    {
      "id": "mqpl51n",
      "author": "None",
      "body": "[deleted]",
      "score": -8,
      "created_utc": 1746454535.0,
      "replies": [
        {
          "id": "mqpnnu7",
          "author": "jumpinpuddles",
          "body": "How are the manufacturers enabling the madness? Many consumer product company’s business models were basically made illegal by the gvt overnight. They can pretty much raise prices, or go out of business. I work in consumer products (toys) and many of my clients are facing this.",
          "score": 10,
          "created_utc": 1746455315.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqsyk09",
      "author": "LiveApplication4578",
      "body": "Canon sucks ass",
      "score": -3,
      "created_utc": 1746491582.0,
      "replies": []
    },
    {
      "id": "mqpqj7f",
      "author": "Weaubleau",
      "body": "Enjoy losing sales!",
      "score": -27,
      "created_utc": 1746456183.0,
      "replies": [
        {
          "id": "mqqdnuc",
          "author": "Trpepper",
          "body": "Everyone is going to have to enjoy losing sales in America thanks to these stupid tariffs.",
          "score": 8,
          "created_utc": 1746463052.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqq2xhw",
      "author": "InfoSuperHiway",
      "body": "Bah, they were probably going to anyway with or without the tariffs. Assholes.\n\nEdit: Just to be clear, I am not for the tariffs and I am not a supporter of that garbage ass dictator we’ve got in the White House. I just think the printer companies overcharge for their shit already.",
      "score": -24,
      "created_utc": 1746459865.0,
      "replies": [
        {
          "id": "mqqsia0",
          "author": "Savings_Base8115",
          "body": "You are in a cult ",
          "score": 5,
          "created_utc": 1746467304.0,
          "replies": [
            {
              "id": "mqr0w7m",
              "author": "InfoSuperHiway",
              "body": "By your comment, I suspect you think that I’m a trump supporter. I’m not. I hate that fat piece of shit. I’m very liberal. I was actually trying to talk shit about the printer companies and how much they charge for ink and stuff.",
              "score": 1,
              "created_utc": 1746469732.0,
              "replies": [
                {
                  "id": "mqtgwem",
                  "author": "Herkfixer",
                  "body": "Pretty sure it's a bot and it has no idea what you actually posted.",
                  "score": 1,
                  "created_utc": 1746497913.0,
                  "replies": [
                    {
                      "id": "mqthi9n",
                      "author": "InfoSuperHiway",
                      "body": "Well that’s just crazy",
                      "score": 1,
                      "created_utc": 1746498132.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mqrkdh9",
                  "author": "Savings_Base8115",
                  "body": "Liberals are a massive reason we are where we are. Do nothing dems allowed this to happen and are standing idle or helping him out. The handful of progressives in that party are the only hope and they have no real power thanks to dems ",
                  "score": -2,
                  "created_utc": 1746475496.0,
                  "replies": [
                    {
                      "id": "mqs0rwm",
                      "author": "InfoSuperHiway",
                      "body": "Okay cool, so no matter what my views are, you just felt like attacking a random stranger. Or you’re mad I’m talking bad about the Canon company…? You’re a pretty cool guy.",
                      "score": 2,
                      "created_utc": 1746480339.0,
                      "replies": [
                        {
                          "id": "mqs18zp",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1746480486.0,
                          "replies": [
                            {
                              "id": "mqs1wur",
                              "author": "InfoSuperHiway",
                              "body": "What the fuck are you even talking about? How am I playing the victim? I think you’re just a toxic person.",
                              "score": 1,
                              "created_utc": 1746480694.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mqrhz7w",
      "author": "xHolo01x",
      "body": "They don’t even have to raise prices. This is why all this is bullshit. The tax is just passed on. I’ve gotten several packages with that reflected on the tracking receipt. Manufacturers don’t need to raise prices the price of anything. But I want them too. Price themselves out.",
      "score": -5,
      "created_utc": 1746474801.0,
      "replies": []
    },
    {
      "id": "mqpkh7u",
      "author": "DLeeC52",
      "body": "Raise em then. These companies think Americans will just keep paying, but we make stuff here too. Go out of business.",
      "score": -57,
      "created_utc": 1746454326.0,
      "replies": [
        {
          "id": "mqpnsjj",
          "author": "roth_dog",
          "body": "Which camera company is based in America? Oh, none.",
          "score": 44,
          "created_utc": 1746455356.0,
          "replies": [
            {
              "id": "mqr63yh",
              "author": "FoRiZon3",
              "body": "There's Kodak....Oh wait they already run it to the ground for their arrogance lol.",
              "score": 3,
              "created_utc": 1746471275.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqpo4qt",
          "author": "ABrokenWolf",
          "body": "> but we make stuff here too.\n\nThat's fuckin hilarious.",
          "score": 34,
          "created_utc": 1746455458.0,
          "replies": []
        },
        {
          "id": "mqpsfw7",
          "author": "iamcts",
          "body": "r/confidentlyincorrect content if you think that we can make everything in America that we import from other countries.",
          "score": 19,
          "created_utc": 1746456753.0,
          "replies": []
        },
        {
          "id": "mqpvvmm",
          "author": "pie-oh",
          "body": "Some Americans really do think America is the only country in the world sometimes. There's a large world out there that they'll sell to, and they definitely wont go bust.",
          "score": 10,
          "created_utc": 1746457782.0,
          "replies": []
        },
        {
          "id": "mqpsn9z",
          "author": "lew_rong",
          "body": "asdfsadf",
          "score": 12,
          "created_utc": 1746456814.0,
          "replies": [
            {
              "id": "msy9da6",
              "author": "DLeeC52",
              "body": "I'm enjoying the crap out of it",
              "score": 1,
              "created_utc": 1747574968.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqqclk1",
          "author": "trollanony",
          "body": "So you don’t realize American made stuff usually imports components and sells the finished product only… you’re rooting for most businesses to fail.",
          "score": 3,
          "created_utc": 1746462739.0,
          "replies": []
        },
        {
          "id": "mqplxa6",
          "author": "Nuclear_Sprout",
          "body": "If there is one thing that’s certain it’s that Americans will keep buying things.",
          "score": 7,
          "created_utc": 1746454778.0,
          "replies": []
        },
        {
          "id": "mqq9nwh",
          "author": "RedRocksHigh",
          "body": "Increasing the cost of raw materials will surely make America uncompetitive on the global stage. You’re asking for American enterprises to go out of business, foreign counterparts will not go out of business and will find markets elsewhere.",
          "score": 2,
          "created_utc": 1746461869.0,
          "replies": []
        }
      ]
    }
  ]
}