{
  "post": {
    "title": "Intel proposes new modular standards for laptops and mini PCs to improve repairability |  Upgrades for individual parts could cut costs and e-waste",
    "author": "chrisdh79",
    "id": "1ia1x9s",
    "score": 2813,
    "created_utc": 1737852879.0,
    "selftext": "",
    "num_comments": 213,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ia1x9s/intel_proposes_new_modular_standards_for_laptops/"
  },
  "comments": [
    {
      "id": "m96ufwk",
      "author": "SheepWolves",
      "body": "so laptops from the 90s and early 2000s? The standard back then was replaceable battery, cpu, ram, drives and some even had swappable MXM gpus.",
      "score": 646,
      "created_utc": 1737853601.0,
      "replies": [
        {
          "id": "m971cbh",
          "author": "Arthur-Wintersight",
          "body": "I count myself among the people who miss those days.",
          "score": 192,
          "created_utc": 1737855973.0,
          "replies": [
            {
              "id": "m97dr26",
              "author": "valthonis_surion",
              "body": "Even if the laptops were thicker, I’m all for upgrades.",
              "score": 93,
              "created_utc": 1737860324.0,
              "replies": [
                {
                  "id": "m97zisq",
                  "author": "VariousProfit3230",
                  "body": "I just want my serial ports back. Please. I am tired of my USB to Serial always flaking out at the worst possible times.",
                  "score": 33,
                  "created_utc": 1737869074.0,
                  "replies": [
                    {
                      "id": "m980bd7",
                      "author": "Scurro",
                      "body": "Luckily most of my devices that have consoles use some form of usb.\n\nWhat I want back as a default is damn ethernet.",
                      "score": 27,
                      "created_utc": 1737869445.0,
                      "replies": [
                        {
                          "id": "m9a92w2",
                          "author": "TheCookieButter",
                          "body": "My gaming laptop has an expandable ethernet port. How thin do laptops need to be that they don't have room for like 60% of an ethernet port? It's as stupid as leaving out a 3.5mm on phones and especially tablets.\n\nThat laptop also has an easily replaceable battery, fans, two M.2 drives, HDD, 2x SODIMM ram slots, network card. All with a single Phillips screwdriver.\n\nIt's heavy, but that's the cooling system, metallic body, and HDD. I don't seen any reason why that level of replacement isn't possible on 90% of consumer laptops.",
                          "score": 12,
                          "created_utc": 1737907843.0,
                          "replies": [
                            {
                              "id": "m9b7s1n",
                              "author": "tholasko",
                              "body": "Yeah, my laptop has an Ethernet port with a chin that folds down to accommodate the full girth.",
                              "score": 1,
                              "created_utc": 1737917678.0,
                              "replies": []
                            },
                            {
                              "id": "m9bvjs0",
                              "author": "Plank_With_A_Nail_In",
                              "body": "I smashed every expandable ethernet port I ever had on a laptop. I'd rather not have one unless is a full size one.",
                              "score": 0,
                              "created_utc": 1737924318.0,
                              "replies": [
                                {
                                  "id": "m9cq5cc",
                                  "author": "TheCookieButter",
                                  "body": "I'd prefer a full one where it'll fit. I've not had a problem with the expanding ones. If they're easily replaceable, even better!",
                                  "score": 1,
                                  "created_utc": 1737932764.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m98k4t0",
                          "author": "Gorostasguru",
                          "body": "Don’t all laptops these days have ethernet?",
                          "score": -1,
                          "created_utc": 1737880364.0,
                          "replies": [
                            {
                              "id": "m98o0t5",
                              "author": "AKU_net",
                              "body": "Not anymore most of the ones that do are the “gaming” laptops",
                              "score": 20,
                              "created_utc": 1737882750.0,
                              "replies": [
                                {
                                  "id": "m99kjbw",
                                  "author": "GepardenK",
                                  "body": "Lenovo tends to ship business/work laptops with ethernet ports. With some exceptions, so check the model.",
                                  "score": 3,
                                  "created_utc": 1737899857.0,
                                  "replies": [
                                    {
                                      "id": "m99v4a4",
                                      "author": "Scurro",
                                      "body": "ThinkPad Yoga does not and this is what my work went with.",
                                      "score": 4,
                                      "created_utc": 1737903608.0,
                                      "replies": [
                                        {
                                          "id": "m9a2e4u",
                                          "author": "GepardenK",
                                          "body": "Yeah, the Yoga line is their answer to the contemporary demand for slick and stylish form factor, which makes them decidedly un-ThinkPad -like in a good few ways.",
                                          "score": 3,
                                          "created_utc": 1737905874.0,
                                          "replies": [
                                            {
                                              "id": "m9bprb8",
                                              "author": "Backshots4you",
                                              "body": "I have the yogas sister PC, the X1 (basically the not reversible yoga) for work and it’s the worst PC I’ve ever had. Overheats, dreadful performance issues, peripherals not working. Just got the green light to replace it and will buy literally anything but an intel Lenovo.",
                                              "score": 1,
                                              "created_utc": 1737922756.0,
                                              "replies": [
                                                {
                                                  "id": "m9bsyfl",
                                                  "author": "GepardenK",
                                                  "body": "Interestingly, I had an Dell XPS and went fleeing to Lenovo for all the same reasons. Although I immediately ignored the X1 once I saw it targeted a similar consumer profile as the XPS.",
                                                  "score": 1,
                                                  "created_utc": 1737923619.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9bw606",
                                                      "author": "Backshots4you",
                                                      "body": "I had a Lenovo P1 in the past that while very large was a good PC for years. Idk what it is about the i7 line of their lower tier offerings that are just awful.",
                                                      "score": 1,
                                                      "created_utc": 1737924486.0,
                                                      "replies": [
                                                        {
                                                          "id": "m9bybue",
                                                          "author": "GepardenK",
                                                          "body": "All the \"we're trying to be mac but with an intel chip\" laptops generally ends up terrible. Regardless of manufacturer, and despite an often positive online reputation.\n\nFor Lenovo, their bulky P series, and the more conventional T series, tend to end up being very solid and reliable. I consider the rest of their (frankly ridiculously large) lineup to be nothing but fluff.",
                                                          "score": 1,
                                                          "created_utc": 1737925078.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m99rpi1",
                                      "author": "showyerbewbs",
                                      "body": "I've had decent luck with USB C to ethernet on the Yoga line.\n\n\nBut that's just my experience.",
                                      "score": 1,
                                      "created_utc": 1737902455.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m9a5k8f",
                                  "author": "ryrobs10",
                                  "body": "The most infuriating thing on my work laptop is that the only ports it has at all are 2 Thunderbolt 4 and one normal USB-C 3.2. No hdmi. No ethernet. No usb-a. Just the usb-c ports",
                                  "score": 2,
                                  "created_utc": 1737906814.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m9a7f0j",
                              "author": "newsflashjackass",
                              "body": "McBooks require a dongle to connect a CAT5 cable.\n\n`https://www.amazon.com/dp/B08CK9X9Z8`\n\nOther manufacturers copy apple, sadly.",
                              "score": 2,
                              "created_utc": 1737907356.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m98c6ky",
                      "author": "Drone30389",
                      "body": "Serial? Do you have an old impact printer or a new telescope or something?",
                      "score": 14,
                      "created_utc": 1737875636.0,
                      "replies": [
                        {
                          "id": "m98cer2",
                          "author": "VariousProfit3230",
                          "body": "So, due to the number of PLCs, Switches, Routers, MFG equipment, and countless legacy legacy devices that pop up from time to time. I work in IT and do IT consulting/contracting as a side gig.\n\nAll the old impact printers were parallel in my experience- I’m not THAT old.",
                          "score": 9,
                          "created_utc": 1737875769.0,
                          "replies": [
                            {
                              "id": "m98pz0l",
                              "author": "notagoodscientist",
                              "body": "I’ve had no such problems so would assume you are using bad quality chinese clone hardware. Edge port and FTDI (legitimate not fake) have been rock solid so would suggest you get better hardware",
                              "score": 8,
                              "created_utc": 1737883939.0,
                              "replies": [
                                {
                                  "id": "m99blzd",
                                  "author": "ToMorrowsEnd",
                                  "body": "This.   I use a rs232 and a rs485 adapter daily and have no problems.   Eaton Keyspan or BlackBox quality ones.\n\nAlso the OP could stop buying garbage laptops and buy the proper tool that has a RS232 port.  My Dell rugged field laptop from last year has a DE9 RS232 port on it. Latitude 5430.  I use the USB adapters when I am bench testing with my  bench PC.  in the field I still carry them, usually when I want to talk to multiple devices at the same time.",
                                  "score": 6,
                                  "created_utc": 1737896201.0,
                                  "replies": [
                                    {
                                      "id": "m9dzufm",
                                      "author": "VariousProfit3230",
                                      "body": "I mean, I (the person, not the royal I) would have to buy it. I only do consultant or contracts on the side since my last contract converted in Pharma. Not a real problem now. Most orgs I have done work for prefer providing equipment (or VMs) and are against me bringing my own device.\n\nAlso, I am not going through one every year or two. I think I’ve had to buy three over a twelve year span- I just use them so infrequently. It’s like triple A batteries, I’ll buy a pack and they’ll end up expiring before I can go through them. So, when I need them and then find I don’t have any good/working ones- it’s an annoyance.",
                                      "score": 2,
                                      "created_utc": 1737946467.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m9btglz",
                              "author": "TooStrangeForWeird",
                              "body": "I'm 31, also in IT, and have worked with quite a few parallel printers. At one point I had to run Windows 7 with an internal-only networked VM, passthrough the parallel add in card, and share it to the Win10 host machine. PITA lol. Damn dot matrix things lol.",
                              "score": 3,
                              "created_utc": 1737923753.0,
                              "replies": [
                                {
                                  "id": "mb529bx",
                                  "author": "fleemfleemfleemfleem",
                                  "body": "It speaks pretty well to the hardware design that it still does its job decades later. Meanwhile tons of USB inkjets spend a few months on a desk before heading to the landfill",
                                  "score": 1,
                                  "created_utc": 1738777198.0,
                                  "replies": [
                                    {
                                      "id": "mb85ytf",
                                      "author": "TooStrangeForWeird",
                                      "body": ">hardware design\n\nI assume you mean the printer by the context, and I 100% agree! They still have it lol. It still works. \n\nThey told me a gear was replaced in like 2000 (when I was *7*) and hardware-wise they never had to have anything else replaced. Apparently it did need a little machine oil every three years or so lol. Pretty sure it's supposed to be every 6-12 months but it still works! \n\nBut yeah, those cheapo inkjets die on purpose. If they *actually* ran a decent maintenance process they'd keep the print heads running for years. Instead, they just DUMP ink every 6-12 months and waste the hell out of it while doing almost nothing to actually keep themselves alive. \n\nBut then you might keep it longer lol. Can't have that! \n\nMeanwhile there's a HP 1020 Deskjet printer from 2006 still running at a nearby store lol. The internal page counter either broke or rolled over because it should be WAY higher than the ~50k pages it reported when I checked. \n\nThey use 2-3 cartridges a month pretty consistently. They rent expensive equipment and print out the entire contract every time someone rents something. That should be a few thousand pages a month. \n\nI mean I'm not *sure* they bought it in 2006, but the owner is a good friend of my mom and he said when he bought it it was the very newest (small) model. \n\nThe thing should be at somewhere around a million pages....\n\nIt sounds fucking ridiculous and I'm sure someone will come along to tell me I'm lying, but I've been there. I've seen it! \n\nWhen I have to go back again (it's pretty infrequent) I'm going to try to remember to check the tag and see if I can find a manufacturing date.",
                                      "score": 1,
                                      "created_utc": 1738809952.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m9bxuwt",
                              "author": "milehighideas",
                              "body": "As someone who works with PLCs, bless my Dell 5430 Rugged with its RS232 port in 2025",
                              "score": 3,
                              "created_utc": 1737924955.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m97zwmc",
                      "author": "EterneX_II",
                      "body": "I’m trying to troubleshoot a router and can’t access its configuration over WiFi and I got lucky because my sister happens to have the one older work computer that has an Ethernet port. Without that, the router might as well have been a brick.",
                      "score": 3,
                      "created_utc": 1737869252.0,
                      "replies": []
                    },
                    {
                      "id": "m9mgc3c",
                      "author": "greennurse61",
                      "body": "I’ve made serial ports with a 8250 UART and TTL chips so I don’t get why almost forty years later that no one can make a decent USB to RS-232 adapter. ",
                      "score": 2,
                      "created_utc": 1738066126.0,
                      "replies": []
                    },
                    {
                      "id": "m9905tb",
                      "author": "mcdithers",
                      "body": "Former network engineer here.  Many USB to serial adapters struggle with Win10/11.  Get one from the Plugable brand, and those issues tend to disappear.",
                      "score": 1,
                      "created_utc": 1737890118.0,
                      "replies": []
                    },
                    {
                      "id": "m9bvagv",
                      "author": "Plank_With_A_Nail_In",
                      "body": "It will still be USB to Serial just on the inside of the laptop.",
                      "score": 1,
                      "created_utc": 1737924246.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m98bq9o",
                  "author": "zxc123zxc123",
                  "body": "I'm just a fucking moomer who just uses desktops. When I need to go mobile then I use my phone. Honestly it's because I always felt laptops are worse bang for buck, followed different rules from desktops, and were much harder to build/maintain/repair due to size restrictions, compatibility, power constraints, going bad once user interfaces fail, etcetc. But if the industry standardizes things more and makes parts/repairing/building more accessible then I'm all for it.",
                  "score": 4,
                  "created_utc": 1737875373.0,
                  "replies": [
                    {
                      "id": "m9a1dh2",
                      "author": "Arthur-Wintersight",
                      "body": "This is why I was looking at framework laptops before realizing they cost more than standard laptops (so an even bigger price gap vs desktop).",
                      "score": 1,
                      "created_utc": 1737905568.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m98g0id",
                  "author": "ptoki",
                  "body": "They dont have to be. Currently most motherboards in laptops arent even as wide as their keyboards. It is simple enough to have face to face connector between cpu and gpu so no need to make the whole device that much thicker.\n\nUsually hdmi and ethernet ports make laptop thick enough to house almost everything you may need. \n\nBut on top of that you can have a gpu connected with thunderbolt or usbc in a docking station. That works too.",
                  "score": 4,
                  "created_utc": 1737877897.0,
                  "replies": [
                    {
                      "id": "m99d6tm",
                      "author": "New_Enthusiasm9053",
                      "body": "Yeah the demise of dvds/Blu-ray must have been a god send for laptop designers. Suddenly they had basically a third of the space back. Then they made them thinner but now that's pretty stagnant. So it's getting to the point where modular designs make sense because innovation has stalled.",
                      "score": 5,
                      "created_utc": 1737896911.0,
                      "replies": [
                        {
                          "id": "m9e1lmo",
                          "author": "ptoki",
                          "body": "I dont get that thinning thing.\n\nThose flat keyboards arent ergonomical. Making laptops  a bit slanted and thicker towards the back hinge would not make much difference for use but it would give a ton of space for cooling and modularity.\n\nBut on the other hand. The modularity is sort of over hyped. Most of desktops are built once and then maybe ram is expanded or disk replaced. Often they just run till their death with the initial cpu. The gpu swap is happening sometimes but often the option to upgrade the gpu is not optimal (cpu becomes the bottleneck for example) so it ends up again, full replacement.\n\nFunny thing is that the modularity actually helps vendors more than customers in a statistical sense.\n\nStill I am all for it. It is better approach overall.",
                          "score": 3,
                          "created_utc": 1737946994.0,
                          "replies": [
                            {
                              "id": "m9ekz0r",
                              "author": "New_Enthusiasm9053",
                              "body": "True, the driving force economically is not customer demand it'll be design and warranty costs. Idk if laptops are truly stagnant enough though for that to happen.",
                              "score": 1,
                              "created_utc": 1737954348.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m99ub4a",
                      "author": "joselrl",
                      "body": "What make this article a bit ironic is that Intel are the ones changing the chipset design every other year and would make upgrades basically impossible after 3 years even if the CPU wasn't soldered   \n  \nI just recently got a thinkpad E16 gen2 and I was fairly happy when doing research finding out that I have 2 non soldered m.2 storage bays and 2 SODDIM slots - which is a weird think to be happy about but yeah, not the most common thing to encounter in 2025",
                      "score": 4,
                      "created_utc": 1737903339.0,
                      "replies": [
                        {
                          "id": "m9c7oxf",
                          "author": "ptoki",
                          "body": "The thing with laptops is that the consumer grade ones are  as you mentioned, soldered shut. The business ones are  very often expandable (nvme/sata/ram) but the cpus are always soldered.\n\nI dont remember a laptop younger than 10 years which had cpu on a socket.\n\nI dont know how the gaming laptops do. I suspect the disks are not soldered (that is pretty common on intel platform) and probably ram too. But I have no idea if gpus are on a daughter boards or not.\n\nBut the arm is imho even worse offender as a platform. Usually you get ram and emmc soldered and only maybe nvme or sata available...",
                          "score": 2,
                          "created_utc": 1737927583.0,
                          "replies": [
                            {
                              "id": "m9caumz",
                              "author": "joselrl",
                              "body": "Even business laptops - those going for thinner and lighter builds / \"premium\" often come with soldered ram and storage nowadays...  \n  \nGaming laptops don't come with socketed GPUs other than very few exceptions (like the Framework 16 actually)   \n  \nAnd RAM is starting to be soldered even in bulky laptops for the sake of \"performance\", you see laptops advertising 7467 Mhz DDR5 speeds for example - which is always soldered. Does those speeds matter? Not in the slightest. But marketing like bigger numbers",
                              "score": 3,
                              "created_utc": 1737928450.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9927ps",
                  "author": "SeyJeez",
                  "body": "Thing is I use my laptop as a mobile workstation I do not care too much about weight or size the performance is more important to me. And I think I’m not alone with this. I can’t use a desktop though as I need to be mobile and move around.",
                  "score": 3,
                  "created_utc": 1737891316.0,
                  "replies": []
                },
                {
                  "id": "m97qbqn",
                  "author": "TheModeratorWrangler",
                  "body": "Nvidia and AMD are not responsible for battery tech. They work with what is offered. That being said. AMD is eating Intel’s lunch. Screw your grandma, AMD makes the chips I want 🤙",
                  "score": -8,
                  "created_utc": 1737865099.0,
                  "replies": [
                    {
                      "id": "m97uiya",
                      "author": "ovrlrd1377",
                      "body": "What did his grandma do though",
                      "score": 5,
                      "created_utc": 1737866859.0,
                      "replies": [
                        {
                          "id": "m97um3z",
                          "author": "TheModeratorWrangler",
                          "body": "She can show me after we have brunch",
                          "score": 1,
                          "created_utc": 1737866897.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m97tu7z",
                      "author": "elite_haxor1337",
                      "body": "bruh wtf are you talking about?",
                      "score": 2,
                      "created_utc": 1737866568.0,
                      "replies": [
                        {
                          "id": "m97u9xi",
                          "author": "TheModeratorWrangler",
                          "body": "People think these companies can wave a magic wand and increase performance per watt. There is a reason that gaming laptops suck, but Mac is smooth as butter off of just an APU.\n\nYou don’t know shit",
                          "score": -7,
                          "created_utc": 1737866753.0,
                          "replies": [
                            {
                              "id": "m97v2n9",
                              "author": "elite_haxor1337",
                              "body": "> increase performance per watt\n\nthey literally can and do. every year they increase performance per watt. but also, that is not what this conversation was about. finally, chill the hell out man, why are you saying that??",
                              "score": 3,
                              "created_utc": 1737867092.0,
                              "replies": [
                                {
                                  "id": "m97vdmb",
                                  "author": "TheModeratorWrangler",
                                  "body": "You seem to not realize that even NVidia can’t make their GPU’s better. The irony is that Intel gave AMD the ability to make x86_64 CPU’s. \n\nYes, increasing performance per watt is an extremely important metric, and AMD is winning the game.\n\nYou were saying?\n\nEdit: NVDA can only accelerate… it can’t run natively. Now while NVDA could go the Steam Deck route, Microsoft will literally say no.",
                                  "score": -9,
                                  "created_utc": 1737867224.0,
                                  "replies": [
                                    {
                                      "id": "m97vtcl",
                                      "author": "emongu1",
                                      "body": "Discussion: Modular laptop were better\n\nTheModeratorWrangler: AMD rule, Intel drool.",
                                      "score": 5,
                                      "created_utc": 1737867414.0,
                                      "replies": [
                                        {
                                          "id": "m98023g",
                                          "author": "EterneX_II",
                                          "body": "This dude is in a contentious debate with everyone for no reason",
                                          "score": 5,
                                          "created_utc": 1737869325.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m97vwkq",
                                          "author": "TheModeratorWrangler",
                                          "body": "Yes that is the current status quo. Check the share price.",
                                          "score": -1,
                                          "created_utc": 1737867453.0,
                                          "replies": [
                                            {
                                              "id": "m97word",
                                              "author": "emongu1",
                                              "body": "Using \"current\" and \"status quo\" together is a 4D chess move i did not expect.\n\nLike using temporary and permanent together.",
                                              "score": 3,
                                              "created_utc": 1737867794.0,
                                              "replies": [
                                                {
                                                  "id": "m97wu23",
                                                  "author": "TheModeratorWrangler",
                                                  "body": "Or maybe paying attention to how Intel screwed consumers for years and us who like AMD are enjoying kicking Intel in the nuts with their own architecture.\n\nAMD is the only company with both GPU and CPU knowledge. Prove me wrong, plebeian.",
                                                  "score": 0,
                                                  "created_utc": 1737867859.0,
                                                  "replies": [
                                                    {
                                                      "id": "m97x979",
                                                      "author": "emongu1",
                                                      "body": "I'll never make a multinational corporation my whole personality. This is just embarrassing.",
                                                      "score": 3,
                                                      "created_utc": 1737868041.0,
                                                      "replies": [
                                                        {
                                                          "id": "m9937rd",
                                                          "author": "TheModeratorWrangler",
                                                          "body": "Well I’ll make them my whole portfolio if I feel the timing is right.",
                                                          "score": 0,
                                                          "created_utc": 1737891891.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m97vp7q",
                                      "author": "elite_haxor1337",
                                      "body": "dude you took too much",
                                      "score": 3,
                                      "created_utc": 1737867364.0,
                                      "replies": [
                                        {
                                          "id": "m97vr2k",
                                          "author": "TheModeratorWrangler",
                                          "body": "You have no argument.",
                                          "score": -6,
                                          "created_utc": 1737867386.0,
                                          "replies": [
                                            {
                                              "id": "m97y25d",
                                              "author": "elite_haxor1337",
                                              "body": "that's right. I'm just wondering why you're randomly talking about companies like they're sports teams, on a comment thread about a new modular laptop and mini pc standard. did you think you were in wallstreetbets?",
                                              "score": 4,
                                              "created_utc": 1737868404.0,
                                              "replies": [
                                                {
                                                  "id": "m993cv7",
                                                  "author": "TheModeratorWrangler",
                                                  "body": "Yes I had a few too many shots lol",
                                                  "score": 1,
                                                  "created_utc": 1737891971.0,
                                                  "replies": [
                                                    {
                                                      "id": "m9aibc2",
                                                      "author": "elite_haxor1337",
                                                      "body": "Hahahaha that's funny. I knew it! Hope you're feeling better",
                                                      "score": 1,
                                                      "created_utc": 1737910518.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9a6nsf",
              "author": "newsflashjackass",
              "body": "https://hackaday.com/2017/01/26/a-personal-fight-against-the-modern-laptop/\n\nApple started the trend to turn laptops into tablets.\n\nI need all the ports, all the status lights, and keyboards with travel. Every component user-serviceable with parts manufactured by third parties.\n\nI don't want a glossy screen to check my makeup, a case that's water resistant to a quarter inch below sea level, or an integrated battery to guarantee obsolescence.",
              "score": 4,
              "created_utc": 1737907135.0,
              "replies": []
            },
            {
              "id": "m9w0psq",
              "author": "spiritofniter",
              "body": "I still have one of those laptops with MXM. Heck, it has TWO MXM GPUs in SLI.",
              "score": 1,
              "created_utc": 1738183688.0,
              "replies": []
            },
            {
              "id": "m9bdd83",
              "author": "Doktor_Vem",
              "body": "I think many, if not most people do, but it's less profitable for the companies that make the computers so it's not very common anymore",
              "score": 0,
              "created_utc": 1737919243.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m977e0z",
          "author": "bulwyf23",
          "body": "I still use my Lenovo Y400 from 2013 for daily browsing and watching videos. I completely disassembled it, put the motherboard on an acrylic sheet with stand offs, maxed out the RAM for the mobo, replaced the fan, new thermal paste, and ditched the battery since it acts like a desktop now. \n\nGPU isn’t upgradable technically, but that laptop offer SLI for dual video cards. There is also a way to hook up a GPU through the M2 slot but it requires a BIOS flash to removed the M2 blacklist (BIOS won’t accept anything but a WiFi card in the m2 slot without flashing). There is also 2 CPU that will fit the motherboard that are above my current CPU but I can’t find them cheaper than $120 and I’m not about to drop that into a computer that’s over a decade old.",
          "score": 25,
          "created_utc": 1737858075.0,
          "replies": [
            {
              "id": "m99eaxi",
              "author": "h0dgep0dge",
              "body": "Linux user behavior",
              "score": 9,
              "created_utc": 1737897385.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m975pv0",
          "author": "Starfox-sf",
          "body": "MXM really wasn’t a standard since each vendor took that specs and made it so that it worked on one particular model, but not other models using MXM let alone different vendors. Difference like power req, heatsink size, etc.\n\nI had a Dell Inspiron 6400 which could do onboard, or MXM (I think) ATI or nVidia card, but you had to choose at order since MB was different from integrated vs dedicated GPU IIRC.",
          "score": 13,
          "created_utc": 1737857485.0,
          "replies": [
            {
              "id": "m97m6wl",
              "author": "mrdeworde",
              "body": "Definitely; that was my first laptop, way back in college. Came with Vista with a memleak that made it work hideously, but it ran vanilla Vista or Win7 like a dream. Great battery life too.",
              "score": 1,
              "created_utc": 1737863463.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98ee6d",
          "author": "jert3",
          "body": "Asus had a nice line of easily upgradeable laptops around 2008 but it just never really took off ...the costs were lower enough for new laptops to make it hard ti justify buying the expansion parts.\n\nBut now a days, could work, as most do not need to upgrade their cpu but gpu swap could prevent buying new.",
          "score": 5,
          "created_utc": 1737876933.0,
          "replies": []
        },
        {
          "id": "m98h7q5",
          "author": "MWink64",
          "body": "I'd prefer the 2000-2010 era (maybe even to ~2015). 90s laptops weren't much fun to work in. I don't think they tended to have socketed CPUs either.",
          "score": 5,
          "created_utc": 1737878603.0,
          "replies": []
        },
        {
          "id": "m98i9ej",
          "author": "AspiringTS",
          "body": "I have a laptop that's perfectly good for me needs. Even fine for my casual gaming. It's battery is replaceable. Not as easy as some older laptops where\n\nThe problem is the don't make them anymore, and the non-genuine alternatives were all sorts of sketchy the last time I looked. So, it stays put and plugged in which isn't ideal for a laptop I want to move around...",
          "score": 3,
          "created_utc": 1737879231.0,
          "replies": [
            {
              "id": "m99522n",
              "author": "OperationMobocracy",
              "body": "Yeah, it seems like the battery packs are custom sized to fit the space inside the laptop.\n\nBut aren't they all just shrinkwrapped packs made with standard cells of some kind?  I feel like it should be possible to rebuild the pack with new cells, though I don't know how complicated this is.  I'm guessing there's some management circuit inside the pack, so it probably involves soldering and of course wrapping it again is its own thing.\n\nI only buy new OEM batteries from Dell for our work laptops.  I've had experience with dodgy aftermarket batteries, but the OEM ones seem decent.",
              "score": 1,
              "created_utc": 1737892919.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98rdbn",
          "author": "MachinaThatGoesBing",
          "body": "No. Did you even read like the first paragraph of the article? The proposal is for standardized components like motherboards and input devices, as well, citing Framework as an example. These have basically always been non-interchangeable even within similar models from the same brand.\n\nAgain, citing Framework as an example, you'd be able to upgrade your whole laptop piecemeal, including new processor generations (including ones that might use a different socket), while reusing the same chassis, screen, keyboard, storage, etc. And if any of those are damaged, you can just get a standard replacement instead of having to find a replacement specific to that model. Or if the chassis/case gets damaged, you can replace just that and keep all the internals.\n\nThat's *very* different from how things were in the past. Even in the period you're talking about, replacing a screen or motherboard (hell, even some keyboards) could be a huge pain.\n\nAlso, easy replaceable and upgradable RAM, storage, and batteries are still very much a thing on most laptops and desktops not made by Apple.",
          "score": 7,
          "created_utc": 1737884794.0,
          "replies": [
            {
              "id": "m99s4gs",
              "author": "showyerbewbs",
              "body": "The one thing I hate is the entire ecosystem COULD be jellybean but then Lenovo wants 3 separate sub models with minor mods that make switching to even another model in a different line non-viable.  Extrapolate that out to all the manufacturers and you get a fucking nightmare for repairability.\n\n\nPut simply, we don't have the ease of repair simply because they don't want us to.",
              "score": 1,
              "created_utc": 1737902598.0,
              "replies": []
            },
            {
              "id": "m99c4du",
              "author": "daCampa",
              "body": "Is still a thing, yes.\n\n\nOn most laptops, no.\n\n\nStorage is usually upgradeable, batteries are technically replaceable but good luck finding them.\n\n\nRAM is usually soldered, at least part of it. When my sister in law was looking for a new laptop this is something we looked hard into, since upgrading from 8GB to 16GB RAM costs 150-200€ and for less than that we just dropped 32 on it.",
              "score": 1,
              "created_utc": 1737896435.0,
              "replies": [
                {
                  "id": "m9jemtc",
                  "author": "MachinaThatGoesBing",
                  "body": "> RAM is usually soldered, at least part of it.\n\nI've had dozens of different models of laptop pass through my hands in the past decade — from Lenovo, HP, and Dell. The only ones with non-upgradeable RAM were Chromebooks (and one lonely Microsoft Surface). The rest ***all*** had SO-DIMM slots or CAMM connectors on some newer models.\n\nEven all of the super-compact ultrabook-style form factor laptops that I've crossed paths with have upgradeable memory.\n\nThe only company I know of that consistently solders RAM and leaves no slots for upgrade is Apple.",
                  "score": 1,
                  "created_utc": 1738018663.0,
                  "replies": [
                    {
                      "id": "m9jy0k7",
                      "author": "daCampa",
                      "body": "_in the past decade_\n\nExactly. Go look through the last couple years and you'll see a lot more soldered stuff than \"in the past decade\". Even Thinkpads are starting to get it. Even when they do leave a slot for upgrading, it's limiting to have the remaining would-be slot taken by 8GB soldered.",
                      "score": 1,
                      "created_utc": 1738024842.0,
                      "replies": [
                        {
                          "id": "m9jzvr4",
                          "author": "MachinaThatGoesBing",
                          "body": "\"In the past decade\" was inclusive of the last several years.\n\nI'd been the primary IT buyer for electronics equipment for an entire rural school system up through 2021.\n\nI'm currently the primary buyer for a small technology heavy business. And I regularly get asked for home recommendations by coworkers and family, so I continue to look at consumer-targeted devices, too.\n\nI've looked at tons of laptops, and I continue to look at a lot of different models. (Though I don't look at bargain bin models that people shouldn't be buying anyway, so this may be more common there.)\n\nThe vast majority of what I see on offer still has upgradable RAM.\n\n------------\n\nEDIT: just to make sure nothing has changed radically in the past few months, I had a quick look at Dell's listings on their site, and even the cheapest $250 Inspiron on their site has SO-DIMM slots. As does the cheapest 2-in-1 convertible Inspiron. Those are their lowest end consumer offerings, and even they have upgradeable RAM.\n\nTurning my eye to HP, they do seem to have a number of consumer models with soldered RAM (particularly 2-in-1s which is where I see this most). So it's a mixed bag there. But they still have plenty of consumer devices with upgradable RAM, and as soon as you step over to the ProBook and EliteBook business lines, it's all upgradable.",
                          "score": 1,
                          "created_utc": 1738025439.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9830jn",
          "author": "NRMusicProject",
          "body": "I loved my Dell Vostro 1700.  Huge screen, NUMpad, the works.  Also, loved the actual tactile mouse buttons as opposed to what modern touch pads have these days.  My current laptop only gets the right click if I'm in the very bottom right corner of the \"button\" area, and it still left clicks half the time.\n\nIf I could have found a way to replace the mobo/hard drive and kept that shell, I would have.  I still have the laptop and occasionally consider trying to find a modder make it work, but I don't think it'd be worth the cost of finding someone who'll be able to figure it out--and God knows I don't have those chops.",
          "score": 2,
          "created_utc": 1737870744.0,
          "replies": []
        },
        {
          "id": "m99dlva",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1737897093.0,
          "replies": [
            {
              "id": "m9a98eo",
              "author": "newsflashjackass",
              "body": "r/18650masterrace",
              "score": 2,
              "created_utc": 1737907888.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9asq8y",
          "author": "ChristmasStrip",
          "body": "/r/oldschoolcool",
          "score": 2,
          "created_utc": 1737913498.0,
          "replies": []
        },
        {
          "id": "m98c0r1",
          "author": "None",
          "body": "Apple will still solder evrything together",
          "score": 1,
          "created_utc": 1737875542.0,
          "replies": [
            {
              "id": "m98u6ms",
              "author": "Qweesdy",
              "body": "That's the plan: Buy Intel and mix'n'match parts from many manufacturers to suit yourself whenever you like, or buy Apple and it'll be the last choice you're allowed to make.",
              "score": 2,
              "created_utc": 1737886505.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m991gur",
          "author": "farmdve",
          "body": "Dont forget Haswell laptops had upgradeable CPUs.",
          "score": 1,
          "created_utc": 1737890886.0,
          "replies": []
        },
        {
          "id": "m9a9iyc",
          "author": "xproofx",
          "body": "Thank you.  I love how they take features away and then put them back in like it's some sort of revelation.",
          "score": 1,
          "created_utc": 1737907976.0,
          "replies": []
        },
        {
          "id": "m9b7kz0",
          "author": "julictus",
          "body": "the cycle repeats",
          "score": 1,
          "created_utc": 1737917623.0,
          "replies": []
        },
        {
          "id": "m97pdwj",
          "author": "MSGdreamer",
          "body": "Should’ve been modular from the beginning. Quality over quantity. People over profit",
          "score": -1,
          "created_utc": 1737864716.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96tdqr",
      "author": "RoastedToast007",
      "body": "This is good",
      "score": 99,
      "created_utc": 1737853245.0,
      "replies": [
        {
          "id": "m96wcxb",
          "author": "chum_slice",
          "body": "Yeah but part of me is cautious… this sinking ship is suddenly interested in modular standards… feels like they want to make it easier to sell more chips… 🤔",
          "score": 81,
          "created_utc": 1737854248.0,
          "replies": [
            {
              "id": "m971gxl",
              "author": "Arthur-Wintersight",
              "body": "In other words, they knew this was something customers wanted the whole time, but \"more e-waste\" also means \"more sales\" - so they didn't bother until they were on the back foot.",
              "score": 68,
              "created_utc": 1737856018.0,
              "replies": [
                {
                  "id": "m98zy5w",
                  "author": "Ruben_NL",
                  "body": "Not sure about that. Swappable CPU means more people who swap their CPU.",
                  "score": 7,
                  "created_utc": 1737889992.0,
                  "replies": []
                },
                {
                  "id": "m976smr",
                  "author": "chum_slice",
                  "body": "Yup you got it",
                  "score": 10,
                  "created_utc": 1737857865.0,
                  "replies": []
                },
                {
                  "id": "m99x5za",
                  "author": "aCynicalMind",
                  "body": "Welcome to capitalism?",
                  "score": 2,
                  "created_utc": 1737904270.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m97xxq6",
              "author": "corduroy",
              "body": "I think it's them trying to stave off ARM chips in laptops as those are System-on-a-Chip (SOC).",
              "score": 8,
              "created_utc": 1737868347.0,
              "replies": []
            },
            {
              "id": "m97fn4r",
              "author": "Monkey-Tamer",
              "body": "I would have bought more chips through the years if I didn't have to do motherboard with it. If only some other company had offered me an upgrade path like that. Would've been great to have more than four cores, too.",
              "score": 5,
              "created_utc": 1737861006.0,
              "replies": [
                {
                  "id": "m9b2d3s",
                  "author": "Jon_TWR",
                  "body": "Years ago, there was a company (Evergreen or something?) that sold CPU upgrades that let you upgrade beyond what your socket supported. It had like a built in socket for the new CPU, would typically be slightly reduced performance due to the older motherboard (with all that entails like slower RAM, etc), but it cost a lot less than a whole new computer, and did give significantly better performance.",
                  "score": 2,
                  "created_utc": 1737916179.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9854r4",
              "author": "LeonMust",
              "body": "> feels like they want to make it easier to sell more chips\n\nIs that a bad thing?",
              "score": 4,
              "created_utc": 1737871807.0,
              "replies": []
            },
            {
              "id": "m9778nw",
              "author": "NightFuryToni",
              "body": "Especially from a company that historically threw money to manufacturers to not use competitor chips.",
              "score": 7,
              "created_utc": 1737858022.0,
              "replies": []
            },
            {
              "id": "m96z2nd",
              "author": "RoastedToast007",
              "body": "Selling more chips would anyways be a natural consequence of this I guess. Unless I'm misunderstanding you. Either way I think this good for repairability as a whole",
              "score": 5,
              "created_utc": 1737855189.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m99fpxa",
          "author": "IamGimli_",
          "body": "Not only is it good, I'd like to see it come to full-size desktops as well to allow us to manage PCIe lane assignment ourselves. \n\nI hate having to let MB manufacturer decide what *they* think is more important to have dedicated lanes for, what speed *they* think my network interface should run at, etc.",
          "score": 1,
          "created_utc": 1737897971.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96sxog",
      "author": "strand_of_hair",
      "body": "Insert the 15 standards 16 standards  meme",
      "score": 225,
      "created_utc": 1737853097.0,
      "replies": [
        {
          "id": "m974uta",
          "author": "Starfox-sf",
          "body": "https://xkcd.com/927/",
          "score": 80,
          "created_utc": 1737857181.0,
          "replies": []
        },
        {
          "id": "m96x1uu",
          "author": "Affectionate-Memory4",
          "body": "There really is an xkcd for everything",
          "score": 31,
          "created_utc": 1737854485.0,
          "replies": [
            {
              "id": "m985nfe",
              "author": "BipedalWurm",
              "body": "Is there one for someone who doubts that? Asking for a friend.",
              "score": 8,
              "created_utc": 1737872077.0,
              "replies": [
                {
                  "id": "m98y7p8",
                  "author": "DannySpud2",
                  "body": "https://xkcd.com/244/",
                  "score": 14,
                  "created_utc": 1737888948.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m979ar0",
          "author": "SufficientBowler2722",
          "body": "Except that there’s not a standard for this already? So this would be useful and not redundant?",
          "score": 17,
          "created_utc": 1737858743.0,
          "replies": []
        },
        {
          "id": "m97lfld",
          "author": "pokebud",
          "body": "LPCAMM2 confusion incoming",
          "score": 3,
          "created_utc": 1737863174.0,
          "replies": []
        },
        {
          "id": "m98hy5v",
          "author": "LUSBHAX",
          "body": "I mean, USBC is getting there, apple seems to be the only idiot still trying to fight it",
          "score": 1,
          "created_utc": 1737879041.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96t5r3",
      "author": "None",
      "body": "[deleted]",
      "score": 157,
      "created_utc": 1737853171.0,
      "replies": [
        {
          "id": "m96ypxr",
          "author": "Paid_troll",
          "body": "I have a Framework 16 for work and I love it.",
          "score": 65,
          "created_utc": 1737855065.0,
          "replies": [
            {
              "id": "m96ysto",
              "author": "zerGoot",
              "body": "wish they didn't cost so much, otherwise they'd be an instabuy for me",
              "score": 37,
              "created_utc": 1737855093.0,
              "replies": [
                {
                  "id": "m97nakz",
                  "author": "deliveRinTinTin",
                  "body": "Could be cheaper if they didn't actually build it and then take it apart again. \n\nOr am I thinking of the other modular company?",
                  "score": 23,
                  "created_utc": 1737863891.0,
                  "replies": [
                    {
                      "id": "m984eeh",
                      "author": "Hendlton",
                      "body": "That's Framework. If you choose to assemble it yourself, they'll assemble it to check that it works then disassemble it again and ship it. I don't know who came up with that ridiculous idea.",
                      "score": 33,
                      "created_utc": 1737871437.0,
                      "replies": [
                        {
                          "id": "m98fae6",
                          "author": "Namasu",
                          "body": "How is that ridiculous? That's just QA testing to make sure the components are functional. This is especially applicable for people who buy the DIY barebone kit without RAM and storage. You'd save more money and have more options picking out those parts from other retailers than from Framework's SKU.",
                          "score": 34,
                          "created_utc": 1737877465.0,
                          "replies": []
                        },
                        {
                          "id": "m98cnl4",
                          "author": "Iggy_Snows",
                          "body": "Do they fully assemble it 100%? Or is it more like \"we just plugged everything in together but didn't actually put it in the shell and screw everything together.\" \n\nBecause the later seems like a reasonable thing to do tbh, and would probably take them very little time to do.",
                          "score": 13,
                          "created_utc": 1737875910.0,
                          "replies": [
                            {
                              "id": "m9b8piz",
                              "author": "alloDex",
                              "body": "They disassemble everything needed to make it DIY. \n\nhttps://youtu.be/7nXVJBGowmY\n\nSee starting 10:35. \n\n\nBasically you pay your own prices for RAM and SSD.",
                              "score": 1,
                              "created_utc": 1737917938.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m97s4xz",
                      "author": "mdneilson",
                      "body": "No, you're right. I'm not sure if it would be cheaper, since they'd be replacing the bad parts on the backend still.",
                      "score": 4,
                      "created_utc": 1737865855.0,
                      "replies": []
                    },
                    {
                      "id": "m98j1i3",
                      "author": "zerGoot",
                      "body": "you are thinking of the right company :)",
                      "score": 1,
                      "created_utc": 1737879702.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m98s1ld",
                  "author": "unematti",
                  "body": "The others are cheaper because they're not modular. It's harder to engineer it modular and strong.",
                  "score": 1,
                  "created_utc": 1737885202.0,
                  "replies": [
                    {
                      "id": "m99awun",
                      "author": "zerGoot",
                      "body": "Oh I'm well aware, but a similarly specced regular laptop costs about 1/3 the price here where I live, which is obscene pricing from Framework",
                      "score": 3,
                      "created_utc": 1737895878.0,
                      "replies": [
                        {
                          "id": "m9a00f6",
                          "author": "unematti",
                          "body": "If it was the spec, I wouldn't have bought a laptop at all tho. An android tablet (midrange Samsung) with geforce now is a great gaming machine. The other device I considered is a tower pc, but nah right now. In fact i told my friend if they just made a bigger framework I would buy it. Next week they opened the preorders...\n\nYeah, if it is about the specs, go with other machines. If you can afford to pay the price and the specs are enough, buy the framework. That's what the whole community says, buy the one that's for you.",
                          "score": 1,
                          "created_utc": 1737905155.0,
                          "replies": [
                            {
                              "id": "m9a0gxl",
                              "author": "zerGoot",
                              "body": "I know, I know, and I'd be fine paying a premium, but in the current climate I could buy a tablet and two laptops, and still have a little bit of money left from the cheapest framework 16's price :(",
                              "score": 2,
                              "created_utc": 1737905296.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m98rur3",
              "author": "unematti",
              "body": "Same here, it's a great machine so far. Can't wait for the upgrades!",
              "score": 3,
              "created_utc": 1737885089.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m97x3st",
          "author": "VengefulAncient",
          "body": "What \"heat\"? Intel supplies them with CPUs lol. They're not a competitor, they're a partner.",
          "score": 23,
          "created_utc": 1737867976.0,
          "replies": [
            {
              "id": "m98ddu6",
              "author": "evaned",
              "body": "While somewhat true, I'll point out that the AMD version of the Framework 13 seems to get much more recommendations than the Intel version, and the Framework 16 is *only* available with AMD.",
              "score": 17,
              "created_utc": 1737876338.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m980hw2",
          "author": "imaginary_num6er",
          "body": "More like feeling the heat from their shareholders and needing to get attention away from AMD",
          "score": 6,
          "created_utc": 1737869532.0,
          "replies": []
        },
        {
          "id": "m98dw44",
          "author": "MargielaFella",
          "body": "wish framework had a 14\" offering. 13\" is too small imo, and 15\" is a tad too big.\n\npurely subjective, but 14\" is the perfect size for a laptop.",
          "score": 3,
          "created_utc": 1737876637.0,
          "replies": [
            {
              "id": "m99ji1r",
              "author": "Insert_Coin_P1",
              "body": "I'd be down for a 17\" option.",
              "score": 1,
              "created_utc": 1737899463.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m98an9q",
          "author": "ryo4ever",
          "body": "They would never say such things if they weren’t in trouble.",
          "score": 2,
          "created_utc": 1737874758.0,
          "replies": []
        },
        {
          "id": "m98smot",
          "author": "juh4z",
          "body": "Who? lol\n\nWhen will tech people understand that these big companies don't give a single fuck about these small companies that can't manufacture even 1% of what they make? They don't affect their sales at all",
          "score": 2,
          "created_utc": 1737885559.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96wx6v",
      "author": "burdfloor",
      "body": "I replaced a battery in a Dell laptop. The procedure was snap in and out.\nThe HP battery was a mess . I needed to carefully open the laptop and move wires.\nNo machine should be designed not to be repaired.",
      "score": 47,
      "created_utc": 1737854441.0,
      "replies": [
        {
          "id": "m986u4g",
          "author": "Hendlton",
          "body": "If anything, I wish we could go back to not using glue and fragile plastic clips for literally everything. What's wrong with having visible screws on the bottom side of things? It's not like anyone looks there anyway.",
          "score": 20,
          "created_utc": 1737872689.0,
          "replies": [
            {
              "id": "m98gpu2",
              "author": "MWink64",
              "body": "To be fair, over time the plastic would get brittle and the standoffs would frequently break. As much as I love screws over clips (and especially glue), they definitely have their downsides.",
              "score": 5,
              "created_utc": 1737878311.0,
              "replies": []
            },
            {
              "id": "m99v75l",
              "author": "joselrl",
              "body": "Haven't you heard of the new trend? Visible screws and fragile plastic clips combined!!! (Looking at you Lenovo)",
              "score": 3,
              "created_utc": 1737903635.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m980vwu",
          "author": "dernailer",
          "body": "In The second generation of hp elitebook from 2011 you could remove \nthe bottom cover with one finger...",
          "score": 13,
          "created_utc": 1737869717.0,
          "replies": []
        },
        {
          "id": "m9902t7",
          "author": "fairlyoblivious",
          "body": "You just randomly got a Dell with a removable battery and an HP without.. Most Dells batteries are NOT removable without opening the laptop these days.",
          "score": 4,
          "created_utc": 1737890069.0,
          "replies": [
            {
              "id": "m997byo",
              "author": "OperationMobocracy",
              "body": "But next to RAM and the mass storage device (usually a single M.2 stick), the batteries on Dell Latitudes are almost as easy to replace.  There's about six screws and the power cable to the mainboard.  It's trivial.\n\nAnd opening the case is about maybe 8 screws (which are captured, so you can't lose them) and some strategic prying to get it open enough to pop off.\n\nThe shit that's hard is doing keyboards.  You have to gut the laptop, including some individual components and removing some small lead wires.  The wifi chip antenna leads are this impossible snap connector that's the worst to get connected, and they know it because there's a kludgy bracket you screw down that secures them.\n\nAlso, the ribbon connectors on the last one I did were like 3-4 different kinds with different unlock/releases and no indicators marked in the case/mainboard.  So its a bit of guesswork and luck unless you've done that one before.  Even the service manual is like \"release the ribbon cable\" generic.\n\nAs someone who only occasionally has to fix them:\n\n1) Make the top shell of the body removable for keyboards or touchpads.\n\n2) Use easier connectors with a common retention mechanism.\n\n3) For the dumb wifi antenna connector, use screws to hold the terminals to the board.  Please.\n\nModular laptops is a great idea, and I'm all for it, but as someone with little personal interest in a modular upgradeable laptop outside of RAM/mass storage/battery, I look at the ones I manage as mostly single-use/disposable.  They get issued to a couple of users in their life and within about 5 years, sometimes less, they're just worn out -- hinges, keyboard, battery, screen-related issues.  I only even do batteries rarely.  A total refurb at that point is just too much of my labor and about half the cost of new in parts.  A replacement at that point is a saner option.",
              "score": 3,
              "created_utc": 1737894119.0,
              "replies": [
                {
                  "id": "m9cd6yj",
                  "author": "zvii",
                  "body": "Yep, this guy knows his shit. I've been off the help desk for a couple years, but this all tracks. Did a lot of keyboards and you're right, gotta gut it. Replacing the screen isn't bad, but you might break the bezel. Hinges aren't too terrible either, but having to do the whole top panel you then have to fuck with the wifi connection. \n\nAnd those damn connectors are terrible. Had a bad one and the first replacement I went to pop in, I bent the connection point on the wifi module. It would never connect to the cable again. Thankfully we had extras because people destroyed laptops constantly. \n\nOn another 5580, I couldn't get Dell to replace the wifi module under warranty because every time they heard blue screen, they went right to software. Did some crash dump investigation and it was pointing to wifi. I put their image on it and it would still blue sceen, but they still wouldn't send me the Wi-Fi card. So I took another Wi-Fi card to test and tada, no blue screen. After escalation and arguing, they agreed to send it, but if I called back they wouldn't do anything else for the issue.",
                  "score": 2,
                  "created_utc": 1737929109.0,
                  "replies": [
                    {
                      "id": "m9d18rm",
                      "author": "fairlyoblivious",
                      "body": "On the other hand, I have done screen replacements. What you say about possibly breaking something in the bezel? Definitely possible on a Dell, almost a certainty on an HP, DEFINITELY a certainty on an Apple. A Lenovo though? I've replaced a dozen of those screens across at least 8 models, never a single problem.",
                      "score": 1,
                      "created_utc": 1737936066.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9d0smw",
                  "author": "fairlyoblivious",
                  "body": "I have a Dell XPS from a couple years back in a drawer in front of me. I'm typing this on an HP Omen I was given a while back. Previously I have, when I am making the purchase decision, relied exclusively on Lenovo.  I also worked in IT at an MSP fixing systems for over a dozen corporations at once, many of them on vastly different systems, some Dell, some Lenovo, Apple, HP, you name it.  \n  \nI would say I've worked on over 1000 laptops, and I would also say that this is almost certainly a VAST underestimation.  \n  \nToday I would go with a Lenovo over a Dell or any other brand in a second. I've never received a new Lenovo that didn't boot up, I cannot say the same about Dell laptops, not even CLOSE. The main reason that Dell XPS stopped being used was I finally got my hands on another machine so I could stop using the XPS that almost destroyed itself because the shitty quality battery in their fucking TOP OF THE LINE XPS AT THE TIME turned into a pillow literally EXACTLY the moment the warranty ran out. See this wouldn't be an issue on a Lenovo, because you just log into their website and extend your warranty, and send them the part to be replaced. But not Dell. Nope Dell would ONLY offer me a \"reconditioned\" replacement battery for $180.  \n  \nWas the Dell easy to open to find out the reason the trackpad was breaking because something was literally pushing it out of the frame? Sure. Why do I prefer Lenovo or in fact many companies other than Dell? Because most of the time I don't have to open them at all.  \n  \nOh and yes, the Lenovo is easier to repair/open/take apart/whatever you want to do than ANY DELL.  \n  \nYou know, as someone who has had to fix A LOT OF THEM for over a decade.",
                  "score": 1,
                  "created_utc": 1737935927.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m986ugs",
          "author": "Hendlton",
          "body": "If anything, I wish we could go back to not using glue and fragile plastic clips for literally everything. What's wrong with having visible screws on the bottom side of things? It's not like anyone looks there anyway.",
          "score": 1,
          "created_utc": 1737872689.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m970nkl",
      "author": "Student-type",
      "body": "An example of “Seizing the Narrative”.",
      "score": 15,
      "created_utc": 1737855736.0,
      "replies": [
        {
          "id": "m977jsh",
          "author": "twigboy",
          "body": "Thankfully search results will link to currently existing solution; framework laptops",
          "score": 9,
          "created_utc": 1737858130.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96zhzq",
      "author": "RottenPingu1",
      "body": "Will it be patent free modularity? Or... just another way to force consumers into a set environment?\n\nI have no trust in Intel.",
      "score": 37,
      "created_utc": 1737855337.0,
      "replies": [
        {
          "id": "m97tkjc",
          "author": "xCeeTee-",
          "body": "[From their blog:](https://community.intel.com/t5/Blogs/Tech-Innovation/Client/Modular-PC-Design-A-Sustainable-Approach-for-Enhanced/post/1657681)\n\n\nModularity can be approached at three levels depending on manufacturers' product positioning, market dynamics, costs, and other factors.\n\n\n1. Factory Modularity is a level of modularity that can only be exercised at the factory. For example, whilst ordering a car the manufacturer provides different choices of engines. Depending on what the user decides, the factory fits the car with the requested engine. This level of modularity can only be exercised at factory setups hence the name. This level of modularity provides for flexibility and high levels of design reuse and hence lower costs, manufacturing carbon footprint and scalability benefits.\n\n\n2. Field Modularity is the next level of modularity that provides for field-level changes but does not require a factory setup, yet might still require skilled labor and a specialized tools to make the necessary upgrades or changes. For example, quite a few cars provide different tire sizes as options. When a customer decides on a specific set of tires, sizes, and wheelsets, the dealer - not the factory - gets involved. The cars are still manufactured with the standard set of wheels but based on customer requests the end dealer swaps the factory-fitted wheels with custom ones. These changes still require a field specialty setup but can be done effectively outside of the factory setup.\n\n\n3. User Modularity is the last level of modularity that allows the end user to change the settings or components within a product at will at the convenience of their home or office.  Good examples are WiFi dongles, user upgradable memory and storage, etc. These provide the ultimate level of modularity to the end user, do not require the intervention of the dealer or the manufacturer, and can be done using standard tools by the user anytime during the effective lifetime of the product.\n\n\nETA: so in essence it's not going to be Intel that can file patents but the laptop manufacturers. HP can create their own design and patent that. Whilst Lenovo could easily create a very similar design, the modular components will most likely be the same form factor. Or at least one of a few different form factors like with desktop motherboards. Some manufacturers might try to make their own form factor like Apple always do. So you're forced to purchase their parts.",
          "score": 12,
          "created_utc": 1737866454.0,
          "replies": [
            {
              "id": "m97zpc8",
              "author": "More-Butterscotch252",
              "body": "That doesn't answer the question at all. Will they patent this?",
              "score": -4,
              "created_utc": 1737869158.0,
              "replies": [
                {
                  "id": "m98389k",
                  "author": "xCeeTee-",
                  "body": "It's a proposal for other manufacturers to adopt when creating their own laptops. They propose the three models in which patents could be integrated to. If companies adopted this idea then they would be able to file their own patent for their machine. But it wouldn't block other companies from using the same modularity model in their own laptops.\n\n It's similar to when Chromebooks first started. They just got classified as laptops rather than being in it's own category. So whilst Lenovo can patent their design for a 2-in-1 360 Chromebook, HP can do the same as long as the design is clearly unique. So the people designing the aesthetics of the laptop will be the people creating the unique factors that would be patentable.",
                  "score": 6,
                  "created_utc": 1737870849.0,
                  "replies": [
                    {
                      "id": "m9892c0",
                      "author": "More-Butterscotch252",
                      "body": "So from what you're saying, it's going to be patented.\n\nThough I don't think you know what you're talking about.\n\n...",
                      "score": -5,
                      "created_utc": 1737873884.0,
                      "replies": [
                        {
                          "id": "m98dcub",
                          "author": "xCeeTee-",
                          "body": "Yes, but not by Intel. And it won't prohibit companies from creating their own modular laptops. If you think I don't know what I'm talking about feel free to point out where and how I'm wrong. I've only studied copyright and patent laws at university for one unit so I could definitely be wrong about certain parts of that.\n\nIntel aren't in the business of making laptops so the worry for them to patent a modular laptop restricting other companies to compete is unnecessary.",
                          "score": 6,
                          "created_utc": 1737876323.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m973hez",
          "author": "lart2150",
          "body": "How are they supposed to make bank on it if it's patent free?",
          "score": 10,
          "created_utc": 1737856707.0,
          "replies": [
            {
              "id": "m9adffy",
              "author": "Useful44723",
              "body": "If it is easier to upgrade your old laptop maybe people will upgrade more often.\n\nEither I get a new laptop for 1,000 or a new Intel for 300.",
              "score": 1,
              "created_utc": 1737909116.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m96x5s5",
      "author": "VenturingHedonist",
      "body": "Has just as much of chance of happening as if I propose a threesome with my girlfriend and her younger sister.",
      "score": 26,
      "created_utc": 1737854523.0,
      "replies": [
        {
          "id": "m96xi72",
          "author": "Houtaku",
          "body": "In fairness, if you were the CEO of Intel your chances would be better.",
          "score": 21,
          "created_utc": 1737854642.0,
          "replies": [
            {
              "id": "m97ofkl",
              "author": "Neo_Techni",
              "body": "Of the threesome too",
              "score": 9,
              "created_utc": 1737864334.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m96ywb7",
      "author": "internetlad",
      "body": "Now go back to 2003 when this conversation should have been taking place and do it then because I'd be shocked if it happened now.",
      "score": 7,
      "created_utc": 1737855127.0,
      "replies": []
    },
    {
      "id": "m96z23n",
      "author": "Phanatic4",
      "body": "I was doing this back I the 90's/00's, when machines could be opened.\n\n\"The Ciiiircle of Life.....\"",
      "score": 7,
      "created_utc": 1737855184.0,
      "replies": []
    },
    {
      "id": "m97cs5l",
      "author": "shaunrundmc",
      "body": "Wow so the thing that people had done for machinery and equipment for the entirety of human history",
      "score": 6,
      "created_utc": 1737859977.0,
      "replies": []
    },
    {
      "id": "m97p3dm",
      "author": "None",
      "body": "Modular laptops are already available. People just don’t buy them. The average person just buys a laptop, and sells and exchanges it when it starts having problems or becomes too slow for newer software.",
      "score": 4,
      "created_utc": 1737864599.0,
      "replies": [
        {
          "id": "m97vmd7",
          "author": "robokymk2",
          "body": "It’s not even available worldwide readily. Most people here prefer to buy it straight from the retail shops because importing is a massive headache and the taxes are going to compound the cost.",
          "score": 6,
          "created_utc": 1737867331.0,
          "replies": []
        },
        {
          "id": "m982cdd",
          "author": "macman156",
          "body": "are there other players besides framework?",
          "score": 1,
          "created_utc": 1737870413.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m96ye1l",
      "author": "SsooooOriginal",
      "body": "Lololol, I have seen this talked about so much but now is a truly ironic time. \n\n\nThe perfect laptop form was realized with the toughbooks, they are already modular and minimize e-waste. \n\n\nDon't believe me? Doubt on the toughbook? The latest model has user replaceable and upgradeable modules called xPAKs, RAM, keyboard, battery, caged SSD, reinforced locking port covers, webcam with privacy cover. All in a package slightly bigger than a decent sized textbook. It is not wafer thin though so the battery should last a days hard use. And you can run it over because the name is literal.\n\n\nThese assholes have had the disgruntled people telling them smaller, sleaker, and non-repairable are bad for x y and z reasons and they are only now caring because costs have finally started to affect some of them personally.",
      "score": 13,
      "created_utc": 1737854949.0,
      "replies": []
    },
    {
      "id": "m97c4oh",
      "author": "rofopp",
      "body": "That’s a radical fucking proposal forty years into a product cycle.",
      "score": 3,
      "created_utc": 1737859747.0,
      "replies": []
    },
    {
      "id": "m98z1c1",
      "author": "DonutConfident7733",
      "body": "There was an attempt to do similar for mobile phones in 2017 with Motorola Moto Z family, which had mods to add to the phone.\nIt won't work very well.\nI can give some reasons: poor reliability when components are not all soldered on a mainboard. Connectors can corrode, components can slightly move due to shock or vibration and stop working which would require nontechnical people to pay for service.\nComponents made by third parties and not validated by manufacturer give all kinda of compatibility issues.\nSee the memory for desktops as example. Your pc may not boot, cpu maker will push firmware for cpu, mainboard maker needs to include it into a bios, you need to have it applied to make that memory work.\nDropping the device (e.g. on a bed) may make some component stop working or have glitches.\nE.g. in a tablet, the display ribbon may move and stop working until fixed.\nProblems caused by specs, see intel Devsleep issue on some early ssds causing intensive nand wear (GBs per minute). Having the laptop maker certify its own ssd storage rules out these issues.\nThe laptop maker gets the blame if a component is not working well, such as slow ssd makes the laptop freeze or feel slow.\nUnable to make thinner designs if the connectors can't be removed. They moved away from VGA ports, USB A connectors and used USB-C for a slimmer design. They now use USB C also for charging.\nTinkering with the laptop makes it prone to break things. Plastic clips or screws in plastic can be fastened just a few times before they break or crack the plastic.",
      "score": 3,
      "created_utc": 1737889443.0,
      "replies": []
    },
    {
      "id": "m9a3rgt",
      "author": "frontrow13",
      "body": "We'll see how this goes, fusing everything to the motherboard as we've seen in past was a disaster, they thought if it lasted past warranty people would have to buy new but many didn't last that long so full replacement of motherboard with Ram, SSD, CPU and even WLAN all built in cost them a fortune.",
      "score": 3,
      "created_utc": 1737906279.0,
      "replies": []
    },
    {
      "id": "m97mrgo",
      "author": "ChemicalHungry5899",
      "body": "What's crazy about laptops, modern ones included is how custom each and every component is. Finally someone is getting around to coming up with some kind of basic standard. This will boost laptops thefts but help the consumer fix their own stuff.",
      "score": 2,
      "created_utc": 1737863684.0,
      "replies": []
    },
    {
      "id": "m97p8td",
      "author": "MSGdreamer",
      "body": "Great idea",
      "score": 2,
      "created_utc": 1737864659.0,
      "replies": []
    },
    {
      "id": "m981wn2",
      "author": "RMRdesign",
      "body": "I like the fact Apple made the MacBook pros chunky this time around was a great design decision. I don’t need a super thin laptop for work.",
      "score": 2,
      "created_utc": 1737870200.0,
      "replies": []
    },
    {
      "id": "m98btlr",
      "author": "santathe1",
      "body": "My MSi laptop from 2024 has a replaceable GPU, CPU, 4 memory slots, 2 HDD/SSD bays, wireless card, Battery and one disc drive that I’ve also converted to a HDD bay. Downside, it weighs like 5KG lol.\n\nEdit: I meant 2014 not 2024 lol. They don’t make ‘em like they used to was going to be my point.",
      "score": 2,
      "created_utc": 1737875428.0,
      "replies": [
        {
          "id": "m98j6ks",
          "author": "pandaSmore",
          "body": "Which model?",
          "score": 1,
          "created_utc": 1737879788.0,
          "replies": [
            {
              "id": "m98jmpo",
              "author": "santathe1",
              "body": "GT60 2OC, please check the edit to my original comment.",
              "score": 1,
              "created_utc": 1737880060.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m98cjog",
      "author": "alphonse03",
      "body": "I mean, a lot of brands already use the same layout for the PCB on several motherboards. They just make them not compatible between them via positioning the CPU slightly off, so the old heatsink doesnt match (granted this is fixed by getting the correct one), or using different connectors for some daughterboards.\n\n\nIf they are going the framework way (replacing the whole motherboard if you want to change the CPU) they have it pretty easy tbh.\n\n\nI dont see them going back to socketed CPUs, but it would be nice for a change. It was good to have the option to upgrade at the start of the core i era, even if it was a pain in the ass to teardown a laptop with so many layers back then.",
      "score": 2,
      "created_utc": 1737875847.0,
      "replies": []
    },
    {
      "id": "m98vi59",
      "author": "heppyheppykat",
      "body": "I have a gaming asus laptop and have been swapping out parts for years. The result is a laptop which is 6 years old and runs very well.\nSome parts i swapped on my own, others I have trusted cheap repair guys do it.\nSo long as I don’t mess up the motherboard I don’t plan to do anything else.\nI would love a modular laptop like the ones from Framework, but I still don’t think I would buy an intel. I just don’t trust them",
      "score": 2,
      "created_utc": 1737887311.0,
      "replies": []
    },
    {
      "id": "m99230i",
      "author": "alidan",
      "body": "I think we should go the way of 100% modularity, I think a top loaded cpu in the design of lga mixed with a contact frame like mount, either to the laptop behind it or to the back of the board, would allow for swappable thin mount, granted I don't think this is necessary as long as the cpu is soldered to a motherboard that would make swapping out common parts of the motherboard that went bad viable, like power delivery, memory, video, or storage. \n\nmemory went to soldered because of the traces in laptop memory not allowing faster memory speeds, when the cpu is also the gpu, the faster memory does make a massive impact on preformance, dell has a standard to replace the current one that shaves down speed issues to be near if not equal, but it hasnt beed adopted as as im aware. \n\nI think the biggest thing laptops need to do is become something else at end of life. \n\nmake a case for the motherboard, make an enclosure for the monitor, let it be used outside of portable laptop at eol and it will be prefect for many people as a desktop, people who need a laptop will still get a laptop, people who want a desktop... let me be honest, im on a 1700 cpu, i'm only STARTING to feel the need to upgrade, my cpu is about the per core equivalent of a 14 year old intel cpu, the fact this power is only not enough in games screams any laptop could easily be a desktop and used if it wasn't for the hardware and form factor its forced to be used in.",
      "score": 2,
      "created_utc": 1737891240.0,
      "replies": []
    },
    {
      "id": "m99ag7n",
      "author": "ToMorrowsEnd",
      "body": "This keeps being tried over and over.   about 5 years ago HP and Lenovo set up a standard for  upgrade modularity for their micro PC's that are basically laptops.  there are two ports that can be changed to nearly anything as it's a tiny pci port.   they both abandoned it a couple of years later.    We used to have a video card standard for laptops.   dead because nobody made any cards and only a couple of laptop makers adopted it for a short time.",
      "score": 2,
      "created_utc": 1737895661.0,
      "replies": []
    },
    {
      "id": "m99hen6",
      "author": "TheDevilsAdvokaat",
      "body": "Interesting. I hope they go somewhere with this.\n\nI must be up to close to a dozen laptops in sequence by now. RIght now we have 4 in the house...mine, my son's, my daughter's, and an old one...\n\nAnd like hermit crabs when I get a new one the old ones get passed down..",
      "score": 2,
      "created_utc": 1737898643.0,
      "replies": []
    },
    {
      "id": "m99q957",
      "author": "None",
      "body": "PCs are already modular. What Intel wants to make is some newfangled proprietary connector so you can't mix and match your PC parts.",
      "score": 2,
      "created_utc": 1737901947.0,
      "replies": []
    },
    {
      "id": "m9bff0e",
      "author": "dleewee",
      "body": "Hardware repairability is great and all, but the majority of e-waste I see generated these days is from manufacturers deciding they don't feel like providing firmware / security updates anymore. \n\nWhere are the big companies raising this issue, or better yet advocating for open source firmware?",
      "score": 2,
      "created_utc": 1737919818.0,
      "replies": []
    },
    {
      "id": "m97rm1r",
      "author": "Hattix",
      "body": "Ah yes, Intel offering solutions to problems caused by Intel.\n\nNobody wanted Ultrabooks. Nobody wanted BGA-only CPUs. That was your doing, Intel. You wanted to sell more chipsets.",
      "score": 2,
      "created_utc": 1737865634.0,
      "replies": [
        {
          "id": "m97wwxo",
          "author": "VengefulAncient",
          "body": "> Nobody wanted Ultrabooks\n\nMany people did, and are very happy that they exist. But soldered CPUs are not required for that.",
          "score": 3,
          "created_utc": 1737867893.0,
          "replies": [
            {
              "id": "m998mdc",
              "author": "OperationMobocracy",
              "body": "Weight and size are about the only thing my users will gripe about, they definitely prefer laptops which are easier to haul around.  I buy pretty basic Dell Latitude 54xx, which aren't total nightmares for simple stuff like RAM, batteries or SSDs.  But I maybe crack open 10% of them for any of that.\n\nMy overall experience is that laptop physical wear is a big driver of replacement, very seldom is it \"I need to open bigger spreadsheets, can I get a new CPU\".  People with performance-intensive jobs get laptops that will do performance-intensive things up front.  Even tired batteries don't seem to be a big deal, they're accustomed to plugging in.  I'm surprised they don't gripe about this more, but those that do I'll swap the battery.  And if they make it to 5 years, so much is just worn from hard use that no upgrade would make sense.\n\nI love the modularity idea, but I don't think the juice vs. squeeze will get much traction outside of the hobbyist/tinkerer crowd.",
              "score": 5,
              "created_utc": 1737894768.0,
              "replies": []
            },
            {
              "id": "m99dypk",
              "author": "taimusrs",
              "body": "In this proposal, CPUs are still soldered. More like Framework laptops that you change the whole motherboard, but you can 3D-print a case for it to use as a PC. Intel who changes its CPU socket every two years like clockwork ain't gonna catch up to that just yet",
              "score": 2,
              "created_utc": 1737897244.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m985798",
      "author": "MarkJFletcher",
      "body": "Isnt that what the intel nuc extremes set out to do? And ended up getting sold to ASUS?",
      "score": 1,
      "created_utc": 1737871844.0,
      "replies": []
    },
    {
      "id": "m98eu0l",
      "author": "Good_Evening_4145",
      "body": "What about Framework laptops?",
      "score": 1,
      "created_utc": 1737877194.0,
      "replies": []
    },
    {
      "id": "m98n9zv",
      "author": "FinalBlood155",
      "body": "Build your own laptop 😂",
      "score": 1,
      "created_utc": 1737882295.0,
      "replies": []
    },
    {
      "id": "m98ojdh",
      "author": "Charlieninehundred",
      "body": "Apple has left the chat.",
      "score": 1,
      "created_utc": 1737883062.0,
      "replies": []
    },
    {
      "id": "m98qqse",
      "author": "SteveThePurpleCat",
      "body": "Replaceable batteries and battery charging point would give most laptops 50% more life.",
      "score": 1,
      "created_utc": 1737884411.0,
      "replies": []
    },
    {
      "id": "m9ad081",
      "author": "None",
      "body": "Thanks Intel, you should have done this when you were at the top of the world, maybe when you were pushing the move to Ultrabooks.",
      "score": 1,
      "created_utc": 1737908995.0,
      "replies": []
    },
    {
      "id": "m9aj0hf",
      "author": "rushmc1",
      "body": "Way overdue.",
      "score": 1,
      "created_utc": 1737910719.0,
      "replies": []
    },
    {
      "id": "m9aobzt",
      "author": "celticchrys",
      "body": "Step 1: stop soldering the RAM to the motherboards.",
      "score": 1,
      "created_utc": 1737912246.0,
      "replies": []
    },
    {
      "id": "m9ausi7",
      "author": "IT-run-amok",
      "body": "I'd love to build my own laptop with universally accepted standards across brands like desktops have. I just know that it will be like the 90's where you were required to adopt an ecosystem which very likely wouldn't exist after a few years!",
      "score": 1,
      "created_utc": 1737914073.0,
      "replies": []
    },
    {
      "id": "m9b0ofv",
      "author": "Aschentei",
      "body": "Isn’t that the whole reason Linux invests in Framework? \n\nLong overdue",
      "score": 1,
      "created_utc": 1737915715.0,
      "replies": []
    },
    {
      "id": "m9b7mwl",
      "author": "OddSilver123",
      "body": "I have a feeling this is trying to expand a new market in computing where consumers can purchase parts instead of a full laptop due to the tariffs on imports from china including the resources necessary to manufacture computing hardware.\n\nI would a similar market expansion in other economies.\n\nThis is far from a good thing.",
      "score": 1,
      "created_utc": 1737917638.0,
      "replies": []
    },
    {
      "id": "m9b8iwp",
      "author": "Alienhaslanded",
      "body": "Yes please. Relying only one one company to do that isn't good enough. We do need a big company like Intel to support this. \n\n\nNext we should have repairable phones.",
      "score": 1,
      "created_utc": 1737917887.0,
      "replies": []
    },
    {
      "id": "m9bqpyb",
      "author": "ChiefStrongbones",
      "body": "Apple has already demonstrated that non-modular laptops and PCs [are far more profitable](https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-chip-with-10-core-cpu-and-10-core-gpu-16gb-memory-256gb).  $800 for a 2TB SSD upgrade doesn't happen with a modular PC.",
      "score": 1,
      "created_utc": 1737923008.0,
      "replies": []
    },
    {
      "id": "m9brvpp",
      "author": "BaffledInUSA",
      "body": "Repairable and upgradable laptops? laptop makers will push back on this like crazy, they love desposable stuff",
      "score": 1,
      "created_utc": 1737923324.0,
      "replies": []
    },
    {
      "id": "m9cd6ne",
      "author": "Riptide360",
      "body": "Intel is on their way out. Long live the king.",
      "score": 1,
      "created_utc": 1737929106.0,
      "replies": []
    },
    {
      "id": "m9cgn31",
      "author": "kurisu7885",
      "body": "Sounds like other companies are going to try to crush Intel.",
      "score": 1,
      "created_utc": 1737930086.0,
      "replies": []
    },
    {
      "id": "m9cqdwr",
      "author": "chris14020",
      "body": "Yeah, imagine if laptops used like, sockets for things. RAM, SSDs, even GPUs and CPUs! It'd be crazy! ",
      "score": 1,
      "created_utc": 1737932832.0,
      "replies": []
    },
    {
      "id": "m9e6k9y",
      "author": "Rrraou",
      "body": "The way to actually get this to happen is to buy enough framework laptops. Everybody else can present specs and have pious wishes. Framework actually made it and I can order one right now.\n\nThere were articles suggesting modular laptops decades ago. Companies never believed in it enough to make it.",
      "score": 1,
      "created_utc": 1737948660.0,
      "replies": []
    },
    {
      "id": "m9f4opx",
      "author": "Unable_Insurance_391",
      "body": "I do not trust Intel.",
      "score": 1,
      "created_utc": 1737964866.0,
      "replies": []
    },
    {
      "id": "m96vrcm",
      "author": "tomekza",
      "body": "_yawns_ Intel?",
      "score": 1,
      "created_utc": 1737854042.0,
      "replies": []
    },
    {
      "id": "m987fmo",
      "author": "SirBraxton",
      "body": "\"We need it to be easier and cheaper for us to replace our terrible product when we mess up and then cover it up.\"  \n~ Intel",
      "score": 1,
      "created_utc": 1737872992.0,
      "replies": []
    },
    {
      "id": "m989tm7",
      "author": "VeganCaramel",
      "body": "Can we get some arrests or lawsuits for the multi-corporation conspiracy to prevent users from removing/replacing their phone battery?",
      "score": 0,
      "created_utc": 1737874303.0,
      "replies": []
    },
    {
      "id": "m98phqc",
      "author": "alexp_nl",
      "body": "Intel laptops are a piece of shit. Also intel does not give any crap about this world and pollution by ewaste.",
      "score": 0,
      "created_utc": 1737883644.0,
      "replies": []
    },
    {
      "id": "m98qstt",
      "author": "runn5r",
      "body": "Intel could start by not changing motherboard socket with every cpu release",
      "score": 0,
      "created_utc": 1737884445.0,
      "replies": []
    },
    {
      "id": "m97q1y6",
      "author": "TheModeratorWrangler",
      "body": "Intel is about two sticks and a carrot late. It’s embarrassing how far they’ve fallen. Just sell the x86_64 architecture to AMD already.",
      "score": -2,
      "created_utc": 1737864987.0,
      "replies": [
        {
          "id": "m99lued",
          "author": "Insert_Coin_P1",
          "body": "The x86_64 architecture is also known as AMD64.  Intel uses that over their own ia64 architecture. So, AMD already owns it.",
          "score": 1,
          "created_utc": 1737900348.0,
          "replies": []
        }
      ]
    }
  ]
}