{
  "post": {
    "title": "Budget gaming PCs get massive lifeline as Intel Arc B580 reviews show up Nvidia | Intel's new B580 Battlemage GPU has been much better received this time around, with performance actually outpacing Nvidia and AMD.",
    "author": "a_Ninja_b0y",
    "id": "1hcq9cj",
    "score": 1531,
    "created_utc": 1734024401.0,
    "selftext": "",
    "num_comments": 179,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hcq9cj/budget_gaming_pcs_get_massive_lifeline_as_intel/"
  },
  "comments": [
    {
      "id": "m1q6l5f",
      "author": "OrganicKeynesianBean",
      "body": "I hope these are priced well because we desperately need more competition in this space.",
      "score": 392,
      "created_utc": 1734026688.0,
      "replies": [
        {
          "id": "m1q6voe",
          "author": "habitual_viking",
          "body": "$249 MSRP.\n\nThey are listed locally for around 280 here in Denmark, which is expected because of taxes etc.\n\nSo yeah, game changer.",
          "score": 276,
          "created_utc": 1734026780.0,
          "replies": [
            {
              "id": "m1uqnjh",
              "author": "TheyCallMeMrMaybe",
              "body": "Intel is performing a very wise strategy, here. Nvidia and AMD have completely abandoned the mid-tier & budget segments for PC gaming by pricing their cards way-out of those segments. The B580 should be a market disruptor.",
              "score": 65,
              "created_utc": 1734095523.0,
              "replies": [
                {
                  "id": "m1whv40",
                  "author": "Vmanaa",
                  "body": "We still have yet to see, amd said they are going to stop focusing on the highend for the 8000 series. Depending on what they release they still might bring a gpu that is similarly priced yet more powerful since intel is being compared to last gen.",
                  "score": 12,
                  "created_utc": 1734116811.0,
                  "replies": [
                    {
                      "id": "m1wted0",
                      "author": "Struykert",
                      "body": "I thought of that and then figured nvidia will be the winner because they will own the high end market without competition. So only **90 and **80 series from them leaving the rest for Intel and AMD to kill each other over and when they have done that and are both bleeding in their respective corners nvidia release a midrange card that blows them both to bits.\nI hope I'm wrong but this is what I think will happen.",
                      "score": 0,
                      "created_utc": 1734120496.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1xqiwx",
              "author": "Agomir",
              "body": "Hah, the only two listed in France right now are Asrock and they start at 359€... I'm hoping we see some cheaper ones.",
              "score": 2,
              "created_utc": 1734131738.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1udzye",
          "author": "oshinbruce",
          "body": "Its great to see, they just need to be on top of the driver game. Alot of my friends buy Nvidia because it works and every big ticket game is followed shortly by a driver update from Nvidia. Driver issues aren't common but it does happen, and for me AMD comes with a vague anxiety that when one of 1-2 new games I actually want to play come along, that I won't be able to play them",
          "score": 19,
          "created_utc": 1734089203.0,
          "replies": [
            {
              "id": "m1viktc",
              "author": "Baxtab13",
              "body": "Yeah, the driver thing is a driving force on me wanting to go back to team green. It's not like the drivers are a problem \\*all\\* the time, but that like 5-10% of the time it's super frustrating.\n\nI remember when there was like a good 5-6 month period when Destiny 2 of all games just had shit performance on AMD cards until a driver update from AMD finally fixed it. I had just upgraded from GTX 1080 to an RX 6900XT, and to find that I was achieving like 20FPS less in that game with the upgrade was beyond frustrating.",
              "score": 5,
              "created_utc": 1734105606.0,
              "replies": [
                {
                  "id": "m1ws5ee",
                  "author": "oshinbruce",
                  "body": "The older the get, the more the moments you want to game matter. Getting slow performance or crashes until amd patch 3 weeks later is annoying",
                  "score": 2,
                  "created_utc": 1734120089.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1utnu3",
              "author": "CutsAPromo",
              "body": "I remember my old AMD card would give me purple rain whenever I tried to play gta 4",
              "score": 3,
              "created_utc": 1734096764.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1t57y9",
          "author": "Charlemagne-XVI",
          "body": "They need to do better than competition with a 4060",
          "score": -77,
          "created_utc": 1734062989.0,
          "replies": [
            {
              "id": "m1t6c6p",
              "author": "Amidatelion",
              "body": "No they don't.  \n\nThey need to be good enough and on shelves long enough.  \n\nThat's it.",
              "score": 60,
              "created_utc": 1734063440.0,
              "replies": []
            },
            {
              "id": "m1tamo8",
              "author": "QuickQuirk",
              "body": "No. They need to be competitive to the mainstream budget midrange option, and they need to be a lot cheaper...\n\n*which they are.*\n\nThis is excellent news.",
              "score": 27,
              "created_utc": 1734065279.0,
              "replies": []
            },
            {
              "id": "m1tbdpx",
              "author": "FlarblesGarbles",
              "body": "You're out of touch. Most people aren't buying high end GPUs.",
              "score": 46,
              "created_utc": 1734065623.0,
              "replies": [
                {
                  "id": "m1ypmsv",
                  "author": "Cda4go",
                  "body": "This is a big one people on Reddit don’t understand. I’m very green to pc’s and built what I considered a “budget” set up with a 3080ti only to find out that majority of the people I know who have been gamers all their lives are on either a 20 series or 3060.",
                  "score": 1,
                  "created_utc": 1734145712.0,
                  "replies": [
                    {
                      "id": "m1ypsfr",
                      "author": "FlarblesGarbles",
                      "body": "Yep, the low and mid range cards are what make nVidia and AMD the actual profit.",
                      "score": 1,
                      "created_utc": 1734145780.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1ty9s8",
                  "author": "Yequestingadventurer",
                  "body": "Who's out of touch now, not everyone has 1k in the UK to spend on what is effectively a toy for gamers. Unless people are doing other graphically intensive tasks it's an absolute luxury and in this country people really don't have a lot of money for that. Might just be your bubble but the need for lower cost performance is why Intel are getting into this space, people want it and are fed up with being shafted for incremental updates. I'm still on my old faithful 6600xt which I bought for 200gbp. Praise!",
                  "score": -28,
                  "created_utc": 1734078664.0,
                  "replies": [
                    {
                      "id": "m1u4kp7",
                      "author": "FlarblesGarbles",
                      "body": "That's my exact point...",
                      "score": 20,
                      "created_utc": 1734083033.0,
                      "replies": [
                        {
                          "id": "m1u551h",
                          "author": "Yequestingadventurer",
                          "body": "Oh balls I didn't read you're comment correctly, my bad!",
                          "score": 15,
                          "created_utc": 1734083417.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1to8j0",
                  "author": "TldrDev",
                  "body": "Mmmmm. Most people here probably are. Least we not forget where we are.",
                  "score": -35,
                  "created_utc": 1734072310.0,
                  "replies": [
                    {
                      "id": "m1ty1z6",
                      "author": "playnasc",
                      "body": "Steam Hardware Survey disagrees with you\n\nhttps://store.steampowered.com/hwsurvey/videocard/",
                      "score": 7,
                      "created_utc": 1734078520.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1th8ki",
              "author": "Erikthered00",
              "body": "It beats the 4060 while is significantly cheaper",
              "score": 14,
              "created_utc": 1734068441.0,
              "replies": [
                {
                  "id": "m1tk7ha",
                  "author": "Charlemagne-XVI",
                  "body": "Well wouldn’t it be cool if it beat the 4080 while significantly cheaper.",
                  "score": -42,
                  "created_utc": 1734070017.0,
                  "replies": [
                    {
                      "id": "m1tmeqk",
                      "author": "Trosque97",
                      "body": "Yes it'd also be cool if Marilyn Monroe came back from the dead to give me the night of a lifetime, but I'll settle for a threesome with my coworkers thank you very much",
                      "score": 24,
                      "created_utc": 1734071254.0,
                      "replies": [
                        {
                          "id": "m1tmonn",
                          "author": "Charlemagne-XVI",
                          "body": "Why is it so hard for intel to make a gpu comparable to all the 40 series gpu’s but for less ? They made a 4060 for less. Not to hard to fathom some improvement over time",
                          "score": -34,
                          "created_utc": 1734071412.0,
                          "replies": [
                            {
                              "id": "m1tn92l",
                              "author": "Trosque97",
                              "body": "Uhuh, and how many people are buying anything above mid to low end? How viable would it be to try and invest so much money in a market that already has such tight competition? I, for one, am actually happy that they're taking their sweet time easing their way into it and catering to the largest market to guarantee sales for future projects. Mid to low end is the best way to go if you're easing your way in. Do you need a 4090? And if you need one, how common is your need amongst the market?\n\nBecause I'm right there with you, dude, I'd love for more challenges to Nvidia being the high-end top dog. But you can't jump into a race like that without solid footing first, give em time",
                              "score": 12,
                              "created_utc": 1734071740.0,
                              "replies": [
                                {
                                  "id": "m1ucvjq",
                                  "author": "FelixTheEngine",
                                  "body": "CHEAPER they said.",
                                  "score": -1,
                                  "created_utc": 1734088524.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m1u9hxa",
                              "author": "19osemi",
                              "body": "Because they aren’t competing on that, they are competing on budget mid range. They aren’t targeting the best but the okay",
                              "score": 3,
                              "created_utc": 1734086378.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1txe79",
                      "author": "Spider-Thwip",
                      "body": "Do you have...problems?",
                      "score": 4,
                      "created_utc": 1734078070.0,
                      "replies": []
                    },
                    {
                      "id": "m1tlfg9",
                      "author": "Erikthered00",
                      "body": "That’s a slightly delusional take",
                      "score": 6,
                      "created_utc": 1734070703.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1t6jvd",
              "author": "Primae_Noctis",
              "body": "This is like their what, fifth overall card? Catching up to a 40 series of any flavor is a huge deal.\n\nnVidia has been iterating since the god damn RIVA.",
              "score": 16,
              "created_utc": 1734063528.0,
              "replies": []
            },
            {
              "id": "m1t96ua",
              "author": "putiepi",
              "body": "Why?",
              "score": 6,
              "created_utc": 1734064640.0,
              "replies": []
            },
            {
              "id": "m1tkedy",
              "author": "mrureaper",
              "body": "For sub 300$ bro that's stellar performance from those cards in the 1080p category",
              "score": 2,
              "created_utc": 1734070123.0,
              "replies": []
            },
            {
              "id": "m1u91am",
              "author": "19osemi",
              "body": "No they don’t and that’s the main problem with pc gaming now. Not everything needs to be the best most powerful components ever, they need to be new available and at a okay price. There is a lot and I mean like 90% of every gaming pc built are just ok not powerhouses",
              "score": 2,
              "created_utc": 1734086071.0,
              "replies": []
            },
            {
              "id": "m1tr8xy",
              "author": "Eurynom0s",
              "body": "Quick Googling says a 4060 is ballpark to the GPU in a PS5. That's not maxing out the settings on the latest CDPR game performance but it'll be plenty for most people.",
              "score": 1,
              "created_utc": 1734074106.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1r754p",
      "author": "wicktus",
      "body": "Good, even an AMD/Nvidia longtime customer can be happy with this. We desperately need more serious rivals here.\n\nThey already designed *Celestial* (whilst manufacturing R&D is starting) and are working on the 4th gen, now it will take time to really sit in that market and get an actual market share in consumer GPUs\n\nI really hope Intel won't do the insane thing and destroy that momentum in the name of the short term...GPUs are the future, for AI, for so many things, they need to work on this and continue to make progress like that",
      "score": 136,
      "created_utc": 1734037984.0,
      "replies": [
        {
          "id": "m1te7j2",
          "author": "None",
          "body": "[deleted]",
          "score": -4,
          "created_utc": 1734066944.0,
          "replies": [
            {
              "id": "m1tl8cl",
              "author": "Whispernight",
              "body": "Because most people don't have or get the latest and greatest. According to Steam statistics, the 4060 is the most popular 40 Series card, and it's only 5th most popular over all. It is behind the 3060, 1650, 3060 Ti, and 3070, with the 3060 being the most popular. And the next two behind the 4060 are the 2060 and 1060.\n\nSo if these Intel cards are comparable to the 40 Series while also being cheaper, they're going to be viable upgrades for a huge number of people.",
              "score": 39,
              "created_utc": 1734070589.0,
              "replies": [
                {
                  "id": "m1to9vw",
                  "author": "LiftedWanderer",
                  "body": "That’s super interesting.",
                  "score": 0,
                  "created_utc": 1734072332.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1u0rbf",
              "author": "Tech_Itch",
              "body": "The 50-series cards coming early next year are the flagship and high-end cards. The lower tier cards always get released significantly later. RTX 4060 is going to be the lower midrange offering from Nvidia for a good while still.",
              "score": 2,
              "created_utc": 1734080351.0,
              "replies": [
                {
                  "id": "m1ubheh",
                  "author": "roguebananah",
                  "body": "Makes sense and appreciate the actual response. I personally just feel like it’s kinda not fully accurate reviewing (maybe full thought process? Idk. I can’t think of a good way to phrase it) because okay….\n\nLet’s say the 5000 series has 25% better performance and keeps the same pricing tiers. \n\nIdk if we can all be as tempted by intel GPUs where we can say yeah. Nvidia is $150 more, but you’ll get the next DLSS version plus 25% better performance. \n\nI just kinda feel like it’s a shorter term analysis.",
                  "score": 1,
                  "created_utc": 1734087659.0,
                  "replies": [
                    {
                      "id": "m1ukqau",
                      "author": "Tech_Itch",
                      "body": "They aren't reviewing rumors or random people's expectations. Reviews compare things against the existing market, because that's the only thing you can reliably do. \n\nBesides, the way the market works, at some point you have to make a purchasing decision or you'll be stuck perpetually waiting for the next generation. \n\n>Let’s say the 5000 series has 25% better performance and keeps the same pricing tiers.\n\n>Idk if we can all be as tempted by intel GPUs where we can say yeah. Nvidia is $150 more, but you’ll get the next DLSS version plus 25% better performance. \n\nThis is a budget card. In that segment $150 is a lot of money. And unlike AMD's offering, XeSS reportedly is a pretty good match for DLSS. Also, like I already pointed out, it's going to be a while before any potential RTX 5060 is coming out, so that possible future card doesn't help anyone who needs a PC now.",
                      "score": 6,
                      "created_utc": 1734092833.0,
                      "replies": []
                    },
                    {
                      "id": "m1v3fq4",
                      "author": "Borghal",
                      "body": "A this level, $150 more is a different price tier already. 250 vs 400 is a massive difference, that's 60% more. And if you ask me, that would be a bad deal for anything less than 50% more performance (I know, I know, GPU pricing doesn't work like that).",
                      "score": 3,
                      "created_utc": 1734100503.0,
                      "replies": [
                        {
                          "id": "m1v4iho",
                          "author": "TheDMPD",
                          "body": "Ahit, for $400 you're talking 4060 Ti and Battlemage throws pretty good blows against the 4060 Ti in the reviews I have seen in 2k&4k. So even right now it's a great value contender for that and it forces NVIDIA and AMD to not bork the memory config of their next lower offerings (if these sell)",
                          "score": 1,
                          "created_utc": 1734100890.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1qfe6q",
      "author": "ADD-DDS",
      "body": "Nana smiling down",
      "score": 118,
      "created_utc": 1734029388.0,
      "replies": [
        {
          "id": "m1rqh7h",
          "author": "No_Spin_Zone360",
          "body": "Too meta",
          "score": 23,
          "created_utc": 1734044262.0,
          "replies": []
        },
        {
          "id": "m1rr59p",
          "author": "AlexHimself",
          "body": "😂😂😂 I didn't think WSB bled over here.",
          "score": 17,
          "created_utc": 1734044495.0,
          "replies": [
            {
              "id": "m1ryxxf",
              "author": "ADD-DDS",
              "body": "They bleed financially everywhere",
              "score": 27,
              "created_utc": 1734047306.0,
              "replies": []
            },
            {
              "id": "m1vf0gl",
              "author": "AmNoSuperSand52",
              "body": "They’re both subreddits with several million followers",
              "score": 1,
              "created_utc": 1734104455.0,
              "replies": []
            },
            {
              "id": "m1u1o0i",
              "author": "COC_410",
              "body": "Of course it did or else the 4 of us wouldn’t be talking about it.",
              "score": 0,
              "created_utc": 1734080983.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1zl1o7",
          "author": "vixgdx",
          "body": "What's the reference?",
          "score": 1,
          "created_utc": 1734162635.0,
          "replies": [
            {
              "id": "m203xyn",
              "author": "ADD-DDS",
              "body": "Wall Street bets redditor yoloed all his inheritance from grandma on intc a few days before it tanked",
              "score": 3,
              "created_utc": 1734175859.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1q7dnz",
      "author": "Xero_id",
      "body": "Hope this is real and continues to really improve. I really don't trust Intel with price though once they start getting great reviews.",
      "score": 33,
      "created_utc": 1734026934.0,
      "replies": [
        {
          "id": "m1wf1c4",
          "author": "jackharvest",
          "body": "Intel has been humbled the hell out. Their everything is crumbling. If they become a major GPU distributor in the next year, I’d be totally ok with that.",
          "score": 5,
          "created_utc": 1734115915.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1q9vpa",
      "author": "Wander715",
      "body": "Meanwhile I'm just hoping the 5080 will be less than $1200... Wish we could get better competition at the high end but this is a good stepping stone for Intel at least.",
      "score": 70,
      "created_utc": 1734027701.0,
      "replies": [
        {
          "id": "m1qovc6",
          "author": "Usernametaken1121",
          "body": "There won't be competition. The amount of people willing to drop 3 months of groceries on a GPU is ridiculously small.",
          "score": 87,
          "created_utc": 1734032307.0,
          "replies": [
            {
              "id": "m1skxc0",
              "author": "IceMaverick13",
              "body": "Yeah but competition would mean they'd be coming down to like 2 months of groceries and that pool is a little bit bigger, which breeds wider competition, which lowers prices, and soon it's only 1 months of groceries.\n\nI can starve for a month for magic thinking rock.",
              "score": 12,
              "created_utc": 1734055318.0,
              "replies": [
                {
                  "id": "m1smffk",
                  "author": "Usernametaken1121",
                  "body": ">Yeah but competition would mean they'd be coming down\n\nDo you have an example of that? Because there's 8 different competitors to Lamborghini and their cars are still one of the most expensive you can buy. Top of the market dictates the market. People will pay 1.5k to have the best GPU so that's where the market is.",
                  "score": 9,
                  "created_utc": 1734055876.0,
                  "replies": [
                    {
                      "id": "m1u6qy4",
                      "author": "notjfd",
                      "body": "Lambos are conspicuous consumption, which GPUs are not. Anytime AMD builds a high-end GPU that provides better bang-for-buck than high-end nvidias, they steal loads of market share. \n\nThe problem is, AMD always seems to blow their advantage the next generation. And that's honestly because nvidia controls the datacenter GPU market. Nvidia makes most of its dosh here which pays for the massive R&D budgets that allow them to maintain their comfortable lead there. Whenever a startup like AMD or Intel gets close to competing in the high-end gaming market (which is dangerous for their datacenter business because it's close to the low-end datacenter segment), they price and spec their next generation specifically to kneecap the competition's offering, tank their market share, blow up their revenue stream, and choke their R&D.\n\nUnless Intel is willing to intensively develop their GPUs for multiple years at big losses Nvidia will always be capable of putting out a counter-offer, even at _higher_  prices, that make Intel's offering unattractive.",
                      "score": 2,
                      "created_utc": 1734084519.0,
                      "replies": [
                        {
                          "id": "m1ufv13",
                          "author": "Usernametaken1121",
                          "body": ">Lambos are conspicuous consumption, which GPUs are not.\n\nI agree GPUs aren't conspicuous but Nvidia high end GPUs are conspicuous consumption. Just as vehicles aren't conspicuous, but a Lambo vehicle is.",
                          "score": 3,
                          "created_utc": 1734090288.0,
                          "replies": [
                            {
                              "id": "m1ui3tm",
                              "author": "notjfd",
                              "body": "I bought an expensive GPU for what it could do, not for what other people would think of me.\n\nAdmittedly, there are people who buy the most expensive thing to flex their wealth, but that does not automatically class that entire product in that way. Most of the time people are simply willing to accept significantly worse bang-for-buck if that means more bang.",
                              "score": 2,
                              "created_utc": 1734091504.0,
                              "replies": [
                                {
                                  "id": "m1z1igr",
                                  "author": "kb_hors",
                                  "body": "You are not the only Nvidia customer alive, and all that stupid RGB shit isn't for people who want to be subtle.",
                                  "score": 1,
                                  "created_utc": 1734151188.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1sr2kv",
              "author": "bites_stringcheese",
              "body": "Competition with scalpers. :(",
              "score": 3,
              "created_utc": 1734057593.0,
              "replies": [
                {
                  "id": "m1ug85x",
                  "author": "Usernametaken1121",
                  "body": "True lol",
                  "score": 1,
                  "created_utc": 1734090494.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1t01j3",
              "author": "protekt0r",
              "body": "It’s small, but the margins in that segment are insane.",
              "score": 2,
              "created_utc": 1734060977.0,
              "replies": []
            },
            {
              "id": "m1t4mf1",
              "author": "perfect_io",
              "body": "3 months of groceries? Damn its like $400 for a trip to costco which lasts for like 2 weeks now.",
              "score": 5,
              "created_utc": 1734062758.0,
              "replies": [
                {
                  "id": "m1uca2o",
                  "author": "Jiopaba",
                  "body": "I think for perspective you have to say how many you're feeding with that. My household of 3 probably spends about $300 a month on groceries between Publix and Sam's Club.\n\n$800 a month sounds crazy to me, like eating caviar with dinner or something.",
                  "score": 1,
                  "created_utc": 1734088160.0,
                  "replies": [
                    {
                      "id": "m1wornp",
                      "author": "None",
                      "body": "What the fuck? $300 a month? That really doesn't sound right. Maybe it's just where I live, but I don't know how you can possibly get away with that.",
                      "score": 1,
                      "created_utc": 1734118999.0,
                      "replies": [
                        {
                          "id": "m1wy2hl",
                          "author": "Jiopaba",
                          "body": "Lol, I feel the same the other way around.  Between Sam's Club and Publix I usually spend about $200 per trip, and I only go every three weeks or so.  The biggest expenses are meat (because it's expensive) and milk (because I buy lactose-free ultra-pasteurized milk that keeps forever).\n\nThere are occasions when I can spend $400 in a single trip like when power loss from the hurricane destroyed everything in my fridge and freezer recently, but those are at most once a year.\n\nI also spend money at the farmer's market buying fresh fruits and vegetables, but no matter how much the out-of-touch old people who shop there complain $30 here and there really isn't much.\n\nMy imagination runs wild.  I'm torn between thinking maybe grocery stores are twice as expensive somewhere else or some people would be confused I don't have a $400 budget for saffron and gold-leaf chocolates.",
                          "score": 1,
                          "created_utc": 1734122036.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1ug6r1",
                  "author": "Usernametaken1121",
                  "body": "I looked up the national average. Not /u/perfect_io 's average. My bad, I'll check with you next time.",
                  "score": 1,
                  "created_utc": 1734090471.0,
                  "replies": []
                },
                {
                  "id": "m1t8uzh",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1734064499.0,
                  "replies": [
                    {
                      "id": "m1thmwx",
                      "author": "perfect_io",
                      "body": "I'm good, I'll sit happy with my 1080p monitors, RTX 3070 Laptop and PS5 for games. At best I'll upgrade to 1440p and chill with my mid tier set up and not spend a monthly rent payment for a gpu.",
                      "score": 3,
                      "created_utc": 1734068649.0,
                      "replies": []
                    },
                    {
                      "id": "m1ujjyg",
                      "author": "notyouravgredditor",
                      "body": "That's because they have been discontinued.  There's no more 4090 supply, and no 5090 yet.",
                      "score": 1,
                      "created_utc": 1734092251.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1ssibi",
          "author": "SheepWolves",
          "body": "doubt it, probably launch at $1500.",
          "score": 3,
          "created_utc": 1734058130.0,
          "replies": [
            {
              "id": "m1u0nfz",
              "author": "domoincarn8",
              "body": "Now divide that by 6 and thats what Intel launched this at.",
              "score": 1,
              "created_utc": 1734080277.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1rf26r",
          "author": "None",
          "body": "Considering 4080s price has skyrocketed in the last two weeks to 1600$+, 5080 wont be under that",
          "score": 7,
          "created_utc": 1734040455.0,
          "replies": [
            {
              "id": "m1rhfr7",
              "author": "ESCMalfunction",
              "body": "That’s just because they’re discontinued, I’d be surprised if 5080 MSRP came any higher than 1499. Realistically I think they’ll stay put at 1199.",
              "score": 10,
              "created_utc": 1734041218.0,
              "replies": [
                {
                  "id": "m1tkbcb",
                  "author": "narium",
                  "body": "The incoming administration's love of the T-word does not help matters.",
                  "score": 3,
                  "created_utc": 1734070077.0,
                  "replies": []
                },
                {
                  "id": "m1rkzgy",
                  "author": "Wander715",
                  "body": "Yeah I think it will probably be $1200 which is still a bad price. At that point I might just wait for a 5080Ti probably in 2026 and see what pricing and specs on that are.\n\nIf Nvidia wanted to surprise people with a \"good\" price they'd match the 4080S at $1000 but I really doubt that happens.",
                  "score": -1,
                  "created_utc": 1734042402.0,
                  "replies": [
                    {
                      "id": "m1tke5m",
                      "author": "narium",
                      "body": "I think it will be at least 1500, especially with tariffs coming in January.",
                      "score": 0,
                      "created_utc": 1734070119.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1qwh2o",
          "author": "yungfishstick",
          "body": "Nvidia essentially has a monopoly on the high end market and will absolutely charge more for their next generation of GPUs. AMD is/was too incompetent and pulled out of the high end market and Intel isn't in the high end market at all.",
          "score": 19,
          "created_utc": 1734034695.0,
          "replies": [
            {
              "id": "m1r0pzq",
              "author": "Comrade_Cosmo",
              "body": "Their CEOs are cousins. There was never a battle to begin with.",
              "score": 22,
              "created_utc": 1734036030.0,
              "replies": [
                {
                  "id": "m1rsqlb",
                  "author": "TehOwn",
                  "body": "Jesus, it's actually true.\n\n[https://www.tomshardware.com/news/jensen-huang-and-lisa-su-family-tree-shows-how-closely-they-are-related](https://www.tomshardware.com/news/jensen-huang-and-lisa-su-family-tree-shows-how-closely-they-are-related)\n\nIt doesn't necessarily mean collusion but it is interesting, for sure.\n\nI do believe that duopolies typically result in price fixing because neither side wants to rock the boat and upset the money tree.",
                  "score": 19,
                  "created_utc": 1734045064.0,
                  "replies": [
                    {
                      "id": "m1rw4l9",
                      "author": "_RADIANTSUN_",
                      "body": "If you know anything about Asian families, this probably only means the most competitive rivalry possible.\n\n\"Your cousin has the #1 GPU company! You are only poor ass #3 now!\"",
                      "score": 34,
                      "created_utc": 1734046282.0,
                      "replies": [
                        {
                          "id": "m1skfb8",
                          "author": "CanEnvironmental4252",
                          "body": "Yep https://youtu.be/3vbCXVQFsLg?si=20tPD8oQIRId08DG",
                          "score": 3,
                          "created_utc": 1734055132.0,
                          "replies": []
                        },
                        {
                          "id": "m1srcbs",
                          "author": "bites_stringcheese",
                          "body": "number 1 CPU company tho",
                          "score": 2,
                          "created_utc": 1734057694.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m1sr9zt",
                      "author": "bites_stringcheese",
                      "body": "Nah, they got the perfect balance now. I'm buying both their products for a new build. 9800x3D gets here tomorrow!",
                      "score": 1,
                      "created_utc": 1734057670.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1tk195",
                  "author": "narium",
                  "body": "Lmao more like \"Your cousin Jensen has #1 company! Why can't you be now like Jensen and be #1???\" You shame your parents!\"",
                  "score": 5,
                  "created_utc": 1734069922.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1rf9c5",
              "author": "None",
              "body": "Itd almost be fine if they owned the high end if games like . monster hunter werent EXPECTING you to have a fuckin high end pc just to run the fuckin thing",
              "score": 0,
              "created_utc": 1734040517.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1smt04",
          "author": "MegaDuckDodgers",
          "body": "Unlikely at least in the US. Nvidia has for the past decade been trying to raise prices with every new release. Before covid hit, the 20 series was already more expensive than the 10 series for basically minimal performance games. When the 30 and 40 series were released it wasn't much better. I paid 600 dollars for a 1080 7 years ago. The equivalent card tier (4080) has almost *doubled* in price in that short amount of time.\n\nTaking trump at his word, the incoming tariffs will also cause those prices to go up even more. There is also another crypto bubble on the horizon. Pretty much every tech insider and hobbyist is saying that this is probably your last chance to get any kind of deal before prices start going up, and that it's better to splurge on a 40 series now rather have to wait through another 2017-2022 bad market while hoping the prices eventually come down.",
          "score": 7,
          "created_utc": 1734056018.0,
          "replies": [
            {
              "id": "m1tad08",
              "author": "None",
              "body": "I'm curious how it bodes for GPU longevity in the future.\n\nThere was a Sony/Insomniac leak a while back that had mention of a 2029 or so? release date for another ratchet and clank game.\n\nIf they did well with it on the PC (here's hoping) being released, wonder if a RTX A5000 card would run it then or the tech changed alot again?",
              "score": 1,
              "created_utc": 1734065158.0,
              "replies": [
                {
                  "id": "m1tk1t5",
                  "author": "MegaDuckDodgers",
                  "body": "*Probably* it will be able to run the game. It has the vram and ray tracing support. Ampere might be on It's way out as far as the architecture is concerned by then but I wouldn't really worry that hard about it. The only major concern would be if Nvidia comes out with some new tech similar to ray tracing which I haven't heard anything about but even then, ray tracing has been rather slow to adopt.",
                  "score": 1,
                  "created_utc": 1734069931.0,
                  "replies": [
                    {
                      "id": "m1wv40s",
                      "author": "None",
                      "body": "Not too worried, if one is needed, then one is needed. Just more a \"what if\" since in many ways GPU's seem to have hit a plateau of sorts tech wise. This is my most powerful bleeding edge card to date, usually it's always been whatever is integrated on a motherboard or a cheap purchase (GT730 a while back).\n\nNow for AI it shows it's limitations if you want to get into larger datasets, but moving into other arenas like 3D work (blender) it's barely scratched the surface of that. More due to my limitations/knowledge at this rate",
                      "score": 1,
                      "created_utc": 1734121062.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1upmxc",
              "author": "GGATHELMIL",
              "body": "Bought a 1080ti a few months after launch for about 550. It's a bit of stretch on that price though. There was a sale, plus I got them to price match and there was a cash back reward through rakutan and newegg. Plus I didn't have to pay tax, I may have, who knows. Plus it came with a code for a game I was already going to buy. But still a top of the line gpu msrp was $700 and I'm proof back in the day you could essentially get 20% off that. \n\n$700 doesn't even get you a 4070ti super. I guess if you account for inflation it lines up 700 bucks back then is equivalent to 900 now. But it still feels shitty that spending the same equivalent money doesn't yield a same equivalent tier item. I'm aware a 4070ti super is going to be about twice as good as a 1080ti in most applications so it kinda evens out.\n\nI guess I'm just stuck on the fact that 700 bucks used to get you top of the line. Now the equivalent gets you 3rd/4th from the top depending on how you look at the super variants and the Chinese only models.",
              "score": 1,
              "created_utc": 1734095083.0,
              "replies": [
                {
                  "id": "m1vj38c",
                  "author": "MegaDuckDodgers",
                  "body": "Inflation itself isn't necessarily the issue. It is not normal for things to almost double in price within seven years (though 2017-2022 was a weird time). They were already doing this before the pandemic when the 2080 was an extra 100$ compared to the 1080, when it was only like 15% better and sometimes even less than that. They got a lot of shit for that but it apparently meant nothing because the graphics card market is a duopoly and Nvidia controls more and more of it every year. \n\n\nHonestly though It's just a weird time to be alive in general, even excluding PC prices. I definitely do think It's a crime though that you can't build an excellent gaming PC for 500 dollars anymore.",
                  "score": 1,
                  "created_utc": 1734105771.0,
                  "replies": [
                    {
                      "id": "m1w2nfv",
                      "author": "GGATHELMIL",
                      "body": "Oh, it definitely has a lot to do with companies wanting gpus. Why bother selling pc gamers cheap low profit gpus, when they can sell companies 1000+ gpus for a massive profit. So since they can sell a company a gpu for a massive profit, if you the lowly gamer wants a gpu well we still want our 4x profit. To bad so sad.\n\nI'm glad Intel is doing something. I never thought I'd have a computer that runs on a amd cpu and an Intel gpu. But I do.",
                      "score": 1,
                      "created_utc": 1734111993.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1tl3nr",
          "author": "narium",
          "body": "Highly unlikely with the incoming administration looking to start a trade war (again) in 2025.",
          "score": 2,
          "created_utc": 1734070516.0,
          "replies": []
        },
        {
          "id": "m1sm1ni",
          "author": "Fredasa",
          "body": "I can't even think about a 5080 because I would already easily hit that 16GB cap _today._  I guess it's fine for anyone who 1) never mods games and 2) doesn't see themselves still on a 5080 in two to three years.",
          "score": -4,
          "created_utc": 1734055736.0,
          "replies": [
            {
              "id": "m1srk5j",
              "author": "danreZ_au",
              "body": "Might be worth waiting for the 5080 Super, which is rumoured to have 24gb of vram (vram is cheap as fuck - NVIDIA are just price gouging)",
              "score": 7,
              "created_utc": 1734057775.0,
              "replies": [
                {
                  "id": "m1t5edw",
                  "author": "Fredasa",
                  "body": "Right.  Hobson's choice, literally.  Unless somebody figures out a cheap way to mod the 5080 for more vram.\n\nI've been playing _Cyberpunk 2077_ for four years, and because the game rubs against my 3080's 10GB ceiling, I have to actively avoid having to bring up the map.  Hell, it was only just a few months ago that somebody figured out a really helpful GPU setting to turn off for the game.  Doesn't prevent the game from entering 8fps mode, but it does almost guarantee that it'll find its way back to 60fps after half a minute or so.",
                  "score": 2,
                  "created_utc": 1734063060.0,
                  "replies": []
                },
                {
                  "id": "m1tqitq",
                  "author": "Metal-fan77",
                  "body": "I'd love to have 24gb of vram the new indiana Jones game the recommended spc for ultra and Above is a 40 series card with 16gb or 24gb. My 3080 only has 12gb of vram so i can only play it set to high plus full path ray tracing at 1440p",
                  "score": 1,
                  "created_utc": 1734073666.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1spr3j",
              "author": "None",
              "body": "Unmodded VR can easily gobble up that much vram, too. (As well as still be GPU bottlenecked with likely 5090 specs).\n\nUnfortunately it's a use case that will still keep a certain sector hard set on Nvidia.",
              "score": 2,
              "created_utc": 1734057107.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1r3pxs",
      "author": "None",
      "body": "I’ve held out on buying a new card when mine got ruined by a leaking roof and went back to my old RX580. I might just pick this up in the next couple weeks.",
      "score": 14,
      "created_utc": 1734036936.0,
      "replies": []
    },
    {
      "id": "m1sn1wg",
      "author": "Andovars_Ghost",
      "body": "The only problem I had with the first gen Arc card was the support for older games.  Modern games ran beautifully, but I play a lot of games from 15-20 years ago and graphics glitches were common.",
      "score": 6,
      "created_utc": 1734056111.0,
      "replies": []
    },
    {
      "id": "m1shrqu",
      "author": "Akrymir",
      "body": "The big question is if the drivers will work and if they bothered to even start on the mountain of back catalog of games they need to support.\n\nUnless you only care about playing new releases, I’d stay far away until 3rd parties have done a very comprehensive test of those games, which will take a LONG time.",
      "score": 23,
      "created_utc": 1734054161.0,
      "replies": [
        {
          "id": "m1svw5m",
          "author": "ManyInterests",
          "body": "The drivers, feature support, and QA from game makers. That will make/break this for Intel.",
          "score": 21,
          "created_utc": 1734059406.0,
          "replies": []
        },
        {
          "id": "m1thc56",
          "author": "Erikthered00",
          "body": "They’ve done a great job with Alchemist, so that seems to lead on to Battlemage quite well",
          "score": 8,
          "created_utc": 1734068492.0,
          "replies": []
        },
        {
          "id": "m1twr08",
          "author": "GolemancerVekk",
          "body": "Crappy drivers have never stopped AMD / ATI.",
          "score": 2,
          "created_utc": 1734077636.0,
          "replies": []
        },
        {
          "id": "m1x5f6r",
          "author": "mia_man",
          "body": "Counter point, they won't do that unless people buy these. You gotta take risk if you want to the market to improve.",
          "score": 1,
          "created_utc": 1734124449.0,
          "replies": []
        },
        {
          "id": "m1tqiu1",
          "author": "wombat1",
          "body": "How's Linux support with the Alchemist drivers, particularly knowing early drivers struggled with DX9/DX10 games? It's a key reason for me to stay with AMD over Nvidia, but it's finally looking like time to retire the old RX580.",
          "score": 0,
          "created_utc": 1734073667.0,
          "replies": [
            {
              "id": "m1twz7w",
              "author": "GolemancerVekk",
              "body": "Still hit and miss.\n\n\nBut hearing you praise AMD for their **drivers** tells me you'll be fine with Intel's. 😊",
              "score": -4,
              "created_utc": 1734077787.0,
              "replies": [
                {
                  "id": "m1txrsh",
                  "author": "shii_knew_nothing",
                  "body": "Are you seriously implying AMD has the worst drivers on Linux when Nvidia exists, and their drivers are so utterly shit that they cannot even run a basic window manager under Wayland?",
                  "score": 4,
                  "created_utc": 1734078325.0,
                  "replies": [
                    {
                      "id": "m1uc953",
                      "author": "GolemancerVekk",
                      "body": "That's not what I said, just said expect bugs. And I haven't even mentioned Nvidia.\n\nBut since you brought it up:\n\nNvidia is dragging their feet on Wayland until Wayland gets their ducks in a row. Which has been happening for 16 years now so I can see why they're in no hurry.\n\nAlso, let's have some perspective... Linux **gaming** as a market is worth a fraction of a percent to Nvidia. Linux **gamers** as a crowd are free testing. They value the latter not the former. So in a perverse way they're incentivized to throw their most buggy shit at the Linux desktop and see what sticks, because they know Linux users do good software testing.\n\nAMD/ATI have always had buggy drivers, on both Linux and Windows. It's just how they roll. They release buggy drivers and take very long to fix them. They eventually manage to get them to a good state by the time their next gen cards come out.\n\nIf you're on RX580 it's understandable why you think AMD is the bee's knees but if you'll pick up a recent card you'll be in for a surprise.\n\nI wish Intel didn't take after either of them but unfortunately it seems they've decided to go with AMD's \"release early, release buggy\" approach.\n\nEdit: If you want my recommendation, for Linux get a *previous gen* AMD card (something that's been out for at least 1 year). Intel cards may be cheap but still need some time in the oven.",
                      "score": 1,
                      "created_utc": 1734088144.0,
                      "replies": []
                    },
                    {
                      "id": "m1u0dci",
                      "author": "aksdb",
                      "body": "RDNA3 has some ugly ring0 timeout issues that range from \"game hangs\", to \"game crashes\", to \"wayland crashes\", to \"the whole PC hangs\". I never had such issues over such a long time with Nvidia. Typically their drivers work quite well. I switched to AMD for better wayland support and ended up having to reboot to Windows for some games if I don't want to have crashes all over the place :-/\n\nEdit: what the fuck is with the downvotes? Do you think I am making this shit up? Just look at the damn [bug tracker](https://gitlab.freedesktop.org/drm/amd/-/issues/?sort=created_date&state=opened&search=timeout&first_page_size=20).",
                      "score": -2,
                      "created_utc": 1734080082.0,
                      "replies": [
                        {
                          "id": "m1u1mwo",
                          "author": "shii_knew_nothing",
                          "body": "I'm still on RDNA2 on my desktop so I cannot vouch for other GPUs, but so far it's been fairly smooth sailing for me with performance usually better than Windows even when running games through Proton. I've only ran into issues when overclocking, though that is obviously always a risk.\n\nHave you tried switching between the open-source and the proprietary drivers?",
                          "score": 1,
                          "created_utc": 1734080963.0,
                          "replies": [
                            {
                              "id": "m1u8cv3",
                              "author": "aksdb",
                              "body": "The \"drivers\" are \"only\" different userspace implementations. The timeouts stem from a firmware or kernel module issue. All in all it ran worse with amdvlk compared to radeon, so I stick with the opensource userspace.",
                              "score": 1,
                              "created_utc": 1734085614.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1sanq9",
      "author": "AppropriateTouching",
      "body": "More competition please!",
      "score": 6,
      "created_utc": 1734051554.0,
      "replies": []
    },
    {
      "id": "m1x9nld",
      "author": "None",
      "body": "Nvidia is, and has, an industry monopoly.  It's either time to regulate them heavily, or split them up into different divisions, and regions.\n\nNvidia is using their monopoly advantage and utilizing that advantage in other spaces, like Machine Learning and AI specific machines.\n\nIt's time to split them up into different companies.  The time is now.  Nvidia's AI machinery should be an entirely different company.   Nvidia's software division should be an entirely different company.  Nvidia's all-in-one devices should be an entirely separate company.\n\nThis won't be a popular opinion, but all of the tech giants need this same break-up treatment.\n\nEvery one of them is worse than the East India Trading Company, whose colossal empire spanned the globe and controlled all of the world's trade.\n\nHow many companies is it now?  We call an entire industry FAANG.   Know why?  Those companies control the world.  Really should be FAANNG now.  The 2nd N is Nvidia.",
      "score": 3,
      "created_utc": 1734125859.0,
      "replies": []
    },
    {
      "id": "m1r488u",
      "author": "MrPangus",
      "body": "But is xess(?) comparable to dlss?",
      "score": 6,
      "created_utc": 1734037088.0,
      "replies": [
        {
          "id": "m1r7ze1",
          "author": "Mr-Roomba",
          "body": "Yes. Watch the videos.",
          "score": 18,
          "created_utc": 1734038241.0,
          "replies": [
            {
              "id": "m1t6135",
              "author": "smackythefrog",
              "body": "Why watch video when make comment do trick?",
              "score": 11,
              "created_utc": 1734063313.0,
              "replies": [
                {
                  "id": "m1t6ssq",
                  "author": "Primae_Noctis",
                  "body": "Why many word when few okay?",
                  "score": 3,
                  "created_utc": 1734063630.0,
                  "replies": [
                    {
                      "id": "m1t9les",
                      "author": "chalfont_alarm",
                      "body": "Why fire burn? Maybe tiger trapped inside?",
                      "score": 1,
                      "created_utc": 1734064817.0,
                      "replies": []
                    },
                    {
                      "id": "m1tk7gp",
                      "author": "Erikthered00",
                      "body": "Yes, that was his joke",
                      "score": 1,
                      "created_utc": 1734070017.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1te7uh",
      "author": "imakesawdust",
      "body": "I thought there was a story a few months ago that said Intel was abandoning the GPU space?",
      "score": 3,
      "created_utc": 1734066948.0,
      "replies": [
        {
          "id": "m1x5kvi",
          "author": "mia_man",
          "body": "Turns out not everything on the internet can be taken at face value.",
          "score": 1,
          "created_utc": 1734124502.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1s3uoe",
      "author": "AFoxGuy",
      "body": "What about the B750/780 cards? Where are those at?",
      "score": 1,
      "created_utc": 1734049079.0,
      "replies": []
    },
    {
      "id": "m1sumf9",
      "author": "doomunited",
      "body": "Is this already sold out?",
      "score": 1,
      "created_utc": 1734058922.0,
      "replies": []
    },
    {
      "id": "m1tp9bp",
      "author": "Betrayedunicorn",
      "body": "I wonder if this could affect the 5 series pricing",
      "score": 1,
      "created_utc": 1734072905.0,
      "replies": [
        {
          "id": "m1u1ing",
          "author": "onebit",
          "body": "I doubt it. NVIDIA knows people will pay more for their GPUs.",
          "score": 1,
          "created_utc": 1734080879.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1u7ydj",
      "author": "wechwerf86",
      "body": "What's this, good news from Intel?",
      "score": 1,
      "created_utc": 1734085339.0,
      "replies": []
    },
    {
      "id": "m1v6ewg",
      "author": "Julkebawks",
      "body": "I use an Arc A770 and it’s been perfect for my needs. I have an ITX build so it saved me a good amount of money surprisingly.",
      "score": 1,
      "created_utc": 1734101561.0,
      "replies": [
        {
          "id": "m1vvln9",
          "author": "Cranksta",
          "body": "I run a dual GPU setup due to two of my monitors being dickwads and throwing a fit if they're connected to the same GPU. A770 Titan is my main driver and a dinky little 970 is my second and I'm having a great time. \n\nThere's been some learning curve with the Intel card, but I'm actually really excited to see things continue. Intel is putting pressure on the market for good mid-range cards and considering I get updates every fucking week, I think they're doing great trying to address the driver issues. \n\nFor my workstation and light gaming, it's perfect. I even bought a second one for my husband.",
          "score": 2,
          "created_utc": 1734109754.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1w9xpu",
      "author": "2001zhaozhao",
      "body": "Does this have Displayport 2.1 like the RX7000 series?",
      "score": 1,
      "created_utc": 1734114299.0,
      "replies": []
    },
    {
      "id": "m1wap8q",
      "author": "Vismal1",
      "body": "Looking for a new card to replace my 8gb 980. I’m a bit out of the loop and trying to catch up. This seems good for me how are y’all expecting it to be regarding driver support and game compatibility?  Is all the ray tracing stuff only on the RTX line , I read that it’s not proprietary but it seems it’s not often available on other GPUs?",
      "score": 1,
      "created_utc": 1734114538.0,
      "replies": []
    },
    {
      "id": "m1wx6r9",
      "author": "mister2forme",
      "body": "Here hoping they got their drivers in order.  That’s always been a thorn in intels side for the gpu market. If so, then 250$ is a perfect price point to be at.  I know it’s 4060 level,  but the 4060 was always a bad product with a bad price.",
      "score": 1,
      "created_utc": 1734121746.0,
      "replies": []
    },
    {
      "id": "m25xsn1",
      "author": "PROLINKer",
      "body": "Is this much better than my current RX 5600xt? Does it have a huge difference?",
      "score": 1,
      "created_utc": 1734269292.0,
      "replies": []
    },
    {
      "id": "m1rexlw",
      "author": "None",
      "body": "How is it for RT? Equivalent to a nvidia gpu, how powerful is it? I don't know shit about this stuff",
      "score": 1,
      "created_utc": 1734040415.0,
      "replies": [
        {
          "id": "m1riznj",
          "author": "IzzyDeeee",
          "body": "About as good as a 4060 but cheaper. It beats it in some aspects and loses in others.\n\n12gb of vram is nice for 1440p. For 1080p it should last quite a while too.",
          "score": 12,
          "created_utc": 1734041733.0,
          "replies": []
        },
        {
          "id": "m1slvgy",
          "author": "MegaDuckDodgers",
          "body": "According to LTT's video and testing it performed better in most cases than a 4060, with a few exceptions and generally worse in titles with ray tracing \n\n\n250 dollars vs 300 for 12gb of video memory instead of 8 is hard to beat, honestly. They're definitely pretty competitive here. \n\nThe main thing is that intel needs to work on their driver support. They are starting to look like a serious competitor with this card which is a good thing. Nvidia has been inflating their GPU prices since before the pandemic (the 20 series price increase vs the 10 series was disgusting) so even if this doesn't force nvidia to stop price gouging at the very least we will finally have a good budget GPU vendor again.",
          "score": 9,
          "created_utc": 1734055672.0,
          "replies": [
            {
              "id": "m24txun",
              "author": "ImFriendsWithThatGuy",
              "body": "Nvidia is clearly greedy with the 40 series pricing. But credit where it’s due, the 3080 was MSRP for $699. That was a pretty solid deal compared to the 20 series and everything after it even when compared to AMD.",
              "score": 1,
              "created_utc": 1734244210.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1rmkez",
          "author": "None",
          "body": "[deleted]",
          "score": 12,
          "created_utc": 1734042931.0,
          "replies": [
            {
              "id": "m1rmqp3",
              "author": "None",
              "body": "I agree, except games are starting to force it on.",
              "score": 4,
              "created_utc": 1734042991.0,
              "replies": [
                {
                  "id": "m1ro8h6",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1734043494.0,
                  "replies": [
                    {
                      "id": "m1u9ngr",
                      "author": "PotatEXTomatEX",
                      "body": "The aim is to use it so devs don't have to work for years on lighting. Set a source light and its done.\n\nThe \"It looks better\" is low key the player side justification for its existence, but for the devs its \"It massively reduces workload\".",
                      "score": 3,
                      "created_utc": 1734086481.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1s3j73",
      "author": "johnnycyberpunk",
      "body": "> early benchmarks had pitted the B580 against Nvidia’s **budget cards** the RTX 4060 and AMD’s RX 7600.  \n  \nUh, what?  \nI thought the 3060 and RX6600 were the 'budget' cards (and they're *still* $250+).  \n  \nAm I grossly out of touch with what the word \"budget\" means?",
      "score": -1,
      "created_utc": 1734048964.0,
      "replies": [
        {
          "id": "m1si98r",
          "author": "chuloreddit",
          "body": "The x060 and x600 is the budget range while the x is the generation",
          "score": 8,
          "created_utc": 1734054340.0,
          "replies": []
        },
        {
          "id": "m1uuud1",
          "author": "Brisslayer333",
          "body": "The 3060 and 6600 are almost two generations old, though. Battlemage will be competing against products in the RTX *5000* and RX *8000* series, not 3000 and 6000.",
          "score": 6,
          "created_utc": 1734097241.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1qwryb",
      "author": "None",
      "body": "Question - Where can you buy this? Because the brands are dropping systems with Intel CPU and NVidia 4050 and sell it over 1k ...",
      "score": 0,
      "created_utc": 1734034791.0,
      "replies": [
        {
          "id": "m1s5gzo",
          "author": "Znuffie",
          "body": "Newegg has it listed for pre-order but out of stock.",
          "score": 2,
          "created_utc": 1734049659.0,
          "replies": [
            {
              "id": "m1sti91",
              "author": "None",
              "body": "Thanks a lot 😊",
              "score": 0,
              "created_utc": 1734058509.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1qvbuo",
      "author": "ThePoltageist",
      "body": "Intel stock looking juicy af",
      "score": -7,
      "created_utc": 1734034335.0,
      "replies": [
        {
          "id": "m1qzevp",
          "author": "cloudcity",
          "body": "This is currently the only thing they are doing right....",
          "score": 17,
          "created_utc": 1734035624.0,
          "replies": [
            {
              "id": "m1r9f2d",
              "author": "XBattousaiX",
              "body": "Honestly, mostly yes.\n\nArrow lake, while performance wise isn't better than the 14th gen, is more power efficient, and while quite far from the 9800x3d in gaming, still very good for work tasks.\n\nAnd it's not like it'll stop you from reaching 4k60. Your GPU will likely be the bottleneck there.\n\n\nCan we shit on Intel for having instability issues and factory defects? Absolutely.\n\nCan we shit on them for having stagnant, if not, decaying performance? Yes.\n\nShould we just pretend that the CPUs are unviable for gaming? Also yes.\n\nThere's still hope for them to turn the ship around. Last thing I want is a monopoly. Competition is good.\n\nAnd the B580 is looking quite nice. Truth be told, had I not built my 7800x3d and 7800xt build last year, I'd probably go for a build with this instead. Cheaper, but still decent performance. I'd also stop looking up qd-oled monitor every 5 minutes haha.",
              "score": 11,
              "created_utc": 1734038686.0,
              "replies": [
                {
                  "id": "m1r9u8v",
                  "author": "cloudcity",
                  "body": "Yeah, I  want good competition for sure, the consumer wins when everyone is innovating and competing for our dollars! I've been running AMD CPUs for last two builds, but would switch back if it made sense.",
                  "score": 1,
                  "created_utc": 1734038818.0,
                  "replies": [
                    {
                      "id": "m1uxm8j",
                      "author": "XBattousaiX",
                      "body": "If intel's current top chip, the 285k or w/e, was priced 399/449, it wouldn't be joked about.\n\n\nIt's not the 7800x3d nor the 9800x3d, but it's still more than adequate for gaming, and still very solid for work tasks.\n\n\n\nThe biggest problems with Intel are the 2 year motherboard cycles and absurd power requirements. Not even counting the recent problems, just the ongoing ones.\n\n\nI went with AMD because I wanted a lower power draw, and the 7800x3d was also the ultimate gaming chip. If I need to do some tasks, it's still far more than enough for me.",
                      "score": 1,
                      "created_utc": 1734098325.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1sd63s",
              "author": "ToSeeAgainAgainAgain",
              "body": "It'd be interesting to see the B580 dethrone the 4060 on Steam's list of used GPUs, probably won't be the one to do it, but C or D gen just might if they play their cards right",
              "score": 2,
              "created_utc": 1734052491.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1rr66r",
          "author": "Vdjakkwkkkkek",
          "body": "Consumer gpu market is barely a drop in a bucket for Nvidia and Intel.",
          "score": 3,
          "created_utc": 1734044504.0,
          "replies": [
            {
              "id": "m1rxn3b",
              "author": "ThePoltageist",
              "body": "Yeah and not the first thing that has me paying attention to them",
              "score": 0,
              "created_utc": 1734046834.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1tjcqs",
      "author": "sweetestdeth",
      "body": "I bought my prebuilt gaming rig for around 2k. Is that considered budget or mid tier? Either way, you won’t catch me running Intel. I’ve had nothing but a bad run with them.",
      "score": 0,
      "created_utc": 1734069554.0,
      "replies": [
        {
          "id": "m1unvaz",
          "author": "Snuffleupuguss",
          "body": "2k should’ve net you a pretty high end system\n\nWhat are your specs?",
          "score": 1,
          "created_utc": 1734094303.0,
          "replies": [
            {
              "id": "m1vbicx",
              "author": "sweetestdeth",
              "body": "https://files.catbox.moe/2v9lvl.jpeg\n\nI added a Predator 4tb SSD and more fans, also upgraded to slightly faster RAM",
              "score": 0,
              "created_utc": 1734103297.0,
              "replies": [
                {
                  "id": "m1vdejs",
                  "author": "Snuffleupuguss",
                  "body": "When did you get it? That cpu + gpu combo should only cost around $1000, so including a decent case, mobo and psu it should be maybe $1500 at a push\n\nIf you bought it for $2000 recently then you got rizzed a lil bit, but not too bad. I’ve seen people pay what you pay for something half as powerful",
                  "score": 1,
                  "created_utc": 1734103926.0,
                  "replies": [
                    {
                      "id": "m1vwyzu",
                      "author": "sweetestdeth",
                      "body": "I got it in September and from the beginning, I felt like it was a little overpriced.",
                      "score": 1,
                      "created_utc": 1734110195.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1s17u2",
      "author": "LessonStudio",
      "body": "The key for me is how hard is it to program the math parts for things like ML.\n\nCUDA is very much a standard for this. OpenCL is a non-starter as it is old and crusty run by old and crusty academics.\n\nThey are making claims about it running straight and boring C++. This would be super cool.\n\nGaming is great, and has lots of money, but in order to break the back of nVidia, it has to be a data center darling.",
      "score": -8,
      "created_utc": 1734048129.0,
      "replies": [
        {
          "id": "m1s83sx",
          "author": "SkyeAuroline",
          "body": "Or, we can have products that aren't eaten up entirely by AI bullshit and scalpers, leaving none for the average person. I'm perfectly fine with a GPU that doesn't have an AI application!",
          "score": 13,
          "created_utc": 1734050622.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1s2680",
      "author": "cranberrydudz",
      "body": "Intels gpus are power hungry though. Take that into consideration",
      "score": -5,
      "created_utc": 1734048472.0,
      "replies": [
        {
          "id": "m1sg8kg",
          "author": "OftenTangential",
          "body": "The first reviews are live and the B580 is less efficient than the 4060 but more efficient than the 7600. Same deal with RT performance, lagging NVIDIA but leading AMD. They're right in the mix now, for another 3-6 months anyway",
          "score": 15,
          "created_utc": 1734053608.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1rn8s5",
      "author": "Zeconation",
      "body": "It would be a budget option if they didn't sell it for 500$ not even including taxes.",
      "score": -13,
      "created_utc": 1734043160.0,
      "replies": [
        {
          "id": "m1s1mu8",
          "author": "Auedawen",
          "body": "MSRP is US$250. Not sure if that's your local currency or not but that's certainly budget pricing in the current product stack.",
          "score": 11,
          "created_utc": 1734048278.0,
          "replies": [
            {
              "id": "m1uhydw",
              "author": "Zeconation",
              "body": "Wrong.\n\nWorld  ≠ NA\n\nIn UK 350 pounds which is close to 400USD and its 500 USD where I live now. With taxes included it goes almost up to 700 USD",
              "score": 0,
              "created_utc": 1734091425.0,
              "replies": [
                {
                  "id": "m1ut4na",
                  "author": "Auedawen",
                  "body": "What kind of response is this? I specifically clarified  local currency exactly for this because no shit the world isn't NA.\n\nWith that said, how does it compare to 4060 prices where you live? That's the direct comparison for this card.",
                  "score": 1,
                  "created_utc": 1734096549.0,
                  "replies": [
                    {
                      "id": "m1uv6g7",
                      "author": "Zeconation",
                      "body": "I can buy two 4060 with price of this card.",
                      "score": 1,
                      "created_utc": 1734097375.0,
                      "replies": [
                        {
                          "id": "m1uvrnt",
                          "author": "Auedawen",
                          "body": "Okay there you go, you buried the lede 3 posts deep to make your point, start with the pertinent details next time. \n\nNote sure why your country has such incredible import tariffs on US manufactured electronics compared to Taiwan but it is what it is. \n\nBtw, how much does an Intel Processor cost compared to AMD? Sounds like it would be a similar price discrepancy?",
                          "score": 1,
                          "created_utc": 1734097606.0,
                          "replies": [
                            {
                              "id": "m1uxngy",
                              "author": "Zeconation",
                              "body": "All the other PC components priced same except Intel GPU for some reason. Price range is way too vast region to region on this specific brand of GPU as I said before.\n\nIf you really want to know exact price of 4060 is, 320$ atm. If I bought two now it would cost me 640$. On the other hand single B580 sells around 700$ with taxes.",
                              "score": 1,
                              "created_utc": 1734098338.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1tj3oa",
      "author": "hey_you_too_buckaroo",
      "body": "I'm gonna be surprised if these sell well. I'm expecting no one to buy these cards. The Nvidia allure is like a cult at this point. Most budget buyers are probably kids and they're gonna get what their friends get. I'm just guessing here though.",
      "score": -2,
      "created_utc": 1734069417.0,
      "replies": []
    },
    {
      "id": "m1rtfl6",
      "author": "Glidepath22",
      "body": "It’s seems to me that Intel was holding back previously",
      "score": -4,
      "created_utc": 1734045312.0,
      "replies": []
    }
  ]
}