{
  "post": {
    "title": "Nintendo Sound Clock: Alarmo will be made available across retailers worldwide starting in March 2025, meaning aspiring purchasers will no longer need a Nintendo Switch Online subscription to buy one.",
    "author": "a_Ninja_b0y",
    "id": "1i17ryt",
    "score": 57,
    "created_utc": 1736866402.0,
    "selftext": "",
    "num_comments": 36,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i17ryt/nintendo_sound_clock_alarmo_will_be_made/"
  },
  "comments": [
    {
      "id": "m73saf3",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736866402.0,
      "replies": []
    },
    {
      "id": "m77vt5s",
      "author": "SlipperyScope",
      "body": "I feel like if this wasn't a Nintendo product no one would buy it, who uses a dedicated alarm clock these days anyway",
      "score": 29,
      "created_utc": 1736913225.0,
      "replies": [
        {
          "id": "m785ujp",
          "author": "Successful_Elk_1672",
          "body": "Me. Never take my phone upstairs to bed. ",
          "score": 5,
          "created_utc": 1736917481.0,
          "replies": [
            {
              "id": "m7ehebk",
              "author": "xRostro",
              "body": "What if an important phone call/message comes through?",
              "score": 3,
              "created_utc": 1737002889.0,
              "replies": [
                {
                  "id": "m7eim2h",
                  "author": "Successful_Elk_1672",
                  "body": "Like what? How often do you get important calls during the night?",
                  "score": 2,
                  "created_utc": 1737003428.0,
                  "replies": [
                    {
                      "id": "m7ezh2b",
                      "author": "Eleventieth",
                      "body": "Personally I leave mine on a surface out of reach from my bed just in case of a family medical emergency or the like.",
                      "score": 3,
                      "created_utc": 1737012222.0,
                      "replies": [
                        {
                          "id": "m7ezx1m",
                          "author": "Successful_Elk_1672",
                          "body": "Makes sense. Fingers crossed you never need it!",
                          "score": 2,
                          "created_utc": 1737012488.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7e0mxp",
              "author": "Old-Rhubarb-97",
              "body": "Life hack right here. \n\nPhone does not enter the bedroom.",
              "score": -2,
              "created_utc": 1736996302.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7c7jxy",
          "author": "JM062696",
          "body": "My phone alarm is incapable of waking me up. I have to use a dedicated alarm clock. Also helps to have to walk across the room to turn it off.",
          "score": 3,
          "created_utc": 1736975277.0,
          "replies": []
        },
        {
          "id": "m7w82nq",
          "author": "karnyboy",
          "body": "the fact it doesn't have a battery back up is astoundingly annoying. If your power were to go out so does your alarm. \n\n  \nGood thing you can get an old school clock and put batteries in it, or you use your phone.",
          "score": 1,
          "created_utc": 1737246477.0,
          "replies": []
        },
        {
          "id": "m78tk4t",
          "author": "MultiMarcus",
          "body": "I just use my Apple Watch, but like for kids who don’t have phones yet it’s almost a no brainer. The price is steep though.  It’s very much intended for kids’s to get enjoyment out of waking up instead of dreading it so much which is always something that parents like to see.",
          "score": 0,
          "created_utc": 1736931084.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m79pajc",
      "author": "MagicWishMonkey",
      "body": "I bought my son one for Christmas and it’s super disappointing. It doesn’t have a white noise function or nightlight, it’s just a dumb clock that notices when you get in bed. \n\nMy kid likes it but I don’t think it’s worth $100, you can get better alarm clocks for half as much at target or Amazon.",
      "score": 13,
      "created_utc": 1736948201.0,
      "replies": [
        {
          "id": "m7en582",
          "author": "makoman115",
          "body": "My kid likes it \n\nBro i think that’s all there really is to it",
          "score": 9,
          "created_utc": 1737005528.0,
          "replies": [
            {
              "id": "m7g0dye",
              "author": "MagicWishMonkey",
              "body": "My kid also likes it, which I guess is all that matters, but $100 seems pretty steep for something that has basically zero features, lol",
              "score": 4,
              "created_utc": 1737033014.0,
              "replies": [
                {
                  "id": "m7hceb2",
                  "author": "makoman115",
                  "body": "But u and op already bought it, which means you had the money, and your kids like it\n\nWhat’s with the buyers remorse",
                  "score": 0,
                  "created_utc": 1737048202.0,
                  "replies": [
                    {
                      "id": "m7ifxbg",
                      "author": "MagicWishMonkey",
                      "body": "For me it was that I expected it to have a night light and sound machine/white noise function built into it, basic stuff that most alarm clocks for kids have. \n\nIt's on me for not doing any research into it, and my kid likes it so I don't really care that much.",
                      "score": 1,
                      "created_utc": 1737059603.0,
                      "replies": [
                        {
                          "id": "m7w8ccz",
                          "author": "karnyboy",
                          "body": "You shouldn't have to research an alarm clock, these things should be engineered by mere common sense.",
                          "score": 1,
                          "created_utc": 1737246565.0,
                          "replies": [
                            {
                              "id": "m8030sm",
                              "author": "BanagnaLasagna",
                              "body": "Wtf kind of comment is this are you okay?",
                              "score": 0,
                              "created_utc": 1737303864.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7mlqtt",
          "author": "None",
          "body": "I got it for Xmas I like it. It’s just cool looking and since I don’t have any type of clock anywhere it’s adds one, plus I like the Nintendo characters and the updates they keep adding. As a clock there are better options with more functions available.",
          "score": 2,
          "created_utc": 1737122030.0,
          "replies": []
        },
        {
          "id": "m7rsm0l",
          "author": "LevianMcBirdo",
          "body": "So you couldn't be arsed to look up its functionality and blame the product?",
          "score": 2,
          "created_utc": 1737187447.0,
          "replies": [
            {
              "id": "m7sh8qj",
              "author": "MagicWishMonkey",
              "body": "It's on me for sure, but I assumed that a product made for kids would have the same basic features as all the other alarm clocks for kid.",
              "score": 1,
              "created_utc": 1737202427.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7zlf3w",
      "author": "ItemFast",
      "body": "I don’t like this clock because its round with a square screen triggers me so hard.",
      "score": 2,
      "created_utc": 1737298627.0,
      "replies": []
    },
    {
      "id": "m742epb",
      "author": "A117MASSEFFECT",
      "body": "Aannnddd....they're sold out. ",
      "score": 5,
      "created_utc": 1736869609.0,
      "replies": []
    },
    {
      "id": "m7eu5zf",
      "author": "Fun-Supermarket6820",
      "body": "Why the fuck would anyone buy this?",
      "score": 4,
      "created_utc": 1737009176.0,
      "replies": []
    },
    {
      "id": "m74ggtx",
      "author": "AtsignAmpersat",
      "body": "I saw one of these at the Nintendo store on display months ago and I just assumed they were for sale already. It said 99.99 on the display.",
      "score": 2,
      "created_utc": 1736873808.0,
      "replies": [
        {
          "id": "m76aj5c",
          "author": "AuelDole",
          "body": "They were already for sale, but only in the Nintendo store, or their website - if you have a Nintendo online subscription. Now it’s open to everybody",
          "score": 2,
          "created_utc": 1736893581.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7aa3id",
      "author": "EastClintwood89",
      "body": "I'd rather save the money for the Switch 2. ",
      "score": 2,
      "created_utc": 1736955285.0,
      "replies": []
    },
    {
      "id": "m789em2",
      "author": "Heady_Mariner",
      "body": "We got one for our teenager and it is incredible, very cool piece of technology. He’s been getting up earlier than before he had it and really enjoys the features. The clock does a lot of fun things.",
      "score": 2,
      "created_utc": 1736919198.0,
      "replies": [
        {
          "id": "m7dfqjo",
          "author": "learnedsanity",
          "body": "Someone says it's just a clock that notices when you get into bed/near it and you say it does a lot of fun things. Can you elaborate.",
          "score": 7,
          "created_utc": 1736989060.0,
          "replies": [
            {
              "id": "m7dx0y8",
              "author": "Heady_Mariner",
              "body": "One thing is that it continues to monitor the person for an hour after the alarm to keep them from returning to bed, this is huge with my autistic kid. But more importantly, it makes it all fun. The animations, familiar game sound effects, and all of their favorite characters make for a more positive experience. We have battled for years with our kid in the morning. Alarmo, has him getting up nearly an hour earlier than we were ever able to do. The alarm can be set on specific days without having to remember to reset it, like no alarm on weekends but on weekends. \n\nMaybe these are more common features than I know, but the thing has been a real boon to our mornings and anything that makes life easier with autism feels like a miracle.",
              "score": 5,
              "created_utc": 1736995035.0,
              "replies": [
                {
                  "id": "m7mmsmu",
                  "author": "None",
                  "body": "I’m an adult don’t even use and alarm my body just wakes now on routine but I love the Nintendo sounds and characters too. It is overpriced, $60 probably would have been good but hopefully they keep updating it for years. My biggest disappointment is that the whole circle isn’t a screen just a small box within it.",
                  "score": 2,
                  "created_utc": 1737122400.0,
                  "replies": []
                },
                {
                  "id": "m7eua4r",
                  "author": "Fun-Supermarket6820",
                  "body": "Your comment sounds like a TV commercial",
                  "score": 4,
                  "created_utc": 1737009239.0,
                  "replies": [
                    {
                      "id": "m7ggdi4",
                      "author": "Heady_Mariner",
                      "body": "Not sure if this is a compliment, but I’ll take it as one. I’m just trying to give honest feedback about a product.",
                      "score": 3,
                      "created_utc": 1737038696.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7glz6a",
      "author": "--Arete",
      "body": "We need a new Mario game not some God damn alarm clock.",
      "score": 1,
      "created_utc": 1737040471.0,
      "replies": []
    }
  ]
}