{
  "post": {
    "title": "Royal Mail trials postbox with parcel hatch, solar panels and barcode scanner",
    "author": "diacewrb",
    "id": "1jvt7zi",
    "score": 1065,
    "created_utc": 1744274970.0,
    "selftext": "",
    "num_comments": 56,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jvt7zi/royal_mail_trials_postbox_with_parcel_hatch_solar/"
  },
  "comments": [
    {
      "id": "mmd0mcd",
      "author": "super_nicktendo22",
      "body": "Any technological advancement that saves me having to lose 25 minutes of my lunch break queuing with Doris and chums at the Post Office is very welcome.",
      "score": 226,
      "created_utc": 1744278063.0,
      "replies": [
        {
          "id": "mmdi61x",
          "author": "badger906",
          "body": "Haha my twice weekly moan at work is having to go to the post office for work banking, only to stand in The queue full of pensioners getting their pension out.. my life is inconvenienced because people haven’t discovered bank accounts and debit cards nearly 38 years after they were invented..",
          "score": 64,
          "created_utc": 1744286843.0,
          "replies": [
            {
              "id": "mmduqhg",
              "author": "CommodoreAxis",
              "body": "\nI think a lot of them choose to stick with “the hard way” because it gives them something to do. My grandfather still keeps a few bills off of autopay specially because he likes the act of writing and mailing a check.",
              "score": 39,
              "created_utc": 1744291544.0,
              "replies": [
                {
                  "id": "mmjla5l",
                  "author": "NorysStorys",
                  "body": "I live in a small rural town where all the elderly go out on Thursday market day and go to coffee mornings and get their pensions etc, it very much is an excuse for them to get out.",
                  "score": 3,
                  "created_utc": 1744369989.0,
                  "replies": [
                    {
                      "id": "mmkbh9g",
                      "author": "CommodoreAxis",
                      "body": "My grandfather can’t really handle going inside the grocery store, but he can get in/out of the car with help - so he asks to ride with me to sit in the car in the parking lot. It’s literally just an excuse to see the Sun and hang out with me for a bit.",
                      "score": 3,
                      "created_utc": 1744379955.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmdqvio",
              "author": "super_nicktendo22",
              "body": "Seriously though, why do they pick the busiest time of day to do it?!",
              "score": 10,
              "created_utc": 1744290177.0,
              "replies": [
                {
                  "id": "mmec6ea",
                  "author": "qtx",
                  "body": "Because that's the only time post offices are open?",
                  "score": -3,
                  "created_utc": 1744296982.0,
                  "replies": [
                    {
                      "id": "mmejx9x",
                      "author": "super_nicktendo22",
                      "body": "Most POs are open from 9am to 5pm, so that excuse is nonsense. Lunchtime is the busiest period full stop.",
                      "score": 7,
                      "created_utc": 1744299294.0,
                      "replies": [
                        {
                          "id": "mmfiicm",
                          "author": "bert93",
                          "body": "There's a lot that are open much later than 5pm too. Think of the ones inside shops like Nisa for example.\n\nI've used a couple at 9pm or 10pm before. Even if officially it closes earlier, if the shops open it's no problem for them to just go to the post office counter and serve you anyway.",
                          "score": 6,
                          "created_utc": 1744309375.0,
                          "replies": []
                        },
                        {
                          "id": "mmgvd4b",
                          "author": "Trick2056",
                          "body": "> Lunchtime is the busiest period full stop\n\nwell because you are required to work between 9am -12 pm and 1pm to 5pm?",
                          "score": 1,
                          "created_utc": 1744324165.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mmdq3tu",
              "author": "creakinator",
              "body": "And they were standing in line for 30 minutes, knowing they needed to pay,  then they go digging in their back pocket for their wallet or in their purse trying to find it. Drives me absolutely crazy at the grocery store.",
              "score": 24,
              "created_utc": 1744289898.0,
              "replies": [
                {
                  "id": "mmer85j",
                  "author": "PaulAtredis",
                  "body": "This is why I love Smart Checkouts. The old folks just go to the cashier and I'm out within 30 secs no queuing.",
                  "score": 15,
                  "created_utc": 1744301451.0,
                  "replies": []
                },
                {
                  "id": "mmeeags",
                  "author": "cat_prophecy",
                  "body": "Wait until they hear the total before even taking out their check book.",
                  "score": 8,
                  "created_utc": 1744297606.0,
                  "replies": [
                    {
                      "id": "mmgs1c2",
                      "author": "pugsly",
                      "body": "What’s a check book?",
                      "score": 0,
                      "created_utc": 1744323041.0,
                      "replies": [
                        {
                          "id": "mmgxdsd",
                          "author": "JustAnotherSuit96",
                          "body": "Pretty sure they mean a cheque book",
                          "score": 2,
                          "created_utc": 1744324859.0,
                          "replies": [
                            {
                              "id": "mmianls",
                              "author": "cat_prophecy",
                              "body": "Literally only Canadians spell it that way.",
                              "score": -2,
                              "created_utc": 1744343386.0,
                              "replies": [
                                {
                                  "id": "mmj7tfl",
                                  "author": "pugsly",
                                  "body": "Literally only Americans spell it as check, but either way it’s a dead payment instrument in the developed world.",
                                  "score": 3,
                                  "created_utc": 1744362313.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmdsx71",
          "author": "alphabased",
          "body": "I recall 20 years ago if I posted from Southampton at last post it go to to Scotland the next morning!",
          "score": 3,
          "created_utc": 1744290910.0,
          "replies": [
            {
              "id": "mmhq3y3",
              "author": "Spanky2k",
              "body": "About 10 years ago when we were still doing Christmas cards, I posted them all off at the post office with 1st class stamps. I also sent some to Germany. The ones to Germany got there before the ones to friends that lived about 3 stops away on the Underground. 🙃",
              "score": 1,
              "created_utc": 1744335158.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmezk20",
          "author": "BoringWozniak",
          "body": "Doris is doing her best, bless her. Not her fault that she’s the only branch in a 20 mile radius serving countless online delivery returns.",
          "score": 2,
          "created_utc": 1744303907.0,
          "replies": []
        },
        {
          "id": "mmfstt1",
          "author": "CoeurdAssassin",
          "body": "This is one of the most British sentences I’ve heard",
          "score": 1,
          "created_utc": 1744312430.0,
          "replies": []
        },
        {
          "id": "mmg9al0",
          "author": "DGSmith2",
          "body": "Order the postage online and they will come collect it from your door free of charge.",
          "score": 1,
          "created_utc": 1744317234.0,
          "replies": [
            {
              "id": "mmggir6",
              "author": "super_nicktendo22",
              "body": "Often Amazon returns don't have that option, sadly.",
              "score": 2,
              "created_utc": 1744319371.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmd8a4g",
          "author": "Aroloco",
          "body": "And then you have thousands of Doris competing in the already scarce pool of jobs",
          "score": -6,
          "created_utc": 1744282397.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmd5vke",
      "author": "zorionek0",
      "body": "There’s something innately satisfying about walking to the mailbox to send a letter. I made it my resolution this year to send more analog correspondence and so far it’s been a hit with my friends and family and I’ve received some lovely letters in return.",
      "score": 50,
      "created_utc": 1744281132.0,
      "replies": [
        {
          "id": "mme1ns3",
          "author": "Abigail716",
          "body": "It can be a lot of fun. My grandmother and I still exchange letters as our primary form of communication. It's rarely anything time sensitive and it feels so much more special getting a handwritten letter. Both of us always use calligraphy pens and wax seals to add to the fun. Sometimes intentionally writing the letter to be overly dramatic to describe mundane events.",
          "score": 11,
          "created_utc": 1744293819.0,
          "replies": []
        },
        {
          "id": "mmfejpn",
          "author": "None",
          "body": "Get yourself a nice pen and a wax seal, make it all fancy, send your pals letters!",
          "score": 3,
          "created_utc": 1744308220.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmd8h7h",
      "author": "JBWalker1",
      "body": "I know they''re not as compact but a Royal Mail version of parcel lockers would be good. They all seem to be Amazon and Evri but a Royal Mail one would have an edge by also having a post box in the middle of it too. \n\nA post box for parcels will never be as good since they can accept larger parcels and you dont even need to add a post label or anything to the parcel you're dropping off, so you therefore dont even need a printer at home which more and more people dnot these days. They can also have security and reliability features like cameras and scales.\n\nObviously they can have fancy post boxes too, but fancy royal mail lockers would be handy. I think parcel lockers should be everywhere including at every train and tube station",
      "score": 14,
      "created_utc": 1744282495.0,
      "replies": [
        {
          "id": "mmdoaol",
          "author": "NuPNua",
          "body": "Funny you said that as they were putting one in as I walked past my local distribution centre yesterday.",
          "score": 7,
          "created_utc": 1744289239.0,
          "replies": [
            {
              "id": "mmerlna",
              "author": "JBWalker1",
              "body": "Oh yeah looks like they do have some of their own. They dont have post boxes integrated with them though which is an odd choice. If a royal mail person is stopping there daily anyway they could collect a sack of mail too with just 1 minute longer.\n\nBut eh anyway it's a private forgein company now sadly, so I shouldn't care.",
              "score": 3,
              "created_utc": 1744301562.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmdpndt",
          "author": "GrynaiTaip",
          "body": "We got the first parcel lockers (called post-o-mats) in Lithuania just a few years ago (before covid) and they've been hugely successful. Now there are multiple next to every grocery store. It's super convenient, you don't have to go to the post office to pick up your parcels, these ones operate 24/7.\n\nThere's even a few refrigerated ones, for food stuffs.",
          "score": 7,
          "created_utc": 1744289733.0,
          "replies": []
        },
        {
          "id": "mn1y3we",
          "author": "KFR42",
          "body": "There's a royal mail locker at my local petrol station. They already exist. I suppose this is more aimed at areas without that kind of thing available.",
          "score": 1,
          "created_utc": 1744635211.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmf6p5d",
      "author": "Mattwildman5",
      "body": "Used one of the Royal Mail lockers the other day. Just walk up scan the QR it prints a label and you chuck it in a hatch. 1000x better than the post office dance. One of the rare occasions I’m fully advocating for machines to replace people.",
      "score": 12,
      "created_utc": 1744305977.0,
      "replies": [
        {
          "id": "mmf7q1o",
          "author": "Class08",
          "body": "I’d also be happy with the reverse of this, like the Amazon lockers but Royal Mail. I keep missing parcels because I’m at work during the day but all my reasonable sized Amazon stuff just goes to the Amazon locker in my local supermarket.",
          "score": 5,
          "created_utc": 1744306271.0,
          "replies": [
            {
              "id": "mmfa14r",
              "author": "Mattwildman5",
              "body": "Pretty sure Royal Mail does this, when using the locker it asked if I wanted to collect or send. Unless I’m thinking of inpost",
              "score": -1,
              "created_utc": 1744306931.0,
              "replies": [
                {
                  "id": "mmfbumz",
                  "author": "Class08",
                  "body": "I've seen Inpost, but never Royal Mail. At least not in my local area.",
                  "score": 1,
                  "created_utc": 1744307451.0,
                  "replies": [
                    {
                      "id": "mmfj6xt",
                      "author": "bert93",
                      "body": "Royal mail do have them, like you say just not in your area.\n\nI've seen some standalone ones and also one which was a combination of services (Evri, UPS, Royal Mail I think) where each company had some of the compartments assigned to them.",
                      "score": 1,
                      "created_utc": 1744309573.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmgd1it",
          "author": "Elwe_amandil",
          "body": "But how much does that solar panel actually help? Outside traffic one of the biggest complaints I hear is minimal sunlight.",
          "score": -1,
          "created_utc": 1744318329.0,
          "replies": [
            {
              "id": "mmgg95f",
              "author": "Mattwildman5",
              "body": "Oh I have no idea about the solar panel I just mean easier methods to drop a parcel that operate 24/7.",
              "score": 1,
              "created_utc": 1744319288.0,
              "replies": [
                {
                  "id": "mmggqs8",
                  "author": "Elwe_amandil",
                  "body": "True",
                  "score": 1,
                  "created_utc": 1744319439.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mmfgpf5",
      "author": "cyncity7",
      "body": "Nice to see a country trying to improve postal services instead of destroying it.",
      "score": 2,
      "created_utc": 1744308847.0,
      "replies": [
        {
          "id": "mn4vqjy",
          "author": "ledow",
          "body": "They sold off the Royal Mail to a Czech billionaire only the other day\n\n[https://www.bbc.co.uk/news/articles/ckg93390808o](https://www.bbc.co.uk/news/articles/ckg93390808o)\n\nThey have no intention to improve postal services.  They've basically just privatised the last one, and this is one of the attempts to make it look like things are better when actually the price has risen immensely, we're almost certainly losing weekend collections and deliveries and the 2nd class service (to \"reduce costs\", even though those were listed as one of their universal service obligations).\n\nIt's a gimmick.  A bit like the recent stories about BT repurposing their cabinets to be electric car chargers.  They planned / pitched for investment for 60,000 such locations.  They converted one, made a big fuss about it on the news, and then immediately ditched the entire scheme.",
          "score": 1,
          "created_utc": 1744667943.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmg8oag",
      "author": "darybrain",
      "body": "I thought this was excellent until my local one also started being used as a rubbish bin by bellends.",
      "score": 2,
      "created_utc": 1744317054.0,
      "replies": []
    },
    {
      "id": "mmgbw1j",
      "author": "NemoNewbourne",
      "body": "EXTERMINATE!",
      "score": 2,
      "created_utc": 1744317995.0,
      "replies": []
    },
    {
      "id": "mmhy3ir",
      "author": "MisterRipster",
      "body": "meanwhile in the US DEJOY only bring suffering",
      "score": 2,
      "created_utc": 1744338161.0,
      "replies": []
    },
    {
      "id": "mme348n",
      "author": "yarash",
      "body": "US Post offices in general are only open during business hours. It is impossible to drop off a package if you have a traditional 8-5/9-5 job during the week. The self drop off machines have been locked away in my area since covid. \n\nI can make a call for a pickup, but that means leaving a package out all day and risking it getting stolen. Standard mail boxes are only equipped to pick up flat items.",
      "score": 3,
      "created_utc": 1744294274.0,
      "replies": []
    },
    {
      "id": "mmigzez",
      "author": "kingrikk",
      "body": "There’s loads of cryptic adverts near me for this postbox, but the nearest one is 20 miles away. Not sure if the ad buyer just went a bit crazy.\n\nI agree it seems good, but they do free collections at the moment which is even easier.",
      "score": 1,
      "created_utc": 1744346393.0,
      "replies": []
    },
    {
      "id": "mmgucyk",
      "author": "Only-Bet5355",
      "body": "Why",
      "score": 1,
      "created_utc": 1744323822.0,
      "replies": []
    },
    {
      "id": "mmi2q32",
      "author": "Geekygamertag",
      "body": "People will always figure out a way to steal. 😞",
      "score": 0,
      "created_utc": 1744339966.0,
      "replies": [
        {
          "id": "mmk38qs",
          "author": "OddNothic",
          "body": "All locks are an arms race, intended only to keep honest people honest, and to slow down a determined thief.",
          "score": 2,
          "created_utc": 1744377255.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmf8lxg",
      "author": "michaelkah",
      "body": "We are here today to witness the opening of a new box to replace the box which used to stand at the corner of Ulverston Road and Sandwood Crescent. Owing to the road-widening programme carried out by the Borough Council, the Ulverston Road box was removed, leaving the wall box in Esher Road as the only box for the Ulverston Road area. This new box will enable the people of the Ulverston Road area to post letters, post-cards and small packages without recourse to the Esher Road box or to the box outside the post office at Turner’s Parade which many people used to use, but which has now been discontinued owing to the opening of this box and also the re-organization of box distribution throughout the whole area, which comes into force with the opening of new boxes at the Wyatt Road Post Office in July.",
      "score": 0,
      "created_utc": 1744306525.0,
      "replies": []
    },
    {
      "id": "mmeo3jw",
      "author": "Tommy__want__wingy",
      "body": "How about they stop putting mail in rubbish bins?",
      "score": -1,
      "created_utc": 1744300524.0,
      "replies": []
    },
    {
      "id": "mmd8viw",
      "author": "None",
      "body": "Post office box.",
      "score": -5,
      "created_utc": 1744282689.0,
      "replies": [
        {
          "id": "mmenghd",
          "author": "Beefstah",
          "body": "Postbox:\n\n[https://www.collinsdictionary.com/dictionary/english/postbox](https://www.collinsdictionary.com/dictionary/english/postbox)\n\n[https://en.wikipedia.org/wiki/Post\\_box](https://en.wikipedia.org/wiki/Post_box)",
          "score": 6,
          "created_utc": 1744300339.0,
          "replies": [
            {
              "id": "mmffsak",
              "author": "None",
              "body": "https://youtu.be/uFpK_r-jEXg?si=mhHxGWrly1smTFOz",
              "score": -4,
              "created_utc": 1744308581.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}