{
  "post": {
    "title": "Nintendo Switch 2 predicted to be the biggest console launch in gaming history",
    "author": "FernandoRocker",
    "id": "1k7o7kv",
    "score": 0,
    "created_utc": 1745596001.0,
    "selftext": "",
    "num_comments": 35,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k7o7kv/nintendo_switch_2_predicted_to_be_the_biggest/"
  },
  "comments": [
    {
      "id": "mozp1ma",
      "author": "Key_Amazed",
      "body": "It's cute observing the people who want it to fail. They're going to be severely disappointed. To think it's going to sell Wii U numbers shows a serious lack of brain cells. Wii U failed because of shit marketing. The casual audience that makes up Nintendo's majority, especially after the Wii, didn't know it was a new console. They thought it was an add-on. Switch 2 leaves no room for confusion. \n\nThe price of the console itself isn't even that bad, and DK Bananza will be the \"usual\" 69.99, so I'm not concerned. The price for the Zelda upgrades is awful...if you either don't own them already or don't have NSO, in which case it's either free or 20$ (I think?) which is the exact same price for certain PS4 to PS5 upgrade games like Ghost of Tsushima.\n\nThe discourse is wild. Without ragebaiting twitch streamers or YouTubers who are going to buy it anyway on the excuse of it being their job (their job should be to avoid the Switch 2 and find other avenues to make money), I don't think there would be that much negativity. Influencers truly run the online discourse now. So few people are able to form their own opinions.",
      "score": 11,
      "created_utc": 1745597199.0,
      "replies": [
        {
          "id": "mozty91",
          "author": "Jindujun",
          "body": "Yeah. I dont get the whole comparison to WiiU, least off all because the Wii U was a great machine but suffered from what you said, shit marketing.\n\nThere are a whole bunch of awesome games for the Wii U",
          "score": 2,
          "created_utc": 1745598644.0,
          "replies": []
        },
        {
          "id": "mp02ii6",
          "author": "weegee19",
          "body": "Zelda upgrades are actually $10 apiece, which isn't terrible.",
          "score": 2,
          "created_utc": 1745601096.0,
          "replies": []
        },
        {
          "id": "mozxfxq",
          "author": "realKevinNash",
          "body": "It's foolish just because the majority never truly does the right thing in terms of gaming. Any \"win\" is temporary. That said, i get it because I want that to change. I want it to fail because maybe then we'll start to see some change on pricing in the future, even if i know that is the least likely outcome. I don't think that's a bad position to hold.",
          "score": -4,
          "created_utc": 1745599655.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mozlvvb",
      "author": "Ultiman100",
      "body": "We’ll see.\n\nIt’s the most expensive Nintendo console ever with the highest gaming prices in the industry at a time where international trade is in the direct crosshairs of geopolitics.",
      "score": 13,
      "created_utc": 1745596270.0,
      "replies": [
        {
          "id": "mozm6fu",
          "author": "None",
          "body": "Absolutely. Probably not the best time to buy for most. \n\nBut on the other hand…. ***new Mario Kart***",
          "score": 6,
          "created_utc": 1745596355.0,
          "replies": []
        },
        {
          "id": "moznlsh",
          "author": "FernandoRocker",
          "body": "The price of the hardware is extremely competitive. Most of the complaints are about the software, not the hardware.\n\nWhat's the cheapest Steam Deck price? $400.\n\nFor $450, you get a more powerful Nintendo Switch 2. Better screen (HDR, VRR, 120 Hz), an NVIDIA SoC with DLSS and ray tracing silicon, more storage, removable controllers with built-in mouse sensors, a 4K dock.\n\nThe hardware price is perfectly fine.",
          "score": 17,
          "created_utc": 1745596769.0,
          "replies": [
            {
              "id": "mozot0r",
              "author": "TheBoBiZzLe",
              "body": "And with very very talented people out there… I betcha a switch 2 emulator with roms will be running on a steamdeck within a year.",
              "score": -9,
              "created_utc": 1745597128.0,
              "replies": [
                {
                  "id": "mozp6d8",
                  "author": "FernandoRocker",
                  "body": "You can't emulate a more powerful system on a weaker system. That's not how it works.",
                  "score": 5,
                  "created_utc": 1745597237.0,
                  "replies": [
                    {
                      "id": "mp05tg7",
                      "author": "TheBoBiZzLe",
                      "body": "Frame skips.  Performance hacks.  Custom drivers.    DS, 3DS, gamecube, Wii, wiiu, and yes… switch.  Have all been able to run on very low end devices for years.  Cranking the resolution down to 75%, removing a few graphics extras, turning off extras. \n\nThey didn’t just “happen” to go full force against emulators months before their announcements.  Even buying out some of them.\n\nSo yes…  you can.  Maybe not 100% as intended.  But yeah.  I’d bet money switch2 titles will be playable on a steamdeck within a year of launch. \n\nBut.  consumerism.  So /shrug.  We don’t even really know the chip inside the switch.  Just rumors.  Rumors that are saying it’s power might be around a 2050.  Steamdeck is about a 1050ti.  That’s like a 15% power difference.  If those rumors are true.  Only thing Nintendo has started is their AI enhancement swill create graphics similar to 10times the power of the switch.  Not a huge power increase and if they are relying on AI, not power… that can all be emulated.  \n\nOr not /shrug",
                      "score": -3,
                      "created_utc": 1745602035.0,
                      "replies": [
                        {
                          "id": "mp0bfej",
                          "author": "nonitoni",
                          "body": "Is that relevant in regards to sales though? Most people don't want to go through the setup of emulating modern games. $50 more gets you a game with console and full settings without having to constantly toy with it. It's not like emulation has ever made a significant dent in console sales in the past.",
                          "score": 5,
                          "created_utc": 1745603628.0,
                          "replies": []
                        },
                        {
                          "id": "mp0bb53",
                          "author": "weegee19",
                          "body": "Maybe the early Switch 2 titles. Highly doubtful for the later ones.",
                          "score": 2,
                          "created_utc": 1745603595.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mp02s2w",
                  "author": "weegee19",
                  "body": "Steamdeck 2 might be powerful enough able to run a Switch 2 emulator, fat chance for the current Steamdeck however.",
                  "score": 2,
                  "created_utc": 1745601173.0,
                  "replies": [
                    {
                      "id": "mp0btpz",
                      "author": "TheBoBiZzLe",
                      "body": "Am I missing something?  Do we actually know the hardware?  I went to preorder and checked out the specs… and there was absolutely nothing concrete about the actual power.  \n\nHDR10 support, up to 120hz, maximum of 60fps at 4k, supports 120fps at lower, supports HDR10 AGAIN.  \n\nNothing says Mario Kart will run at 120fps, 120hz.  Just says the system supports it.  \n\n/shrug I’m totally going to buy a year or so down the road.  Just could personally imagine dumping money into a piece of hardware now without actually knowing what’s in it.  Even more making claims about the actual power without even knowing.\n\nBut guess Nintendo already told us that it will be the biggest launch in gaming history,  guess we gotta make it happen :)",
                      "score": -2,
                      "created_utc": 1745603741.0,
                      "replies": [
                        {
                          "id": "mp0ezbl",
                          "author": "weegee19",
                          "body": "Probably because we have multiple corroborating leaks of the hardware, the confirmation of DLSS tells us that it's very much based on the Ampere architecture (same as the RTX 30x0 series). The leaks pointing to a reported performance of 1.7TFLOPs in handheld mode and 3.1 TFLOPs in docked mode, which line up closely enough with what Nvidia said about the Switch 2 being 10x more powerful as well as a display that's a lot more capable than the Steamdeck's. The evidence based on some 3rd-party ports' builds that are as old as two months old now only point to that direction. As much as I criticise Nintendo a lot in recent years, this is one of the only instances where they might have done something right.",
                          "score": 4,
                          "created_utc": 1745604655.0,
                          "replies": [
                            {
                              "id": "mp0oxva",
                              "author": "TheBoBiZzLe",
                              "body": "Hope so!\n\nPicked my laptop up for about $600 and it’s a 3060.  That could crank out some great performance in a handheld.\n\nIt’s just hot.  And the cpu is hot.  Things just don’t seem to be lining up and the one deciding factor of that equation is still unknown.",
                              "score": 1,
                              "created_utc": 1745607606.0,
                              "replies": [
                                {
                                  "id": "mp0t6kr",
                                  "author": "weegee19",
                                  "body": "A 3060 laptop on battery maxes out at like 8TFLOPs, so the Switch 2 being reportedly less than half of that in docked mode means it's hardly far-fetched. Not to mention there's years of customisation put into this too.",
                                  "score": 1,
                                  "created_utc": 1745608895.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mp3xtyv",
                          "author": "StrombergsWetUtopia",
                          "body": "That’s the difference between yourself and the market they have. They’re not buying it based on hardware specs they’re buying it because of the games. Most people don’t know or care about any of that stuff.",
                          "score": 2,
                          "created_utc": 1745651278.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "moznfnr",
      "author": "None",
      "body": "Would love to buy one. Where are they?!",
      "score": 2,
      "created_utc": 1745596719.0,
      "replies": []
    },
    {
      "id": "mozq3p8",
      "author": "VapidRapidRabbit",
      "body": "I wouldn’t be surprised. The Switch was a genius concept. Every website crashed immediately. Target kept emptying people’s carts. Best Buy didn’t even open preorders until half past midnight. Walmart’s site wouldn’t load properly. GameStop had a lot of their stock scalped by bots.",
      "score": 1,
      "created_utc": 1745597510.0,
      "replies": []
    },
    {
      "id": "mozwlfs",
      "author": "realKevinNash",
      "body": "That is unfortunate.",
      "score": 1,
      "created_utc": 1745599410.0,
      "replies": [
        {
          "id": "mp030i7",
          "author": "weegee19",
          "body": "The hardware isn't the issue, a couple of overpriced games are.",
          "score": 1,
          "created_utc": 1745601239.0,
          "replies": [
            {
              "id": "mp05j9e",
              "author": "realKevinNash",
              "body": "I feel I disagree. My initial issue was the console. And I felt it still is. Charging the same amount as a ps5 or XBsX seems insane for a system that apparently will be lesser across the board.",
              "score": -1,
              "created_utc": 1745601954.0,
              "replies": [
                {
                  "id": "mp08iju",
                  "author": "weegee19",
                  "body": "The Steamdeck is at a comparable price range yet it's worse-performing and lacks detachable controllers and a dock. It's a handheld lmao, it's naïve of you if you somehow think a handheld that's about over half as powerful as a Series S, packed with a 1080p120 HDR display and controller with mouse functions should be a lot cheaper. Mobile technology is naturally pricier simply due to how complex and difficult it is to cram powerful enough tech into a much smaller form factor.\n\nEven if the Switch 2 is selling at a profit, it won't be by a decent margin at all.",
                  "score": 8,
                  "created_utc": 1745602803.0,
                  "replies": []
                },
                {
                  "id": "mp0iu2c",
                  "author": "FernandoRocker",
                  "body": "It's a portable.\n\nThe full system is literally the size of a PS5/XSX game case, and that's including a battery and a screen (a VRR, HDR, 120 Hz screen).\n\nThere is only too much you can do in a portable system. Try to run a PS5 with a battery; it would last you 5 minutes and be absurdly big and expensive.\n\nThe Switch 2 is an amazing piece of hardware, specially for $450. You can't find any other hardware with those specs at that price. You just can't.",
                  "score": 5,
                  "created_utc": 1745605795.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mozmdas",
      "author": "alexisnotcool",
      "body": "Just like the Wii u",
      "score": -9,
      "created_utc": 1745596410.0,
      "replies": [
        {
          "id": "mozn0vw",
          "author": "FernandoRocker",
          "body": "The Wii U launched with 900K units. Absolutely nothing like the Wii U.",
          "score": 7,
          "created_utc": 1745596600.0,
          "replies": [
            {
              "id": "moznoz6",
              "author": "objecter12",
              "body": "…and went on to sell 3.5 million in its first quarter on the market.\n\nSwitch 2 has more hype behind it, I’ll give it that, but Nintendo consoles usually sell well at launch.",
              "score": 3,
              "created_utc": 1745596795.0,
              "replies": [
                {
                  "id": "mp07k86",
                  "author": "redsterXVI",
                  "body": "In Japan 2.2 million people joined the Nintendo Store's lottery alone",
                  "score": 3,
                  "created_utc": 1745602532.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "moznme4",
          "author": "gman5852",
          "body": "Literally nobody predicted the WiiU to produce 6 million units for launch.",
          "score": 2,
          "created_utc": 1745596774.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mozo7k3",
      "author": "None",
      "body": "[deleted]",
      "score": -1,
      "created_utc": 1745596950.0,
      "replies": [
        {
          "id": "mozpgsy",
          "author": "sufferpuppet",
          "body": "No company on earth is going to make and warehouse 20 million consoles at launch to make you happy.\n\nI promise you, they like money.  If they could sell more consoles faster, they would.",
          "score": 4,
          "created_utc": 1745597323.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mozpgoh",
      "author": "iamjackstestical",
      "body": "I doubt it'll be bigger than the console wars of the early 2000's.",
      "score": -3,
      "created_utc": 1745597322.0,
      "replies": []
    }
  ]
}