{
  "post": {
    "title": "Microsoft and iFixit now sell official Xbox Series X/S replacement parts for DIY repairs",
    "author": "a_Ninja_b0y",
    "id": "1i23e2m",
    "score": 1097,
    "created_utc": 1736963894.0,
    "selftext": "",
    "num_comments": 24,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i23e2m/microsoft_and_ifixit_now_sell_official_xbox/"
  },
  "comments": [
    {
      "id": "m7b3h1p",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736963895.0,
      "replies": []
    },
    {
      "id": "m7b5e58",
      "author": "4-3-4",
      "body": "I always wondered how they can actually sell parts that is more expensive than the going retail price (https://www.ifixit.com/en-gb/Parts/Xbox\\_Series\\_X\\_2TB\\_Galaxy\\_Black, look at the motherboard)",
      "score": 90,
      "created_utc": 1736964450.0,
      "replies": [
        {
          "id": "m7bci0e",
          "author": "caiusto",
          "body": "Not only is it not subsidized it also adds a profit margin on top of it. If you need to replace the whole motherboard (that has all the components soldered to it) then you may as well get a new one, but the repair option is there I guess.",
          "score": 57,
          "created_utc": 1736966481.0,
          "replies": [
            {
              "id": "m7f22d7",
              "author": "_RADIANTSUN_",
              "body": "The accessibility of the repair itself matters. Even if buying the repair parts new is expensive it might still benefit e.g. salvaging parts and swapping between units is better supported.",
              "score": 19,
              "created_utc": 1737013801.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7blc7i",
          "author": "thekid8it",
          "body": "Holy hot damn that’s a lot of $$ for a Xbox lol. \n\nRegardless I do think this is a good move to offer the other parts. I hope in the US we can get more companies to do the same.",
          "score": 20,
          "created_utc": 1736969005.0,
          "replies": []
        },
        {
          "id": "m7cf8dz",
          "author": "FluffyProphet",
          "body": "Different supply chains and scale. The supply chain to make an Xbox is very optimized, the supply chain to get individual parts to people will have more overhead and the scale of it will be smaller. That adds costs.\n\nPlus consoles have basically no markup.",
          "score": 21,
          "created_utc": 1736977441.0,
          "replies": [
            {
              "id": "m7cvk8c",
              "author": "JabbaDuhNutt",
              "body": "I guarantee you the parts come in a plastic bag and a Very simple box. I bet iFixit is getting the bulk parts just like the factory's receive them. Then iFixit is packaging it for the consumer. For sure some added cost but some of these items a Reza Outrageous.",
              "score": 1,
              "created_utc": 1736982327.0,
              "replies": [
                {
                  "id": "m7f2exr",
                  "author": "_RADIANTSUN_",
                  "body": "It has to be worth doing the extra steps with iFixIt involved otherwise why would they do it (unless compelled I guess)?",
                  "score": 3,
                  "created_utc": 1737014011.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7dv4f7",
              "author": "Butthole__Blaster",
              "body": "I don’t believe that for a second. Could Microsoft be selling the Xbox wholesale to Walmart with next to no markup ? Maybe. But make no mistake, Walmart absolutely does have margin on that item and it’s somewhere between 30-60%",
              "score": -12,
              "created_utc": 1736994363.0,
              "replies": [
                {
                  "id": "m7epqhx",
                  "author": "accidentlife",
                  "body": "A 60% margin is absurd. I’ve heard of restaurants with lower gross margins. \n\nWhere the margins come in for a retailer is selling the games and accessories.",
                  "score": 7,
                  "created_utc": 1737006826.0,
                  "replies": []
                },
                {
                  "id": "m7eyosx",
                  "author": "FluffyProphet",
                  "body": "Retail margins on consoles are around 5% at most, usually a bit lower. Microsoft also takes somewhere between a $100 and $200 hit on each console they make up for with game sales and subscriptions.\n\nThin markups are  common across the retail space on higher priced electronics. I worked in a sort independent Apple Store in high school (wasn’t actually an Apple Store, but it was like an apple authorized retailer that only did apple stuff), and we made $20 on the most expensive macbook in the store, half of that was given as commission. All the profits came from accessories.",
                  "score": 2,
                  "created_utc": 1737011759.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7lf6gk",
          "author": "Savings_Set_8114",
          "body": "WTF!?",
          "score": 1,
          "created_utc": 1737099000.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7dhbnk",
      "author": "Flaky-Gear-1370",
      "body": "I assume this is more a way of trying to skirt right to repair laws, look we offer stuff and nobody bought it (even if it was twice the price of buying a new one)",
      "score": 16,
      "created_utc": 1736989598.0,
      "replies": []
    },
    {
      "id": "m7d4eak",
      "author": "Tren-Frost",
      "body": "Of course they announce this literally the week after I just replaced the fan for my Series X with a third-party model.",
      "score": 7,
      "created_utc": 1736985237.0,
      "replies": [
        {
          "id": "m7lchpm",
          "author": "smackythefrog",
          "body": "Any fan options that are better than OEM, in terms of cooling?",
          "score": 2,
          "created_utc": 1737097398.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7dq70j",
      "author": "Va1crist",
      "body": "Expensive AF and did they actually remove the firmware locking ? Most of that stuff can’t be replaced due to firmware locked",
      "score": 7,
      "created_utc": 1736992639.0,
      "replies": []
    },
    {
      "id": "m7ec83q",
      "author": "InspectionNational66",
      "body": "It is time to make money between 0 and full price. \nThe company must be desperate. They think i must be stupid... I am planning order right now",
      "score": 1,
      "created_utc": 1737000680.0,
      "replies": []
    },
    {
      "id": "m7f4h9z",
      "author": "probsthrowaway2",
      "body": "This is great I ended up needing to replace my bumper had to buy a knock off which is fine but it’s kinda flimsy but it did come with a set of tools to do the job which is a plus if you don’t have that already.",
      "score": 1,
      "created_utc": 1737015250.0,
      "replies": []
    },
    {
      "id": "m7g0w6f",
      "author": "Grandpaw99",
      "body": "Have you completely missed Apple pricing for repair parts for the last forever?",
      "score": 1,
      "created_utc": 1737033211.0,
      "replies": []
    },
    {
      "id": "m7likmt",
      "author": "What-the-Gank",
      "body": "I bet they keep a whole 5 of those in stock nationally",
      "score": 1,
      "created_utc": 1737101125.0,
      "replies": []
    },
    {
      "id": "m7mmiov",
      "author": "Aritra319",
      "body": "This is pretty cool. \nI’ve been having issues with controllers and headset connections being unstable, would replacing the accessory board be a good chance to fix this issue?",
      "score": 1,
      "created_utc": 1737122303.0,
      "replies": []
    },
    {
      "id": "m7vta6p",
      "author": "_throwaway762",
      "body": "Insane what they're selling some of these parts for. I have a series x with a damaged HDMI output that I've been trying to get rid of for months and no one even wants it for salvage",
      "score": 1,
      "created_utc": 1737241838.0,
      "replies": []
    }
  ]
}