{
  "post": {
    "title": "This fast and agile robotic insect could someday aid in mechanical pollination. With a new design, the bug-sized bot was able to fly 100 times longer than prior versions.",
    "author": "Sariel007",
    "id": "1i500bc",
    "score": 741,
    "created_utc": 1737298015.0,
    "selftext": "",
    "num_comments": 92,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i500bc/this_fast_and_agile_robotic_insect_could_someday/"
  },
  "comments": [
    {
      "id": "m7zlu4d",
      "author": "remadenew2017",
      "body": "Now hear me out. This might sound weird, but what if we used an organic bug to do the same thing. Something that could buzz from one plant to the other to pollinate. Maybe I'm nuts.",
      "score": 247,
      "created_utc": 1737298759.0,
      "replies": [
        {
          "id": "m7zw1u1",
          "author": "zippedydoodahdey",
          "body": "Big Ag can’t poison the robot insects and make them go extinct as they’re doing to the organic bees.",
          "score": 73,
          "created_utc": 1737301866.0,
          "replies": [
            {
              "id": "m8058n6",
              "author": "SillyFlyGuy",
              "body": "Propaganda coming soon: \"Organic bees are closely related to known disease caring insects such as house flies and mosquitoes. Request fruits and vegetables pollinated by safe, clean, medical grade aiBeez™ from AgroMegaCorp.\"",
              "score": 44,
              "created_utc": 1737304493.0,
              "replies": [
                {
                  "id": "m80baco",
                  "author": "HiFiGuy197",
                  "body": "We could make a honey replacement from pure, natural corn syrup.",
                  "score": 17,
                  "created_utc": 1737306191.0,
                  "replies": [
                    {
                      "id": "m80zanz",
                      "author": "FloRidinLawn",
                      "body": "I hate reading this. I just got into tea and using honey to sweeten instead of kcup coffee and processed sugars!",
                      "score": 10,
                      "created_utc": 1737312902.0,
                      "replies": [
                        {
                          "id": "m838q99",
                          "author": "None",
                          "body": "So have a bunch of other health sheep (not a bad thing to bleep about) following tiktok/YouTube and there's goes the bees.",
                          "score": 1,
                          "created_utc": 1737337448.0,
                          "replies": [
                            {
                              "id": "m863x0d",
                              "author": "Lake_Erie_Monster",
                              "body": "It's actually an interesting phenomenon. Some new trends are pushed on social media and a whole host of products crop up (I'm sure by design), a few months later it ends up in landfill and we move on to a new trend.",
                              "score": 2,
                              "created_utc": 1737385547.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m83mo3d",
                  "author": "zippedydoodahdey",
                  "body": "Srly probable and hugely sickening.",
                  "score": 2,
                  "created_utc": 1737342158.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m80fcfd",
              "author": "Maxmilliano_Rivera",
              "body": "People are saying bees already exist, but in another sense the conditions pollinator bees goes through for agricultural pollination of crops like almonds are extremely rough and this could alleviate that. \n\nNot to mention most of the worlds crucial pollination happens by solitary bees",
              "score": 8,
              "created_utc": 1737307337.0,
              "replies": [
                {
                  "id": "m85ifer",
                  "author": "ManiacalDane",
                  "body": "The issue here is monoculture agricultural practices, though. Which is also the reason behind the need for absurd volumes of fertilizer and pesticides.\nIt's fucking stupid.",
                  "score": 2,
                  "created_utc": 1737377635.0,
                  "replies": []
                },
                {
                  "id": "m822ebk",
                  "author": "Ludwigofthepotatoppl",
                  "body": "Yes. Honeybees are at basically no risk—they’re livestock. There are probably more than a trillion domestic honeybees in the world. \n\nWild bees are in danger.",
                  "score": -1,
                  "created_utc": 1737324096.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m83kif5",
              "author": "yarash",
              "body": "Or use them to inspect the crops of nearby farms to make sure they're not using any proprietary seeds without paying for them. Then poison them. \n\nThis could have an upside for humanity, but wont be used for that.",
              "score": 2,
              "created_utc": 1737341394.0,
              "replies": []
            },
            {
              "id": "m80pan1",
              "author": "elderly_millenial",
              "body": "Colony collapse disorder is real, and it’s not just because of insecticide",
              "score": 2,
              "created_utc": 1737310108.0,
              "replies": [
                {
                  "id": "m83n1r6",
                  "author": "zippedydoodahdey",
                  "body": "Lol, like its not tied into it.",
                  "score": 1,
                  "created_utc": 1737342295.0,
                  "replies": [
                    {
                      "id": "m83nwno",
                      "author": "elderly_millenial",
                      "body": "Not at all, but it’s missing a big part of the picture that’s lost in the cynicism of online doom scrolling. Disease and parasites are a major concern, and there are some unknown causes we still can’t figure out",
                      "score": 0,
                      "created_utc": 1737342616.0,
                      "replies": [
                        {
                          "id": "m8ciecf",
                          "author": "zippedydoodahdey",
                          "body": "Like…nicotinoids? Still very legal to use in the US.",
                          "score": 0,
                          "created_utc": 1737467420.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7zre10",
          "author": "267aa37673a9fa659490",
          "body": "The article says they are for agriculture in indoor multilevel warehouses.",
          "score": 11,
          "created_utc": 1737300480.0,
          "replies": [
            {
              "id": "m7zsfpl",
              "author": "zernoc56",
              "body": "Pollinators can be kept indoors as well. A single beehive can probably work that entire warehouse. And I doubt that these robotic bugs’ charging stations would be as compact as a normal hive box for the same number of drones.",
              "score": 19,
              "created_utc": 1737300798.0,
              "replies": [
                {
                  "id": "m7zwua0",
                  "author": "cat_prophecy",
                  "body": "This is all true. But the thing you're not considering is that there are limited ways for tech bros and Wall Street scumbags to speculate on bee hive tech and make shit loads of money shilling unnecessary technology.",
                  "score": 23,
                  "created_utc": 1737302092.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7zsodt",
              "author": "Sariel007",
              "body": "You can't expect people the read the article and make an informed comment when they can just make a throway joke comment!",
              "score": -1,
              "created_utc": 1737300871.0,
              "replies": [
                {
                  "id": "m81uu80",
                  "author": "PizzaQuest420",
                  "body": "If I understand this article, this new robot can fly (while connected to power and commands) for about 17 minutes before the parts degrade too much for precision flight. It could carry batteries and sensors, but that would shorten the lifespan. The material science and precision engineering is still incredible, it's very cool. \n\nHowever, bees can fly for a few hours a day for 5-6 weeks with a full suite of sensors tuned for pollination, can self-replicate, are biodegradable, don't have to be plugged in or carry batteries, and create useful by-products such as honey and wax. They only need plants and clean water to function.\n\nThis bot is a big leap in material engineering and micro robotics, but a serious bee replacement is over the horizon, and the vertical farming model it's supposedly intended for has yet to become worth the energy costs (forgetting the fact that bees can work in vertical farms anyway because they can fly *up*).",
                  "score": 10,
                  "created_utc": 1737321914.0,
                  "replies": [
                    {
                      "id": "m82bcif",
                      "author": "MINECRAFT_BIOLOGIST",
                      "body": "This is true, but these are meant to be used in large vertical multi-floor climate-controlled indoor farms that can grow things year-round under very specific conditions. I think most people would agree that vertical farms are a potential solution to our overuse of arable land and the issue of deforestation to create more farmland.\n\nSo moving onto bees, wouldn't there be quite a few issues with maintaining a colony of living bees in a vertical farm?\n\n* The one that comes to mind first would simply be that a vertical farm would need to somehow train bees to fly up and down the farm through specific channels to consistently reach pollen. I say \"train\" because this does not seem like natural behavior—most trees are far shorter than such a building and I'm not sure how well bees communicate verticality with their \"[dances](https://en.wikipedia.org/wiki/Waggle_dance)\".\n\n* Also, they'd need to rotate crops to always have flowering crops so that the bees are fed.\n\n* Then they'd need a supply chain to feed bees when there aren't any flowers, unless you want the bees to die and require replacing. Saying \"They only need plants and clean water to function.\" seems extremely reductive for the amount of effort beekeeping requires.\n\n* Bees might also get into equipment and other spaces, requiring more maintenance. It would be difficult to get them all out so they didn't interfere with harvesting equipment.\n\nI'm sure people more experienced in beekeeping and engineering would have a far larger list of issues that would arise in using bees instead of robots, this is just what came to mind quickly.\n\nNow, just to clarify, I'm all for sustainable solutions and I do agree that we should use sustainable solutions instead of trying to supplant everything with (speculative) technology. But I also don't think it's a good idea to blindly ignore the potential downsides or even benefits of new technology simply because it seems like a waste instinctively.",
                      "score": 1,
                      "created_utc": 1737326733.0,
                      "replies": [
                        {
                          "id": "m82pcr4",
                          "author": "PizzaQuest420",
                          "body": "valid points there, i was more presenting bees as if they were a type of robot and comparing them to the robot in the article- if bees were robots they'd be shockingly ahead of our own material engineering, manufacturing and robotics capabilities. our best robot now flew for 17 minutes max, tethered, and that's all it did- fly.\n\nrobot pollinators as a concept are especially interesting to me in space station/ship/colony applications, where relying on bees in an untested environment without a backup seems extremely risky (if they even need pollinators at that point). \n\ni love the robotics research, i just don't think it's a wiser choice for pollination here on earth anywhere that bees can live. \n\n* there are bees that move up and down mountains, tagging space vertically isn't a huge challenge for them. \n\n* the bees wouldn't live inside, beekeepers would bring them in to pollinate during the appropriate timeframes. this is already a common practice for outdoor crops.\n\n* bee corpses are probably less damaging to food and equipment than plastic and metal robots, which would inevitably break on site.",
                          "score": 2,
                          "created_utc": 1737331194.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m81xrqq",
                      "author": "Sariel007",
                      "body": "Someone read the article! \n\nThat being said I doubt farming bees in a warehouse is viable. I could be wrong though",
                      "score": -2,
                      "created_utc": 1737322749.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m81scxu",
          "author": "Fishtoart",
          "body": "That’s pretty sweet idea.",
          "score": 2,
          "created_utc": 1737321219.0,
          "replies": []
        },
        {
          "id": "m7zq0ne",
          "author": "youshouldn-ofdunthat",
          "body": "You're insane. Like how would this even be possible? Like nature or something? Omg 🤪\n/S",
          "score": 5,
          "created_utc": 1737300063.0,
          "replies": [
            {
              "id": "m80x4af",
              "author": "Smartnership",
              "body": "Nature famously mimicks our technology.\n\nIt cheats off our homework.  \n\n Just like Kevin.",
              "score": 4,
              "created_utc": 1737312293.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m810nyi",
          "author": "Radiant_Beyond8471",
          "body": "They are killing the bees. The bees are dying. It's why they are coming up with this stuff instead of helping the bees. So sad.",
          "score": 1,
          "created_utc": 1737313288.0,
          "replies": []
        },
        {
          "id": "m819emu",
          "author": "ki11bunny",
          "body": "What if we used one that can do all that and make a by product I'm going to call honey.",
          "score": 1,
          "created_utc": 1737315786.0,
          "replies": []
        },
        {
          "id": "m81pvbr",
          "author": "StormblessedFool",
          "body": "The guys making the robot bugs aren't the guys killing the real bugs.",
          "score": 1,
          "created_utc": 1737320516.0,
          "replies": []
        },
        {
          "id": "m82bym0",
          "author": "stempoweredu",
          "body": "Because there are certain plants that can no longer be pollinated effectively as we have driven the insects that do so to extinction.\n\nSuch as the Vanilla plant.  It must be manually pollinated for production because the only remaining pollinators are a small group of bees that have only a 1% success rate.",
          "score": 1,
          "created_utc": 1737326910.0,
          "replies": []
        },
        {
          "id": "m83h45a",
          "author": "Hour_Recognition_923",
          "body": "Why let nature do something when we could involve electricity? Just waiting for toilet paper to become electric, and something you have to subscribe to.",
          "score": 1,
          "created_utc": 1737340277.0,
          "replies": []
        },
        {
          "id": "m83wb95",
          "author": "AquaWitch0715",
          "body": "... and not kill it.\n\nI would think that it being beneficial, we could all agree on that lol.",
          "score": 1,
          "created_utc": 1737345928.0,
          "replies": []
        },
        {
          "id": "m802ytn",
          "author": "Intelligent_Bug_5881",
          "body": "That would be great!\n\nThe climate (literal and political) situation that sustains those organic bugs is decidedly not great.",
          "score": 1,
          "created_utc": 1737303848.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7zsegl",
      "author": "texassadist",
      "body": "I’ve seen this black mirror episode",
      "score": 76,
      "created_utc": 1737300788.0,
      "replies": [
        {
          "id": "m80sxvl",
          "author": "ZephyrSK",
          "body": "My first thought as well",
          "score": 9,
          "created_utc": 1737311123.0,
          "replies": []
        },
        {
          "id": "m83px3a",
          "author": "smackinmuhkraken",
          "body": "I remember reading somewhere that the creator hadn't made any new episode because reality was getting worse than the show.\n\n\nNot sure if its true. But it fucking feels like it is.",
          "score": 2,
          "created_utc": 1737343383.0,
          "replies": [
            {
              "id": "m84se5e",
              "author": "lowtoiletsitter",
              "body": "For a little bit yeah. He's writing episodes again",
              "score": 2,
              "created_utc": 1737362439.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7zryja",
      "author": "None",
      "body": "[removed]",
      "score": 45,
      "created_utc": 1737300655.0,
      "replies": [
        {
          "id": "m80q5cw",
          "author": "RedHal",
          "body": "https://youtu.be/IpCfEwQJ9Xo",
          "score": 3,
          "created_utc": 1737310345.0,
          "replies": [
            {
              "id": "m824a7u",
              "author": "MagicPigeonToes",
              "body": "CEOs wouldn’t like this",
              "score": 1,
              "created_utc": 1737324645.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m82kh14",
          "author": "Nelsifino",
          "body": "Just like the Hunter- seekers in dune!",
          "score": 3,
          "created_utc": 1737329576.0,
          "replies": []
        },
        {
          "id": "m809569",
          "author": "None",
          "body": "[removed]",
          "score": -12,
          "created_utc": 1737305585.0,
          "replies": [
            {
              "id": "m80d5eg",
              "author": "None",
              "body": "[removed]",
              "score": 6,
              "created_utc": 1737306716.0,
              "replies": [
                {
                  "id": "m80fsxa",
                  "author": "tje210",
                  "body": "And if that's 80%, the other 20% is porn.",
                  "score": 4,
                  "created_utc": 1737307466.0,
                  "replies": [
                    {
                      "id": "m83dpoi",
                      "author": "TryingToBeReallyCool",
                      "body": "Look, just call me when we have sex drone strikes. I'll give you all the moneys",
                      "score": 2,
                      "created_utc": 1737339126.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7zkle8",
      "author": "wicktus",
      "body": "It's impressive but also terrifying to imagine a future where we'd need those.",
      "score": 15,
      "created_utc": 1737298364.0,
      "replies": [
        {
          "id": "m81i7s6",
          "author": "seeingeyegod",
          "body": "Every new device that comes out nowdays is equally intriguing and terrifying",
          "score": 2,
          "created_utc": 1737318358.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7zlqno",
      "author": "RaisinSagBag",
      "body": "One step closer to Blade Runner protein farms.",
      "score": 6,
      "created_utc": 1737298729.0,
      "replies": [
        {
          "id": "m81i5by",
          "author": "ChillAMinute",
          "body": "And Soylent Green - it’s food!",
          "score": 1,
          "created_utc": 1737318339.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7zlvvi",
      "author": "Less-Dragonfruit-294",
      "body": "Rather than fix our environment to save species like bees we’d rather pillage it and bring it the brink of mass extinction that we MUST design a robot to do the same damn role. We deserve to burn out to allow a new species a chance to fix our deliberate disasters",
      "score": 20,
      "created_utc": 1737298775.0,
      "replies": [
        {
          "id": "m80a8s8",
          "author": "1Amendment4Sale",
          "body": "Safe to assume it’s the MIC driving this. Easier to mass produce for wartime and domestic surveillance if the infrastructure for civilian use is in place. \n\nSo to address your point, maybe it’s not necessary to destroy humanity but rather reign in the MIC/intelligence community, heavily regulate Silicon Valley, and return to international arms treaties. \n\nAnd if that can’t be done, well maybe Pol Pot was onto something…",
          "score": 2,
          "created_utc": 1737305898.0,
          "replies": [
            {
              "id": "m80mc3u",
              "author": "YourFreshConnect",
              "body": "No one should ever state or even insinuate that Pol Pot had any good ideas. He was an idiot and destroyed his nation while causing the death of 25% of its population. Fuck that guy and everything he ever did or stood for. \n\nThere is not a punishment severe enough for him and the only reason he should ever be remembered is for exactly what not to do as a society.\n\nIf you do not know what he did I suggest you watch the film on Netflix, First they killed my father (film of a non-fiction book written by a survivor).",
              "score": 0,
              "created_utc": 1737309286.0,
              "replies": [
                {
                  "id": "m81iedr",
                  "author": "1Amendment4Sale",
                  "body": "Obviously, it was a tongue in cheek joke which seems to have distracted from the main point of my comment.",
                  "score": 3,
                  "created_utc": 1737318410.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m80k889",
          "author": "Sawses",
          "body": "From a species survival standpoint, I do wonder if climate change will eventually end up being our savior. A slow, gradual change to a more inhospitable world is incentivizing us to come up with ways to survive and thrive in less hospitable conditions. Sure, that's a bad thing in a lot of ways...but it means that we might well develop the technology to build self-sustaining environments both here on Earth and elsewhere, when otherwise we might never have.\n\nOne could argue it's not worth destroying an entire biosphere (not that we're capable of *that* level of destruction quite yet), but humanity is going to have to figure out how to handle an artificial ecosystem if we're going to do anything other than live and die here.",
          "score": -1,
          "created_utc": 1737308706.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7zuzcz",
      "author": "None",
      "body": "Have we tried maybe SAVING the fucking bees?",
      "score": 5,
      "created_utc": 1737301550.0,
      "replies": []
    },
    {
      "id": "m82em33",
      "author": "monza_m_murcatto",
      "body": "How about we humans stop killing everything in the name of growth?",
      "score": 3,
      "created_utc": 1737327714.0,
      "replies": [
        {
          "id": "m86pg8z",
          "author": "geddy",
          "body": "Stopping the killing of 100 billion land animals for food each year would be a hell of a good start.",
          "score": 2,
          "created_utc": 1737391738.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m832he2",
      "author": "Wow_thats_odd",
      "body": "As cool as this may be, i feel as if there was a better way.",
      "score": 3,
      "created_utc": 1737335374.0,
      "replies": [
        {
          "id": "m83bzta",
          "author": "Coffeeffex",
          "body": "Let’s just save the bees instead.",
          "score": 2,
          "created_utc": 1737338545.0,
          "replies": []
        },
        {
          "id": "m84kcja",
          "author": "braxin23",
          "body": "Maybe, there are other species of pollinators other than bees they’re just the ones humanity has the most experience handling.",
          "score": 1,
          "created_utc": 1737357599.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m83vd1r",
      "author": "Agreeable-Ad3644",
      "body": "Kill a techbro, save the bees.",
      "score": 3,
      "created_utc": 1737345538.0,
      "replies": []
    },
    {
      "id": "m812lsi",
      "author": "Ckmyers",
      "body": "Or we could just stop killing bugs?",
      "score": 2,
      "created_utc": 1737313839.0,
      "replies": []
    },
    {
      "id": "m81oxef",
      "author": "enakj",
      "body": "Maybe we could also save the bees 🐝",
      "score": 2,
      "created_utc": 1737320249.0,
      "replies": []
    },
    {
      "id": "m821hea",
      "author": "AllHailTheWinslow",
      "body": "I liked that Black Mirror episode.",
      "score": 2,
      "created_utc": 1737323826.0,
      "replies": []
    },
    {
      "id": "m7zozak",
      "author": "NATScurlyW2",
      "body": "Didn’t ghengis khan conquer cities by lighting birds on fire and they flew into the cities burning them to the ground?",
      "score": 2,
      "created_utc": 1737299747.0,
      "replies": [
        {
          "id": "m8061yi",
          "author": "trenchcoatracoon",
          "body": "Metal AF",
          "score": 1,
          "created_utc": 1737304721.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7zqus2",
      "author": "VivaNOLA",
      "body": "Feels fairly useless until it can be powered without a wire.",
      "score": 1,
      "created_utc": 1737300318.0,
      "replies": []
    },
    {
      "id": "m7zvsa9",
      "author": "Sabreromeo",
      "body": "Does nobody watch Black Mirror?!?!",
      "score": 1,
      "created_utc": 1737301788.0,
      "replies": []
    },
    {
      "id": "m802dz5",
      "author": "PorbyUK",
      "body": "Hated in the nation , black mirror",
      "score": 1,
      "created_utc": 1737303679.0,
      "replies": []
    },
    {
      "id": "m80f64n",
      "author": "srathnal",
      "body": "Who needs bees, when we can kill them all with pesticide and then monetize food pollination?",
      "score": 1,
      "created_utc": 1737307287.0,
      "replies": []
    },
    {
      "id": "m80n550",
      "author": "None",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1737309509.0,
      "replies": []
    },
    {
      "id": "m81pwas",
      "author": "wxsm0",
      "body": "Black mirror",
      "score": 1,
      "created_utc": 1737320523.0,
      "replies": []
    },
    {
      "id": "m81rp2f",
      "author": "Fishtoart",
      "body": "It’s hilarious that they measurement they chose to compare these robotic bugs to is the size of a microcassette. I don’t think I’ve seen a microcassette in the last 20 years.",
      "score": 1,
      "created_utc": 1737321031.0,
      "replies": []
    },
    {
      "id": "m81wo4i",
      "author": "DeadFyre",
      "body": "We don't need mechanical pollination. Bees work just fine.",
      "score": 1,
      "created_utc": 1737322434.0,
      "replies": []
    },
    {
      "id": "m82h6ub",
      "author": "Accurate_Return_5521",
      "body": "This is fucking frightening and I don’t use bad words often. But holy shit \n\nIf I’m reading this correctly we are preparing for a world without bees. Only humans if anything at all I rather don’t live in that world",
      "score": 1,
      "created_utc": 1737328509.0,
      "replies": []
    },
    {
      "id": "m83j187",
      "author": "ragnarok62",
      "body": "*Black Mirror*, here we come with the hit-insects.",
      "score": 1,
      "created_utc": 1737340888.0,
      "replies": []
    },
    {
      "id": "m83y0ol",
      "author": "govanfats",
      "body": "Wasn’t there a Black Mirror episode about this?",
      "score": 1,
      "created_utc": 1737346647.0,
      "replies": []
    },
    {
      "id": "m84ghl4",
      "author": "antonymy",
      "body": "I feel like I read a Michael Crichton novel about this 30 years ago.",
      "score": 1,
      "created_utc": 1737355447.0,
      "replies": []
    },
    {
      "id": "m85i7w3",
      "author": "ManiacalDane",
      "body": "This is so fucking dystopian",
      "score": 1,
      "created_utc": 1737377545.0,
      "replies": []
    },
    {
      "id": "m88vgk7",
      "author": "markingterritory",
      "body": "#BlackMirror",
      "score": 1,
      "created_utc": 1737412826.0,
      "replies": []
    },
    {
      "id": "m89ktb6",
      "author": "MonsterReprobate",
      "body": "Black Mirror",
      "score": 1,
      "created_utc": 1737420646.0,
      "replies": []
    },
    {
      "id": "m8dil97",
      "author": "ScientistArtistic917",
      "body": "Great",
      "score": 1,
      "created_utc": 1737478419.0,
      "replies": []
    },
    {
      "id": "m8diw32",
      "author": "ScientistArtistic917",
      "body": "Can't we just live in better harmony with nature?",
      "score": 1,
      "created_utc": 1737478501.0,
      "replies": []
    },
    {
      "id": "m7zqqmc",
      "author": "roadsterdoc",
      "body": "And how does it affect the animals that eat insects for food?",
      "score": 1,
      "created_utc": 1737300282.0,
      "replies": [
        {
          "id": "m7zt28c",
          "author": "Sariel007",
          "body": "Well, if the animals that eat insects get into the indoor multilevel warehouse where the polinating robots are used the staff will catch the animals and release them back outside where they belong and there are plenty of insect for them to eat.\n\nLol downvoted for not playing along with idiot that didn't read article and providing actual factual answers. Never change reddit.",
          "score": -1,
          "created_utc": 1737300986.0,
          "replies": []
        }
      ]
    }
  ]
}