{
  "post": {
    "title": "Apple Is Reportedly Thinking About Making Its Own TV Again",
    "author": "a_Ninja_b0y",
    "id": "1gubh8m",
    "score": 910,
    "created_utc": 1731953975.0,
    "selftext": "",
    "num_comments": 324,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gubh8m/apple_is_reportedly_thinking_about_making_its_own/"
  },
  "comments": [
    {
      "id": "lxsln7f",
      "author": "hurricane4689",
      "body": "Why? The TV market is completely saturated and there cant be enough market share to make any profit.",
      "score": 608,
      "created_utc": 1731954234.0,
      "replies": [
        {
          "id": "lxsm9qw",
          "author": "ponziacs",
          "body": "Article says may revisit the idea which sounds like they aren't even wanting to do it right now.",
          "score": 176,
          "created_utc": 1731954422.0,
          "replies": [
            {
              "id": "lxstfs8",
              "author": "ca2mt",
              "body": "Concept of a plan, if you will.",
              "score": 159,
              "created_utc": 1731956572.0,
              "replies": [
                {
                  "id": "lxta7jy",
                  "author": "ZAlternates",
                  "body": "All the rage these days.",
                  "score": 31,
                  "created_utc": 1731961667.0,
                  "replies": [
                    {
                      "id": "lxvjzj8",
                      "author": "nbennett23",
                      "body": "Hey guys, \nCheck this idea out!",
                      "score": 0,
                      "created_utc": 1731989532.0,
                      "replies": []
                    },
                    {
                      "id": "lxtg6pe",
                      "author": "Wolfy-615",
                      "body": "![gif](giphy|1juqqCuxkjjLpGRYxW)",
                      "score": -25,
                      "created_utc": 1731963472.0,
                      "replies": [
                        {
                          "id": "lxve2lp",
                          "author": "SolarSailor46",
                          "body": "![gif](giphy|Mhwkr651ANpjJY3xNt|downsized)",
                          "score": 7,
                          "created_utc": 1731987185.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxwigeo",
                  "author": "blastradii",
                  "body": "Concept of a will, if you plan",
                  "score": 1,
                  "created_utc": 1732008943.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxwap7x",
              "author": "Irrelevantitis",
              "body": "That’s what’s fun about tech journalism, you can go anywhere with it as long as you qualify it as a possibility. Apple MAY get into prescription cold medicine, next-gen horseshoes, and vibrating remote control butt plugs. Anything’s possible, and you can’t prove me categorically wrong if all I said is that it MIGHT happen.",
              "score": 6,
              "created_utc": 1732003699.0,
              "replies": [
                {
                  "id": "lxz715a",
                  "author": "kebaball",
                  "body": "That’s just absurd. Apple works on lots of things and it’s legitimate to write about their possible work on horseshoe activated vibrating butt plugs that cure the common cold.",
                  "score": 3,
                  "created_utc": 1732044883.0,
                  "replies": []
                },
                {
                  "id": "lxwxt2v",
                  "author": "Djghost1133",
                  "body": "All journalism really",
                  "score": 1,
                  "created_utc": 1732018104.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxste5y",
          "author": "None",
          "body": "[deleted]",
          "score": 60,
          "created_utc": 1731956558.0,
          "replies": [
            {
              "id": "lxt8roq",
              "author": "audigex",
              "body": "Yeah it might make sense if they’re selling a TV which is akin to a video editing monitor - those ones that are like $20k and perfectly calibrated",
              "score": 13,
              "created_utc": 1731961228.0,
              "replies": [
                {
                  "id": "lxtauaj",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1731961860.0,
                  "replies": [
                    {
                      "id": "lxtn5lp",
                      "author": "Snipedzoi",
                      "body": "HAHAHAHAHAHA APPLE CHEAP?",
                      "score": -5,
                      "created_utc": 1731965577.0,
                      "replies": [
                        {
                          "id": "lxtxex5",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 6,
                          "created_utc": 1731968765.0,
                          "replies": [
                            {
                              "id": "lxupv9v",
                              "author": "PocketNicks",
                              "body": "I agree, Apple could easily sell an expensive TV, but I agree with the person you replied to, they don't do cheap.",
                              "score": 4,
                              "created_utc": 1731978531.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lxvjktt",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -1,
                          "created_utc": 1731989361.0,
                          "replies": [
                            {
                              "id": "lxx30hi",
                              "author": "Tifoso89",
                              "body": "Their base models are still high-end. There are also low-range and mid-range phones, and Apple doesn't make those. This is why they have 20% of the market",
                              "score": 1,
                              "created_utc": 1732020512.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxvjzdk",
              "author": "Dood567",
              "body": "I'd like to say that the reference monitor market already has a lot of strong competitors including Sony. The display pro or whatever they called it is about as close as apple will probably get to a screen dedicated to accuracy",
              "score": 1,
              "created_utc": 1731989530.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxu4ayw",
          "author": "Zozorrr",
          "body": "Because Apple wants to firther confuse consumers as to what AppleTV, AppleTV plus, plus an Apple TV are. \n\nCan’t believe they still haven’t sorted out this branding fiasco.",
          "score": 31,
          "created_utc": 1731971022.0,
          "replies": [
            {
              "id": "lxw5ngg",
              "author": "HahaMin",
              "body": "Apple Vision, a new evolution of television.\n\n\nNot to be confused with Apple TV or Apple Vision Pro.",
              "score": 13,
              "created_utc": 1732000505.0,
              "replies": [
                {
                  "id": "lxxe0ee",
                  "author": "SmurphsLaw",
                  "body": "They could go the Microsoft route and call it Apple One.",
                  "score": 2,
                  "created_utc": 1732024818.0,
                  "replies": [
                    {
                      "id": "lxxjv7k",
                      "author": "joselrl",
                      "body": "Of course, so they compete with Google One - Wait no... not related at all",
                      "score": 2,
                      "created_utc": 1732026912.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lxspxmx",
          "author": "None",
          "body": "[removed]",
          "score": 27,
          "created_utc": 1731955526.0,
          "replies": [
            {
              "id": "lxt0c93",
              "author": "TapTapTapTapTapTaps",
              "body": "They should be building a meta glasses competitor and they shouldn’t have done vr at all",
              "score": 5,
              "created_utc": 1731958649.0,
              "replies": [
                {
                  "id": "lxt83tj",
                  "author": "None",
                  "body": "I would just drop VR entirely because the vast amount of consumers cannot be convinced to wear a computer on their face, it's just a bad idea at it's core. An immersive game is about the coding, not the display. AR glasses might make sense someday, but most people don't want to wear glasses all the time either.",
                  "score": 5,
                  "created_utc": 1731961022.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxt689d",
              "author": "lkn240",
              "body": "The one thing that miserably failed was home 3D TVs.",
              "score": 2,
              "created_utc": 1731960441.0,
              "replies": []
            },
            {
              "id": "lxtya3o",
              "author": "vibrance9460",
              "body": "Tim said many times in the past publicly he absolutely hates VR. It goes against the humanistic company ideal – bringing people closer together through technology. \n\nIt was Apple’s stated goal five years ago to create beautiful stylish glasses that will replace everything in your pocket – your wallet, your keys, your money, and your music. \n\nYes he relented and created and promoted VR headgear as a means of refining the technology. But that was never the goal. From it, Apple created amazing eye tracking and a very stable OS. You can be certain they’re working hard to solve the lens technology which is the major stumbling block going forward. And minimizing the power supply. It might be five years yet to perfect. No one knows. \n\nYes it seems META beat Apple to market. Wrong. META created something goofy which only sort of works in its recent glasses reveal. Nobody will buy them if they do release. \n\nApple is never first to market with anything. Not the iPhone, the iPod, Apple TV, iPad or Apple Watch. They wait until their technology is refined to be best in market until they release anything- after assessing for sure they are doing it better than anyone.\n\nPeople said Apple was stupid for making the Apple Watch. The watch was a crucial step forward in the technology in that it basically took an iPhone, minimized it, and made it do everything the iPhone could do right on your wrist. Apple glasses will do exactly the same thing– minimize and push the technology further forward.\n\nPeople look at what Apple says and think they know what the company is doing. As someone who worked there for 18 years people have no idea of the long-term plans. And there’s always a long-term plan – whether it’s for the car, VR etc.",
              "score": 0,
              "created_utc": 1731969044.0,
              "replies": [
                {
                  "id": "lxw22uv",
                  "author": "Mastershima",
                  "body": "> They wait wait until their technology is refined to be the best in the market until they release anything\n\nNah dawg. Hard disagree. Products like the home pod and Siri are prime examples of unrefined garbage. Magic mouse with the usb underneath? Butterfly keyboard?",
                  "score": 2,
                  "created_utc": 1731998384.0,
                  "replies": [
                    {
                      "id": "lxxyewb",
                      "author": "notjordansime",
                      "body": "I used to hate the Apple mouse but after using one for a bit I’m sold. If you let it die and have to wait to charge it like an idiot, that’s on you. The battery lasts like a month on a single charge and it’ll nag you for a week before you actually need to plug it in. If you intentionally dismiss a week’s worth of low battery warnings and act like the surprised pikachu meme when your mouse dies, that’s on you. Worst case scenario? You plug it in for 5 minutes and have a full day’s charge. \n\nThe port on the bottom is actually kinda smart. First and foremost, it prevents overcharging. Lithium batteries hate being plugged in all the time. If you do that, it’ll degrade faster (happened to me with a razer mouse, after 2 years of being mostly plugged in, the battery wouldn’t even last an hour. Razer immediately asked me if I leave it plugged in all the time when I got a warranty replacement. Made me realize Apple is actually playing 4D chess here). It also serves their brand image by not allowing you to have the appearance of wired hardware.\n\nSiri sucks, but as someone else mentioned, there’s a reason for that and it involves your data. At least it’s not like Google assistant where it *used* to be good, then sometime around ~2022 it just went to absolute digshit. Like basic requests about media playback and smart home lighting stopped working reliably. Now, they’ve gutted the assistant and half replaced it with an AI powered version called Gemini. At least Siri didn’t get lobotomized and then have an identity crisis. Siri has always been…… *Siri*.",
                      "score": 3,
                      "created_utc": 1732031600.0,
                      "replies": []
                    },
                    {
                      "id": "lxwd726",
                      "author": "vibrance9460",
                      "body": "Siri has always lagged behind because unlike every other tech company- Apple does not harvest user data to feed its algorithms. Google and Amazon are feeding theirs *mountains* of your data. \n\nHave ever heard the full-size HomePod?? If you can find a better sounding smart speaker at that price point I’d be very surprised.\n\nThe butterfly keyboard was a mistake. Apple does make them occasionally, admits it and then rectifies. Like removing ports from their laptops. \n\nIt’s reported that the Magic Mouse plugs in underneath so people won’t keep it plugged in, giving the appearance of a wired mouse. A wired mouse is not “magic”. For my use I feel there is no better mouse on the market. But I am not a gamer.",
                      "score": 1,
                      "created_utc": 1732005372.0,
                      "replies": [
                        {
                          "id": "lxyd0ea",
                          "author": "tedivertire",
                          "body": "You may not be a gamer but you are an Apple evangelist.\n\nI hope the position pays.",
                          "score": 1,
                          "created_utc": 1732035976.0,
                          "replies": [
                            {
                              "id": "lxyefko",
                              "author": "vibrance9460",
                              "body": "Eh you’re probably a PC user, and gamer. \n\nCan you refute any of that?",
                              "score": 1,
                              "created_utc": 1732036400.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lxsvzt5",
          "author": "_gordonbleu",
          "body": "I would pay ~1000 dollars for a 4k TV with Apple TV integrated, doesn’t even have to be OLED or anything fancy. I’m tired of all the smart tvs that are absolute shit after a few years because the software is dogshit. LG’s webOS is probably the best and even then it’s mediocre. There are zero smart TVs with decent software after 2 years. Apple TV is a solid platform that gets updated and stays quick enough/not laggy year over year. Mine is 3 years old and doing fine, I’m sure there are many older that are doing fine. All the android fanatics like to shit on Apple but if there’s one thing they can do is build a platform that, while possibly missing some features, will operate year over year without massively slowing down or outright becoming unusable. Roku is the worst example.",
          "score": 23,
          "created_utc": 1731957339.0,
          "replies": [
            {
              "id": "lxsy5u7",
              "author": "None",
              "body": "What advantage is there over just buying any TV, never connecting it to the internet, and plugging in an Apple TV box that you can replace and upgrade over the life of the TV?",
              "score": 27,
              "created_utc": 1731957991.0,
              "replies": [
                {
                  "id": "lxt1wtb",
                  "author": "Tasty-Traffic-680",
                  "body": "You underestimate how much people will spend to integrate the functionality into the TV and have a single sleek device. That's why smart TV's took off to begin with. You have a single remote, you don't have to worry if a device is plugged into the right slot, no mess of wires, no muss, no fuss.",
                  "score": 19,
                  "created_utc": 1731959126.0,
                  "replies": [
                    {
                      "id": "lxt2u3p",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 3,
                      "created_utc": 1731959407.0,
                      "replies": [
                        {
                          "id": "lxt55sg",
                          "author": "Tasty-Traffic-680",
                          "body": "Yeah, that's why they started putting Chromecast and Roku inside TVs. To collect the data. Not because it was a value added feature that set them apart from the competition until the competition went and did the same damn thing. They can collect your data by selling you a box too...",
                          "score": 5,
                          "created_utc": 1731960110.0,
                          "replies": [
                            {
                              "id": "lxt8gan",
                              "author": "None",
                              "body": "[removed]",
                              "score": 1,
                              "created_utc": 1731961130.0,
                              "replies": [
                                {
                                  "id": "lxt9crf",
                                  "author": "Tasty-Traffic-680",
                                  "body": "TV manufacturers could have made their own boxes but they didn't. Instead they integrated the same function into the television. Now add on boxes are fading away Into obscurity.",
                                  "score": 1,
                                  "created_utc": 1731961405.0,
                                  "replies": [
                                    {
                                      "id": "lxtb0qh",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": 1,
                                      "created_utc": 1731961915.0,
                                      "replies": [
                                        {
                                          "id": "lxtct9q",
                                          "author": "Tasty-Traffic-680",
                                          "body": "I'm not the target market for an apple product. I don't even own a smart tv. Just explaining how people could possibly want a single device that does two things. Holy shit people really got a hate boner against smart TVs.",
                                          "score": 2,
                                          "created_utc": 1731962461.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lxt8o03",
                          "author": "None",
                          "body": "The dongle makers were getting all the sweet, sweet data, and the TV manufacturers wanted their cut. Also, TVs are so cheap now. The price just absolutely bottomed out in the last 15 years. Apple would really struggle to sell this at the margins they are used to. I'm not sure integrating FaceID for user login or FaceTime and a camera (double as a home security cam when the TV is asleep?) would be worth buying a $1500-2000 TV from Apple instead of a $500 TV from TCL. Another factor why Apple shut their TV business down the first time is the upgrade cycle on TVs is around 7 years.",
                          "score": 1,
                          "created_utc": 1731961196.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxtbwzu",
                      "author": "TheUmgawa",
                      "body": "Yeah, but I’m not a fan of integrating the box, because there’s always an end-of-life for the software upgrades, where the processor can’t handle new features. I’ve never used any of the smart features on my smart TV, and it boots directly to HDMI 1, which my Apple TV is plugged into. And when that Apple TV hits EOL, I’m buying a new model, just as soon as they introduce any features that are worth having. The model I have can’t do Sing mode in the Music app, but that’s not a big deal to me, and I’m not replacing it for that. But imagine if it’s something you *do* want, and you can’t have it because you bought an integrated system. Now you have to replace the $1,000 TV instead of the $150 box.",
                      "score": 2,
                      "created_utc": 1731962188.0,
                      "replies": [
                        {
                          "id": "lxtdos5",
                          "author": "Tasty-Traffic-680",
                          "body": "What previous experience with apple would lead you to believe they're going to prematurely abandon or nerf the product? And what would stop you from just using an external dongle/box once it's deprecated? You have an apple TV box. You have a TV. Why not an Apple manufactured TV? It's going to have to compete and sell on total value, not simply being an apple product.",
                          "score": 3,
                          "created_utc": 1731962724.0,
                          "replies": [
                            {
                              "id": "lxteng3",
                              "author": "TheUmgawa",
                              "body": "It’s not a ‘premature’ thing. It’s just something that happens. You know, like how your iPhone 8 can’t run the current version of iOS. So, unless the display was better than any other display I could get for the same price, there would be zero reason to get an Apple integrated television.\n\nEven Steve Jobs knew the TV market was a bad one to be in. His exact words were, “The margins suck.” Apple makes 30 percent margin on damn near everything. To compete in the TV game, they’d have to make a third of that margin, and they’d *still* be overpriced, which would limit sales to Apple enthusiasts, at which point a retailer could make more money by putting any other TV in that wall space. TVs are just a crappy business to be in, and Apple shouldn’t be in it.",
                              "score": 1,
                              "created_utc": 1731963014.0,
                              "replies": [
                                {
                                  "id": "lxtgls5",
                                  "author": "Tasty-Traffic-680",
                                  "body": ">It’s not a ‘premature’ thing. It’s just something that happens. You know, like how your iPhone 8 can’t run the current version of iOS. So, unless the display was better than any other display I could get for the same price, there would be zero reason to get an Apple integrated television.\n\nSo what is any different with the TV you have today? Like I said, they would still need to be able to present a value to the market. It would have to be competitive or better than other manufacturers for anyone to even consider it.\n\n\n\n>Even Steve Jobs knew the TV market was a bad one to be in. His exact words were, “The margins suck.”\n\nRespectfully, you're not arguing the same point anymore.",
                                  "score": 4,
                                  "created_utc": 1731963598.0,
                                  "replies": [
                                    {
                                      "id": "lxttr5u",
                                      "author": "TheUmgawa",
                                      "body": "Because I do t have to pay twenty-five percent more (plus whatever markup Apple would slap on it for having the Apple TV functionality built in) for the same display. I could get a really nice Sony for $800, or I could pay $1150 for an Apple unit where I’d have to replace the box in three years. Why pay the extra $200? Branding?",
                                      "score": -1,
                                      "created_utc": 1731967593.0,
                                      "replies": [
                                        {
                                          "id": "lxtutfg",
                                          "author": "Tasty-Traffic-680",
                                          "body": "Then you're not the target market. It's not even a real product 😂\n\nAgain. THEY WOULD HAVE TO BE COMPETITIVE ON PRICE AND FEATURES TO BE ABLE TO COMPETE. I don't know how many times I need to say it.",
                                          "score": 2,
                                          "created_utc": 1731967931.0,
                                          "replies": [
                                            {
                                              "id": "lxuc0kk",
                                              "author": "TheUmgawa",
                                              "body": "THEY WOULD NOT BE COMPETITIVE ON PRICE.\n\nSeriously, did I have to say that part in sign language or something? The only way they would be competitive on price would be if they cut their margins to near zero, and then you started complaining about me talking about margins. You’re living in some kind of fantasyland if you think Apple would do that.",
                                              "score": 1,
                                              "created_utc": 1731973699.0,
                                              "replies": [
                                                {
                                                  "id": "lxufcnq",
                                                  "author": "Tasty-Traffic-680",
                                                  "body": "Based on what? They currently have one of the best entry level desktops you can buy for $500. They make 30% of every app and media purchase. It doesn't matter what the hardware costs to make as long as it's not so far out of the ballpark that nobody can afford it like apple vision.",
                                                  "score": 2,
                                                  "created_utc": 1731974858.0,
                                                  "replies": [
                                                    {
                                                      "id": "lxujvpl",
                                                      "author": "TheUmgawa",
                                                      "body": "Yes, I’m sure the ($600, not $500) Mac mini will finally be the thing that causes the masses to buy Apple computers. Surely, it will be the thing that puts Macs in every office in America, as well. Oh, wait, that won’t happen, because people will say, “But does it play this game I want to play? Does it run this software I need for work? No? Well, then it’s kind of a paperweight isn’t it?”\n\nAnd I don’t think you grasp how people buy televisions. They pick a size, because they have limited space, and then they shop based on cost. It’s a very different market from the rest of tech, and you’d know that if you ever sold them. People don’t pay retail price for TVs, and they wait for TVs to go on sale. Apple doesn’t really do sale pricing, so now the other TVs look even *more* attractive to the person who shops based on price.\n\nSeriously, go to your local big box retailer and ask them how many people they get who shop for quality; who buy TVs when they’re *not* marked down a couple hundred bucks. That guy will call his supervisor and then ask you to repeat the question, and then they’ll both laugh at you.\n\nAlso, consider this: I’ve owned an Apple TV for about two and a half years. How much money have I spent on it? Zero. “But Apple gets thirty percent of your…!” you might say, but they don’t, because rational people do their subscribing on websites, to avoid the Apple tax. Hell, isn’t Disney or somebody taking out the option of in-app payment, rather than take the 30 percent hit on their already-too-small margins? They’ll inconvenience people before they say, “Fine. We’ll bill you an extra 30 percent,” because that’s confusing to consumers and it’s really hard to explain to those people why their bills went up, whereas just saying, “This is how it’s done, now,” inconveniences the consumer for about five minutes.\n\nSo, we can put that, “Sell it for no margin and make thirty percent on the aftermarket!” idea to rest. If they want to make thirty percent, they’re going to have to do it on the hardware.",
                                                      "score": 0,
                                                      "created_utc": 1731976433.0,
                                                      "replies": [
                                                        {
                                                          "id": "lxukd1x",
                                                          "author": "Tasty-Traffic-680",
                                                          "body": "It's already on sale for $500 from various retailers. Either way they seem to be doing just fine without your money",
                                                          "score": 2,
                                                          "created_utc": 1731976603.0,
                                                          "replies": [
                                                            {
                                                              "id": "lxv1qmn",
                                                              "author": "TheUmgawa",
                                                              "body": "Yes, because we should judge 90 percent of the retail year by what happens during Black Friday season. \n\nAnd, if you only knew how much of my money Apple has. But, just because I buy Apple products, that doesn't mean I'm a cultist who has lost all view of economic reality. That's *your* area.\n\nNever mind that the lowest I've seen the M4 mini going for is $549, which is 10 percent higher than $500, but we've already established that you have a loose grip on numbers.",
                                                              "score": -1,
                                                              "created_utc": 1731982658.0,
                                                              "replies": [
                                                                {
                                                                  "id": "lxv24m1",
                                                                  "author": "Tasty-Traffic-680",
                                                                  "body": "Aside from cheapo doorbuster deals Black Friday prices are the same as any other sale any other time of year. \n\nCheck r/buildapcsales\n\nFWIW, aside from an iPhone I don't own any Apple products.",
                                                                  "score": 2,
                                                                  "created_utc": 1731982796.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "lxv3y2n",
                                                                      "author": "None",
                                                                      "body": "[removed]",
                                                                      "score": -1,
                                                                      "created_utc": 1731983452.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "lxv46q6",
                                                                          "author": "Tasty-Traffic-680",
                                                                          "body": "Lol. Personal attacks all you got left?",
                                                                          "score": 2,
                                                                          "created_utc": 1731983537.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "lxvkl48",
                                                                              "author": "TheUmgawa",
                                                                              "body": "What, was I right?",
                                                                              "score": 0,
                                                                              "created_utc": 1731989787.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "lxvsj8h",
                                                                                  "author": "Tasty-Traffic-680",
                                                                                  "body": "No",
                                                                                  "score": 1,
                                                                                  "created_utc": 1731993345.0,
                                                                                  "replies": []
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ly1ga4o",
                                  "author": "Realistic-Nature9083",
                                  "body": "The only retailer that makes money in tvs is Walmart by selling the onn tvs. Those suckers are supposedly stealing market share from tcl and Hisense. 88 bucks for a 32 inch? C'mon. It is a steal.",
                                  "score": 1,
                                  "created_utc": 1732071516.0,
                                  "replies": [
                                    {
                                      "id": "ly28tlq",
                                      "author": "TheUmgawa",
                                      "body": "Walmart bought Vizio back in February for 2.3 billion dollars. You’d think that a TV company as ubiquitous as Vizio would go for more money, but the margins suck.",
                                      "score": 1,
                                      "created_utc": 1732084310.0,
                                      "replies": [
                                        {
                                          "id": "ly3ry1r",
                                          "author": "Realistic-Nature9083",
                                          "body": "If Walmart gets approval to buy Vizio they will have the largest market share of tvs in the US. Supposedly Vizio and onn rokus combined will have 65 percent market share in the country. \n\nThe margins for Vizio right now are very thin but if Walmart buys them out they instantly get logistical and marketing vertical integration. \n\nEverybody always talks about manufacturing vertical integration at the hardware and software level but Walmart controls the delivery and the fees in the sales floor and it's website. \n\nVizio and onn. will be made by odms and I guess Roku will handle the software while all the costs associated with the delivery and fees will be reduced to nothing by Walmart. \n\nRetailers charge money to sell product their stores. Vizio doesn't have to worry about that with Walmart anymore. \n\nTcl and Hisense will just be \"colonies\" that design the blueprint for onn and Hisense tvs. \n\nI can't wait for even cheaper tvs from Walmart.\n\n\nEdit: apple can make tvs if they want but realistically I just don't think they be can number one anymore ever in tv market share.",
                                          "score": 1,
                                          "created_utc": 1732113626.0,
                                          "replies": [
                                            {
                                              "id": "ly3xu47",
                                              "author": "TheUmgawa",
                                              "body": "Being number one should never really be any company’s concern, if it means a line isn’t profitable enough to be worth the trouble. Macs have *never* been number one, but the margins are high enough that it’s worth doing. On TVs, I can’t see how that would ever happen, because Apple could make displays with more pixels and charge a premium, but it’s not like their 5K studio display because there’s no content for a 5K TV, and that would basically have to be a custom panel, which is the reason the studio display costs five times what my 4K monitor does, despite the fact that my 4K is 40 percent larger by area. The studio display wouldn’t be worth making at all if it wasn’t something that video professionals could just expense when buying a Mac Studio or Mac Pro. So, they take that and then make it a million times worse, because now they’re in large retail channels, most of which wouldn’t sell $1500 TVs. Even if they’re five times better, most people would still rather buy five inferior TVs, or one TV and wait five years for the inferior ones to hit the point where they’re as good as the superior TV, and then spend $300 on that.",
                                              "score": 1,
                                              "created_utc": 1732115592.0,
                                              "replies": [
                                                {
                                                  "id": "ly5nkgc",
                                                  "author": "Realistic-Nature9083",
                                                  "body": "The only only markets that apple has succeeded are in categories where there is an exclusive apple feature or a technology handicap or a duolopy. \n\n\nIf tsmc didn't rule foundry and if we had a 3rd or 4th mobile oses, apple would not be as dominant as they are. \n\nSmartphones are the center of most consumer electronics. Speakers, tvs, cars, smart homes, desktops are not as tied to the smartphone",
                                                  "score": 1,
                                                  "created_utc": 1732136285.0,
                                                  "replies": [
                                                    {
                                                      "id": "ly61ivt",
                                                      "author": "TheUmgawa",
                                                      "body": "If wishes were horses, we’d all be eating steak: \n\nAlternative OS phones have come and gone over the years, and so nobody’s going to do it ever again. Even Microsoft is never going to dip its very large toe in that water ever again.\n\nIf a chip foundry didn’t cost ten billion dollars, just to set up, let alone deal with things like environmental regulations, we would have more than just TSMC.\n\nSo, you can dream, “What if…?” but I try to confine myself to some semblance of reality.",
                                                      "score": 1,
                                                      "created_utc": 1732146246.0,
                                                      "replies": [
                                                        {
                                                          "id": "ly78f50",
                                                          "author": "Realistic-Nature9083",
                                                          "body": "Not many people paid attention to foundry a few years ago until maybe in 2022? \n\nI actually do expect more competition in foundry by 2030. The 3rd mobile can exist with more antitrust legislation",
                                                          "score": 1,
                                                          "created_utc": 1732162119.0,
                                                          "replies": [
                                                            {
                                                              "id": "ly7edki",
                                                              "author": "TheUmgawa",
                                                              "body": "There’s going to be no antitrust legislation in the next four years, so that’s off the table, at least in America, and I think companies that would be broken up by the EU should respond by pulling sales and services from the EU. It would be a massive hit to their revenues, but it beats a breakup. \n\nAnd as for chip foundries, you have to hope they’re online by 2030, which I doubt is realistic, because China’s going to invade Taiwan ten or so years from now. No matter which way that war ends, there’s not going to be any more chips coming out of Taiwan; at least not for the western world.",
                                                              "score": 1,
                                                              "created_utc": 1732164647.0,
                                                              "replies": [
                                                                {
                                                                  "id": "lyrs582",
                                                                  "author": "Realistic-Nature9083",
                                                                  "body": "My final conclusion is if google is forced to break up, I can see Samsung fragment itself a part of Android and just follow the Huawei route and go in house on OS development. \nI think Samsung having just Samsung apps and software is its destiny. \n\n\nI have used Samsung email, find find my device and browser and they are functionality great! The problem is that Google has pre installed apps on their phones so why even bother with Samsung software. \n\n\nSamsung needs to go all in on software and os development.",
                                                                  "score": 1,
                                                                  "created_utc": 1732470451.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "lytfve9",
                                                                      "author": "TheUmgawa",
                                                                      "body": "Sure, until their OS gets so big that people moan that Samsung should have to divest itself of that part of the business, courtesy of the very same people who caused it to come into being. So, no, they really don’t have to do that, because whenever a company makes something really good, people complain, “Why can’t everybody else have that?!”",
                                                                      "score": 1,
                                                                      "created_utc": 1732489068.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "lytt34u",
                                                                          "author": "Realistic-Nature9083",
                                                                          "body": "I might switch to apple if find my device gets killed.",
                                                                          "score": 1,
                                                                          "created_utc": 1732493734.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "lytu9ti",
                                                                              "author": "TheUmgawa",
                                                                              "body": "Why would your device be killed? Worst case, Android would get spun off of Google and they’d have to raise the royalty per unit sold. Really not a big deal.",
                                                                              "score": 1,
                                                                              "created_utc": 1732494151.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "lyv7qk3",
                                                                                  "author": "Realistic-Nature9083",
                                                                                  "body": "Too many what ifs with Google. Samsung at least is committed but they don't control the Os.",
                                                                                  "score": 1,
                                                                                  "created_utc": 1732514474.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "lyv9taf",
                                                                                      "author": "TheUmgawa",
                                                                                      "body": "And they’re not going to, for the reason I listed above. And because it’s a money sink with little potential financial upside. If they just fork Android, they’re still going to have to pay a licensing fee for every phone. If they build their own OS from scratch, or just from the pure Linux kernel, it would take years, billions of dollars, and then they have to try and get app creators to make apps for *yet another* OS, and they need a lot of apps ready to go on launch day, or the whole thing fails like the Windows phone, meaning those billions of dollars were completely wasted. And then there’s sunk-cost, where users will be angry because the money they spent on the Play Store for years? That’s all gone. \n\nIt’s just a bad idea.",
                                                                                      "score": 1,
                                                                                      "created_utc": 1732515626.0,
                                                                                      "replies": []
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ly3syvi",
                                          "author": "Realistic-Nature9083",
                                          "body": "Walmart is a sleeping giant. The logistical vertical integration is enough for them to take on anybody in consumer electronics. I'm surprised they haven't made android phones or wear os watches. They can really undercut the competition like Motorola and Lenovo.",
                                          "score": 1,
                                          "created_utc": 1732113974.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxt6g8n",
                      "author": "lkn240",
                      "body": "There are literally little mounts for Rokus that attach to the back of your TV.  No mess, now visible wires and the roku remote works with every TV I've ever tried it with",
                      "score": -2,
                      "created_utc": 1731960509.0,
                      "replies": [
                        {
                          "id": "lxwxyun",
                          "author": "Neg_Crepe",
                          "body": "But it’s a Roku…",
                          "score": 1,
                          "created_utc": 1732018183.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxt9bxy",
                      "author": "audigex",
                      "body": "I’ve had a single remote for all my TVs for years\n\nHDMI CEC etc cover it nicely - helped by the fact that you basically just need volume and standby buttons",
                      "score": -1,
                      "created_utc": 1731961397.0,
                      "replies": [
                        {
                          "id": "lxtafvf",
                          "author": "Tasty-Traffic-680",
                          "body": "CEC is awesome when it works well. Unfortunately (at least with the first gen) the fire stick 4k doesn't always play nice nor do some smart TV's with their own interface.",
                          "score": 2,
                          "created_utc": 1731961738.0,
                          "replies": [
                            {
                              "id": "lxu1saj",
                              "author": "audigex",
                              "body": "I’ve never found a combination that doesn’t work well, personally - I guess experiences must vary but that’s what returns policies are for",
                              "score": 1,
                              "created_utc": 1731970179.0,
                              "replies": [
                                {
                                  "id": "lxufu7x",
                                  "author": "Tasty-Traffic-680",
                                  "body": "You also lost voice control if you stick with the OEM remote for multiple devices. Not something that matters much to me as an adult but the kids seem to love it.",
                                  "score": 1,
                                  "created_utc": 1731975027.0,
                                  "replies": [
                                    {
                                      "id": "lxwq26w",
                                      "author": "audigex",
                                      "body": "I use the Fire TV/Chromecast/Apple TV/whatever remote and let it control the TV's volume and standby\n\nI still get the voice control, the only thing I can't do is adjust the TV settings... but I rarely touch those once I have the TV configured anyway",
                                      "score": 1,
                                      "created_utc": 1732013867.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxtv2y4",
                  "author": "_gordonbleu",
                  "body": "That’s essentially what I’ve done now but there are still disadvantages with that. The shitty tv software means it sometimes take a full minute before the tv actually turns on, or god forbid I wanna chance inputs, that’ll take an additional 30 seconds. If you push the wrong button it tries to pull up all the apps and shit and slows the whole thing down. Most people I know have had an apple tv longer than their current tv.",
                  "score": 1,
                  "created_utc": 1731968015.0,
                  "replies": [
                    {
                      "id": "lxu3n1a",
                      "author": "None",
                      "body": "Damn, I have none of those problems on my 4 TVs at home, thankfully. What brand of TV do you have so I can stay away from it?",
                      "score": 1,
                      "created_utc": 1731970796.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxt8vre",
                  "author": "None",
                  "body": "Less wires, no need to understand which HDMI port to use or Dolby Visiion/Atomis and other matching features of your box with your TV, fairly simply stuff. The way to do it is to not make high end TVs and focus on growing a TV app platform. I've been saying this for years, TV is such an under-developed platform, especially since 4k mostly got rid of any resolution/blurry text issue.",
                  "score": 1,
                  "created_utc": 1731961261.0,
                  "replies": [
                    {
                      "id": "lxtkqve",
                      "author": "None",
                      "body": "how much money is that worth to the average consumer who spends about $450 for a new TV?",
                      "score": 1,
                      "created_utc": 1731964846.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxt7il2",
              "author": "cjboffoli",
              "body": "I'd pay for an Apple branded TV for the simple fact that every single interaction I have with the device isn't tracked and monitored somehow. The TOS I have to agree to in order to simply use my LG television is ridiculous, as is the bloated array of apps and services that clutters the set.",
              "score": 4,
              "created_utc": 1731960838.0,
              "replies": [
                {
                  "id": "lxtwbzi",
                  "author": "anarchyx34",
                  "body": "My LG tv hasn’t seen the internet in years. In fact I haven’t needed to even see or interact with its GUI in a very long time. HDMI-CEC and I do everything through the Apple TV remote. It’s basically a monitor at this point.",
                  "score": 1,
                  "created_utc": 1731968418.0,
                  "replies": []
                },
                {
                  "id": "lxtdq6b",
                  "author": "hhs2112",
                  "body": "Of course they're going to track everything, how else will they target ads? ",
                  "score": -6,
                  "created_utc": 1731962735.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxupey8",
              "author": "LivermoreP1",
              "body": "Everyone’s arguing with you, but I’d love to just hit my Apple TV remote and never have to worry that the HDMI pass-thru is delayed in booting up, the TV tries to say it needs to be updated when I never actually use it, and I don’t need to have a little black box next to my TV connected by an ugly wire (yeah I know I can go behind the wall, but it’s a fireplace).",
              "score": 2,
              "created_utc": 1731978372.0,
              "replies": []
            },
            {
              "id": "lxu7fr0",
              "author": "3percentinvisible",
              "body": "My Panasonic is older than 2 years old, still operates fine, has appletv, Disney, Amazon, Netflix, etc.",
              "score": 1,
              "created_utc": 1731972105.0,
              "replies": []
            },
            {
              "id": "lxxkn3g",
              "author": "joselrl",
              "body": "Paying 1000$ for a TV thats not OLED (assuming we are talking about the 55\" range) or a high end MiniLED at least is just a mistake. Buy a good TV and an Apple TV or other good TV Box \n  \nAnyway, Apple wont be starting to engineer and design panels, they will buy high end panels from LG and Smasung, slap Apple TV on them and upcharge 50% because iPhones will be able control the volume or something",
              "score": -1,
              "created_utc": 1732027177.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxv7kkr",
          "author": "halfcentaurhalfhorse",
          "body": "Data collection system.",
          "score": 3,
          "created_utc": 1731984749.0,
          "replies": []
        },
        {
          "id": "lxvzmmc",
          "author": "aykay55",
          "body": "I disagree. We don’t actually have anything filling the gap for “premium TVs”. Everything on the market is large panels that aren’t super pixel dense and cheap processors that make the smart tvs run slow as shit. \n\nApple can use this opportunity to put out really well made TVs (even if they just use Samsung panels) but run on Apple Silicon hardware and integrate directly with other Apple devices.",
          "score": 2,
          "created_utc": 1731996991.0,
          "replies": []
        },
        {
          "id": "lxul9gw",
          "author": "angrydeuce",
          "body": "You greatly underestimate the lengths people will go to in order to purchase products with that logo on them lol\n\n\nPeople collect the empty boxes apple products came in for fucks sake.  They could drop a 40\" 720p set for 1200 bucks and probably still sell enough to cover their investment.",
          "score": 5,
          "created_utc": 1731976915.0,
          "replies": []
        },
        {
          "id": "lxvkl0r",
          "author": "JazzRider",
          "body": "Because Smart TVs suck.",
          "score": 4,
          "created_utc": 1731989785.0,
          "replies": [
            {
              "id": "lxvlkeq",
              "author": "fusionsofwonder",
              "body": "I make all my Smart TVs dumb and then pair them with an Apple TV.",
              "score": 0,
              "created_utc": 1731990208.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxtnox5",
          "author": "Estrava",
          "body": "Every tv has ads which is a qualm I know some have. Also Apple TV would be expensive but at least it would be quality. Having one with FaceTime, assistant/always on display for home perhaps maybe. \n\nIt would be interesting to see what software integrations they could come up with.",
          "score": 2,
          "created_utc": 1731965742.0,
          "replies": []
        },
        {
          "id": "lxstnoo",
          "author": "typkrft",
          "body": "It’s a new market. It encompasses a lot of the research they already do. Shareholders pushing for growth. I think they could probably cut themselves a slice of the market share. There’s plenty of people in the Apple ecosystem that would just buy it for integration if it existed.",
          "score": 2,
          "created_utc": 1731956639.0,
          "replies": []
        },
        {
          "id": "lxt8i5x",
          "author": "BigSlickPrick",
          "body": "If it looks nice, doesn’t have an ugly interface, or push me ads that still show up even after opting out (fuck you Samsung) I’ll gladly pay twice the price.",
          "score": 1,
          "created_utc": 1731961147.0,
          "replies": []
        },
        {
          "id": "lxv318u",
          "author": "jack3moto",
          "body": "Why? More revenue streams… phones and computers are basically tapped out on year to year improvements.  Gotta keep drilling with the hope of finding another oil well.",
          "score": 1,
          "created_utc": 1731983122.0,
          "replies": []
        },
        {
          "id": "lxv9ujd",
          "author": "sqaurebore",
          "body": "All those billions in research have to go somewhere",
          "score": 1,
          "created_utc": 1731985576.0,
          "replies": []
        },
        {
          "id": "lxvhv4f",
          "author": "bmack500",
          "body": "Tariffs.",
          "score": 1,
          "created_utc": 1731988658.0,
          "replies": []
        },
        {
          "id": "lxvillg",
          "author": "Ant10102",
          "body": "They can probably infiltrate the market because it’s a well established brand",
          "score": 1,
          "created_utc": 1731988957.0,
          "replies": []
        },
        {
          "id": "lxvkivo",
          "author": "KingBenjaminAZ",
          "body": "Because they ditched the Apple Car idea 🤷🏻‍♂️",
          "score": 1,
          "created_utc": 1731989760.0,
          "replies": []
        },
        {
          "id": "lxvm0na",
          "author": "fusionsofwonder",
          "body": "They make the best TV box around, so it could be just a ploy to get their AppleTV shows into more homes, using their software.  Like Roku.\n\nCould also be there are some synergies with their Apple Vision plans if they own the firmware on the TVs in the same room as the Apple Vision.  Like allowing a Vision user to swipe a window and have it appear on the TV.",
          "score": 1,
          "created_utc": 1731990397.0,
          "replies": []
        },
        {
          "id": "lxvrwum",
          "author": "GoldenPresidio",
          "body": "It isn’t about making profits on the tv; it’s being the default OS and making all the margin after that",
          "score": 1,
          "created_utc": 1731993054.0,
          "replies": []
        },
        {
          "id": "lxvwxa7",
          "author": "randomsnowflake",
          "body": "Walled garden. Data retention.",
          "score": 1,
          "created_utc": 1731995535.0,
          "replies": []
        },
        {
          "id": "lxwmyzf",
          "author": "Initial-Hawk-1161",
          "body": "a tv with built in apple tv, some airdrop feature for movies and pictures, screen streaming (like the iphone -> mac), sidecar, use as wireless display for your mac\n\nthere's a lot of options, but apple tend take a bit of a premium for their displays, so i doubt a tv like that would be a 'good deal' compared to other offers... the LG C series aint exactly super expensive, but they're damn good",
          "score": 1,
          "created_utc": 1732011922.0,
          "replies": []
        },
        {
          "id": "lxwrqwp",
          "author": "FireRotor",
          "body": "The Apple ecosystem gives them a huge advantage.",
          "score": 1,
          "created_utc": 1732014872.0,
          "replies": []
        },
        {
          "id": "lxxoht9",
          "author": "ubiquitous-joe",
          "body": "I guess the draw would be controlling the interface as long as smart TV’s are being a thing. Do I want to shell out top dollar for an apple television? No, and I say that a somebody who owns Macs. But having found Samsung smart TVs sometimes maddening, I could imagine a better system. \n\nTho really a smart tv seems like a recipe for built-in obsolescence no matter who manufactures it.",
          "score": 1,
          "created_utc": 1732028460.0,
          "replies": []
        },
        {
          "id": "lxxrnfb",
          "author": "LetMePushTheButton",
          "body": "I do think there’s a growing market of people looking for a quality tv that doesn’t breakdown within a measly 1 yr warranty. \n\nLooking at you, LG.",
          "score": 1,
          "created_utc": 1732029483.0,
          "replies": []
        },
        {
          "id": "lxxtcku",
          "author": "MassiveBoner911_3",
          "body": "I really do not need / want a super premium ultra sleek TV. I barely watch TV now as it is.",
          "score": 1,
          "created_utc": 1732030023.0,
          "replies": []
        },
        {
          "id": "lxxtzjz",
          "author": "oldmaninparadise",
          "body": "You would think, but you are not thinking like an idrone. Apple fanbois will buy it cause, well it's made by apple. How many people do you see w 1500 MacBook that could be using a 400 Asus to just use a browser? Lots!",
          "score": 1,
          "created_utc": 1732030223.0,
          "replies": []
        },
        {
          "id": "lxy8f4k",
          "author": "bdizzzzzle",
          "body": "Because apple fanboys/girls will buy it regardless",
          "score": 1,
          "created_utc": 1732034620.0,
          "replies": []
        },
        {
          "id": "lxz22i8",
          "author": "BrianMincey",
          "body": "The TV software is absolutely garbage though.  I’d love to see them come in and absolutely kill it with some incredible TVOS that works better than the junk that Sony and LG put out.",
          "score": 1,
          "created_utc": 1732043344.0,
          "replies": []
        },
        {
          "id": "ly16rb2",
          "author": "f8Negative",
          "body": "iScreen the only thing you'll ever need. Now in 4 sizes.",
          "score": 1,
          "created_utc": 1732068118.0,
          "replies": []
        },
        {
          "id": "lxt0585",
          "author": "KasseanaTheGreat",
          "body": "There's a non-insignificant portion of the population who've proven themselves willing to buy anything as long as it has an apple logo on it, they probably think those types are willing to buy a standalone Apple TV",
          "score": 1,
          "created_utc": 1731958590.0,
          "replies": []
        },
        {
          "id": "lxsmdnj",
          "author": "themangastand",
          "body": "The issue is apple goes into these markets. Charges 2 times the price and expects there fans to buy them. Which sure they ussually do. But that audience seems to be mostly iPhone and computer users. They aren't going to buy vr, and buy a tv just because it's apple like they do for their watches, and phone. With vrs case they wanted to charge almost 10 times the competition. In what world was that okay.",
          "score": -3,
          "created_utc": 1731954454.0,
          "replies": [
            {
              "id": "lxsx6ns",
              "author": "TylerInHiFi",
              "body": "It’s not that Apple is charging double, it’s that the overall market is charging loss leader prices because they’re scraping your usage habits and using that data to generate revenue. It’s the same thing that console manufacturers have always done. They sell you the console for less than it costs to make because they’ll make their profits on every game you buy. Except instead of games, the TV manufacturers are selling ads. Samsung has fucking banner ads built into all but their most expensive models. \n\n\nRealistically, Apple would sell a TV at roughly the same price that Samsung, LG, or Sony sell their more expensive sets, which are still artificially cheap because they collect usage data to resell to advertisers. They’d also assume that a lot of people buying a TV made by Apple would also be paying for iCloud or AppleTV+ or Apple One, and that would be the secondary revenue stream that subsidizes the TV itself. \n\n\nApple relies more heavily on selling subscription services than they do on scraping and repackaging your usage habits to sell to advertisers like the rest of the manufacturers of the products you mentioned. Amazon loses money on every single Echo product they sell. Google loses money on every Fitbit sold. They do so because they know that more people will choose a lower up-front cost, and that the larger their market share the more they can make from ad revenue and subscriptions. \n\nApple is a hardware company that offers subscriptions, Amazon and Google are advertising companies that offer hardware. Samsung is a data collection agency that offers hardware, at least as it pertains to things like TV’s.",
              "score": 7,
              "created_utc": 1731957697.0,
              "replies": [
                {
                  "id": "lxtefyr",
                  "author": "hhs2112",
                  "body": "One of apple's strategic imperatives is expansion of their ad business.  They're working hard to do exactly what amazon and roku are doing... They collect as much data as anyone, they just haven't been as successful monetizing it as the others. ",
                  "score": -1,
                  "created_utc": 1731962952.0,
                  "replies": [
                    {
                      "id": "lxtgjeq",
                      "author": "TylerInHiFi",
                      "body": "They definitely *collect* data, but the monetization is the point. They’re not really using that data to stuff third party ads down your throat in the same way other companies are. I don’t get ads for random products when I open the app launchpad in macOS like I do in the start menu on windows. I don’t get banner ads across the bottom of my screen when I’m watching something using my Apple TV like my friends who own Samsung TV’s get.\n\n\nThey seem to be using that data to tailor ads within things like the App Store, which makes sense to me. Although my biggest gripe with Apple News is that I’m paying a subscription (as part of Apple One) to still be served with the same trashy ads that show up on the website versions of those same articles. I like that I have access to subscription-only publications, but I hate that they still come with ads.",
                      "score": 2,
                      "created_utc": 1731963578.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxt0pvw",
              "author": "DorianGre",
              "body": "I would buy an aluminum framed 52” tv with 8k resolution and Apple TV built in. 100%z",
              "score": 1,
              "created_utc": 1731958764.0,
              "replies": []
            },
            {
              "id": "lxsz3yx",
              "author": "PatSajaksDick",
              "body": "AVP technical specs was far ahead of competition, but it also wasn’t expected to be a mass market device. The screens on the AVP are amazing, but yeah the use is limited to those who are into that type of stuff. (Source: I have one, cause I buy gadgets and I love it, but it’s not for everyone)",
              "score": -1,
              "created_utc": 1731958276.0,
              "replies": []
            },
            {
              "id": "lxswsfw",
              "author": "Uncertn_Laaife",
              "body": "Even iPhone users don’t give a shit about their overpriced crap. Phones are a necessity so people flock to the stable one, the other stuff is not that much. Fanbois are a different breed though.",
              "score": -6,
              "created_utc": 1731957579.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxtd5sk",
          "author": "hhs2112",
          "body": "Fanboys will buy it, guaranteed. ",
          "score": -2,
          "created_utc": 1731962564.0,
          "replies": []
        },
        {
          "id": "lxt7fov",
          "author": "None",
          "body": "Probably mostly to get a lot more people on a TV app platform than they could just telling them to buy AppleTV and add to their TV. It's pretty cheap to add Roku/AppleTV/Nvidia Shield to a TV if you do it right. Nvidia doesn't seem to care about TV since they basically just ignore the Shield platform. Roku is kinda of crap, there is basically no real competition for somebody like Apple with Google/Nvidia basically just dragging their ass as if it's not the biggest electronic platform in the world.\n\nHaving had most TV streaming boxes, it's pretty clear Apple is the only one taking it seriously beside game consoles, whom mostly don't care about all the other uses beside games, thus massively limiting the platform and having huge costs for the gaming chips that most TV users in general don't really care about. Plus those M whatever chips are so good now you can get ideal performance without fans, unlike Nvidia shield which is more expensive and breaks far more often AND never gets updates or features because Nvidia is too busy selling to cryptokids and WHO-THE-FUCK ever buys $1000+ dollar GPUs.",
          "score": 0,
          "created_utc": 1731960813.0,
          "replies": []
        },
        {
          "id": "lxti2zz",
          "author": "Todd-The-Wraith",
          "body": "If they make their tv less shit than everyone else? I’d consider it. Ie NO ADS baked into the tv. Hell they could literally sell a decently high refresh rate tv that is essentially just a really big monitor and I’d buy it. \n\nHaving a tv that costs as much as a cheap car suddenly force an update for a feature you don’t use that breaks features you do use is infuriating.",
          "score": 0,
          "created_utc": 1731964046.0,
          "replies": []
        },
        {
          "id": "lxtjxs4",
          "author": "strangemanornot",
          "body": "I think a tv that works seamlessly with Apple product would be nice. In home or in the office. But we all know it would cost an arm.",
          "score": 0,
          "created_utc": 1731964603.0,
          "replies": []
        },
        {
          "id": "lxtond8",
          "author": "defaultfresh",
          "body": "They’re not going to try to compete on price. Look at how they priced their airpods and airpods max. They will compete against Sony in headphones and in TVs. Sony’s flagship A95L 55 inch tv is 2500 dollars.",
          "score": 0,
          "created_utc": 1731966031.0,
          "replies": []
        },
        {
          "id": "lxufg1o",
          "author": "latortillablanca",
          "body": "Boredom",
          "score": 0,
          "created_utc": 1731974891.0,
          "replies": []
        },
        {
          "id": "lxvhbnb",
          "author": "steelhorizon",
          "body": "Data collection and advertising opportunities.",
          "score": 0,
          "created_utc": 1731988444.0,
          "replies": []
        },
        {
          "id": "lxt11ws",
          "author": "Governmentwatchlist",
          "body": "Bet you a box of donuts that they want the data WAYYYYYY more than they care about the profits.",
          "score": -4,
          "created_utc": 1731958866.0,
          "replies": []
        },
        {
          "id": "lxt8spe",
          "author": "cholula_is_good",
          "body": "Apple customers don’t function like regular electronics consumers. They are willing to pay huge margins to maintain the Apple ecosystem in their lives.",
          "score": -4,
          "created_utc": 1731961236.0,
          "replies": []
        },
        {
          "id": "lxunrsy",
          "author": "MortalPhantom",
          "body": "But the IOS market of the Apple fanboys is not saturated. It would be an instant hit",
          "score": -2,
          "created_utc": 1731977794.0,
          "replies": []
        },
        {
          "id": "lxt3rj3",
          "author": "puffferfish",
          "body": "1. There are devout Apple consumers.\n\n2. Controlling all hardware and software they can optimize the experiences.",
          "score": -5,
          "created_utc": 1731959688.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsm9iw",
      "author": "a_velis",
      "body": "The AppleTV + remote is a better option IMO. It’s portable ish and interchangeable between any TV.  Would be cool to see an Apple TV stick + remote but that likely ruins the brand experience of features for cost.",
      "score": 138,
      "created_utc": 1731954420.0,
      "replies": [
        {
          "id": "lxso5xt",
          "author": "Positive_Chip6198",
          "body": "I took ours on vaca last week, just plop in the hdmi to the hotel room tv and the kids have all their favorite shows (and apple arcade games) in the evenings. No more hotel-movies.",
          "score": 53,
          "created_utc": 1731954992.0,
          "replies": [
            {
              "id": "lxvwkc2",
              "author": "snajk138",
              "body": "Sometimes the hotels restrict the usage of the TVs, some \"hotel mode\" that for some reason doesn't allow the use of the HDMI ports. I almost bricked a hotel TV once trying to \"unlock\" it through service menus, I got it working eventually, but somehow it ended up changing to the Russian settings, including the language of all menus and everything, and it was very complicated. More commonly they just mount the TV so close to the wall that it's extremely hard to plug in anything. \n\nI have also seen the opposite though, where they have a HDMI port on the wall by the desk or so, like in a modern conference room, but that's not that common in my experience.",
              "score": 9,
              "created_utc": 1731995348.0,
              "replies": []
            },
            {
              "id": "lxss2l2",
              "author": "DaoFerret",
              "body": "Especially since so many hotels don’t have movies anymore.",
              "score": 26,
              "created_utc": 1731956162.0,
              "replies": [
                {
                  "id": "lxuei18",
                  "author": "Exile714",
                  "body": "Yeah but hotel WiFi seems to be getting worse and more restrictive in the last two years so… fingers crossed that trend reversed soon.",
                  "score": 13,
                  "created_utc": 1731974563.0,
                  "replies": [
                    {
                      "id": "lxwg2vr",
                      "author": "vaguelyblack",
                      "body": "It's going to get a whole lot worse with the return of data caps.",
                      "score": 3,
                      "created_utc": 1732007332.0,
                      "replies": []
                    },
                    {
                      "id": "ly1qp9b",
                      "author": "dorkyitguy",
                      "body": "Their target market is people for whom price doesn’t matter: people who don’t have any other options and  businesspeople who will get reimbursed anyways. Also, if you’re a frequent customer you probably have status and it’s comped",
                      "score": 1,
                      "created_utc": 1732075579.0,
                      "replies": [
                        {
                          "id": "ly1to6u",
                          "author": "Exile714",
                          "body": "I get it free often, or my company pays, but those weird login pages don’t play nice with mobile devices, including my AVP.",
                          "score": 1,
                          "created_utc": 1732076840.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxvy44r",
                      "author": "PurpleNurpe",
                      "body": "Apple TV supports VPNs",
                      "score": 1,
                      "created_utc": 1731996162.0,
                      "replies": [
                        {
                          "id": "lxzd1la",
                          "author": "Positive_Chip6198",
                          "body": "I just use the hotspot on my phone. Works fine also.",
                          "score": 0,
                          "created_utc": 1732046700.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxupnu2",
              "author": "a_velis",
              "body": "Yes! I don't need a smart TV. I need a TV I can easily cast things to. So really the most I would ask is for a universal protocol standard that all TVs implement for simple audio/video casting. Especially for movie/video watching in hotels.",
              "score": 1,
              "created_utc": 1731978459.0,
              "replies": []
            },
            {
              "id": "lxx5g1l",
              "author": "DuckAHolics",
              "body": "Hotels by Hilton don’t let you change the input. Then they wouldn’t let me cast my iPad onto the tv. Definitely will avoid them for now on.",
              "score": 1,
              "created_utc": 1732021526.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsshei",
          "author": "DaoFerret",
          "body": "Less interested in an AppleTV Stick, and more interested in a camera so your TV can be used for video calls.\n\nI know you can attach a phone, but I’d rather a simple dedicated device that could just plug into the AppleTV via a USB-C (with a physical on/off switch).",
          "score": 9,
          "created_utc": 1731956283.0,
          "replies": [
            {
              "id": "ly1qxsj",
              "author": "dorkyitguy",
              "body": "Also now you’re out your phone",
              "score": 2,
              "created_utc": 1732075679.0,
              "replies": []
            },
            {
              "id": "lxst1yz",
              "author": "Sylvurphlame",
              "body": "Same. You can use iPhones as a continuity camera but then you’re gonna need a tripod or some sort of mount or something unless the TV is on an entertainment center. So wall mounts are awkward.",
              "score": 3,
              "created_utc": 1731956454.0,
              "replies": [
                {
                  "id": "lxstod3",
                  "author": "DaoFerret",
                  "body": "Hence the reason i said “I know you can attach a phone”.\n\n“Continuity” is great as an idea or when you don’t need/can’t have a dedicated device.\n\nIf either of those cases is true though, it’s a half assed solution compared to a dedicated camera/mic combo (especially ironic since Apple used to make these before they integrated them into their monitors)",
                  "score": -5,
                  "created_utc": 1731956645.0,
                  "replies": [
                    {
                      "id": "lxuntr0",
                      "author": "DylanSpaceBean",
                      "body": "I assume the downvotes are for being snarky, but it was well deserved sass",
                      "score": 1,
                      "created_utc": 1731977813.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxsugul",
              "author": "Particular-Key4969",
              "body": "Right? It’s so annoying. I mean the Apple TV HAS a usb c port on it already. It would be so awesome as a really big video call device.",
              "score": 0,
              "created_utc": 1731956883.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxv5f99",
          "author": "GuerrillaApe",
          "body": "> It’s portable ish and interchangeable between any TV.\n\nProbably why Apple is even remotely thinking about making their own TV.  Their current ecosystem model requires customers to get a non-Apple product that nowadays have another platform built-in.",
          "score": 1,
          "created_utc": 1731983984.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsxuqu",
      "author": "wkavinsky",
      "body": "Remove LG logic & control board from Oled.\n\nReplace with Apple TV.\n\nDone. Sold.",
      "score": 33,
      "created_utc": 1731957899.0,
      "replies": [
        {
          "id": "lxt1zlq",
          "author": "fmaz008",
          "body": "In all seriousness I think that's all they have to do.",
          "score": 18,
          "created_utc": 1731959150.0,
          "replies": []
        },
        {
          "id": "lxt667q",
          "author": "KobeBean",
          "body": "Would gladly pay for this. LGs opt out ads everywhere and dubious data collection really kills the TV for me. Ours is permanently disconnected from any internet.",
          "score": 12,
          "created_utc": 1731960424.0,
          "replies": []
        },
        {
          "id": "lxv5a4x",
          "author": "NecroCannon",
          "body": "It’s the main reason I’d get one, Apple TVs last for years and honestly, if I had to get a separate box to upgrade, I’d like not having to deal with LGs bullshit like I do still now. Every now and then my cat steps on the remote and it’s a pain just getting back",
          "score": 5,
          "created_utc": 1731983933.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxspj6u",
      "author": "BeRandom1456",
      "body": " No thanks. I just want a dumb tv and a box I hook up to it.",
      "score": 95,
      "created_utc": 1731955406.0,
      "replies": [
        {
          "id": "lxtwvy8",
          "author": "Whaty0urname",
          "body": "You can def get dumb, high quality TVs. Except you're going to be paying 2005 prices for them. \n\nSmart TVs are subsidized by ads and pre-loaded app.",
          "score": 23,
          "created_utc": 1731968597.0,
          "replies": [
            {
              "id": "lxu2aka",
              "author": "BeRandom1456",
              "body": "Yeah. My lg tv with the web os is still good. I’m just saying I don’t need top of the line stuff on the actual tv part. I’m okay with web os as a standard. the one thing I hate is that if the tv is hooked to Ethernet it makes you update the tv.",
              "score": 8,
              "created_utc": 1731970346.0,
              "replies": [
                {
                  "id": "lxvjwty",
                  "author": "Mr_SlimShady",
                  "body": "Webos is ass. I hate having to deal with it on my LG tv despite having a dedicated streaming box attached to it.",
                  "score": 3,
                  "created_utc": 1731989501.0,
                  "replies": []
                },
                {
                  "id": "lxvihe5",
                  "author": "None",
                  "body": "Then just use wifi?",
                  "score": 2,
                  "created_utc": 1731988909.0,
                  "replies": [
                    {
                      "id": "lxxe9hw",
                      "author": "Mayor__Defacto",
                      "body": "Ethernet is a lot better if you’re doing 4k stuff.",
                      "score": 1,
                      "created_utc": 1732024912.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxvycf4",
                  "author": "kbn_",
                  "body": "Fun fact: most TVs only have 100 Mbps ethernet ports, simply because almost no one uses them wired! By contrast, they usually support whatever the latest high end WiFi standard is on release (mine supports 802.11ac, which tops out much higher than a measly 100 Mbps). So in general, you're almost certainly going to get better performance out of your wifi than out of ethernet unless your signal is absolutely trash.",
                  "score": 0,
                  "created_utc": 1731996287.0,
                  "replies": [
                    {
                      "id": "lxxec5x",
                      "author": "Mayor__Defacto",
                      "body": "Wifi drops way more packets.",
                      "score": 2,
                      "created_utc": 1732024939.0,
                      "replies": [
                        {
                          "id": "lxxq1y4",
                          "author": "kbn_",
                          "body": "Doesn’t matter for a TV.",
                          "score": 1,
                          "created_utc": 1732028970.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxxqhqq",
                      "author": "dandroid126",
                      "body": "I was once the lead engineer on a wireless router (though it has been several years since I stopped working on networking products). I would use 100 Mbps wired networking over 802.11ac every day of the week. Especially for streaming video, (but especially, especially for something with no buffering, like gaming). WiFi is too unstable. You get micro drops every minute. Yes, buffering exists to mitigate this, but sometimes your cat takes a nap in just the right spot, and now you're getting enough attenuation to need to drop quality. Not to mention wireless interference (not as big of a deal with 5GHz). Besides, streaming even 4K video is only like 15-25 Mbps depending on bitrate.",
                      "score": 1,
                      "created_utc": 1732029112.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxwxf8k",
              "author": "wagninger",
              "body": "I was interested in this and found that there is the Sony Bravia Pro series which are dumb panels because they are intended for use as commercial displays, so no smart tv stuff but software features to deactivate certain buttons on the remote etc., and very comparable image quality to their end consumer products at similar prices.\n\nFor my next TV, I’m definitely gonna try them out",
              "score": 3,
              "created_utc": 1732017915.0,
              "replies": []
            },
            {
              "id": "lxxniqi",
              "author": "dandroid126",
              "body": "I have a smart TV and just don't connect it to the internet.",
              "score": 1,
              "created_utc": 1732028142.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxswteq",
          "author": "Snake_eyes_12",
          "body": "I was like that for a while. Eventually had to suck it up and buy a cheap 4k. I don't even use it's built in smart OS and it just turns on to the Xbox automatically.",
          "score": 9,
          "created_utc": 1731957586.0,
          "replies": [
            {
              "id": "lxsx7cd",
              "author": "BeRandom1456",
              "body": "I have an LG tv. It does have web os but I don’t use it.  I love the Apple TV 4K. It’s the best set top box I’ve ever used.",
              "score": 6,
              "created_utc": 1731957703.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxt2jc6",
          "author": "OrionGrant",
          "body": "You won't be the target market in that case. \n\nThis will be for people already spending big money kitting out their homes and going, oh apple have a TV, I'll just get that.",
          "score": 6,
          "created_utc": 1731959316.0,
          "replies": []
        },
        {
          "id": "lxudbdr",
          "author": "methpartysupplies",
          "body": "Yep this is the GOAT strat right here.  I use my TV until it gets hit by lightning or whatever, then I’ll buy whatever one is on the floor at Walmart and plug another Roku into it and it’ll be amazing.  Apple isn’t going to be good enough to change that.",
          "score": 1,
          "created_utc": 1731974152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsl43b",
      "author": "Agitated-Cow4",
      "body": "Getting desperate to find that next money making product.",
      "score": 47,
      "created_utc": 1731954074.0,
      "replies": [
        {
          "id": "lxslg9r",
          "author": "Newtons2ndLaw",
          "body": "It's not going to be a legacy device like television.",
          "score": 25,
          "created_utc": 1731954176.0,
          "replies": [
            {
              "id": "lxslma2",
              "author": "Agitated-Cow4",
              "body": "Exactly. Next they will start selling iTires.",
              "score": 12,
              "created_utc": 1731954226.0,
              "replies": [
                {
                  "id": "lxsmjvk",
                  "author": "Newtons2ndLaw",
                  "body": "They need some of that tasty subscription service money. Too bad the fucked up iTunes when they were ahead of everyone else.",
                  "score": 13,
                  "created_utc": 1731954505.0,
                  "replies": [
                    {
                      "id": "lxtidip",
                      "author": "AustrianMichael",
                      "body": "They could‘ve made bank with streaming but the money coming in from sales on iTunes was too good to abandon…",
                      "score": 1,
                      "created_utc": 1731964134.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxuf72s",
                  "author": "mattmaster68",
                  "body": "As long as it’s for their iCars and AppleCare is changed to auto maintenance and repair, I’m done /j",
                  "score": 1,
                  "created_utc": 1731974806.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxsmnkp",
              "author": "igby1",
              "body": "Apple neural link confirmed",
              "score": 1,
              "created_utc": 1731954535.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxsp8zy",
          "author": "None",
          "body": "Capital growth must never end!",
          "score": 6,
          "created_utc": 1731955320.0,
          "replies": []
        },
        {
          "id": "lxtbov6",
          "author": "protekt0r",
          "body": "I keep waiting for them to make things like: a wall mount smart board/display that can be used as a central info hub (calendar, notes, video feed(s), etc).  I saw that they’re *finally* getting into the security camera business… I’ve been waiting for those forever.",
          "score": 2,
          "created_utc": 1731962119.0,
          "replies": [
            {
              "id": "lxvwxf2",
              "author": "snajk138",
              "body": "\"Just $500 each for the cameras, and an additional $150 for a mount.\"",
              "score": 1,
              "created_utc": 1731995537.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxtza77",
          "author": "verycoolalan",
          "body": "No, there's been speculation that the incoming Trump administration will want them to move something back to the US, they could start making the TVs here to try and satisfy the incoming administration as they might exclude them from their anticipated tariffs in China",
          "score": 1,
          "created_utc": 1731969368.0,
          "replies": []
        },
        {
          "id": "lxtixo7",
          "author": "AustrianMichael",
          "body": "The fumbled so hard the last few years. The Vision Pro was dead on arrival, most new tech is just for geeky YouTubers and even things like Siri are still almost as bad as they were back on the iPhone 4s. They totally missed the AI train and where incredibly late to the whole Home Assistant thing.",
          "score": 1,
          "created_utc": 1731964304.0,
          "replies": [
            {
              "id": "lxtoru6",
              "author": "Teaching_Relative",
              "body": "What are you talking about? All of these products have, from a monetary perspective (the only perspective that matters to a company), been massive successes. \n\nTheir stock price is up nearly 250% in the last 5 years. \n\nIn what way has Apple shit the bed?",
              "score": 7,
              "created_utc": 1731966069.0,
              "replies": []
            },
            {
              "id": "lxtpqab",
              "author": "AustrianMichael",
              "body": "Vision Pro? HomePod? Siri?",
              "score": 0,
              "created_utc": 1731966360.0,
              "replies": [
                {
                  "id": "lxtvnye",
                  "author": "Teaching_Relative",
                  "body": "Giant snake? Birthday cake? Chocolate shake? \n\nWhat does your comment mean?",
                  "score": 6,
                  "created_utc": 1731968201.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxsnr5q",
      "author": "Northernshitshow",
      "body": "Yours for $15,000.",
      "score": 19,
      "created_utc": 1731954868.0,
      "replies": [
        {
          "id": "lxszs5l",
          "author": "fmaz008",
          "body": "TV stand sold separately. Non VESA compatible. Wall mount sold separately with a pairing chip.",
          "score": 16,
          "created_utc": 1731958479.0,
          "replies": []
        },
        {
          "id": "lxtuqu9",
          "author": "etzel1200",
          "body": "Yeah, it’ll be a top end TV for luxury buyers. \n\nIn many ways Apple acts more like LVMH than Dell.",
          "score": 5,
          "created_utc": 1731967909.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsm5eh",
      "author": "w1n5t0nM1k3y",
      "body": "Comes with 1 HDMI port, Each additional HDMI port costs $200.\n\nHonestly don't see what Apple could offer this market. They alrady make and Apple TV box for people who want to have better access to their Apple content. Building that right into the TV isn't going to provide much added value. \n\nIf anything, I'd like to see more TVs being offered without built in smart TV functionality. It's never supported well enough, and you even have to get some kind of third party streaming device eventually anyway, so why not skip that and just make people buy a TV box from the beginning.",
      "score": 18,
      "created_utc": 1731954386.0,
      "replies": [
        {
          "id": "lxsnxmc",
          "author": "oboshoe",
          "body": "i remember thinking the same exact thing about phones.\n\nwhen it leaked that apple was working on a phone my thought was \"what could they possibly do better than what motorola is doing\"\n\nthat question seems silly now,  but phones had plateaued for awhile back then\n\ni can't think of much to add to TVs either.    but if the industry was limited to my imagination,  we would be somewhere in the 90s",
          "score": 21,
          "created_utc": 1731954921.0,
          "replies": [
            {
              "id": "lxsrsge",
              "author": "imightgetdownvoted",
              "body": "I’d be super interested in seeing what Apple could do for a tv.  I have an LG G3 which I love for its picture quality and esthetics. I bet Apple could make something even prettier.",
              "score": 6,
              "created_utc": 1731956079.0,
              "replies": []
            },
            {
              "id": "lxx4ro7",
              "author": "DoctorStrawberry",
              "body": "I used the iPod for my music at the time. So I carried around my Motorola phone and iPod everywhere. The idea of having those in the same device made too much sense to me so I immediately wanted an iPhone, not even initially caring about all the other things it could do beyond phone and music.",
              "score": 1,
              "created_utc": 1732021245.0,
              "replies": []
            },
            {
              "id": "lxspbof",
              "author": "w1n5t0nM1k3y",
              "body": "Maybe you were just being a little shortsighted then. Plenty of people were using full on PDAs with applications and touch screens and way more functionality than you could get form a phone at the time. It was just a matter of time until someone merged PDAs, Phones, MP3 Players etc into one convenient device.\n\nSure Apple still gets appreciation for doing it well. But it's not as if it wasn't  going to come in some form or another. Maybe someone else would have take a few more years, but it was bound to happen.",
              "score": -3,
              "created_utc": 1731955342.0,
              "replies": [
                {
                  "id": "lxstv7n",
                  "author": "3600CCH6WRX",
                  "body": "Before the iPhone, yeah, devices like it already existed. There were touchscreens, PDAs, phones, cameras, MP3 players, and web browsers all rolled into one. But what Apple nailed was the experience. The iPhone was simple and intuitive—no stylus, no tiny keyboard, just a clean, multitouch screen that actually worked well.\n\nOther smartphones back then? They felt clunky and overcomplicated. Apple made something anyone could pick up and just get.\n\nI don’t think this was just something that was bound to happen eventually. It wasn’t just about the technology being there. It was about the concept. Apple didn’t just build a better phone. They completely reimagined how people could interact with one. That’s the revolutionary part.",
                  "score": 6,
                  "created_utc": 1731956702.0,
                  "replies": []
                },
                {
                  "id": "lxsrc76",
                  "author": "oboshoe",
                  "body": "Obviously yes.\n\nI was one of those people using full on PDA and touch screens back then.   I was using a Palm 7 with wireless email all the way back in 1999 and I had been using a cell phone since 1987.   I've been an early adopter my whole life.\n\nThe case for a combined phone, camera, email, mp3 player, web browser just wasn't that obvious.\n\nMy Palm 7, Flip phone, laptop, mp3 player and pager all had their designated spots on my belt and laptop bag.\n\nIt's VERY easy to look back on things and say \"wow that was so obvious\".   But usually it's really not until someone comes along and makes it.\n\nI wonder what will be obvious 20 years from now?",
                  "score": 4,
                  "created_utc": 1731955945.0,
                  "replies": [
                    {
                      "id": "lxsu3gh",
                      "author": "w1n5t0nM1k3y",
                      "body": "Maybe you weren't aware of what other more advanced Palm Pilots were doing at the time\n\nThere where camera modules you could get and  plug into your palm pilot. There was a web browser for the palm pilot. Some palm pilots could play MP3s. You could send and receive email on many devices like Blackberries at the time.  Pretty much everything existed at the time. It was just waiting for someone to do it well in a nice cohesive package.",
                      "score": -4,
                      "created_utc": 1731956771.0,
                      "replies": [
                        {
                          "id": "lxszkya",
                          "author": "oboshoe",
                          "body": "i was pretty into that stuff.  still am.\n\ni think i was rocking an HP 6513 at that time which combined a few things.  what was unique about that HP is that was one of the first with the wifi and GPRS data.    but it did neither well.\n\nbut what we had seen prior to iphone is that attempts to combine products were all clunky as hell.\n\na combined phone and camera?   yes.   you got a mediocre phone and a mediocre camera.    professions would prefer a superior phone and a separate superior camera",
                          "score": 4,
                          "created_utc": 1731958418.0,
                          "replies": [
                            {
                              "id": "lxt1ku7",
                              "author": "w1n5t0nM1k3y",
                              "body": "I acknowledged a lot of what you are pointing out in my original post. Apple was the first to do it well. But that doesn't mean that we wouldn't have been at pretty much the same point in another year or two if Apple hadn't done it. \n\nThe original iPhone didn't have a professional level camera. Professionals still would have been carrying around an actual camera at the time. In case you need help remembering it, [here's an article](https://www.cnet.com/pictures/heres-what-the-2007-iphones-photos-look-like/) discussing the camera capabilities of the original iPhone.",
                              "score": -2,
                              "created_utc": 1731959025.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxtce3z",
              "author": "findMyNudesSomewhere",
              "body": "I mean, your original statement eventually turned out to be correct.\n\nThey haven't done any real \"innovations\" in phones outside of clear steps backward after 2011. \n\nRemoving wired headphone jack? Making batteries irreplacable? Refusing to follow global port standards until forced to? Planned obsolescence? \n\nIt's almost like Jobs was the only reason Apple was an innovative company.",
              "score": 0,
              "created_utc": 1731962333.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxtpxhd",
          "author": "ThatGuyTheyCallAlex",
          "body": "> want to have better access to their Apple content\n\nThat’s not what the Apple TV is for, though? It’s an alternative to the garbage UIs of every other smart TV manufacturer.",
          "score": 1,
          "created_utc": 1731966420.0,
          "replies": []
        },
        {
          "id": "lxy0172",
          "author": "Brendinooo",
          "body": "Apple already operates in a niche market for pro quality monitors, making a big one that goes on the wall doesn’t seem like a stretch.\n\nAlso, wild guess, but I suspect that some of their designers look at a product like the Samsung TV that looks like a picture frame and wish there were more options like that in the market",
          "score": 1,
          "created_utc": 1732032092.0,
          "replies": []
        },
        {
          "id": "lxsvmqx",
          "author": "MyVoiceIsElevating",
          "body": "Nah it’s a dongle.",
          "score": 1,
          "created_utc": 1731957231.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsnsqq",
      "author": "None",
      "body": "Why? Their 27\" 6k monitor costs the same as an LG OLED.\n\nWhile I'd love to see it, they're going to pull something people aren't going to like.",
      "score": 11,
      "created_utc": 1731954881.0,
      "replies": [
        {
          "id": "lxstmbr",
          "author": "None",
          "body": "Monitors cost the same as TVs across the board.\n\nYou are right that they can't compete as TV prices are extremely low margin and Apple cannot operate like that. \n\nThey would need to have also a new TV every year to compete. Which makes production even more expensive or risk being an expensive product that's also a lot worse than the competition.",
          "score": 9,
          "created_utc": 1731956627.0,
          "replies": [
            {
              "id": "lxt1gw6",
              "author": "None",
              "body": "Do they? I don't have a PC so I figured there'd be a huge gap in cost.\n\nI suppose at the end of the day you'd be paying for the logo and the software because there's no way Apple will be producing these displays themselves.",
              "score": 2,
              "created_utc": 1731958992.0,
              "replies": [
                {
                  "id": "lxt4z1p",
                  "author": "None",
                  "body": "Yes. TVs are one of the things that capitalism has managed to optimize the cost and delivery and even the processors inside. It's all fucking cheap considering their size, weight and components. Monitors are not there yet.\n\nApple Displays are usually more expensive than their competitors; they are also mostly better or have an unique offering. But a 27 inch monitor despite being so easy to ship can cost the same of the same quality 4k 55 inch TV that's difficult to ship.\n\nThe differences on the low end have grown smaller with time. However on high end equipment the difference is big. A 32 inch Samsung OLED monitor is roughly the same price as a 65 inch OLED. However when OLED or Mini Led monitors started coming out, they were 2000 dollars and more expensive than their TV counterparts.\n\nPrice comes with innovation, so in that sense the latest tech in Monitor comes later and you pay innovative prices for it; even when it's common on the TV market.",
                  "score": 3,
                  "created_utc": 1731960053.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxspmi4",
          "author": "fullload93",
          "body": "My concern is that they’re just going to shove the Apple TV hardware into something like their 6K monitor. Like that would just be silly and pretty pointless.",
          "score": 7,
          "created_utc": 1731955433.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxu0524",
      "author": "pauldavis1234",
      "body": "Serious martet top signal for APPL.\n\nBillions and billions and can not invent anything.\n\nVision PRO just halted production.\n\nStoped the Apple car last year after spending at least 10 billion.\n\n  \nSad to see",
      "score": 7,
      "created_utc": 1731969643.0,
      "replies": []
    },
    {
      "id": "lxszs52",
      "author": "crappy80srobot",
      "body": "Doubt it. Maybe a small research project but that's about it. There isn't any money in making a TV nowadays. The market is way to saturated. Nothing software wise apple could do would be any different than apple TV or Chromecast can offer. \n\nThe only thing I could see is some crazy high end 8k with some wild sound system that costs an absurd amount of money but that would probably sell as well as the vision pro.",
      "score": 3,
      "created_utc": 1731958479.0,
      "replies": [
        {
          "id": "lxwpp16",
          "author": "RedWineWithFish",
          "body": "You underestimate the power of the Apple ecosystem and brand.",
          "score": 1,
          "created_utc": 1732013645.0,
          "replies": [
            {
              "id": "lxx1yy8",
              "author": "crappy80srobot",
              "body": "Oh I'm sure they would sell but sell to Apple expectations it won't. Apple prides itself on key margins and units sold. It would just be another vision pro all over again. A solution looking for a problem. It would sell to influencers and people trying to flex but past that it would be a hard sell even for apple.",
              "score": 1,
              "created_utc": 1732020055.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxv7u0y",
      "author": "StinklePink",
      "body": "They are out of ideas.",
      "score": 3,
      "created_utc": 1731984842.0,
      "replies": []
    },
    {
      "id": "lxso9lm",
      "author": "Guy-Manuel",
      "body": "I could see this being interesting if they actually focus on performance. All the smart tvs I've had have been laggy messes necessitating buying a streaming stick or using a game console to have a decent experience. If they roll the apple tv box in to a nice display I could see it as a worthwhile option.",
      "score": 6,
      "created_utc": 1731955022.0,
      "replies": [
        {
          "id": "lxsqhyk",
          "author": "turnips64",
          "body": "That was true for me until LG.\n\nLG had made a point of wanting to get it right by buying and using PalmOS.\n\nThe complete interface isn’t a perfect design but I ignore all the crap and the bits I use are slick, fast and effective.",
          "score": 0,
          "created_utc": 1731955696.0,
          "replies": [
            {
              "id": "lxsyed4",
              "author": "MHWGamer",
              "body": "why do you get downvoted? LG OS (c9 model) works flawlessly. It became also shit as they added ads in it but luckily I am still on the old build where I don't have all this. \n\nThere isn't much more performance on the table that I would need. Logically your 400  bucks Walmart SmartTV won't cut it",
              "score": 1,
              "created_utc": 1731958062.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxsmqtb",
      "author": "staatsclaas",
      "body": "(X) doubt",
      "score": 2,
      "created_utc": 1731954562.0,
      "replies": []
    },
    {
      "id": "lxt02kd",
      "author": "Redeem123",
      "body": "“Tech company’s R&D department continued to do research.”\n\nBig revelation. ",
      "score": 2,
      "created_utc": 1731958568.0,
      "replies": []
    },
    {
      "id": "lxtbqox",
      "author": "macross1984",
      "body": "If Apple decide to jump into oversaturated TV market, it better have feature that only Apple have but Apple being Apple, their TV price if ever manufactured, will likely have very premium price tag.",
      "score": 2,
      "created_utc": 1731962135.0,
      "replies": []
    },
    {
      "id": "lxtf7oq",
      "author": "Cababage",
      "body": "TVs with smart functionality such a dime a dozen thing these days -  and them are so cheap - apples TV would be very costly and niche - I’m sure it would sell to people but I don’t think the return is there.\n\nLook at the failure of Apple Vision",
      "score": 2,
      "created_utc": 1731963180.0,
      "replies": []
    },
    {
      "id": "lxtskqk",
      "author": "SpaceXYZ1",
      "body": "As good as the current Apple TV set top box is, it can’t switch between multiple input sources of the TV. I’d like Apple to solve that problem first us instead of making their own TV which is overkill for me.",
      "score": 2,
      "created_utc": 1731967226.0,
      "replies": [
        {
          "id": "lxu9gco",
          "author": "fundiedundie",
          "body": "That’s my main complaint as well.",
          "score": 1,
          "created_utc": 1731972805.0,
          "replies": []
        },
        {
          "id": "lxvyrso",
          "author": "foggybottom",
          "body": "I think the better play for Apple is having the Apple TV allow inputs directly into the device. It would be great to allow a game system show up basically as another app in the interface.",
          "score": 1,
          "created_utc": 1731996520.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxuoy5j",
      "author": "Malodoror",
      "body": "This isn’t going to happen but I’d be concerned as a customer that Apple is getting deeper into the information harvesting business.",
      "score": 2,
      "created_utc": 1731978208.0,
      "replies": []
    },
    {
      "id": "lxut2oa",
      "author": "koken_halliwell",
      "body": "Launch price: 5000€ and a kidney",
      "score": 2,
      "created_utc": 1731979645.0,
      "replies": []
    },
    {
      "id": "lxv2u44",
      "author": "rudyattitudedee",
      "body": "Unless it’s $300 no one is interested.",
      "score": 2,
      "created_utc": 1731983049.0,
      "replies": []
    },
    {
      "id": "lxvc6je",
      "author": "BaddyMcFailSauce",
      "body": "Can’t wait for the additional 400$ remote",
      "score": 2,
      "created_utc": 1731986458.0,
      "replies": []
    },
    {
      "id": "lxvfde2",
      "author": "davidjschloss",
      "body": "These \"reportedly thinking\" articles are all bullshit. Companies are always thinking of things. Hell *I'm* thinking of making a TV.",
      "score": 2,
      "created_utc": 1731987682.0,
      "replies": []
    },
    {
      "id": "lxwqrhu",
      "author": "Darkest_Soul",
      "body": "It's going to cost 20 trillion dollars just for the stand, the remote is sold separately and if you plug a non apple verified power supply it will just explode.",
      "score": 2,
      "created_utc": 1732014291.0,
      "replies": []
    },
    {
      "id": "lxssxcm",
      "author": "atx620",
      "body": "TVs are a value-driven industry. You can get a pretty bad ass TV for $200. Apple is going to waltz in and try to make it $3000. There would need to be some crazy stuff in that TV to get me to buy it. I already have my Apple world hooked up to any TV through my Apple TV media player. \n\nI would need to see what they have in mind, but I'm just not seeing what they bring to the table that would be unique. It worked with the iPhone because the smart phone was a new thing. Samsung and LG kind of have their shit together when it comes to making TVs. Tougher nut to crack.",
      "score": 2,
      "created_utc": 1731956416.0,
      "replies": [
        {
          "id": "lxt87uz",
          "author": "marcanthonyoficial",
          "body": "TVs are not just value based. plenty of people buy mid and high-end TVs, and there's plenty of providers for TVs at prices much higher than 3000. Apple wouldn't care about that low end market, but that can already be said about some other brands.",
          "score": 2,
          "created_utc": 1731961057.0,
          "replies": []
        },
        {
          "id": "lxt19v2",
          "author": "fmaz008",
          "body": "First if it's apple, it will be a good screen. So they'd be competing against OLED TVs, not 200$ models.\n\nSecond, they could discontinue the Apple TV box and cram that into their TV.\n\nThen do a nice presentation and focus on 2-3 gizmo to give it a feeling of it being a revolution. \n\nSome people will flock to get a TV that fit their home ecosystem.",
          "score": 0,
          "created_utc": 1731958933.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxtd6rh",
      "author": "thejoshfoote",
      "body": "Just based on the amount of hate in this sub. I would say Apple TV would sell out",
      "score": 4,
      "created_utc": 1731962573.0,
      "replies": []
    },
    {
      "id": "lxsnj77",
      "author": "None",
      "body": "\\*Insert Jack Nicholson GIF\\* Have been waiting for this for years...",
      "score": 2,
      "created_utc": 1731954800.0,
      "replies": []
    },
    {
      "id": "lxspiss",
      "author": "GameOvaries18",
      "body": "60hz",
      "score": 2,
      "created_utc": 1731955402.0,
      "replies": [
        {
          "id": "lxt06eg",
          "author": "fmaz008",
          "body": "... as the first tier of a paid subscription.",
          "score": 0,
          "created_utc": 1731958600.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsp88t",
      "author": "fullload93",
      "body": "If they are just going to throw the AppleTV hardware inside an actual TV, I see no point in that. It’s like people who buy all in 1 desktop pcs because it’s built into the monitor. I see no point in that either because if the pc dies, so does your monitor.",
      "score": 1,
      "created_utc": 1731955313.0,
      "replies": [
        {
          "id": "lxt0fr4",
          "author": "fmaz008",
          "body": "Sounds to me that you are very clearly seeing the point in that, for Apple.",
          "score": 0,
          "created_utc": 1731958679.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsw7mb",
      "author": "dougc84",
      "body": "An AppleTV with an AppleTV built in to watch AppleTV+?",
      "score": 1,
      "created_utc": 1731957405.0,
      "replies": [
        {
          "id": "lxt1uff",
          "author": "fmaz008",
          "body": "As simple as the USB naming convention.",
          "score": 1,
          "created_utc": 1731959106.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxsza81",
      "author": "fmaz008",
      "body": "What would it be called?\n\nApple -actual- TV?",
      "score": 1,
      "created_utc": 1731958328.0,
      "replies": []
    },
    {
      "id": "lxtd0ll",
      "author": "Bleakwind",
      "body": "Na. Pretty sure they wouldn’t. \nApple only enters a field if they have enough control of a key technology. iPhone and iPad is their iOS. Mac was their os and now custom build chips.\nAirPods are their symbiosis with the iPhone and their whole ecosystem.\n\nVision Pro is their os as well as hardware proficient. \n\nApple Watch, again good plug in with their iPhone.\n\nTVs are very competitive. Apple don’t have a good display technology advantage. They don’t own or have much ip or manufacturing process that’s their own. Apple screen are either Samsung old or from some other vendors.\nThey have spend billions of microleds but that’s not gone anywhere yet.\n\nPlus tvs aren’t something people change every few years.",
      "score": 1,
      "created_utc": 1731962521.0,
      "replies": []
    },
    {
      "id": "lxtfq6c",
      "author": "DoubleSpook",
      "body": "Do it !",
      "score": 1,
      "created_utc": 1731963334.0,
      "replies": []
    },
    {
      "id": "lxtl78o",
      "author": "Ok-disaster2022",
      "body": "It will just be a branded and spec's LG Display OLED just like the Sony OLED. It could be nice.",
      "score": 1,
      "created_utc": 1731964983.0,
      "replies": []
    },
    {
      "id": "lxtuwde",
      "author": "fixtwin",
      "body": "Apple TV is getting worse with every update. It gets more and more ads and less utility. Also their YouTube app is mediocre. That being said - a TV with Apple lock in - no thanks 🙂‍↔️",
      "score": 1,
      "created_utc": 1731967957.0,
      "replies": []
    },
    {
      "id": "lxu62pn",
      "author": "lledyl",
      "body": "Just add more camera lens to the next iPhone /s",
      "score": 1,
      "created_utc": 1731971631.0,
      "replies": []
    },
    {
      "id": "lxucbb8",
      "author": "Consistent_Heat_9201",
      "body": "Ehrr, okay? We have enough TVs to last the remainder of humanity. But sure, make a whole ass TV when you could make a Firestick device.",
      "score": 1,
      "created_utc": 1731973802.0,
      "replies": []
    },
    {
      "id": "lxutycj",
      "author": "itsmatt-exe",
      "body": "If anything they should just be a platform partner like how Google or Roku (until recently) and just allow tv manufacturers to put Apple TV hardware inside their already good TVs. The processors inside the Apple TV boxes absolutely smoke anything integrated inside a tv at present",
      "score": 1,
      "created_utc": 1731979946.0,
      "replies": [
        {
          "id": "lxv0524",
          "author": "guitarfreak2105",
          "body": "I can’t think of a time Apple licensed anything to anyone else.",
          "score": 1,
          "created_utc": 1731982085.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxuv2mf",
      "author": "Redillenium",
      "body": "So Apple will have 3 different “Apple TV” products. Apple TV(streaming box), Apple TV+, and now Apple TV the television. Lol",
      "score": 1,
      "created_utc": 1731980325.0,
      "replies": []
    },
    {
      "id": "lxv7gcn",
      "author": "disgruntled-pigeon",
      "body": "Wonder what they’ll call it.",
      "score": 1,
      "created_utc": 1731984708.0,
      "replies": []
    },
    {
      "id": "lxve7bw",
      "author": "SnarkyOrchid",
      "body": "Their produced movies and tv almost all suck.  I had their service for a while and couldn't find anything they produced that I liked.  Their stuff is so formulaic and dull.",
      "score": 1,
      "created_utc": 1731987235.0,
      "replies": []
    },
    {
      "id": "lxve94u",
      "author": "witecat1",
      "body": "It will be triple the cost of a normal TV and is 2 generations behind in tech.",
      "score": 1,
      "created_utc": 1731987255.0,
      "replies": []
    },
    {
      "id": "lxveszx",
      "author": "monioum_JG",
      "body": "Smart TVs were cool until they’re not. \nFuck expiration dates.",
      "score": 1,
      "created_utc": 1731987466.0,
      "replies": []
    },
    {
      "id": "lxvildd",
      "author": "logangrowgan2020",
      "body": "The little doodad they need to make is a modern kitchen phone.  like calendar/photostream/really good wide angle intelligent cam, mics, and speakers for family facetime.",
      "score": 1,
      "created_utc": 1731988954.0,
      "replies": []
    },
    {
      "id": "lxvm5nj",
      "author": "pdzulu",
      "body": "Don’t do it, Apple. FAST is a red herring for the simple fact that modern Z, Alpha and whatever’s next don’t value “TV” at all - they’ll watch on a mobile first, tablet second, and if they’re playing Skyrim or TOTK a larger TV-sized screen makes more sense.",
      "score": 1,
      "created_utc": 1731990456.0,
      "replies": []
    },
    {
      "id": "lxvnyz9",
      "author": "samstar2",
      "body": "Apple’s best bet would likely be giving a Samsung or LG TV tvOS, and maybe an Apple SoC.",
      "score": 1,
      "created_utc": 1731991249.0,
      "replies": []
    },
    {
      "id": "lxvq7jk",
      "author": "Slizzard_73",
      "body": "Yeah at this point I refuse to pay more than $500-600 for a tv.  So until Oleds get down to that price I’m not paying the premium. And you know Apple would charge $1500 for the basic version, and $3500+ for the Oled version.  No thank you.",
      "score": 1,
      "created_utc": 1731992258.0,
      "replies": []
    },
    {
      "id": "lxvu8kz",
      "author": "UnemployedAtype",
      "body": "Not gonna lie, I tried Apple TV for the first time to buy the digital version of a full show. I got random parts of seasons 1 & 3, my wife got random parts of season 1 & 2. This was across 3 devices and we weren't doing anything weird.\n\nI couldn't access 4-6 at all.\n\nTheir support couldn't help us at all.\n\nI refunded that and gave up on my attempt at using Apple's tv products.\n\nI successfully got the exact same show, seasons 1-6 from a site I didn't know existed >!Apparently Fandango did something. I'm not endorsing them, but I didn't want to not explain. They bought or built their own streaming service and it has a stupid name. Regardless, we can watch the show all the way through without issues. It was Apple or this, and Apple didn't work at all no matter what we tried. They should let others do this stuff.!<",
      "score": 1,
      "created_utc": 1731994170.0,
      "replies": []
    },
    {
      "id": "lxvuzve",
      "author": "b_to_the_e",
      "body": "With an Apple price tag",
      "score": 1,
      "created_utc": 1731994549.0,
      "replies": []
    },
    {
      "id": "lxw3o6t",
      "author": "problah",
      "body": "If you have a smart TV now, you know they’re are super slow to respond. With the tech of Apples M4… you could have a ripping 55in iPad in no time.",
      "score": 1,
      "created_utc": 1731999318.0,
      "replies": []
    },
    {
      "id": "lxw4bw6",
      "author": "captaincoaster",
      "body": "No one in this thread has considered not owning a TV?",
      "score": 1,
      "created_utc": 1731999709.0,
      "replies": []
    },
    {
      "id": "lxw9bs5",
      "author": "I_heart_your_Momma",
      "body": "Who wants to overpay for a tv that will be no different than the others. Except for an overpriced Apple crest that lights up somewhere on the tv.",
      "score": 1,
      "created_utc": 1732002820.0,
      "replies": [
        {
          "id": "lxwgdu3",
          "author": "nothingexceptfor",
          "body": "Yep, and probably impossible or very hard to switch off",
          "score": 1,
          "created_utc": 1732007534.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxwnokk",
      "author": "RedRedditor84",
      "body": "Did they mean to say \"inventing\"?",
      "score": 1,
      "created_utc": 1732012381.0,
      "replies": []
    },
    {
      "id": "lxx45ud",
      "author": "Hen-stepper",
      "body": "They really should. Monitors have been one of their strength since the 2010s. The modularity of Apple TV surprised me because Apple typically likes to control everything.",
      "score": 1,
      "created_utc": 1732021004.0,
      "replies": []
    },
    {
      "id": "lxx5988",
      "author": "General_Tso75",
      "body": "Nobody needs a $10,000 TV",
      "score": 1,
      "created_utc": 1732021447.0,
      "replies": []
    },
    {
      "id": "lxxjcop",
      "author": "FamousFangs",
      "body": "\"Your displays are great, would you I consider making TVs? \n\n\"We might\"\n\nwrites spec article",
      "score": 1,
      "created_utc": 1732026734.0,
      "replies": []
    },
    {
      "id": "lxxvvd4",
      "author": "sabboom",
      "body": "Get ready for the US$38,000 19\" tv that only works with iPhone as a remote.",
      "score": 1,
      "created_utc": 1732030817.0,
      "replies": []
    },
    {
      "id": "lxxxf0d",
      "author": "unkwn-player",
      "body": "Thats hard to succeed because you can't carry tv everywhere like iPhones to show off. Its meant to be stationary. Hard to succeed because of that makn reason.",
      "score": 1,
      "created_utc": 1732031295.0,
      "replies": [
        {
          "id": "lxy9d5a",
          "author": "titanking4",
          "body": "Mac Mini and IMac and even AppleTV are successful products. Nothing touches iPhone sales numbers, but that’s expected considering how often we upgrade phones relative to our computers and TVs",
          "score": 1,
          "created_utc": 1732034899.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxyfv1z",
      "author": "i3order",
      "body": "20 grand for a 54 inch tv. 54 inch because Apple makes their own standards.",
      "score": 1,
      "created_utc": 1732036822.0,
      "replies": []
    },
    {
      "id": "lxyqe7r",
      "author": "AzulMage2020",
      "body": "No knew ideas/innovation until the next big tech grift :industry\" is figured out since AI is all about done by now. Hey !! Here's an idea! Why dont they just ask their AI what the next grift technology should be??? A grifter should know a grift shouldnt it?",
      "score": 1,
      "created_utc": 1732039912.0,
      "replies": []
    },
    {
      "id": "lxyy0kt",
      "author": "ThinkBiscuit",
      "body": "USB C only and 30 quid per dongle. Nah, you’re ok.",
      "score": 1,
      "created_utc": 1732042149.0,
      "replies": []
    },
    {
      "id": "ly023ij",
      "author": "minkaiser",
      "body": "Because there was a request, many apple users go for the full package for the easy integration, if I can have it all from one brand and all connected to a system easy to use, why not do it? More costly for sure but usually efficient",
      "score": 1,
      "created_utc": 1732054268.0,
      "replies": []
    },
    {
      "id": "ly2k4d3",
      "author": "AxBxCeqX",
      "body": "I would have bought the Apple TV over my $10k oled, assuming oled and good movie/gaming performance and warranty",
      "score": 1,
      "created_utc": 1732091329.0,
      "replies": []
    },
    {
      "id": "ly2mp7j",
      "author": "SniperDuty",
      "body": "People miss the point. It won't be a 'TV' it will be a combined gaming monitor / Mac screen / Apple TV. M4 has positioned itself for gaming and the current displays don't cut it at 60Hz.",
      "score": 1,
      "created_utc": 1732093070.0,
      "replies": []
    },
    {
      "id": "ly45dz7",
      "author": "BTiaugo",
      "body": "A tv that doubles as a heater— yay!",
      "score": 1,
      "created_utc": 1732117997.0,
      "replies": []
    },
    {
      "id": "lymsgl7",
      "author": "HansBooby",
      "body": "cool.  i can bring it home in my apple car",
      "score": 1,
      "created_utc": 1732393977.0,
      "replies": []
    },
    {
      "id": "lxsu2rs",
      "author": "Mrstrawberry209",
      "body": "They need to focus on a cheaper AR/VR headset.",
      "score": 1,
      "created_utc": 1731956766.0,
      "replies": []
    },
    {
      "id": "lxtdbbu",
      "author": "RatPackRaiders",
      "body": "If I could get an LG OLED panel with Apple OS that would be 🤌",
      "score": 1,
      "created_utc": 1731962611.0,
      "replies": []
    },
    {
      "id": "lxubew7",
      "author": "ihatefabrizio",
      "body": "Can’t wait to pay $10k for a TV",
      "score": 1,
      "created_utc": 1731973490.0,
      "replies": []
    },
    {
      "id": "lxt38gb",
      "author": "silver2006",
      "body": "With a dedicated TV stand for only 6999,99?  :D",
      "score": 0,
      "created_utc": 1731959527.0,
      "replies": []
    },
    {
      "id": "lxt5v10",
      "author": "kclongest",
      "body": "I like to keep my TVs longer than Apple’s product lifecycle so that’d be a big fat nope for me.",
      "score": 0,
      "created_utc": 1731960327.0,
      "replies": []
    },
    {
      "id": "lxtnr2g",
      "author": "karateninjazombie",
      "body": "Apple. Trying all the things like and throwing them away quickly when they don't really work, just like Google does. But with hardware.",
      "score": 0,
      "created_utc": 1731965760.0,
      "replies": []
    },
    {
      "id": "lxuvxpw",
      "author": "CAKE_EATER251",
      "body": "Fuck apple",
      "score": 0,
      "created_utc": 1731980616.0,
      "replies": []
    },
    {
      "id": "lxvjjih",
      "author": "VitaminDismyPCT",
      "body": "Yeah I’d buy it. Apple ecosystem rocks",
      "score": 0,
      "created_utc": 1731989345.0,
      "replies": []
    },
    {
      "id": "lxsxtm9",
      "author": "BlowOnThatPie",
      "body": "Great. More walled gardens by Apple.",
      "score": -2,
      "created_utc": 1731957889.0,
      "replies": []
    },
    {
      "id": "lxsqzng",
      "author": "Stalvos",
      "body": "No thanks.  It will be twice as expensive and charges for fixing it will twice as e pensive as well.  Only the apple zombies would buy it.",
      "score": -1,
      "created_utc": 1731955842.0,
      "replies": []
    },
    {
      "id": "lxsp7pp",
      "author": "crevassier",
      "body": "Smart TVs are such garbage.. I get why they do it, as a way to get their mitts on most people's data/viewing habits, but the ATV is such a nice stand alone unit. Clean, simple and NO FREAKING ADS ON THE DASH is why I use it on my main TV vs the FireTV and GoogleTV variants in other rooms. \n\nBaked in TV interfaces bog down and age so poorly. App updates become an issue and often quirks between platforms becomes more and more apparent.",
      "score": 0,
      "created_utc": 1731955309.0,
      "replies": []
    },
    {
      "id": "lxsuwf2",
      "author": "Nehal1802",
      "body": "Just make a cheap 12 inch M4 MacBook and it’ll end up being more profitable than a market that’s already saturated with products",
      "score": 0,
      "created_utc": 1731957012.0,
      "replies": []
    },
    {
      "id": "lxt0o37",
      "author": "jbdi6984",
      "body": "Must be money to be made on fixing that broken junk",
      "score": 0,
      "created_utc": 1731958749.0,
      "replies": []
    },
    {
      "id": "lxt4zv0",
      "author": "Maleficent-Squash746",
      "body": "And call it the apple tv???",
      "score": 0,
      "created_utc": 1731960060.0,
      "replies": []
    },
    {
      "id": "lxt542d",
      "author": "FloridaGuy2589",
      "body": "What I’m hoping for is a FaceTime device I can stick on a shelf and stream to my tv so my kids can FaceTime grandparents without having to use my phone.",
      "score": 0,
      "created_utc": 1731960095.0,
      "replies": []
    },
    {
      "id": "lxt699d",
      "author": "None",
      "body": "They don't need a TV, but turning TVs into much more robust and interactive platform is a ridiculously huge and mostly untapped market. Apple TV and Nvidia Shield or game consoles are only scratching the surface of what a 4k TV in most homes could really do. \n\nIt boggles my mind that the world most popular entertainment platform keeps getting overlooked since the computer/internet/smartphone boom. After smartphones and cheap mult-core chips flooded the market they should have been all over the TV platform vs thinking smartphones and VR are the future. A TV has far more ergonomic and long term use potential than tablets or smartphones or even computers, meaning you can get the users to sit there ass in front of it for far more hours per day on average.",
      "score": 0,
      "created_utc": 1731960449.0,
      "replies": []
    },
    {
      "id": "lxtbk4y",
      "author": "IdealIdeas",
      "body": "Why not just make an apple stick that can just make any tv act like an apple tv when plugged in?\n\nIt could just hijack all the tv features like settings, volume, wifi connectivity, Bluetooth, ect..\n\nLike, so long as you have the apple stick plugged in, you could literally throw away the original tv remote and still have full and complete access to what the remote would have offered\n\nThis even could be useful for people who have a tv that has a bricked OS but otherwise would work just fine.",
      "score": 0,
      "created_utc": 1731962079.0,
      "replies": [
        {
          "id": "lxtqc5z",
          "author": "ThatGuyTheyCallAlex",
          "body": "This is precisely what the existing Apple TV does?",
          "score": 3,
          "created_utc": 1731966543.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxul79o",
      "author": "Prize_Instance_1416",
      "body": "Feeders at Walmart are salivating over 50” sets for $138. Picture sucks compared to the best, yet good compared to a 25” zenith console. There’s no room for a mass produced higher end tv. It’s not a status symbol that an iPhone is",
      "score": 0,
      "created_utc": 1731976894.0,
      "replies": []
    },
    {
      "id": "lxumbp3",
      "author": "RedditCollabs",
      "body": "They have incredible displays with great processing and top 3rd party support. I'm down.",
      "score": 0,
      "created_utc": 1731977285.0,
      "replies": []
    },
    {
      "id": "lxv3o8w",
      "author": "gimmeslack12",
      "body": "Cool",
      "score": 0,
      "created_utc": 1731983352.0,
      "replies": []
    },
    {
      "id": "lxt6eld",
      "author": "treehumper83",
      "body": "No it isn’t.",
      "score": -1,
      "created_utc": 1731960495.0,
      "replies": []
    },
    {
      "id": "lxszeav",
      "author": "MHWGamer",
      "body": "it is funny how many here think that apples costumers play in the same league as costumers for other brands. It is literally the point of Apple to be a desireable brand first and foremost. If they do a $2000-3000 Tv, so many people will buy it just because apple is on it. They can sell basically anything consumer tech related and succeed with the only exception being the vision pro (ultra niche market for an ultra high price, targeted mostly on consumers).\n\nThe problem is probably that it will be too much effort to cooperate and work the fab stuff when they just have to add another button on the iphone and everyone buys the new one",
      "score": -2,
      "created_utc": 1731958362.0,
      "replies": [
        {
          "id": "lxuojgq",
          "author": "Straight-Ad6926",
          "body": "Consumers are becoming more discerning and value-driven. Not everyone is willing to pay a premium just for the Apple logo especially when there are high-quality alternatives available at lower prices…. The tech market is highly competitive and even Apple needs to innovate and deliver real value to maintain its market position. The success of a $2000-3000 TV would depend on its features, performance, and how it compares to other high-end options not just the brand name.",
          "score": 1,
          "created_utc": 1731978062.0,
          "replies": [
            {
              "id": "lxuqk6w",
              "author": "MHWGamer",
              "body": "that is such an insane take that I actually have to lol. Like nothing against you but the sentence:   'Apple needs to innovate and deliver real value to maintain its market position' is irony gold with apples current iphone  run-up. The iphone 16 is literally so not inovative that even apple fans say it is really lame this year'\nAnd I bet that apple makes more margin than ever. \n\n2-3k high end tv at like 77\" is pretty normal, so I've even gone that route for apple and not the 1000 bucks monitor stand -route.\nIn a world where us teenagers still think that if you don't have an iphone, you are broke, you seriously come around and speak of apple people are value-driven?",
              "score": 1,
              "created_utc": 1731978774.0,
              "replies": [
                {
                  "id": "lxvv72r",
                  "author": "Straight-Ad6926",
                  "body": "Dude even if the iPhone 16 isn’t groundbreaking, Apple’s innovation isn’t just about hardware 🤦🏾‍♂️ They’ve been focusing a lot on software and services which are areas where they continue to add value. The ecosystem they’ve built keeps users invested in their products. So, while the latest iPhone might seem underwhelming, the overall value proposition of Apple’s ecosystem still holds strong for many users",
                  "score": 1,
                  "created_utc": 1731994649.0,
                  "replies": [
                    {
                      "id": "lyi0g6o",
                      "author": "MHWGamer",
                      "body": "what a cope lmao. \nHaven't read your answer completely before and extra went back after mkbhd's new video about apple ai being ok but nothing special but that wasn't even your argument.\n\nWho the fuck is talking about apples ecosystem? the topic was about releasing new hardware without much innovation and people still mindlessly will buy it. Iphone 16 as the literal prime example. Hence Apple can just sell good tv's and they will sell with minimal innovation (double oled like in the ipad might be a good call). Again why do you go off talking about its ecosystem, software and services when we all know it is good and doesn't CONTRADICT my statement. A tv would literally broaden that ecosystem and is the *thing* that would make it so easy to sell the tv for a $500 special apple tax. you are literally helping me by coping so hard that the iphone is lame af this year",
                      "score": 1,
                      "created_utc": 1732319745.0,
                      "replies": [
                        {
                          "id": "lyiyie1",
                          "author": "Straight-Ad6926",
                          "body": "The point about Apple’s ecosystem is actually very relevant 💀The reason people buy new Apple hardware even with minimal innovation is because of the seamless integration and the overall experience that Apple offers. The ecosystem is a major selling point and it adds value to every new piece of hardware including the iPhone 16. People are not just buying a phone they’re buying into a system that works flawlessly together. This is why even a TV with minimal innovation would still sell well cuz it’s not just about the hardware specs but the added value of being part of the Apple ecosystem. That fact that you think it might seem like a “cope” to bring up the ecosystem just shows how uneducated you are when it comes to understanding why Apple products continue to sell so successfully.",
                          "score": 1,
                          "created_utc": 1732333229.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxtbky5",
      "author": "LeanderT",
      "body": "But you can only watch AppleTV with it?",
      "score": -2,
      "created_utc": 1731962086.0,
      "replies": []
    }
  ]
}