{
  "post": {
    "title": "EU commission assessing whether the iPad offers sufficient interoperability with third-party headphones and 'smart pens' ",
    "author": "a_Ninja_b0y",
    "id": "1gjhbm5",
    "score": 403,
    "created_utc": 1730735075.0,
    "selftext": "",
    "num_comments": 77,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gjhbm5/eu_commission_assessing_whether_the_ipad_offers/"
  },
  "comments": [
    {
      "id": "lvdman8",
      "author": "MulderXF",
      "body": "How about EU force Sony to lett me use my Bose bluetooth headphones with my PS5!",
      "score": 187,
      "created_utc": 1730741100.0,
      "replies": [
        {
          "id": "lvdwtc4",
          "author": "kamilman",
          "body": "Or AirPods with the PS5. It's just so frustrating that it still cannot be done, after all those years...",
          "score": 65,
          "created_utc": 1730744158.0,
          "replies": [
            {
              "id": "lvgcrw6",
              "author": "MzBlackSiren",
              "body": "the fact that you can use them with the switch but not ps5 is crazy",
              "score": 13,
              "created_utc": 1730771941.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvemgx7",
          "author": "ItsAMeUsernamio",
          "body": "You can’t even use Sony Bluetooth headphones wirelessly with the PS5 unless you buy one of the specifically built for the PS5 headphones.",
          "score": 26,
          "created_utc": 1730751709.0,
          "replies": []
        },
        {
          "id": "lvf60ex",
          "author": "StaringSnake",
          "body": "Sorry I got a better one. How about letting me use my WH1000XM3?? They’re made by Sony! They were quite expensive, but still need to use a cable to the control for unknown reasons and the microphone can’t be used?? Wut??",
          "score": 14,
          "created_utc": 1730757534.0,
          "replies": []
        },
        {
          "id": "lvh4w66",
          "author": "marcussacana",
          "body": "I wanna run Linux on my PS5 as well.",
          "score": 8,
          "created_utc": 1730782459.0,
          "replies": [
            {
              "id": "lvhrxbo",
              "author": "Suckage",
              "body": "You can’t even do that on PS3’s anymore unless you have one that hasn’t been updated since like 2009.\n\nI never planned to use it, but I was really upset when they patched that feature out.",
              "score": 3,
              "created_utc": 1730795657.0,
              "replies": [
                {
                  "id": "lvj7xdf",
                  "author": "marcussacana",
                  "body": "You can in PS4 currently, some modders are looking a way in PS5 but you need a pretty outdated console as well.",
                  "score": 1,
                  "created_utc": 1730819921.0,
                  "replies": []
                },
                {
                  "id": "lvi5di6",
                  "author": "diacewrb",
                  "body": "PS2 also had a Linux kit.\n\nThe PS3 was used in supercomputer clusters, Sony lost money on each PS3 sold, but made up the difference on games and accessories, then these clusters were costing them money.\n\nThe US Air Force was legendary for buying 1,760 consoles and building one of the world's most powerful supercomputers at a fraction of the normal price. If they had used a regular supercomputer then the cost would have been 10 times as much.",
                  "score": 0,
                  "created_utc": 1730804588.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvejygz",
          "author": "xRyozuo",
          "body": "If you can, use an aux cable to the speaker. Way better anyways",
          "score": -7,
          "created_utc": 1730750962.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvd5ohl",
      "author": "Heisenberg_235",
      "body": "Can connect both via Bluetooth. Surely a non issue",
      "score": 78,
      "created_utc": 1730736116.0,
      "replies": [
        {
          "id": "lvdivnv",
          "author": "Tandoori7",
          "body": "They still use aac rather than other open standards that offer better sound quality.",
          "score": 23,
          "created_utc": 1730740111.0,
          "replies": [
            {
              "id": "lvdl8c8",
              "author": "Sylvurphlame",
              "body": "So are we thinking it’s an open standards thing? But they work fine when playing MP3’s or things off the web, do they not?",
              "score": 4,
              "created_utc": 1730740796.0,
              "replies": [
                {
                  "id": "lvdm23f",
                  "author": "Tandoori7",
                  "body": "Am talking about LDAC, a popular encoder for Bluetooth that has way better quality than aac.\n\nApple uses a modified aac in their headphones, but if you connect Sony/Bose/anything else the quality will be way worst in iphones/ipads than in iMacs,android, windows and even Linux.\n\nI learned this the hard way when I bought my sister some xm4s and they sounded way worst in her iphone than my android.",
                  "score": 21,
                  "created_utc": 1730741032.0,
                  "replies": [
                    {
                      "id": "lvec45q",
                      "author": "ThinkExtension2328",
                      "body": "To be fair all Bluetooth standards sound like shit, even LDAC is terrible shit. \n\nHeadphone jacks have existed for so long for a reason. But nowadays the mix and master of music is kinda shit too soo that’s fun. \n\nIf you think I’m being old man yells at clouds I challenge you to listen to “Michael Jackson’s thriller” on a good pair of wired headphones and then listen to any modern song. Modern stuff is just loud and distorted and lacks the dynamic range and soundstage the old stuff had.",
                      "score": 7,
                      "created_utc": 1730748644.0,
                      "replies": [
                        {
                          "id": "lvefopr",
                          "author": "Tandoori7",
                          "body": "I know, I am the weirdo at work that carries a fucking DAP.",
                          "score": 7,
                          "created_utc": 1730749705.0,
                          "replies": [
                            {
                              "id": "lveg8vm",
                              "author": "ThinkExtension2328",
                              "body": "But it makes a fucking difference , people just don’t get it. \n\nI also love the “but you can’t hear more than mp3” , I’m always left like if your speaker wasn’t out of a cereal box you can literally feel the lower base.\n\nI need me the new Hip dac.",
                              "score": 4,
                              "created_utc": 1730749870.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lveef2x",
                      "author": "reddltlsfvckingdumm",
                      "body": "worse\\* WORSE\\*, you wrote it wrong twice, smh",
                      "score": 2,
                      "created_utc": 1730749330.0,
                      "replies": []
                    },
                    {
                      "id": "lvdosqb",
                      "author": "Sylvurphlame",
                      "body": "Oh. Okay. I see",
                      "score": 1,
                      "created_utc": 1730741826.0,
                      "replies": []
                    },
                    {
                      "id": "lvdxpaz",
                      "author": "abrahamisaninja",
                      "body": "Make sure you install the Sony Connect app if you haven’t already. XM4 sounds great on iPhone but if you don’t use the app, the EQ tends to sound really flat.",
                      "score": -4,
                      "created_utc": 1730744417.0,
                      "replies": [
                        {
                          "id": "lvevplm",
                          "author": "Tandoori7",
                          "body": "It's not about EQ, it's about sound being all compressed due to a shitty codec.",
                          "score": 2,
                          "created_utc": 1730754421.0,
                          "replies": [
                            {
                              "id": "lvewwhe",
                              "author": "abrahamisaninja",
                              "body": "Yeah idk about all that. The xm line is always praised on /r/headphones. Personally, I think they sound pretty great.",
                              "score": 2,
                              "created_utc": 1730754777.0,
                              "replies": [
                                {
                                  "id": "lvf8dvc",
                                  "author": "Tandoori7",
                                  "body": "It's good enough for \"street headphones\",but they are kinda bassy and lack clarity.i wouldn't take anything else on the metro tough",
                                  "score": -1,
                                  "created_utc": 1730758280.0,
                                  "replies": [
                                    {
                                      "id": "lvhn181",
                                      "author": "abrahamisaninja",
                                      "body": "Well for 99.9999% of people who use headphones, I think it’s safe to say most of us aren’t using them primarily to mix or master music most of the time. So if the headphones trend more “street” as you say, I think that’s perfectly fine and hell, even preferred.",
                                      "score": 1,
                                      "created_utc": 1730792416.0,
                                      "replies": [
                                        {
                                          "id": "lvio6sr",
                                          "author": "Tandoori7",
                                          "body": "As I said, I wouldn't take anything else when riding the metro.",
                                          "score": 1,
                                          "created_utc": 1730813263.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvdlvo4",
          "author": "DreVahn",
          "body": "My company orders 30 Airs with pens. Vendor ships new Airs with M4 and older model Apple pens. They don't sync. Have to return the 30 pens for newer model.\n\nYes, that's on the vendor but that says it's not so easy...",
          "score": 16,
          "created_utc": 1730740982.0,
          "replies": []
        },
        {
          "id": "lvda8g0",
          "author": "tfrw",
          "body": "I mean apple headphones do have advantages. We also don’t know if apple is making headphone makers pay apple for validating headphones.",
          "score": 4,
          "created_utc": 1730737536.0,
          "replies": [
            {
              "id": "lvdgesb",
              "author": "Dependent-Zebra-4357",
              "body": "Where is Apple “validating” headphones? Surely if they were, there would be a prominently displayed list on their website.\n\nAnd I think it’s pretty dangerous to go after a product because it has advantages over competing products. That’s the path to everything just being the lowest common denominator. What is the motivation to improve your products when the government is going to block you from shipping that improvement, or force you to give that improvement to your competition.",
              "score": 8,
              "created_utc": 1730739387.0,
              "replies": [
                {
                  "id": "lvdpisl",
                  "author": "Got2Bfree",
                  "body": "Try to pair air pods and any other Bluetooth headphones.\n\nThe airpods connect immediately when you open the case.\n\nApple could open up an API so every pair of headphones could behave this seamlessly.\n\nThis has nothing to do with the lowest common denominator. This is just apple artificially locking their system.",
                  "score": 3,
                  "created_utc": 1730742039.0,
                  "replies": [
                    {
                      "id": "lve59qw",
                      "author": "Dependent-Zebra-4357",
                      "body": "It’s not just a software difference that can be provided via an API call though. The reason AirPods work so well with Apple products is because of the custom W1 and more recently H1/H2 chips Apple designed for the AirPods.\n\nDo you think Apple should be forced to sell that chip to their competitors? If so, where does that line of thinking end? Should they be required to sell M series chips also?",
                      "score": 8,
                      "created_utc": 1730746620.0,
                      "replies": [
                        {
                          "id": "lvedd4q",
                          "author": "Got2Bfree",
                          "body": "A Auto connect feature similar to air pods is available in Android, so this is 100% doable with just Bluetooth.\n\nA chip is of course IP.\nI draw the line at artificial locking of systems.\n\nThird party manufactures should have the possibility to interact with system components to full extent.\n\nLocking face ID and true tone is another perfect example.\nI'm pro right to repair.",
                          "score": -5,
                          "created_utc": 1730749016.0,
                          "replies": [
                            {
                              "id": "lveqrd7",
                              "author": "INACCURATE_RESPONSE",
                              "body": "Bluetooth auto connect works on iPhone. It just sucks because it gets stolen by any other device that has it turned on.",
                              "score": 4,
                              "created_utc": 1730752969.0,
                              "replies": [
                                {
                                  "id": "lvf593h",
                                  "author": "Got2Bfree",
                                  "body": "No, I mean the one with a popup where you don't have to click on the device you want to connect. \n\nThere's something similar in Android which only Bluetooth devices support.",
                                  "score": -1,
                                  "created_utc": 1730757305.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvecff3",
                  "author": "ThinkExtension2328",
                  "body": "Modern tech companies enter the chat",
                  "score": 1,
                  "created_utc": 1730748736.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvdwy5v",
              "author": "Hikashuri",
              "body": "Granted that $2 bluetooth temu ears work on iPhones, *I don't think there's any kind of validation.*",
              "score": 1,
              "created_utc": 1730744198.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lve0bkx",
          "author": "None",
          "body": "Any recommendations for those of us who have not used Bluetooth yet?",
          "score": 1,
          "created_utc": 1730745178.0,
          "replies": [
            {
              "id": "lve0i26",
              "author": "Heisenberg_235",
              "body": "Use it?",
              "score": 2,
              "created_utc": 1730745231.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvitsah",
          "author": "benanderson89",
          "body": ">Can connect both via Bluetooth. Surely a non issue\n\nAbsolute non-issue. I've used my AirPods Max with my Xiaomi Phone and my Heavys H1H with my iPad. Likewise, you can already buy a third party pen for the iPad and it works absolutely fine.",
          "score": 1,
          "created_utc": 1730815270.0,
          "replies": []
        },
        {
          "id": "lvdczf5",
          "author": "Hobbit1996",
          "body": "apple literally makes other devices perform worse... \n\njust an example:\n\nWas in a 2012 fiat (forgot the model i'm not a car person) 2 android devices play music just fine, apple connects and the bitrate of what we are listening to is clearly lower, nearly unusable. Why? idk ask apple, ig we should've had a newer car with carplay or something?",
          "score": -10,
          "created_utc": 1730738374.0,
          "replies": [
            {
              "id": "lvdx8ik",
              "author": "Hikashuri",
              "body": "Seems like a cool invented story, I can use my Samsung buds just fine with Apple.",
              "score": 6,
              "created_utc": 1730744282.0,
              "replies": [
                {
                  "id": "lve0z1k",
                  "author": "Hobbit1996",
                  "body": "i gain so much by lying about this, shame you didn't believe it i would've made millions off of it",
                  "score": 0,
                  "created_utc": 1730745369.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvdpcvz",
              "author": "Miguelboii",
              "body": "It probably went in some sort of old headset mode. With older headsets (I think it depends on the bluetooth version) it lowers the audio quality presumably to be able to get enough data from the microphone. \n\nThis is something that is like that on iOS and Android. I experienced this myself once when I wanted to use an early 2010 single in-ear headset as wireless headphones.",
              "score": 2,
              "created_utc": 1730741990.0,
              "replies": [
                {
                  "id": "lvdqssd",
                  "author": "Hobbit1996",
                  "body": "i'm getting downvoted but why does it work with android and not ios?",
                  "score": 4,
                  "created_utc": 1730742409.0,
                  "replies": [
                    {
                      "id": "lvdrrqw",
                      "author": "Miguelboii",
                      "body": "The way the devices handle it is just different. Quite possibly, as soon as you do anything with your microphone on the android phone, it also switches to this low quality audio mode.",
                      "score": 1,
                      "created_utc": 1730742691.0,
                      "replies": [
                        {
                          "id": "lve0hmk",
                          "author": "Hobbit1996",
                          "body": "but i'm talking about music, nothing to do with mic or calls",
                          "score": -1,
                          "created_utc": 1730745228.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lve9wne",
                  "author": "picardo85",
                  "body": "Headset mode on my BOSE QC35 sucks ass for anything but talking. They are great for everything else as long as that mode doesn't activate.\n\n(On pc and android phone)",
                  "score": 1,
                  "created_utc": 1730747987.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvdjwbb",
          "author": "Sylvurphlame",
          "body": "They’ll make it into an issue.\n\nIt also already works with at least a couple third-party smart pens, I thought?",
          "score": 0,
          "created_utc": 1730740408.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvdn2bz",
      "author": "AsshollishAsshole",
      "body": "LOL  \nHow about smartwatches?\n\nI can't use the latest samsung gear with an iphone. I believe it is the same with apple watch and samsung phone.  \nSame for basically any manufacturer",
      "score": 26,
      "created_utc": 1730741319.0,
      "replies": []
    },
    {
      "id": "lvdgxtk",
      "author": "kawag",
      "body": "I think this is a bit excessive. Smart pens do not seem like such a significant market that there would be antitrust concerns.\n\nI don’t think it’s fundamentally anticompetitive to sell accessories without establishing a full third-party ecosystem. A PlayStation does not work with Xbox controllers (all third-party controller support is extremely limited), and while I think that’s a bit consumer-unfriendly, I don’t think it’s an antitrust matter.",
      "score": 28,
      "created_utc": 1730739541.0,
      "replies": [
        {
          "id": "lviiccs",
          "author": "NuttFellas",
          "body": "Every other tablet vendor offers it. You're asking why, but we should really be asking why not? It may not be much but it has been a problem for a while, as other users have mentioned with smartwatch compatibility etc.",
          "score": 3,
          "created_utc": 1730810982.0,
          "replies": []
        },
        {
          "id": "lve4rze",
          "author": "Miculmuc90",
          "body": "Someone in Brussels is mad because he can’t use iPhone mirroring and apple intelligence.",
          "score": 12,
          "created_utc": 1730746477.0,
          "replies": [
            {
              "id": "lveq0db",
              "author": "tacmac10",
              "body": "Several people in Brussels are getting bribes paid by other tech companies to go after apple.",
              "score": 14,
              "created_utc": 1730752749.0,
              "replies": [
                {
                  "id": "lvkg5my",
                  "author": "lslg",
                  "body": "Source?",
                  "score": 0,
                  "created_utc": 1730832832.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvetap4",
      "author": "wallstreet-butts",
      "body": "Why doesn’t the EU commission just design all our tech if they’re so smart.",
      "score": 11,
      "created_utc": 1730753710.0,
      "replies": [
        {
          "id": "lvftnod",
          "author": "puffferfish",
          "body": "For real. Should just pull Apple out of the EU. Let everyone enjoy their androids.",
          "score": -2,
          "created_utc": 1730765285.0,
          "replies": [
            {
              "id": "lvn4dec",
              "author": "None",
              "body": "Downvotes are from Android people hahaha",
              "score": 1,
              "created_utc": 1730863929.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvdcphf",
      "author": "elkeye86",
      "body": "never had an issue with pairing headphones and tbh when it came to getting a \"smart pen\" i didnt look at others i just got an apple pencil when it went on sale",
      "score": 9,
      "created_utc": 1730738290.0,
      "replies": [
        {
          "id": "lvf0f9a",
          "author": "oomfaloomfa",
          "body": "What is it for?",
          "score": 1,
          "created_utc": 1730755842.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvdx49c",
      "author": "Hikashuri",
      "body": "Can the EU start focusing on important things that people care about? I couldn't care less about this, I've used other brand earphones with iPhone's with zero issues, the only problem is using apple airpods with another phone brand, but there's third party apps for that.",
      "score": 16,
      "created_utc": 1730744247.0,
      "replies": [
        {
          "id": "lvegs6c",
          "author": "Poopyman80",
          "body": "I much prefer if the eu keeps punching apple. Simply because I enjoy seeing them get put on their place.",
          "score": -21,
          "created_utc": 1730750026.0,
          "replies": [
            {
              "id": "lvhe7cn",
              "author": "chris_redz",
              "body": "And what is their place? They have a product that they came up with and nobody is forcing you to use it. They can put the price they want and cap it the way they want and still you have no say over it. If you don’t like it, don’t buy it. Nobody buys it, they disappear or they give us what we want. Government should and do have better things to focus on",
              "score": 1,
              "created_utc": 1730787084.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvhkd94",
      "author": "wizardmagic10288",
      "body": "I don’t get. I’ve been an apple user since 2005. MacBooks, iPads, iPods, Mac mini, Apple Watches, several iPhones… All of my accessories are 3rd party with no issues. Perfect example is my faux Apple Pencil. Everyone think it’s the real deal but I purchased it via AliExpress. No regrets. Seems to me that the EU is wasting their time and people’s money.",
      "score": 2,
      "created_utc": 1730790717.0,
      "replies": [
        {
          "id": "lvia95n",
          "author": "slavchungus",
          "body": "as per usual honestly this is just getting ridiculous whats next they will demand dual booting android and ios on iphone",
          "score": 0,
          "created_utc": 1730807275.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvf6kor",
      "author": "Consistent-Poem7462",
      "body": "The european union really doesn't like the free market",
      "score": 4,
      "created_utc": 1730757708.0,
      "replies": [
        {
          "id": "lvhe8t4",
          "author": "chris_redz",
          "body": "Exactly",
          "score": -3,
          "created_utc": 1730787107.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvg9pzc",
      "author": "Anarch33",
      "body": "I’m an apple hater as much as a next person but I’ve experienced zero issues whatsoever connecting generic Bluetooth headphones to Apple devices and AirPods to non Apple devices lol\n\nLike if anything force Apple to open their smartwatch apis instead of",
      "score": -1,
      "created_utc": 1730770877.0,
      "replies": []
    },
    {
      "id": "lvgwchr",
      "author": "Mean_Gold_9370",
      "body": "Hi, I’m the EU, I’ll protect the incumbent and Middle Ages dynasties until the day YOU die",
      "score": 0,
      "created_utc": 1730778942.0,
      "replies": []
    },
    {
      "id": "lvhw71z",
      "author": "AbyssalRedemption",
      "body": "Tbh it seems... an odd choice, to say the least, that the EU keeps going after Apple for this type of stuff. Nitpicking even. There's much bigger fish to fry, and Apple is *hardly* the worst offender out there (their most egregious \"offense\" in the industry is their walled garden ecosystem, or at least that seems to be what the EU believes). Keep going after Google, and Amazon, and Facebook instead.",
      "score": 0,
      "created_utc": 1730798602.0,
      "replies": []
    },
    {
      "id": "lvd3pkz",
      "author": "None",
      "body": "[deleted]",
      "score": -127,
      "created_utc": 1730735519.0,
      "replies": [
        {
          "id": "lvd5w0l",
          "author": "Perfect_Opinion7909",
          "body": "r/ShitAmericansSay\n\nThe audacity of other countries to make their own laws to regulate shit happening in their borders, right? /s",
          "score": 47,
          "created_utc": 1730736181.0,
          "replies": [
            {
              "id": "lvd5yo3",
              "author": "None",
              "body": "[deleted]",
              "score": -63,
              "created_utc": 1730736203.0,
              "replies": [
                {
                  "id": "lvd9118",
                  "author": "Bdr1983",
                  "body": "EU consumer laws are seriously the best thing about the EU. You want to do business here? Better get your shit together, because they will slap you with a big fine if you're trying to rip people off or lock them in.\nThe EU doesn't build companies, they regulate the market so it is fair to everyone.",
                  "score": 36,
                  "created_utc": 1730737159.0,
                  "replies": []
                },
                {
                  "id": "lvd89ko",
                  "author": "objectionmate",
                  "body": "Lets blame EU that they care for costumers 🤡",
                  "score": 21,
                  "created_utc": 1730736919.0,
                  "replies": []
                },
                {
                  "id": "lvdayas",
                  "author": "MrKuub",
                  "body": "Spotify, Pixelmator (which Apple literally just bought), SAP, Dassault, …\n\nStop with this regurgitating of a stupid opinion people on twitter have. Europe regulates because it cares about its people and their rights. The USA doesn’t because it cares about corporations instead.",
                  "score": 18,
                  "created_utc": 1730737757.0,
                  "replies": [
                    {
                      "id": "lvdejjn",
                      "author": "drmirage809",
                      "body": "ARM is from the UK and were in the EU for most of their existence. And you know, those guys only make the CPU architecture used in all mobile devices.",
                      "score": 13,
                      "created_utc": 1730738839.0,
                      "replies": [
                        {
                          "id": "lvder5a",
                          "author": "MrKuub",
                          "body": "“Can’t innovate, my ass”",
                          "score": 6,
                          "created_utc": 1730738901.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvdzoxg",
                      "author": "OverSoft",
                      "body": "ASML builds the machines which quite literally produce every single modern computer chip.\nThey’re not American.",
                      "score": 4,
                      "created_utc": 1730744994.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvd6qcb",
                  "author": "Perfect_Opinion7909",
                  "body": "They want to do business in the EU they have to follow EU law. \n\n\n\nThe EU is so unsuccessful that it's the largest consumer market out side the US. /s",
                  "score": 10,
                  "created_utc": 1730736447.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvd4eza",
          "author": "Concupiscence",
          "body": "A single comment and its about the US... It always is...",
          "score": 18,
          "created_utc": 1730735732.0,
          "replies": [
            {
              "id": "lvd4js7",
              "author": "None",
              "body": "[deleted]",
              "score": -44,
              "created_utc": 1730735773.0,
              "replies": [
                {
                  "id": "lvd4z55",
                  "author": "Concupiscence",
                  "body": "And you're mentioning Trump on some news about the EU... Why is it relevant?",
                  "score": 25,
                  "created_utc": 1730735901.0,
                  "replies": [
                    {
                      "id": "lvd553d",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -10,
                      "created_utc": 1730735952.0,
                      "replies": [
                        {
                          "id": "lvd8uy2",
                          "author": "reddit455",
                          "body": "this is a gadget sub.. \n\nyou want identical functionality? ... no need for politics.\n\njust a license to use the hardware.\n\n# \n\n  \nWhat are the benefits of Apple's H1 and H2 chips?\n\n[https://www.soundguys.com/how-does-apple-h1-chip-work-21049/](https://www.soundguys.com/how-does-apple-h1-chip-work-21049/)\n\n# What is the H1 chip, and how does it increase headphone performance?",
                          "score": 11,
                          "created_utc": 1730737105.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvd4qj0",
                  "author": "ILoveBigCoffeeCups",
                  "body": "On a device that is made in china. What’s your point?",
                  "score": 10,
                  "created_utc": 1730735830.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvd5o02",
          "author": "NuPNua",
          "body": "And what will saying that achieve they'll still investigate and judges accordingly. If Apple want to function in the EU, they need top obey EU laws regardless of what Trump may say.",
          "score": 3,
          "created_utc": 1730736112.0,
          "replies": []
        }
      ]
    }
  ]
}