{
  "post": {
    "title": "Ryzen 9 9950X3D purportedly surfaces with 5.65 GHz boost clocks — leaked specs include 96MB 3D V-Cache on a single CCD and 170W TDP",
    "author": "chrisdh79",
    "id": "1hn52fv",
    "score": 560,
    "created_utc": 1735267707.0,
    "selftext": "",
    "num_comments": 85,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hn52fv/ryzen_9_9950x3d_purportedly_surfaces_with_565_ghz/"
  },
  "comments": [
    {
      "id": "m3z3kii",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735267709.0,
      "replies": []
    },
    {
      "id": "m3zdagg",
      "author": "CosmicCreeperz",
      "body": "Jeez.  In theory it could run a very reasonable Linux kernel entirely from cache.  I have worked on set top boxes and other embedded devices that had a lot less than 96 MB.  Hell my first Linux PC had 4…",
      "score": 125,
      "created_utc": 1735271604.0,
      "replies": [
        {
          "id": "m3zu22d",
          "author": "lordraiden007",
          "body": "Unfortunately cache isn’t quite the same thing as addressable memory, so you can’t install a kernel on it, or at least not a Linux kernel. You also would be giving up the ability to use an entire tier of cache, even if it were theoretically possible, so your performance would actually probably suck even more than running from a simple RAMDisk.",
          "score": 52,
          "created_utc": 1735279491.0,
          "replies": [
            {
              "id": "m426udr",
              "author": "CosmicCreeperz",
              "body": "Yes obviously, I know, it’s an associative cache, not fully accessible RAM… I am a computer engineer.  And moreover “installing” has nothing to do with it, it’s (S)RAM, not flash storage.\n\nI was just pointing out how crazy it is that even in the 90s no one could conceive of 96MB DRAM in their PC (it was $30 a megabyte!) let alone 96MB of in die L3 cache… (heh no one had heard of L3 cache at that point, I suppose ;)",
              "score": 29,
              "created_utc": 1735320633.0,
              "replies": []
            },
            {
              "id": "m447sko",
              "author": "extopico",
              "body": "It’s not about installing. It’s about being able to hold the entire binary file that’s controlling the work that the cpu has to do inside the cache without needing to swap it out. The speed up achieved by this is very high, in the order of 20-30% on my older systems when compiled with gcc with -Os vs O3 (highest optimisation).",
              "score": 6,
              "created_utc": 1735344839.0,
              "replies": [
                {
                  "id": "m45c49i",
                  "author": "lordraiden007",
                  "body": "… I know that. They were asking about running an entire OS kernel in cache only, not just running more in the cache or specific programs running with more cache optimizations. I was explaining that running an entire OS out of L3 cache isn’t possible using any of our current OS models, and possibly not possible period given the way caching works on an architectural level.",
                  "score": -1,
                  "created_utc": 1735360826.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4bsfnj",
              "author": "Hattix",
              "body": "If you managed to install your own UEFI, you could do this.\n\nThe CPU runs \"cache-as-storage\" mode until DRAM is initialised and trained. If you never exit this mode into associative mode, your cache *remains addressible*.",
              "score": 2,
              "created_utc": 1735460297.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3zpxun",
      "author": "Avrution",
      "body": "My 5800x has been looking a little weak",
      "score": 95,
      "created_utc": 1735277343.0,
      "replies": [
        {
          "id": "m3zqq4e",
          "author": "Proud_Tie",
          "body": "mine's about to get replaced with a 9800x3d. I'm sick of paying $800 a year for my dedicated server so I'm doing $2500 worth of computer upgrades to \"build\" one from my current parts.\n\ntoo bad hard drives are so damn expensive.",
          "score": 51,
          "created_utc": 1735277734.0,
          "replies": [
            {
              "id": "m3zuayo",
              "author": "lordraiden007",
              "body": "Honestly if you’re getting spinning disk I’d recommend finding a good online vendor that sells refurbished/used drives. You can buy really large capacities for dirt cheap, and even if one fails you’ll have a 2-3 spares ready to go if you spent the same amount of money as buying one new. If you are already intending to run some kind of redundant storage the risk is even smaller.",
              "score": 46,
              "created_utc": 1735279627.0,
              "replies": [
                {
                  "id": "m3zx2jy",
                  "author": "Sokobanky",
                  "body": "Hell, Seagate has their own eBay store where they sell tons of the Exos series NAS drives for pretty cheap.",
                  "score": 26,
                  "created_utc": 1735281195.0,
                  "replies": [
                    {
                      "id": "m4084qa",
                      "author": "arthurdentstowels",
                      "body": "I was going to say that you can find stripped down servers parts on eBay if you don't mind spending the time rummaging through the listings. I built a 24TB NAS with second hand 4TB spinning disc HDDs from eBay.",
                      "score": 9,
                      "created_utc": 1735288114.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m3zxbu1",
                  "author": "MineralShadows",
                  "body": "physical simplistic terrific meeting longing axiomatic whistle sparkle safe dependent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 7,
                  "created_utc": 1735281343.0,
                  "replies": [
                    {
                      "id": "m3zxy7k",
                      "author": "lordraiden007",
                      "body": "Usually refurbishment in my experience (I was a SME for data sanitization for electronics recyclers) means they wiped the data (usually 1-3 passes per NIST standards depending on the data’s sensitivity and possibly vendor contracts), checked the SMART values for any flaws or indications of future failure, and removed any physical evidence of the last owner. \n\nSo generally drives might have an acceptable number of active hours (otherwise they don’t sell it), writes, power cycles, etc., but might have scratches or damage to the labels and casing from them removing things people put on them (labels, stickers, writing, etc.). I’d imagine that first party refurbished drives have even stricter standards for what gets let out the door, although they likely are also willing to replace internal components as necessary.",
                      "score": 14,
                      "created_utc": 1735281696.0,
                      "replies": [
                        {
                          "id": "m4037gl",
                          "author": "OMGItsCheezWTF",
                          "body": "There was a youtuber (might have been Linus Tech Tips) who bought a couple of PB worth of refurb drives to see what they got and they were all only a couple of days power on time and no visible issues they could see.",
                          "score": 9,
                          "created_utc": 1735284886.0,
                          "replies": [
                            {
                              "id": "m40atzo",
                              "author": "DonutConfident7733",
                              "body": "Smart info can be reset, I have program for WD drives. So they will show 0 working hours even if they had tens of thousands previously. It also resets the bad sectors from factory and those detected during use. Then it needs to have a surface scan done to rebuild the factory bad sectors list. I assume this is done as part of recertification.\nThis will hide any bad sectors. If the bad region spreads, you will find later.",
                              "score": 5,
                              "created_utc": 1735289942.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m3zs1jf",
              "author": "Advanced_Basic",
              "body": "It's been a while so I'm not sure if a better option exists, but I got all my drives from shucking WD elements external hard drives when they were on sale.",
              "score": 8,
              "created_utc": 1735278412.0,
              "replies": [
                {
                  "id": "m3zt433",
                  "author": "Proud_Tie",
                  "body": "yeah that's the way I'm going, but 12 adds up quick.",
                  "score": 4,
                  "created_utc": 1735278980.0,
                  "replies": [
                    {
                      "id": "m404tn9",
                      "author": "itsdandandan",
                      "body": "check out https://serverpartdeals.com/",
                      "score": 5,
                      "created_utc": 1735285931.0,
                      "replies": [
                        {
                          "id": "m42ekbq",
                          "author": "TooStrangeForWeird",
                          "body": "Neat",
                          "score": 1,
                          "created_utc": 1735323068.0,
                          "replies": []
                        },
                        {
                          "id": "m4439mb",
                          "author": "None",
                          "body": "This is the way. I have a 120 TB server all fueled by drives from server part deals",
                          "score": 1,
                          "created_utc": 1735343177.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m3ztqzl",
                      "author": "Advanced_Basic",
                      "body": "Definitely. I only have 3x12tb and 2x14tb and even then those cost more than the rest of my system easily.",
                      "score": 3,
                      "created_utc": 1735279324.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41uf61",
              "author": "TripleSecretSquirrel",
              "body": "If there’s a microcenter anywhere near you, check there. Idk what it is, but they seem to have pretty frequent sales on the ~~9800X3D~~ 7900x3d that are in-store only. I can’t find the receipt and I don’t remember the exact price, but I paid <$230 for mine. It was a low enough price that the guy pulling it out of the locked cabinet for me said “woah, holy shit, that’s great deal!”\n\nEdit: I had the sku wrong, sorry y’all.",
              "score": 3,
              "created_utc": 1735316642.0,
              "replies": [
                {
                  "id": "m47favi",
                  "author": "A_Nice_Meat_Sauce",
                  "body": "When you say they're in store deals do you mean you have to actually go in to see them or are they listed on the website? I have one near enough to get to but it's a bit of a trek to wander in regularly.",
                  "score": 2,
                  "created_utc": 1735401174.0,
                  "replies": [
                    {
                      "id": "m47nuwk",
                      "author": "TripleSecretSquirrel",
                      "body": "My CPU price at least was listed online, but I couldn’t buy it at that price online. The listing said something like “in-store only.”",
                      "score": 2,
                      "created_utc": 1735404077.0,
                      "replies": [
                        {
                          "id": "m480szo",
                          "author": "A_Nice_Meat_Sauce",
                          "body": "Nice, I've seen that before. Thanks!",
                          "score": 1,
                          "created_utc": 1735408325.0,
                          "replies": [
                            {
                              "id": "m485w5x",
                              "author": "TripleSecretSquirrel",
                              "body": "See my edit above though. I got the sku wrong. Mine is a 7900x3d, not the 9800x3d.\n\nThat said, even now, my cpu retails for >$600, so even today, the <$230 price is a screaming deal.",
                              "score": 1,
                              "created_utc": 1735409983.0,
                              "replies": [
                                {
                                  "id": "m48dbfh",
                                  "author": "A_Nice_Meat_Sauce",
                                  "body": "Ahh, got it. I bought one of those for $400 last January so you had me running for the microcenter website lol",
                                  "score": 2,
                                  "created_utc": 1735412372.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m481c2w",
                  "author": "paycadicc",
                  "body": "Are you sure you mean the 9800x3D? It just came out like a month ago and it retails for $480. I also literally just bought one at micro center for 480 yesterday so please 🙏don’t tell me I could’ve gotten it half off",
                  "score": 1,
                  "created_utc": 1735408497.0,
                  "replies": [
                    {
                      "id": "m485gdp",
                      "author": "TripleSecretSquirrel",
                      "body": "Oof I’m sorry, I did get the sku wrong. When I wrote it out I thought “is that right?” \n\nI meant the 7900x3d. It still sells for well over $600 at most places, so my <$230 price is still a great deal, but ya, not nearly so good as it would be for a 9800x3d.",
                      "score": 1,
                      "created_utc": 1735409841.0,
                      "replies": [
                        {
                          "id": "m48607e",
                          "author": "paycadicc",
                          "body": "Ok thank you lol, but yea still a crazy good price for that",
                          "score": 2,
                          "created_utc": 1735410019.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m42y5t1",
              "author": "Pyro919",
              "body": "What drives are you buying? I'm getting refurbished enterprise drives for $100/12TB hdd.",
              "score": 1,
              "created_utc": 1735329322.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41x6zb",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1735317540.0,
          "replies": [
            {
              "id": "m42qv72",
              "author": "Avrution",
              "body": "Big difference between a cpu and gpu",
              "score": 2,
              "created_utc": 1735326976.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m40bgik",
      "author": "SurturOfMuspelheim",
      "body": "Meanwhile I know someone who will still be in denial about how Ryzen X3D CPUs are just better than intel for gaming.",
      "score": 44,
      "created_utc": 1735290369.0,
      "replies": [
        {
          "id": "m40kisc",
          "author": "Plank_With_A_Nail_In",
          "body": "Outside of benchmarks an 7600 non X isn't a bottleneck @ 1440p and above. Most people won't notice the extra a X3D gives unless they are playing a low GFX demanding title at 720p.\n\nEdit: 7600 outperforms the 5800X3D in most games ffs. Seem to have triggered all the people who wasted money on X3D cpu's.",
          "score": -66,
          "created_utc": 1735296473.0,
          "replies": [
            {
              "id": "m40mp0z",
              "author": "SurturOfMuspelheim",
              "body": "That's blatantly not true. I saw massive improvements in certain games and no change in others.\n\nThe point is, it's better or the same, cheaper than intel, and uses less power. Unless you're doing non-gaming activities often that get better results from an intel chip over the x3d chip, it's better.\n\nI nearly tripled my FPS going from a 3700X to a 5800X3D on Tarkov for example. Paradox titles run faster and better. Conan Exiles and some MMOs are giving 20-50 more FPS.\n\nAnd for the record, I switched from 1080p to 1440p at the same time.",
              "score": 21,
              "created_utc": 1735297866.0,
              "replies": []
            },
            {
              "id": "m44an3g",
              "author": "zed0K",
              "body": "Man doesn't know what 1% lows are.",
              "score": 6,
              "created_utc": 1735345873.0,
              "replies": []
            },
            {
              "id": "m40lhrx",
              "author": "huyanh995",
              "body": "Just install Cs2 and you can instantly see the differences, probably between 1.5 to 2x fps.",
              "score": 13,
              "created_utc": 1735297093.0,
              "replies": [
                {
                  "id": "m40smd6",
                  "author": "rasz_pl",
                  "body": "Yay 450 fps instead of measly 300!",
                  "score": 6,
                  "created_utc": 1735301462.0,
                  "replies": []
                },
                {
                  "id": "m40qsic",
                  "author": "Nevamst",
                  "body": "0.01% of CS2 gamers have a monitor fast enough to be able to see that difference in any other way than just the FPS-meter showing a higher number though.",
                  "score": -12,
                  "created_utc": 1735300404.0,
                  "replies": [
                    {
                      "id": "m47a8x9",
                      "author": "coolmast3r",
                      "body": "Higher frame rate is beneficial to game responsiveness irrespective of the monitor being used.",
                      "score": 3,
                      "created_utc": 1735399361.0,
                      "replies": [
                        {
                          "id": "m47evf6",
                          "author": "Nevamst",
                          "body": "Not noticeably so for the vast majority of people.",
                          "score": -1,
                          "created_utc": 1735401024.0,
                          "replies": [
                            {
                              "id": "m47jarz",
                              "author": "coolmast3r",
                              "body": "Pretty bold of you to speak for the \"vast majority of people\".",
                              "score": 2,
                              "created_utc": 1735402552.0,
                              "replies": [
                                {
                                  "id": "m47mv00",
                                  "author": "Nevamst",
                                  "body": "Nah",
                                  "score": 0,
                                  "created_utc": 1735403745.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m439vs5",
              "author": "tartare4562",
              "body": "Simulators and management games are CPU heavy and benefit from cache a lot, even at 1080p. Some aren't even 3D, LOL.",
              "score": 2,
              "created_utc": 1735333140.0,
              "replies": []
            },
            {
              "id": "m44gr1u",
              "author": "MassLuca007",
              "body": "From my 5800x3d to my new 9800x3d I got like 40 more FPS in Space Marine 2, and STALKER 2 I get like 30 FPS. Those are the only games I've played so far but like fr you can watch one video and see that these X3D chips are no joke. And who TF is playing at 720?",
              "score": 2,
              "created_utc": 1735348113.0,
              "replies": []
            },
            {
              "id": "m45b8co",
              "author": "SaydzReddit",
              "body": "broski emulation just has not been the same since i went from a 2600 to a 5700x3d, and im sure itll get even better once i upgrade to am5",
              "score": 1,
              "created_utc": 1735360418.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3zi21i",
      "author": "gg06civicsi",
      "body": "Will I need an MB with the 8+4 pin for this\n\nEdit: Apparently the 8 pin can handle up to 336W so unless you plan to overclock it like a crazy amount, 8 is all you need.",
      "score": 21,
      "created_utc": 1735273619.0,
      "replies": [
        {
          "id": "m3zn93m",
          "author": "420BONGZ4LIFE",
          "body": "Nope. ",
          "score": 3,
          "created_utc": 1735276021.0,
          "replies": []
        },
        {
          "id": "m40gvug",
          "author": "Shedding_microfiber",
          "body": "The connector does not tell you how good the vrm is and how hot the vrm could get.",
          "score": 6,
          "created_utc": 1735294064.0,
          "replies": []
        },
        {
          "id": "m40vv67",
          "author": "nicman24",
          "body": "Lol there are epyc boards that do not have 8+4",
          "score": 2,
          "created_utc": 1735303229.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m453x29",
      "author": "Naxirian",
      "body": "Wish their GPU game was on par with their CPU game. I want to do a new build next year and I will be going 4k high refresh rate but their new lineup doesn't look like it's going to cut it. I would really rather not buy Nvidia but there's not really a viable alternative at that level.",
      "score": 4,
      "created_utc": 1735357252.0,
      "replies": []
    },
    {
      "id": "m40gbk2",
      "author": "drakepig",
      "body": "My 5700x3d! Don't look at it!",
      "score": 7,
      "created_utc": 1735293678.0,
      "replies": []
    },
    {
      "id": "m3zr4uw",
      "author": "Placed-ByThe-Gideons",
      "body": "It's time for AMD to make a 9990X3D. V cache on all binned CCDs. None of that one good one bad ccd thing they're doing currently.",
      "score": 13,
      "created_utc": 1735277942.0,
      "replies": [
        {
          "id": "m3ztrk9",
          "author": "alvenestthol",
          "body": "For CPU-intensive tasks other than games, the non-3D CCD is the good CCD since it clocks higher (or at least it was on the 7950X3D, things might be different with the new design) \n\nI don't think we have games that can take up 16 whole cores yet (without also being hammered by the between-CCD latency too), having 8 gaming cores and 8 compute cores is better for folks who want to do some work or decompress some archives outside of gaming",
          "score": 20,
          "created_utc": 1735279332.0,
          "replies": [
            {
              "id": "m40x7hh",
              "author": "kingman1234",
              "body": "Cities Skylines II is able to take up all 16 cores of the 7950X3D",
              "score": 1,
              "created_utc": 1735303913.0,
              "replies": []
            },
            {
              "id": "m43x4vc",
              "author": "-LsDmThC-",
              "body": "Depends on the task. Pretty sure a larger v-cache would disproportionately improve performance over a slight difference in clock speed for my use case but i could be wrong \n\nhttps://orcaforum.kofo.mpg.de/app.php/portal",
              "score": 1,
              "created_utc": 1735340940.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m40xwci",
          "author": "The_JSQuareD",
          "body": "Based on their naming conventions, a 9990X3D would be a 96-core (non-pro) threadripper CPU with 3d v-cache and probably cost around $10,000. Consider the 7980x and 7995x for reference. It probably wouldn't be very good for gaming, because the clock speeds can't go anywhere near as high as on the Ryzen 9s.\n\nIn fact, this CPU would essentially be a Zen 5 consumer version of the Epyc 9684x (so the Epyc 9685x?), a $15k enterprise Zen 4 cpu. Maybe you can find some gaming benchmarks for it.",
          "score": 2,
          "created_utc": 1735304256.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41996b",
      "author": "NotTooDistantFuture",
      "body": "Boo. Single CCD. Still have the problem of different clocks and caches which has almost no infrastructure to support choosing which to use unlike P/E cores.\n\nX3Ds without the extra non3D CCD will probably still be the better choice.",
      "score": 6,
      "created_utc": 1735309199.0,
      "replies": []
    },
    {
      "id": "m411z8m",
      "author": "lucellent",
      "body": "Are the 3D variants solely better for gaming, or they're better in productivity apps too? Like Photoshop",
      "score": 2,
      "created_utc": 1735306147.0,
      "replies": []
    },
    {
      "id": "m43fu94",
      "author": "akgis",
      "body": "booooo, single CCD on cache, at mercy of Windows scheduler and game mode.\n\nAnd boost of only 5.6ghz isnt enough imo to warrant the cache less CCD.\n\nAnd gonna cost a fortune because Intel is no threat, it should had been double cache CCD as the cache stack is now in the back and isn't as much hindrance to clocks",
      "score": 1,
      "created_utc": 1735335085.0,
      "replies": [
        {
          "id": "m445jnm",
          "author": "ViewSimple6170",
          "body": "Why do you think they took that direction?",
          "score": 1,
          "created_utc": 1735344011.0,
          "replies": [
            {
              "id": "m49h6la",
              "author": "akgis",
              "body": "lack of competition.",
              "score": 1,
              "created_utc": 1735425596.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3zy5xl",
      "author": "None",
      "body": "[removed]",
      "score": -38,
      "created_utc": 1735281815.0,
      "replies": [
        {
          "id": "m42khs8",
          "author": "Agreeable-Use882",
          "body": "Plz upvote me i want to win the guy above",
          "score": 0,
          "created_utc": 1735324946.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3zqpfo",
      "author": "CookedPeeper",
      "body": "I’ve had nothing but instability and crashing on my 7950x3d. The system just cannot behave properly compared to all my buddies with their 7800x3ds. Will this just be more of the same?",
      "score": -19,
      "created_utc": 1735277725.0,
      "replies": [
        {
          "id": "m3zwfqz",
          "author": "ZafirZ",
          "body": "I'm not sure what you're doing on your pc but I've had a 7950x3d since a month after launch and it's been perfect.",
          "score": 15,
          "created_utc": 1735280830.0,
          "replies": [
            {
              "id": "m3zwlhv",
              "author": "CookedPeeper",
              "body": "It’s just quirky. I’ve been building PCs a long time. But only after upping to the 16 core did I start having issues like my webcam being unable to stream video out while I was running a demanding game. Or the entire system turning off if I alt tab under high load.",
              "score": -13,
              "created_utc": 1735280921.0,
              "replies": [
                {
                  "id": "m40omv3",
                  "author": "cucumbergreen",
                  "body": "Looks like something is defective on that machine. Not the type of issues you will have from normal usage. New windows install, bios updated to latest stable version ?",
                  "score": 8,
                  "created_utc": 1735299087.0,
                  "replies": [
                    {
                      "id": "m41t970",
                      "author": "ZafirZ",
                      "body": "Yeah I'm inclined to agree, I've had no issues with sability like that. Man I've ran heavy video encodes at full throttle while doing dailies on games sometimes, lol. No issues.",
                      "score": 1,
                      "created_utc": 1735316262.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m42fbtv",
                  "author": "TooStrangeForWeird",
                  "body": "Sounds like bad power delivery.",
                  "score": 1,
                  "created_utc": 1735323309.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m40rbqq",
      "author": "firedrakes",
      "body": "Ok and? \nWe want base clock",
      "score": -5,
      "created_utc": 1735300716.0,
      "replies": []
    },
    {
      "id": "m40x4ta",
      "author": "cclambert95",
      "body": "Let’s see if we can turn r/gadgets into a cesspool like r/pcmasterrace",
      "score": -5,
      "created_utc": 1735303876.0,
      "replies": []
    },
    {
      "id": "m3zidrc",
      "author": "None",
      "body": "[deleted]",
      "score": -79,
      "created_utc": 1735273767.0,
      "replies": [
        {
          "id": "m3zipz7",
          "author": "habitual_viking",
          "body": "It’s a cpu…",
          "score": 37,
          "created_utc": 1735273920.0,
          "replies": []
        },
        {
          "id": "m3zm1ad",
          "author": "shmeebz",
          "body": "Who shat in your cereal bud?",
          "score": 16,
          "created_utc": 1735275445.0,
          "replies": []
        },
        {
          "id": "m3znbv5",
          "author": "Oper8rActual",
          "body": "Reading comprehension isn't exactly your best skill, is it? This is a CPU.",
          "score": 13,
          "created_utc": 1735276056.0,
          "replies": []
        },
        {
          "id": "m3zprji",
          "author": "paulerxx",
          "body": "# Ryzen 9 9950X3D ",
          "score": 6,
          "created_utc": 1735277255.0,
          "replies": []
        },
        {
          "id": "m3zo3yn",
          "author": "Lost_Engineering_433",
          "body": "Bang bang!",
          "score": 3,
          "created_utc": 1735276430.0,
          "replies": []
        },
        {
          "id": "m3zprfo",
          "author": "whyyy66",
          "body": "Are you aware of what sub you’re in? Lmao",
          "score": 5,
          "created_utc": 1735277254.0,
          "replies": []
        },
        {
          "id": "m3zjzxy",
          "author": "TheNESGuy",
          "body": "> *640KB ought to be enough for anybody*\n\n— Bill Gates, 1981",
          "score": 5,
          "created_utc": 1735274505.0,
          "replies": [
            {
              "id": "m3ztjvt",
              "author": "Butterscotch1664",
              "body": "...When referring to the contemporary OS of the time.",
              "score": 1,
              "created_utc": 1735279216.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m3zx6da",
      "author": "None",
      "body": "[deleted]",
      "score": -21,
      "created_utc": 1735281256.0,
      "replies": [
        {
          "id": "m40kopn",
          "author": "pmjm",
          "body": "Unless you have a lot of non-gaming/production workloads you're probably better off sticking with the simplicity of the single ccd 9800x3d.",
          "score": 3,
          "created_utc": 1735296580.0,
          "replies": []
        }
      ]
    }
  ]
}