{
  "post": {
    "title": "Razer pulls new Blade laptops from its US store amid tariff concerns | Following in Framework's footsteps",
    "author": "chrisdh79",
    "id": "1jv4kna",
    "score": 3021,
    "created_utc": 1744201741.0,
    "selftext": "",
    "num_comments": 176,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jv4kna/razer_pulls_new_blade_laptops_from_its_us_store/"
  },
  "comments": [
    {
      "id": "mm7on15",
      "author": "EducationallyRiced",
      "body": "They are casually sending the us back to the windows vista era",
      "score": 362,
      "created_utc": 1744207313.0,
      "replies": [
        {
          "id": "mm8y91v",
          "author": "NiceTill504",
          "body": "😱",
          "score": 24,
          "created_utc": 1744220726.0,
          "replies": [
            {
              "id": "mm9c4kv",
              "author": "Fyremusik",
              "body": "Just remember to get the laptops with the y2k ready stickers on them.",
              "score": 28,
              "created_utc": 1744224698.0,
              "replies": [
                {
                  "id": "mm9pktv",
                  "author": "EducationallyRiced",
                  "body": "Ye but I can’t find any",
                  "score": 7,
                  "created_utc": 1744228639.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm7mx6j",
      "author": "MyUsernameIsAwful",
      "body": "Oh shit Framework’s pulling stuff too? I should’ve expected that, but shit. I hope they make it through this, I love the idea of easily upgradable laptops.",
      "score": 152,
      "created_utc": 1744206780.0,
      "replies": [
        {
          "id": "mm7ur2f",
          "author": "youreblockingmyshot",
          "body": "Yea I haven’t been in the market for a personal laptop yet but even so their new desktop and the 16” laptop were tempting.",
          "score": 39,
          "created_utc": 1744209185.0,
          "replies": []
        },
        {
          "id": "mm81s4j",
          "author": "Gil_Demoono",
          "body": "iirc, they are only doing it for their cheapest offerings. Higher specced machines should still be available, though obviously at a tariffed price.",
          "score": 19,
          "created_utc": 1744211264.0,
          "replies": []
        },
        {
          "id": "mm8c6oi",
          "author": "Spanky2k",
          "body": "It'll all come back, just with higher prices to factor in the tariffs. America can't build this stuff. It doesn't have the factories, it doesn't have the worked knowledge, it doesn't have the refineries for the raw materials and in many cases, it doesn't even have the raw materials it would need in the ground. It also doesn't have 10 years to try to build all the infrastructure it would need to even be able to produce this stuff at home, in a 'perfect' world. Manufacturers will continue to build this stuff in china but they will just raise prices and try to reduce costs (cut as many corners as possible) to try to keep the prices slightly lower. Unless everything is rolled back basically now, Americans will be buying tech manufactured in China in a year's time for double the price and with 50% of the component quality.",
          "score": 28,
          "created_utc": 1744214339.0,
          "replies": [
            {
              "id": "mmgbfs8",
              "author": "878_Throwaway____",
              "body": "I was just watching a review of the Light phone 3, and in the review the reviewer talked about how this $700 phone was the product of a 16 person shop in Brooklyn. Obviously using imported, industry standard phone parts. \n\n\nWhat's a tariff going to do for a company like that?\n\n\nKill it. \n\n\nThe cost of the phone is a luxury, and with tariffs it becomes an impossibility. 16 advanced economy American workers will be out of a job. \n\n\nEven the fear of something like that would stop me from buying a product, knowing that there's a real risk it's going to be unsupported soon. \n\n\nReminds me of the Fisker electric cars. \n\n\nThis economic shock will just kill a whole bunch of small, innovative American companies, who can't afford to onshore manufacturing, or bribe the president. ",
              "score": 9,
              "created_utc": 1744317864.0,
              "replies": [
                {
                  "id": "mmgyc6l",
                  "author": "Spanky2k",
                  "body": "Yeah, exactly. The big companies will have been able to stockpile goods ahead of the tariffs coming in but that's just not possible for small companies. Everyone's been trying to do exactly that and the ports have been clogged up as a result. The big companies have their own logistics though; just look at Apple and it's last minute flights with high value items.\n\nMeanwhile, Trump openly brags about how two of his buddies made billions through his stock manipulation.\n\nThe ultra rich are making money hand over fist through all this. Everyone else, be they poor or rich, suffers. But they're not who Trump and his Republican buddies care about. It's honestly unbelievable at how successful the Republicans have been in convincing those worst off in society to vote against their own interests.",
                  "score": 8,
                  "created_utc": 1744325186.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm7rtzf",
      "author": "None",
      "body": "[removed]",
      "score": 570,
      "created_utc": 1744208300.0,
      "replies": [
        {
          "id": "mm84rry",
          "author": "lkn240",
          "body": "That's a pretty mean thing to say about children to be honest.",
          "score": 217,
          "created_utc": 1744212156.0,
          "replies": [
            {
              "id": "mm8qq06",
              "author": "Ake-TL",
              "body": "Children probably understand basic concept of distribution of labour",
              "score": 32,
              "created_utc": 1744218614.0,
              "replies": [
                {
                  "id": "mmcebe4",
                  "author": "greywolfau",
                  "body": "My 3 year old used to make his 18 month old brother get him stuff.\n\n20 years later, the same dynamic still plays out.\n\nChildren definitely understand labour dynamics.",
                  "score": 6,
                  "created_utc": 1744264044.0,
                  "replies": []
                },
                {
                  "id": "mmhmux7",
                  "author": "NahDawgDatAintMe",
                  "body": "Well over half of Americans thought it was either acceptable economic policy or better. Their children are likely just as stupid considering parties are basically baked into state culture.",
                  "score": 1,
                  "created_utc": 1744333938.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm897th",
              "author": "Temperance10",
              "body": "“Toddler’s understanding” would be a more appropriate qualifier. Although my 3-year old niece probably has better grasp of basic math thanks to *Number Blocks*.",
              "score": 56,
              "created_utc": 1744213471.0,
              "replies": [
                {
                  "id": "mmbseyk",
                  "author": "Buttonskill",
                  "body": "She totally could.\n\n\"I sell you 30 cookies for $3, and you sell me 1 cookie for 10¢, yeah?\n\nToddler: \"Yay! 30 cookies!\"\n\n\n\"Ok, now we have a trade deficit of 97%.\"\n\n\nToddler: \"Oh, no!  What does that mean?\"\n\n\n\"Absolutely fucking nothing.\"",
                  "score": 12,
                  "created_utc": 1744253711.0,
                  "replies": []
                },
                {
                  "id": "mmcyj9o",
                  "author": "mikemantime",
                  "body": "And although I’m sure she has tantrums and outbursts, it probably aint shit compared to 🤮 🍊",
                  "score": 1,
                  "created_utc": 1744276737.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmcaash",
              "author": "nathism",
              "body": "Yeah I explained tarrifs to my kids in relation to the switch and he got it really fast was super pissed off.",
              "score": 2,
              "created_utc": 1744261858.0,
              "replies": []
            },
            {
              "id": "mm9alnh",
              "author": "inahos_sleipnir",
              "body": "it's not\n\nhave you ever met a child?",
              "score": -4,
              "created_utc": 1744224254.0,
              "replies": [
                {
                  "id": "mmcmb21",
                  "author": "Jaquemart",
                  "body": "In many workplaces. Don't let the suits fool you.",
                  "score": 3,
                  "created_utc": 1744268757.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm88wuu",
          "author": "Edythir",
          "body": "Repeating an comment of mine I made a while back about one notable example who's demand is measured in the thousands of tons, if not millions.\n\nAmerica mines less than 1% of the world's Bauxite despite being a leading supplier of it in the 19th and 20th centuries. I wonder how much is left in those mines now. And besides. Bauxite is incredibly energy intensive to refine. In fact one of Iceland's main exports is Aluminium because with so much geo and hydrothermal energy, electricity is cheap and one aluminium plant consumes as much electricity as a medium sized town, all by itself. So even if America had the mines, the processing of it would require a vast energy infrastructure just for it's processing.\n\nIf they have mines they don't have refiners, if they have refiners they don't have energy. Just a single energy plant can take between 3 and 10 years. Depending on the energy source, the complexity and the output.",
          "score": 38,
          "created_utc": 1744213382.0,
          "replies": [
            {
              "id": "mm8h6vo",
              "author": "c1h-",
              "body": "Just for perspective, there used to be an aluminum plant in my part or rural Ohio that, at its peak, used more daily electricity than the city of Pittsburgh",
              "score": 22,
              "created_utc": 1744215829.0,
              "replies": [
                {
                  "id": "mmakgy0",
                  "author": "Mantzy81",
                  "body": "There's a town here in Australia (Gladstone, QLD) which has a curiously large powerplant for only 30k residents.  It has 2 Alumina smelters though so it gets worked hard.  With coal from the local seam. It rains orange when the rainy season starts.  *Insert orange trump joke here*",
                  "score": 8,
                  "created_utc": 1744238237.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8m4pv",
              "author": "CamiloArturo",
              "body": "Not to worry…. Trump said he is reintroducing the “beautiful coal” to power up everything so no need to worry about anything 😂",
              "score": 20,
              "created_utc": 1744217284.0,
              "replies": [
                {
                  "id": "mm9ld3g",
                  "author": "flow_fighter",
                  "body": "The idea of firing up copious amounts of coal in the modern age is peak “I want money now, fuck the people coming next”",
                  "score": 21,
                  "created_utc": 1744227421.0,
                  "replies": []
                },
                {
                  "id": "mmcvtxv",
                  "author": "Edythir",
                  "body": "And the funny part is that Coal was on the outs because it's not economically viable. Even just transporting it is a significant cost unless the mine and coal plant are directly connected by rail. Last-mile hauling by trucks would drive the price up substantially. One of the reasons why Natural Gas is so much cheaper is because pipelines can have nearly uninterrupted supply 24/7 with not human involvement other than oversight. Coal failed by the virtues of the invisible hands of the market these cronies love touting so much.",
                  "score": 3,
                  "created_utc": 1744275001.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mmarwnd",
              "author": "VirginiaMcCaskey",
              "body": "About two thirds of the aluminum we use is recycled because it's so much more efficient than refining. \n\nLike it's literally cheaper to mine landfills for aluminum than refine Bauxite.",
              "score": 7,
              "created_utc": 1744240770.0,
              "replies": []
            },
            {
              "id": "mm9c36i",
              "author": "bva6921",
              "body": "Canada produces lots of aluminum as well. We have the resources for all stages, mining, refining, and abundant, cheap electricity thanks to hydroelectricity. The US already imports 60% of its aluminum from Canada, but since Trump took position, that idiot has decided to shoot one of its closest and most strategic allies.",
              "score": 10,
              "created_utc": 1744224686.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm86do5",
          "author": "Lokon19",
          "body": "Guess we'll all just find out the dumb way. And then when they start losing their jobs they'll say something like \"but we had to try\" even though anyone with an inkling of economics knew this was the dumbest possible idea.",
          "score": 19,
          "created_utc": 1744212637.0,
          "replies": [
            {
              "id": "mm8aed6",
              "author": "hgs25",
              "body": "The ones who know it’s bad are blaming Biden and Obama.",
              "score": 13,
              "created_utc": 1744213816.0,
              "replies": [
                {
                  "id": "mmb5cmf",
                  "author": "spookmann",
                  "body": "\"It's the Democrats fault for not fighting hard enough.\"\n\n\"The Democrats that you voted out of power?\"",
                  "score": 7,
                  "created_utc": 1744245514.0,
                  "replies": []
                },
                {
                  "id": "mm8amxr",
                  "author": "Lokon19",
                  "body": "That's because the economy hasn't collapsed yet. Once that happens that doesn't work anymore.",
                  "score": 7,
                  "created_utc": 1744213885.0,
                  "replies": [
                    {
                      "id": "mm8ocij",
                      "author": "know-your-onions",
                      "body": "Why not?\n\nThey’ve been blaming other people for things they do with no issue so far. Why would the economy collapsing mean it’s not Biden’s fault?",
                      "score": 13,
                      "created_utc": 1744217926.0,
                      "replies": [
                        {
                          "id": "mm8oq0b",
                          "author": "Lokon19",
                          "body": "Well there's a certain segment of the population that will always do that but its the persuadable people in the middle that aren't going to be buying it at that point and once you lose them you will lose power.",
                          "score": 0,
                          "created_utc": 1744218034.0,
                          "replies": [
                            {
                              "id": "mm9u5ox",
                              "author": "know-your-onions",
                              "body": "How do you see them losing power?",
                              "score": 2,
                              "created_utc": 1744229956.0,
                              "replies": [
                                {
                                  "id": "mm9uerp",
                                  "author": "Lokon19",
                                  "body": "If the economy crashes they will likely face an electoral wipe out",
                                  "score": -1,
                                  "created_utc": 1744230028.0,
                                  "replies": [
                                    {
                                      "id": "mm9xscw",
                                      "author": "know-your-onions",
                                      "body": "There’s a lot more damage can be done before the next election though, and when we get there that may not be free and fair.",
                                      "score": 2,
                                      "created_utc": 1744231014.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm8i0zw",
              "author": "chaoticnormal",
              "body": "Seriously. My friend gets her news from her husband who gets news from tiktok asked me if tariffs and bringing manufacturing would work. Like sure IF WE HAD ALL THE THINGS. We have not had manufacturing here in a long time. \nI would also be skeptical of bringing back industry when this guy also wants to cut regulations- wouldn't we just pollute like it's 1959 all over again? (Date chosen at random) luckily my friend doesn't vote but her husband does and \"you just vote red in Texas. It's what you do.\"",
              "score": 8,
              "created_utc": 1744216077.0,
              "replies": [
                {
                  "id": "mm8iv31",
                  "author": "Lokon19",
                  "body": "I mean it only works for very certain specific kinds of industries that are high value and have the margins to support American wages. And the trade off even if it did work is that everyone would have a lower standard of living because everything is going to double. People freaked out about 9% inflation. You going to learn real quick what happens when you have 100% inflation.",
                  "score": 9,
                  "created_utc": 1744216324.0,
                  "replies": [
                    {
                      "id": "mmcqb1w",
                      "author": "lemonade_eyescream",
                      "body": "wheelbarrows full of money",
                      "score": 1,
                      "created_utc": 1744271334.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mma0qtm",
              "author": "sucksfor_you",
              "body": "> \"but we had to try\"\n\nBold of you to think they'd say anything that even vaguely resembled admitting they were wrong.",
              "score": 3,
              "created_utc": 1744231873.0,
              "replies": []
            },
            {
              "id": "mmb7soq",
              "author": "ToMorrowsEnd",
              "body": "This is why american politicians love keeping the population uneducated.   Nobody with any brains votes republican.",
              "score": 2,
              "created_utc": 1744246374.0,
              "replies": []
            },
            {
              "id": "mm8jrw1",
              "author": "Mean_Joe_Greene",
              "body": "Unemployment will go up when companies start laying off higher paying service jobs. So them and kids.",
              "score": 2,
              "created_utc": 1744216598.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm89trt",
          "author": "wareika",
          "body": "To add to this, current unemployment in the US is low. Non-US citizens are getting their visas canceled. Who is supposed to work in those factories?",
          "score": 16,
          "created_utc": 1744213650.0,
          "replies": [
            {
              "id": "mma81tz",
              "author": "Nappi22",
              "body": "The children. And the old.",
              "score": 13,
              "created_utc": 1744234104.0,
              "replies": []
            },
            {
              "id": "mmb12y5",
              "author": "bl4ckhunter",
              "body": "The people that will lose their jobs once all the buisnesses currently relying on chinese imports downsize and/or go bankrupt due to the increase in base costs of course.",
              "score": 7,
              "created_utc": 1744243979.0,
              "replies": []
            },
            {
              "id": "mmc57i6",
              "author": "dxps7098",
              "body": "The Chinese seem to find it funny though\n\nhttps://www.instagram.com/reel/DIK_rH8xjJR/?igsh=MXBmNnNmZnJoYmx1NQ==",
              "score": 8,
              "created_utc": 1744259331.0,
              "replies": []
            },
            {
              "id": "mmcdq83",
              "author": "llDurbinll",
              "body": "Not defending Trump but the unemployment % is skewed because it only counts the people receiving benefits from unemployment. So if a person has exhausted their benefits and still hasn't found work (either because they're only applying for jobs in their field and aren't applying to places like fast food or retail or they just aren't really trying) then they aren't counted in the unemployment figure.",
              "score": 2,
              "created_utc": 1744263719.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm92d0u",
          "author": "Aisher",
          "body": "The goal is to use the tariffs as a club and for people to call and kiss 47s ass.  He loves getting all the attention.  That’s why he keeps start:stop:start:stop with the tariffs. It’s negotiating. (Terrible I agree)\n\n\nI love that Canada and other countries are doing targeted tariffs on places like Kentucky.",
          "score": 2,
          "created_utc": 1744221865.0,
          "replies": [
            {
              "id": "mmb04f1",
              "author": "PhillAholic",
              "body": "start stop start stop is also a great way to make a buck if you know ahead of time. Hint Hint.",
              "score": 3,
              "created_utc": 1744243632.0,
              "replies": [
                {
                  "id": "mmbgr4h",
                  "author": "Aisher",
                  "body": "Oh of course",
                  "score": 1,
                  "created_utc": 1744249546.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmayj0a",
          "author": "kr4ckenm3fortune",
          "body": "Nope. They're intentionally doing this so they can bulk buy stocks when it gets back to business. Look at MTG buying stocks...\n\nThen remember this happened to Circuit City, Blockbuster and even Toy'r'Us. By buying it out, and leveraging it with debts, it has no choice but to declare bankruptcy.\n\nLook at Trump and his four \"failed\" casinos. Then Look at Trump University...anybody who got the degree from there just found out that 4 years there amount to nothing.",
          "score": 5,
          "created_utc": 1744243062.0,
          "replies": []
        },
        {
          "id": "mmbyfz0",
          "author": "SoftlySpokenPromises",
          "body": "We don't have the raw materials, the manufacturing centers, or the people to fill those manufacturing jobs to fuel our consumption.\n\nWe are very likely a decade out from being able to go full steam on manufacturing again and by that point our workforce will have shrunk because of deportation, retirements and a generally lowering rate of childbirth.  This is the worst possible move at every step of the ladder.",
          "score": 3,
          "created_utc": 1744256211.0,
          "replies": []
        },
        {
          "id": "mm8al35",
          "author": "Liatin11",
          "body": "idk, conservative sub with armchair economists say otherwise D:",
          "score": 4,
          "created_utc": 1744213870.0,
          "replies": []
        },
        {
          "id": "mm8fgmt",
          "author": "PanzerKomadant",
          "body": "And even if they somehow are able to make these here, it’ll take years to build out a new supply chain in the states for products that will be more expensive to produce.\n\nUnless you want the government to remove consumer and workers protections and environmental policies, they’ll never match the capacity that China has. Along with people willing to work minimum wage.",
          "score": 3,
          "created_utc": 1744215316.0,
          "replies": [
            {
              "id": "mm9od7p",
              "author": "Higira",
              "body": "Oh they'll definitely remove those policies. Just look at how they are gutting the government.",
              "score": 3,
              "created_utc": 1744228291.0,
              "replies": []
            },
            {
              "id": "mmf37ot",
              "author": "Olfasonsonk",
              "body": "crowd fact vegetable historical rainstorm spectacular relieved quack vanish tap\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 1,
              "created_utc": 1744304977.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8o2wb",
          "author": "know-your-onions",
          "body": "My children listen to the radio, and my 11 year old child understands tariffs considerably better than Donald Trump.",
          "score": 6,
          "created_utc": 1744217848.0,
          "replies": []
        },
        {
          "id": "mm8lpnl",
          "author": "Stingray88",
          "body": "All of the jobs Americans lose from Trump’s catastrophically stupid policies will be replaced in the global market with jobs in other countries too. So not only is this stupid shit not bringing in new jobs, it will kill our existing jobs. So even if we replace Trump, he will have permanently harmed the country, for decades.\n\nAmerica has enjoyed dominance for a lonnnnnng time. Americans really are not gonna like what life looks like after this.",
          "score": 2,
          "created_utc": 1744217161.0,
          "replies": []
        },
        {
          "id": "mm9ox07",
          "author": "abhig535",
          "body": "C'mon, you're giving way too much credit. They don't have ANY understanding. They're using ChatGPT for Christ's sake to do the calculation on tariffs.",
          "score": 1,
          "created_utc": 1744228448.0,
          "replies": []
        },
        {
          "id": "mm9vlbj",
          "author": "TrueTurtleKing",
          "body": "Even the favorites in Mexico are just importing raw material or partially finished goods and do the finish and assembly only. Enough to be marked as made in Mexico.\n\nNorth America just don’t have the resource allocated to do such thing.",
          "score": 1,
          "created_utc": 1744230369.0,
          "replies": []
        },
        {
          "id": "mma1vba",
          "author": "Domascot",
          "body": "I fear this administration understands actually very well that they need to force other countries to deliver their raw materials for as cheap as possible as long as said countries depend in some form on the US´goodwill. After all, what is the strongest military power good for, if not for this?\n\nMany countries are not in a position like the EU, China and other not-so-small players to say no.",
          "score": 1,
          "created_utc": 1744232196.0,
          "replies": []
        },
        {
          "id": "mmal8hs",
          "author": "Hifen",
          "body": "Plus who wants to give up office jobs for factory labor?  People need to stop acting like coal mines and assembly lines were the golden age of American employment.",
          "score": 1,
          "created_utc": 1744238502.0,
          "replies": []
        },
        {
          "id": "mmao0yk",
          "author": "viperfan7",
          "body": "Tariffs are good to protect existing manufacturing. \n\nThat's all those are good for, they won't create a new manufacturing sector",
          "score": 1,
          "created_utc": 1744239444.0,
          "replies": []
        },
        {
          "id": "mmb73cf",
          "author": "ToMorrowsEnd",
          "body": "It's more than that.  we just dont have any of it.  There is an ongoing brain drain and with the republican party utterly hostile to education in general for the past 20 years we are not creating new educated people to do this stuff.    Friends I went to college for Electronics Engineering,   3 of them work in Europe, 1 in South Korea, they all left about 6 years ago when they saw  where things were going.    Carl was into robotics in college, and what he is doing in South Korea makes the USA look like we are at 1970 levels of tech.   Holy crap they are so far more advanced than we are in manufacturing automation it's not even a competition.  He mentions his colleagues all did not have to pay for their education,  he still has student loan debt he is paying on.\n\nthe USA is actively trying to lose with being hostile to higher education and pricing it so that only the wealthy can afford it.",
          "score": 1,
          "created_utc": 1744246127.0,
          "replies": []
        },
        {
          "id": "mmc7b8n",
          "author": "None",
          "body": "Exactly the point of many alike. This strategy will only backfire with no room for confrontation.",
          "score": 1,
          "created_utc": 1744260334.0,
          "replies": []
        },
        {
          "id": "mm8tb75",
          "author": "spartacus_zach",
          "body": "It’s not meant to. It’s meant to destabilize the market so his friends can buy the dip.",
          "score": 1,
          "created_utc": 1744219353.0,
          "replies": []
        },
        {
          "id": "mm95ct4",
          "author": "big_deal",
          "body": "No you don't understand! Haven't you heard? Trump is going to put us all to work in coal mines!",
          "score": 0,
          "created_utc": 1744222730.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm851zk",
      "author": "AnAnnoyedSpectator",
      "body": "Razer is in a tough position as the higher priced option - people will look to cheaper options now that everything becomes more expensive.",
      "score": 20,
      "created_utc": 1744212240.0,
      "replies": [
        {
          "id": "mm9slyj",
          "author": "38B0DE",
          "body": "Acer laptops are so shit.",
          "score": 5,
          "created_utc": 1744229507.0,
          "replies": [
            {
              "id": "mmdcvgo",
              "author": "Niyuu",
              "body": "I don't think so anymore. Got a predator as a spare and it still run really well.",
              "score": 3,
              "created_utc": 1744284570.0,
              "replies": []
            },
            {
              "id": "mmb0rjg",
              "author": "AliveAndNotForgotten",
              "body": "I’m a big fan of my eluktronics laptop I got last year. It’s not cheap, ($2600), but it still less than razer.",
              "score": -2,
              "created_utc": 1744243865.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm7g4vq",
      "author": "SSupreme_",
      "body": "First of many. Soon your jobs and your home will disappear.",
      "score": 217,
      "created_utc": 1744204525.0,
      "replies": [
        {
          "id": "mm7hh0b",
          "author": "Azap87",
          "body": "What many don’t understand.",
          "score": 65,
          "created_utc": 1744204982.0,
          "replies": [
            {
              "id": "mm7vr3l",
              "author": "None",
              "body": "[deleted]",
              "score": 51,
              "created_utc": 1744209487.0,
              "replies": [
                {
                  "id": "mmcij2u",
                  "author": "FrankMiner2949er",
                  "body": "I'm currently playing \"Mad Max\" in preparation for the coming years. Luckily the game is ten years old so it runs okay on my potato\n   \nI'm going to have to get used to the taste of potato",
                  "score": 4,
                  "created_utc": 1744266482.0,
                  "replies": [
                    {
                      "id": "mmdj6yv",
                      "author": "Zaptruder",
                      "body": ">I'm going to have to get used to the taste of potato\n\nBold of you to assume you'll have settled fertile lands that you can keep defended for months of the year.",
                      "score": 2,
                      "created_utc": 1744287262.0,
                      "replies": [
                        {
                          "id": "mmevngs",
                          "author": "FrankMiner2949er",
                          "body": "I haven't gotten that far yet. I'm still doing up my car",
                          "score": 2,
                          "created_utc": 1744302753.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mm7x4rk",
                  "author": "None",
                  "body": "[removed]",
                  "score": -36,
                  "created_utc": 1744209896.0,
                  "replies": [
                    {
                      "id": "mm7xr0e",
                      "author": "JohnnyOnslaught",
                      "body": "It's actually probably not. The sheer number of people in the US makes it kinda unfeasible to live off the land. It'd be like a plague of locusts, killing and eating everything.",
                      "score": 32,
                      "created_utc": 1744210077.0,
                      "replies": [
                        {
                          "id": "mm8ji14",
                          "author": "blackscales18",
                          "body": "Don't worry, they'll clear out the extra population soon enough",
                          "score": 1,
                          "created_utc": 1744216515.0,
                          "replies": []
                        },
                        {
                          "id": "mm7ybm8",
                          "author": "None",
                          "body": "[removed]",
                          "score": -32,
                          "created_utc": 1744210245.0,
                          "replies": [
                            {
                              "id": "mm7z26j",
                              "author": "JohnnyOnslaught",
                              "body": "Wouldn't matter. Estimates are the entire planet could only support a population of around 100 million living as hunter-gatherers.",
                              "score": 15,
                              "created_utc": 1744210458.0,
                              "replies": [
                                {
                                  "id": "mm8bjge",
                                  "author": "persondude27",
                                  "body": "I think this guy is trying to troll.\n\n\"Lebensraum\" (Living-space) was Hitler's justification for starting WWII.\n\nedit: nevermind, not a troll, just an actual Nazi. Here's him arguing that we have a \"[Black problem](https://np.reddit.com/r/Asmongold/comments/1jsqe46/america_doesnt_have_a_gun_problem_it_has_a_black/mlof2bp/)\".",
                                  "score": 23,
                                  "created_utc": 1744214150.0,
                                  "replies": [
                                    {
                                      "id": "mmarkcz",
                                      "author": "Spiral_Slowly",
                                      "body": "Yikes",
                                      "score": 3,
                                      "created_utc": 1744240653.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mm7zmgw",
                                  "author": "soul_of_rubber",
                                  "body": "There is a difference in food production efficiency between hunter gatherers and agriculture. The earth could feed many more people then we are today, if so much of it wouldn't be wasted.",
                                  "score": -16,
                                  "created_utc": 1744210623.0,
                                  "replies": [
                                    {
                                      "id": "mm7zut2",
                                      "author": "JohnnyOnslaught",
                                      "body": "In the context of the conversation, the voters who want to \"live off the land\" certainly don't have the money to buy farms.",
                                      "score": 13,
                                      "created_utc": 1744210689.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mm8rptk",
                                      "author": "Ake-TL",
                                      "body": "We waste food because we produce a lot of it genius",
                                      "score": 2,
                                      "created_utc": 1744218900.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mm8ees4",
                              "author": "OkSession5483",
                              "body": "At least you own the libs for the great destruction?",
                              "score": 1,
                              "created_utc": 1744215001.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm7vxg3",
          "author": "Particular_Treat1262",
          "body": "No no no.\n\nYour homes will be gobbled up by foreign estate agents on the cheap, hold them for the next 10 years and upsell them, completely fucking the property market. \n\nThe Spanish are trying real hard to get the British to stop doing this in their country, so maybe it’s time for them to own the USA again instead.",
          "score": 26,
          "created_utc": 1744209540.0,
          "replies": [
            {
              "id": "mmb58d5",
              "author": "Narrow-Chef-4341",
              "body": "What makes you think hedge funds will let them???\n\nThey are buying up everything and converting everything to rental (and colluding in pricing there)… why let you buy a home when they can charge you rent forever?",
              "score": 7,
              "created_utc": 1744245471.0,
              "replies": [
                {
                  "id": "mmd5uvt",
                  "author": "PresumedSapient",
                  "body": "> why let you buy a home when they can charge you rent forever?\n\nBecause at some point any home requires a large investment for renovation and repair work. Ideally you sell it off to some hopefull fool before that.",
                  "score": 1,
                  "created_utc": 1744281122.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmb25rm",
          "author": "kneelthepetal",
          "body": "I'm a psychiatrist and business is booming :(",
          "score": 4,
          "created_utc": 1744244369.0,
          "replies": [
            {
              "id": "mmdjmqp",
              "author": "Zaptruder",
              "body": "How does one practice psychiatry in these times?\n\nGaslight them into thinking that the problems are just in their head? The world is fine?\n\nIt'll come around? \n\nOr is it more like... yeah... it's bad, like Nazi germany bad, but at least it's not bad like been part of the Khwarazmian empire bad.",
              "score": 2,
              "created_utc": 1744287439.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mm8kpts",
          "author": "None",
          "body": "[deleted]",
          "score": -13,
          "created_utc": 1744216873.0,
          "replies": [
            {
              "id": "mm8nl7d",
              "author": "csoups",
              "body": "Have you heard of mortgages? Foreclosures? Hello?",
              "score": 17,
              "created_utc": 1744217705.0,
              "replies": [
                {
                  "id": "mm9qpc6",
                  "author": "tha_dank",
                  "body": "Right and then look at houses in Detroit. If that’s not houses “disappearing” I don’t know what is.",
                  "score": 3,
                  "created_utc": 1744228959.0,
                  "replies": [
                    {
                      "id": "mmaf3ya",
                      "author": "ProfSkeevs",
                      "body": "Hell I live in Detroit now, no one here can even afford the shit shacks. A $200k house even here is a 900 sq foot flipped crap shack.",
                      "score": 1,
                      "created_utc": 1744236384.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mm9bcel",
              "author": "ProfSkeevs",
              "body": "How many people that you know outright own their home and thus would be completely unaffected housing wise if they lose their job?\n\nCause I can name a single family out of my entire circle from ages 18-80",
              "score": 5,
              "created_utc": 1744224470.0,
              "replies": [
                {
                  "id": "mma9xwp",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -5,
                  "created_utc": 1744234709.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm7fsf0",
      "author": "Time_Safe4178",
      "body": "Bad week for being Blade, I guess",
      "score": 24,
      "created_utc": 1744204405.0,
      "replies": [
        {
          "id": "mm7p8qq",
          "author": "not_combee",
          "body": "B-But my blade! \n(Dungeon soup on YouTube)",
          "score": 6,
          "created_utc": 1744207501.0,
          "replies": [
            {
              "id": "mmd61pb",
              "author": "PresumedSapient",
              "body": "Quenched in Dwarven ******, so you know it's good!",
              "score": 2,
              "created_utc": 1744281225.0,
              "replies": [
                {
                  "id": "mmdke7b",
                  "author": "not_combee",
                  "body": "Struck by lightning 1000 times, STATISTICALLY IMPOSSIBLE! Just like your chances of surviving this battle",
                  "score": 2,
                  "created_utc": 1744287744.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mm8ppbh",
      "author": "know-your-onions",
      "body": "> current unemployment in the US is low.\n\nGive it a few weeks…",
      "score": 25,
      "created_utc": 1744218318.0,
      "replies": []
    },
    {
      "id": "mm82wu4",
      "author": "Kinto_il",
      "body": "i feel like the US might not be a corporate friendly country anymore",
      "score": 33,
      "created_utc": 1744211601.0,
      "replies": [
        {
          "id": "mm8jm84",
          "author": "DoubleJumps",
          "body": "It's not small business friendly, either. \n\nI own a small business and Republicans are coming out of the woodwork to tell me I'm a piece of shit for saying that the tariffs are hurting me.",
          "score": 34,
          "created_utc": 1744216551.0,
          "replies": [
            {
              "id": "mnoqfk3",
              "author": "unicron7",
              "body": "Have a friend who works for a hardcore MAGA small business. He does their numbers and does most of their office admin work. He’s constantly showing them the emails from vendors this past week about their prices increasing and the owners are just like “nah. We will be fine.”\n\nThese people are scary. Like, mentally unstable. I really do think they would burn down their lives and their businesses for him, all while praising him. It’s like they run on faith with him. Like they have deified him. They ignore the blatantly obvious to their own detriment. \n\nI will never understand the hold he has on these people.",
              "score": 2,
              "created_utc": 1744938805.0,
              "replies": [
                {
                  "id": "mnor4ei",
                  "author": "DoubleJumps",
                  "body": "My dad is a hardcore Republican and his vendors are also informing them about all of these massive price increases due to tariffs and he's just telling clients that they don't have to worry about it because the tariffs will be gone soon. \n\nLike they quoted jobs 2 months ago that aren't supposed to start until next month and they don't have the stuff yet and he's just operating on blind Faith that Donald Trump will remove all the tariffs and strike amazing trade deals within the next couple weeks.",
                  "score": 2,
                  "created_utc": 1744939063.0,
                  "replies": [
                    {
                      "id": "mnorrx3",
                      "author": "unicron7",
                      "body": "And boy is he in for a rude awakening. No deals are going to be struck. Curious as to how much loss he will have to sustain to break the spell.\n\nThen again, they always have an excuse. It’s like watching drug addicts justify what they are doing.",
                      "score": 1,
                      "created_utc": 1744939308.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mm9twd0",
          "author": "TheBman26",
          "body": "How about just not a citizen friendly country.",
          "score": 2,
          "created_utc": 1744229881.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm8dh0g",
      "author": "igby1",
      "body": "Meanwhile on r/Thinkpad folks are still talking about the 2018 T480 they just bought for a hundred bucks.",
      "score": 22,
      "created_utc": 1744214722.0,
      "replies": [
        {
          "id": "mm915aj",
          "author": "OkDragonfruit9026",
          "body": "To honest, between the x230 and the T460/470, those were some damn fine years",
          "score": 9,
          "created_utc": 1744221520.0,
          "replies": []
        },
        {
          "id": "mmb8tik",
          "author": "ToMorrowsEnd",
          "body": "Just got a i7 13th gen T14 for $200 that is in MINT shape.   3 weeks ago corperate replacement started.  I notice most places halted hard as the flow of used 3 year old laptops really slowed down.",
          "score": 1,
          "created_utc": 1744246737.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm825p8",
      "author": "Mister_Uncredible",
      "body": "This is why I bought a new laptop in February... I'd rather it be that I bought it for no good reason, but here we are, exactly where he promised.",
      "score": 6,
      "created_utc": 1744211377.0,
      "replies": []
    },
    {
      "id": "mmbyo0e",
      "author": "kayl_breinhar",
      "body": "Here's something else to keep in mind: *spare parts won't be available for warranties.  Nor will refurbished replacements.*\n\nGet ready for an era where they just cut you a depreciated check to buy a replacement...that doesn't exist or costs 2-3x what you paid for the original device.",
      "score": 5,
      "created_utc": 1744256308.0,
      "replies": []
    },
    {
      "id": "mm9227h",
      "author": "ReconWasHere",
      "body": "If they have already imported it wouldn't they have already paid the tariff at customs?",
      "score": 3,
      "created_utc": 1744221780.0,
      "replies": []
    },
    {
      "id": "mm9w3a3",
      "author": "scubawankenobi",
      "body": "Meanwhile, Trump:\n  \"Be a Patriot & just start buying all the laptops made entirely in the USA!\"",
      "score": 5,
      "created_utc": 1744230515.0,
      "replies": []
    },
    {
      "id": "mm85soi",
      "author": "Wilko23",
      "body": "from what I've seen of the stories about product failures and RMA nightmares. This might be a good thing for American consumers...",
      "score": 5,
      "created_utc": 1744212463.0,
      "replies": [
        {
          "id": "mm95avk",
          "author": "haarschmuck",
          "body": "On a Razer Blade 15, best laptop I've owned and no issues with it.",
          "score": 4,
          "created_utc": 1744222715.0,
          "replies": [
            {
              "id": "mmb1jiv",
              "author": "beefjerky9",
              "body": "Counterpoint, I had a razer blade 14 that was, by far, the least reliable laptop I've owned. Expanded battery in less than a year that deformed the trackpad, a defective screen not long after that, and a defective fan not long after that.\n\nAnd, even ignoring that, we shouldn't forget about the deficiencies of the design: broken Thunderbolt that was unreliable, poor cooling design that required the fans to sound like a jet engine if you dared actually use the laptop, hot enough chassis to nearly burn you, despite the ridiculous fan situation. I feel like there's something else I'm missing too, but I've been free of that monstrosity for awhile now.\n\nI don't think I'd ever buy another razer product after that fiasco.",
              "score": 6,
              "created_utc": 1744244146.0,
              "replies": []
            },
            {
              "id": "mm9v4n4",
              "author": "SergeantPeeper",
              "body": "I used one for like 6 years and I poured a whole margarita into it and it still worked so I also had a great experience with my Razer Blade 15",
              "score": 2,
              "created_utc": 1744230236.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mmai0cu",
          "author": "rgrwilcocanuhearme",
          "body": "Razer's QC has always been shit. I've never had a Razer product last more than 1.5 years, and most start having problems in like 8-12 months. I've used numerous mice, a few headsets, and one keyboard. The keyboard was even pretty recent. How the fuck does a *keyboard* break? I used a shitty 50 dollar keyboard for **fifteen years** and only changed because I wanted something nicer, I bet that thing could still be running today.",
          "score": 4,
          "created_utc": 1744237359.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mm96lzg",
      "author": "loudaggerer",
      "body": "Title is misleading, they pulled direct from manufacturing purchases of these laptops.",
      "score": 2,
      "created_utc": 1744223091.0,
      "replies": []
    },
    {
      "id": "mmamkql",
      "author": "Supermkcay",
      "body": "looks interesting.",
      "score": 1,
      "created_utc": 1744238962.0,
      "replies": []
    },
    {
      "id": "mmasfko",
      "author": "HNixon",
      "body": "But product already on shelves have not been affected by tariffs. Only new shipments hitting the docks are getting hit with tariffs. What gives?",
      "score": 1,
      "created_utc": 1744240952.0,
      "replies": [
        {
          "id": "mmb64kt",
          "author": "Narrow-Chef-4341",
          "body": "Greed. \n\nProducts with faster turnover will be sticking and selling only new shipments very quickly, and no consumer knows how many the store/distributor has on local shelves vs how many were on a cargo ship just offshore Long Beach when the tariffs went into effect.\n\nSo unless you are selling ‘Madden 2024’, you’ve got free rein to jack them prices ASAP.",
          "score": 3,
          "created_utc": 1744245788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mmb0kfi",
      "author": "AliveAndNotForgotten",
      "body": "I guess they’ll take away their $5000 laptop and bring it back as $8000",
      "score": 1,
      "created_utc": 1744243794.0,
      "replies": []
    },
    {
      "id": "mmcqxxf",
      "author": "kurisu7885",
      "body": "You mean they're going to set up a factory in under a month and make lots of jobs and instead are just going to not sell here?\n\nGee, who sat that happening other than anyone with a lick of sense?",
      "score": 1,
      "created_utc": 1744271742.0,
      "replies": []
    },
    {
      "id": "mmcvpw1",
      "author": "whymeimbusysleeping",
      "body": "Why pull them? Just add a \"Trump tax\" line item",
      "score": 1,
      "created_utc": 1744274927.0,
      "replies": []
    },
    {
      "id": "mmd5j91",
      "author": "cloudy710",
      "body": "damn time to apply for my passport and move out of country?",
      "score": 1,
      "created_utc": 1744280946.0,
      "replies": []
    },
    {
      "id": "mm8c968",
      "author": "wardial",
      "body": "It think the article got it wrong.  This is likely unrelated to tariffs and more related to their inability to produce (source) RTX 5000-series gpus.  There is literally no timeline for this, so rather than keep listing/teasing it on their website for the next... oh... 6-12 months and unable to sell them, they are just pulling them.",
      "score": -4,
      "created_utc": 1744214360.0,
      "replies": []
    },
    {
      "id": "mmbofx8",
      "author": "coldwarspy",
      "body": "I love how Trump wants Ukrainian rare metals because he knows this plan that his kicking off won’t work without them but he is still doing it with or without them.",
      "score": 0,
      "created_utc": 1744252224.0,
      "replies": []
    },
    {
      "id": "mmbogkv",
      "author": "coldwarspy",
      "body": "I love how Trump wants Ukrainian rare metals because he knows this plan that his kicking off won’t work without them but he is still doing it with or without them.",
      "score": 0,
      "created_utc": 1744252229.0,
      "replies": []
    },
    {
      "id": "mmboh6r",
      "author": "coldwarspy",
      "body": "I love how Trump wants Ukrainian rare metals because he knows this plan that his kicking off won’t work without them but he is still doing it with or without them.",
      "score": 0,
      "created_utc": 1744252234.0,
      "replies": []
    },
    {
      "id": "mm7i9ux",
      "author": "Creepy_Inevitable661",
      "body": "Side note - Razer is overpriced garbage to begin with.",
      "score": -58,
      "created_utc": 1744205255.0,
      "replies": [
        {
          "id": "mm7jyak",
          "author": "Mantzy81",
          "body": "Well lucky for you, now everything will be overpriced too for no good reason too.  Congrats.",
          "score": 65,
          "created_utc": 1744205822.0,
          "replies": []
        },
        {
          "id": "mm7ogml",
          "author": "krichardkaye",
          "body": "Quality is down for sure but old school Razer was unbeatable. Still have my hex mouse from 2014",
          "score": 7,
          "created_utc": 1744207257.0,
          "replies": [
            {
              "id": "mm8yua4",
              "author": "None",
              "body": "[deleted]",
              "score": 3,
              "created_utc": 1744220887.0,
              "replies": [
                {
                  "id": "mm95gmg",
                  "author": "krichardkaye",
                  "body": "Logitech had some nice stuff before the quality took a nose dive. One of their early webcams was a favorite. Amazing sound and video.",
                  "score": 1,
                  "created_utc": 1744222761.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm7pyy3",
              "author": "jspikeball123",
              "body": "Old razer is brought up a lot as better but it wasn't. I had an original ME3 Blackwidow KB and that thing failed right after the warranty ended and they told me to pound sand. They have always been kinda shit lol",
              "score": 6,
              "created_utc": 1744207728.0,
              "replies": [
                {
                  "id": "mm7vbb4",
                  "author": "MiningDave",
                  "body": "Going to say that it's always been a crapshoot with them.\n\nBought 3 KB from them about 8 years ago. 1 is going strong, 1 lasted a few years, 1 was DOA, it's replacement was DOA, the next replacement is still going.",
                  "score": 2,
                  "created_utc": 1744209354.0,
                  "replies": []
                },
                {
                  "id": "mm8vsmu",
                  "author": "SurturOfMuspelheim",
                  "body": "I've never liked razer but I've had the Razer Viper Ultimate for 5 years and it still works great. The only issue is last year the port died on the mouse so I can't use it wired anymore. Otherwise though, no issues.\n\nEvery single other mouse I've ever bought (including my beloved G502) has had a double click or no click issue within 2-3 years.",
                  "score": 1,
                  "created_utc": 1744220045.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mm8xlzc",
              "author": "greenzeppelin",
              "body": "Like the others said - this is not true, it's always been a crapshoot.  Our entire LAN group had Razer mice back in '05 when they were basically THE name for FPS games.  I don't think a single one of us avoided having to RMA a Razer mouse at least once.",
              "score": 2,
              "created_utc": 1744220546.0,
              "replies": [
                {
                  "id": "mm98eps",
                  "author": "krichardkaye",
                  "body": "Sorry you had that experience. I was literally a league and Warcraft player. My mouse has been going strong for a decade.",
                  "score": 1,
                  "created_utc": 1744223616.0,
                  "replies": [
                    {
                      "id": "mm9f8vy",
                      "author": "greenzeppelin",
                      "body": "Right.  What we're trying to convey to you is that you're the exception, not the rule.",
                      "score": 2,
                      "created_utc": 1744225618.0,
                      "replies": [
                        {
                          "id": "mm9h61k",
                          "author": "krichardkaye",
                          "body": "I hear you. I’m sure heavier use equipment usually won’t last as long. I for sure wasn’t laning with my own rig back then. If I was doing AOE or StarCraft it was on some one else’s hobbled together monster.",
                          "score": 1,
                          "created_utc": 1744226188.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mmai6gw",
          "author": "rgrwilcocanuhearme",
          "body": "Don't know why you're getting downvoted. Razer would be appropriately priced if their QC wasn't absolute dog shit. Their devices have the shortest lifespans out of any brand I've used.",
          "score": 2,
          "created_utc": 1744237417.0,
          "replies": [
            {
              "id": "mmb1q32",
              "author": "beefjerky9",
              "body": "> Razer would be appropriately priced if their QC wasn't absolute dog shit.\n\nHey now, don't insult dog shit. At least dog shit can be useful as fertilizer.",
              "score": 1,
              "created_utc": 1744244212.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mm7x05z",
      "author": "None",
      "body": "[removed]",
      "score": -56,
      "created_utc": 1744209858.0,
      "replies": [
        {
          "id": "mm83pr2",
          "author": "A_Monkey_FFBE",
          "body": "People survived in a world just fine without computing because computing wasn’t a common thing. \n\nNowadays everything is digital, it’s a necessity to have some form of computer at this point.",
          "score": 21,
          "created_utc": 1744211840.0,
          "replies": [
            {
              "id": "mm84kh4",
              "author": "None",
              "body": "[removed]",
              "score": -31,
              "created_utc": 1744212094.0,
              "replies": [
                {
                  "id": "mm85njv",
                  "author": "The_Filthy_Zamboni",
                  "body": "Lol, no. The rest of the world will move on and find ways. The American businesses who can't access computers will fail and be left in the dust as the rest of the world continues to progress. You REALLY think an accounting company is gonna go back to use paper and calculators in America because they can't afford computers? No. They'll outsource the work to a country with computers.",
                  "score": 22,
                  "created_utc": 1744212420.0,
                  "replies": [
                    {
                      "id": "mm872yb",
                      "author": "None",
                      "body": "[removed]",
                      "score": -32,
                      "created_utc": 1744212844.0,
                      "replies": [
                        {
                          "id": "mm92a19",
                          "author": "Frodojj",
                          "body": "That sounds exactly like old Soviet propaganda. You’re right that stuff like computers don’t buy happiness, but they do help with efficiency. A less efficient workforce is more costly and can’t compete with those who are more efficient. You end up with a poor nation that can’t take care of itself. That’s why technological advancement is healthy and corruption is poison to society.",
                          "score": 8,
                          "created_utc": 1744221842.0,
                          "replies": []
                        },
                        {
                          "id": "mm8ew43",
                          "author": "vasta2",
                          "body": "When the nukes fall those guns wont matter",
                          "score": 5,
                          "created_utc": 1744215145.0,
                          "replies": []
                        },
                        {
                          "id": "mm9l8u8",
                          "author": "Sancticide",
                          "body": "Look I don't know how to explain this to you, but if the US put itself at a competitive disadvantage by no longer being leaders in technology, other countries will happily replace us and customers will not pay a premium for less efficient products and services. Dumbass, how do you think Amazon became such a huge company?! E-commerce! Y'know, with computers. 74% of their profits now come from AWS, which is cloud computing services. Write that down in your notepad while you pretend we don't have to compete in a global economy.",
                          "score": 8,
                          "created_utc": 1744227388.0,
                          "replies": [
                            {
                              "id": "mm9m8wj",
                              "author": "None",
                              "body": "[removed]",
                              "score": -1,
                              "created_utc": 1744227677.0,
                              "replies": [
                                {
                                  "id": "mm9ture",
                                  "author": "Sancticide",
                                  "body": "If people want to live minimalist lifestyles, that's fine. But pretending that the economy doesn't need technology or trade is completely braindead. Go to a 3rd world country that lacks money, infrastructure, and opportunity and tell them how lucky they are, while you enjoy the luxuries created by our economic resources. See how that goes for you.",
                                  "score": 6,
                                  "created_utc": 1744229868.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mm9cy4j",
                          "author": "i_eat_babies__",
                          "body": "You are someone a bit stupid who thinks they sound smart. The rest of the replies on your comments were from people who are quite nice and understanding, and god bless them for that, but I do not think you are capable of truly hearing out other opinions. I believe you are just capable of sticking to your own opinions.",
                          "score": 3,
                          "created_utc": 1744224937.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mm8e83o",
                  "author": "ChoMar05",
                  "body": "Have you ever talked to someone older about the world before computing? A banking account was something only rich people could afford. The normal person got the money in a paper bag. Ever needed something more niche? Well, for everything that's not stocked in your shop a door-to-door salesman might come twice a year. And good luck learning to read maps again. It's actually not that easy once you leave your home area and notice there is a big construction site where your designated route should be. And that's not even talking about how piss poor and exploitable a country without computers would be if the rest of the world has them.",
                  "score": 6,
                  "created_utc": 1744214946.0,
                  "replies": []
                },
                {
                  "id": "mm85ot8",
                  "author": "A_Monkey_FFBE",
                  "body": "If anything, they’ll give in to rising costs and pass it on to consumers.\n\nThat’s usually how it goes.",
                  "score": 4,
                  "created_utc": 1744212430.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mm8dlj6",
          "author": "Agent_Dongson",
          "body": "I love how you people keep moving goal posts.",
          "score": 7,
          "created_utc": 1744214759.0,
          "replies": []
        },
        {
          "id": "mm81ssa",
          "author": "SQL617",
          "body": "Need versus want, in todays day and age there is absolutely no reason why we can’t have wants. We’re not toughing out another pandemic..",
          "score": 4,
          "created_utc": 1744211269.0,
          "replies": []
        },
        {
          "id": "mm8xh1i",
          "author": "dandroid126",
          "body": "Conservatives causally admitting that the tariffs are bad for the economy by suggesting that we buy fewer things due to higher prices.",
          "score": 3,
          "created_utc": 1744220509.0,
          "replies": [
            {
              "id": "mm9aldo",
              "author": "alidan",
              "body": "they have been saying stop buying cheap chinese shit you don't need for a long time.",
              "score": -2,
              "created_utc": 1744224251.0,
              "replies": [
                {
                  "id": "mmd27xr",
                  "author": "SilverBuggie",
                  "body": "Who you lying to? They have been buying cheap chinese shit they want for a long time. Everyone has.",
                  "score": 1,
                  "created_utc": 1744279034.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mmai9p9",
          "author": "rgrwilcocanuhearme",
          "body": "I think people missed your irony.",
          "score": 2,
          "created_utc": 1744237448.0,
          "replies": []
        },
        {
          "id": "mm9j4wy",
          "author": "Sancticide",
          "body": "How many times did your parents drop you on your head as a child and why didn't they finish the job?",
          "score": 2,
          "created_utc": 1744226772.0,
          "replies": []
        }
      ]
    }
  ]
}