{
  "post": {
    "title": "AMD's upcoming RDNA 5 flagship could target RTX 5080-level performance with better RT | UDNA architecture expected to deliver major ray tracing uplift",
    "author": "chrisdh79",
    "id": "1m6aqgz",
    "score": 857,
    "created_utc": 1753180976.0,
    "selftext": "",
    "num_comments": 166,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m6aqgz/amds_upcoming_rdna_5_flagship_could_target_rtx/"
  },
  "comments": [
    {
      "id": "n4i3a5d",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753180978.0,
      "replies": []
    },
    {
      "id": "n4idrlt",
      "author": "hyrumwhite",
      "body": "As long as it doesn’t target the 5080s price, that sounds lovely ",
      "score": 279,
      "created_utc": 1753185528.0,
      "replies": [
        {
          "id": "n4iki03",
          "author": "pizoisoned",
          "body": "Good, fast, cheap. You can have two.",
          "score": 56,
          "created_utc": 1753188059.0,
          "replies": [
            {
              "id": "n4inz2u",
              "author": "RareInterest",
              "body": "For a graphic card, what is the difference between good and fast 😄",
              "score": 88,
              "created_utc": 1753189250.0,
              "replies": [
                {
                  "id": "n4jjrto",
                  "author": "New-Monk4216",
                  "body": "I would say drivers can make you understand the difference between good and fast.",
                  "score": 28,
                  "created_utc": 1753198673.0,
                  "replies": []
                },
                {
                  "id": "n4jjmsi",
                  "author": "kclongest",
                  "body": "Anyone remember 3D accelerators back in the late 90’s / 2000’s? I can think of all sorts of things.",
                  "score": 7,
                  "created_utc": 1753198635.0,
                  "replies": [
                    {
                      "id": "n4mhwh3",
                      "author": "gpsxsirus",
                      "body": "I remember when ATI released the All-In-Wonder. 2D, 3D, and a TV tuner on a single card!\n\nIn my one friend group there were four of us. Two guys thought of themselves as the techies with superior knowledge. The third guy started telling them about the new card, and they spent a good 10 minutes talking down to him because those have to be on separate cards.   They just couldn't believe such a thing was possible.",
                      "score": 2,
                      "created_utc": 1753229457.0,
                      "replies": [
                        {
                          "id": "n4nnsdi",
                          "author": "kclongest",
                          "body": "There’s also the basics like functioning drivers. Intel Arc anyone?",
                          "score": 2,
                          "created_utc": 1753244881.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n4kxds4",
                      "author": "happy-cig",
                      "body": "After owning a tnt2 geforce2, 3, 4, voodoo fx i remember lol. ",
                      "score": 1,
                      "created_utc": 1753212424.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n4k4jnu",
                  "author": "ArseBurner",
                  "body": "We're past the age of jank, so my example would be upscaling:\n\nGood: DLSS 2 to 4, FSR 4\n\nNot good: DLSS 1, FSR 1 to 3\n\nBut go back far enough and there's stuff like the S3 Savage 2000 which was fast, introduced texture compression and had hardware T&L, but was also very broken in many games.",
                  "score": 10,
                  "created_utc": 1753204413.0,
                  "replies": []
                },
                {
                  "id": "n4iwpyx",
                  "author": "KetsuN0Ana",
                  "body": "Isn’t the “fast” here referring to how quickly you can get your hands on it?",
                  "score": 9,
                  "created_utc": 1753192104.0,
                  "replies": []
                },
                {
                  "id": "n4kxjlu",
                  "author": "Secure-Pain-9735",
                  "body": "Fast: it’ll match/beat the 5080 this decade.",
                  "score": 1,
                  "created_utc": 1753212470.0,
                  "replies": []
                },
                {
                  "id": "n4mblzb",
                  "author": "nooneisback",
                  "body": "I guess the amount of VRAM can also be a factor. The 8GB 5060 is fast, but it's gonna choke hard in the near future, while 1080 Ti owners laught at it.",
                  "score": 1,
                  "created_utc": 1753227387.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n4inm8x",
              "author": "hyrumwhite",
              "body": "I don’t want cheap, I’m happy with “reasonable”",
              "score": 9,
              "created_utc": 1753189128.0,
              "replies": []
            },
            {
              "id": "n4jdr46",
              "author": "blastradii",
              "body": "I want good and cheap. Good includes fast so hah!",
              "score": 2,
              "created_utc": 1753197003.0,
              "replies": []
            },
            {
              "id": "n4jwhb4",
              "author": "khoaperation",
              "body": "If it’s not fast, how is it good?",
              "score": 2,
              "created_utc": 1753202221.0,
              "replies": []
            },
            {
              "id": "n4lhlqj",
              "author": "ViveIn",
              "body": "You need to add insane profit margins as the fourth option and then say you can choose three.",
              "score": 2,
              "created_utc": 1753218061.0,
              "replies": []
            },
            {
              "id": "n4m4yhu",
              "author": "Dracekidjr",
              "body": "They can take their time",
              "score": 1,
              "created_utc": 1753225246.0,
              "replies": []
            },
            {
              "id": "n4nxjyh",
              "author": "DamonHay",
              "body": "If it’s fast *and* cheap, how could it not be good? What, does it catch fire or somethi- oh, right….",
              "score": 1,
              "created_utc": 1753249530.0,
              "replies": []
            },
            {
              "id": "n4oq8jn",
              "author": "P_ZERO_",
              "body": "You mean one?",
              "score": 1,
              "created_utc": 1753265498.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5ackeb",
          "author": "Dronin",
          "body": "Just don't believe MSRP, AMD were extremely dishonest with the 9070 and xt models only providing a \"launch day MSRP rebate\" they have not come down to msrp anywhere in the world since the first 48 hours after launch.",
          "score": 1,
          "created_utc": 1753547098.0,
          "replies": []
        },
        {
          "id": "n4jqz4x",
          "author": "ChrisFromIT",
          "body": "Even if it doesn't target 5080 prices, that is not good news.\n\nIt means that Nvidia could offer the 6080 for the same price and performance as AMD's new flagship if you wanted. Or offer a 6070ti at the same price and performance and then a 6080 with maybe a 10% or 20% performance boost over the 6070ti and AMD flagship.\n\nAnd that is bad news.\n\nEDIT: wow, people downvoting me because I'm pointing out how AMD deciding not to compete at the top end for the next generation is bad for us gamers all around.",
          "score": -3,
          "created_utc": 1753200685.0,
          "replies": [
            {
              "id": "n4v705c",
              "author": "Naxirian",
              "body": "The reality is the need to actually buy top end isn't really there anymore. If you're playing eSports titles you can hit your monitor refresh rate on a midrange GPU these days, and even at 4k my 9070 XT easily holds 60+ FPS in pretty much any game with FSR enabled, often 100+.\n\nSure, you can get more with a 4090 or 5090 but that's just because you can. It isn't necessary. GPUs and upscaling tech has advanced to the point that even GPUs considered mid range are fine for 4k, let alone 1440p, and the vast majority of gamers are still on 1080p.\n\nI built a brand new setup this summer to replace my old one and I had been planning to use the 9070 XT for 18 months or so and then replace it with AMDs next flagship but so far it's handled everything I've thrown at it in 4k just fine so I'm not even sure I will bother next gen.",
              "score": 1,
              "created_utc": 1753346477.0,
              "replies": [
                {
                  "id": "n4xenvy",
                  "author": "ChrisFromIT",
                  "body": "Sure, you don't need to buy at the high end. The issue is that competition at the high end drives larger performance gains overall and sets up performance large gains for the generation afterward, too.",
                  "score": 1,
                  "created_utc": 1753375072.0,
                  "replies": [
                    {
                      "id": "n4y64k9",
                      "author": "Naxirian",
                      "body": "I think you'll see less and less actual performance gains and more \"fake\" numbers. The Nvidia 5000 series are a minor improvement hardware wise over the 4000's, probably the smallest generational upgrade they've ever done. It's all in the software trickery at the moment. Nvidia don't care as much about pushing GPU tech because their main business is no longer GPU's. It's AI. Only a minor portion of their income is now from gaming GPU's, so they are far less motivated to push the boundaries.",
                      "score": 1,
                      "created_utc": 1753382560.0,
                      "replies": [
                        {
                          "id": "n4yb2vs",
                          "author": "ChrisFromIT",
                          "body": ">The Nvidia 5000 series are a minor improvement hardware wise over the 4000's, probably the smallest generational upgrade they've ever done\n\nAnd that is because there was no competition at the high end.\n\n>It's all in the software trickery at the moment. Nvidia don't care as much about pushing GPU tech because their main business is no longer GPU's.\n\nThey are still pushing GPU tech. It is just they are only doing so in software, and again, it is as I said because there is no competition at the high end. Competition at the high end drives hardware innovation. Competition at the low end only helps drive innovation on the software side of things.",
                          "score": 1,
                          "created_utc": 1753383988.0,
                          "replies": [
                            {
                              "id": "n4zh72a",
                              "author": "Naxirian",
                              "body": "They care for sure but they're not pouring as much effort or money into it as they were. Their CEO straight up said they are no longer a graphics company. I have no doubt AMD will come out with something higher end next gen, but for AMD's graphics division the money is not in the high end.\n\nCompanies do not give a singular fuck about pushing the boundaries, they care about profit. If there's no profit to AMD pushing the high end, which there almost certainly isn't, then why would they bother? Their money is in the mid-range, and supplying the hardware for PlayStations (RIP Xbox).",
                              "score": 1,
                              "created_utc": 1753396223.0,
                              "replies": [
                                {
                                  "id": "n4zkftx",
                                  "author": "ChrisFromIT",
                                  "body": ">AMD's graphics division the real money is in the mid-range battle\n\nNot even. Most of their money in graphics has come from consoles. It is about 2/3 to 4/5 of their gaming segment.\n\n>I have no doubt AMD will come out with something higher end next gen\n\nThis whole thread is how AMD's nextgen flagship is targeting 5080 levels of performance.\n\n>Their CEO straight up said they are no longer a graphics company. \n\nYet graphics just for consumers is still about $18 billion in revenue for them yearly. Not to mention, some of the data center segments are for graphics base processing.\n\nAlso, keep in mind that Nvidia's CEO said they were no longer a graphics company way back in an email in 2012. So it really means nothing.",
                                  "score": 1,
                                  "created_utc": 1753397298.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4neo89",
              "author": "maxlax02",
              "body": "Competition is…bad? That’s a new one.",
              "score": -1,
              "created_utc": 1753241082.0,
              "replies": [
                {
                  "id": "n4nf75a",
                  "author": "ChrisFromIT",
                  "body": "No, it is the lack of competition that is bad.\n\nLiterally, we have AMD's next gen flagship targeting the performance of Nvidia's current gen 2nd best GPU.\n\nThat means there is a lack of competition at the top end for the next generation. That is not good. Case in point, look at the top end of GPUs for this current generation. That is because AMD decided to skip being competitive at the top end of this generation.",
                  "score": 7,
                  "created_utc": 1753241290.0,
                  "replies": []
                },
                {
                  "id": "n4or5hr",
                  "author": "P_ZERO_",
                  "body": "There isn’t really any competition. AMD consistently comes in late with pricing that doesn’t inspire. Here’s how it usually goes:\n\n- nvidia set new performance standard (and price point)\n\n- half way through the generation, AMD release slightly lesser product for marginal price cut\n\n- nvidia release a refresh/price point gap filler that directly competes with AMDs product \n\nThis basically creates a loop where people wait for AMD to release something knowing full well that nvidia has a product waiting to fill a void. True competition would be getting a like for like product that offers substantial financial incentive to buy. The last 10 years have simply been quarrels over marginal differences in 600-1200 cards.",
                  "score": 3,
                  "created_utc": 1753265982.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n4l5ik6",
          "author": "Lendari",
          "body": "AMD knows what they need to do (deliver incredible value per dollar) and they've done it before.",
          "score": -5,
          "created_utc": 1753214720.0,
          "replies": [
            {
              "id": "n4l8aoj",
              "author": "Fredasa",
              "body": "I would have been happier to see \"targets 4090 performance.\"  I have to weigh the cons of losing CUDA productivity (huge—would mean having to use a separate workstation entirely) and the simple reality that DLSS has fewer conspicuous temporal artifacts and I still unavoidably notice the ones that are there.",
              "score": 0,
              "created_utc": 1753215493.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n4i3y6z",
      "author": "LJMLogan",
      "body": "And by the time RDNA 5 comes out, RTX 60XX will be released. RDNA 4 came out in February, kinda deceptive to act like RDNA 5 is weeks away or something",
      "score": 270,
      "created_utc": 1753181299.0,
      "replies": [
        {
          "id": "n4i5yte",
          "author": "PineappleLemur",
          "body": "It's all about value imo.. I'm ok with a card being \"only 4080\" if it costs as much as a 2060.... Even if it's years late.\n\nI don't need the latest shit to enjoy 1080/1440p at high FPS.",
          "score": 110,
          "created_utc": 1753182233.0,
          "replies": [
            {
              "id": "n4i8fv7",
              "author": "Lagviper",
              "body": "But they are not agressive on value either and I can bet they won’t be again in the future, not against old card but even against the RTX 6000 series competing equivalent.",
              "score": 85,
              "created_utc": 1753183337.0,
              "replies": [
                {
                  "id": "n4jy8vv",
                  "author": "flamingtoastjpn",
                  "body": "New gfx cards are ridiculously complex, extremely expensive to design and test, and the investors aren’t going to support these projects unless the gross margin is 40-50%. That’s just the reality of the industry right now.\n\nValue for money is in old gfx cards, or buying a new one with the intention of running it into the ground and not buying again for a decade. I love my 2080ti",
                  "score": -11,
                  "created_utc": 1753202716.0,
                  "replies": [
                    {
                      "id": "n4kdbwv",
                      "author": "Shadow647",
                      "body": ">bought a 4090 for 1700 EUR\n\n>sold for 1900 EUR\n\n>bought a 5090 for 1800 EUR (ex-VAT this time)\n\nyeah running cards into the ground is definitely best bang for the buck /s",
                      "score": 5,
                      "created_utc": 1753206773.0,
                      "replies": [
                        {
                          "id": "n50sd3l",
                          "author": "zzazzzz",
                          "body": "you are still out 1500€..",
                          "score": 1,
                          "created_utc": 1753412806.0,
                          "replies": [
                            {
                              "id": "n52y5he",
                              "author": "Shadow647",
                              "body": "that's assuming I will get 0 EUR for it in a year and a half when new generation gets released, which will definitely not be the case :)",
                              "score": 1,
                              "created_utc": 1753449440.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n4khdtj",
                      "author": "SoftlySpokenPromises",
                      "body": "My 1660Ti was a fantastic card for quite a while until it started burning out.  Only picked my 7700 XT because it was on sale and came with some games, otherwise I'd still be using it despite the disconnecting.",
                      "score": 2,
                      "created_utc": 1753207888.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4ifwx3",
              "author": "FdPros",
              "body": "except amd pricing strategy will be to price it just slightly under the 5080 that it won't be very attractive.\n\nhonestly they should put the cpu marketing guys in charge.",
              "score": 33,
              "created_utc": 1753186368.0,
              "replies": [
                {
                  "id": "n4j63v8",
                  "author": "neoKushan",
                  "body": "> they should put the cpu marketing guys in charge\n\nProblem with this is that AMD actually competes in the high-end of the CPU market and Intel absolutely fumbled several generations in a row. Nvidia for all their flaws and greed, make the fastest GPU's out there and at least on some SKU's offer improvements every generation to keep that lead.",
                  "score": 10,
                  "created_utc": 1753194872.0,
                  "replies": [
                    {
                      "id": "n4ja1j3",
                      "author": "FdPros",
                      "body": "intel fumbling didn't help but ryzen being competitive at a lower price helped them bring the much needed market share. plus the longevity of the am4 socket and the fact that u didn't really need a new motherboard to upgrade is amazing.\n\namd gpus are decent but their pricing over nvidia is not that much cheaper to convince people to switch to amd. prices have settled down now and in my country a 9070xt vs 5070ti pricing is about 100-150 dollars apart. that imho isn't enough to convince most people, especially when nvidia still has better raytracing and upscaling tech.",
                      "score": 13,
                      "created_utc": 1753195976.0,
                      "replies": [
                        {
                          "id": "n4k0b9q",
                          "author": "kazuviking",
                          "body": "Lets ignore the shitshow that is installing modern am4 cpus into older am4 motherboards which don't even have pcie4.0",
                          "score": -6,
                          "created_utc": 1753203275.0,
                          "replies": [
                            {
                              "id": "n4k852j",
                              "author": "FdPros",
                              "body": "okay? the fact that you could do it is good, why hate on more options and upgradability? \n\nplus, the difference between pcie 5, 4 and 3 on a gpu is just a few percent and likely completely negated by the cpu upgrade.",
                              "score": 7,
                              "created_utc": 1753205373.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n4iz615",
                  "author": "Noselessmonk",
                  "body": "Yeah, AMD is working a worse version of the strat that worked for them back in like 2014 - price at like 75% of Nvidia because your performance was 85% of the competition from Nvidia. It made sense then.\n\nAMD has continued to price their cards to the raster performance. But we live in an era where Ray Tracing is becoming more and more common. AMDs cards, until the 9000 series at least, were at least a full gen behind Nvidia for RT. FSR3 and under don't hold a candle to DLSS in terms of image quality.\n\nOverall, for years now, it's felt like AMD sold cards at 90% the price of Nvidia's competitor card while offering a total package product that was much, much less.\n\nAnd fwiw, I rock a 6700xt.",
                  "score": 18,
                  "created_utc": 1753192843.0,
                  "replies": [
                    {
                      "id": "n4jzu4h",
                      "author": "madmofo145",
                      "body": "Yeah. I'm still rocking a GTX 1080, as it's been super rough trying to upgrade it reasonably. The 3000 series made it clear the DLSS was a real game changer, but pricing was crazy due to Covid/Crypto. If you mostly wanted a card for gaming, and were okay with making use of DLSS upscaling (ignoring frame gen) then Nvidia still generally won on the FPS per dollar spent. But pricing has been consistently a bit crazy, and even with the 9000 series, it's unclear AMD is able to win on that performance per dollar metric.",
                      "score": 6,
                      "created_utc": 1753203149.0,
                      "replies": []
                    },
                    {
                      "id": "n4lczax",
                      "author": "kanakalis",
                      "body": "they're forever using the nvidia-$50 pricing strategy. i thought the 9070xt would break the chain but no, nobody's selling at that fake ass msrp\n\nalso have a 6700XT",
                      "score": 1,
                      "created_utc": 1753216791.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4i88a8",
              "author": "nine7i",
              "body": "But that wont happen. But that time it releases the 5080 will be cheaper plus compared to a new release. You might even be able to get a 4080 super instead of whatever that amd card would be",
              "score": 6,
              "created_utc": 1753183245.0,
              "replies": [
                {
                  "id": "n4ib9l9",
                  "author": "whatnowwproductions",
                  "body": "Have graphics cards really been coming down in price recently?",
                  "score": 21,
                  "created_utc": 1753184531.0,
                  "replies": [
                    {
                      "id": "n4ibpky",
                      "author": "FuryofaThousandFaps",
                      "body": "the supply has stabilized (you can walk into my local microcenter and pick up any card except FE) so AIB prices have been coming down but most are still above launch price is what im seeing",
                      "score": 3,
                      "created_utc": 1753184712.0,
                      "replies": [
                        {
                          "id": "n4ic33b",
                          "author": "whatnowwproductions",
                          "body": "I am in the EU, so I will have to check locally.",
                          "score": 3,
                          "created_utc": 1753184863.0,
                          "replies": [
                            {
                              "id": "n4o6hv7",
                              "author": "MadBullBen",
                              "body": "Nvidia is mostly at MSRP but the 9070/xt still seem to be around €40 higher.",
                              "score": 1,
                              "created_utc": 1753254291.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n4ln4vy",
                          "author": "914paul",
                          "body": "It seems like the price gap between “high end” and “midrange” has widened.",
                          "score": 2,
                          "created_utc": 1753219676.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n4j7fs5",
                  "author": "PineappleLemur",
                  "body": "I'm not sure where you live, but here the prices have went up even on old cards.. new cards simply cost more.\n\nI bought a 3080 3 years ago.... It costs more now ffs.",
                  "score": 3,
                  "created_utc": 1753195248.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n4pujxk",
              "author": "Hikashuri",
              "body": "But that’s not how AMD works. If it competes with a 5080 they will price it $100 below the cheapest 5080.",
              "score": 1,
              "created_utc": 1753280516.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4k7vqd",
          "author": "Haelphadreous",
          "body": "The rumors when AMD canceled their high end RDNA 4 chiplet designs, was that they moved the resources over to UDNA development and were planning to pull it ahead as much as possible. \n\nCurrent rumors are that UDNA might enter mass production as soon as Q2 2026, (obviously take published rumors with a grain of salt, they are not always accurate)\n\n[https://wccftech.com/amd-udna-radeon-gaming-gpus-enter-mass-production-q2-2026-sony-ps6-expected-to-utilize-next-gen-architecture/](https://wccftech.com/amd-udna-radeon-gaming-gpus-enter-mass-production-q2-2026-sony-ps6-expected-to-utilize-next-gen-architecture/)\n\nThe latest Nvidia rumors I heard were that the 50xx series Super cards would be launching end of 2025 possibly December. \n\nIf both of those rumors do pan out to be true it seems likely that UDNA will be launching in roughly the mid point between the 50xx series Super cards and the 60xx series.",
          "score": 8,
          "created_utc": 1753205303.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4ib329",
      "author": "Shadow647",
      "body": "could",
      "score": 12,
      "created_utc": 1753184457.0,
      "replies": [
        {
          "id": "n4m42mk",
          "author": "hedoeswhathewants",
          "body": "\"Upcoming\", \"could\", and \"target\" are all huge questions\n\nSo at some point in the future we might make a GPU that could aim for a certain level of performance. Great.",
          "score": 2,
          "created_utc": 1753224960.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4iaa08",
      "author": "agdnan",
      "body": "As long as it works well with Linux",
      "score": 42,
      "created_utc": 1753184123.0,
      "replies": [
        {
          "id": "n4isiyn",
          "author": "Chilkoot",
          "body": "*There's dozens of us.  DOZENS!*",
          "score": 17,
          "created_utc": 1753190766.0,
          "replies": [
            {
              "id": "n4k0mf2",
              "author": "Vidar34",
              "body": "By now we're up to 5% of the PC user base, so about 1 in 20 PC's run Linux. I bet it's up to the hundreds now!",
              "score": 9,
              "created_utc": 1753203358.0,
              "replies": [
                {
                  "id": "n4m6hz1",
                  "author": "pm_plz_im_lonely",
                  "body": "Steam Hardware Survey says 2.57%, but the top distro is Arch at 0.27%.",
                  "score": 1,
                  "created_utc": 1753225745.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n4j418q",
              "author": "agdnan",
              "body": "😂😂😂 We are Legion",
              "score": 2,
              "created_utc": 1753194282.0,
              "replies": []
            },
            {
              "id": "n4mhtwt",
              "author": "smarterthanretards",
              "body": "I switched over last week. It's been glorious.",
              "score": 1,
              "created_utc": 1753229433.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4ko61w",
          "author": "Fantasy_masterMC",
          "body": "Honestly that is going to become more important after W10 support is killed in a few months (Assuming they go through with it, instead of realizing people aren't actually raring to go for W11).",
          "score": 6,
          "created_utc": 1753209787.0,
          "replies": []
        },
        {
          "id": "n4iedeh",
          "author": "Na5aman",
          "body": "You’ll probably need to be on a rolling release for a little bit after it comes out.",
          "score": 2,
          "created_utc": 1753185766.0,
          "replies": [
            {
              "id": "n4ih9g5",
              "author": "PacketAuditor",
              "body": "Which you should probably be doing anyway.",
              "score": -2,
              "created_utc": 1753186875.0,
              "replies": [
                {
                  "id": "n4il7d9",
                  "author": "Mastermachetier",
                  "body": "Nah I prefer stability , something with fast releases but not rolling",
                  "score": 7,
                  "created_utc": 1753188305.0,
                  "replies": [
                    {
                      "id": "n4krs6z",
                      "author": "Athabasco",
                      "body": "Best of both worlds with NixOS!",
                      "score": 2,
                      "created_utc": 1753210803.0,
                      "replies": []
                    },
                    {
                      "id": "n4iymnx",
                      "author": "PacketAuditor",
                      "body": "Up to date =/= unstable\n\nOut of date =/= stable",
                      "score": 0,
                      "created_utc": 1753192682.0,
                      "replies": [
                        {
                          "id": "n4l6jzo",
                          "author": "kinda_guilty",
                          "body": "For some other definition of \"stable\" other than what Linux distros mean when they say \"stable\". It doesn't mean \"doesn't crash\" as much as it does \"doesn't change\". So yeah the two sides of your inequalities are actually equal.",
                          "score": 2,
                          "created_utc": 1753215010.0,
                          "replies": [
                            {
                              "id": "n4lavis",
                              "author": "PacketAuditor",
                              "body": "That's not what stability means.",
                              "score": -1,
                              "created_utc": 1753216212.0,
                              "replies": [
                                {
                                  "id": "n4nvq0u",
                                  "author": "kinda_guilty",
                                  "body": "Words can mean different things in different contexts. Debian Stable is called stable as in \"unmoving\", as in \"not changing\", for example. So, no major upgrades of packages and libraries. So you can expect unchanging APIs and ABIs in the packages and libraries throughout its life. Tilting at  this windmill is pointless, it is what it is.",
                                  "score": 2,
                                  "created_utc": 1753248604.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n4iuool",
                  "author": "Na5aman",
                  "body": "My daily driver is a 5 year old laptop. I don’t need a rolling release. Mint works good for me.",
                  "score": 2,
                  "created_utc": 1753191463.0,
                  "replies": [
                    {
                      "id": "n4iyrlo",
                      "author": "PacketAuditor",
                      "body": "Not a fan of Xorg and outdated drivers, libraries, and packages. But if it works for you then go for it.",
                      "score": -1,
                      "created_utc": 1753192722.0,
                      "replies": [
                        {
                          "id": "n4j1jv6",
                          "author": "Na5aman",
                          "body": "Yeah. I think they’re going to be moving to wayland sometime soon. Not sure though. I’m not a “Linux” guy.",
                          "score": 1,
                          "created_utc": 1753193559.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4ojn6v",
          "author": "nicman24",
          "body": "honestly i had fewer issues and my set up is very bleeding edge - hdr, wayland (plasma), ai usage, steamVR, vfio (this is a bit iffy)",
          "score": 1,
          "created_utc": 1753261839.0,
          "replies": []
        },
        {
          "id": "n5r2px3",
          "author": "grilled_pc",
          "body": "This. Give me good Linux compatibility and I’ll sell my 4090 for it.",
          "score": 1,
          "created_utc": 1753772308.0,
          "replies": []
        },
        {
          "id": "n4igm5y",
          "author": "get_homebrewed",
          "body": "there's no way an AMD GPU doesn't work well with Linux",
          "score": 1,
          "created_utc": 1753186634.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4i7vcn",
      "author": "Rzhaviy",
      "body": "5080-level? So hypothetical 6070Ti?",
      "score": 11,
      "created_utc": 1753183087.0,
      "replies": [
        {
          "id": "n4j0944",
          "author": "DesAnderes",
          "body": "that‘s what I thought",
          "score": 6,
          "created_utc": 1753193171.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4j4c0a",
      "author": "Statertater",
      "body": "Lol this article is funny. Amd is doing away with CDNA and RDNA and unifying them under UDNA, so merging their enterprise stuff with consumer side. There is no “also called rdna 5”\n\nBut yeah, it’s expected we will see a new flagship",
      "score": 6,
      "created_utc": 1753194367.0,
      "replies": []
    },
    {
      "id": "n4juost",
      "author": "maze100X",
      "body": "The 9070xt (350mm^2 4nm die) is only 10 - 15% slower than a 5080\n\n\nSo unless they are going for a sub 300mm^2 3nm/2nm die and call it \"flagship\" i call BS",
      "score": 3,
      "created_utc": 1753201718.0,
      "replies": []
    },
    {
      "id": "n4i59vw",
      "author": "r31ya",
      "body": "per forum thread,\n\nwhat possibly next Xbox, Magnus layout is an 80 CU RDNA5/UDNA unit with 3nm fab. the performance should be between 5080 to 4090.\n\nthe \"Flagship\" for UDNA would be 96 CU unit, somewhere around 20% faster than Magnus. so it might be betwen 4090 and 5090.\n\nhopefully it would be the x0**8**0 series, not the x0**9**0 and priced cheaper than RTX6080.",
      "score": 14,
      "created_utc": 1753181915.0,
      "replies": [
        {
          "id": "n4ib8vk",
          "author": "Shadow647",
          "body": "we are hearing the \"next gen Xbox/PS will have performance between current-gen 80-class and previous-gen 90-class GPU\" shit for over a decade and it literally never happens",
          "score": 27,
          "created_utc": 1753184523.0,
          "replies": [
            {
              "id": "n4igdhj",
              "author": "r31ya",
              "body": "the issue pops out again with this chip layout leak along with guess of that its a $1.000 console.\n\nI don't believe PlayStation is stupid enough to target that high of price but premium Xbox might.\n\nKepler L2 also noted that its too big for usual Playstation chip.\n\nPlaystation mainline usually aim for somewhat affordable with good price/performance. usually manifest in low mid tier with xx50 tI \\~xx60 territory. (seeing PS4 and PS5 track record)",
              "score": 1,
              "created_utc": 1753186543.0,
              "replies": []
            },
            {
              "id": "n4l058q",
              "author": "ThrowAwayBlowAway102",
              "body": "Except the xx90 hasn't been put for a decade",
              "score": 0,
              "created_utc": 1753213221.0,
              "replies": [
                {
                  "id": "n4l8q07",
                  "author": "Shadow647",
                  "body": "what is that supposed to mean?",
                  "score": 0,
                  "created_utc": 1753215612.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n4q2kqj",
          "author": "nicman24",
          "body": "In comparison the 9070xt has 64 compute units.",
          "score": 2,
          "created_utc": 1753282781.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4i3qbe",
      "author": "zarafff69",
      "body": "So still not even close to an RTX 4090, let alone the RTX 6090 it will compete against.. More than 2 generations behind..",
      "score": 19,
      "created_utc": 1753181195.0,
      "replies": [
        {
          "id": "n4i4gj5",
          "author": "HeOpensADress",
          "body": "Really depends on the price point, because I’d be interested in this if it was around the price of the 9070XT.",
          "score": 25,
          "created_utc": 1753181539.0,
          "replies": [
            {
              "id": "n4i6eqx",
              "author": "JMccovery",
              "body": "Seeing the pricing shenanigans of the 9070XT, knowing that it was technically an upper-midrange card, *and* remembering where AMD priced the 7900XTX...\n\nWe'd be lucky if the top-end RDNA5 card comes out for less than $700.",
              "score": 11,
              "created_utc": 1753182432.0,
              "replies": [
                {
                  "id": "n4ibzcz",
                  "author": "shapeshiftsix",
                  "body": "People are paying over a grand for 5080, doesn't sound too bad to me",
                  "score": 13,
                  "created_utc": 1753184821.0,
                  "replies": [
                    {
                      "id": "n4iztj0",
                      "author": "Noselessmonk",
                      "body": "There's that gradual boil...",
                      "score": 4,
                      "created_utc": 1753193041.0,
                      "replies": []
                    },
                    {
                      "id": "n4my2ca",
                      "author": "Lamborghini4616",
                      "body": "That's how they get you",
                      "score": 2,
                      "created_utc": 1753235015.0,
                      "replies": [
                        {
                          "id": "n4pga66",
                          "author": "shapeshiftsix",
                          "body": "Nobody forcing you to buy anything?  Gaming has always been like this, cutting edge tech comes with a price tag.",
                          "score": 1,
                          "created_utc": 1753276105.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4i5dez",
          "author": "nekolas564",
          "body": "Where does it say it will compete against 6090? Seems obvious that they aim a tier or two below, at a better price level. In the end, pretty much only performance and price matters, and not everyone is looking to buy the most expensive cards on the market",
          "score": 10,
          "created_utc": 1753181960.0,
          "replies": [
            {
              "id": "n4i6h74",
              "author": "zarafff69",
              "body": "In terms of flagships. \n\nObviously I hope this AMD card will not be as expensive as an RTX 6090. But it’s still a very valuable comparison. There are way more 5090/4090 cards sold than 5080/4080 cards. 5090/4090 are somehow actually even a better value, even though they are so much more expensive, their performance is just in a league of its own, and nothing really comes close..",
              "score": -8,
              "created_utc": 1753182462.0,
              "replies": [
                {
                  "id": "n4i8fp0",
                  "author": "nekolas564",
                  "body": "I mean, obviously their performance are \"in a league of their own\", but is it as amazing as you make it sound? We have performance comparison reviews that boils it down to a % difference. Likewise we can compare the price difference in percentage. In the end, you just decide whether you want to pay x% more for x% more performance. And I'm sorry but I don't believe the 90 series extra performance somehow is magically special (coming from a 90 series owner).\n\nAs for things being better value, it is all relative. Nvidia made the price gap smaller on 80 vs 90 series, and not in the consumer friendly way. Not to mention some people don't have PC budget for 90 series, or some plan ahead knowing they will upgrade earlier and therefore buys a lower tier model (that still has great performance btw..)",
                  "score": 6,
                  "created_utc": 1753183335.0,
                  "replies": [
                    {
                      "id": "n4iaq5y",
                      "author": "zarafff69",
                      "body": "I mean previously, the difference between an RTX 3080 and 3090 was pretty small. Some more VRAM, but no ground breaking performance difference. But if you look at the reviews, the RTX 5090 and still the 4090 is in a league of its own. The RTX 5080 sadly doesn’t come close to an RTX 4090. And AMD is basically unable to match that performance for half a decade… That’s pretty insane…\n\nNow am I saying that everybody should go out and buy such an expensive GPU? Absolutely not. I also don’t have one. But it’s kind of depressing that it’s taking AMD this long to have a good competitor to that tier of GPU. So long, that not even the next generation will match the RTX 4090… This is not good for competition and this will make nvidia just continue pricing their best GPU’s sky high.",
                      "score": 2,
                      "created_utc": 1753184310.0,
                      "replies": [
                        {
                          "id": "n4iwqeo",
                          "author": "Stargate_1",
                          "body": "Have you seen the difference in comapny size and budget? AMD even still competing is a wonder considering NVidias profits",
                          "score": -1,
                          "created_utc": 1753192108.0,
                          "replies": [
                            {
                              "id": "n4j65fr",
                              "author": "zarafff69",
                              "body": "Yup…\n\nAlthough I guess everything is possible. AMD is finally outcompeting Intel on CPU’s. Something nobody saw coming for yeeaars. But as much as I hate nvidia because of certain things they do; at least they keep innovating. But it just comes at a cost… \n\nIntel did the opposite, and just stopped innovating and cashing in with old tech. Which provided a chance for AMD to compete. It’s gonna be wayyy harder to compete with nvidia..",
                              "score": 1,
                              "created_utc": 1753194884.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n4i7lpl",
                  "author": "firedrakes",
                  "body": "um nvida makes gpu that fully vm gamer bros cards. like you can run 3 to 6 virtual cards of 5080s or 90s on 1 card.... that top of the line. but gamers are to cheap to buy those cards.",
                  "score": -7,
                  "created_utc": 1753182969.0,
                  "replies": [
                    {
                      "id": "n4i8mjq",
                      "author": "TLKimball",
                      "body": "Or maybe most gamers simply can’t afford such cards?",
                      "score": 7,
                      "created_utc": 1753183417.0,
                      "replies": [
                        {
                          "id": "n4iatyf",
                          "author": "firedrakes",
                          "body": "Welp r and d, manf cost way more now...",
                          "score": -3,
                          "created_utc": 1753184355.0,
                          "replies": [
                            {
                              "id": "n4ima7g",
                              "author": "TLKimball",
                              "body": "How, in any way, does this matter to people who aren't willing or able to drop that kind of money into a gaming PC?",
                              "score": 3,
                              "created_utc": 1753188675.0,
                              "replies": [
                                {
                                  "id": "n4inxcu",
                                  "author": "firedrakes",
                                  "body": "Consumer don't want to pay cost of manf anymore, nor r&d .",
                                  "score": -3,
                                  "created_utc": 1753189233.0,
                                  "replies": [
                                    {
                                      "id": "n4iowib",
                                      "author": "TLKimball",
                                      "body": "You are making no sense whatsoever.  My original comment was about your statement that gamers were too cheap to buy data center cards that can emulate end-user hardware.  It has nothing to do with being “to cheap.”  Most consumers simply can’t afford to buy data center class hardware, let alone the power necessary to run that hardware.",
                                      "score": 1,
                                      "created_utc": 1753189564.0,
                                      "replies": [
                                        {
                                          "id": "n4ip8s2",
                                          "author": "firedrakes",
                                          "body": "Atm game are held back by consumer hardware.",
                                          "score": 0,
                                          "created_utc": 1753189679.0,
                                          "replies": [
                                            {
                                              "id": "n4ippy1",
                                              "author": "TLKimball",
                                              "body": "Drugs are bad, kid.  Stop doing drugs.",
                                              "score": 1,
                                              "created_utc": 1753189840.0,
                                              "replies": [
                                                {
                                                  "id": "n4ipvxi",
                                                  "author": "firedrakes",
                                                  "body": "Ah yes insult now. I see",
                                                  "score": 1,
                                                  "created_utc": 1753189895.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n4o7e4y",
          "author": "MadBullBen",
          "body": "I don't think that's right. They have a 20% extra performance thanks to a new architecture, which means it's inline with a 5080 type performance then it's got 96 compute units Vs 64 currently so that's another 50% increase. \n\nIn theory it should be around 4090-5090 territory, or matching the 6080 most likely. Not quite 6090 levels understandably.",
          "score": 2,
          "created_utc": 1753254789.0,
          "replies": []
        },
        {
          "id": "n4lcc23",
          "author": "flogman12",
          "body": "The point is the price.",
          "score": 1,
          "created_utc": 1753216613.0,
          "replies": []
        },
        {
          "id": "n5wyxg8",
          "author": "None",
          "body": "Seeing this now, hell i should've just gunned for the 5090..",
          "score": 1,
          "created_utc": 1753845164.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4jepse",
      "author": "Sylanthra",
      "body": "So it is going to compete with 5080 more than a year from now, roughly in line with when Nvidia will release the 6070 Ti which will likely also compete with 5080. So AMD is planning to be in the exact same place relative to Nvidia with regards to performance that it is now. The article makes it sound like it is moving up, but that would only be sort of true, if beats the future 6070ti to market by at least a few months.",
      "score": 2,
      "created_utc": 1753197272.0,
      "replies": []
    },
    {
      "id": "n4k5e4h",
      "author": "Haelphadreous",
      "body": "This article doesn't make sense. First of all why is it conflating UDNA and RDNA, AMD has already announced UDNA the U stands for Unified it's meant to combine/replace RDNA and CDNA.  Secondly they are discussing a card with a 50% wider memory bus and 50% more CU's than the 9070 XT, on an architecture that is rumored/expected to see roughly a 20% IPC uplift for raster and a 100% IPC uplift in RT compared to RDNA 4 like it's going to be trading blows with a 5080 or gasp maybe even a future 6080!\n\nThe 5080 is about 15% faster than a 9070 XT in Raster and around 50% to 60% faster in RT.\n\nScaling is not 100% linear, but assuming the IPC rumors about UDNA are accurate the hypothetical card configuration they are discussing would have roughly 80% more raw raster performance, 200% more raw RT performance and assuming that it's going to use GDDR7 at least 120% more memory bandwidth than a 9070 XT, it seems to me that the real would performance would be significantly higher than a 5080 given those specs.",
      "score": 2,
      "created_utc": 1753204637.0,
      "replies": []
    },
    {
      "id": "n4idz5q",
      "author": "hamsterkill",
      "body": "RDNA5? Isn't UDNA already the next expected architecture?",
      "score": 4,
      "created_utc": 1753185609.0,
      "replies": []
    },
    {
      "id": "n4kln1d",
      "author": "Kellic",
      "body": "No it won't.  I see this crap every time a new microarchitecture comes out, and it is always the same and NEVER delivers on it.  This is pure clickbait.  Nothing more.   Do I want to be wrong?  Sure.  I want to actually see AMD compete at the upper mid range as NVIDIA is a monopoly and they damn well know it.    But I suspect that by the time RDNA 5 comes out the 60xx series will be out and they will be competing with the last generation.   \nWe'll see.",
      "score": 3,
      "created_utc": 1753209073.0,
      "replies": []
    },
    {
      "id": "n4ikmzk",
      "author": "OneSeaworthiness7768",
      "body": "Does any end user honestly care about ray tracing that much? Has it made a single game better, to the point you wouldn’t want to play without it?",
      "score": 3,
      "created_utc": 1753188108.0,
      "replies": [
        {
          "id": "n4jfr6l",
          "author": "Tropez92",
          "body": "a lot of gamers care about Ray tracing, whether you want to believe it ornot",
          "score": 12,
          "created_utc": 1753197557.0,
          "replies": []
        },
        {
          "id": "n4m4apl",
          "author": "whoknows234",
          "body": "Ray tracing, Frame Gen + DLSS4 are all worth it. Good graphics dont automatically make the game more fun but it makes it more immersive.",
          "score": 5,
          "created_utc": 1753225034.0,
          "replies": []
        },
        {
          "id": "n4il5j1",
          "author": "Akunin0108",
          "body": "Less that and more that devs are now making rt only games :( it's sort of a lighting crutch for them at times it feels like",
          "score": -1,
          "created_utc": 1753188287.0,
          "replies": [
            {
              "id": "n4ix0qj",
              "author": "Stargate_1",
              "body": "How is it a crutch? It's literally the next logical step in game development. Realtime RT used to be a dream, that's why games like Half Life 2 had pre-made RT the game shipped with. If Valve had the ability to do realtime RT in Half Life 2, it would have had the feature.",
              "score": 12,
              "created_utc": 1753192196.0,
              "replies": [
                {
                  "id": "n4k0m6j",
                  "author": "kazuviking",
                  "body": "The denoiser is lightyears behind for actual quality lighting.",
                  "score": 1,
                  "created_utc": 1753203356.0,
                  "replies": [
                    {
                      "id": "n4pj0wo",
                      "author": "Stargate_1",
                      "body": "???? Cyberpunk looks great, as does DOOM Eternal. Noise certainly is not an issue I experience with RT, when I do use it.",
                      "score": 2,
                      "created_utc": 1753276980.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4j4he1",
              "author": "Zaptruder",
              "body": "By lighting crutch, do you mean solution for more accurate and dynamic lighting and materials that allows for games to provide improved visual presentation, while increasing the amount of things that can move and change in an environment?\n\nThe only reason it's not as impactful is because the tech hasn't proliferated widely enough to allow developers to just outright use it as an assumed thing that their target market has access to. If next gen consoles incorporate the tech, then that'll change, and with it, the way games are authored to take account of it.",
              "score": 8,
              "created_utc": 1753194409.0,
              "replies": []
            },
            {
              "id": "n4ixcej",
              "author": "led76",
              "body": "Crutch is a funny way to put it. It’s the correct way to compute lighting assuming that cards can handle it. I think the issue is more that it’s expensive in terms of performance and price and consumer cards on the average aren’t yet powerful enough to support it.",
              "score": 4,
              "created_utc": 1753192295.0,
              "replies": [
                {
                  "id": "n4t1ka4",
                  "author": "fraseyboo",
                  "body": "Baking lighting for raster graphics can take weeks for some games, enabling raytracing is comparably far simpler for a developer where they don't need to worry about how each individual light or scenery change will affect the render. \n\nThere are plenty of crutches out there like DLSS which get conflated with raytracing, but if a developer can't be bothered to add in a non-ray traced option then they're probably willing to cut corners in other areas too.",
                  "score": 1,
                  "created_utc": 1753313366.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n4ivqn5",
      "author": "Chilkoot",
      "body": "AMD needs to pull a rabbit out of its hat.  The unpopular truth is that AMD's market share on the GPU side is at an [all time low](https://cdn.mos.cms.futurecdn.net/nSkDfTNzwaWzFLD2nMQZ3F.png), with no indications of that turning around.\n\nAs great as FSR 4 is, developers just aren't supporting it, and current-gen cards are being returned at unprecedented rates.  AMD's best chance at regaining *some* kind of foothold in the consumer GPU market is to license DLSS in its next-gen cards, just like they licensed x86 to compete in the desktop/server space.  Sometimes you gotta deal with the devil if you want to get ahead.",
      "score": 2,
      "created_utc": 1753191797.0,
      "replies": [
        {
          "id": "n4k0re0",
          "author": "kazuviking",
          "body": "Because amd havent relased FSR4.0 yet only to some.",
          "score": 1,
          "created_utc": 1753203395.0,
          "replies": [
            {
              "id": "n4k1w5t",
              "author": "Chilkoot",
              "body": "so... their flagship feature, FSR 4, is only released to \"some\" developers, more than 4 months after the card went on sale at retail...\n\nGreat business strategy.  I can see why they are down to single digits market share.  Super anti-consumer practice if there's any truth to this.",
              "score": 3,
              "created_utc": 1753203699.0,
              "replies": [
                {
                  "id": "n4o809v",
                  "author": "MadBullBen",
                  "body": "Yep.... This is why it's such a slow adoption rate because only some developers actually have access to it. AMD said it'll be released in the 2nd half of 2025.....",
                  "score": 0,
                  "created_utc": 1753255131.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n4imemd",
      "author": "xondk",
      "body": "If they release something around 5080 with good performance better RT and a good amount of ram, they might be able to draw in none datacenter AI people.",
      "score": 1,
      "created_utc": 1753188718.0,
      "replies": []
    },
    {
      "id": "n4iqnfw",
      "author": "WheyTooMuchWeight",
      "body": "I just want a 9070 at MSRP lol",
      "score": 1,
      "created_utc": 1753190150.0,
      "replies": []
    },
    {
      "id": "n4j1fyv",
      "author": "haahaahaa",
      "body": "The current flagship targets 5070-level performance, right?  Hense the \"70\" level in the 9070xt branding.  This headline is \"upcoming RDNA 5 flagship is intended to be faster than RDNA 4 flagship\".",
      "score": 1,
      "created_utc": 1753193527.0,
      "replies": []
    },
    {
      "id": "n4j4sj2",
      "author": "imetators",
      "body": "Key word \"could\" and it does heavy lifting.",
      "score": 1,
      "created_utc": 1753194495.0,
      "replies": []
    },
    {
      "id": "n4j99ho",
      "author": "wellbornwinter6",
      "body": "When will it arrive?",
      "score": 1,
      "created_utc": 1753195759.0,
      "replies": []
    },
    {
      "id": "n4jakyc",
      "author": "NerdMouse",
      "body": "As much as I want AMD to make good products, AMDs next gpus are always hyped up as being just as good as Nvidias higher end gpus. It's great and all, but it doesnt mean as much if Nvidias next GPUs are a lot better than Nvidias current gpus. That's how its been for as long as I've been into PC gaming.",
      "score": 1,
      "created_utc": 1753196125.0,
      "replies": []
    },
    {
      "id": "n4jde5t",
      "author": "Xero_id",
      "body": "Hopefully 20gb vram im assuming this card will be around $1,000",
      "score": 1,
      "created_utc": 1753196902.0,
      "replies": []
    },
    {
      "id": "n4jxhx5",
      "author": "artnok",
      "body": "That's a sexy card",
      "score": 1,
      "created_utc": 1753202506.0,
      "replies": []
    },
    {
      "id": "n4kh3jk",
      "author": "Vince789",
      "body": ">96CU-384b, 64CU-256b, 32CU-128b\n\nCome on AMD, you need to be more aggressive than that \n\nThat'd be the third generation stuck at those configs, surely with a major node shrink they can increase the CUs\n\nSurely they should be targeting something like:\n\n* 144CU-384b, 96CU-256b, 48CU-128b (ideally)\n* 120CU-384b, 80CU-256b, 40CU-128b (or at least)\n\n3nm will bring almost double the transistor density vs 5nm RDNA3, and the PS6 supposedly will have 80CUs. AMD mid die should be looking to outperform the PS6's GPU",
      "score": 1,
      "created_utc": 1753207809.0,
      "replies": []
    },
    {
      "id": "n4ks3kb",
      "author": "Ablstem",
      "body": "Tbh for as long as I can remember, AMD has been trying to play catch up with Nvidia in regards to performance and has never really caught up with them. I’m skeptical to say the least",
      "score": 1,
      "created_utc": 1753210892.0,
      "replies": [
        {
          "id": "n4pq11a",
          "author": "XBattousaiX",
          "body": "The 9070 and 9060 cards are actually good.\n\nIgnoring the 8gb variant, they're cheaper than the Nvidia equivalent, and are within spitting distance in most games excluding black myth and a couple of other Nvidia favored titles.\n\n\nBut that's the 9060xt 16gb.\n\n\nThe 9070/xt are great cards, but unavailable at the launch price, so the value there is diminished. The $600 9070xt price would have been an absolute killer, but they clearly backed that up because they couldn't handle the losses. Shame, because that would have made AMD gain a LOT of market share.",
          "score": 1,
          "created_utc": 1753279166.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n4kx55x",
      "author": "BeenEvery",
      "body": "So long as it doesn't use AI.\n\nI'd like *actual* good performance please, not fake frames per second.",
      "score": 1,
      "created_utc": 1753212356.0,
      "replies": []
    },
    {
      "id": "n4lbxkn",
      "author": "Stereo-Zebra",
      "body": "No idea why AMD went from \"we are focusing on budget segmentation\" to \" we are targeting the 5080.\" The XTX did sell well, its near the top of Steam for Radeon GPUs. But if AMD brought a 16gb GPU to compete with the 5070 12gb for $80 less, amd made it available to buy, they would make a killing.\n\nUpdate: just checked and the 5070 accounts for more steam hardware survey results than the most popular Radeon GPU, the 6600 and 6700xt. AMD really needs to focus on regaining market share and it's not going to be by focusing on targeting the ~2 percent of gamers on a -80 class or above GPU.",
      "score": 1,
      "created_utc": 1753216501.0,
      "replies": []
    },
    {
      "id": "n4mg0oz",
      "author": "WellDatsInteresting",
      "body": "Literally all I care about is that they bring prices down to acceptable levels and make them available at their MSRP. \n\nThe $350 tier of card doubled in price in like three years and you can't even get them at that price. \n\nSo who gives a shit what AMD and Nvidia are coming out with. Make them affordable and available, that is literally the only thing important here anymore. \n\nI bailed on PC gaming after 25 years because of the extensive price gouging and scumbaggery from all parties involved in the GPU market.",
      "score": 1,
      "created_utc": 1753228819.0,
      "replies": []
    },
    {
      "id": "n4mrtq8",
      "author": "yangmeow",
      "body": "Is this a new Covid vaccine?",
      "score": 1,
      "created_utc": 1753232851.0,
      "replies": []
    },
    {
      "id": "n4n7pdo",
      "author": "Digital-Exploration",
      "body": "Yes please!",
      "score": 1,
      "created_utc": 1753238415.0,
      "replies": []
    },
    {
      "id": "n4o4syk",
      "author": "hihowubduin",
      "body": "Blah blah, I'll believe it when I see it. Watch the price be hilariously stupid and still fall short with the same power issues.",
      "score": 1,
      "created_utc": 1753253373.0,
      "replies": []
    },
    {
      "id": "n4o5gnf",
      "author": "immaZebrah",
      "body": "I mean I believe it when I see it. I've been hearing this shit about AMD cards before they come out since forever. I want this to be true but I don't want it to cost the same amount of money that it costs for an Nvidia card at that level. Enough of the collusion, the price fixing, let's drive some serious competition and start getting prices lower.",
      "score": 1,
      "created_utc": 1753253727.0,
      "replies": []
    },
    {
      "id": "n4pu80q",
      "author": "Hikashuri",
      "body": "Upcoming. It’s not coming anytime soon by then the 6000 series will have raised the bar higher again.",
      "score": 1,
      "created_utc": 1753280420.0,
      "replies": []
    },
    {
      "id": "n4qspqc",
      "author": "ChefCurryYumYum",
      "body": "I have owned a lot of different GPUs in my life. Some from ATI, Nvidia, AMD and way back in the day even 3dfx. \n\nThe current AMD GPU's are very good with good performance and good software. When you do any kind of performance per dollar comparison with real world prices there basically isn't a price range where Nvidia presents better value outside of the 5090 where AMD does not have a competitive product.\n\nWith FSR 4 coming pretty close to parity with the latest DLSS and ever improving RT performance there really will be no reason to continue to buy Nvidia unless they drastically change the value proposition of their GPUs, i.e. increase VRAM on some models and lower prices.",
      "score": 1,
      "created_utc": 1753290002.0,
      "replies": []
    },
    {
      "id": "n4rrrxl",
      "author": "ALph4CRO",
      "body": "AMD is already close to 5080 performance with the 9070xt, wtf are people smoking?",
      "score": 1,
      "created_utc": 1753299664.0,
      "replies": []
    },
    {
      "id": "n51oujf",
      "author": "hutchisson",
      "body": "meh, amd is only toys for gaming and 5 year ild cards are good enough.\n\namd has done such an awful job totally missing the AI train… these cards could have so mich \nore potential but are totally useless when it comes to AI",
      "score": 1,
      "created_utc": 1753428180.0,
      "replies": []
    },
    {
      "id": "n4j2egw",
      "author": "tyrannictoe",
      "body": "Yeah and it will still be behind in RT and PT lol",
      "score": 1,
      "created_utc": 1753193808.0,
      "replies": []
    },
    {
      "id": "n4i567d",
      "author": "nezeta",
      "body": "And a weaker version of this is supposed to be PS6/Next Xbox GPUs in 2028...",
      "score": 0,
      "created_utc": 1753181868.0,
      "replies": []
    },
    {
      "id": "n4if668",
      "author": "aloys1us",
      "body": "So it should. Nvidias been going slow in RND since they’re making so much cash from coin mining and now Ai.",
      "score": -2,
      "created_utc": 1753186083.0,
      "replies": []
    },
    {
      "id": "n4ltwz3",
      "author": "Passionofthegrape",
      "body": "If games aren’t built to use it though, does it matter?",
      "score": 0,
      "created_utc": 1753221698.0,
      "replies": []
    },
    {
      "id": "n4jyzpv",
      "author": "RatchetWrenchSocket",
      "body": "Yawn.   Nvidia is going to exit the consumer market sometime soon.",
      "score": -1,
      "created_utc": 1753202919.0,
      "replies": []
    }
  ]
}