{
  "post": {
    "title": "Valve rolls out SteamOS compatibility labels for third-party handhelds | Lenovo Legion Go S and other handhelds receive Steam Deck verification alternative",
    "author": "chrisdh79",
    "id": "1klmr6w",
    "score": 190,
    "created_utc": 1747145036.0,
    "selftext": "",
    "num_comments": 19,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1klmr6w/valve_rolls_out_steamos_compatibility_labels_for/"
  },
  "comments": [
    {
      "id": "ms3h9ua",
      "author": "None",
      "body": "[deleted]",
      "score": 34,
      "created_utc": 1747146339.0,
      "replies": [
        {
          "id": "ms3j35v",
          "author": "DrBhu",
          "body": "Let em cook; Valve will not publish unfinished business.\n\nWhile these new verified handhelds got specific hardware SteamOS on a personal computer will need to cover a pretty high amount of hardware and configurations.",
          "score": 36,
          "created_utc": 1747146886.0,
          "replies": [
            {
              "id": "ms3sftt",
              "author": "None",
              "body": "[deleted]",
              "score": 12,
              "created_utc": 1747149652.0,
              "replies": [
                {
                  "id": "ms431z1",
                  "author": "Toomanydamnfandoms",
                  "body": ">literal 14 year olds just wanting to play a video game\n\n>commenter complaining literal children aren’t RTFM like it’s the 90s\n\nAh tech Reddit, toxic in perpetuity. God forbid usability without needing to scour an entire manual ever be implemented.",
                  "score": -19,
                  "created_utc": 1747152729.0,
                  "replies": [
                    {
                      "id": "ms4s7i6",
                      "author": "LukesFather",
                      "body": "You realize you agree with the guy you sound angry at, right?",
                      "score": 14,
                      "created_utc": 1747159974.0,
                      "replies": [
                        {
                          "id": "ms4tjj4",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 6,
                          "created_utc": 1747160360.0,
                          "replies": [
                            {
                              "id": "ms6txy2",
                              "author": "Kalpy97",
                              "body": "They nailed it? You mean a tinkering machine where you have to fuck with settings, pray the game works, workarounds, etc. Sorry but its far from a 'console experience' its pretty shit in that regard.",
                              "score": -7,
                              "created_utc": 1747183049.0,
                              "replies": [
                                {
                                  "id": "msfc3bm",
                                  "author": "BrotherRoga",
                                  "body": "Sounds like you play games that aren't meant to run on the Deck in the first place. They're labeling games with the Runs Great On Steam Deck stamp for a reason.",
                                  "score": 1,
                                  "created_utc": 1747305121.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms5dewg",
                          "author": "Toomanydamnfandoms",
                          "body": "Nah man the attitude of RTFM has to die, it’s a toxic attitude that only keeps people from wanting to learn because the community is full of jerks and has no idea how to respectfully teach future generations their hobby.",
                          "score": -15,
                          "created_utc": 1747166131.0,
                          "replies": [
                            {
                              "id": "ms5i3he",
                              "author": "LukesFather",
                              "body": "Bro reread his comment 😂",
                              "score": 5,
                              "created_utc": 1747167472.0,
                              "replies": []
                            },
                            {
                              "id": "ms9hlrn",
                              "author": "TripleSecretSquirrel",
                              "body": "Idk about you, but my experience in the Linux world/community was always great.\n\nPeople may say RTFM, but their actions are pretty much always actually helpful. Anecdotally, if I had a compatibility issue on a windows, Mac, and Linux system, I could always find a solution online much faster for the Linux system thanks to the online community/userbase.",
                              "score": 2,
                              "created_utc": 1747227702.0,
                              "replies": [
                                {
                                  "id": "msahty9",
                                  "author": "Toomanydamnfandoms",
                                  "body": "I agree that finding solutions online for Linux is way easier than other ecosystems. Praise be to the many forum posts that have taught me. \n\nBut if you misread or misunderstand something and need to ask someone or make a post for clarification, so many people will just use that as a weird parasocial opportunity to try to dunk on folks simply trying to learn. And they get so god damn defensive about it, see my many downvotes lmao. Like it’s somehow a personal affront that someone didn’t know something you do. When people are rude RTFM assholes it doesn’t matter if their actions are helpful, you drive away users from ever wanting to engage, especially people who aren’t fortunate to have the same level of tech literacy or don’t know where to look to find the information they need. It gives the community a terrible reputation. \n\nSometimes people have read the manual and misunderstand something or miss shit because they are human beings. I have dyslexia, I try my best but shit happens and everyone makes mistakes. People turn tech, especially Linux education into a dick measuring ego contest when if folks were normal it should be a collaborative learning experience. It’s called nerds just be fucking normal nice people. Other spaces and hobbies online educate new folks happily, all the time. For some reason in the tech sphere when assholes burn out they don’t step back from the community, they just start commenting shit like only “rtfm smh” without actually seeing what someone was asking, and they contribute nothing but toxicity and drive away people.",
                                  "score": 1,
                                  "created_utc": 1747238754.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms8d1wo",
              "author": "Redrump1221",
              "body": "They literally have a beta branch for testing on untested hardware and I'm using it for my living room pc",
              "score": 2,
              "created_utc": 1747206948.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms8cy91",
          "author": "Redrump1221",
          "body": "I got it running on a \"desktop\". It's a minisforum mini PC but a PC none the less. It runs fine in the beta release had some issues with the stable release.",
          "score": 2,
          "created_utc": 1747206886.0,
          "replies": []
        },
        {
          "id": "ms3rkmb",
          "author": "Weir99",
          "body": "Why do you want SteamOS specifically over the plethora of desktop-ready Linux distros?",
          "score": -7,
          "created_utc": 1747149400.0,
          "replies": [
            {
              "id": "msaed0p",
              "author": "brickmaster32000",
              "body": "Because the plethora of desktop ready Linux distros are still plagued by the assumption that everyone wants to be a developer. \n\n\nThe SteamOS just works and does everything in it's power to keep you from having to fiddle with things. Drivers are installed. Compatibility layer is set up in a way that actually will run things without needing to be constantly micromanaged. Everything just works, and I mean everything not just opening a web browser which is usually as far as the desktop distros go in terms of user friendliness.",
              "score": 4,
              "created_utc": 1747237765.0,
              "replies": []
            },
            {
              "id": "ms3sn4o",
              "author": "None",
              "body": "[deleted]",
              "score": 7,
              "created_utc": 1747149710.0,
              "replies": [
                {
                  "id": "ms3wdcz",
                  "author": "Weir99",
                  "body": "Very helpful. Why do you like it? What does SteamOS have to offer that other distros don’t? I’m genuinely trying to understand this",
                  "score": -3,
                  "created_utc": 1747150785.0,
                  "replies": [
                    {
                      "id": "ms4jk46",
                      "author": "smithkey08",
                      "body": "Valve backing and resources.",
                      "score": 6,
                      "created_utc": 1747157516.0,
                      "replies": []
                    },
                    {
                      "id": "ms4qwmy",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1747159599.0,
                      "replies": [
                        {
                          "id": "ms58d0y",
                          "author": "Weir99",
                          "body": "Why would I care what distro you decide to use?\n\nI like distro hopping and was wondering what the pros were of SteamOS over other distros that people seem to be clamouring for it. Doesn't seem to be anything special to me",
                          "score": 4,
                          "created_utc": 1747164649.0,
                          "replies": [
                            {
                              "id": "ms5ctny",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 6,
                              "created_utc": 1747165961.0,
                              "replies": [
                                {
                                  "id": "ms5wu95",
                                  "author": "Firemonkey00",
                                  "body": "This…. With how bad win11 has gotten with a lot of my hardware I’m just ready for my gaming rig to be closer to plug and play.  ",
                                  "score": 4,
                                  "created_utc": 1747171865.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}