{
  "post": {
    "title": "Apple offers Indonesia USD 10 million sweetener to reverse its iPhone ban",
    "author": "a_Ninja_b0y",
    "id": "1gk1qen",
    "score": 875,
    "created_utc": 1730793524.0,
    "selftext": "",
    "num_comments": 126,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gk1qen/apple_offers_indonesia_usd_10_million_sweetener/"
  },
  "comments": [
    {
      "id": "lvhsouo",
      "author": "Pepperoni_Dogfart",
      "body": "That's called a bribe. It's a bribe. Not a \"sweetener.\"",
      "score": 990,
      "created_utc": 1730796188.0,
      "replies": [
        {
          "id": "lvhu87k",
          "author": "saurabhtamne",
          "body": "Bribe sounds illegal, calling it 'sweetner' instantly makes it sound 'legal'! 😆",
          "score": 232,
          "created_utc": 1730797240.0,
          "replies": [
            {
              "id": "lvin5l1",
              "author": "Too_Old_For_Somethin",
              "body": "Not just legal but cutesy and fun!",
              "score": 49,
              "created_utc": 1730812879.0,
              "replies": [
                {
                  "id": "lvj6m6i",
                  "author": "BellsOnNutsMeansXmas",
                  "body": "And sweet. So sweet. Like the first few drops of autumn gravy from the gravy train while it runs over your democracy.",
                  "score": 15,
                  "created_utc": 1730819514.0,
                  "replies": []
                },
                {
                  "id": "lvlu5xb",
                  "author": "foxyfoo",
                  "body": "I heard Elon is offering sweeteners to swing state voters.",
                  "score": 5,
                  "created_utc": 1730847661.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvi13n4",
              "author": "somebodyelse22",
              "body": "Huh. That's 10 people's votes to Elon Musk. Apple should dig deeper.",
              "score": 15,
              "created_utc": 1730801934.0,
              "replies": [
                {
                  "id": "lvi1m4v",
                  "author": "saurabhtamne",
                  "body": "Lol, deeper than Musk's Boring Company? 😂",
                  "score": 4,
                  "created_utc": 1730802268.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvlfvia",
              "author": "SabreSour",
              "body": "Wasn't there a supreme court case about this recently? said something like  \"Bribes are paid before hand and are illegal. Sweeteners/kick backs are the same thing but paid after and completely legal.\"\n\nPlease dear god someone tell me i'm oversimplifying and got this wrong",
              "score": 3,
              "created_utc": 1730843272.0,
              "replies": []
            },
            {
              "id": "lvkpgqo",
              "author": "QuantumQuantonium",
              "body": "No\n\nApple should call it a lottery instead but subtly select the nations theyll give money to\n\nThst way it would be legal according to some vaguely related recent court ruling",
              "score": 2,
              "created_utc": 1730835557.0,
              "replies": []
            },
            {
              "id": "lvk4gk9",
              "author": "Subtle__Numb",
              "body": "Yeah, and it’s usually less calories than table-sugar, too.",
              "score": 1,
              "created_utc": 1730829469.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvhxhee",
          "author": "bigsquirrel",
          "body": "RTFA…\nThe ban relates to companies making a certain amount of product in Indonesia to sell products in Indonesia.  Apple is offering an additional 10 million in investment for manufacturing products locally on top of the manufacturing it already does there. \n\nThis is a clickbait headline. \n\nThe law is interesting, I’m curious to see how it plays out.  The issue was they pledged 109 million but had so far only invested 95 million.  This 10 is a way to meet the gap and find some middle ground.\n\nA less click baity article. \n\nhttps://www.firstpost.com/tech/apple-offers-extra-investment-to-remove-iphone-ban-in-indonesia-bandung-plant-gets-10mn-boost-13832103.html",
          "score": 74,
          "created_utc": 1730799503.0,
          "replies": [
            {
              "id": "lvi159o",
              "author": "shadowrun456",
              "body": ">The law is interesting\n\nIt's not \"interesting\", it's blatant blackmail / racketeering. \"Pay us money of we will ban your products in our country\".",
              "score": -31,
              "created_utc": 1730801963.0,
              "replies": [
                {
                  "id": "lvkhf88",
                  "author": "bigsquirrel",
                  "body": "“Blackmail” nah bro.  If more countries had the balls to stand up and say if you want to make money here invest here what would the world be like. \n\nIt’s not even a tax really, they could make money from that investment.  It’s basically saying you don’t just get to take and not have a stake. \n\nSorry if this is complicated for you.",
                  "score": 12,
                  "created_utc": 1730833198.0,
                  "replies": [
                    {
                      "id": "lvkipjc",
                      "author": "shadowrun456",
                      "body": ">If more countries had the balls to stand up and say if you want to make money here invest here what would the world be like.\n\nWhat would the world be like? For one, an iPhone would cost 10k $. Who do you think pays that cost in the end? Consumers.",
                      "score": -11,
                      "created_utc": 1730833576.0,
                      "replies": [
                        {
                          "id": "lvlz8oe",
                          "author": "yapyd",
                          "body": "What in the world are you waffling about? There's enough margins to be made in an iPhone and 10million to Apple is a rounding error.\n\n\nThis is Apple not delivering on their promises and trying to make amends after Indonesia called them out on it.\n\n\nYou think apple is offering this 10m because they were sorry? Indonesia has ~300m population, not being able to sell the iPhone there would be a potential loss of billions",
                          "score": 5,
                          "created_utc": 1730849360.0,
                          "replies": [
                            {
                              "id": "lvm581l",
                              "author": "shadowrun456",
                              "body": ">What in the world are you waffling about?\n\nWhat was not clear about my comment? I am talking about if every country made the same laws as Indonesia did.\n\n>10million to Apple is a rounding error.\n\nExactly. So what is **your** explanation for why Apple refused to pay it at first?",
                              "score": 2,
                              "created_utc": 1730851381.0,
                              "replies": [
                                {
                                  "id": "lvojc48",
                                  "author": "yapyd",
                                  "body": "> Exactly. So what is your explanation for why Apple refused to pay it at first? \n\n\nHow would I know? Incompetence? Regional offices trying to make numbers look good for performance reviews? Corporate Greed? All of the above? ",
                                  "score": 1,
                                  "created_utc": 1730885852.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lvovo4r",
                          "author": "heickelrrx",
                          "body": "As Indonesia I tell you this\n\nApple not even have an Apple Store or Genius bar over here\n\nThe aftersales server are handled by AASP, which is 3rd party company \n\nIt’s so sad, we are the 4th biggest population on Planet, while small country like our neighboor have better treatment",
                          "score": 3,
                          "created_utc": 1730892876.0,
                          "replies": [
                            {
                              "id": "lvv6a6u",
                              "author": "Schwertkeks",
                              "body": "But how many of those can actually afford to be an Apple customer?",
                              "score": 0,
                              "created_utc": 1730966923.0,
                              "replies": [
                                {
                                  "id": "lvv7aiv",
                                  "author": "heickelrrx",
                                  "body": "per 2021, We have 13 Million of iOS user,\n\nWe have population of 283 million\n\nFor context, India with 1.4 Billion of population only have 17 Million of iOS user\n\nWhich mean iPhone user are more common on Indonesia than in India\n\nPlease do no Underestimate us, we far more capable buying these Fruit phone",
                                  "score": 2,
                                  "created_utc": 1730967570.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvichaw",
          "author": "spekky1234",
          "body": "It's called haggling. Indonesia asked for 14 million. Apple willing to pay 10",
          "score": 11,
          "created_utc": 1730808378.0,
          "replies": [
            {
              "id": "lvirs0c",
              "author": "Pepperoni_Dogfart",
              "body": "Yes, \"haggling.\" \n\nDefinitely not a bribe.",
              "score": -7,
              "created_utc": 1730814561.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvji2cv",
          "author": "sargonas",
          "body": "It’s not a bribe, it’s Apple meeting their demands. They passed a new law that requires at least 40% of a smart phone being made or designed or developed in the country for it to be allowed to be sold there, and they have banned many android phones with the same reason.\n\nApple cannot feasibly move iPhone production or development to Indonesia so they are taking the fine print of the law and using the alternative option provided in the law to shift various forms of “investment into the economy“ to bypass the manufacturing requirement.\n\nThey’re doing the thing the Indonesian government is trying to force them to do in order to be able to sell phones in the country. Is it messed up? Yeah probably but it’s either that or walk away from a massive market… Which no sane company would do.",
          "score": 8,
          "created_utc": 1730822947.0,
          "replies": []
        },
        {
          "id": "lvit6zz",
          "author": "None",
          "body": "[deleted]",
          "score": 12,
          "created_utc": 1730815060.0,
          "replies": [
            {
              "id": "lviu8lj",
              "author": "Pepperoni_Dogfart",
              "body": "Oh no, I read it.\n\n\n>The plan would involve Apple investing in a factory in Bandung, southeast of Jakarta, in partnership with its list of suppliers, the people said, asking not to be identified because they’re not authorised to speak publicly. The facility would make products such as accessories and components for Apple gadgets, the people said. \n\n\nThat list of suppliers?  Those are government officials. That factory? It'll never open. The story is crystal clear if you've ever done business in the ASEAN region.",
              "score": -7,
              "created_utc": 1730815431.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lviu4ip",
          "author": "32FlavorsofCrazy",
          "body": "Bribes are standard operating procedure in Indonesia. It’s pretty blatantly done over there, they don’t care and there’s no repercussions, you’re just not supposed to talk about it. \n\nMy first day in Jakarta my taxi driver was pulled over by the police and he stuck the equivalent of $5 out the window as he approached. The officer was about to take it until he looked in the back and saw a white lady, yelled at the driver and made him get out, they walked behind the vehicle and exchanged the money in private with a small lecture from the officer and we were on our way. It’s just how shit works over there.",
          "score": 11,
          "created_utc": 1730815392.0,
          "replies": []
        },
        {
          "id": "lvis6i5",
          "author": "Ok_Belt2521",
          "body": "I’ve actually dealt with the fcpa for my job. Bribes are illegal but “grease payments” are completely fine. Basically  can’t pay you to influence the decision making but I can pay you to speed up the decision making process. It’s a fine line.",
          "score": 6,
          "created_utc": 1730814704.0,
          "replies": []
        },
        {
          "id": "lviq6w8",
          "author": "junktrunk909",
          "body": "I'm not an Apple person but come on\n\n> the nation’s Ministry of Industry, which last month blocked a permit allowing the sale of the iPhone 16 on the grounds that the US tech giant’s local unit has not met a 40 per cent domestic content requirement for smartphones and tablets.\n\nIt's Indonesia that's demanding an absurd level of investment. Apple is responding with a plan to provide some level of investment. It's not a bribe, they're just negotiating about how much investment will be required to lift the ban.",
          "score": 24,
          "created_utc": 1730813997.0,
          "replies": [
            {
              "id": "lvlgj8n",
              "author": "herpetl",
              "body": "They call it Industrial Participation and it’s been a growing trend the non first world countries have been using for at least a decade. They will put out some sort of procurement request and basically blackmail the companies that bid with domestic demands before they will sign a contract. I don’t blame Apple for looking for alternative ways to reach agreement. Indonesia could easily nationalize their in country business and proprietary or competition sensitive information could be lost. Interesting case to follow.",
              "score": 6,
              "created_utc": 1730843464.0,
              "replies": [
                {
                  "id": "lvmie1v",
                  "author": "andDevW",
                  "body": "Apple could drop ship them from any number of neighboring countries in plain boxes. AFAIK there's no easy way for dogs to sniff out iPhones from a pile of boxes.",
                  "score": 0,
                  "created_utc": 1730856000.0,
                  "replies": [
                    {
                      "id": "lvx9myb",
                      "author": "warm_melody",
                      "body": "They put a ban on the usage of the iPhone any citizens using the phone get penalized.",
                      "score": 1,
                      "created_utc": 1730998558.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvirods",
              "author": "Pepperoni_Dogfart",
              "body": "Yes, \"investment\" \n\nDefinitely not a bribe. \n\nLotta weird nerds responding to this comment, white knighting for nobody in particular.",
              "score": -26,
              "created_utc": 1730814525.0,
              "replies": [
                {
                  "id": "lvishye",
                  "author": "junktrunk909",
                  "body": "WTH are you talking about. Nobody white knighting. We just read an article and understood the words. It's not that high a bar.",
                  "score": 20,
                  "created_utc": 1730814816.0,
                  "replies": [
                    {
                      "id": "lviv86n",
                      "author": "not_having_fun",
                      "body": "Shut it nerd, with your reading and comprehension and whatnot",
                      "score": 10,
                      "created_utc": 1730815780.0,
                      "replies": []
                    },
                    {
                      "id": "lvivwix",
                      "author": "Pepperoni_Dogfart",
                      "body": "You're reading it like a westerner. That unnamed factory is never being built. Those unnamed suppliers are government officials. This happens aaaaaaaaall the time in ASEAN countries.",
                      "score": -15,
                      "created_utc": 1730816015.0,
                      "replies": [
                        {
                          "id": "lvj9c3m",
                          "author": "ConsistentFatigue",
                          "body": "Ok internet poster Pepperoni dogfart. Feel free to provide sources",
                          "score": 11,
                          "created_utc": 1730820351.0,
                          "replies": [
                            {
                              "id": "lvja1es",
                              "author": "Pepperoni_Dogfart",
                              "body": "Yes, regular, run of the mill corruption is often reported in countries without free speech and where extrajudicial killings happen all the time.",
                              "score": -7,
                              "created_utc": 1730820562.0,
                              "replies": [
                                {
                                  "id": "lvja7w8",
                                  "author": "ConsistentFatigue",
                                  "body": "Cool. Now show me how Apple won’t actually build anything with your inside sources.",
                                  "score": 8,
                                  "created_utc": 1730820617.0,
                                  "replies": [
                                    {
                                      "id": "lvjalm1",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": 1,
                                      "created_utc": 1730820732.0,
                                      "replies": [
                                        {
                                          "id": "lvjatjv",
                                          "author": "ConsistentFatigue",
                                          "body": "Got it, so you work for Apple?",
                                          "score": 5,
                                          "created_utc": 1730820799.0,
                                          "replies": [
                                            {
                                              "id": "lvjbf56",
                                              "author": "Pepperoni_Dogfart",
                                              "body": "No, I work for a fortune 50 that does business in ASEAN nations.\n\nJust the cost of doing business in some places.",
                                              "score": 2,
                                              "created_utc": 1730820979.0,
                                              "replies": [
                                                {
                                                  "id": "lvjbzrs",
                                                  "author": "ConsistentFatigue",
                                                  "body": "Thanks for confirming you know nothing about this  deal with Apple!",
                                                  "score": 1,
                                                  "created_utc": 1730821149.0,
                                                  "replies": [
                                                    {
                                                      "id": "lvjcc57",
                                                      "author": "Pepperoni_Dogfart",
                                                      "body": "Sorry I was trying to shed some light into what's going on. \n\nNo amount of experience with leading horses to water will make them drink.",
                                                      "score": 1,
                                                      "created_utc": 1730821250.0,
                                                      "replies": [
                                                        {
                                                          "id": "lvjcqrx",
                                                          "author": "ConsistentFatigue",
                                                          "body": "You aren’t leading anyone to water which is the problem. You’ve provided literally zero evidence to back up anything you say. For all we know you are smashing donuts in your face in your mom’s basement drooling over anime’s girls. \n\nSo ya, pepperoni dogfart, sorry no one believes you just because you say so on Reddit.",
                                                          "score": 1,
                                                          "created_utc": 1730821372.0,
                                                          "replies": [
                                                            {
                                                              "id": "lvjd3m8",
                                                              "author": "Pepperoni_Dogfart",
                                                              "body": "You're completely right. That doesn't make anything I'm saying less of a likely pretty accurate read of the situation.",
                                                              "score": 2,
                                                              "created_utc": 1730821477.0,
                                                              "replies": [
                                                                {
                                                                  "id": "lvjdrug",
                                                                  "author": "ConsistentFatigue",
                                                                  "body": "Sure it does",
                                                                  "score": 1,
                                                                  "created_utc": 1730821677.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvhwb8w",
          "author": "herrbz",
          "body": "I mean, that's exactly what Indonesian government was after in the first place.",
          "score": 9,
          "created_utc": 1730798683.0,
          "replies": []
        },
        {
          "id": "lvik6x2",
          "author": "ministryofchampagne",
          "body": "Indonesia banned iPhone 16 because Apple didn’t follow through with their investment they agreed to. \n\nGovernments call these kinda things “investments”",
          "score": 3,
          "created_utc": 1730811726.0,
          "replies": []
        },
        {
          "id": "lvi3ik1",
          "author": "nicuramar",
          "body": "No it’s not, it’s called falling for a click bait headline. ",
          "score": 6,
          "created_utc": 1730803472.0,
          "replies": []
        },
        {
          "id": "lviq7z5",
          "author": "Sylvurphlame",
          "body": "Which is exactly what the Indonesian governement wanted. *shrug*",
          "score": 1,
          "created_utc": 1730814007.0,
          "replies": []
        },
        {
          "id": "lvj95ls",
          "author": "phoenixmatrix",
          "body": "Im tired today. I really pictured a huge box of Stavia packets offered as a bribe.",
          "score": 1,
          "created_utc": 1730820297.0,
          "replies": []
        },
        {
          "id": "lvjkuzk",
          "author": "leafbelly",
          "body": "I mean, considering the initial reason it was banned was because of money (investments), it makes sense.",
          "score": 1,
          "created_utc": 1730823773.0,
          "replies": []
        },
        {
          "id": "lvjvu3g",
          "author": "reeveb",
          "body": "Candy Crush!",
          "score": 1,
          "created_utc": 1730826974.0,
          "replies": []
        },
        {
          "id": "lvl1ml0",
          "author": "kevin379721",
          "body": "Someone doesn’t know the actual story/details… you should’ve just commented, “I didn’t read anything!”",
          "score": 1,
          "created_utc": 1730839141.0,
          "replies": [
            {
              "id": "lvl3nea",
              "author": "Pepperoni_Dogfart",
              "body": "Nah, I read it. That factory is not a factory, and those suppliers are the government officials asking for a bribe. This is nothing but a shakedown/extortion job. Happens aaaaaaaaall the time in ASEAN countries.",
              "score": 2,
              "created_utc": 1730839728.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvuxo91",
          "author": "Gash_Stretchum",
          "body": "And they already have a framework for charging them, the Foreign Corrupt Practices Act. https://en.m.wikipedia.org/wiki/Foreign_Corrupt_Practices_Act",
          "score": 1,
          "created_utc": 1730961776.0,
          "replies": []
        },
        {
          "id": "lvhxh2v",
          "author": "C0rnishStalli0n",
          "body": "Or did Indo extort Apple?",
          "score": 0,
          "created_utc": 1730799497.0,
          "replies": [
            {
              "id": "lvhygyz",
              "author": "None",
              "body": "I'm not quite sure it rises to the level of extortion, but it definitely feels like Indonesia twisted Apple's arm to get the latter to cough up the full amount of promised investment.",
              "score": 14,
              "created_utc": 1730800185.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvhuqn0",
          "author": "Hanamiya0796",
          "body": "And they just need to add $10 to the price due to some bullshit I'm sure they have already come up with to get it back. sTonKs",
          "score": 1,
          "created_utc": 1730797597.0,
          "replies": []
        },
        {
          "id": "lvhvtdn",
          "author": "_-Kr4t0s-_",
          "body": "That’s right. It’s sugar, not Splenda.",
          "score": 0,
          "created_utc": 1730798338.0,
          "replies": []
        },
        {
          "id": "lvi11bl",
          "author": "shadowrun456",
          "body": "Exactly. How is this not blackmail / racketeering? \"Pay us money of we will ban your products in our country\".",
          "score": -4,
          "created_utc": 1730801891.0,
          "replies": []
        },
        {
          "id": "lviixiy",
          "author": "NO_SPACE_B4_COMMA",
          "body": "Yeah but this is r/gadgets and everyone here knows apple is perfect and does no wrong.",
          "score": -3,
          "created_utc": 1730811220.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvhph6h",
      "author": "NuPNua",
      "body": "Christ, if it's that easy to get money out of Apple, the EU shouldn't keep fighting to get them to pay proper tax in Ireland, but just ban the iPhone and wait for an offer.",
      "score": 340,
      "created_utc": 1730794012.0,
      "replies": [
        {
          "id": "lvhu4zb",
          "author": "micro_bee",
          "body": "10 whole millions!  \nCan't even pay a CEO bonus with that",
          "score": 119,
          "created_utc": 1730797178.0,
          "replies": [
            {
              "id": "lvhuic6",
              "author": "NuPNua",
              "body": "I assume they'd pay a lot more to get the EU market back.",
              "score": 22,
              "created_utc": 1730797437.0,
              "replies": [
                {
                  "id": "lviv5x7",
                  "author": "pastworkactivities",
                  "body": "Yeah 20 years worth of taxes",
                  "score": 10,
                  "created_utc": 1730815759.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvhrg2m",
          "author": "Jestersage",
          "body": "I think it could be because Indonesian, poor as they maybe, are consider more terminally online than EU - in short, a very good emerging market.",
          "score": 40,
          "created_utc": 1730795326.0,
          "replies": []
        },
        {
          "id": "lvieiw0",
          "author": "NoEquivalent3869",
          "body": "$10m is so small, they wouldn’t even notice the bill.",
          "score": 12,
          "created_utc": 1730809329.0,
          "replies": [
            {
              "id": "lvig546",
              "author": "NuPNua",
              "body": "I'd assume they'd offer more based on the size of the market.",
              "score": 2,
              "created_utc": 1730810051.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvicj3j",
          "author": "hyrumwhite",
          "body": "lol I like the idea of enforcing taxes on mega corps with yearly bans",
          "score": 5,
          "created_utc": 1730808401.0,
          "replies": []
        },
        {
          "id": "lviri0k",
          "author": "she_speaks_valyrian",
          "body": "Wouldn't proper tax be not paying taxes in Ireland? And instead paying taxes in California? ",
          "score": 2,
          "created_utc": 1730814462.0,
          "replies": [
            {
              "id": "lvis23f",
              "author": "NuPNua",
              "body": "Not on their European operations.",
              "score": 5,
              "created_utc": 1730814660.0,
              "replies": [
                {
                  "id": "lvixvo7",
                  "author": "she_speaks_valyrian",
                  "body": "True. I guess I'm thinking more along the lines of Intellectual Property development and holding locations. ",
                  "score": 1,
                  "created_utc": 1730816692.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvjylb9",
          "author": "yupidup",
          "body": "EU stupidly wasted their iphone ban leverage asking for usb c and no charger. They could have pocketed to many millions instead, what a waste",
          "score": 1,
          "created_utc": 1730827774.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvhujj4",
      "author": "shortyman920",
      "body": "How much do we wanna bet that it’s all going to a few decision makers who can reverse it? $10 mil usd goes a long way in Indonesia. Hell I’d be tempted to. Its not like the citizens don’t want access to buy iPhones",
      "score": 82,
      "created_utc": 1730797460.0,
      "replies": [
        {
          "id": "lvicuvd",
          "author": "spekky1234",
          "body": "The entire issue was that apple invested 14 million too little money in indonesia. Think they're giving 10 million to some corrupt people risking bad press just to save 4 million? Nope, they injected it into the indonesian economy",
          "score": 35,
          "created_utc": 1730808556.0,
          "replies": []
        },
        {
          "id": "lviezsl",
          "author": "a_reverse_giraffe",
          "body": "They’re not paying the government 10M in cash. They’re investing 10M to make factories inside Indonesia to build more components for the iPhone so that it won’t be included in the ban.",
          "score": 20,
          "created_utc": 1730809543.0,
          "replies": []
        },
        {
          "id": "lvhycqk",
          "author": "NewRedditor13",
          "body": "Bro don’t underestimate our capacity for corruption, we’re very good at it. A recent raid at a middleman for court bribery has found almost $60 million in cash and gold at his house alone.\n\nSo $10 million is peanuts for someone like apple (not even enough to bribe the authorities if caught). We only do upwards of hundreeds even billions for high potential opportunities like this",
          "score": 20,
          "created_utc": 1730800105.0,
          "replies": []
        },
        {
          "id": "lvivtn8",
          "author": "garmander57",
          "body": "> The plan would involve Apple investing in a factory in Bandung, southeast of Jakarta, in partnership with its list of suppliers, the people said, asking not to be identified because they’re not authorised to speak publicly. The facility would make products such as accessories and components for Apple gadgets, the people said.\n\nFrom the second paragraph in the article",
          "score": 5,
          "created_utc": 1730815988.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvihv6w",
      "author": "sagenumen",
      "body": "It’s an investment in local manufacturing to meet a minimum required by law, not a bribe to officials.",
      "score": 38,
      "created_utc": 1730810784.0,
      "replies": [
        {
          "id": "lvj0ps3",
          "author": "Yosho2k",
          "body": "Hahaha hahaha ha it's funny that you think that. It's not enough by any measure to build out manufacturing but it is enough for a small group of people to skim. That was cute.",
          "score": -6,
          "created_utc": 1730817641.0,
          "replies": [
            {
              "id": "lvj8h5l",
              "author": "sagenumen",
              "body": "Nowhere did I say it is meant to build out entire manufacturing capabilities. If it allows a manufacturer to retool enough and build a large enough portion of the iPhone, it allows Apple to follow the law.",
              "score": 16,
              "created_utc": 1730820089.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvmgh3e",
      "author": "Frostsorrow",
      "body": "$10 million is insultingly low",
      "score": 5,
      "created_utc": 1730855296.0,
      "replies": []
    },
    {
      "id": "lvhq6oe",
      "author": "HeftyArgument",
      "body": "It sounds like a pittance to offer an entire nation, but Apple knows the way this place distributes money means that it’s more than enough.",
      "score": 17,
      "created_utc": 1730794484.0,
      "replies": []
    },
    {
      "id": "lvht6eq",
      "author": "Mikaeo",
      "body": "For access to a market of 270+ million people? Try a billion, holy crap. It's the 16th largest economy in the world, so it's not even a small economy. 10 million is literally nothing",
      "score": 21,
      "created_utc": 1730796521.0,
      "replies": [
        {
          "id": "lvhtbmx",
          "author": "NobleRotter",
          "body": "10m is an amount that only has meaning if it's intended for the pockets of a few officials not a nations coffers",
          "score": 25,
          "created_utc": 1730796620.0,
          "replies": [
            {
              "id": "lvhtd2t",
              "author": "Mikaeo",
              "body": "Oh, good point",
              "score": -1,
              "created_utc": 1730796646.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvid1bn",
          "author": "spekky1234",
          "body": "Bro... They were only 14 million short of their promised investments... How you get half a billion?",
          "score": 7,
          "created_utc": 1730808643.0,
          "replies": []
        },
        {
          "id": "lvhtkf6",
          "author": "None",
          "body": "Cause indonesia has such a big userbase with money that would make apple build up a fuckign semiconductor industry from scratch for billions?",
          "score": 6,
          "created_utc": 1730796785.0,
          "replies": []
        },
        {
          "id": "lvn32gf",
          "author": "Bentendo24",
          "body": "Being the 16th largest economy means nothing if the gap when compared to countries higher on the list is unfathomable.",
          "score": -2,
          "created_utc": 1730863461.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvlwswv",
      "author": "tmdblya",
      "body": "Here’s a nickel, kid. Don’t spend it all in one place.",
      "score": 2,
      "created_utc": 1730848536.0,
      "replies": []
    },
    {
      "id": "lvkmk6p",
      "author": "Weikoko",
      "body": "Crazy cheap bribe for apple. If I were Indonesian government, I would ask $500 million. Apple would certainly pay.\n\nBut Indonesian government is so corrupted and shortsighted. They will bite this deal.",
      "score": 3,
      "created_utc": 1730834703.0,
      "replies": [
        {
          "id": "lvrfqk5",
          "author": "None",
          "body": "Now that they got 10, they can ask for 20 next month XD",
          "score": 3,
          "created_utc": 1730919581.0,
          "replies": [
            {
              "id": "lvrr1g0",
              "author": "Weikoko",
              "body": "Typical Indonesian government lmao",
              "score": 3,
              "created_utc": 1730922669.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvjscwy",
      "author": "OtterishDreams",
      "body": "![gif](giphy|l3nW85J0lT1bfpIfC|downsized)\n\nMy entire panty line is made in vietnam!!!! Whats next!",
      "score": 1,
      "created_utc": 1730825957.0,
      "replies": []
    },
    {
      "id": "lvkfelm",
      "author": "networksynth",
      "body": "Sounds like a tip and not a bribe!",
      "score": 1,
      "created_utc": 1730832615.0,
      "replies": []
    },
    {
      "id": "lvkkp4r",
      "author": "None",
      "body": "I'm curious to know, if the iPhone was banned what would iPhone users use instead?",
      "score": 1,
      "created_utc": 1730834157.0,
      "replies": []
    },
    {
      "id": "lvkqib5",
      "author": "kaleidoleaf",
      "body": "I thought Apple was offering $10 million worth of aspartame...",
      "score": 1,
      "created_utc": 1730835863.0,
      "replies": []
    },
    {
      "id": "lvlnrzs",
      "author": "None",
      "body": "Ipso facto, artificial sweetener in food and drink is a fake bribe.\n\n\"Hey, we know this shit tastes horrible, so here let's sweeten the deal...\" -manufacturers.",
      "score": 1,
      "created_utc": 1730845641.0,
      "replies": []
    },
    {
      "id": "lvniez6",
      "author": "Omegalazarus",
      "body": "Does Obama work for Apple now?",
      "score": 1,
      "created_utc": 1730869283.0,
      "replies": []
    },
    {
      "id": "lvxh637",
      "author": "Mechagouki1971",
      "body": "How long does it take Apple to make $10M?\n\nTen minutes?",
      "score": 1,
      "created_utc": 1731000685.0,
      "replies": []
    },
    {
      "id": "lvhw8t9",
      "author": "krzSntz",
      "body": "For sure the money goes into the pocket of select few. They'll book 10 mil Rupiah (about 650 USD) for the gov as Administration fee payment.",
      "score": 1,
      "created_utc": 1730798636.0,
      "replies": []
    },
    {
      "id": "lviiibx",
      "author": "outandaboot99999",
      "body": "Fun fact: Indonesia was at one point Blackberry's top customer. 220M population and their messenger app BBM was the main mode of communication at the time. ie, this could be a material financial change for Apple.",
      "score": 0,
      "created_utc": 1730811048.0,
      "replies": []
    },
    {
      "id": "lvjqdux",
      "author": "Seigmoraig",
      "body": "Indonesia has a GDP of 1.371 trillion USD",
      "score": 1,
      "created_utc": 1730825383.0,
      "replies": []
    },
    {
      "id": "lvit61o",
      "author": "covidcode69",
      "body": "$10 mil is probably around $10 dollars to the average medium income family.",
      "score": 0,
      "created_utc": 1730815050.0,
      "replies": []
    },
    {
      "id": "lvin89l",
      "author": "None",
      "body": "Crook making billions but cheapness out on Indonesia.",
      "score": -3,
      "created_utc": 1730812907.0,
      "replies": []
    },
    {
      "id": "lvirg2v",
      "author": "Jazbone",
      "body": "A whole ten million dollars mister, wow.",
      "score": 0,
      "created_utc": 1730814443.0,
      "replies": []
    },
    {
      "id": "lvi12ie",
      "author": "shadowrun456",
      "body": "How is this not blackmail / racketeering? \"Pay us money of we will ban your products in our country\".",
      "score": -5,
      "created_utc": 1730801913.0,
      "replies": [
        {
          "id": "lvide4m",
          "author": "spekky1234",
          "body": "Because apple signed a contract promising they would invest a minimum amount of money in indonesia because indonesia has laws that a certain percentage has to be sourced locally to protect their businesses and apple fell short a measly 14 million and refuses to pay itz even though it's such a nothing number",
          "score": 15,
          "created_utc": 1730808807.0,
          "replies": [
            {
              "id": "lvilzey",
              "author": "shadowrun456",
              "body": ">Because apple signed a contract promising they would invest a minimum amount of money in indonesia\n\nDid they have a choice to not sign this contract?\n\n>because indonesia has laws that a certain percentage has to be sourced locally to protect their businesses\n\nSo the answer is \"no\". That's what makes it blackmail / racketeering.\n\n>and apple fell short a measly 14 million and refuses to pay itz even though it's such a nothing number\n\n\"It's not about money, it's about sending a message.\" I can't believe than I'm defending Apple, but good on them to (at least initially) refusing to submit to blackmail and pay bribes.",
              "score": -9,
              "created_utc": 1730812429.0,
              "replies": [
                {
                  "id": "lvj7jyv",
                  "author": "GerhardArya",
                  "body": "No, that makes the country smart as it knows how to extract the most benefit out of giving a company access to a market of 270 million+ people. Instead of just letting a company exploit their people for nothing.\n\nApple knew what they need to do to be allowed in the indonesian market, they agreed to it, they failed to fulfill it. Samsung and the chinese brands follow the rules without too much hassle. Why should Apple get special treatment?\n\nIt's not blackmail because no company is ENTITLED access to a country's market. It's not a bribe because the money Apple is offering here goes to investing on new factories in the country instead of officials' pockets.",
                  "score": 1,
                  "created_utc": 1730819805.0,
                  "replies": [
                    {
                      "id": "lvjalvo",
                      "author": "shadowrun456",
                      "body": ">No, that makes the country smart as it knows how to extract the most benefit out of giving a company access to a market of 270 million+ people.\n\nYou're sounding like Trump. Blackmailing people might work short-term, but it won't make you any friends. Imagine if **every** country made similar laws.",
                      "score": -3,
                      "created_utc": 1730820734.0,
                      "replies": [
                        {
                          "id": "lvjcjd1",
                          "author": "GerhardArya",
                          "body": "Again, not blackmail since the company is not entitled access to the market in the first place. You think America doesn't have certain rules companies need to follow to enter the american market? EU? China? India? You sound like an entitled corpo shill that thinks companies are above countries and should be free to do whatever they want.",
                          "score": 3,
                          "created_utc": 1730821310.0,
                          "replies": [
                            {
                              "id": "lvjfrdr",
                              "author": "shadowrun456",
                              "body": ">Again, not blackmail since the company is not entitled access to the market in the first place.\n\nBut they were already allowed. And it's not about following some health, safety, environmental, or labor regulations. It's \"pay us x million $ or we will remove your access\". That's what makes it blackmail.\n\n>entitled corpo shill\n\nHow to admit you've lost the argument without admitting you've lost the argument (switch to ad hominem attacks).",
                              "score": -1,
                              "created_utc": 1730822262.0,
                              "replies": [
                                {
                                  "id": "lvjfy13",
                                  "author": "GerhardArya",
                                  "body": "They were allowed because they agreed to those rules. The failed to fulfill their part of the deal and now they're trying to bargain their way to fulfilling partially the deal they failed to uphold. They were too low in their indonesian investment by 14 mil, they now try to bargain it to 10 mil.\n\nYes, you are a corpo shill because you think countries shouldn't be able to force companies to fulfill deals they AGREED to and SIGNED.",
                                  "score": 2,
                                  "created_utc": 1730822316.0,
                                  "replies": [
                                    {
                                      "id": "lvjgwud",
                                      "author": "shadowrun456",
                                      "body": ">They were too low in their indonesian investment by 14 mil, they now try to bargain it to 10 mil. \n\nOk, so what is **your** explanation for why Apple is doing this. Do you honestly, genuinely think, that Apple can't afford a measly 4 million $?",
                                      "score": 0,
                                      "created_utc": 1730822603.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvijql1",
      "author": "1leggeddog",
      "body": "Nice bribe",
      "score": -4,
      "created_utc": 1730811544.0,
      "replies": []
    },
    {
      "id": "lvio1ev",
      "author": "0neM0reLight",
      "body": "the iBribe",
      "score": -2,
      "created_utc": 1730813209.0,
      "replies": []
    },
    {
      "id": "lvi3wud",
      "author": "GammaDealer",
      "body": "iPhones are banned in my house!",
      "score": -2,
      "created_utc": 1730803715.0,
      "replies": []
    },
    {
      "id": "lvhtjju",
      "author": "DexLeMaffo",
      "body": "Legal bribery is a thing nowadays",
      "score": -9,
      "created_utc": 1730796768.0,
      "replies": [
        {
          "id": "lvhuizc",
          "author": "FireWrath9",
          "body": "Indonesia is the one coercing apple lol",
          "score": 8,
          "created_utc": 1730797450.0,
          "replies": [
            {
              "id": "lviwg14",
              "author": "DexLeMaffo",
              "body": "They're coercing Google too.",
              "score": 0,
              "created_utc": 1730816200.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvidjo2",
      "author": "Lem0n_Lem0n",
      "body": "If you can't call it a bribe, might as well call it condense milk..\nAseans love condense milk",
      "score": -3,
      "created_utc": 1730808878.0,
      "replies": []
    }
  ]
}