{
  "post": {
    "title": "Nvidia RTX 5090 prices drop below MSRP in Europe as stock improves | No such encouraging signs in the US, though.",
    "author": "a_Ninja_b0y",
    "id": "1kwwywv",
    "score": 975,
    "created_utc": 1748375530.0,
    "selftext": "",
    "num_comments": 84,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kwwywv/nvidia_rtx_5090_prices_drop_below_msrp_in_europe/"
  },
  "comments": [
    {
      "id": "mukqoiz",
      "author": "yetAnotherLaura",
      "body": "Anecdotal evidence but just last night I was looking at prices for 5090s in Germany and saw quite a bit of ASUS/MSI ones at around 2.2/2.5k and actually in stock at mainstream retailers.\n\nWhile that is not quite MSRP, it is very close to the expected price for partner branded boards.",
      "score": 141,
      "created_utc": 1748376257.0,
      "replies": [
        {
          "id": "muksfun",
          "author": "HiddenoO",
          "body": "The ASUS cards immediately sold out and are back to 2579€. The cheapest right now are Inno3D cards at roughly 2.4k.",
          "score": 46,
          "created_utc": 1748376765.0,
          "replies": [
            {
              "id": "mukto0b",
              "author": "yetAnotherLaura",
              "body": "Yeah, figured it wouldn't last long.\n\nThat said though... It is still an improvement in price form a while ago.\n\nStill sucks though.",
              "score": 16,
              "created_utc": 1748377112.0,
              "replies": [
                {
                  "id": "mus4h6q",
                  "author": "Gaeus_",
                  "body": "Graphics cards should not cost the price of a third hand car.",
                  "score": 5,
                  "created_utc": 1748470777.0,
                  "replies": [
                    {
                      "id": "musp7f6",
                      "author": "yetAnotherLaura",
                      "body": "And cars shouldn't cost the same as a small apartment and yet they exist. \n\nA 5090 isn't for regular gamers, or hardcore gamers. It's for the people with money to burn or for professional use cases.\n\nIf you use your computer for gaming, there's no reason to buy one other than \"because I can\". Same with pretty much any high end item on any hobby.",
                      "score": 3,
                      "created_utc": 1748477674.0,
                      "replies": [
                        {
                          "id": "mv2szk5",
                          "author": "acornSTEALER",
                          "body": "Realistically a 5090 isn’t for gamers, it’s for 3D modeling and other GPU intensive tasks.",
                          "score": 1,
                          "created_utc": 1748616699.0,
                          "replies": []
                        },
                        {
                          "id": "muue64a",
                          "author": "Gaeus_",
                          "body": "I did not mention the 5090.\n\nIf you wanna know I was referencint the 3070, that card cost around 1300€ for a while, which would be 300€ more than a\"first year student rundown car\" for a midrange GPU.",
                          "score": 0,
                          "created_utc": 1748503254.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "muq9ikn",
              "author": "akeean",
              "body": "Aren't the ASUS cards the only ones that have individual shuts for each pin?",
              "score": 1,
              "created_utc": 1748451401.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mul1lzd",
          "author": "CryptikTwo",
          "body": "There’s a palit card available at scan/overclockers for £1,879 over here in the uk, everything else is still £2,000-2,100 or higher though.",
          "score": 8,
          "created_utc": 1748379365.0,
          "replies": [
            {
              "id": "mul5whw",
              "author": "mickeyPijamas",
              "body": "Whats the difference between the same cards from different vendors?",
              "score": 3,
              "created_utc": 1748380644.0,
              "replies": [
                {
                  "id": "mul90dq",
                  "author": "randomIndividual21",
                  "body": "main different is the cooler, more expensive model has vapor chamber and bigger cooler so its quieter and run cooler, they also then to have better bined chip so bigger OC potential.\n\nthey also has different pcb design with different component used like capacitors, but no idea how much actual different it makes",
                  "score": 16,
                  "created_utc": 1748381601.0,
                  "replies": [
                    {
                      "id": "mun2wtt",
                      "author": "anonymousbopper767",
                      "body": "None of the regular retail cards are binned.  Only specialty ones like Galax HoF are binned.\n\nThe main difference is the cooler but they don’t really matter much.  Nvidia has stuff locked down so hard all models are pretty much the same performance.",
                      "score": 8,
                      "created_utc": 1748404212.0,
                      "replies": [
                        {
                          "id": "muoawj6",
                          "author": "stanley15",
                          "body": "Apologies my ignorance what does binned mean in this context?",
                          "score": 1,
                          "created_utc": 1748427817.0,
                          "replies": [
                            {
                              "id": "muoer0r",
                              "author": "log-off",
                              "body": "They essentially select the best performing GPU silicon to put on the board, e.g. ones that are most stable at high frequencies. So the best ones are reserved for the high tier/specialty cards",
                              "score": 1,
                              "created_utc": 1748429692.0,
                              "replies": [
                                {
                                  "id": "mur1hex",
                                  "author": "anonymousbopper767",
                                  "body": "(Which are usually only available for sponsored/pro overclockers, and maybe a handful will get sold at retail and then never again)",
                                  "score": 1,
                                  "created_utc": 1748459452.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "muq1glz",
                              "author": "yetAnotherLaura",
                              "body": "Take this with a bit of salt but it goes something like this.\n\nChips like GPU and CPUs are made in round wafers. The ones closest to the center tend the be the best ones and as you go to the edges things can vary in quality. That difference of some chips performing better than other is actually how you get the different tiers like i3/i5/i7. A chip might be good enough for a tier but not reliable for the upper one.\n\nA \"binned chip\" usually means specifically selected from the best pool of candidates.",
                              "score": 1,
                              "created_utc": 1748449022.0,
                              "replies": [
                                {
                                  "id": "mur1rh4",
                                  "author": "anonymousbopper767",
                                  "body": "Fun fact: it’s really the doughnut of silicon that is best. Center is mediocre, edges are bad.",
                                  "score": 3,
                                  "created_utc": 1748459530.0,
                                  "replies": [
                                    {
                                      "id": "mur6lpd",
                                      "author": "yetAnotherLaura",
                                      "body": "What this guy said.\n\nBasic theory wasn't that wrong.",
                                      "score": 2,
                                      "created_utc": 1748460905.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "mxpa7ya",
                                  "author": "ezfordonk",
                                  "body": "Thats really Interesting! Thx mate",
                                  "score": 1,
                                  "created_utc": 1749883674.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "munsgr2",
                      "author": "totesmygto",
                      "body": "So faster melting of the 12pin?  Mmm ill pass.",
                      "score": 1,
                      "created_utc": 1748417112.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mul6kax",
                  "author": "danielv123",
                  "body": "The fan shrouds have different colors. Some are bigger than others.",
                  "score": 3,
                  "created_utc": 1748380848.0,
                  "replies": []
                },
                {
                  "id": "mulaas7",
                  "author": "CryptikTwo",
                  "body": "Not a lot. Each vendor generally has a cheap reference model, they’re all pretty much the same. The more expensive models will have custom pcbs with improved power delivery and better/bigger coolers etc. \n\nThere’s still little difference between them though. It generally comes down to who’s customer services and reputation for not cheaping out on components like caps etc. you trust more and these days they’ve all had issues so whatever, buy the cheapest 🤷🏻‍♂️",
                  "score": 2,
                  "created_utc": 1748381995.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "muo49fl",
          "author": "extrapower99",
          "body": "But at 2.2-2.3 it is msrp pretty much.",
          "score": 2,
          "created_utc": 1748424134.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mukqefe",
      "author": "rundownv2",
      "body": "Is it as stock improves? Or is it as people stop buying it as a much because it melts cables?",
      "score": 180,
      "created_utc": 1748376175.0,
      "replies": [
        {
          "id": "mukt5mn",
          "author": "a_Ninja_b0y",
          "body": "Yes",
          "score": 70,
          "created_utc": 1748376967.0,
          "replies": []
        },
        {
          "id": "muofvqq",
          "author": "BlastFX2",
          "body": "Joking aside, it's the stock. A ton of companies have been diverting their entire US allotments to mostly Europe due to the uncertainty around Trump's tariffs. We've got too much of pretty much everything right now.",
          "score": 9,
          "created_utc": 1748430204.0,
          "replies": [
            {
              "id": "mur9wd4",
              "author": "Mindestiny",
              "body": "I cant wait until it's cheaper to fly to the UK, buy a card, and fly back with it than it is to pay the tariffs!",
              "score": 3,
              "created_utc": 1748461839.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mum2g66",
          "author": "Nope_______",
          "body": "I don't get it. Yes, the stock improves if people stop buying them (provided they're still producing them at the same rate). Are you thinking \"stock improves\" means \"production is ramped up?\"",
          "score": 4,
          "created_utc": 1748391204.0,
          "replies": [
            {
              "id": "mum7mc3",
              "author": "rundownv2",
              "body": "I think both. The article doesn't say why there's more stock. But even if it's just the former, I think my point was more that saying \"stock improves\" is a positive way to phrase things and skims over the reason why there's more cards available.",
              "score": 9,
              "created_utc": 1748392970.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muo5d7m",
          "author": "Milnoc",
          "body": "I was just wondering about that.",
          "score": 1,
          "created_utc": 1748424784.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mulx1vs",
      "author": "Zeconation",
      "body": "Gibabyte 5090 is selling for 4.000$ currently.\n\nI still have hard time believing this is the reality that we live in.",
      "score": 26,
      "created_utc": 1748389388.0,
      "replies": [
        {
          "id": "mum7dvl",
          "author": "jaweinre",
          "body": "Kids and PC enthusiasts (I know, I was too) are like addicts to this stuff. I too spent dumb amounts of $ on graphic cards throughout childhood/adolescence. Some years ago sold my  1070 when GeForce now became a thing, and I realized how ridiculous this spending was, on top of the increasing power draw / heat / noise generation.\nNot gonna pour one more dime on on-site PC gaming, only subscription on and off depending on time available. Modding games will be missed, but clearly not justifies the insane prices, shady business practices from manufacturers and scalping.\n\n\n\nI mean there's literally guys in this thread worrying about rising temps in their rooms through the upcoming summer and talking about te melting power plugs, on a product that sets them back 2500 usd and up. I tell you, these companies get away with this and laugh.",
          "score": 11,
          "created_utc": 1748392889.0,
          "replies": [
            {
              "id": "mume45f",
              "author": "supreme_blorgon",
              "body": "This very small group of idiot consumers with way too much disposable income has disproportionately affected the entire industry and really ruined the hobby. It's absolutely insane how much money people continue to throw at Nvidia and similar companies. Same problem in gaming with preorders and whales. Same problem with phones.\n\nThe sheer scale of utterly mindless consumption of all this *stuff* is really depressing. It's absolutely an addiction and I wish more people were talking about it.",
              "score": 18,
              "created_utc": 1748395194.0,
              "replies": [
                {
                  "id": "munuvyz",
                  "author": "jaweinre",
                  "body": "Actually not way too much disposable income in many cases. I sure hadn't way too much disposable income growing up, rather I hustled and saved through the year, fixed computers etc, sold the previous card and put money on top for the next thing. For fucks sake now looking back if my father had blocked me from wasting it away on ATI and Nvidia, and put it towards investments or Bitcoin (lol) instead, I would be writing this from my yatch.\nParents, educate and keep tabs on your kids.",
                  "score": 1,
                  "created_utc": 1748418549.0,
                  "replies": []
                },
                {
                  "id": "mumpfjo",
                  "author": "MrNerd82",
                  "body": "hate to break it to you about \"the world\" - but that's how it is in any high end niche market where there's high demand, low supply, and near zero alternatives. \n\nBugatti/Pagani/koenigsegg for example.  Why so expensive \"it's just a car\" right?  because it's been proven over the decades the level they play on and people with disposable income willing to buy the best of the best. \n\nYour comment of \"mindless consumption\" can be drilled down to the every day stuff we all buy, not just GPU's or the high tech/rare stuff. \n\nPeople can buy what they want with their money, I personally don't care.   The more stupid aspect of what you describe are the people going into debt for these things.    Paying cash and owning something (even it's it's frivolous) is still lightyears better than the idiots who carry 20/50/100k of credit card debt at 30% APR.   \n\nThese are usually the same people who will turn around in 6 months and complain about not being able to afford food or rent.",
                  "score": -8,
                  "created_utc": 1748399075.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "munrpbv",
              "author": "TheModeratorWrangler",
              "body": "Fury X owner here… did I need to upgrade that R9 290X? Not really, but damn I loved the smoothness of the Fury X in GTA:O despite only 4GB RAM",
              "score": 1,
              "created_utc": 1748416661.0,
              "replies": []
            },
            {
              "id": "mur34pu",
              "author": "akeean",
              "body": "\"Geforce Now is excited to now offer unskippable ads and permanent overlay banners on the existing tiers of the service, with higher priced new tiers, starting at monthly rate of 1/12th of the price of a premium 70ti series card with almost comparable performance (non-ti perf but with more vram or ti perf with non-ti vram allocation)\"",
              "score": 1,
              "created_utc": 1748459918.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mukp911",
      "author": "Arkfoo",
      "body": "![gif](giphy|MvdaYPuKPMNZRJCl8Z)\n\n# \"as stock improves\"",
      "score": 151,
      "created_utc": 1748375847.0,
      "replies": []
    },
    {
      "id": "mulh2sw",
      "author": "mayormcskeeze",
      "body": "Im just gonna skip this generation in all likelihood. Trying to find one is just too much of a pain in the ass.",
      "score": 13,
      "created_utc": 1748384128.0,
      "replies": [
        {
          "id": "mupnxym",
          "author": "GammaDealer",
          "body": "I've been saying this since like 2015",
          "score": 5,
          "created_utc": 1748445192.0,
          "replies": [
            {
              "id": "mupp358",
              "author": "mayormcskeeze",
              "body": "Lol. Yeah eventually you gotta pull the trigger. \n\nI got a 4090 towards the end of its life-cycle and could just walk into the store any buy it. Became \"last generation\" pretty quick, so I guess maybe it was a dumb time to buy, but it doesn't seem like the prices on that card have dropped that much in the last year anyway. \n\nIm guessing I'll pick up a 6090 when they announce the 7000 series.",
              "score": 1,
              "created_utc": 1748445512.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mukt0ad",
      "author": "ok-painter-1646",
      "body": "I have the money but it eats too much power (will make my room uncomfortable in summer) and the cables melt.\n\nNo thank you, 6000 series please.",
      "score": 52,
      "created_utc": 1748376926.0,
      "replies": [
        {
          "id": "mulaybv",
          "author": "ThePretzul",
          "body": "You sweet summer child, thinking they’re going to fix the cable problem in the 6000 series when it was also present in the 4090.",
          "score": 51,
          "created_utc": 1748382198.0,
          "replies": [
            {
              "id": "mulrf0q",
              "author": "ok-painter-1646",
              "body": "Haha I don’t have actual hope for nvidia. More money then sense now.",
              "score": 2,
              "created_utc": 1748387534.0,
              "replies": [
                {
                  "id": "mumkbo4",
                  "author": "timmy12688",
                  "body": "I like how your typo actually makes cents. ;)",
                  "score": 1,
                  "created_utc": 1748397319.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mum98u8",
              "author": "slashrshot",
              "body": "Maybe his cousin could make something with more common sense then",
              "score": 1,
              "created_utc": 1748393527.0,
              "replies": []
            }
          ]
        },
        {
          "id": "muktigq",
          "author": "yetAnotherLaura",
          "body": "I'd love to go AMD as it would make my life in Linux easier as a side effect but... Them CUDA and VRAM for AI crap.",
          "score": 11,
          "created_utc": 1748377068.0,
          "replies": [
            {
              "id": "mukwsxb",
              "author": "ok-painter-1646",
              "body": "Two hopiums for you\n\nhttps://github.com/vosen/ZLUDA\n\nhttps://www.digitaltrends.com/computing/gpu-memory-expansion-cxl/",
              "score": 7,
              "created_utc": 1748377995.0,
              "replies": [
                {
                  "id": "mun0n64",
                  "author": "SharpyButtsalot",
                  "body": "Hey, that cxl article is an awesome read.  Is the host overhead and page faulting when working with the UVM due to the os error correcting or the gpu is the one running the overhead?  Sorry if you were just sharing and being helpful.",
                  "score": 2,
                  "created_utc": 1748403268.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mul7lc0",
          "author": "Darkfuryx222",
          "body": "I have a 5090.  Surprisingly I have not really noticed much of an increased temperature in my room.   Of course we haven’t quite reached true summer yet.  The cable melting thing is definitely an issue though.   Thoughts and prayers?",
          "score": 3,
          "created_utc": 1748381162.0,
          "replies": [
            {
              "id": "muo5q7x",
              "author": "soulsoda",
              "body": ">The cable melting thing is definitely an issue though. Thoughts and prayers?\n\nCan always setup an undervolt. It won't run as hot nor draw as much juice if you limit it. Mine won't take more than 475watts, still getting 98-100% stock performance (although this is highly dependent on your luck in the silicon lottery). Even if you don't fine tune the undervolt, you can probably get 90-95% of the performance for 80% of the power.",
              "score": 3,
              "created_utc": 1748424996.0,
              "replies": [
                {
                  "id": "muo6hc9",
                  "author": "Darkfuryx222",
                  "body": "Guess I got lucky.  I’m getting a 10 percent over clock at 470 watts.",
                  "score": 2,
                  "created_utc": 1748425423.0,
                  "replies": [
                    {
                      "id": "muo7327",
                      "author": "soulsoda",
                      "body": "And it's stable? Damn son. Mine has stability issues if I OC without giving it more juice, half my games would crash at 10% OC. Seriously doubt a properly seated cable will burn at 470 watts though.",
                      "score": 2,
                      "created_utc": 1748425757.0,
                      "replies": [
                        {
                          "id": "muo7rme",
                          "author": "Darkfuryx222",
                          "body": "Yep. Currently playing elite dangerous.  408 fps, 3030 mhz, 450 watts, 14900 mhz memory speed.",
                          "score": 3,
                          "created_utc": 1748426130.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "muljrkp",
              "author": "UF8FF",
              "body": "It raises the temp by about 2 degrees F where I’m sitting. Not bad but noticeable ¯\\\\_(ツ)_/¯.",
              "score": 2,
              "created_utc": 1748385012.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mum2uzr",
          "author": "JackfruitCalm3513",
          "body": "Until they bring back active power management like the 3000 series, Nvidia is dead to me",
          "score": 1,
          "created_utc": 1748391345.0,
          "replies": []
        },
        {
          "id": "muljdm5",
          "author": "wolfiasty",
          "body": "Reason why I went for 4060 ;) instead of something more powerful or team red. 8GB vram is indeed creating barriers (f.e. Space Marine 2 says straight up no ultra graphics because of not enough vram), but 60/1080p and very high+ (which gives barely any difference compared to ultra btw) is what I play so I'm good.",
          "score": 1,
          "created_utc": 1748384884.0,
          "replies": [
            {
              "id": "muo6fum",
              "author": "soulsoda",
              "body": "A 5090 is extreme overkill for 1440p let alone 1080p.",
              "score": 1,
              "created_utc": 1748425400.0,
              "replies": []
            }
          ]
        },
        {
          "id": "munn3by",
          "author": "Danjiks88",
          "body": "Can afford a 2000€ gpu, cant afford air conditioning?",
          "score": 0,
          "created_utc": 1748414040.0,
          "replies": [
            {
              "id": "muogcr8",
              "author": "ok-painter-1646",
              "body": "European here, if I wanted AC my one option would be a floor unit with a hose out the window. So, a loud unit, taking up floor space, and electricity prices are currently $0.15/kWh. \n\nOr I can use cloud gpus… which is what I do now… and have sweat free balls.",
              "score": 4,
              "created_utc": 1748430418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mulz2m2",
          "author": "akgis",
          "body": "the 5090 is pretty decent with power limits and/or undervolting its one of the best watt/frame undervolted.\n\nBut if you cant afford AC for your room there is other priorities than buying a 5090",
          "score": -11,
          "created_utc": 1748390059.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mumel53",
      "author": "Dub-DS",
      "body": "The piece of shit is worth 1000€ at most, so I'll pass.",
      "score": 12,
      "created_utc": 1748395358.0,
      "replies": []
    },
    {
      "id": "muln787",
      "author": "GarbageThrown",
      "body": "They’re available where I’m at now and I won’t buy one. The price is way too high, performance is underwhelming, but more importantly, I don’t want the fire hazard.",
      "score": 4,
      "created_utc": 1748386152.0,
      "replies": []
    },
    {
      "id": "munpexc",
      "author": "ITGuy7337",
      "body": "Remember when a whole ass new computer build with gpu was like $1200? That wasn't even that long ago. We didn't know how good we had it.",
      "score": 9,
      "created_utc": 1748415339.0,
      "replies": [
        {
          "id": "muo6g1v",
          "author": "Hardabent",
          "body": "It can still be way less than 1200 to build a new computer. You REALLY don't need the flagship models for entertainment purposes.",
          "score": 5,
          "created_utc": 1748425403.0,
          "replies": [
            {
              "id": "mup4be4",
              "author": "ITGuy7337",
              "body": "Can also buy a mini PC for like $170 that's actually pretty quick and can play the shit out of old games, but that's not the point\n\nAt all",
              "score": -1,
              "created_utc": 1748439387.0,
              "replies": [
                {
                  "id": "mup9ken",
                  "author": "Hardabent",
                  "body": "That's highly disingenous. You do not need an RTX 5090 to be able to play the newest games. Your 1200 (or some more) get you a great setup which allows you to run current games well, even if not every game runs at 4k resolution at ultra.\nIf you are fine with full HD gaming less than 1200€ is needed to get going.",
                  "score": 2,
                  "created_utc": 1748441032.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mukseaz",
      "author": "bamila",
      "body": "Probably because it is a fire hazard and it melts the cables",
      "score": 12,
      "created_utc": 1748376752.0,
      "replies": []
    },
    {
      "id": "mum2ngg",
      "author": "JackfruitCalm3513",
      "body": "People who buy a to 3k$ tiking time bomb of a GPU can waste their money",
      "score": 4,
      "created_utc": 1748391273.0,
      "replies": []
    },
    {
      "id": "mumgz4j",
      "author": "Prudent-Corgi3793",
      "body": "> VideoCardz reports that in Finland, where the MSRP is €2,339, the RTX 5090 has been spotted for €2,299 at a retailer that operates in several countries.\n\nProbably because the USD has dropped about 8-9% against the Euro since this was released. If this were available at under $1999 (1764 EUR), it would be snatched up within seconds. Looking for one myself to run a local LLM.",
      "score": 4,
      "created_utc": 1748396175.0,
      "replies": []
    },
    {
      "id": "muo0kms",
      "author": "Dr_Icchan",
      "body": "even the MSRP is massively overpriced tho",
      "score": 3,
      "created_utc": 1748421938.0,
      "replies": []
    },
    {
      "id": "mumazf0",
      "author": "Morvack",
      "body": "They need to lower the price because of the melting connectors.",
      "score": 3,
      "created_utc": 1748394116.0,
      "replies": []
    },
    {
      "id": "mump6fj",
      "author": "TaigaOSU",
      "body": "5090 alone in Poland cost more than 9800x3d + 5080 whole PC together. Not worth at all.",
      "score": 3,
      "created_utc": 1748398985.0,
      "replies": []
    },
    {
      "id": "munf2d4",
      "author": "Blapanda",
      "body": "More than 2.2k is not MSRP, in germany at least. And still, 2k+ for an AI overtaken GPU with less hardware for raw performance (compared to overall \"next gen\" steps) is ridiculous!",
      "score": 3,
      "created_utc": 1748409796.0,
      "replies": []
    },
    {
      "id": "munht3g",
      "author": "T-A-W_Byzantine",
      "body": "Can you find *any* GPUs for MSRP here in the States?",
      "score": 2,
      "created_utc": 1748411191.0,
      "replies": []
    },
    {
      "id": "munpyip",
      "author": "xGHOSTRAGEx",
      "body": "Eh ehm \"...as expected sales are non-existent...\" ftfy",
      "score": 2,
      "created_utc": 1748415646.0,
      "replies": []
    },
    {
      "id": "muoi80o",
      "author": "Dangeroustrain",
      "body": "Dont pay above msrp ppl let scalpers get stuck with all the extra cards eventually they would have to take a loss.",
      "score": 2,
      "created_utc": 1748431250.0,
      "replies": []
    },
    {
      "id": "mul8w2u",
      "author": "thecanadiansniper1-2",
      "body": "What does this mean for Canada? Does Canada use the US distribution network?",
      "score": 1,
      "created_utc": 1748381565.0,
      "replies": []
    },
    {
      "id": "mumltd1",
      "author": "IamChwisss",
      "body": "Play it right and it would still be cheaper to fly to Europe to snag one than buying it on eBay.",
      "score": 1,
      "created_utc": 1748397825.0,
      "replies": []
    },
    {
      "id": "mun45p6",
      "author": "grilledcheeseburger",
      "body": "$6000 USD in Taiwan currently. Just bonkers.",
      "score": 1,
      "created_utc": 1748404740.0,
      "replies": []
    },
    {
      "id": "muv30uu",
      "author": "None",
      "body": "They should drop at least another 1000 before I even consider spending that much on a graphics card.",
      "score": 1,
      "created_utc": 1748517023.0,
      "replies": []
    },
    {
      "id": "muwuwa6",
      "author": "eXodiquas",
      "body": "When did we start paying over 1k for graphics cards much less 2k? That's hard cringe",
      "score": 1,
      "created_utc": 1748537371.0,
      "replies": []
    },
    {
      "id": "mvtaz3o",
      "author": "MercenaryCow",
      "body": "Shits so expensive now. I have never had problems in the past building a new computer when it was time. But now? It is insanely expensive for one. For two you can't even find the hardware if you wanted to. And three even if you did, it's just going to melt itself or start a fire. I am used to getting the current 70 or 80 card when I do my new computer but hell. Not affordable anymore. My 1070 can't run games anymore sometimes. But I sure as hell won't be building a new computer like I've been used to doing",
      "score": 1,
      "created_utc": 1748974551.0,
      "replies": []
    }
  ]
}