{
  "post": {
    "title": "Find my… bicycle? | Knog's Scout gives bikes a motion-sensitive alarm and Bluetooth tracking.",
    "author": "chrisdh79",
    "id": "1kgca6s",
    "score": 450,
    "created_utc": 1746557101.0,
    "selftext": "",
    "num_comments": 32,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kgca6s/find_my_bicycle_knogs_scout_gives_bikes_a/"
  },
  "comments": [
    {
      "id": "mqy9jyz",
      "author": "SpinCharm",
      "body": "Not sure I see a use case for this. \n\nYou use this to identify where your stolen bike is. Do you:\n\na) call the police and tell them that it’s stolen and you know where it is, after which they tell you they can’t help /won’t help with such a minor crime, or\n\nb) take matters into your own hands and challenge thief and/or den of thieves to try to get it back?",
      "score": 66,
      "created_utc": 1746564509.0,
      "replies": [
        {
          "id": "mqybbai",
          "author": "mattyhtown",
          "body": "You can lose a bike too. But ya that’s kinda how find my iPhone works if your phone was stolen. Had a friend have a phone stolen and i had to be his “backup” at the den of thieves location. Some drunk had picked it up and thought it was his. Could happen with a bike on a college campus easily too.",
          "score": 27,
          "created_utc": 1746564997.0,
          "replies": [
            {
              "id": "mr9holp",
              "author": "GreggAlan",
              "body": "If it made the bike impossible to use and somehow prevented many of its parts from being used to repair other bikes, then it'd be like enrolling it in Apple ID and Find My Device.\n\nIf Apple was really \"green\" their stuff would have a feature like \"Power Wash\" on Chromebooks where they have a built in secure erase that allows them to be used when the login isn't known - unlike how everything Apple becomes an iBrick if you forget the password and aren't the original purchaser with proof so you can go begging at an Apple Store to get it unlocked.",
              "score": 1,
              "created_utc": 1746719381.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqzl8cw",
          "author": "winslowhomersimpson",
          "body": "It makes a loud noise and alerts your phone when your bike is moved. It’s for people who leave their bike out front of a coffee shop or something like that. \n\nThe AirTag function is an extra bonus in real world application. It’s an alarm.\n\nAlso, not waterproof. (I’ve had two)",
          "score": 20,
          "created_utc": 1746579952.0,
          "replies": [
            {
              "id": "mqzlu3s",
              "author": "SpinCharm",
              "body": "So… spectator theft for sunny days",
              "score": 2,
              "created_utc": 1746580169.0,
              "replies": [
                {
                  "id": "mqzn58p",
                  "author": "winslowhomersimpson",
                  "body": "It’s also really fun if you forget to disarm it before trying to get on your bike.",
                  "score": 7,
                  "created_utc": 1746580636.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr0psqe",
          "author": "Banannarama21",
          "body": "Sooo my bike was stolen and they were able to confirm it was my bike due to this tracker. I filed a police report and my local stolen bikes fb group spotted my bike because I was posting real time images of its location. They phoned the police, the police called me back and then they retrieved my bike and delivered it back to me.",
          "score": 11,
          "created_utc": 1746596265.0,
          "replies": [
            {
              "id": "mr1v3tv",
              "author": "Killbot_Wants_Hug",
              "body": "I mean this is 100% going to depend on the police department for your area.\n\nI had bikes stolen from my house, called the police to report it. Got a knock on my door about a month later, police arrived to take a report in person. And that's when I lived in the county with a much lower crime rate than the city.\n\nI use to ride with a OneWheel group and one of our members got robbed at gun point for his wheel. He called the police who did nothing of course. One of the group members found the police camera that was on that block, they got the cops to pull the tapes. Sure enough the robbery was on camera, including the license plate of the car. Our sluth managed to figure out who the person was for that, found his Facebook profile where he was trying to sell the stolen OneWheel.  Also pulled the background on the guy, turns out he's wanted for some gun crimes.\n\nThey took all this evidence to the police, name, address, contact info from the ad where he's trying to sell the stolen goods. Cops refused to do anything with the information.",
              "score": 5,
              "created_utc": 1746619401.0,
              "replies": [
                {
                  "id": "mr71nkd",
                  "author": "RegulatoryCapture",
                  "body": "Sounds about like my experience with the police and a stolen bike. \n\nYou can literally do the all the detective work for them and they still won’t do their jobs in many departments. \n\nI live in a small town now and I think they would help, but I wouldn’t be terribly surprised if they don’t. ",
                  "score": 2,
                  "created_utc": 1746680175.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr0nuy3",
          "author": "None",
          "body": "There are about 20000 bicycles at my local train station. I can tell you there are other use cases.",
          "score": 7,
          "created_utc": 1746595236.0,
          "replies": []
        },
        {
          "id": "mqzq7tq",
          "author": "Dazzling-Crab-75",
          "body": "A: Where I live police keep a database of stolen bicycles, encourage people to report them stolen, and say that approximately half are recovered.",
          "score": 3,
          "created_utc": 1746581719.0,
          "replies": [
            {
              "id": "mr04b28",
              "author": "SpinCharm",
              "body": "Nice!",
              "score": 3,
              "created_utc": 1746586649.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqyug44",
          "author": "azn4lifee",
          "body": "c) you steal the item back with your second amendment.\n\nI kid, there's no second amendment where I am. You'd get arrested if you dare to confront the thief.",
          "score": 5,
          "created_utc": 1746570808.0,
          "replies": [
            {
              "id": "mqzy89e",
              "author": "ariolander",
              "body": "Until your state [makes it illegal to confront thiefs](https://www.newsweek.com/store-retail-violence-robbery-theft-stealing-california-1804565).",
              "score": -4,
              "created_utc": 1746584427.0,
              "replies": [
                {
                  "id": "mr03kov",
                  "author": "azn4lifee",
                  "body": "Employees I agree. What are you risking your life for your corporate overlords for? Get the bag and go home lol.",
                  "score": 8,
                  "created_utc": 1746586368.0,
                  "replies": []
                },
                {
                  "id": "mr299bl",
                  "author": "hertzsae",
                  "body": "\"SB 553 is focused on protecting employees. The bill does not prohibit employees from stopping theft. It does prevent employers from asking non-security personnel to confront a person involved in criminal activity. We don't want rank and file employees to be forced to place themselves in harm's way.\"\n\nDid you read the article you posted? It doesn't seem to do what you say it does.\n\nI'm sure the news source you first heard about it from greatly distorted its presentation to fuel maximum outage though.\n\nThat seems like a pretty good law to me.",
                  "score": 4,
                  "created_utc": 1746624548.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqzepfl",
          "author": "OneofLittleHarmony",
          "body": "Ideally a first.",
          "score": 2,
          "created_utc": 1746577637.0,
          "replies": []
        },
        {
          "id": "mqzhidh",
          "author": "Cleanbriefs",
          "body": "The case is to collect data from a certain class of shoppers with a decent net worth and value the company in the billions to investors to get funded until there is no more money to be given.\n\nThat’s the point all the gimmicky IoT companies.",
          "score": 2,
          "created_utc": 1746578635.0,
          "replies": []
        },
        {
          "id": "mr1jvfu",
          "author": "sorrylilsis",
          "body": "I live in a city with a huge biking population and a huge bike thief problem. \nMe and most of my friends have airtags on our bikes. \nWe got back a stolen bike twice using it, both time cutting a lock that the thief had used to park the bike a couple km away. Mind you in both cases we found out that the bike was stolen very shortly after it happened.",
          "score": 2,
          "created_utc": 1746614348.0,
          "replies": []
        },
        {
          "id": "mr26hf2",
          "author": "Electrical_Style8094",
          "body": " I have one , can be placed discreetly and you can track location via the app and apple find my, if somebody touches and moves your bike you can set it so a very loud alarm sounds ,if the tracker moves from the location from where you armed it you will get a notification so you know in real time when somebody is fucking with your shit",
          "score": 2,
          "created_utc": 1746623612.0,
          "replies": []
        },
        {
          "id": "mr3tt81",
          "author": "PocketNicks",
          "body": "B.",
          "score": 1,
          "created_utc": 1746641146.0,
          "replies": []
        },
        {
          "id": "mra5axj",
          "author": "parisidiot",
          "body": "i stole my bike back twice, actually. NYC and the bike (a vanmoof) had built-in findmy.\n\nthough this thing has been out for a couple years? i'm not sure why it's \"news\" now.",
          "score": 1,
          "created_utc": 1746726247.0,
          "replies": []
        },
        {
          "id": "mqzgvjm",
          "author": "thirdtryacharm",
          "body": "I went to an Etta James concert one time and locked my bike up. It was a road bike that had a kangaroo on it.\nI left the concert and saw that my bike was gone. \nA few weeks later, I saw my bike and some dude on it and tried to take it back and all of a sudden he had three other degenerates behind him and I didn’t like those odds. A few weeks after that, I saw my bike again and the same guy riding it and he was carrying a bag of plastic bottles and I guess wherever he is on my stolen bike 20 years later, I wish him the best. Bike theft is a part of ownership.",
          "score": 0,
          "created_utc": 1746578410.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqyv5es",
      "author": "Upbeat-Spring-5185",
      "body": "I had a bike alarm on my traditional 21 speed.  Very sensitive to movement, very loud piercing alarm.",
      "score": 14,
      "created_utc": 1746571044.0,
      "replies": [
        {
          "id": "mr0jo1i",
          "author": "urMomZScoredLastNite",
          "body": "Ugh, I get it, but those are SO ANNOYING to lock up next to. Especially if the person with the alarm locked their bike to the derailleur side.",
          "score": 10,
          "created_utc": 1746593135.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr0dlkg",
      "author": "kitkatfitfat",
      "body": "I will say that I had this installed on my bike (mounted under a bottle cage, so kind of hidden) \n\nThe alarm could be louder, and it only alarms on your phone if you’re within Bluetooth range which is comically short.\n\nMy bike was stolen, I used it to locate the rough area it was in, the police actually came to help right away when I called the non emergency line and they were like “yeah we’re pretty sure which house it is” and recovered it for me. So I gotta give it props for that. \n\nThieves know about AirTags and they’re easy to find and toss. But with this thing the crackhead took extra long to get the alarm off the bike due to the non standard pattern the bolts use and also the fact it was hidden. The alarm was not activated at the time he stole it, and probably for the best because he would have known to take it off before he got to home base and I wouldn’t have known where to go looking for my bike",
      "score": 8,
      "created_utc": 1746590402.0,
      "replies": []
    },
    {
      "id": "mqzh30o",
      "author": "Cleanbriefs",
      "body": "How hammer resistant is this? Because someone will silence everything with a proper use of momentum ",
      "score": 6,
      "created_utc": 1746578484.0,
      "replies": []
    },
    {
      "id": "mr28hmw",
      "author": "Samwellikki",
      "body": "It looks like the bolt cutters or power saw they brought could just tap this off quick before riding away",
      "score": 2,
      "created_utc": 1746624290.0,
      "replies": []
    },
    {
      "id": "mr3bmhe",
      "author": "1billsfan716",
      "body": "Hopefully it doesn't end up in the basement of the Alamo!",
      "score": 1,
      "created_utc": 1746636007.0,
      "replies": []
    },
    {
      "id": "mr5mmdi",
      "author": "Ironlion45",
      "body": "So it's a really loud air tag?  Just get yourself an air tag.",
      "score": 1,
      "created_utc": 1746660769.0,
      "replies": []
    }
  ]
}