{
  "post": {
    "title": "Braille for sports: Haptic handheld broadcasts games to your fingertips | Catches, kicks, throws, passes, goals, touchdowns and home runs will all be buzzed to the user through different vibration patterns.",
    "author": "chrisdh79",
    "id": "1ilcsvr",
    "score": 933,
    "created_utc": 1739100672.0,
    "selftext": "",
    "num_comments": 43,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ilcsvr/braille_for_sports_haptic_handheld_broadcasts/"
  },
  "comments": [
    {
      "id": "mbuhbzj",
      "author": "CoasterThot",
      "body": "I’m blind, and this is great. People keep saying “why not stay home and listen to the radio?” Would you want to be stuck in your house, all the time?",
      "score": 69,
      "created_utc": 1739113931.0,
      "replies": [
        {
          "id": "mbunign",
          "author": "None",
          "body": "Exactly. People seem to have this strange notion that disabled people seek convenience over an experience",
          "score": 39,
          "created_utc": 1739115833.0,
          "replies": [
            {
              "id": "mbuwwow",
              "author": "shadowscar00",
              "body": "I’ve got a mobility disability, not a visual one, but people say this same fuckin shit. “Why don’t you just instacart your groceries instead of taking up space in the line?” Idk Deborah maybe I like saying hello to my favorite cashiers and checking out the meat and bakery sales. Disabled people aren’t half-people. We deserve the “luxury” of being in public and taking up our own space.",
              "score": 32,
              "created_utc": 1739118582.0,
              "replies": [
                {
                  "id": "mbv8d8a",
                  "author": "Punman_5",
                  "body": "Also online shopping for groceries is always a bit of a crap shoot. You basically can’t trust them for produce and meats because they’ll never be as fickle as you would be when it comes to quality. We just ordered some groceries yesterday and when we picked them up the lettuce was all bad. They just pick the first one without really checking.",
                  "score": 6,
                  "created_utc": 1739121805.0,
                  "replies": [
                    {
                      "id": "mc2dmbr",
                      "author": "shadowscar00",
                      "body": "Don’t forget the classic “they’re out of stock” in produce. I asked for two bulbs of garlic, it was immediately refunded as out of stock as soon as the instacart person got the order, along with a few others. I sent my partner to the store, the garlic bin was FULL. Or substitutions. Asked for a gallon of whole milk, had my substitutions as other whole milks (there was no way the store had 0 gallons of any of the 7 brands of whole milk they carry). This guy brought me almond milk.\n\nI have a fucking nut allergy.",
                      "score": 2,
                      "created_utc": 1739215638.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbvwp7o",
                  "author": "None",
                  "body": "Yeah I've got a handful of mental disabilities that make being in public a workout, and people say \"why don't you just do (insert anything that would isolate me)?\" Because I want to be around people, even if it's hard. Even if I'm hallucinating and extremely paranoid, I still want to be around others",
                  "score": 3,
                  "created_utc": 1739128571.0,
                  "replies": []
                },
                {
                  "id": "mbyinuz",
                  "author": "youzongliu",
                  "body": "Honestly that sounds pretty nice. I don't have any impairments but I would much rather stay at home and play video games all day and have my groceries delivered to me rather than going outside if I can afford it lol.",
                  "score": 2,
                  "created_utc": 1739158338.0,
                  "replies": [
                    {
                      "id": "mbyofnr",
                      "author": "RednRoses",
                      "body": "That's a wildly tone deaf take.",
                      "score": 3,
                      "created_utc": 1739160507.0,
                      "replies": [
                        {
                          "id": "mbyorcw",
                          "author": "youzongliu",
                          "body": "What do you mean?",
                          "score": -1,
                          "created_utc": 1739160632.0,
                          "replies": [
                            {
                              "id": "mbypci6",
                              "author": "RednRoses",
                              "body": "When a person struggling to be treated like a full person who should be included in every day life that the rest of the world gets to take for granted, the correct response isn't to say that the issue they're facing sounds good to you, especially since it isn't a choice they're making but a legitimate and incredibly isolating experience.",
                              "score": 1,
                              "created_utc": 1739160865.0,
                              "replies": [
                                {
                                  "id": "mbyq0r8",
                                  "author": "youzongliu",
                                  "body": "I don't take it for granted, I enjoy being isolated and that's the opinion I voiced. I'm sure their situation is tough, but why does that prevent me from sharing my perspective. Maybe they feel more relatable knowing that I choose to be isolated.",
                                  "score": 1,
                                  "created_utc": 1739161132.0,
                                  "replies": [
                                    {
                                      "id": "mc39c3o",
                                      "author": "CoasterThot",
                                      "body": "No, I don’t relate to you, at all, because I constantly cry that I’m not allowed to do the things sighted people can do. I would love to grocery shop without help, or be allowed to drive a car, or to be able to pick out my own clothes at the store. Instead, I’m housebound, not out of laziness or fault, but because I am blind and I can’t drive a car in a car-centric country that doesn’t give one single fuck about blind people.",
                                      "score": 2,
                                      "created_utc": 1739229387.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mc2cyrt",
                                      "author": "shadowscar00",
                                      "body": "Nah, I feel like that was pretty tone deaf. “People treat me like I’m a waste of space, less than human, and like I don’t deserve to be in public” “man that sounds great!”\n\nI’m complaining about something that seriously negatively impacts my life, and how others mistreat me. All you could read was “instacart”. I don’t want to use instacart. I can, but there is an independence that I deserve to feel when I can go pick out my own oranges, or speak to the butcher, or check out sales. \n\n\nI will gladly trade you my constant pain, gastrointestinal issues, mobility issues, mental health issues, and everything fucking else, and you can have instacart so that you can stay home and play video games. I’ll take your able body so I can reach shelves without help, do more than one chore a day, walk outside without worrying about accessibility, and exist in public spaces without being deemed an immediate nuisance.",
                                      "score": 1,
                                      "created_utc": 1739215451.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbx4fd4",
          "author": "harmless_platypus",
          "body": "Anthony S. Ferraro recently posted his experience with a similar aid at a Portland game\n[Basketball visual aid](https://youtube.com/shorts/UJNcSsDUZrk?si=VzcmOr0GV0ubu5mV)",
          "score": 2,
          "created_utc": 1739141361.0,
          "replies": [
            {
              "id": "mbx4rlj",
              "author": "CoasterThot",
              "body": "I saw his video, I follow him! He’s awesome!\n\nI’m newly blind, I wasn’t born blind. When I start to have a hard time, mentally (I’ve never met another blind person, or been able to talk to a blind person and ask questions), I watch Anthony’s videos to remind myself of all the things I *can* still do.",
              "score": 1,
              "created_utc": 1739141470.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbv3cdt",
          "author": "None",
          "body": "But couldn’t you just hook up to the radio at the stadium? Unless you are blind and deaf I don’t see how this will be better.",
          "score": -6,
          "created_utc": 1739120395.0,
          "replies": [
            {
              "id": "mbv3pkl",
              "author": "CoasterThot",
              "body": "Again, being around others is the entire point. Also, listening to something be described to you is much different than having the autonomy to check the score yourself, when you want, and keeping up with tactile feedback, in real time. They’re completely different experiences. Listening to the radio is like having someone read to you, boring.",
              "score": 10,
              "created_utc": 1739120495.0,
              "replies": []
            },
            {
              "id": "mbvbkjb",
              "author": "reddit455",
              "body": ">I don’t see how this will be better.\n\nare you blind?",
              "score": 2,
              "created_utc": 1739122706.0,
              "replies": [
                {
                  "id": "mbvc0hv",
                  "author": "None",
                  "body": "I am. That’s why I can speak on this. Is that a joke?",
                  "score": 0,
                  "created_utc": 1739122830.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbu3p5z",
      "author": "VIPTicketToHell",
      "body": "I wonder what the lag is between what’s happening live and the board update",
      "score": 11,
      "created_utc": 1739109179.0,
      "replies": [
        {
          "id": "mbutjam",
          "author": "ScribebyTrade",
          "body": "What if it’s faster than what’s happening on the court 🧠",
          "score": 10,
          "created_utc": 1739117605.0,
          "replies": []
        },
        {
          "id": "mbvbwx9",
          "author": "lshifto",
          "body": "It’s pretty fast!\n\n[video of its use](https://www.reddit.com/r/TikTokCringe/s/J6ih4C0qzV)",
          "score": 2,
          "created_utc": 1739122802.0,
          "replies": [
            {
              "id": "mbvyh81",
              "author": "Maelstrom_Witch",
              "body": "“So easy, a blind man could do it!”",
              "score": 3,
              "created_utc": 1739129064.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbu87v7",
          "author": "NicholasAakre",
          "body": "Hopefully faster than the radio broadcast.",
          "score": 2,
          "created_utc": 1739110836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mburjh9",
      "author": "ChefGottaBag",
      "body": "These are the advances in assistive technology we love to see!",
      "score": 8,
      "created_utc": 1739117019.0,
      "replies": []
    },
    {
      "id": "mbwp8gu",
      "author": "Dzmagoon",
      "body": "**Partly funded by a National Science Foundation accessibility grant.**",
      "score": 5,
      "created_utc": 1739136757.0,
      "replies": []
    },
    {
      "id": "mbvk6bh",
      "author": "HapticSloughton",
      "body": "Anyone else reminded of the scene in the old \"Lone Gunmen\" X-files spinoff where the protagonists encountered [a football practice taking place with blind players and a beeping football](https://www.youtube.com/watch?v=4T-Z44BotfQ)?",
      "score": 1,
      "created_utc": 1739125089.0,
      "replies": []
    },
    {
      "id": "mbvuqx4",
      "author": "StarWarsPlusDrWho",
      "body": "I don’t know if it was this exact device but they were piloting something like this last summer at the Paris Paralympics during the Blind Soccer matches",
      "score": 1,
      "created_utc": 1739128028.0,
      "replies": []
    },
    {
      "id": "mbyodzg",
      "author": "youzongliu",
      "body": "How do you know which players are on which team? And with a game like soccer with so many players does it get confusing?",
      "score": 1,
      "created_utc": 1739160489.0,
      "replies": []
    },
    {
      "id": "mbuad3x",
      "author": "ThePhantomShart",
      "body": "What if there’s a streaker ?",
      "score": 1,
      "created_utc": 1739111591.0,
      "replies": [
        {
          "id": "mbvc3te",
          "author": "lshifto",
          "body": "His bump is a little smaller than the others. It was in a pool.",
          "score": 1,
          "created_utc": 1739122856.0,
          "replies": []
        },
        {
          "id": "mbw855k",
          "author": "transgendermenace99",
          "body": "u have to put the device in ur ass for that one",
          "score": 1,
          "created_utc": 1739131788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbvjowt",
      "author": "gnarchar101",
      "body": "What a great DEIA initiative",
      "score": 1,
      "created_utc": 1739124956.0,
      "replies": []
    },
    {
      "id": "mbvpzbj",
      "author": "Xendrus",
      "body": "So.. is this for people who are both blind and deaf? Why couldn't they just have on a pair of bone conducting headphones and just have an AI voice read out what happened?",
      "score": -2,
      "created_utc": 1739126704.0,
      "replies": []
    },
    {
      "id": "mbtytf9",
      "author": "chairitable",
      "body": "It's cool but do vision-impaired folks actually want a device like this?",
      "score": -12,
      "created_utc": 1739107262.0,
      "replies": [
        {
          "id": "mbu20wh",
          "author": "critsonyou",
          "body": "I see no reason why they wouldn't. Especially if the device is bought by the company that hosts the sport and is given out for the visually impaired while the game is active.",
          "score": 13,
          "created_utc": 1739108541.0,
          "replies": [
            {
              "id": "mbuvukb",
              "author": "jbrunsonfan",
              "body": "One time I was watching a stream with a delay, while my friend was looking at the official live play by play. He was able to tell me when a bucket would go in before it actually went in, and that was really annoying. Just being like “oh cool my favorite player has the ball- now why does everybody sound sad?” And then he dribbles into a turnover.",
              "score": 2,
              "created_utc": 1739118279.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbv66ns",
          "author": "Sorcatarius",
          "body": "Well in the video in the article the dude seems pretty fucking excited to use one.",
          "score": 6,
          "created_utc": 1739121191.0,
          "replies": [
            {
              "id": "mbvd661",
              "author": "chairitable",
              "body": "Yes, I expect people in videos trying to sell a product to be excited about the product.",
              "score": -1,
              "created_utc": 1739123150.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbwkocw",
          "author": "King_Dead",
          "body": "Yes. My bar buddy is blind and he tells me about all the cool things that allow him to interact in public spaces like this",
          "score": 3,
          "created_utc": 1739135435.0,
          "replies": []
        }
      ]
    }
  ]
}