{
  "post": {
    "title": "Apple Wants to Turn its Watches Into Wearable AI | Company contemplates packing device that tells time with cameras and 'visual intelligence.'",
    "author": "chrisdh79",
    "id": "1jimzi5",
    "score": 721,
    "created_utc": 1742809954.0,
    "selftext": "",
    "num_comments": 265,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jimzi5/apple_wants_to_turn_its_watches_into_wearable_ai/"
  },
  "comments": [
    {
      "id": "mjgcgdp",
      "author": "Pundamonium97",
      "body": "But apple’s AI has sucked so far, shouldnt they actually make it work well before embarking on this goal of putting it in everything",
      "score": 481,
      "created_utc": 1742810265.0,
      "replies": [
        {
          "id": "mjgd9zr",
          "author": "smile_politely",
          "body": "not to mention you'll then have to charge your watch every other hour...\n\nor maybe they'll sell you battery extender pack for your watch? who knows.",
          "score": 134,
          "created_utc": 1742810765.0,
          "replies": [
            {
              "id": "mjgnlxi",
              "author": "GnomeNot",
              "body": "It will literally be a pip boy.",
              "score": 42,
              "created_utc": 1742816397.0,
              "replies": [
                {
                  "id": "mjgyc8c",
                  "author": "Lexinoz",
                  "body": "Even a pip boy is run on nuclear fusion so never needs charging.",
                  "score": 31,
                  "created_utc": 1742820999.0,
                  "replies": [
                    {
                      "id": "mjhy9rc",
                      "author": "pnwinec",
                      "body": "Thanks for this. I watched the show only and they never explained how that damn thing just always works. Makes sense given the theme of the show.",
                      "score": 7,
                      "created_utc": 1742832538.0,
                      "replies": [
                        {
                          "id": "mjjg7w8",
                          "author": "notjordansime",
                          "body": "I always forget they made a show out of it. I played all the games (up to 4) as a kid. How is the show?",
                          "score": 6,
                          "created_utc": 1742848041.0,
                          "replies": [
                            {
                              "id": "mjjjlhm",
                              "author": "Buscemi_D_Sanji",
                              "body": "I've never played any of the games, but thought the show was pretty good and very video game-y if that makes sense, like it felt like unlocking new stuff and leveling up weapons and health and fighting ability. Walton goggins was great too.",
                              "score": 4,
                              "created_utc": 1742848989.0,
                              "replies": []
                            },
                            {
                              "id": "mjjn2ov",
                              "author": "pnwinec",
                              "body": "The show is great. I’ve been told it’s got a really good feel of the game by people who have played it. \n\nI really enjoy the show.",
                              "score": 6,
                              "created_utc": 1742849965.0,
                              "replies": [
                                {
                                  "id": "mjjrkt0",
                                  "author": "notjordansime",
                                  "body": "It sounds like you’ve never played the games. To me, this means the show is a success. You shouldn’t have to be a fan of the games to enjoy the show. If that’s the case, I think they knocked it outta the park!",
                                  "score": 1,
                                  "created_utc": 1742851344.0,
                                  "replies": [
                                    {
                                      "id": "mjp9n6g",
                                      "author": "ronnie1014",
                                      "body": "It was very good coming from someone who played the games. \n\nNailed the cartoonish feel they have at times with such sinister and depressing undertones. I need to rewatch it because they were laying some serious groundwork right out the gate that I completely missed. \n\nHighly recommend it!",
                                      "score": 2,
                                      "created_utc": 1742928294.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mjr0gi6",
                              "author": "armorhide406",
                              "body": "Show was pretty fun. More enjoyable than the Halo one, without question",
                              "score": 2,
                              "created_utc": 1742947294.0,
                              "replies": []
                            },
                            {
                              "id": "mjl93t7",
                              "author": "Lexinoz",
                              "body": "Played all the games myself, did very much enjoy the show. Walton Goggins and Ella Purnell are excellent in it. And it's a pretty decently written show. Definitely worth the watch just for the setpieces and nostalgia.",
                              "score": 1,
                              "created_utc": 1742868942.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjgn7oj",
              "author": "Kachda",
              "body": "Apple clock",
              "score": 3,
              "created_utc": 1742816205.0,
              "replies": [
                {
                  "id": "mjgqyiz",
                  "author": "yellowstickypad",
                  "body": "Then it’ll just be one of those Alexa boxes at home",
                  "score": 2,
                  "created_utc": 1742817930.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjhfc8i",
              "author": "SmokeSmokeCough",
              "body": "Man that pfp scared me",
              "score": 1,
              "created_utc": 1742826801.0,
              "replies": []
            },
            {
              "id": "mjtkjgl",
              "author": "spdorsey",
              "body": "I really don’t think Apple would allow any tech on their watch that would degrade the battery life to the point where it would not go an entire day without a charge.\n\nI have been unimpressed with Apple‘s AI, but that doesn’t mean it can’t be used in some sort of productive way That I may not have thought of. As long as I can deactivate it, I really don’t care.",
              "score": 1,
              "created_utc": 1742991508.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjgi2qp",
          "author": "None",
          "body": "[deleted]",
          "score": 38,
          "created_utc": 1742813548.0,
          "replies": [
            {
              "id": "mjh4br1",
              "author": "Sylvurphlame",
              "body": "There are about 20 different steps between Smartwatch and Wearable AI. Not the least of which is actual *reliable* AI being a thing. And no, ChatGPT doesn’t tick that box.",
              "score": 6,
              "created_utc": 1742823206.0,
              "replies": []
            },
            {
              "id": "mjihg5m",
              "author": "sargrvb",
              "body": "Remember the 'Apple car'. Yeah. That lasted like... 15 seconds.",
              "score": 4,
              "created_utc": 1742838067.0,
              "replies": [
                {
                  "id": "mjijzlk",
                  "author": "VitaminPb",
                  "body": "What do you mean? That project was milked by the press for literally years.",
                  "score": 5,
                  "created_utc": 1742838781.0,
                  "replies": [
                    {
                      "id": "mjilvwk",
                      "author": "sargrvb",
                      "body": "That's my point. The actual 'progess' was a blurb capitalizing on the fall of Tesla by the press and lasted until the paint dried. Maybe three months... Which in the R and D world is nothing. All because they bought a bunch of land from one of the testing tracks and needed an excuse to start their land bank. Apple does this shit all the time.",
                      "score": 2,
                      "created_utc": 1742839318.0,
                      "replies": [
                        {
                          "id": "mjiqkvx",
                          "author": "VitaminPb",
                          "body": "The actual project lasted many years but failed. It switched goals away from an actual vehicle part way through before eventual cancellation. It wasn’t only a few months.\n\nIt was also never an announced project. It was all developed and any news articles were from leaks, which is why they had wild claims.",
                          "score": 2,
                          "created_utc": 1742840672.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjgvw6d",
          "author": "leavezukoalone",
          "body": "Of all the awesome things Apple has created, Apple Intelligence and Siri are at the absolute lowest tier of quality.",
          "score": 13,
          "created_utc": 1742820035.0,
          "replies": [
            {
              "id": "mjhgxu9",
              "author": "kris206",
              "body": "Siri is a bit dated these days, but definitely not the worst thing Apple created. I get you’re speaking hyperbole, but Siri was probably the first wide scale voice assistant, and other than sci-fi inspiration, Siri pretty much set the standard for the world. Siri allowed people with impaired hand motor skills to functionally use an iPhone, Siri was a friend for people with social skill deficits, and Siri helped the blind navigate their phones.",
              "score": 2,
              "created_utc": 1742827310.0,
              "replies": [
                {
                  "id": "mjhjai9",
                  "author": "leavezukoalone",
                  "body": "Those are all great things, but don’t change the fact that Siri is a hot pile of garbage. Being first to market with Siri, Apple had a head start. Instead of maximizing that, they got lazy, and now we are stuck with an insanely underwhelming feature.",
                  "score": 6,
                  "created_utc": 1742828048.0,
                  "replies": [
                    {
                      "id": "mjhk0pg",
                      "author": "kris206",
                      "body": "After I posted my reply, I thought I misunderstood your comment, and that you meant the combination of Apple Intelligence AND Siri was trash. Siri definitely doesn’t live up to the hype they were selling us, but realistically there isn’t any voice assistant that is “great”, even in the Google subs, everyone complains about it. Bixby? Cortana?",
                      "score": 3,
                      "created_utc": 1742828273.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mjghoql",
          "author": "hhs2112",
          "body": "Marketing depts don't care whether shit actually works... ",
          "score": 12,
          "created_utc": 1742813338.0,
          "replies": []
        },
        {
          "id": "mjh0xem",
          "author": "thisischemistry",
          "body": "> According to Bloomberg, Apple is working on a version of its smartwatch that will be equipped with cameras that will facilitate the expansion of the company’s “visual intelligence” features that are currently only available on the latest model of iPhone.\n\nAll just speculation.",
          "score": 5,
          "created_utc": 1742821974.0,
          "replies": []
        },
        {
          "id": "mjgxj2f",
          "author": "rustyrazorblade",
          "body": "Not really, no.  These things would be built by different teams, with completely different goals.  The folks building gear with sensors don't really need to know how AI will process the data, they just need to provide it.\n\nIf you do it sequentially, then you have to wait for the AI to be good, then you develop the gear, and depending on the lead time, they would have lost years to competitors.",
          "score": 2,
          "created_utc": 1742820687.0,
          "replies": [
            {
              "id": "mjhxz1o",
              "author": "madmofo145",
              "body": "Yeah, while the whole thing seems silly, if that's the goal you'd start prepping the hardware years in advance. It could take many prototype iterations to get the product correct, and you certainly don't want that to be the bottle neck if you've finally got you're working AI waiting in the wings.",
              "score": 2,
              "created_utc": 1742832448.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjh0j1z",
          "author": "Dolatron",
          "body": "“But Marketing wants it by next month!”",
          "score": 1,
          "created_utc": 1742821826.0,
          "replies": []
        },
        {
          "id": "mjh8evm",
          "author": "americansherlock201",
          "body": "That’s not how stock prices work. It’s all about how rapidly you get a new product into users hands. Doesn’t matter if the product sucks",
          "score": 1,
          "created_utc": 1742824607.0,
          "replies": []
        },
        {
          "id": "mjid3bf",
          "author": "1980-whore",
          "body": "Im not sure at all why you are suprised. I'm not even trying to be a dick, but im not sure apple has ever put out a fully functioning product at launch. Ffs steve jobs had to juggle iphones at its debut because they froze as soon as you tried to use them.",
          "score": 1,
          "created_utc": 1742836867.0,
          "replies": []
        },
        {
          "id": "mjifpze",
          "author": "mayorsenpai",
          "body": "No, you can enjoy having shitty ai that sucks all the battery life up at no additional cost, they're very generous.",
          "score": 1,
          "created_utc": 1742837568.0,
          "replies": []
        },
        {
          "id": "mjk8lkp",
          "author": "TheOtherBelushi",
          "body": "Why make thing work well when marketing buzz work better?",
          "score": 1,
          "created_utc": 1742856724.0,
          "replies": []
        },
        {
          "id": "mjlf8qw",
          "author": "vibrance9460",
          "body": "Excluding ChatGPT.-which is the iPhone supports, who is actually doing AI correctly in your opinion?\n\nI for one I’m glad Apple is moving slow. Yes they overhyped it. Most definitely! \n\nBut they are not adding tools to make Internet slop to my phone and I’m pleased about that",
          "score": 1,
          "created_utc": 1742871253.0,
          "replies": [
            {
              "id": "mjlldi6",
              "author": "Pundamonium97",
              "body": "Github copilot and cursor are the applications of AI that i think are the most impressive right now, like coding assistance is an absolutely masterful use of the product\n\nThere are a few image generators that are quite good, esp for like anime fanart or getting restyled selfies of yourself\n\nApples image generator sucks so much its not funny, locked to the most awful style\n\nI do think if apple is using ai for picture editing and touching up etc and like extracting text from or pieces from an image thats brilliant. Tho i dont think thats part of the apple intelligence package per se and idk if thats ai or just a good set algorithm\n\nWhen it comes to notification summaries, i turned apple intelligence off bc it was the most garbage tool. If i got a message saying “theres a fire sale at home depot, lamps are half off” it would probably summarize it as “home on fire, caused by lamp” \n\nI would have preferred apple move slow and not release this, than release it and have it be so bad",
              "score": 1,
              "created_utc": 1742873765.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjm1dgz",
          "author": "SafeModeOff",
          "body": "\"shouldnt they actually make it work well before embarking on this goal of putting it in everything\"\n\nI have asked myself this about every single \"AI-ified\" product and have yet to find a company that's behaving rationally",
          "score": 1,
          "created_utc": 1742881879.0,
          "replies": []
        },
        {
          "id": "mjx6exs",
          "author": "alidan",
          "body": "you need to have a live test audience, look at how many features programs add on that no one knows about, you have to tell them up front so some people at least try them.",
          "score": 1,
          "created_utc": 1743030791.0,
          "replies": [
            {
              "id": "mjx6o3s",
              "author": "Pundamonium97",
              "body": "That hasn’t really been apple’s approach typically, they often prefer to wait for a technology to mature a bit before they implement it\n\nIt seems like they got caught up in the hype of AI and rushed ahead\n\nThey literally launched it without it having all of its features lol",
              "score": 1,
              "created_utc": 1743030872.0,
              "replies": [
                {
                  "id": "mjx7jlv",
                  "author": "alidan",
                  "body": "no, apple does this with damn never every product line, they put the first one out, get enough of an understanding about what's bad, and put the second version out as fast as possible and never acknowledge the first one again.",
                  "score": 1,
                  "created_utc": 1743031150.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mk1lxxs",
          "author": "Leftieswillrule",
          "body": "The only thing Apple’s AI is good for is the kind of stuff a watch does. Telling it to set a timer or tell you the weather is the extent of what it can do",
          "score": 1,
          "created_utc": 1743096069.0,
          "replies": []
        },
        {
          "id": "mjgvrnz",
          "author": "Jamie00003",
          "body": "But the shareholders tho\n\nApple screwed up royally on this, I would’ve happily waited 3-4 years for them to get it right",
          "score": 1,
          "created_utc": 1742819983.0,
          "replies": []
        },
        {
          "id": "mjgw432",
          "author": "Southern_Bicycle8111",
          "body": "Ya, I’m always yelling at Siri",
          "score": 1,
          "created_utc": 1742820124.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgg11i",
      "author": "DildoOfConsequence18",
      "body": "AI is a solution in search of a problem, and it’s only being forced on consumers with such desperate enthusiasm because these companies know it’s a source of previously unimaginable amounts of personal data, offered up for free, by an ignorant populace.",
      "score": 304,
      "created_utc": 1742812405.0,
      "replies": [
        {
          "id": "mjgkmq5",
          "author": "None",
          "body": "[removed]",
          "score": 58,
          "created_utc": 1742814912.0,
          "replies": [
            {
              "id": "mjh0pdd",
              "author": "synthdrunk",
              "body": "People don’t know and don’t understand how or why they should. Ship has sailed.",
              "score": 10,
              "created_utc": 1742821891.0,
              "replies": [
                {
                  "id": "mjhtm1i",
                  "author": "Vabla",
                  "body": "It's worse. They insist you should not care either.",
                  "score": 6,
                  "created_utc": 1742831155.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mjhz9sv",
              "author": "paaaaatrick",
              "body": "This sounds like the experience of someone who used Amazon Alexa one time in 2016",
              "score": -5,
              "created_utc": 1742832837.0,
              "replies": []
            },
            {
              "id": "mjhjfmr",
              "author": "Runfasterbitch",
              "body": "Idk if you haven’t used AI lately but voice-to-text is basically perfected these days. Check out sesame’s latest chat model—it’s nearly impossible to tell you’re not speaking with another person",
              "score": -7,
              "created_utc": 1742828091.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjh8u9s",
          "author": "IIlIIlIIlIlIIlIIlIIl",
          "body": "The weirdest thing is that the problem I actually have, which is keeping good meeting notes, track of the things I'd say I'd do, track of things I said/wrote to keep in mind when I'm working on X isn't something that AI is being pivoted towards.\n\nNo, I don't want AI to generate my proposal, that requires actual thought and understanding of our system and policies and whatnot to actually make sense and be successful. AI can generate something that appears plausible and will get approval from managers skimming it sure, but that's not the goal.\n\nI just need it to keep track of all my little notes and shit that are in different places in 7 different platforms.",
          "score": 13,
          "created_utc": 1742824749.0,
          "replies": [
            {
              "id": "mjiair4",
              "author": "lifeishardthenyoudie",
              "body": "There are a whole bunch of services that use AI to take notes during meetings.",
              "score": 5,
              "created_utc": 1742836131.0,
              "replies": [
                {
                  "id": "mjiq5gj",
                  "author": "PublicWest",
                  "body": "Be very careful about using them at work though. They’re obviously a privacy nightmare and your company would rightly be pissed if they found out you were sending all the meeting minutes to a 3rd party",
                  "score": 7,
                  "created_utc": 1742840548.0,
                  "replies": [
                    {
                      "id": "mjixpcn",
                      "author": "lifeishardthenyoudie",
                      "body": "Yeah, that goes without saying. You either need to make sure that nothing confidential is being discussed and that everyone is okay with being recorded or your company needs to pay for the service and have an agreement in place with them just like they do for any other service that handles your data.",
                      "score": 2,
                      "created_utc": 1742842732.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjiqu3c",
              "author": "LookOverThere305",
              "body": "There is literally a Gemini integration with google meets that does exactly this. It’s one of the first things ai was pitched as. Check out read.ai",
              "score": 1,
              "created_utc": 1742840748.0,
              "replies": [
                {
                  "id": "mjjgtnd",
                  "author": "IIlIIlIIlIlIIlIIlIIl",
                  "body": "That's still a pipe dream. Most workplaces, even those that already use the underlying services (Google Workspace, MS Office, etc.) don't have the AI features enabled, let alone third party AI that integrates data other services such as Slack, Jira, etc.\n\nSo if you're lucky you get meeting notes, but that's about it. We're still a long way away from everyone essentially having an omnipresent AI PA, even within FAANG.",
                  "score": 1,
                  "created_utc": 1742848211.0,
                  "replies": [
                    {
                      "id": "mjjtyeh",
                      "author": "LookOverThere305",
                      "body": "I use it almost daily and it works fine.",
                      "score": 1,
                      "created_utc": 1742852103.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjpsx8e",
              "author": "BeneCow",
              "body": "I work in a call centre that uses AI to make notes of the conversation. It makes our stats amazing because you don’t need to waste 5 minutes making notes, but the notes are so useless and wrong they may as well not be there.\n\nThe stats are good though so…",
              "score": 1,
              "created_utc": 1742933917.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjhfhn7",
          "author": "NecroCannon",
          "body": "Every time I try to have this discussion so many AI bros come from no where to tell me how wrong I am and that they’re a programmer (or some similar field) and it’s incredibly useful, and all of us are just the problem.\n\nBut it’s like… when it comes to the general population, who is this for? Who is asking for a middle man between themselves and their loved ones? Who’s asking to constantly have their data analyzed and used to tell you directly what you should buy? Who’s wanting to generate images outside of people wanting quick images without paying an artist?\n\nInstead of trying to listen to what people are looking for they instead just ignore the complaints and take it as being anti-ai so instead of improvements, we’re just seeing tech bros force their idea of a solution for all of our problems onto us. But if an everything app isn’t working well for Twitter, why the hell would it work for any of this? The future of machine learning isn’t chatbots or virtual assistants, not until they can ACTUALLY physically do stuff for us.",
          "score": 11,
          "created_utc": 1742826850.0,
          "replies": [
            {
              "id": "mjihncy",
              "author": "lifeishardthenyoudie",
              "body": "I agree that the usefulness depends on your job is, but that doesn't mean it's useless.\n\nI work as a teaching assistant/after-school teacher (not an English-speaking country but those are the closest terms) and I use it quite a lot both at work and outside of it.\n\nAt work use it to plan lessons or activities (\"come up with a game that teaches the kids x\"), for input on important emails (\"does this sound good or does it come off as too critical?\"), for help with explanations (\"come up with a good analogy for explaining x to young kids\"), etc. Outside of work it's mostly helping me with planning my Dungeons and Dragons adventures. It's a great help when you can give it hundreds of pages of sourcebooks and ask it to come up with a monster that fits your campaign or an idea for a good puzzle or riddle. Other than that it's mostly random questions that I would've googled like explaining the German political landscape or substituting an ingredient in a recipe. \n\nWhat really makes it excel is that the answers are personalized - I can tell it the age or the number of kids that will be participating in an activity, what my Dungeons and Dragons group is like or what I ingredients I have at hand and it will tailor the answers instead of the much more general advice that googling would give me.",
              "score": 4,
              "created_utc": 1742838122.0,
              "replies": []
            },
            {
              "id": "mk6w397",
              "author": "cordcutternc",
              "body": "Whenever I see use cases for AI on consumer devices, I feel like I'm getting gaslit. Why would I need intrusive, battery-sucking AI middleware to add something to my calendar or.....make a restaurant reservation? I can already do that in a few seconds on the phone itself.",
              "score": 1,
              "created_utc": 1743172704.0,
              "replies": [
                {
                  "id": "mk6ytf9",
                  "author": "NecroCannon",
                  "body": "As someone that’s autistic but learned to function well in society, I just genuinely feel like a lot of AI bros are neurodivergent and while it feels like a genie in a box for them, for the rest of us we just don’t need it to live.\n\nLike it feels like they’re gaslighting because it honestly almost is, you have a ton of people that can’t function well and want a middleman to make life easier forcing everyone else to also need to use one. They point to the large amount of users but one, it’s solving a problem created artificially by making searches easier, and two, there’s a ton of people that use it to cheat. It’s why outside of those two cases, you only mainly really see AI bros talking about how useful it is.",
                  "score": 2,
                  "created_utc": 1743173524.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mjhdprn",
          "author": "tnnrk",
          "body": "The AI bubble is gonna burst soon I think, The fact it’s being thrown around and in everything recently, all while consumer sentiment is that they don't care about it as much anymore is my hunch. \n\nI think everyone has realized what LLMs do and their limitations, they just guess what the next most likely sentence to say is. I don’t see how you utilize that for anything beyond some writing/coding tools and call it a day.\n\nUnless the corpos have a different version the can actually think or something, this shit is over blown.\n\nEvery time I use it for coding I can’t get it to disagree with me and it takes every suggestion I give as fact and hallucinates even more, it’s wild. It really pulls back the curtain and shows you what limited stuff it can do. ",
          "score": 4,
          "created_utc": 1742826283.0,
          "replies": []
        },
        {
          "id": "mjh31wi",
          "author": "Aemort",
          "body": "AI is a problem that is desperately clawing at its own solution.",
          "score": 2,
          "created_utc": 1742822750.0,
          "replies": []
        },
        {
          "id": "mjgxxcg",
          "author": "BoiIedFrogs",
          "body": "It’s a solution to employers having to pay employees, sadly",
          "score": 4,
          "created_utc": 1742820840.0,
          "replies": []
        },
        {
          "id": "mji1wo4",
          "author": "kamilman",
          "body": "It's not only this. Or at least not exclusively.\n\nAI has become the investors' buzz-word of the decade and ~~those corporate lizards~~ said investors fall for it every time. It's so dumb it's funny at this point...",
          "score": 2,
          "created_utc": 1742833624.0,
          "replies": []
        },
        {
          "id": "mjgvjal",
          "author": "sfear70",
          "body": "AI = accumlated information.",
          "score": 2,
          "created_utc": 1742819889.0,
          "replies": []
        },
        {
          "id": "mjibqfh",
          "author": "SonnyJackson27",
          "body": "Such a good way of putting it. Perfectly accurate",
          "score": 1,
          "created_utc": 1742836478.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgdqqg",
      "author": "RidleyDeckard",
      "body": "It would be the fastest way to stop me upgrading to a new Apple Watch.",
      "score": 168,
      "created_utc": 1742811046.0,
      "replies": [
        {
          "id": "mjgfnr2",
          "author": "Fluid-Badger",
          "body": "Old SE model still going strong out here",
          "score": 23,
          "created_utc": 1742812188.0,
          "replies": []
        },
        {
          "id": "mjmv55x",
          "author": "SkyriderRJM",
          "body": "I’m already not planning to update any time soon so I don’t lose O2 sensing. \n\nIt tells time and has ECG testing that I can send my cardiologist.  I don’t need AI",
          "score": 3,
          "created_utc": 1742900736.0,
          "replies": []
        },
        {
          "id": "mjh4nno",
          "author": "Sylvurphlame",
          "body": "You could just disable it? Apple Intelligence is optional, last time I checked.",
          "score": -22,
          "created_utc": 1742823323.0,
          "replies": [
            {
              "id": "mjha6f0",
              "author": "koenigsaurus",
              "body": "I mean, it is for now, until they decide it’s mandatory for the watch to function. The only way to guarantee they can’t turn it on by force is to use a device that doesn’t have AI capability at all.",
              "score": 14,
              "created_utc": 1742825139.0,
              "replies": [
                {
                  "id": "mjhibri",
                  "author": "Sylvurphlame",
                  "body": "It’s a bridge that will have to be crossed when it comes to it. And for now, it’s optional.\n\nIt’s also fine in response to someone saying they’d stop upgrading. They can keep their current device and simply disable the feature on the last generation where it was optional. If it becomes non-optional, they weren’t getting a new device anyway, by their own statement. So  pointing out that they might decide to make it mandatory is largely pointless. It isn’t mandatory now, on current devices you might own.\n\nI fully understand that some people are vehemently anti Apple Intelligence and anti-AI on any device. That’s fine. Doesn’t change that it is currently an opt-in feature and if they decide to make it opt-out or non-optional some future point, then you already weren’t getting the device anyway with your current stance.\n\nSo what are people thinking they actually communicate with these “fastest way to make me stop upgrading” statements. Strikes me as no different than loudly proclaiming “I’m leaving Reddit if…”",
                  "score": -10,
                  "created_utc": 1742827748.0,
                  "replies": [
                    {
                      "id": "mjjh8ve",
                      "author": "buggybugoot",
                      "body": "Why the hell do you care? Who made you reddit comment police? What a weird hill to eat on for downvotes.\n\nEdit: way to dodge the actual question lmfao",
                      "score": 1,
                      "created_utc": 1742848329.0,
                      "replies": [
                        {
                          "id": "mjjurk0",
                          "author": "Sylvurphlame",
                          "body": "I don’t particularly care about votes, internet stranger. And honestly anything that could be misconstrued as somehow supporting Apple would likely be downvoted, so no shocker there.\n\nI see a something that seems interesting in some way, I comment, if they reply, I may reply back.\n\nTo your question of why the hell do I care? “Care” is a strong word and the reply probability is based largely on my current caffeine and boredom levels. Now as to why the comment interested me, it’s just that: I find it weird that people are always proclaiming “I’ll leave/stop/quit…” as if the companies are scanning Reddit to determine their next move.\n\nI’d also wonder the same back at ya: why the hell do you care whether I care or not? Are *you* the Reddit Comment Police then?\n\nTake care and have a good day. I mean that genuinely.",
                          "score": 0,
                          "created_utc": 1742852357.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjltqd0",
              "author": "thisischemistry",
              "body": "Even if you disable it the files are still there, taking up a decent amount of storage space. Plus it gets re-enabled every time you update the OS. \n\nGood times…",
              "score": 3,
              "created_utc": 1742877660.0,
              "replies": []
            },
            {
              "id": "mjil1y5",
              "author": "PacoTaco321",
              "body": "Now you are just paying extra that they intend as a selling point just to disable it.",
              "score": 1,
              "created_utc": 1742839079.0,
              "replies": [
                {
                  "id": "mjild6r",
                  "author": "Sylvurphlame",
                  "body": "Hahaha.\n\nThey were always going to charge the price they were going to charge.\n\nIf it becomes non-optional, don’t buy if you don’t want it. But posting about how “that’ll be the fastest way to get me to stop upgrading?” That’s like loudly complaining that “I’ll leave Reddit if…” It’s not going to move the needle. AI will either reach a point of usefulness or otherwise run its course. It’s already here in whatever form it exists and not likely going away.",
                  "score": 0,
                  "created_utc": 1742839169.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mjgee7i",
      "author": "Queen_Euphemia",
      "body": "I just want to track heartrate between sets, and change my song without pulling my phone out of my gym bag, I don't want to burn the rain forest down so predictive text can hallucinate some lies for me",
      "score": 126,
      "created_utc": 1742811438.0,
      "replies": [
        {
          "id": "mjgkzho",
          "author": "Vabla",
          "body": "At this rate the watch will need an external battery to last through the day. But at least it will be able to make a joke about today's weather when it detects you waking up.",
          "score": 7,
          "created_utc": 1742815095.0,
          "replies": []
        },
        {
          "id": "mjtknze",
          "author": "spdorsey",
          "body": "I really love the way you framed this.",
          "score": 1,
          "created_utc": 1742991559.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgeffg",
      "author": "chronictherapist",
      "body": "I dont want another product with fucking AI, jesus christ ...\n\nCan we just skip to the Butlarian Jihad already?",
      "score": 93,
      "created_utc": 1742811459.0,
      "replies": [
        {
          "id": "mjgfmud",
          "author": "benanderson89",
          "body": "I want so badly for this bubble to burst and to just *go away*.\n\nEDIT: FUN FACT, in market research literature, nearly 90% of customers *do not like* products with \"AI\" in their marketing.\n\nAI is a bubble to satisfy clueless shareholders only.",
          "score": 66,
          "created_utc": 1742812173.0,
          "replies": [
            {
              "id": "mjggm16",
              "author": "chronictherapist",
              "body": "Between this and all the data collection for, well basically EVERYTHING, it makes me not want to use tech as much as I do. I've already deleted accounts and others I refuse to have on my phone.\n\nEven new cars want you to sign away your privacy to them.",
              "score": 31,
              "created_utc": 1742812743.0,
              "replies": [
                {
                  "id": "mjgt0ad",
                  "author": "matt2331",
                  "body": "Privacy issues are certainly the top concern, but unlike previous tech explosions the benefits aren't even slightly justifiable. AI is a worse way to do everything on my phone AND it invades my privacy.",
                  "score": 17,
                  "created_utc": 1742818831.0,
                  "replies": [
                    {
                      "id": "mjhde45",
                      "author": "chronictherapist",
                      "body": "I wouldn't say it is without merit and I can see lots of applications like diagnostics in medicine where you could ask plain English questions and get a rapid response based on decades of knowledge.\n\nBut trying to push it into everything is asinine.\n\nEDIT: wow, you people really hate AI regardless of application.",
                      "score": -3,
                      "created_utc": 1742826178.0,
                      "replies": [
                        {
                          "id": "mjhlkaa",
                          "author": "Boowray",
                          "body": "But so far, it’s proven woefully ineffective at doing so without hallucinating symptoms and defaulting to the most common ailments for any situation regardless of if they fit the symptoms or not. AI isn’t there to give you the truth, it’s there to tell you what it thinks you want to hear, which makes it horrifying for medical use.",
                          "score": 5,
                          "created_utc": 1742828748.0,
                          "replies": [
                            {
                              "id": "mjhnyvl",
                              "author": "chronictherapist",
                              "body": "All that is just coding and better use. The idea isn't to get a diagnosis out of it, but to get an idea of the possibilities, even the rare ones. How many stories have you heard where people have gone months or years before they get a correct diagnosis because what they have is ultra rare or something most doctors wouldn't have thought of? That's all I mean when I say diagnostics.",
                              "score": -4,
                              "created_utc": 1742829471.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mjmc84v",
                          "author": "benanderson89",
                          "body": ">I wouldn't say it is without merit and I can see lots of applications like diagnostics in medicine where you could ask plain English questions and get a rapid response based on decades of knowledge.\n\n>But trying to push it into everything is asinine.\n\n>EDIT: wow, you people really hate AI regardless of application.\n\n\"AI\" doesn't exist. There are many different systems in use and they're all essentially tarted up linear algebra with statistical data-sets. By-and-large any \"AI\" system currently in use is a pure waste of resources and money, and goes as far as to make diagnosis harder due to machine bias in medical professionals, regardless of the occasional headline stating \"AI found this weird medical thing like it's digital Dr House\".",
                          "score": 1,
                          "created_utc": 1742888875.0,
                          "replies": [
                            {
                              "id": "mjna6xx",
                              "author": "chronictherapist",
                              "body": "Obviously AI in the true sense of the term doesn't exist, but don't we have to go through the iterations before we get to the reality? There has been plenty of new tech/science that people labeled as a waste of resources until an iteration came along that was useful.",
                              "score": 1,
                              "created_utc": 1742907271.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjh3nnq",
              "author": "Pure-Wing6824",
              "body": "Same, it's absolute garbage being shoved into every product that most people don't want",
              "score": 6,
              "created_utc": 1742822967.0,
              "replies": [
                {
                  "id": "mjlxai4",
                  "author": "IchBinMalade",
                  "body": "It's fucking insane lol. I downloaded a note taking app for my tablet, half of them try to convince me to pay for AI. I literally just wanna write shit down mate. I try to find a PDF reader, most try to sell me AI to summarize stuff for me, dude why would I trust you to know what is important and unimportant information in what I wanna read? I download a browser, it has an included AI for God knows what reason.\n\nJust blows my mind how some apps don't have basic functionality, but include AI. Like, you don't even have dark mode but you have an AI chat bot? Or Google with Gemini that's still less useful than Google Assistant. I'd use it if I could say \"open YouTube and find a video on this topic, over an hour long that I can listen to on my drive, make sure it's got a positive reception.\" But it can't do stuff like that.\n\nThe funny thing is, I use AI all the time, Claude is fantastic. I use it as a kind of Google on steroids. It does amazing at helping to direct me when I research something, but I never trust information it gives me, I'll ask it \"what should I research if I'm interested in X\", and go from there. It's also pretty ridiculously good at coding, or at least at giving me a start from which I can go on by myself. I have yet to find another use for AI that's not pure gimmick. \n\nThey keep trying to make it do things for me, but I don't want that, I wanna do things myself, I just want it to make that easier.",
                  "score": 0,
                  "created_utc": 1742879533.0,
                  "replies": [
                    {
                      "id": "mjmcaoe",
                      "author": "benanderson89",
                      "body": "What you're using Claude for is simply a removal of your own agency and cognitive load, which is bad, especially in the long-term.",
                      "score": 1,
                      "created_utc": 1742888922.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjhb0ed",
              "author": "koenigsaurus",
              "body": "Seriously, we only had to suffer NFTs for less than a year. VR was DOA as a technology for the masses because of hardware requirements. AI continues to be the buzzword of the time because it’s so easy to put a shit LLM on any new device or integrate it in any app. I can’t wait for it to go away from the spotlight and settle in as a niche tool in use cases where it’s actually helpful.",
              "score": 6,
              "created_utc": 1742825411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjgfeet",
          "author": "lo_fi_ho",
          "body": "Butlarian Jihad, wow that’s accurate",
          "score": 10,
          "created_utc": 1742812036.0,
          "replies": [
            {
              "id": "mjhj7dj",
              "author": "Verbal_Combat",
              "body": "For context it’s from the novel Dune, machines rise up or something, can’t remember if it’s properly explained but basically the reason they use Mentats (like human computers) instead of AI tech",
              "score": 2,
              "created_utc": 1742828021.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjgx24r",
          "author": "VagueSomething",
          "body": "Remember, the term Luddite was used as government propaganda against Workers Rights. The government and rich people literally paid to get protesters beat up, murdered, and intimidated to stop demanding fair pay and for dangerous machines to not replace them. The machines the Luddite's didn't like used untrained children to replace skilled workers and take work away from normal people to instead give large factories mass production to make the owner rich rather than families handing down skills to their own children.\n\n\nPeople will accuse us of being Luddite's for wanting Worker Rights and a Right to Privacy when resisting AI. It is again a push by Elites like billionaires who own AI companies to make us seem stupid for not wanting our lives to be made worse for their profits.",
          "score": 3,
          "created_utc": 1742820501.0,
          "replies": [
            {
              "id": "mjhdc6q",
              "author": "Forever__Young",
              "body": ">the term Luddite was used as government propaganda against Workers Rights.\n\nThe Luddite movement was self defined as such because they were followers of Ned Ludd, a sort of mythical hero of industrial revolution workers rights.",
              "score": 5,
              "created_utc": 1742826161.0,
              "replies": [
                {
                  "id": "mjhurkp",
                  "author": "VagueSomething",
                  "body": "Yes, they called themselves Luddites but it became an insult due to government and Land Owner Class spending significant amounts of money to propagandise it into the idea of someone anti advancement and often seen as a bit stupid.\n\n\nSame as how Woke is weaponised by a Ruling Class today.",
                  "score": 4,
                  "created_utc": 1742831493.0,
                  "replies": [
                    {
                      "id": "mjhwcm5",
                      "author": "Forever__Young",
                      "body": "Okay I kind of get what you're saying but it wasn't the term luddite that was the propaganda, the term luddite was their actual identification. \n\nThe propaganda was just the villainisation of the group.",
                      "score": 3,
                      "created_utc": 1742831958.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mjhef3g",
              "author": "chronictherapist",
              "body": "For myself its not just AI. I want a right to privacy in general. I don't need some company to know what time I eat breakfast and when I'm most likely to masturbate just cause I like the movement tracking capability of a smart watch or cell phone.",
              "score": 1,
              "created_utc": 1742826507.0,
              "replies": [
                {
                  "id": "mjhu9a2",
                  "author": "VagueSomething",
                  "body": "The amount of data tracking we've had available for the last 20 years is insane. Companies have been able to predict a customer is pregnant before they know themselves. We also know that anonymous data isn't actually anonymous, especially when it is medical or location.",
                  "score": 1,
                  "created_utc": 1742831344.0,
                  "replies": [
                    {
                      "id": "mjhv1w1",
                      "author": "chronictherapist",
                      "body": "I dont remember where I heard this, but someone told me that just your play list on apple/amazon/etc can figure out your sexual orientation, income bracket, age, and general mood throughout an average day.",
                      "score": 2,
                      "created_utc": 1742831577.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mjgjb76",
      "author": "_misterwilly",
      "body": "Siri, what is the time?\n\n“I’m sorry I don’t understand that request.”",
      "score": 50,
      "created_utc": 1742814216.0,
      "replies": [
        {
          "id": "mjgjuvq",
          "author": "roninXpl",
          "body": "They updated that. Now it's \"would you like to use CharGPT for that request?\"",
          "score": 11,
          "created_utc": 1742814508.0,
          "replies": []
        },
        {
          "id": "mjiea0b",
          "author": "medoy",
          "body": "Now playing If I could turn back time by artist Cher.",
          "score": 1,
          "created_utc": 1742837148.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgf5vc",
      "author": "Jakku1p",
      "body": "AI is the new bloatware",
      "score": 30,
      "created_utc": 1742811895.0,
      "replies": []
    },
    {
      "id": "mjgqqyc",
      "author": "Sunflier",
      "body": "Dear tech companies,\n\n\nPlease stop shoving AI down my throat. I cannot disable it fast enough when you add it to my stuff.\n\n\nThank you.",
      "score": 31,
      "created_utc": 1742817836.0,
      "replies": [
        {
          "id": "mjhelnv",
          "author": "MrSinister248",
          "body": "Dear Customer,\n  \nWe understand your concerns, and have removed the ability to disable our AI assistants.\n  \nSincerely,  \nGet fucked",
          "score": 12,
          "created_utc": 1742826565.0,
          "replies": [
            {
              "id": "mjid5qo",
              "author": "ouqt",
              "body": "Sincerely AI",
              "score": 1,
              "created_utc": 1742836886.0,
              "replies": []
            },
            {
              "id": "mjid87x",
              "author": "ouqt",
              "body": "*Sincerely AI",
              "score": 1,
              "created_utc": 1742836904.0,
              "replies": []
            },
            {
              "id": "mjidqr8",
              "author": "ouqt",
              "body": "*Sincerely AI",
              "score": 1,
              "created_utc": 1742837021.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgm0bv",
      "author": "XmasRights",
      "body": "Turn off the AI, and you’re left with a Watch with an insane about of RAM",
      "score": 15,
      "created_utc": 1742815612.0,
      "replies": [
        {
          "id": "mjh521t",
          "author": "Sylvurphlame",
          "body": "We’re graphing chronos in 8K, boys.",
          "score": 2,
          "created_utc": 1742823463.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgv5tn",
      "author": "BarfHurricane",
      "body": "I can’t remember any other product in my life where consumers have nearly unanimously said, “yeah no thanks” and it still be pushed by multiple companies. These corporations will do anything to reach those early 2010 highs, even if it means forcing things that have no consumer demand like AI.",
      "score": 18,
      "created_utc": 1742819736.0,
      "replies": [
        {
          "id": "mjhlf8z",
          "author": "Drix22",
          "body": "I'm guessing because ai can skim all your data for future marketing, it's not about what you wantpersonally, it's what you want financially and the best way for a company to extract that fiance from you.",
          "score": 8,
          "created_utc": 1742828706.0,
          "replies": [
            {
              "id": "mjhw6nw",
              "author": "BarfHurricane",
              "body": "Absolutely. \n\nIt’s just so bizarre that we have reached the point where Econ 101 concepts like supply and demand don’t even matter, and people have just kinda normalized it.",
              "score": 5,
              "created_utc": 1742831910.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgchkf",
      "author": "notedrive",
      "body": "They should focus on getting their AI to work on their phone first.",
      "score": 20,
      "created_utc": 1742810285.0,
      "replies": [
        {
          "id": "mjgjt2l",
          "author": "Vabla",
          "body": "They clearly have identified the problem to be the phone and not the AI.",
          "score": 5,
          "created_utc": 1742814481.0,
          "replies": [
            {
              "id": "mjh57o8",
              "author": "Sylvurphlame",
              "body": "Ok. That made me snort. I’ll admit.",
              "score": 1,
              "created_utc": 1742823517.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgh3rv",
      "author": "drnemmo",
      "body": "What about improving battery life first?",
      "score": 11,
      "created_utc": 1742813019.0,
      "replies": []
    },
    {
      "id": "mjh4jxa",
      "author": "Ancient_Reporter2023",
      "body": "Between Apple, Microsoft tripling down on AI that no one wants or asked for and all these streaming services going to hell I am really wanting to switch back to the “dumb” devices and analogue media of my youth.",
      "score": 10,
      "created_utc": 1742823286.0,
      "replies": [
        {
          "id": "mjl631g",
          "author": "treehugger100",
          "body": "Join us. I’m enjoying analog but also digital not connected to the internet.",
          "score": 1,
          "created_utc": 1742867846.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgidbo",
      "author": "diagrammatiks",
      "body": "Can't even get Siri working. Good luck with that.",
      "score": 7,
      "created_utc": 1742813705.0,
      "replies": []
    },
    {
      "id": "mjgni95",
      "author": "GnomeNot",
      "body": "Why do they think everything needs to have a camera in it?",
      "score": 7,
      "created_utc": 1742816348.0,
      "replies": []
    },
    {
      "id": "mjhhif4",
      "author": "petermadach",
      "body": "I swear to god companies should start marketing themselves with \"we DON'T push AI into stuff\" and I bet it'd work",
      "score": 4,
      "created_utc": 1742827490.0,
      "replies": []
    },
    {
      "id": "mjgoxh8",
      "author": "None",
      "body": "Nope in fact I want a Nokia.  Bring back snake!",
      "score": 7,
      "created_utc": 1742817014.0,
      "replies": []
    },
    {
      "id": "mjgfht6",
      "author": "Jakku1p",
      "body": "Makes sense, technological improvements in phones and wearables have really stagnated to the point that they have no actual discernible upgrades year over year. All they have left to market with right now is the AI.",
      "score": 12,
      "created_utc": 1742812092.0,
      "replies": [
        {
          "id": "mjgsibl",
          "author": "None",
          "body": "They could fix battery. \n\nThey could make a bigger phone that can only be worn in Apple brand jeans with new iPhones 20 pockets, the only pockets for iPhone 20, or some shit. \n\nCreate a camera ai that makes my penis look bigger automatically, like there’s photo mode, spatial mode, panoramic mode, and now gender affirming mode \n\nWhat if the phone natively used ai in photos to identify plant types? Survival mode\n\nWhat if they made a phone that works as a full computer and docks into a screen and keyboard so your work pc is in your pocket? Why can’t we do that already? I don’t need the fastest pc for work and emails, as long as I can churn out a pivot table and type up 10 reasons to hide my bosses body after the purge, then we are good to go. Windows surface phone. Apple Mac mini phone pro plus. Make my tablet even more useless",
          "score": 7,
          "created_utc": 1742818615.0,
          "replies": [
            {
              "id": "mjh5k7h",
              "author": "Sylvurphlame",
              "body": "Jokes aside, I legit would love an iPhone Pro that docked into keyboard-display-battery frame and basically functioned as a MacBook Air. Realistically, it probably be an iPad Air, depending on if we’re before or after the inevitable merger of those product lines.",
              "score": 3,
              "created_utc": 1742823637.0,
              "replies": []
            },
            {
              "id": "mjh3s29",
              "author": "AHRA1225",
              "body": "Haha aside from the sarcasm those aren’t bad. The mini mini computer phone with dock station would be cool’s",
              "score": 1,
              "created_utc": 1742823010.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgcr3q",
      "author": "The_Human_Event",
      "body": "Perfect. I’ve always wanted a watch that could do my taxes for me.",
      "score": 9,
      "created_utc": 1742810444.0,
      "replies": [
        {
          "id": "mjge6r8",
          "author": "Cultural-Action5961",
          "body": "Can’t wait.\n\n\n“Process 2025 taxes”\n\nWatch - “Here’s what I found online..”\n\n“PROCESS.2025.taxes”\n\nWatch - “…. Now playing The Beatles - Taxman from \n1966 on Apple Music”",
          "score": 20,
          "created_utc": 1742811313.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgv73w",
      "author": "Exception-Rethrown",
      "body": "I’d be happy just to have an Apple Watch that I didn’t have to charge daily.  Adding AI is not going to help, it will just kill the battery quicker",
      "score": 3,
      "created_utc": 1742819750.0,
      "replies": []
    },
    {
      "id": "mjhsxjn",
      "author": "Jaminbee",
      "body": "And this, is where my upgrades of technology ends. I don’t need shitty Siri taking up more space on my devices",
      "score": 3,
      "created_utc": 1742830953.0,
      "replies": []
    },
    {
      "id": "mji3yj5",
      "author": "dwight_k_schrute69",
      "body": "I’ll stick with my “dumb” watch. AI is exhausting and something I don’t want",
      "score": 3,
      "created_utc": 1742834230.0,
      "replies": []
    },
    {
      "id": "mjivhgs",
      "author": "RaynorTheRed",
      "body": "Man those Garmin smartwatches are looking pretty hot!",
      "score": 3,
      "created_utc": 1742842098.0,
      "replies": []
    },
    {
      "id": "mjh28ll",
      "author": "Osiris_Raphious",
      "body": "Apple is so desperate they are now peddling literal dream vapor ware... steve jobs is probably hooked up to a generator spinning in his grave powering apple headquarters...\n\ncurrent stat eof AI is a fad. Fact that china released free AI that put all these paid models to shame goes to show its just chatbots and functional smart software that can take user input and actually do something with it... Funny enough exactly what cortana, copilot, alexa, and siri was spromised to do years and years ago, and they are still useless...",
      "score": 5,
      "created_utc": 1742822456.0,
      "replies": []
    },
    {
      "id": "mjgh3z3",
      "author": "Technical_EVF_7853",
      "body": "No more Apple Watches for moi’.",
      "score": 4,
      "created_utc": 1742813022.0,
      "replies": [
        {
          "id": "mjgqg1u",
          "author": "Neferknitti",
          "body": "Mine is six years old. When it dies, I’m going back to regular watches.",
          "score": 2,
          "created_utc": 1742817699.0,
          "replies": [
            {
              "id": "mjh563q",
              "author": "Technical_EVF_7853",
              "body": "I’ve got a Rolex, a Movado & a Tissot that have dust on each. Your idea sounds great. Funny thing is that I also have a few Samsung watches to wear also. Thus, I think my watch buying days are over.",
              "score": 1,
              "created_utc": 1742823502.0,
              "replies": []
            },
            {
              "id": "mjh5vwy",
              "author": "Pholusactual",
              "body": "Early Samsung Galaxy here because I like ROUND watch faces.  Turn off Wifi/Bluetooth and it goes a respectable number of days without charging.  \n\nEven though it is hanging in there seven years later I am so ready to replace it with a real watch.   \n\nNot everything needs to be digital.",
              "score": 1,
              "created_utc": 1742823749.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mjgii1x",
      "author": "Lassie_Maven",
      "body": "It’s almost like no one has seen the Terminator movies.",
      "score": 4,
      "created_utc": 1742813776.0,
      "replies": []
    },
    {
      "id": "mjgw5nw",
      "author": "STARstar786",
      "body": "What about decent battery life that lasts upto a month on one charge",
      "score": 4,
      "created_utc": 1742820141.0,
      "replies": [
        {
          "id": "mjgyckf",
          "author": "ABucin",
          "body": "Siri says: no.",
          "score": 2,
          "created_utc": 1742821002.0,
          "replies": [
            {
              "id": "mjgzmqy",
              "author": "STARstar786",
              "body": "Aww man!",
              "score": 1,
              "created_utc": 1742821491.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mjimoth",
          "author": "Sylvurphlame",
          "body": "What current generation smartphones do that? Genuine question.",
          "score": 1,
          "created_utc": 1742839548.0,
          "replies": [
            {
              "id": "mjinxsl",
              "author": "STARstar786",
              "body": "Watches like garmin last up to a week or 15 days though.",
              "score": 1,
              "created_utc": 1742839909.0,
              "replies": [
                {
                  "id": "mjj1ml5",
                  "author": "Sylvurphlame",
                  "body": "A Garmin is a different purpose and feature set. There are a lot of differences.\n\nAlthough, I did say smartphone while on a thread talking about watches so my bad there.",
                  "score": 1,
                  "created_utc": 1742843870.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mjh3yq1",
      "author": "cyxrus",
      "body": "Apple Watch already has horrible battery life. Until they make one that can last a week, having a watch that can barely last a day and needs to be off for hours to charge makes no sense",
      "score": 4,
      "created_utc": 1742823076.0,
      "replies": []
    },
    {
      "id": "mjgjwso",
      "author": "enewwave",
      "body": "I would literally stop using an Apple Watch and go back to a normal, or antique watch if they did this. I got mine because I found pulse tracking and O2 reading in the form factor helpful on the go, given health issues I had. I’ve since kept it on out of convenience (and because of those features, though I really do wish there was a more elegant solution).",
      "score": 2,
      "created_utc": 1742814537.0,
      "replies": []
    },
    {
      "id": "mjgsbq2",
      "author": "olearyboy",
      "body": "Why don’t they make a pin….",
      "score": 2,
      "created_utc": 1742818535.0,
      "replies": [
        {
          "id": "mjh47ih",
          "author": "AHRA1225",
          "body": "Or a ring. Sometimes I don’t want to wear the watch",
          "score": 1,
          "created_utc": 1742823165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjh26pq",
      "author": "GeniusEE",
      "body": "That's not going to go over well with the nonwearers around it being recognized and tracked by its cameras so the billionaire class can do its thing.",
      "score": 2,
      "created_utc": 1742822437.0,
      "replies": []
    },
    {
      "id": "mjh8ev6",
      "author": "FuckThatIKeepsItReal",
      "body": "How about you make the heart rate monitor actually responsive \n\nThing sucks",
      "score": 2,
      "created_utc": 1742824607.0,
      "replies": []
    },
    {
      "id": "mjhaimq",
      "author": "Anome69",
      "body": "So regular methods of tracking time aren't good enough? My 2.99 times does the job just fine without slapping skynet on my wrist.",
      "score": 2,
      "created_utc": 1742825251.0,
      "replies": []
    },
    {
      "id": "mjhfol8",
      "author": "knucklehead_89",
      "body": "Cuz all the other wearable AI has been great so far",
      "score": 2,
      "created_utc": 1742826913.0,
      "replies": []
    },
    {
      "id": "mjhgf9h",
      "author": "kal8el77",
      "body": "Let’s shoot for a 24 hr battery first.",
      "score": 2,
      "created_utc": 1742827147.0,
      "replies": []
    },
    {
      "id": "mjhhhgf",
      "author": "lurker512879",
      "body": "just use the Seiko kinetic drive system that converts mechanical to electrical thru a tiny generator, capacitor and LiPo.  Surely Seiko would license or sell the tech/patent to Apple.",
      "score": 2,
      "created_utc": 1742827481.0,
      "replies": []
    },
    {
      "id": "mjhx2fz",
      "author": "MossAreFriends",
      "body": "No thanks",
      "score": 2,
      "created_utc": 1742832173.0,
      "replies": []
    },
    {
      "id": "mjiuzvq",
      "author": "Blue-Thunder",
      "body": "The company that hasn't done anything with their virtual assistant in over a decade wants to make AI..",
      "score": 2,
      "created_utc": 1742841959.0,
      "replies": []
    },
    {
      "id": "mjk246z",
      "author": "itsthreeamyo",
      "body": "It takes more electronics and power to determine the time with a camera and 'AI' than it does with technology that has been available since the late 80's.  This is nothing more than an excuse to have a camera recording everything, all the time.",
      "score": 2,
      "created_utc": 1742854662.0,
      "replies": []
    },
    {
      "id": "mjgnbjq",
      "author": "Good_Air_7192",
      "body": "Definitely need cameras and \"visual intelligence\" to tell time. I think I'll stick with my conventional, non-AI watch.",
      "score": 3,
      "created_utc": 1742816256.0,
      "replies": []
    },
    {
      "id": "mjgp8bx",
      "author": "thievesthick",
      "body": "Do we really need to reinvent the fucking clock at this point? This sounds like they’re trying to make a digital sun dial. Tech is getting so boring, man.",
      "score": 3,
      "created_utc": 1742817151.0,
      "replies": []
    },
    {
      "id": "mjgs8kt",
      "author": "None",
      "body": "An always on camera monitoring your every move",
      "score": 3,
      "created_utc": 1742818497.0,
      "replies": []
    },
    {
      "id": "mjgzr8q",
      "author": "maury_mountain",
      "body": "Why is this a fucking place to “innovate.” Just have the stupid fucking thing tell time like watches have always told time.\n\nFeel like I’m taking crazy pills. Mugatu out",
      "score": 3,
      "created_utc": 1742821538.0,
      "replies": [
        {
          "id": "mji2hxj",
          "author": "sockgorilla",
          "body": "If that’s all you want you can just buy a watch lmao",
          "score": 1,
          "created_utc": 1742833799.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjgdjg6",
      "author": "ohiocodernumerouno",
      "body": "ChatGPT as the only AI provider on iOS is the most disappointing thing, not just tech, the most disappointing thing in 2025. The disco lights around the screen just highlights this feature can't carry itself and needs a freaking parade to get people to even look its direction. iOS AI is a product from 2023. It's a 2 year out of date on release.",
      "score": 4,
      "created_utc": 1742810923.0,
      "replies": []
    },
    {
      "id": "mjgdemn",
      "author": "AlwaysRushesIn",
      "body": "Steve Jobs is rolling in his grave.",
      "score": 2,
      "created_utc": 1742810843.0,
      "replies": []
    },
    {
      "id": "mjgd0vq",
      "author": "Long-View-7989",
      "body": "Maybe get your Apple intelligence together first",
      "score": 2,
      "created_utc": 1742810609.0,
      "replies": []
    },
    {
      "id": "mjgjdbm",
      "author": "Monksdrunk",
      "body": "\"wow, you're jerking off again? Here, watch these commercials\"",
      "score": 2,
      "created_utc": 1742814248.0,
      "replies": []
    },
    {
      "id": "mjglfm5",
      "author": "Jaszuni",
      "body": "Camera on an arm that is always moving is a terrible idea.",
      "score": 2,
      "created_utc": 1742815324.0,
      "replies": []
    },
    {
      "id": "mjglrzp",
      "author": "ghost_n_the_shell",
      "body": "No thank you.",
      "score": 2,
      "created_utc": 1742815497.0,
      "replies": []
    },
    {
      "id": "mjgulwd",
      "author": "ccstewy",
      "body": "No thank you, Apple.",
      "score": 2,
      "created_utc": 1742819507.0,
      "replies": []
    },
    {
      "id": "mjguzvl",
      "author": "Puzzleheaded-Dog1872",
      "body": "No thank you. It’s already bad enough that it’s on my phone. :\\",
      "score": 2,
      "created_utc": 1742819669.0,
      "replies": []
    },
    {
      "id": "mjh04w3",
      "author": "Brilliant_Chance_874",
      "body": "They watches don’t work well as it is!",
      "score": 2,
      "created_utc": 1742821681.0,
      "replies": []
    },
    {
      "id": "mjgka2u",
      "author": "PaulR79",
      "body": "Anyone else waiting for the point where this all comes crashing down? I don't mean Apple or any other company in particular I just mean the 'AI' push from practically every company. Oh actually I changed my mind. I want Nvidia to suffer most!",
      "score": 1,
      "created_utc": 1742814728.0,
      "replies": []
    },
    {
      "id": "mjgez69",
      "author": "chesstnuts",
      "body": "Nope",
      "score": 1,
      "created_utc": 1742811784.0,
      "replies": []
    },
    {
      "id": "mjggtac",
      "author": "asianumba1",
      "body": "It can already tell time with more accuracy than your average consumer would ever need though",
      "score": 1,
      "created_utc": 1742812858.0,
      "replies": []
    },
    {
      "id": "mjgofqy",
      "author": "RedBeans-n-Ricely",
      "body": "I like my watch as it is, thanks. I’m not taking a photo with my wrist",
      "score": 1,
      "created_utc": 1742816786.0,
      "replies": []
    },
    {
      "id": "mjgpig3",
      "author": "SoupNazi615",
      "body": "Announced today, released 2031, because Apple",
      "score": 1,
      "created_utc": 1742817280.0,
      "replies": []
    },
    {
      "id": "mjgqzbi",
      "author": "robbadobba",
      "body": "Apple should worry more about perfecting their OSes and Siri than “innovating” at this point.",
      "score": 1,
      "created_utc": 1742817939.0,
      "replies": []
    },
    {
      "id": "mjgrf2f",
      "author": "None",
      "body": "Apple Watch will soon only tell time and all other features will be subscription based",
      "score": 1,
      "created_utc": 1742818136.0,
      "replies": []
    },
    {
      "id": "mjgwmdr",
      "author": "Stunning_Bed23",
      "body": "But why?",
      "score": 1,
      "created_utc": 1742820328.0,
      "replies": []
    },
    {
      "id": "mjgy4km",
      "author": "bawlsacz",
      "body": "Lmao. You will have to charge this thing every hour.",
      "score": 1,
      "created_utc": 1742820917.0,
      "replies": []
    },
    {
      "id": "mjgyzja",
      "author": "pyrethedragon",
      "body": "I just want it to have like 3 days of battery life.",
      "score": 1,
      "created_utc": 1742821244.0,
      "replies": []
    },
    {
      "id": "mjgzezc",
      "author": "jnmjnmjnm",
      "body": "That is the stupidest product idea ever!",
      "score": 1,
      "created_utc": 1742821409.0,
      "replies": []
    },
    {
      "id": "mjh5klh",
      "author": "hollyglaser",
      "body": "If I need something to lie to me, I can do it myself",
      "score": 1,
      "created_utc": 1742823641.0,
      "replies": []
    },
    {
      "id": "mjh6eyf",
      "author": "panoramacotton",
      "body": "Honestly, they should make targeted advertising illegal. That'll solve all these privacy issues.",
      "score": 1,
      "created_utc": 1742823931.0,
      "replies": []
    },
    {
      "id": "mjh7kxl",
      "author": "vid_icarus",
      "body": "They would need a functional AI first.",
      "score": 1,
      "created_utc": 1742824330.0,
      "replies": []
    },
    {
      "id": "mjhbhd6",
      "author": "thirteennineteen",
      "body": "Spatial computing didn’t start with the Vision Pro. Watch and AirPods Pro have been little spatial computers for generations. Using them to capture more info about the space seems like a smart idea to me.",
      "score": 1,
      "created_utc": 1742825563.0,
      "replies": []
    },
    {
      "id": "mjhbi1s",
      "author": "Bigred2989-",
      "body": "My Samsung watch has a predictive AI for making quick text message replies and it's awful. None of the suggestions it gives ever work and it even fucks up questions that could be answered with a simple yes or no or okay. It's always something long winded and irrelevant to what's being discussed.",
      "score": 1,
      "created_utc": 1742825569.0,
      "replies": []
    },
    {
      "id": "mjhfzv2",
      "author": "spacepeenuts",
      "body": "How about better battery life first for the apple watch, at least a week because im sick of charging it every other day.",
      "score": 1,
      "created_utc": 1742827012.0,
      "replies": []
    },
    {
      "id": "mjhhry6",
      "author": "ArcadeShrimp",
      "body": "\"Tells time with cameras\"",
      "score": 1,
      "created_utc": 1742827573.0,
      "replies": []
    },
    {
      "id": "mjhi74n",
      "author": "fuckgod421",
      "body": "CHECK PLEASE",
      "score": 1,
      "created_utc": 1742827708.0,
      "replies": []
    },
    {
      "id": "mjhksd9",
      "author": "gingersamurai25",
      "body": "Next they’ll want to put it in our brains. Just the logical endgame with it.",
      "score": 1,
      "created_utc": 1742828511.0,
      "replies": []
    },
    {
      "id": "mjhl14l",
      "author": "Drix22",
      "body": "\"Tells time with cameras and visual intelligence\" because that's so much less battery power than what we currently use.",
      "score": 1,
      "created_utc": 1742828586.0,
      "replies": []
    },
    {
      "id": "mjhm26r",
      "author": "None",
      "body": "Apple is gonna need to change themselves if they want to play in the ai game, they are doing so bad so far",
      "score": 1,
      "created_utc": 1742828899.0,
      "replies": []
    },
    {
      "id": "mjhomrn",
      "author": "windblade88",
      "body": "I just want a battery that can last a week between charging! Is that too much to ask?",
      "score": 1,
      "created_utc": 1742829671.0,
      "replies": []
    },
    {
      "id": "mjhrtcm",
      "author": "LarryLobster69",
      "body": "Wearable AI? I saw a post yesterday that full AI siri wouldnt be ready until ios 20 in like 2 years",
      "score": 1,
      "created_utc": 1742830622.0,
      "replies": []
    },
    {
      "id": "mjhzv44",
      "author": "josephfry4",
      "body": "I'll keep using my 1940's Hamilton, thank you very much. It, at the very least, has very little to say to me.",
      "score": 1,
      "created_utc": 1742833014.0,
      "replies": []
    },
    {
      "id": "mji0d6v",
      "author": "2Autistic4DaJoke",
      "body": "If Apple would make the watch the full phone experience I’d never turn back.",
      "score": 1,
      "created_utc": 1742833164.0,
      "replies": []
    },
    {
      "id": "mji5i90",
      "author": "Wisdomlost",
      "body": "Why have to agree to a privacy policy when you can just wear the cameras into your life instead?",
      "score": 1,
      "created_utc": 1742834684.0,
      "replies": []
    },
    {
      "id": "mjibc9k",
      "author": "hernondo",
      "body": "What actual problem is this solving?  I’m not gonna hold a button on my watch at all super weird angle so it can take a picture of something so AI can tell me what it is.  If it’s a simple front facing camera so I can video FaceTime people for a few minutes, fine.  I don’t need it for AI, at all.",
      "score": 1,
      "created_utc": 1742836365.0,
      "replies": []
    },
    {
      "id": "mjihga9",
      "author": "succubus-slayer",
      "body": "You don’t need AI to tell you it’s night time. Watched always tell you what time it is, how can AI improve it?",
      "score": 1,
      "created_utc": 1742838068.0,
      "replies": []
    },
    {
      "id": "mjihng6",
      "author": "Wonderful_Sector_657",
      "body": "That is a product I would 100% pass on. Dumb.",
      "score": 1,
      "created_utc": 1742838123.0,
      "replies": []
    },
    {
      "id": "mjio77m",
      "author": "meenu_anon",
      "body": "Gotta love how every tech company is trying to make wearables \"smarter\" when all we really want is better battery life and actual innovation?",
      "score": 1,
      "created_utc": 1742839986.0,
      "replies": []
    },
    {
      "id": "mjiqo0o",
      "author": "DoodleJake",
      "body": "Bruh they ruined my autocorrect I wouldn’t be surprised if they over engineered a clock that forgets the time.",
      "score": 1,
      "created_utc": 1742840698.0,
      "replies": []
    },
    {
      "id": "mjiu9z0",
      "author": "PosterMcPoster",
      "body": "Before you know it gov will have your ai act as your monitor and alert police when you break laws lol",
      "score": 1,
      "created_utc": 1742841753.0,
      "replies": []
    },
    {
      "id": "mjj3snt",
      "author": "AbsurdistWordist",
      "body": "So your watch is going to need to look at a clock to tell you the time!? What an era we’re living in.",
      "score": 1,
      "created_utc": 1742844506.0,
      "replies": []
    },
    {
      "id": "mjjhrmg",
      "author": "BrokkelPiloot",
      "body": "When you have a hammer everything is a nail.",
      "score": 1,
      "created_utc": 1742848477.0,
      "replies": []
    },
    {
      "id": "mjjiygn",
      "author": "linuxliaison",
      "body": "No. I don't want this. I actively refuse that this should be a thing.",
      "score": 1,
      "created_utc": 1742848812.0,
      "replies": []
    },
    {
      "id": "mjjt1jb",
      "author": "rolfraikou",
      "body": "My daily tech eye roll has arrived.\n\nOr as I like to say: Oh look, another product made just to appeal to shareholders!",
      "score": 1,
      "created_utc": 1742851812.0,
      "replies": []
    },
    {
      "id": "mjjxk64",
      "author": "kUdtiHaEX",
      "body": "No one cares about that.",
      "score": 1,
      "created_utc": 1742853232.0,
      "replies": []
    },
    {
      "id": "mjke3y7",
      "author": "Supermkcay",
      "body": "Interesting",
      "score": 1,
      "created_utc": 1742858454.0,
      "replies": []
    },
    {
      "id": "mjkenaa",
      "author": "enginma",
      "body": "Stopped making iPod completely, can't give watches a reasonable battery life, but let's pile on extra workload into it so it can't last 10 hours.",
      "score": 1,
      "created_utc": 1742858626.0,
      "replies": []
    },
    {
      "id": "mjkkipd",
      "author": "MixSaffron",
      "body": "Using a watch to tell time through AI and cameras....a fucking sun dial?!\n\nThis is so dumb.",
      "score": 1,
      "created_utc": 1742860347.0,
      "replies": []
    },
    {
      "id": "mjktfwd",
      "author": "Electricbutthair",
      "body": "Good god please enough with the AI. No one cares, they are so out of touch.",
      "score": 1,
      "created_utc": 1742863426.0,
      "replies": []
    },
    {
      "id": "mjl2bpx",
      "author": "foundmonster",
      "body": "Humane ai pin failed.",
      "score": 1,
      "created_utc": 1742866528.0,
      "replies": []
    },
    {
      "id": "mjl388t",
      "author": "TyrusX",
      "body": "No f***ing no",
      "score": 1,
      "created_utc": 1742866848.0,
      "replies": []
    },
    {
      "id": "mjl4mz8",
      "author": "MagicOrpheus310",
      "body": "r/applesucks",
      "score": 1,
      "created_utc": 1742867341.0,
      "replies": []
    },
    {
      "id": "mjl8bax",
      "author": "clemontdechamfluery",
      "body": "I can’t tell if people really think Apple  is considering telling time with a camera and AI or they all just forgot the /s in their responses. \n\nMaybe if the headline read, “ Company contemplates packing time telling device with cameras and AI.” it wouldn’t be confusing to everyone.",
      "score": 1,
      "created_utc": 1742868652.0,
      "replies": []
    },
    {
      "id": "mjlhsfi",
      "author": "PeterDTown",
      "body": "As an owner of an iPhone 16 Pro Max, please allow me to say: bull fucking shit, Apple. Along with a side of fuck you.",
      "score": 1,
      "created_utc": 1742872261.0,
      "replies": []
    },
    {
      "id": "mjloa92",
      "author": "_no_usernames_avail",
      "body": "Need next gen battery tech with much denser capacity.",
      "score": 1,
      "created_utc": 1742875048.0,
      "replies": []
    },
    {
      "id": "mjlp17u",
      "author": "ScaryfatkidGT",
      "body": "🤢🤢🤢🤢",
      "score": 1,
      "created_utc": 1742875392.0,
      "replies": []
    },
    {
      "id": "mjltkx9",
      "author": "tacosforpresident",
      "body": "Will be great to see in 2030 …or 2032. Maybe 2035…",
      "score": 1,
      "created_utc": 1742877583.0,
      "replies": []
    },
    {
      "id": "mjlu6ah",
      "author": "bagelwholedonutwhole",
      "body": "Everyone is a zombie",
      "score": 1,
      "created_utc": 1742877882.0,
      "replies": []
    },
    {
      "id": "mjlwhuc",
      "author": "pawsomedogs",
      "body": "So having AI take a look at the day and calculate the time is better than just showing the actual time??",
      "score": 1,
      "created_utc": 1742879099.0,
      "replies": []
    },
    {
      "id": "mjm2ug7",
      "author": "DrBhu",
      "body": "Great, now the only thing they need is a working ai",
      "score": 1,
      "created_utc": 1742882772.0,
      "replies": []
    },
    {
      "id": "mjma5no",
      "author": "SachemsAusGruendems",
      "body": "“Sorry, I’m having trouble understanding right now.” Siri – 2025",
      "score": 1,
      "created_utc": 1742887481.0,
      "replies": []
    },
    {
      "id": "mjmrv47",
      "author": "xxxkillahxxx",
      "body": "It can’t get voice-to-text right. Let’s start there, Siri.",
      "score": 1,
      "created_utc": 1742898980.0,
      "replies": []
    },
    {
      "id": "mjmuyo6",
      "author": "None",
      "body": "I fucking hate “AI”",
      "score": 1,
      "created_utc": 1742900643.0,
      "replies": [
        {
          "id": "mjmxsbj",
          "author": "spishackman",
          "body": "More like “a spy”, am I right? This is all strong Fahrenheit 451 vibes.",
          "score": 1,
          "created_utc": 1742902038.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjmxknf",
      "author": "spishackman",
      "body": "No thanks",
      "score": 1,
      "created_utc": 1742901937.0,
      "replies": []
    },
    {
      "id": "mjn4iix",
      "author": "spartys15",
      "body": "It will happen!",
      "score": 1,
      "created_utc": 1742905023.0,
      "replies": []
    },
    {
      "id": "mjnfooh",
      "author": "Worldly-Corgi-1624",
      "body": "Let me know when Siri can divine my request to add milk to my grocery list first. \n\n[Simpsons: Newton](https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1hgpD8.img?w=800&h=415&q=60&m=2&f=jpg)",
      "score": 1,
      "created_utc": 1742909258.0,
      "replies": []
    },
    {
      "id": "mjno9e7",
      "author": "simonscott",
      "body": "Apple intelligence is a literal embarrassment; please don’t add it to anything else.",
      "score": 1,
      "created_utc": 1742912082.0,
      "replies": []
    },
    {
      "id": "mjnvyhd",
      "author": "bindermichi",
      "body": "Yeah, even more useless features that don‘t work",
      "score": 1,
      "created_utc": 1742914469.0,
      "replies": []
    },
    {
      "id": "mjnwb3v",
      "author": "o-rka",
      "body": "What happens when you’re hiking and you don’t have service?",
      "score": 1,
      "created_utc": 1742914574.0,
      "replies": []
    },
    {
      "id": "mjo4027",
      "author": "gtzpower",
      "body": "“Hey Siri, Turn off all of the lights.”  “Now playing WAP Explicit Edition in Samanthas Room…”",
      "score": 1,
      "created_utc": 1742916880.0,
      "replies": []
    },
    {
      "id": "mjod3kf",
      "author": "Samwyzh",
      "body": "If they implement this I will do with it what I did with Apple Intelligence on every device I own, turn it off and never use it.\n\nUntil they can demonstrate it is safe to use and that my data isn’t being harvested without my knowledge or my benefit (pay me for my data), I won’t use it.\n\nIf it makes Siri a better personal assistant that’s great. The data has to be stored locally/to my apple account and cannot be accessed without legal permission.",
      "score": 1,
      "created_utc": 1742919560.0,
      "replies": []
    },
    {
      "id": "mk9l4wx",
      "author": "LeadPrevenger",
      "body": "That’s been the idea since the inception of the smart phone and Apple Watch. ",
      "score": 1,
      "created_utc": 1743201811.0,
      "replies": []
    },
    {
      "id": "mjggqqm",
      "author": "PraetorianAE",
      "body": "Ok, I wont be buying one. Not interested in more cameras looking at my world.",
      "score": 1,
      "created_utc": 1742812818.0,
      "replies": []
    },
    {
      "id": "mjgwwbm",
      "author": "bonerb0ys",
      "body": "I really want AI to fun on my home laptop/desktop an be accessible anywhere. Just give me a folder i can dump all my docs/music/ebooks/diary etc. that i ca access from anything im signed into.",
      "score": 0,
      "created_utc": 1742820437.0,
      "replies": []
    },
    {
      "id": "mjgsk0h",
      "author": "Orangesteel",
      "body": "Everyone else’s fault. No accountability. No decency. Do not normalise this behaviour.",
      "score": -1,
      "created_utc": 1742818635.0,
      "replies": []
    },
    {
      "id": "mjgjndc",
      "author": "tgreenhaw",
      "body": "I tried Meta RayBans about 6 months ago. Having an AI always there to answer my questions is HUGE. I use it dozens of times a day and have cut googling for things more than half. Wearable AI is without any doubt the future. Anyone who disagrees hasn’t really used it or wears tinfoil hats.",
      "score": -7,
      "created_utc": 1742814397.0,
      "replies": [
        {
          "id": "mjgke5p",
          "author": "semanticmemory",
          "body": "+1, mine have been very useful also. But it also depends on the quality of the AI. Meta AI has actually been pretty good for me relative to the google ones I have used, at least (I haven’t used apple intelligence a lot so I don’t know how good it is).",
          "score": -1,
          "created_utc": 1742814788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mjm20dt",
      "author": "benberbanke",
      "body": "From the company that gave you Siri…and never improved her features",
      "score": 0,
      "created_utc": 1742882259.0,
      "replies": []
    },
    {
      "id": "mjgl44a",
      "author": "MarinatedPickachu",
      "body": "![gif](giphy|CoZR5jasUDp3q)",
      "score": -3,
      "created_utc": 1742815160.0,
      "replies": []
    },
    {
      "id": "mjgpnhv",
      "author": "trn-",
      "body": "Tim Apple, I think its time for you to say bye bye and retire, you’ve done enough harm already.",
      "score": -3,
      "created_utc": 1742817344.0,
      "replies": []
    }
  ]
}