{
  "post": {
    "title": "Robot that watched surgery videos performs with skill of human doctor",
    "author": "diacewrb",
    "id": "1gpw6jx",
    "score": 1322,
    "created_utc": 1731447273.0,
    "selftext": "",
    "num_comments": 112,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gpw6jx/robot_that_watched_surgery_videos_performs_with/"
  },
  "comments": [
    {
      "id": "lwtnnhd",
      "author": "Pocok5",
      "body": "Damn, they automated the youtube armchair experts out of their hobby.",
      "score": 287,
      "created_utc": 1731450875.0,
      "replies": [
        {
          "id": "lwts266",
          "author": "Cosmonaut_Cockswing",
          "body": "Now I truly have nothing left!",
          "score": 50,
          "created_utc": 1731452323.0,
          "replies": [
            {
              "id": "lww983d",
              "author": "MonolithicShapes",
              "body": "![gif](giphy|a93jwI0wkWTQs)",
              "score": 3,
              "created_utc": 1731492714.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwubc9e",
      "author": "SignificantError8929",
      "body": "Now wait until the robot watches the thousands of hours of unintentional asmr doctor exam videos…",
      "score": 99,
      "created_utc": 1731459058.0,
      "replies": [
        {
          "id": "lwvamlq",
          "author": "tempnew",
          "body": "The bot isn't sitting in a room scrolling through YouTube lmao. The training data is carefully curated and prepared.",
          "score": 35,
          "created_utc": 1731472245.0,
          "replies": [
            {
              "id": "lwvv80i",
              "author": "Lint_baby_uvulla",
              "body": "So, Junior Mints were never included in the LLM training? \n\nBold claim if true.",
              "score": 15,
              "created_utc": 1731483268.0,
              "replies": [
                {
                  "id": "lwvvvhz",
                  "author": "tempnew",
                  "body": "Well that would be a grave omission indeed",
                  "score": 5,
                  "created_utc": 1731483683.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwy1win",
              "author": "Miguel-odon",
              "body": ">  The training data is carefully curated and prepared.\n\nFor now",
              "score": 1,
              "created_utc": 1731518345.0,
              "replies": [
                {
                  "id": "lwya3vw",
                  "author": "tempnew",
                  "body": "It wouldn't be very useful if it wasn't. If you train it on the average YouTube video, it'll have the surgical expertise of the average person",
                  "score": 3,
                  "created_utc": 1731520825.0,
                  "replies": [
                    {
                      "id": "lx7es0p",
                      "author": "VagueSomething",
                      "body": "Plenty of modern attempts for AI/bots and such have used poorly filtered data. It is clear by now that technicians behind these kinds of experiments aren't always universally smart so not assuming they'd do the right thing is usually a sound assumption.",
                      "score": 1,
                      "created_utc": 1731642104.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwttksn",
      "author": "wheetcracker",
      "body": "wake me up when it does surgery on a grape",
      "score": 56,
      "created_utc": 1731452840.0,
      "replies": [
        {
          "id": "lwuj2yv",
          "author": "Pkittens",
          "body": "Good morning",
          "score": 27,
          "created_utc": 1731461810.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lww5u69",
      "author": "Mysterious-Kale-948",
      "body": "Can’t wait till I can get lasik surgery from a vending machine",
      "score": 11,
      "created_utc": 1731490414.0,
      "replies": [
        {
          "id": "lwxcmrt",
          "author": "mattmaster68",
          "body": "Stopping at the doctor on the way home to/from work is as easy as waiting 5 minutes for an available AI healthcare booth every few blocks lol\n\n“Hey, I can’t come in today I sprained my ankle. Can somebody cover my shift?”\n\n“No. Stop at a medical diagnosis booth on the way here. If it says you sprained your ankle, our HR AI will give you the week off. Otherwise, it’s termination.”\n\nLmao bringing in an AI doctor’s note to your job’s HR AI",
          "score": 5,
          "created_utc": 1731510470.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwte8xt",
      "author": "kilkonie",
      "body": "...until it doesn't.",
      "score": 138,
      "created_utc": 1731447931.0,
      "replies": [
        {
          "id": "lwtijm5",
          "author": "Im-a-magpie",
          "body": "Much like a human surgeon",
          "score": 128,
          "created_utc": 1731449243.0,
          "replies": [
            {
              "id": "lwubiuc",
              "author": "ABob71",
              "body": "[In Japan, Heart Surgeon. Number 1.](https://m.youtube.com/watch?v=2wcI10CNuxU)",
              "score": 38,
              "created_utc": 1731459122.0,
              "replies": [
                {
                  "id": "lww0if6",
                  "author": "RehAdventures",
                  "body": "In the remake of the office if he’s a robot that would be interesting.",
                  "score": 1,
                  "created_utc": 1731486751.0,
                  "replies": []
                },
                {
                  "id": "lwzxs2w",
                  "author": "GuerrillaRodeo",
                  "body": "I've always found this scene to be ultra funny, mainly because the top heart surgeon in Japan apparently didn't speak one word of English before coming to the US.\n\n[Most medical journals are written in English.](https://pmc.ncbi.nlm.nih.gov/articles/PMC9079353/)",
                  "score": 1,
                  "created_utc": 1731539188.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwtrg5h",
              "author": "clueless_as_fuck",
              "body": "![gif](giphy|hwTMDJpX8YywaMIIkQ)",
              "score": 10,
              "created_utc": 1731452119.0,
              "replies": []
            },
            {
              "id": "lwvkgrd",
              "author": "cutelyaware",
              "body": "However *unlike* a human surgeon, if it makes a mistake, its software gets fixed along with that of all the other robot surgeons.",
              "score": 6,
              "created_utc": 1731476939.0,
              "replies": [
                {
                  "id": "lwvvbzj",
                  "author": "Lint_baby_uvulla",
                  "body": "Human surgeons get fixed with alcohol, cocaine, and a judicious affirmation of the god complex.",
                  "score": 23,
                  "created_utc": 1731483338.0,
                  "replies": [
                    {
                      "id": "lwwexoo",
                      "author": "crimsonhues",
                      "body": "Haven’t come across one that snorts. But God complex, yes, plenty of them",
                      "score": 1,
                      "created_utc": 1731496316.0,
                      "replies": [
                        {
                          "id": "lwx46no",
                          "author": "Lint_baby_uvulla",
                          "body": "[Ice-ecstasy-magic-mushrooms-cannabis-doctor](https://www.9news.com.au/videos/gold-coast-doctor-faces-court-on-drug-charges/cjxlotkvs002m0go1w54eet6c)\n\nAnd there’s a cardiologist in QLD facing multiple charges for possession, supply, and much more.  \n\nBoth ~~were~~ treating my dad.  \n\nAnd I knew 2 ortho surgeons who were heavy ice users.\n\nIt shouldn’t be surprising, from observation I’ve seen a quite a few pick up the habit while studying, and then ….  a promising and lucrative career down the toilet.",
                          "score": 2,
                          "created_utc": 1731507529.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwx8rvw",
                  "author": "Expensive-Apricot459",
                  "body": "That would be amazing if every human body had the same anatomy.",
                  "score": 2,
                  "created_utc": 1731509163.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwwhhuy",
          "author": "jonathanrdt",
          "body": "Everything in medicine is probabilistic. Once the software is statistically better than a doctor or medical team, it will do more of the work, and the overall outcomes will improve.",
          "score": 7,
          "created_utc": 1731497782.0,
          "replies": []
        },
        {
          "id": "lwur9d4",
          "author": "Confident-Pace4314",
          "body": "Better than a human and it won't get drunk or mark it's initials on your ovaries",
          "score": 25,
          "created_utc": 1731464728.0,
          "replies": [
            {
              "id": "lwvl7bj",
              "author": "radikalkarrot",
              "body": "Wait until you see your ovaries with the Intel Inside logo",
              "score": 19,
              "created_utc": 1731477331.0,
              "replies": [
                {
                  "id": "lwvob7k",
                  "author": "RichardNyxn",
                  "body": "Oh shit, are you going to have a 4060 powering that?",
                  "score": 2,
                  "created_utc": 1731479054.0,
                  "replies": []
                },
                {
                  "id": "lww6vih",
                  "author": "kairos",
                  "body": "Wait until you have to pay Intel a monthly subscription so you can use said ovaries.",
                  "score": 0,
                  "created_utc": 1731491135.0,
                  "replies": [
                    {
                      "id": "lwwai9z",
                      "author": "radikalkarrot",
                      "body": "I’m more worried about heating issues, knowing intel it wouldn’t be much of a surprise",
                      "score": 1,
                      "created_utc": 1731493555.0,
                      "replies": [
                        {
                          "id": "lwxdawq",
                          "author": "dandroid126",
                          "body": "It's randomly going to overvolt itself and cause reboots.",
                          "score": 1,
                          "created_utc": 1731510692.0,
                          "replies": [
                            {
                              "id": "lwxe53n",
                              "author": "radikalkarrot",
                              "body": "Once a month at least",
                              "score": 1,
                              "created_utc": 1731510968.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwvbaq7",
          "author": "tempnew",
          "body": "Robots are already used in many surgeries for tasks that require precision. They reduce damage and healing time",
          "score": 14,
          "created_utc": 1731472545.0,
          "replies": [
            {
              "id": "lwx1xmk",
              "author": "StaysAwakeAllWeek",
              "body": "Those robots you're talking about are controlled by human surgeons. They are not automated",
              "score": 2,
              "created_utc": 1731506696.0,
              "replies": [
                {
                  "id": "lx1acaa",
                  "author": "tempnew",
                  "body": "There's different levels of control. There's \"drill to this depth at this location\" vs \"suture this wound\". The latter is definitely more automated, but it's a spectrum, not a binary distinction. On the far end of the spectrum, it's a robot performing the entire surgery, with a human only intervening if needed.",
                  "score": 2,
                  "created_utc": 1731556730.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwvbyfi",
          "author": "SubstantialEgo",
          "body": "Just like a human ? Robots would be better for this, no human error\n\n\nWhy do people like you think humans are better at everything than robots when an actuality it’s the other way around",
          "score": 1,
          "created_utc": 1731472839.0,
          "replies": [
            {
              "id": "lwx935u",
              "author": "Expensive-Apricot459",
              "body": "I love when people who don’t understand medicine or AI argue about AI in medicine. \n\nAre you under the impression that every human body is exactly the same? Maybe you’re under the impression that robots self program?",
              "score": 5,
              "created_utc": 1731509269.0,
              "replies": [
                {
                  "id": "lwya4e5",
                  "author": "daveypageviews",
                  "body": "Exactly…I don’t envision a future where this takes off in our lifetime. Too much variability in anatomy to replace the human factor.",
                  "score": 2,
                  "created_utc": 1731520830.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwx22sw",
              "author": "StaysAwakeAllWeek",
              "body": "The problem is the legal and societal fallout from a surgery robot accidentally killing someone is far worse than for a human. They have to be many many times safer to be accepted. The self driving car industry has already run into this problem. Every time a Tesla or a Waymo has an issue it makes the news and hurts public opinion about them, and it doesn't even matter if they are already safer or not, the damage is done all the same",
              "score": 0,
              "created_utc": 1731506749.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwv9zxa",
          "author": "party_tortoise",
          "body": "While mathematically true, this doesn’t seem right. Surgeons make mistakes, but not all of them share that statistics. Plenty of surgeons went about their lives with absolutely zero defects whatsoever. Would you trade this for a machine that has universal chance of failure since they are literally molded from the same production/model?",
          "score": -5,
          "created_utc": 1731471968.0,
          "replies": [
            {
              "id": "lwvc1od",
              "author": "SubstantialEgo",
              "body": "Your comment makes no sense\n\nRobots would have a far higher success rate than human surgeons because they quite literally cannot make mistakes, or if they do, it would be way less often",
              "score": 2,
              "created_utc": 1731472880.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwthicy",
      "author": "ArchonTheta",
      "body": "Let’s see it compensate for something that goes wrong.",
      "score": 32,
      "created_utc": 1731448921.0,
      "replies": [
        {
          "id": "lwtwr5t",
          "author": "NancyPelosisRedCoat",
          "body": "> “We find that even with a few hundred demos, the model is able to learn the procedure and generalize new environments it hasn’t encountered.”\n\n> Added Krieger: “The model is so good learning things we haven’t taught it. Like if it drops the needle, it will automatically pick it up and continue. This isn’t something I taught it do.”\n\n> The model could be used to quickly train a robot to perform any type of surgical procedure, the researchers said. The team is now using imitation learning to train a robot to perform not just small surgical tasks but a full surgery.\nBefore this advancement, programming a robot to perform even a simple aspect of a surgery required hand-coding every step. Someone might spend a decade trying to model suturing, Krieger said. And that’s suturing for just one type of surgery.\n\nI wonder how good it can recover from things going wrong. Picking up the needle by itself is impressive, but could it also recover from puncturing an artery or something as well… It is still pretty cool though.",
          "score": 37,
          "created_utc": 1731453945.0,
          "replies": [
            {
              "id": "lwuvr4q",
              "author": "Thanks_ButNoThanks",
              "body": "Is that Dr. Krieger from Archer? This could go very very bad",
              "score": 10,
              "created_utc": 1731466336.0,
              "replies": []
            },
            {
              "id": "lwulp64",
              "author": "evho3g8",
              "body": "I imagine a human doctor would still be standing by.",
              "score": 8,
              "created_utc": 1731462736.0,
              "replies": [
                {
                  "id": "lwv0bkc",
                  "author": "nitrodmr",
                  "body": "I think surgeons will continue doing their work. I think robots will assist in the smaller and less crucial stuff.",
                  "score": 4,
                  "created_utc": 1731468014.0,
                  "replies": [
                    {
                      "id": "lwvwz8q",
                      "author": "aksdb",
                      "body": "A conceptual problem nowever is, that we will get more and more robots and then less and less surgeons. First, because hospitals will not pay for both. But more important: if most procedures (or even just specific procedures) are mostly handled by robots under supervision, how would new surgeons be trained? After a while we would have few surgeons and most of them don't have realworld experience. So if anything goes wrong, they can't even really jump in anymore.",
                      "score": 8,
                      "created_utc": 1731484394.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwtx96l",
              "author": "ArchonTheta",
              "body": "Thanks tips. I’m not talking about dropping a needle. I’m talking about the patient having complications or it hits an artery, etc. they’ll need to make sure it can compensate for these variables",
              "score": 12,
              "created_utc": 1731454119.0,
              "replies": [
                {
                  "id": "lwub7gw",
                  "author": "rewirez5940",
                  "body": "As soon as that blood hits the robots camera all bets are off.",
                  "score": 12,
                  "created_utc": 1731459011.0,
                  "replies": [
                    {
                      "id": "lwubwbv",
                      "author": "ihatepickingnames_",
                      "body": "That’s what nurse robots are for. Clean camera, stat!",
                      "score": 15,
                      "created_utc": 1731459255.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwtxu3b",
                  "author": "NancyPelosisRedCoat",
                  "body": "I was just editing my comment to add pretty much the same comment.",
                  "score": 7,
                  "created_utc": 1731454325.0,
                  "replies": []
                },
                {
                  "id": "lwvaurj",
                  "author": "tempnew",
                  "body": "That isn't what it's trained for yet. This is to perform specific tasks not replace a surgeon",
                  "score": 2,
                  "created_utc": 1731472348.0,
                  "replies": [
                    {
                      "id": "lwvb5iz",
                      "author": "ArchonTheta",
                      "body": "For now",
                      "score": 1,
                      "created_utc": 1731472482.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwtjrdf",
          "author": "Petrichordates",
          "body": "I don't expect it can in the 1st iteration of this technology. With more videos though, it obviously will be able to.",
          "score": 11,
          "created_utc": 1731449628.0,
          "replies": [
            {
              "id": "lwtupma",
              "author": "JukePlz",
              "body": "I think it's more accurate to say it can be trained for anything in the data it's feed. But even with a million videos, if none of those includes the specific mistake or unexpected problem, the robot won't be able to learn to recover from it.\n\nRecovering from a suture point moving to an unexpected spot is one thing, because all it has to do to recover is just find the string again and perform the same operation it was performing in the first place, but suppose something happens like a foreign object falls in, an object that was never in the training data. Does the robot know it has to remove it from the patient? Can it distinguish it's a sponge/piece of the ceiling/insect/broken instrumental that has to be picked up or thrown out, and tell it apart from something like a tumoral growth that it must not touch?\n\nThere are probably solutions to training for these, but it's quite more complex than just \"make it watch more videos\". AI can imitate humans, but unless we finally develop AGI, the AI will be limited in understanding based on it's training, and not be able to handle complex creative situations a human could device on the spot.\n\nThe good thing is that these types of robots don't need to be completely perfect to be useful, and can be implemented in low-risk surgeries with human supervision, while the technology continues to be perfected.",
              "score": 8,
              "created_utc": 1731453232.0,
              "replies": [
                {
                  "id": "lwur0c6",
                  "author": "Crazy_Passage_8553",
                  "body": "Emergent learning will happen more. It wasn’t trained to pick up the dropped needle, but rather learned on its own. Give it a few years and I bet it could recover from errors even doctors haven’t seen, with absolute precision.",
                  "score": 1,
                  "created_utc": 1731464639.0,
                  "replies": [
                    {
                      "id": "lwx9d5e",
                      "author": "Expensive-Apricot459",
                      "body": "We can’t get a car to drive down a street by itself without issues but you think a robot will figure out how to do something infinitely more complex?",
                      "score": 2,
                      "created_utc": 1731509364.0,
                      "replies": [
                        {
                          "id": "lwxhaqo",
                          "author": "Crazy_Passage_8553",
                          "body": "Well, cars can and do drive themselves now, so that statement is incorrect. With AI, the learning curve gets exponentially easier and faster. I’m old enough to have seen the internet and the skeptics back then said similar things. Give it time.",
                          "score": 1,
                          "created_utc": 1731511989.0,
                          "replies": [
                            {
                              "id": "lwxpgcs",
                              "author": "Expensive-Apricot459",
                              "body": "Yes. They “drive themselves”. \n\nPut your money where your mouth is and get into a Tesla blindfolded with an address across the country. That’s a whole lot less complicated than surgery.\n\nI’m old enough and educated enough in medicine to know that if robots are doing surgery without assistance, none of you will have jobs and won’t be able to afford it",
                              "score": 1,
                              "created_utc": 1731514545.0,
                              "replies": [
                                {
                                  "id": "lwxra4x",
                                  "author": "Crazy_Passage_8553",
                                  "body": "Your aggressiveness in a completely benign conversation says otherwise about your age. If you don’t believe AI and robots can do surgery in the future, cool. No sweat off my back what you think. There’s a reality coming that you sound very unaware of. Good luck in the next decade friend.",
                                  "score": 0,
                                  "created_utc": 1731515114.0,
                                  "replies": [
                                    {
                                      "id": "lwy4lul",
                                      "author": "Expensive-Apricot459",
                                      "body": "Feel free to check back in with me in 10 years. \n\nI’m sure you have some sort of expertise beyond Reddit armchair to speculate. Are you an AI engineer or physician? Maybe you’re both?",
                                      "score": 1,
                                      "created_utc": 1731519165.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lwv47x3",
                  "author": "Coders_REACT_To_JS",
                  "body": "In that specific example you would likely be able to train a model that can generalize well enough to be able to remove it. We don’t have any papers linked here (that I saw) so there isn’t a way for us to know what their metrics or methodology looks like. We are just guessing. However, dumbing this problem down to only a classification task, I’d find it surprising if the researchers weren’t able to obtain high accuracy on detecting foreign objects.",
                  "score": 0,
                  "created_utc": 1731469544.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwtlxem",
          "author": "gdycdffxd",
          "body": "Like what dropping the needle, like being poked with a screwdriver like in the 30 second video. Why do you comment if you didn’t read the article or saw the one minute videos with the article …",
          "score": 1,
          "created_utc": 1731450319.0,
          "replies": [
            {
              "id": "lwtwq3p",
              "author": "ArchonTheta",
              "body": "Are ya new? It’s a general comment. And I did see the fucking video",
              "score": -5,
              "created_utc": 1731453934.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwwyzk9",
      "author": "Temporary-Sea-4782",
      "body": "This has to be the future. The delivery system of medicine is too expensive and bloated. Only way forward is to automate.\n\nMaybe we have a future where households have their own med bots?",
      "score": 5,
      "created_utc": 1731505583.0,
      "replies": [
        {
          "id": "lx380jq",
          "author": "blueB0wser",
          "body": "That's certainly a take. I'd argue that insurance companies are driving up medical costs first, but sure.",
          "score": 1,
          "created_utc": 1731593803.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwv0red",
      "author": "ChefOig",
      "body": "Great now the surgeon and all the residents can sit in the break room and do nothing. \n\nGreat now I’m going to have a robotic surgeon yelling “shut the fuck up” \n\nGreat now I get to yell at something that doesn’t get offended when I talk back. \n\nGreat now my room is going to have faster turn overs meaning more add ons.\n\nGreat another thing in a OR with 0 personality. \n\nGreat now even robots suck at gyn surgery. \n\nGreat now i get to hear about this robots tax bracket. \n\nGreat can do surgery but can’t turn over a room. \n\nGreat I get a rep telling me how to do my job with a screaming surgeon and a AI trained robot. \n\nGreat now the rep and surgeon can kiss each other while the surgery still moves on. \n\nGreat ortho surgeons look like real surgeons now. \n\nGreat millions more money spent on something that we will only use every once in awhile because the set up is longer than the whole surgery. \n\nGreat new attending will know much much less\n\nGreat now the surgeon doesn’t even have to scrub in at all and can actually fall asleep at the console rather than the other way around. \n\nGreat another reason why the staff won’t get raises or bonies that year. \n\nGreat another piece of equipment that we will have to figure out where to put in a OR that has robots everywhere / get out of a room for a trauma. \n\nGreat another provider not updating a family during a 12 hour surgery. \n\nGreat idea yall!",
      "score": 16,
      "created_utc": 1731468183.0,
      "replies": [
        {
          "id": "lwx9n3u",
          "author": "None",
          "body": "[removed]",
          "score": 5,
          "created_utc": 1731509459.0,
          "replies": [
            {
              "id": "lwxaamr",
              "author": "ChefOig",
              "body": "Just because you’re a surgeon / doctor doesn’t mean you’re good. Sorry salty doc.",
              "score": -3,
              "created_utc": 1731509681.0,
              "replies": [
                {
                  "id": "lwxak92",
                  "author": "None",
                  "body": "[removed]",
                  "score": 3,
                  "created_utc": 1731509772.0,
                  "replies": [
                    {
                      "id": "lwxcff0",
                      "author": "ChefOig",
                      "body": "You’re to out of touch with a patients being people  to do that so sure I would. \n\nI’d rather leave my job at the hospital clock out and take my pay check than take it home with me and have my family hate me which sounds like something that’ll happen to you. \n\nSounds like a nurse is making your life hell. Good, exactly what they should be doing. When you’re done with your residency hopefully you’ll learn. \n\nI won’t generalize on surgeons cause unlike you (who judging by your posting history is a resident and I know where you work. ) I’ve met surgeons who appreciate their nurses and OR staff. I’ve worked all over the country with some of the best and I promise if you said that to my face they would back up my response up 100%.",
                      "score": -4,
                      "created_utc": 1731510401.0,
                      "replies": [
                        {
                          "id": "lwxdojg",
                          "author": "Expensive-Apricot459",
                          "body": "Awww, the widdle nurse is so upset that they were told their place.\n\nRemember, there’s a reason nursing schools don’t require actual science courses and why nurses can’t even let the  patients drink water without an order. No one trusts a nurse’s decision making ability.",
                          "score": 5,
                          "created_utc": 1731510818.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwvvamv",
          "author": "None",
          "body": "[removed]",
          "score": 3,
          "created_utc": 1731483315.0,
          "replies": [
            {
              "id": "lwx7iuj",
              "author": "ChefOig",
              "body": "Angry OR workers unite!!!!!! 😂",
              "score": 2,
              "created_utc": 1731508728.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwtw7uq",
      "author": "OnlyFreshBrine",
      "body": "give me another space beer, Gleep-Glop",
      "score": 4,
      "created_utc": 1731453754.0,
      "replies": []
    },
    {
      "id": "lww2b15",
      "author": "NeoTechni",
      "body": "We can't even get AI to accurately draw hands, which is much easier than doing surgery on them. I absolutely would not trust this.",
      "score": 4,
      "created_utc": 1731487990.0,
      "replies": [
        {
          "id": "lwwt1cf",
          "author": "None",
          "body": "We absolutely can. Have you seen what Midjourney 5 can do? Perfect ai gen pics.",
          "score": 2,
          "created_utc": 1731503226.0,
          "replies": []
        },
        {
          "id": "lwzo98m",
          "author": "Mrehalo",
          "body": "It has been able to for a little while now tho",
          "score": 1,
          "created_utc": 1731536067.0,
          "replies": []
        },
        {
          "id": "lwwffp5",
          "author": "vectaskdotpy",
          "body": "it’s different.",
          "score": -2,
          "created_utc": 1731496613.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwvvom8",
      "author": "Topwix_MD",
      "body": "I remember seeing work like this around a robotics summit earlier this year. Skin closure is perhaps the most basic skill in surgery (save for retraction) with very little in way of variance. Most robotic procedures don’t perform closure robotically either. Would be interesting to see if the model could perform laparoscopic anastomosis or something a little more complex before it becomes more convincing that a fully automated surgery is possible in the near to medium future",
      "score": 2,
      "created_utc": 1731483561.0,
      "replies": []
    },
    {
      "id": "lx01cqc",
      "author": "GuerrillaRodeo",
      "body": ">surgery\n\nlol\n\nThe video in the article shows a robot suturing a wound. While that alone is, admittedly, pretty impressive by itself, keep in mind that surgeons often let med students do that, and mostly unsupervised too. This is, by comparison, not a big deal compared to the actual surgery and you have perfectly well-trained medical staff around you if something really, *really* goes wrong (surgeon typing the report, anaesthesist keeping the patient sedated, nurses cleaning up instruments - all in the immediate vicinity); like if you puncture a big artery or something, and this rarely ever happens during stitching up. That's only 'surgery' in the broadest sense from a physician's point of view. It's (relatively) trivial, even a decades-long psychiatrist should be able to remember basic stitching techniques from med school.\n\nPoint is: The robot has been taught the most basic surgical task. It's a first step and it looks promising, but there's still a LONG way to go before I would even trust it with just removing my gall bladder (already a rather trivial task for visceral surgeons).",
      "score": 2,
      "created_utc": 1731540423.0,
      "replies": []
    },
    {
      "id": "lx188vd",
      "author": "ManEEEFaces",
      "body": "I genuinely don’t believe this. FAR too many variables in a human body.\n\nAlso - it’s just a program?",
      "score": 2,
      "created_utc": 1731555884.0,
      "replies": []
    },
    {
      "id": "lwuajq6",
      "author": "pcm2a",
      "body": "How long until we get Snip Snip?",
      "score": 2,
      "created_utc": 1731458780.0,
      "replies": []
    },
    {
      "id": "lwuy4vn",
      "author": "5043090",
      "body": "This will play just fine, I’m sure.",
      "score": 2,
      "created_utc": 1731467190.0,
      "replies": []
    },
    {
      "id": "lwvfrwr",
      "author": "AndreasDasos",
      "body": "At certain basic component tasks, yes. \n\n> The team… used imitation learning to train the da Vinci Surgical System robot to perform three fundamental tasks required in surgical procedures: manipulating a needle, lifting body tissue, and suturing\n\nIn fairness sewing machines had ‘sewing’ down some time over a century ago, so the last is similar to that but with human tissue... \n\nNot to be dismissive. Far more is coming. But the title is misleading.",
      "score": 2,
      "created_utc": 1731474608.0,
      "replies": [
        {
          "id": "lwvq7l2",
          "author": "pt-guzzardo",
          "body": "I guess you could use a sewing machine if you want to remove your skin and lay it flat first, but that *might* introduce a few complications.",
          "score": 2,
          "created_utc": 1731480157.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwwpt6h",
      "author": "jack27nikkkk",
      "body": "Watched🤨🤨",
      "score": 1,
      "created_utc": 1731501845.0,
      "replies": []
    },
    {
      "id": "lwx1isy",
      "author": "MikeDWasmer",
      "body": "Eventually there will be articles about how humans perform surgery with robot like skill… if there’s still news media left.",
      "score": 1,
      "created_utc": 1731506541.0,
      "replies": []
    },
    {
      "id": "lwx4ht3",
      "author": "Meats_Hurricane",
      "body": "PhD in philosophy",
      "score": 1,
      "created_utc": 1731507641.0,
      "replies": []
    },
    {
      "id": "lwzvv4r",
      "author": "GuerrillaRodeo",
      "body": "Performing surgery by their own is still a long way off for robots. But it might eventually come, the idea isn't bad per se. After all, med students do the same - observe and learn.\n\nJust the other day I read an article about a seven-jointed robot arm that was shown how to clean a particular section of a sink, then it extrapolated the knowledge it gained from simply *observing* that task and cleaned the entire sink by itself.\n\nThis might actually be a good use case for AI. Still a long way to go (I'm talking several decades) but I'm fairly convinced we'll eventually have a fully functional [Autodoc](https://tvtropes.org/pmwiki/pmwiki.php/Main/Autodoc).",
      "score": 1,
      "created_utc": 1731538542.0,
      "replies": []
    },
    {
      "id": "lx1flzo",
      "author": "AtomicSymphonic_2nd",
      "body": "If this is consistently true, then there is truly no profession on this planet that is “safe” from automation.\n\nMedicine was the last place, given how much of it is “art” more than science, at least in terms of surgery.",
      "score": 1,
      "created_utc": 1731559024.0,
      "replies": []
    },
    {
      "id": "lx2n3wm",
      "author": "HeloGurlFvckPutin",
      "body": "There is absolutely no F’ing way that AI powered machine can do complex surgeries -\n\n“used imitation learning to train the da Vinci Surgical System robot to perform three fundamental tasks required in surgical procedures: manipulating a needle, lifting body tissue, and suturing.”\n\nIt did stitches, not anything complex. Hell, I’m not trained but I guarantee I can do stitches without training. \n\nWhy use a multi-million dollar device to do stitches?!\n\nThis is a joke!!",
      "score": 1,
      "created_utc": 1731584928.0,
      "replies": []
    },
    {
      "id": "ly57zfm",
      "author": "Tiger__Fucker",
      "body": "Bot trained on 10,000,000 hours of hentai … we have a weird future ahead of us folks",
      "score": 1,
      "created_utc": 1732129805.0,
      "replies": []
    },
    {
      "id": "lwucm7i",
      "author": "iBeelz",
      "body": "Robot surgery! Just like in the movies!\n\n![gif](giphy|mqN7MHPj412N2)",
      "score": 1,
      "created_utc": 1731459510.0,
      "replies": []
    },
    {
      "id": "lww8mzu",
      "author": "BloodSteyn",
      "body": "Ok... cool, but what level of skilled Doc are we talking here?\n\nStraight out of Med School level or 30 Years of experience skill level? Details matter.",
      "score": 1,
      "created_utc": 1731492329.0,
      "replies": []
    },
    {
      "id": "lww9dav",
      "author": "MonolithicShapes",
      "body": "The robots will quickly learn to charge exuberant fees and deny liability at all costs",
      "score": 1,
      "created_utc": 1731492809.0,
      "replies": []
    },
    {
      "id": "lwwhdnk",
      "author": "LittleZackBackup",
      "body": "Hope it doesn’t watch Dexter.",
      "score": 1,
      "created_utc": 1731497717.0,
      "replies": []
    },
    {
      "id": "lwwm0vg",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1731500096.0,
      "replies": []
    },
    {
      "id": "lwvnkz9",
      "author": "ultimapanzer",
      "body": "01001001 00100000 01000001 01001101 00100000 01000001 00100000 01010011 01010101 01010010 01000111 01000101 01001111 01001110 00100000 01001001 00100000 01000001 01001101 00100000 01000001 00100000 01010011 01010101 01010010 01000111 01000101 01001111 01001110 00100000 01001001 00100000 01000001 01001101 00100000 01000001 00100000 01010011 01010101 01010010 01000111 01000101 01001111 01001110",
      "score": 0,
      "created_utc": 1731478645.0,
      "replies": []
    },
    {
      "id": "lwvu0cr",
      "author": "Quirky-Pie9661",
      "body": "Great now let it be POTUS",
      "score": 0,
      "created_utc": 1731482485.0,
      "replies": []
    },
    {
      "id": "lwx5sgx",
      "author": "Woodie100",
      "body": "There ya go. Teach the robot A.I. to teach itself and show it the human weaknesses while you're at it. Your future today.",
      "score": 0,
      "created_utc": 1731508111.0,
      "replies": []
    },
    {
      "id": "lwxqhin",
      "author": "None",
      "body": "Still need a doctor for when something unexpected happens. \n\nSurgery videos are a very small subset of what can happen during the surgery. I've only seen successful videos. Not videos of handling the emergencies. And a thousand things can go wrong.",
      "score": 0,
      "created_utc": 1731514866.0,
      "replies": []
    },
    {
      "id": "lwy2nr5",
      "author": "Glidepath22",
      "body": "Now watch as that robot hasn’t a clue of what to do when things go wrong",
      "score": -1,
      "created_utc": 1731518574.0,
      "replies": []
    },
    {
      "id": "lwvm90c",
      "author": "None",
      "body": "[deleted]",
      "score": -2,
      "created_utc": 1731477903.0,
      "replies": [
        {
          "id": "lwvujhd",
          "author": "assissippi",
          "body": "Jhu.edu is Johns Hopkins",
          "score": 1,
          "created_utc": 1731482830.0,
          "replies": []
        }
      ]
    }
  ]
}