{
  "post": {
    "title": "Ingenious DIY setup powers home for 8 years with over 1,000 repurposed laptop batteries | Repurposing e-waste on a sustainable power solution",
    "author": "chrisdh79",
    "id": "1hqgqla",
    "score": 3409,
    "created_utc": 1735658227.0,
    "selftext": "",
    "num_comments": 171,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hqgqla/ingenious_diy_setup_powers_home_for_8_years_with/"
  },
  "comments": [
    {
      "id": "m4p9th8",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735658227.0,
      "replies": []
    },
    {
      "id": "m4p9xx2",
      "author": "chrisdh79",
      "body": "From the article: This remarkable feat has been running successfully for an astonishing eight years without a single battery replacement, as detailed by the creator, Glubux, on the online forum Second Life Storage.\n\nThe setup is housed in a somewhat unassuming shed 50 meters (164 feet) away from the individual's residence, but its purpose is anything but ordinary. It combines old laptop batteries with solar panels to create an off-grid power supply, essentially turning a pile of e-waste into a sustainable energy solution.\n\nDespite the unconventional nature of this system, there have been no reports of fire hazards or swollen battery issues throughout its nearly decade-long operation. In fact, Glubux claims he can power his entire house from it, including the washing machine.\n\nThe project's origins can be traced back to November 2016, when the creator shared his initial plans on the forum. At the time, he had already begun producing part of his electricity needs with a modest 1.4kW solar panel array, an old 24V 460Ah forklift battery, charge controllers, and a 3kVA inverter.\n\nHowever, Glubux aimed to expand his setup by constructing a dedicated shed to house additional batteries and charge controllers/inverters. He had already amassed around 650 laptop batteries and had started sorting and assembling them into packs, each designed to hold approximately 100Ah by carefully matching the number of cells and using copper wiring for efficient connections.",
      "score": 482,
      "created_utc": 1735658271.0,
      "replies": [
        {
          "id": "m4pfplq",
          "author": "cocaine-cupcakes",
          "body": "I’m an HVDC battery engineer and this is impressive. Most laptop batteries and electric vehicle batteries are still pretty useful for stationary power despite being too degraded for EV use. He will probably get several more years out of this system but I would be curious to see how much he’s actually able to store relative to the initial capacity. \n\nThat being said, unless you really know what you’re doing you should not try to do this at home. The potential for thermal runaway is extremely high. That’s the whole reason why this person put it in a shed 50 meters from their house.",
          "score": 617,
          "created_utc": 1735660210.0,
          "replies": [
            {
              "id": "m4po778",
              "author": "badguy84",
              "body": "I was going to say: it’s impressive, but also it’s clickbaited a little bit in to a “DIY” package. Getting all these batteries set up in any sort of functional array requires quite a bit of knowledge and a ton of experience to do right and it’s super easy to get wrong. I have an electrical engineering degree, though I don’t work in that field, and I have 0 confidence in being able to pull this off reliably.",
              "score": 224,
              "created_utc": 1735662957.0,
              "replies": [
                {
                  "id": "m4pra1d",
                  "author": "skylarmt_",
                  "body": "Nah it's easy.  Put all the 18650 cells + side up on a sheet of metal, then clamp another sheet of metal on top.  The cells will balance themselves in just a few seconds, then wait for the fires to burn out and you're ready to go!",
                  "score": 171,
                  "created_utc": 1735663923.0,
                  "replies": [
                    {
                      "id": "m4prxg8",
                      "author": "mjc4y",
                      "body": "That sheet metal on top of a roaring lithium fire makes a great outdoor flat top.  \n\nPower generation AND smash burgers! \n\n(Okay, not at the same time but still)",
                      "score": 83,
                      "created_utc": 1735664128.0,
                      "replies": [
                        {
                          "id": "m4qcr14",
                          "author": "VerifiedMother",
                          "body": "Lithium fires are also known to have very safe smoke to breathe too!",
                          "score": 31,
                          "created_utc": 1735670598.0,
                          "replies": [
                            {
                              "id": "m4qfcgc",
                              "author": "daOyster",
                              "body": "Just make sure to keep a glass of water nearby in case you get thirsty from breathing in all that safe smoke.",
                              "score": 30,
                              "created_utc": 1735671421.0,
                              "replies": [
                                {
                                  "id": "m4qqy4i",
                                  "author": "mjc4y",
                                  "body": "I like the thinking!   You get to be fire chief!",
                                  "score": 12,
                                  "created_utc": 1735675170.0,
                                  "replies": [
                                    {
                                      "id": "m4uya0v",
                                      "author": "BeneGezzeret",
                                      "body": "Safety 3rd.",
                                      "score": 3,
                                      "created_utc": 1735745977.0,
                                      "replies": [
                                        {
                                          "id": "m4v27rw",
                                          "author": "mjc4y",
                                          "body": "Smokey the Bear says, \n\n“Only you can prevent (checks notes) um… says here : completely preventable lithium fires.  Is that right? Can someone please double check that?“",
                                          "score": 3,
                                          "created_utc": 1735747414.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m4vg98i",
                                          "author": "StoweNow",
                                          "body": "Safety is the danger",
                                          "score": 1,
                                          "created_utc": 1735752228.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m4rbobb",
                                  "author": "polrxpress",
                                  "body": "I like to brine my meat before putting it into the smokehouse",
                                  "score": 5,
                                  "created_utc": 1735682137.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4sxcls",
                              "author": "lewkus",
                              "body": "Also another pro tip is any excess lithium can be taken orally as an antidepressant",
                              "score": 5,
                              "created_utc": 1735704952.0,
                              "replies": [
                                {
                                  "id": "m4wyhnt",
                                  "author": "scorpyo72",
                                  "body": "No need to take it orally as it's primed for inhalation.",
                                  "score": 1,
                                  "created_utc": 1735769586.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4t9t47",
                              "author": "CharlieDmouse",
                              "body": "Great if your on mental health meds!!!",
                              "score": 1,
                              "created_utc": 1735711627.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4spm5z",
                      "author": "rabbitaim",
                      "body": "You can also get assembly kits off Jehu Garcia’s website https://www.jag35.com\n\nPersonally I’d rather go with LFP (LiFePo4) chemistry.  Less energy density, low (or no) chance of thermal runaway and way more life cycles (3k to 6k depending on how you handle charging them).",
                      "score": 2,
                      "created_utc": 1735701483.0,
                      "replies": [
                        {
                          "id": "m4t1u2x",
                          "author": "skylarmt_",
                          "body": "Yeah I use LiFePO4 for most of my stuff except a few things like hacked drill batteries from Harbor Freight",
                          "score": 5,
                          "created_utc": 1735707175.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4r4m5q",
                  "author": "cocaine-cupcakes",
                  "body": "Hell I do this for my job and I’d still monitor it like a hawk. There’s no way to really know what conditions some of those cells are in and the ability to calculate state of health on individual cells that may have slightly different chemistries is highly suspect. I hope they are operating this system within a fairly narrow SoC window or the next cool particle about the set up will be describing the amazing bonfire it became.\n\nI definitely think this will become more common now that we are seeing such high volumes of cells moving through the markets. All in all very cool but definitely in the territory of don’t try this at home. I guarantee your insurance will not cover this if it goes wrong.",
                  "score": 13,
                  "created_utc": 1735679713.0,
                  "replies": [
                    {
                      "id": "m4rcght",
                      "author": "badguy84",
                      "body": "I like how it reads that he has this set up sitting in a little shack really far away from their main house... but don't really explain why that might be :) the guy clearly knows what he's doing and knows it can go wrong. Reading the article it sounds like \"a great way to reuse your laptop batteries and power your home\"",
                      "score": 12,
                      "created_utc": 1735682414.0,
                      "replies": [
                        {
                          "id": "m4t78m9",
                          "author": "SatansFriendlyCat",
                          "body": "It could certainly be an effective way to *heat* your home.. once, and to irreducible ash.",
                          "score": 5,
                          "created_utc": 1735710152.0,
                          "replies": []
                        },
                        {
                          "id": "m4un7r5",
                          "author": "cocaine-cupcakes",
                          "body": "The article says it’s 50m away from the house and shows a picture of it.",
                          "score": 2,
                          "created_utc": 1735741495.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4pryfz",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 28,
                  "created_utc": 1735664137.0,
                  "replies": [
                    {
                      "id": "m4pwne0",
                      "author": "badguy84",
                      "body": "HA, it's a good point, my education is in wiring houses to mains so I probably have dealt with more dangerous stuff voltage wise. But batteries and chemistry ... maybe I'd try something like this starting at a smaller scale with smaller batteries to build confidence. Certainly wouldn't start considering this as something I could pull off safely in the near term.",
                      "score": 19,
                      "created_utc": 1735665612.0,
                      "replies": [
                        {
                          "id": "m4q4hkq",
                          "author": "Frostypancake",
                          "body": "That’s sound advice no matter the project, if in doubt start small and scale out.",
                          "score": 10,
                          "created_utc": 1735668009.0,
                          "replies": []
                        },
                        {
                          "id": "m4qbnqg",
                          "author": "Ok-Significance9613",
                          "body": "I didn’t read the article but I would assume that that is how this man started the project as well. I can’t imagine waking up one day & being like, I’m going to run over 600 laptop batteries in sequence to power my house.",
                          "score": 5,
                          "created_utc": 1735670253.0,
                          "replies": [
                            {
                              "id": "m4qfczx",
                              "author": "badguy84",
                              "body": "Yeah I am sure this guy is very experienced, the forum they link is filled with battery reuse enthusiasts. \n\nThe article itself is more of a \"hey this person did something really cool with hundreds of batteries to run their house off of\" it does not point out at all the background that this person has or the fact doing it isn't all that simple. It's like \"hey why isn't everyone just reusing these batteries?\"",
                              "score": 6,
                              "created_utc": 1735671426.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m4uhmv7",
                          "author": "Agussert",
                          "body": "Exactly. I was going to try and set something up like this with Marine batteries in my own house, but realized it’s a little bit above my ability",
                          "score": 3,
                          "created_utc": 1735738939.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4qesh2",
                      "author": "adrian783",
                      "body": "technically yes. but the risk of fire increases exponentially as you put more batteries together. you're wrenching what seems like 600 18650s from old packs, make sure you don't damage them, test each cell, and that's just the prep work. \n\nthen you have to do thousands of spot welds, 600 little paper circle stickers, and BMS and wire it all together. \n\nlastly, you need a shed to store all this. putting this in a house is insane, putting it in an apartment complex would be nearly downright criminal.\n\nthese kinds of junk cell reuse would start to make a lot more sense once we have high density cells that doesn't catch on fire though.",
                      "score": 15,
                      "created_utc": 1735671245.0,
                      "replies": [
                        {
                          "id": "m4qp050",
                          "author": "samstown23",
                          "body": "Precisely. It's doable with the right tools but it seems like a tedious and error-prone task. Top-balancing those packs alone is probably a month's worth of work.\n\nIt's a curious project and I applaud the guy for actually putting in the effort but with the price of LiFePO4 cells as low as they currently are, it's impractical as hell.",
                          "score": 9,
                          "created_utc": 1735674539.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4r54qu",
                      "author": "internetlad",
                      "body": "Awaiting the /r/diy post for a guy asking for help after he's tore all the cells out of the old casings.",
                      "score": 4,
                      "created_utc": 1735679890.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4r1nnq",
                  "author": "minotaur05",
                  "body": "To be fair, the title isn’t wrong - it is a DIY setup. They’re not saying anyone can do that, just pointing out that someone did this on their own which I think is then important part. That if someone was able to do this, there might be something than can be taken from this",
                  "score": 5,
                  "created_utc": 1735678709.0,
                  "replies": [
                    {
                      "id": "m4rby4f",
                      "author": "badguy84",
                      "body": "I guess it has become a bit of a trend, you see these \"DIY\" videos in insta/tiktok/facebook feeds from folks with laser levels, all sorts of machinery (including heavy machinery) under the label \"DIY'ed my new bath house annex with steam room\" yes they may be doing it themselves but they clearly have a job in something adjecent. \n\nMaybe it's my age showing thinking that DIY means something you can kind of tackle with some more common equipment and some common sense.",
                      "score": 9,
                      "created_utc": 1735682233.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4q54gc",
                  "author": "menotyou_2",
                  "body": "I have an electrical engineering degree. I don't know how to do this right now, but I have 100% confidence I could figure it out. Otherwise, what was the purpose of your degree?",
                  "score": 9,
                  "created_utc": 1735668208.0,
                  "replies": [
                    {
                      "id": "m4qcwwq",
                      "author": "badguy84",
                      "body": "I think my degree is telling me that you shouldn't be welding used batteries together before knowing damn well what you are doing, and to practice until it's second nature before you start doing what this person is doing.\n\nHalf my degree was being thought the dangers of power mains along with how to avoid/deal with electrical/chemical fires. Especially any practical instructions we got focused on safety. A lithium battery exploding on you is no joke.",
                      "score": 13,
                      "created_utc": 1735670650.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4pgswa",
              "author": "Cool_Being_7590",
              "body": "Does \"thermal runaway\" translate to explosions, fire, screaming and pain?",
              "score": 38,
              "created_utc": 1735660567.0,
              "replies": [
                {
                  "id": "m4phj6c",
                  "author": "MonsterCookieCutter",
                  "body": "The safety distance mitigates the screaming and pain, but yes.",
                  "score": 49,
                  "created_utc": 1735660804.0,
                  "replies": []
                },
                {
                  "id": "m4psm7a",
                  "author": "chronictherapist",
                  "body": "Depends ... how close are you to the shed when it happens?",
                  "score": 19,
                  "created_utc": 1735664343.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4qhhcu",
              "author": "dstanton",
              "body": "So out of curiosity how difficult would it be to say repurpose an EV battery into a something like this?",
              "score": 3,
              "created_utc": 1735672105.0,
              "replies": [
                {
                  "id": "m4r351a",
                  "author": "cocaine-cupcakes",
                  "body": "Not super difficult if you have knowledge about the BMS software, basic CAN communication, and a background in dc circuits. \n\nReally a pretty bad idea for someone who doesn’t have those prerequisites though.",
                  "score": 8,
                  "created_utc": 1735679212.0,
                  "replies": [
                    {
                      "id": "m4r4axr",
                      "author": "dstanton",
                      "body": "Seems like a pretty cool idea for a company. Take old batteries and repurpose them into solar storage.",
                      "score": 2,
                      "created_utc": 1735679606.0,
                      "replies": [
                        {
                          "id": "m4r4tqh",
                          "author": "cocaine-cupcakes",
                          "body": "Business insurance premiums will be a fucking nightmare lol. Hang on, I’m actually gonna call my buddy who sells business insurance policies and ask him what he would quote me.\n\nEdit: after I explained to him what it is his response was “No.” lol. Like flat out not gonna happen. He told me I would have to go to one of the larger Insurers.\n\nEdit 2: he saw my edit and told me to include the part where he said “Why don’t you ever ask normal questions?” LOL.",
                          "score": 6,
                          "created_utc": 1735679785.0,
                          "replies": [
                            {
                              "id": "m4tpfdt",
                              "author": "charleswj",
                              "body": "![gif](giphy|4NnTap3gOhhlik1YEw|downsized)",
                              "score": 1,
                              "created_utc": 1735721546.0,
                              "replies": []
                            },
                            {
                              "id": "m4xuur4",
                              "author": "Camera_dude",
                              "body": "LOL.  That sounds about right.  No residential insurance is going to touch something this sketchy.   Residential insurance is all about standard packages for dealing with common inside hazards like stoves or other appliances, or outside natural disasters like floods.\n\nAnyone trying to sell repacked batteries like this is going to have to deal with residential insurance since they will be installing them in homes.",
                              "score": 1,
                              "created_utc": 1735780821.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4qjtji",
              "author": "brucebrowde",
              "body": "Can thermal runaway be easily contained?\n\nI'm thinking something along the lines of: put the batteries outside, shield them from sun / rain / wind, put a fire barrier between the batteries and the house.\n\nSo basically even if it happens, it burns like a nicely-contained fireplace of sorts.\n\nIs that too ignorant of the fire risks?",
              "score": 3,
              "created_utc": 1735672860.0,
              "replies": [
                {
                  "id": "m4qwfik",
                  "author": "ernest314",
                  "body": "if water gets in there it's less \"burning\" and more \"violently exploding\", just to be clear. \n\n... there's also some pretty nasty toxic fumes that you probably don't want to be inhaling",
                  "score": 7,
                  "created_utc": 1735676971.0,
                  "replies": [
                    {
                      "id": "m4r2u1m",
                      "author": "brucebrowde",
                      "body": "Right, so let's say you build a small somewhat fire-proof enclosure to protect it from sun / water / wind - say, you use bricks to build it, put the batteries near the ceiling to be high off the ground - and in addition you put some fire barrier between the house and the enclosure.\n\nPerhaps add additional protection, such as running the cables trough sand or some fire retardant.\n\nMy understanding is this burns rather quickly - in a matter of minutes - so if it happens, you get away from your house for the next 15 minutes till the fire subsides and the fumes dissipate and it should be a non-issue.\n\nWould that not be enough to have a high confidence you wouldn't run into issues or are there other considerations?",
                      "score": 2,
                      "created_utc": 1735679108.0,
                      "replies": [
                        {
                          "id": "m4t9kra",
                          "author": "ernest314",
                          "body": "I mean yeah, the way this guy did it seems safe enough, but I think the article is a bit dangerous since it frames this as a layman-accessible DIY project",
                          "score": 3,
                          "created_utc": 1735711487.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4r2qpi",
                  "author": "cocaine-cupcakes",
                  "body": "I’ve watched batteries in thermalrunaway leak molten aluminum and copper. I would not be confident that you could contain that. If you’re going to do a DIY system with questionable cells, a separate building is probably the best way to do it.",
                  "score": 5,
                  "created_utc": 1735679077.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4tuu4w",
              "author": "sillypicture",
              "body": "He's probably running at 0.2C or below and not using more than half of each cell's current capacity, coupling cells in series and parallel to meet more or less the same capacity for each line in series.\n\nI'd be curious to see his busbar setup.",
              "score": 3,
              "created_utc": 1735725196.0,
              "replies": []
            },
            {
              "id": "m4rdv24",
              "author": "Aggravating-Pear4222",
              "body": "So is it the rate of charge and power drain that makes those batteries not work for EVs/laptops anymore but easier for powering lights if they are connected parallel (vs linear). Idk probably just ignore the last part of the question.",
              "score": 2,
              "created_utc": 1735682919.0,
              "replies": [
                {
                  "id": "m4tpnal",
                  "author": "charleswj",
                  "body": "There's no question.",
                  "score": 1,
                  "created_utc": 1735721692.0,
                  "replies": [
                    {
                      "id": "m4vsr89",
                      "author": "Aggravating-Pear4222",
                      "body": "There’s a question that is missing a question mark.",
                      "score": 2,
                      "created_utc": 1735756285.0,
                      "replies": [
                        {
                          "id": "m4vvtwk",
                          "author": "charleswj",
                          "body": ">Idk probably just ignore the last part of the question?\n\nIt doesn't make sense as a question even with a question mark. Maybe a rhetorical question?",
                          "score": 1,
                          "created_utc": 1735757245.0,
                          "replies": [
                            {
                              "id": "m52kfiy",
                              "author": "Aggravating-Pear4222",
                              "body": "The first sentence doesn't have a question mark but should. Reading (and understanding) it should make that clear. The second sentence has a period after it and not a question mark as you wrote in your block.",
                              "score": 1,
                              "created_utc": 1735852079.0,
                              "replies": [
                                {
                                  "id": "m52lswj",
                                  "author": "charleswj",
                                  "body": "But how do I know which sentence is the question. There are two sentences.",
                                  "score": 1,
                                  "created_utc": 1735852486.0,
                                  "replies": [
                                    {
                                      "id": "m52xa5x",
                                      "author": "Aggravating-Pear4222",
                                      "body": "Grammar. The \"So is it...\" gives it away.",
                                      "score": 1,
                                      "created_utc": 1735855876.0,
                                      "replies": [
                                        {
                                          "id": "m52y5i9",
                                          "author": "charleswj",
                                          "body": "I thought you were saying \"so is...\". As in \"My wallet is in my pocket. So is my phone.\"",
                                          "score": 1,
                                          "created_utc": 1735856138.0,
                                          "replies": [
                                            {
                                              "id": "m53082r",
                                              "author": "Aggravating-Pear4222",
                                              "body": "If you ignore the part of my sentence that indicates it's a question, then sure! You're right! I was wrong.",
                                              "score": 1,
                                              "created_utc": 1735856770.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4z6fqm",
                      "author": "TineJaus",
                      "body": ">So is it the rate of charge and power drain that makes those batteries not work for EVs/laptops anymore[?]\n\nIt's right there.",
                      "score": 1,
                      "created_utc": 1735802674.0,
                      "replies": [
                        {
                          "id": "m4z9r79",
                          "author": "charleswj",
                          "body": "Unless it's \n\n>So is it the rate of charge?\n\nOr\n\n>So is it the rate of charge and power drain?",
                          "score": 1,
                          "created_utc": 1735804819.0,
                          "replies": [
                            {
                              "id": "m4z9u0g",
                              "author": "TineJaus",
                              "body": "He obviously doesn't know what he's asking, but your comment was pretty useless.",
                              "score": 1,
                              "created_utc": 1735804869.0,
                              "replies": [
                                {
                                  "id": "m52zrbo",
                                  "author": "Aggravating-Pear4222",
                                  "body": "For EVs, accelerating a vehicle requires a high output of energy. The same can be said about powering a computer (relatively).\n\nI was asking if these high power processes are the reason why these batteries don't work for their original purpose but can work in this scenario for other things like powering lights.\n\nThe question about linear vs parallel connections was asking if the batteries are all connected linearly where the power would be running through each battery (as so defeat the proposed benefit in the first part of the question where the power requirements are significantly higher, if applicable)\n\nor\n\nWhether they are in parallel so that the batteries provide the same amount of power but don't need to conduct the power provided by the upstream batteries. It's the difference between plugging your phone into your laptop to charge it (linear and so potentially more strain on the laptop's battery) vs plugging your phone into a different outlet (avoid extra strain on your laptop battery).\n\nAs you can see, the last part of the question is more complex and I doubt I would be able to appreciate the answer since I've only had introductory courses in electrical circuits so I said they can ignore it that last part of the question.",
                                  "score": 1,
                                  "created_utc": 1735856628.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4uocgg",
                  "author": "cocaine-cupcakes",
                  "body": "Yeah they won’t deliver high power density or tolerate full depth of discharge well.",
                  "score": 1,
                  "created_utc": 1735741988.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4s79z5",
              "author": "C_Madison",
              "body": "IIRC correctly the warranty on EV batteries is usually for the time they expect them to \"only\" have 80% of their original capacity left. It would really be a waste to throw those batteries away. But same as you, I'm really curious how much they've lost in the last few years. I don't know if its linear or maybe the first 20% are really fast and after that it gets slower?",
              "score": 2,
              "created_utc": 1735693942.0,
              "replies": [
                {
                  "id": "m4uqt3l",
                  "author": "cocaine-cupcakes",
                  "body": "Yep 80% state of health is a pretty standard warranty condition for EV batteries.  The reason they become unsuitable is because the high charge and discharge rates required for vehicle use begin to rapidly increase cell impedance. You don’t really need that though for home power storage.",
                  "score": 3,
                  "created_utc": 1735743047.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4uqfaz",
              "author": "emelbard",
              "body": "This is more impressive to me than the 800MW BESS we’re currently installing in AZ.",
              "score": 2,
              "created_utc": 1735742886.0,
              "replies": []
            },
            {
              "id": "m4ro8mk",
              "author": "kr4ckenm3fortune",
              "body": "But aren't laptop batteries known to zero out if you disassemble them?",
              "score": 1,
              "created_utc": 1735686711.0,
              "replies": [
                {
                  "id": "m4uoyx1",
                  "author": "cocaine-cupcakes",
                  "body": "Nope. “Zeroing out” is not a phenomenon I’m familiar with but if you’re asking whether or not the cell potential goes to zero then definitely not. Just don’t short them out.",
                  "score": 2,
                  "created_utc": 1735742254.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m50p6sf",
              "author": "inerlite",
              "body": "I gotta give this guy credit for the outstanding color gradients on the battery placements!   So pretty!    \nI have been considering this same type of use, but using all individual battery charger and monitoring electronics.   The individual 18650 chargers are so cheap on Ali I'm wondering if anyone has set up a system that doesn't rely on matching batteries at all?",
              "score": 1,
              "created_utc": 1735831358.0,
              "replies": [
                {
                  "id": "m50rb8o",
                  "author": "cocaine-cupcakes",
                  "body": "What do you mean by matching batteries? Are you referring to battery chemistries or matching up SoH levels? The reason I ask is because you can easily get yourself into trouble with both of those. \n\nYou really want to make sure that you align your monitoring tools with the cell characteristics. Generally speaking, but not always, that means grouping cell chemistries together and approximate SOH together. Light mismatch just means degraded performance. Significant mismatch will likely lead to overcharging or over discharging eventually leading to thermal damage.",
                  "score": 1,
                  "created_utc": 1735832066.0,
                  "replies": [
                    {
                      "id": "m511o5a",
                      "author": "inerlite",
                      "body": "I mean it would be the same, probably 18650 battery, but each battery has it's own charger and management system to regulate output.   Then combine all the individual managed batteries for greater charge.",
                      "score": 1,
                      "created_utc": 1735835374.0,
                      "replies": [
                        {
                          "id": "m514g7q",
                          "author": "cocaine-cupcakes",
                          "body": "I’m having a hard time believing that it’s economical to put an individual charger on each and every cell. But if you can do it go for it.",
                          "score": 1,
                          "created_utc": 1735836237.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4pgyjc",
          "author": "Bendstowardjustice",
          "body": "I want to do this. I’m not usually a DIY person but now I want to be.",
          "score": 12,
          "created_utc": 1735660618.0,
          "replies": [
            {
              "id": "m4plr9h",
              "author": "None",
              "body": "Before starting this, please ask the people outside the blast radius to record in landscape orientation.",
              "score": 34,
              "created_utc": 1735662178.0,
              "replies": []
            },
            {
              "id": "m4pk9pn",
              "author": "notloggedin4242",
              "body": "Don’t. Trust me and anyone who tells you exactly what I am telling you. Don’t. Ok?",
              "score": 26,
              "created_utc": 1735661703.0,
              "replies": [
                {
                  "id": "m4py6na",
                  "author": "Bendstowardjustice",
                  "body": "I’m starting to think this might not be the best idea ever.",
                  "score": 7,
                  "created_utc": 1735666086.0,
                  "replies": [
                    {
                      "id": "m4t3jwr",
                      "author": "HahaMin",
                      "body": "Maybe start with something small, like cordless drill or vacuum battery pack. Most on the market uses 6-8 18650 batteries inside the enclosure and can be replaced with some tinkering.",
                      "score": 3,
                      "created_utc": 1735708148.0,
                      "replies": []
                    },
                    {
                      "id": "m4qsmtj",
                      "author": "Sancticide",
                      "body": "Unless you want to be a DIY Arsonist, I suppose.",
                      "score": 1,
                      "created_utc": 1735675725.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4rysu1",
              "author": "Hendlton",
              "body": "This definitely shouldn't be your first project, but it's not like it takes a university degree to be able to do this kind of thing. Start with something simple and work your way up.",
              "score": 2,
              "created_utc": 1735690738.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4qax3a",
          "author": "MadRoboticist",
          "body": "This is impressive, but just because he's gone 8 years without an incident doesn't mean that this is safe. This is still probably not safe and a fire hazard. That's probably why it's 50 m away from his house.",
          "score": 8,
          "created_utc": 1735670020.0,
          "replies": []
        },
        {
          "id": "m4uocyg",
          "author": "Ngineer07",
          "body": "oh man, thank God he can use his washing machine! I was worried about that when he said it can power his whole house. everyone always forgets that their washing machine is often not part of the house and has to be included separately",
          "score": 2,
          "created_utc": 1735741994.0,
          "replies": []
        },
        {
          "id": "m4w5161",
          "author": "therealhairykrishna",
          "body": "I mean, I'm reporting a fire hazard right now. It's the shed full of old lithium batteries.",
          "score": 0,
          "created_utc": 1735760183.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4pnhi2",
      "author": "mach32",
      "body": "This days laptop manufacturers prefer pouch cells instead of standard cylindrical 18650 batteries. Not only they come in all shapes and sizes, used pouch cells are also very susceptible to swelling - so not very useful for DIY battery packs.",
      "score": 123,
      "created_utc": 1735662731.0,
      "replies": [
        {
          "id": "m4qj3zv",
          "author": "asimovs_engineer",
          "body": "I was gonna say, this is not at all sustainable.",
          "score": 46,
          "created_utc": 1735672630.0,
          "replies": [
            {
              "id": "m4rz4g0",
              "author": "Hendlton",
              "body": "Not with laptop batteries. There are plenty of other devices that have rechargeable batteries though. I wonder how hard it would be to do this using disposable vape batteries. Hundreds of thousands of those are thrown out every day.",
              "score": 16,
              "created_utc": 1735690861.0,
              "replies": [
                {
                  "id": "m4s6bwp",
                  "author": "asimovs_engineer",
                  "body": "Anything smaller and the effectiveness of connecting them all together becomes more expensive and less efficient. My quick googling says a high capacity vape may have 5Ah. You'd need 20 just to match 1 of the batteries in this guy's shed setup, and most vape will be much smaller.",
                  "score": 10,
                  "created_utc": 1735693580.0,
                  "replies": [
                    {
                      "id": "m4sfft2",
                      "author": "Hendlton",
                      "body": "Not to match one of the batteries, but one of the battery packs. Each one of those packs has 80 cells. But most vapes are 500 mAh, with larger ones being 1500 mAh. So yeah, you'd need a lot to match the packs in the article, but if you can get them for free, I think it'd be worth it.",
                      "score": 6,
                      "created_utc": 1735697158.0,
                      "replies": [
                        {
                          "id": "m4xrszk",
                          "author": "nikolai_470000",
                          "body": "Maybe. The only reason why I think it may work better than people would anticipate (for a time) is that the process of wiring them together might be simplified by the fact those devices already have a charging regulator on board. \n\nAt a certain point though, with the cost of other parts to get it working and the labor involved in manually wiring that many components together…  unless you are an electrical engineer with a bunch of spare parts just laying around… it either costs too much or takes too long for it to truly be worthwhile. \n\nAlso, differently from laptop batteries and the like, the batteries in vapes are cheap. Rechargeable, yes, but the majority of them aren’t going to last much longer than the vape itself does. Making lithium ion cells which are that small, that last a comparable number of cycles to a laptop battery, is not something done cheaply. If these disposable vape manufacturers were putting high quality lithium like that in their devices, they wouldn’t be turning a profit.",
                          "score": 1,
                          "created_utc": 1735779735.0,
                          "replies": [
                            {
                              "id": "m4xxoig",
                              "author": "Hendlton",
                              "body": "The ones that are meant for a single use don't have a charge controller on board (As far as I can tell). All they have is some kind of over-discharge protection. The parts and labor are no more than what's in the article above.\n\nI really don't know about their quality. I have a handful, but I've never tested how many times they can be charged and discharged. Although once I got a puffy one straight out of a vape and that's certainly concerning. Not just for their use in projects, but also the general safety of those disposable vapes.",
                              "score": 1,
                              "created_utc": 1735781856.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4rh9z4",
          "author": "FerociousPancake",
          "body": "Love me a good spicy pillow \n\nr/SpicyPillows",
          "score": 9,
          "created_utc": 1735684144.0,
          "replies": [
            {
              "id": "m4rqjnq",
              "author": "NomadJones",
              "body": "Came here for this comment!",
              "score": 2,
              "created_utc": 1735687592.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4sawxv",
          "author": "redonculous",
          "body": "Depends how old they are. Laptop batteries used to mainly be 18650s, until laptops got thin.",
          "score": 3,
          "created_utc": 1735695354.0,
          "replies": []
        },
        {
          "id": "m4t5w57",
          "author": "dominus_aranearum",
          "body": "Would there be a way to keep the pouch batteries from swelling, other than the typical methods of avoiding issues that would cause gas buildup?\n\nI ask because I recycle e-Waste and would much rather find a purpose for the batteries among other things, rather than just dropping them off at a collection site. I have a source that easily amounts to hundreds of laptop batteries a year, alongside the AA, AAA, 2025s, etc. \n\nI'm experienced enough to be able to set something up, but also smart enough to know when I'm out of my element. But part of me does get concerned with all of the laptops/batteries just sitting in my shop as it is.",
          "score": 3,
          "created_utc": 1735709421.0,
          "replies": [
            {
              "id": "m4trk0e",
              "author": "mach32",
              "body": "> Would there be a way to keep the pouch batteries from swelling\n\nNone than i know of. I've seen batteries with thousands cycles and barely any capacity left without any swollen cells. And relatively fresh batteries with every cell looking like a balloon. Feels random to me. Must be just quality issue.\n\n18650 have air vents and steel tubes for a reason.",
              "score": 3,
              "created_utc": 1735722971.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4pbjol",
      "author": "cinnapear",
      "body": "That shed is a ticking chemical bonfire.",
      "score": 213,
      "created_utc": 1735658819.0,
      "replies": [
        {
          "id": "m4pfvmc",
          "author": "hedoeswhathewants",
          "body": "That's presumably why he put it 50m away from his house with nothing nearby it.",
          "score": 147,
          "created_utc": 1735660264.0,
          "replies": []
        },
        {
          "id": "m4pd5so",
          "author": "None",
          "body": "My first thought was the danger of people trying to hack shit together like this",
          "score": 24,
          "created_utc": 1735659358.0,
          "replies": [
            {
              "id": "m4ph4v0",
              "author": "xxbiohazrdxx",
              "body": "If this is the guy I think it is, I remember reading about it when he was first doing it. The batteries are all tested for capacity so that only batteries within a certain percentage points of each other are in banks together, the cells are connected with fuse wire to prevent overcurrent situations, everything is connected to a BMS to monitor cell charge/discharge/balance state. There are temperature probes to monitor temps.  \n\nIt basically seems like he did it right.",
              "score": 95,
              "created_utc": 1735660675.0,
              "replies": [
                {
                  "id": "m4phdrt",
                  "author": "None",
                  "body": "That’s fine\n\nBut when I copy cat this in my 7 story 1950s slumlord apartment I will abide by none of these considerations.",
                  "score": 86,
                  "created_utc": 1735660756.0,
                  "replies": [
                    {
                      "id": "m4pjnw7",
                      "author": "Dodson-504",
                      "body": "Got a single wide trailer on some land. Been waiting for a new project to come along.",
                      "score": 17,
                      "created_utc": 1735661506.0,
                      "replies": [
                        {
                          "id": "m4pk0vr",
                          "author": "None",
                          "body": "Just make sure it has lead paint",
                          "score": 11,
                          "created_utc": 1735661623.0,
                          "replies": [
                            {
                              "id": "m4pncv6",
                              "author": "Dodson-504",
                              "body": "Always go with the cheapest rattle can!",
                              "score": 8,
                              "created_utc": 1735662689.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4pvzcs",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 20,
                      "created_utc": 1735665403.0,
                      "replies": [
                        {
                          "id": "m4pwltf",
                          "author": "None",
                          "body": "If you are going to burn old chairs in your living room make sure you use a box fan to keep the flames from getting too high.",
                          "score": 4,
                          "created_utc": 1735665598.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4prej7",
                      "author": "skylarmt_",
                      "body": "Please do not the battery",
                      "score": 5,
                      "created_utc": 1735663963.0,
                      "replies": [
                        {
                          "id": "m4prk0k",
                          "author": "None",
                          "body": "You just don’t want me to build the battery bank of the future",
                          "score": 6,
                          "created_utc": 1735664011.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4pw582",
                  "author": "ptoki",
                  "body": "> It basically seems like he did it right.\n\nYes, but the issue is somewhat deeper.\n\nThe batteries are in unknown shape. Yes, electrically they behave ok but even with new ones you cant be certain how stable they are. \n\nHonestly Im on the edge with this. On one hand they are used and uncertain of their internals, on the other hand they are treated probably as manufactured would be and they are already tested in a meaning they worked fine for some time already.\n\nAnd it seems that worked for 8 years.\n\nStill, Im not a fan of home powerbanks of lithium batteries.",
                  "score": -1,
                  "created_utc": 1735665453.0,
                  "replies": [
                    {
                      "id": "m4t6zwb",
                      "author": "orangpelupa",
                      "body": "The DIY-er also unsure, thus the shed is 50m away ",
                      "score": 6,
                      "created_utc": 1735710020.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m4pyyfq",
          "author": "unfugu",
          "body": "The colors are pretty tho",
          "score": 5,
          "created_utc": 1735666327.0,
          "replies": []
        },
        {
          "id": "m4pfug7",
          "author": "cocaine-cupcakes",
          "body": "Gonna be beautiful when it goes off though.",
          "score": 7,
          "created_utc": 1735660254.0,
          "replies": [
            {
              "id": "m4qem6q",
              "author": "brucebrowde",
              "body": "I mean it's New Year's eve after all.",
              "score": 2,
              "created_utc": 1735671189.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4pfrbv",
          "author": "turboboob",
          "body": "Absolutely. But eight years is crazy.",
          "score": 3,
          "created_utc": 1735660225.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4qbobu",
      "author": "KrackSmellin",
      "body": "So first question I have - how is everything in a wood shed yet we see it in a stone room?  Perhaps his basement where he assembles them and then moves them to their home in the shed?\n\nSecondly - pretty much every laptop in the last 10 years doesn’t use these and uses LiPO batteries.  They are far more dangerous, need far more of a setup to use to ensure batteries aren’t being overcharged/drained (which is dangerous and bad retrospectively) and aren’t as “universal” as these 16xxx/18xxx series cells are where you can just remove them and solder them together.",
      "score": 14,
      "created_utc": 1735670258.0,
      "replies": [
        {
          "id": "m4rk7g2",
          "author": "Ahab_Ali",
          "body": "Here is inside the shed: https://secondlifestorage.com/index.php?attachments/image_rvvpen-jpg.16014/\n\nEdit: And look, he *is* all prepared for thermal runaway, there is a fire extinguisher right inside the shed!",
          "score": 9,
          "created_utc": 1735685180.0,
          "replies": [
            {
              "id": "m4ss4sa",
              "author": "KrackSmellin",
              "body": "There is zero chance of getting got that extinguisher if that shed catches any sort of fire.  should put a bunch of those extinguisher bombs hanging up above to put stuff out automatically.",
              "score": 4,
              "created_utc": 1735702586.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4pr3x6",
      "author": "Squidy1972",
      "body": "Fire Departments across the country shaking their heads",
      "score": 50,
      "created_utc": 1735663870.0,
      "replies": [
        {
          "id": "m4skr57",
          "author": "hauwertlhaufn",
          "body": ">\tThe setup is housed in a somewhat unassuming shed 50 meters (164 feet) away from the individual's residence\n\nThe firefighters are very happy about this setup.",
          "score": 25,
          "created_utc": 1735699380.0,
          "replies": [
            {
              "id": "m4wheld",
              "author": "DevilsTrigonometry",
              "body": "Yes, firefighters love it. It's going to put on a great show some day, then serve as free target practice without any risk to humans or pets.",
              "score": -2,
              "created_utc": 1735764211.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4pqr10",
      "author": "Fsujoe",
      "body": "And when I try to get anything classified as ewaste I’m told they can’t give it to me cause of privacy concerns.",
      "score": 16,
      "created_utc": 1735663757.0,
      "replies": []
    },
    {
      "id": "m4pbmce",
      "author": "Redm18",
      "body": "Seems like the headline should be powers with Solar Panels",
      "score": 29,
      "created_utc": 1735658844.0,
      "replies": [
        {
          "id": "m4pcsfu",
          "author": "minotaur05",
          "body": "Solar only works for half the day and you need power the rest of the time. Not to mention even if they have solar tbey might use more power than is being produced so the battery storage kicks in. This is quite the feat if true\n\nEdit: Are downvotes because I said solar only works half the time? This was  pointing out that yes they have solar in combination with the batteries but saying solar is the only reason they powered their house for 8 years would be incorrect. Solar plus the batteries did this, and the focus is on the fact they could do this with a ton of e-waste which is awesome.",
          "score": -19,
          "created_utc": 1735659234.0,
          "replies": [
            {
              "id": "m4piai0",
              "author": "dertechie",
              "body": "Neither component could do it alone; leaving out the 10.5 kW of solar panels feels misleading.",
              "score": 19,
              "created_utc": 1735661057.0,
              "replies": [
                {
                  "id": "m4qguo6",
                  "author": "minotaur05",
                  "body": "Right but the poster I was responding to was saying the house was powered with solar panels which is not completely correct either. Solar plus used batteries in this case.",
                  "score": -1,
                  "created_utc": 1735671904.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4pq0nj",
              "author": "ToMorrowsEnd",
              "body": "Solar only works for about 4 hours not half the day.   90% of the power my system generates is from 2 hours before solar noon to 2 hours after.  only way to extract more is by adding  servo motors to track the sun.   The power made before and after that is a rapid dropoff losing about 25% every 30 minutes and then tapering.  It's a bell curve.  it also gets worse the more north you go.  Good friend of mine up in canada can barely make 4Kwh right now on his 40Kwh solar array.  and yes the panels are clear of snow.  extreme low angle of the sun and extremely short days in the winter make solar in any north lattitude a challenge.",
              "score": 4,
              "created_utc": 1735663527.0,
              "replies": [
                {
                  "id": "m4qcp06",
                  "author": "BassGaming",
                  "body": "You are not bashing solar panels or saying they're useless. You're stating easily verifiable numbers (even though I'd say it's more like 4-6 hours) and yet get downvoted.",
                  "score": 2,
                  "created_utc": 1735670580.0,
                  "replies": []
                },
                {
                  "id": "m50ygq7",
                  "author": "inerlite",
                  "body": "I would guess the servo motor only takes a little juice to run so the biggest barrier to adding this would be the adjustable rack and tracking system?   I don't see them in, well any solar systems for sale.",
                  "score": 1,
                  "created_utc": 1735834368.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4pm8rf",
              "author": "tonytrouble",
              "body": "And running a washer isn’t quite as impressive as running a dryer, or oven. ",
              "score": 2,
              "created_utc": 1735662332.0,
              "replies": [
                {
                  "id": "m4pmdap",
                  "author": "tonytrouble",
                  "body": "But this is cool as heck no the less, of course!! ;) ",
                  "score": 2,
                  "created_utc": 1735662373.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4r009w",
              "author": "Old-Cover-5113",
              "body": "No its for pointing out such an obvious thing to try to act like you contributed. Yes well all know how the sun works",
              "score": 2,
              "created_utc": 1735678157.0,
              "replies": [
                {
                  "id": "m4r1bpv",
                  "author": "minotaur05",
                  "body": "I don’t think I’m acting like I’m contributing, was just trying to point out the solar itself won’t power a house so the battery is the other half. The article is focusing on the feat of doing so with essentially ewaste which is why that’s being focused on, not the solar. It’s so weird people get upset by someone just trying to have a conversation on the internet.",
                  "score": 1,
                  "created_utc": 1735678597.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m4t2rok",
      "author": "temperofyourflamingo",
      "body": "All everyone said on Twitter was, “does your insurance know it’s on the property?”",
      "score": 4,
      "created_utc": 1735707685.0,
      "replies": []
    },
    {
      "id": "m4ptpp7",
      "author": "None",
      "body": "[deleted]",
      "score": 22,
      "created_utc": 1735664690.0,
      "replies": [
        {
          "id": "m4tobnl",
          "author": "Damean1",
          "body": "Well, this is pretty common in a lot of homes.  My house uses gas for all of that also. Only need electricity for the igniters. It is very neat.",
          "score": 2,
          "created_utc": 1735720812.0,
          "replies": [
            {
              "id": "m4tqzff",
              "author": "Zoombluecar",
              "body": "And electric for the circulators or blower motor on heating system. Exhaust on water heater.",
              "score": 2,
              "created_utc": 1735722588.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4u1ge5",
      "author": "tankpuss",
      "body": "\"Housed in a somewhat unassuming shed 50m away from the individual's residence.\"  \nSmart move that.  If that went wrong, it could get quite spicy.",
      "score": 3,
      "created_utc": 1735729683.0,
      "replies": []
    },
    {
      "id": "m4pvbjv",
      "author": "None",
      "body": "[deleted]",
      "score": 6,
      "created_utc": 1735665195.0,
      "replies": [
        {
          "id": "m4spy6k",
          "author": "Pubelication",
          "body": "I just saw an entire warehouse burn down like a week ago, because some dumbass bought hundreds of used 18650s from a bus.\nHe supposedly had the balancing and everything right, but one cell shorted internally, causing a domino effect and the fire was massive.\n\nFucking around with old batteries is not worth it.",
          "score": 2,
          "created_utc": 1735701629.0,
          "replies": [
            {
              "id": "m4uhvov",
              "author": "IsThisNameGoodEnough",
              "body": "They make nickel strips with built in cell-level fuses for exactly this scenario. Here's a video showing it in action: \n\nhttps://youtu.be/8ftXaQHrZB8",
              "score": 1,
              "created_utc": 1735739059.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m504362",
      "author": "SabotageFusion1",
      "body": "in a few years this will be classified as an IED",
      "score": 2,
      "created_utc": 1735823212.0,
      "replies": []
    },
    {
      "id": "m4r08i4",
      "author": "LordGarak",
      "body": "LiFePO4 batteries have come down significantly in price in recent years. It's much more practical and safer to make a DIY battery for home solar with 280Ah LiFePO4 cells. Even the commercially built batteries are now pretty affordable at suppliers like Signature Solar. \n\nHere in Canada its now cheaper to go LiFePO4 than with flooded lead acid batteries and significantly cheaper than AGM.  AOLithium sells 5kWh server rack batteries for $949 Canadian with free shipping.",
      "score": 6,
      "created_utc": 1735678232.0,
      "replies": []
    },
    {
      "id": "m4tgt6p",
      "author": "DJ_Sk8Nite",
      "body": "Putting DIY in the title is a huge slap in the face for what’s been accomplished here. The skill/knowledge they have is next level.",
      "score": 2,
      "created_utc": 1735715949.0,
      "replies": [
        {
          "id": "m4ui9b7",
          "author": "EsGeeBee",
          "body": "He did it himself, isn't that the exact meaning of DIY?",
          "score": 5,
          "created_utc": 1735739240.0,
          "replies": []
        },
        {
          "id": "m4u4v00",
          "author": "RationalKate",
          "body": "DIY kinda means duct tape and bailing wire",
          "score": 1,
          "created_utc": 1735731886.0,
          "replies": []
        },
        {
          "id": "m4v99at",
          "author": "DJ_Sk8Nite",
          "body": "I think DIY has become a term where it’s telling the reader they can “do it themselves” with general knowledge and maybe a little trial and error. This is not one of those times.",
          "score": 1,
          "created_utc": 1735749883.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4pmnh2",
      "author": "dustofdeath",
      "body": "Power a home? It can barely power a modern gaming setup.",
      "score": 3,
      "created_utc": 1735662462.0,
      "replies": []
    },
    {
      "id": "m4qxkly",
      "author": "JacoRamone",
      "body": "🔥",
      "score": 2,
      "created_utc": 1735677351.0,
      "replies": []
    },
    {
      "id": "m4vuzsl",
      "author": "None",
      "body": " That’s a weird way to spell fire hazard.",
      "score": 2,
      "created_utc": 1735756986.0,
      "replies": []
    },
    {
      "id": "m4sp9v6",
      "author": "Responsible-Noise875",
      "body": "I can’t wait to see this on spicy pillows",
      "score": 1,
      "created_utc": 1735701336.0,
      "replies": []
    },
    {
      "id": "m4trgel",
      "author": "UsualInformation7642",
      "body": "The chance of batteries exploding catching fire is simply too high for me to consider it, but if he did it for 8 years with no problems then maybe it’s worth considering?",
      "score": 1,
      "created_utc": 1735722904.0,
      "replies": []
    },
    {
      "id": "m4x8oix",
      "author": "eirc",
      "body": "Nothing sustainable about using repurposed batteries.",
      "score": 1,
      "created_utc": 1735773019.0,
      "replies": []
    },
    {
      "id": "m51a2gh",
      "author": "Liquid_Magic",
      "body": "I find this inspiring and terrifying!",
      "score": 1,
      "created_utc": 1735837970.0,
      "replies": []
    },
    {
      "id": "m51tpcf",
      "author": "absyrtus",
      "body": "How much of a fire hazard is this?",
      "score": 1,
      "created_utc": 1735843870.0,
      "replies": []
    },
    {
      "id": "m4qie62",
      "author": "LeBidnezz",
      "body": "The guv ain’t gonna put up with this lol. If you teach your car to run on old cooking oil they charge you with tax evasion lol.",
      "score": -1,
      "created_utc": 1735672397.0,
      "replies": [
        {
          "id": "m4rag4m",
          "author": "Neo_Techni",
          "body": "Gees",
          "score": 1,
          "created_utc": 1735681709.0,
          "replies": []
        },
        {
          "id": "m4ruqzi",
          "author": "Thesinistral",
          "body": "I believe that my state charges $200/yr for EVs to offset lost gasoline tax.",
          "score": 1,
          "created_utc": 1735689191.0,
          "replies": [
            {
              "id": "m4sqbjt",
              "author": "Pubelication",
              "body": "This is bound to happen everywhere, since consumption tax is a massive portion of almost every country's income.",
              "score": 2,
              "created_utc": 1735701790.0,
              "replies": []
            },
            {
              "id": "m5rl6jq",
              "author": "FauxReal",
              "body": "Which is used to pay for road maintenance. Makes sense since EV drivers are still driving on the roads.",
              "score": 1,
              "created_utc": 1736199500.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4pgyw9",
      "author": "rossmosh85",
      "body": "I'm the furthest thing from an expert on the subject, but I have watched several videos of guys building massive batteries out of these cells.\n\nThe process to do it correctly (which I'm guessing this guy has) is long.  You basically need to test capacity of each little battery a bunch of different times and sort them and then sort them again.  Then finally assemble the battery and charge it in a some what specific way so the battery charges evenly and no one cell is stressed.  After that, the BMS does most of the heavy lifting keeping the batteries charged and balanced.\n\nWhat's also important to note here is this setup is extremely basic.  It would not meet the needs for the vast majority of people.  1.4kW solar setup is TINY.  Not to mention, these DIY batteries are also quite small.\n\nThis setup would work for someone who gets a lot of sun and has a VERY low demand.  I have serious doubts that this could even run a small heat pump/AC unit.",
      "score": -4,
      "created_utc": 1735660621.0,
      "replies": [
        {
          "id": "m4pk5bp",
          "author": "i486dx2",
          "body": "> What's also important to note here is this setup is extremely basic. It would not meet the needs for the vast majority of people. 1.4kW solar setup is TINY.\n\nIt’s also important to finish reading the article.  1.4kW was the starting point in 2016.  The current solar array is 10.56kW.",
          "score": 6,
          "created_utc": 1735661664.0,
          "replies": [
            {
              "id": "m4pn0r8",
              "author": "None",
              "body": "With a 3KW inverter.",
              "score": 5,
              "created_utc": 1735662582.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4s0w2b",
          "author": "Hendlton",
          "body": "My mini-split AC uses 700W. It'd definitely run on this setup. Similarly, you could run a fridge/freezer on this. It'd be nice to have it independent of the power grid.",
          "score": 2,
          "created_utc": 1735691523.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4qeri5",
      "author": "None",
      "body": "[removed]",
      "score": -2,
      "created_utc": 1735671237.0,
      "replies": [
        {
          "id": "m4sqta3",
          "author": "Pubelication",
          "body": "Not sure why you're downvoted.  \nIt's not the specs per se, but the internal resistance. As the batteries degrade, they get harder to charge due to internal resistance causing heat. Just one battery internally shorting can cause the entire pack to go up in flames.",
          "score": 1,
          "created_utc": 1735702005.0,
          "replies": []
        },
        {
          "id": "m5rlndf",
          "author": "FauxReal",
          "body": "Sounds like a bad idea, but he's apparently had it running for years.",
          "score": 1,
          "created_utc": 1736199635.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4ri9bw",
      "author": "prettybluefoxes",
      "body": "Stopped at ingenious. 👍",
      "score": 0,
      "created_utc": 1735684494.0,
      "replies": []
    },
    {
      "id": "m4pphr8",
      "author": "ToMorrowsEnd",
      "body": "Headline is intentional clickbait.  It is an 8 year old project.",
      "score": -7,
      "created_utc": 1735663362.0,
      "replies": []
    },
    {
      "id": "m4pd7x3",
      "author": "None",
      "body": "[deleted]",
      "score": -12,
      "created_utc": 1735659377.0,
      "replies": [
        {
          "id": "m4pfor7",
          "author": "PrimmSlimShady",
          "body": "8 years sounds unstable?",
          "score": 11,
          "created_utc": 1735660202.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4rmnw0",
      "author": "Serious-Excitement18",
      "body": "The filthy lives they expect us to ahere to being represented. Please show us plebes the way, for our corpo overlords demand more line go up...",
      "score": -2,
      "created_utc": 1735686093.0,
      "replies": []
    },
    {
      "id": "m4pcpo3",
      "author": "tacocat63",
      "body": "In my experience, you replace a notebook when the battery can no longer hold a charge beyond 3 seconds. \n\nCan't see it being useful here",
      "score": -21,
      "created_utc": 1735659208.0,
      "replies": [
        {
          "id": "m4pg153",
          "author": "okaythiswillbemymain",
          "body": "Why would you replace the laptop/notebook and not just the battery?\n\nThe thing with a laptop battery is it's often  a single cell that's died, and the rest are fine. If you took them all out, you could check each one and you'd probably find most are still good.\n\nThis is what this guy has probably done. There are loads of people on YouTube that break apart old battery packs and test the batteries, using only the good ones",
          "score": 10,
          "created_utc": 1735660314.0,
          "replies": [
            {
              "id": "m4pq18g",
              "author": "tacocat63",
              "body": "Company Notebook. They didn't care, it's deductable",
              "score": -4,
              "created_utc": 1735663532.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}