{
  "post": {
    "title": "Surface Pro 12-inch review: heart warmer",
    "author": "dapperlemon",
    "id": "1l5rf5a",
    "score": 469,
    "created_utc": 1749320247.0,
    "selftext": "",
    "num_comments": 74,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l5rf5a/surface_pro_12inch_review_heart_warmer/"
  },
  "comments": [
    {
      "id": "mwk25uz",
      "author": "noochies99",
      "body": "Here lemme save you a click:\n\nMicrosoft’s 12-inch Surface Pro, powered by Qualcomm’s Snapdragon X Plus chip, delivers impressive performance and battery life. The redesigned tablet, featuring a fanless design and a repositioned stylus, combines the best of tablets and laptops. While some apps, like Premiere Pro, still require Intel-based versions, the overall experience is smooth and versatile.",
      "score": 177,
      "created_utc": 1749332487.0,
      "replies": [
        {
          "id": "mwkzaov",
          "author": "tablepennywad",
          "body": "What the point in Snapdragon now that lunar lake has near parity in battery and higher performance and 0 worries of compatibility?",
          "score": 48,
          "created_utc": 1749344657.0,
          "replies": [
            {
              "id": "mwlp2h5",
              "author": "Esfahen",
              "body": "Native Arm apps on the latest Snapdragon outperform Lunar Lake, as far as I have seen.\n\nThe issue is most of the ecosystem still runs on emulated x64 which has a 15-20% perf penalty, which makes it fall behind. Additionally the battery usage is WAY better for native apps.",
              "score": 42,
              "created_utc": 1749355211.0,
              "replies": [
                {
                  "id": "myefx6e",
                  "author": "tablepennywad",
                  "body": "But how many native apps are there? Who are making them? If you are in any main professional field, there are none. You either go Wintel or Apple ARM.",
                  "score": 2,
                  "created_utc": 1750225210.0,
                  "replies": [
                    {
                      "id": "myehxp7",
                      "author": "Esfahen",
                      "body": "At this point it’s just a matter of lack of developer awareness for MSVC cross-compilers, and such a small amount of time between now and when the first laptop form factor Arm PC came out (last year). (Not counting Surfaces as a PC) for awareness to grow.\n\nI think people overestimate how hard it is to cross-compile for Windows on Arm. It’s literally just a couple extra linker and compiler flags and maybe some extra work for remapping your SIMD (for which there are several MIT-licensed [open source projects](https://github.com/simd-everywhere/simde) making it dead easy) for an instant 20% CPU lift. Don’t want to port all the middle-ware? Ok just compile for Arm64EC instead. Any competent dev can do it in a couple days on their project (yes, that includes software as complex as AAA games).",
                      "score": 1,
                      "created_utc": 1750226265.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwlftv4",
              "author": "Relevant-Doctor187",
              "body": "It’s not x86.",
              "score": 14,
              "created_utc": 1749351211.0,
              "replies": []
            },
            {
              "id": "mwm54tw",
              "author": "ThisI5N0tAThr0waway",
              "body": "Once the switch to Arm is completely done,  the performance per watt should be much better.  I just bought a MacBook Air for this reason.",
              "score": 0,
              "created_utc": 1749363197.0,
              "replies": [
                {
                  "id": "mwmc4dh",
                  "author": "AreYouOKAni",
                  "body": "> Once the switch to Arm is completely done\n\nGood joke, my man. Good joke.",
                  "score": 26,
                  "created_utc": 1749367094.0,
                  "replies": [
                    {
                      "id": "mwoxmx3",
                      "author": "Edward_TH",
                      "body": "Yeah, even x86 is still going super strong 20 years after people were certain it would be completely gone after 2010...",
                      "score": 4,
                      "created_utc": 1749405182.0,
                      "replies": [
                        {
                          "id": "mwsx1nx",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -1,
                          "created_utc": 1749461709.0,
                          "replies": [
                            {
                              "id": "mx3j54w",
                              "author": "heyhotnumber",
                              "body": "Reading comprehension not your strong suit?",
                              "score": 1,
                              "created_utc": 1749593533.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mwsgfih",
                      "author": "REV2939",
                      "body": "RISC-V will eventually go further than ARM but neither will go as far as x86/AMD64 did collectively. But all things tech, who knows what breakthroughs will come next year...",
                      "score": 1,
                      "created_utc": 1749451908.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mwoj1qi",
                  "author": "flatroundworm",
                  "body": "Unfortunately I don’t think you’re gonna get anything on par with apple silicon out of Qualcomm.",
                  "score": -1,
                  "created_utc": 1749400826.0,
                  "replies": [
                    {
                      "id": "mwouos3",
                      "author": "Esfahen",
                      "body": "Considering Qualcomm’s CPU architecture is made by the creators of Apple Silicon (Nuvia), I’d bet money you are wrong. They will be most limited by the Windows ecosystem, if anything. \n\nArm ports for all Windows middleware are being worked on right now, support is added in commercial engines, and I would expect AAA games to release native ports in the next year.\n\nDevs already need to target Arm for Switch 1 + 2 anyway. Not much harder to recompile for Windows.",
                      "score": 9,
                      "created_utc": 1749404309.0,
                      "replies": [
                        {
                          "id": "mwxtjgp",
                          "author": "Fwiler",
                          "body": "For number one, please show us.  For number two, you expect but have nothing and they will only develop if there are enough sales? Number 3, I'm not even sure where you get Switch to Windows easy to recompile from.",
                          "score": 1,
                          "created_utc": 1749518816.0,
                          "replies": [
                            {
                              "id": "mwxyusi",
                              "author": "Esfahen",
                              "body": "Compiling for a Switch platform target requires the Clang Arm64 compiler. Targeting for Switch means you have ported your SSE/AVX SIMD instructions (used all over a AAA engine for animation, occlusion culling, vector math libraries) into NEON intrinsics. This also happens to be 99% of the pain in x86 -> Arm game ports. This makes the added effort for compiling native Windows on Arm very small, just a couple of MSVC compiler and linker flags and tweaks to build system. There are also instruction mapping libraries like SIMDe which simplify this process greatly. \n\nAdditionally Windows has the Arm64EC binary type which is interoperable with emulated x64, making the porting process even easier in case some proprietary middleware your game depends on has not published Arm libs.\n\nIf you want an example of ported Arm middleware for games just look at the Cyberpunk Switch 2 port. They have a splash screen on game load of all their licensed middleware. For commercial engines you can just pull latest UE5 or Unity and see Windows Arm64 build targets right there.\n\nI will not answer your questions on market adoption or ports, just check back in a year and you’ll see. The effort-to-perf ratio of acquiring 15-20% free CPU perf and better battery is too attractive to pass up.",
                              "score": 3,
                              "created_utc": 1749520606.0,
                              "replies": [
                                {
                                  "id": "mx4dlcq",
                                  "author": "Fwiler",
                                  "body": "So you don't know about Qualcom vs Apple Silicon performance but you're willing to bet on it?  You are waiting until next year for AAA games but yet you say it's easy to port.  And you won't speculate on market adoption or ports.  Not to mention the horrible performance in apps against a simple macbook air shown on dozens of youtube videos. Or what happens to Windows performance when you unplug from power supply.\n\nSounds like a solid foundation to me.  The 'ya but just you wait' has been going on forever bud.  People don't sit around and wait, they buy what works really good right now.\n\nI'm not saying this is a bad product, but it doesn't do anything extremely well.  Just like when we had Windows Arm 12 years ago.",
                                  "score": 1,
                                  "created_utc": 1749603796.0,
                                  "replies": [
                                    {
                                      "id": "mx4elu5",
                                      "author": "None",
                                      "body": "[removed]",
                                      "score": 2,
                                      "created_utc": 1749604152.0,
                                      "replies": [
                                        {
                                          "id": "mx5b7k7",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": 0,
                                          "created_utc": 1749616780.0,
                                          "replies": [
                                            {
                                              "id": "mx5rni4",
                                              "author": "Esfahen",
                                              "body": "Correlating low market adoption with a new platform's viability just sounds like someone laughing at a Model T while riding a horse in 1908.   \n  \nThe problem is you are thinking way too hard about one device and not about the evolution of an entire CPU architecture into PC gaming; which is speeding up, not slowing down. This has resulted in us speaking past each other. If you actually care about this topic and want to know more, you can keep reading.  \n  \nx86 has had a 45 year monopoly on personal computing, yes. That can be expected to happen when MS-DOS is written with x86 Assembly. An entire developer ecosystem naturally forms around it too.  \n  \nArm on the other hand has taken a stranger path over the same length of time. As far as Windows goes, it began with Embedded Compact in 2007, graduated to tablets and phones with Windows 8 RT in 2012 (with several iterations over the next decade), and now to the laptop form factor in 2024 with Windows 11.   \n  \nWindows 11 introduced 64-bit Arm as a first class citizen to the operating system. It also added MSVC Arm 64-bit compilers for developers to easily build for the native runtime. Additionally, the complementary x64 emulation layer enables the decades of published software for the platform, which will become less and less needed as more developers target native. Considering all of that, plus remote debuggers, integrating support for it into a AAA game build system is as simple as doing so for other platforms like PS5 or Xbox (which I have also done).\n\nAll of this is to say that there are forces more powerful than current markets, there is also the force of a 10+ year compounding momentum of technological progress coming at the market like a tsunami. The advantages of RISC-based architectures for battery life and performance are clear; we already know NVIDIA is working on one too which is going to be huge and only further accelerate all of this. \n\nAdditionally, pointing out low market adoption while using a Macbook as a superior example does not make any sense, when OSX has less than 2% of usage in the Steam Hardware Survey. \n\nI am also an engineer in this industry, have been writing high-performance low-level software for 15+ years, and work on things directly concerned with this topic. I don't really care whether you believe me or not, because I can tell that you are someone that cares more about being right on the internet rather than having good-faith discussions. I can simply go into work tomorrow and push things a little further along, and know you will believe me in the end once the next generations of hardware come out and all the games run on them fast as fuck.",
                                              "score": 2,
                                              "created_utc": 1749625398.0,
                                              "replies": [
                                                {
                                                  "id": "mx76tv5",
                                                  "author": "Fwiler",
                                                  "body": "Being right is kind of the point. Fanciful thinking doesn't cut it. You don't seem to care about facts.  Got it.\n\nYou bring up macbook in steam hardware survey? Are you really that dense? The comment was about performance. Not gaming on Steam. Do you get that? Do you understand simple English? This has nothing to do with gaming. The world doesn't revolve around that. If you do want to talk about that, even Intel's Lunar Lake integrated graphics mops the floor compared to Qualcom. Where's nvidia's drivers for windows on arm?\n\nLow market adoption is because it doesn't perform bud. The experience is bad. It has crappy reviews.  It has compatibility problems. Get that in your head. You are all hell bent on gaming too, which shows your simplistic view on this.  I don't give a crap about gaming.\n\nIf something comes out that can give a better experience, then I'm all for it.  Thinking it's only one year away? No. People have been saying that for 10 years. Right now arm is good for server duties where custom software is built for it. That's not something consumers buy.",
                                                  "score": 2,
                                                  "created_utc": 1749649669.0,
                                                  "replies": [
                                                    {
                                                      "id": "mx7ykur",
                                                      "author": "Esfahen",
                                                      "body": "\"Fanciful thinking\" is an interesting way to refer to authoritative facts. Not my fault that you refuse to accept them.\n\nThinking that device performance has nothing to do with games, the most surgically optimized form of software there is, is also a very interesting thing to say. I'm not going to connect dots that a 10 year old can draw with a crayon.\n\nSaying that Arm CPU architectures are only good for servers while jerking off over a MacBook, *which has had an Arm-based CPU architecture for five years now*, makes you look like a fool.\n\nNot being able to accept that these same Arm-based architectures are also coming to Windows/Linux laptop form factors for the same battery life and performance reasons, also makes you look like a fool with their head in the sand.\n\nNot being able to understand that technology continuously improves, pointing at product reviews as if they are a tombstone for an entire instruction set / CPU design that we *know* is superior for the mobile form factor, makes you look like a fool.\n\nYour failure to educate yourself on any of this is not my problem to solve.",
                                                      "score": 1,
                                                      "created_utc": 1749657826.0,
                                                      "replies": [
                                                        {
                                                          "id": "mxad05l",
                                                          "author": "Fwiler",
                                                          "body": "You have no facts bud.  LOL to authoritative. You are not an authority to anything. You haven't demonstrated one thing.\n\nI can see your attacks are immature, so you have resorted to name calling because you don't have a leg to stand on.  It's so funny you keep bringing up the macbook.  You must be really butt hurt about mac's. I said it was better than the qualcom.  That's it. You said you would bet against that, which shows you don't know anything. You still have a reading comprehension issue and so you make stuff up to attack.  Arm servers have nothing to do with Mac, but yet you are trying desperately to make a correlation to attack me. Logical thinking and reading comprehension are not your forte bud.\n\nPoor liitle gamerz boy got his ego hurt because he can't prove anything.  Keep moving the goal posts. Lets see what bs you can add to the conversation next.\n\nWhat product reviews, or did you just make something up again? Seems so, but if you want me to show you products reviews stomping the Surface I can.\n\nSense you are a gamerz dude, show me the superior arm gaming machine I can buy right now, fool.  Games are the most surgically optimized form of software?  Wow, that the most asinine thing I've ever heard. Did you really come up with that yourself, or are you relying on your chatgpt buddy.\n\nThe point is- you have nothing to show that is superior in any form that I can buy right now.  No Sht something in future will be more performant.  Everything will be.  If that's all you have to go on, is something made up in the future, then have fun in la la land.",
                                                          "score": 2,
                                                          "created_utc": 1749683321.0,
                                                          "replies": [
                                                            {
                                                              "id": "mxal98b",
                                                              "author": "PrivateUseBadger",
                                                              "body": "I hope you two continue this conversation, because watching you call someone “bud” repeatedly while consistently being condescending and then clapping back by calling the other party immature after initially being the immature party is truly hilarious. I thank you for the amusement. Truly.",
                                                              "score": 1,
                                                              "created_utc": 1749686121.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mxb6woh",
                                                                  "author": "Fwiler",
                                                                  "body": "No problem, I don't use foul language or interject anything made up.  But last one broke the straw and actually called him a fool, but that was to use his own language to make a point.",
                                                                  "score": 2,
                                                                  "created_utc": 1749693909.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mwm6ivc",
                  "author": "min0nim",
                  "body": "Pestilence per watt sums up the Windows laptop experience completely.",
                  "score": -6,
                  "created_utc": 1749363977.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwlh5v1",
              "author": "Fedoraus",
              "body": "mobile developers can port phone apps to windows easier on ARM i think?",
              "score": 2,
              "created_utc": 1749351771.0,
              "replies": []
            },
            {
              "id": "mwnmqxv",
              "author": "karatekid430",
              "body": "Break the duopoly of x86.\n\nx86 is incompatible with ARM and since apps like ChatGPT have been released with no x86 version, we should be wondering why there is no way to run arm64 code on Intel chips, which seems to be a liability.",
              "score": -7,
              "created_utc": 1749390631.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwnuyjd",
          "author": "r_golan_trevize",
          "body": "> While some apps, like Premiere Pro, still require Intel-based versions\n\nI don’t understand this. The whole reason I bought a Surface Pro 3 eons ago was because I could run real desktop apps on a tablet with a pen and be productive without having to get out of bed or off the couch. It was a 100%, uncompropmised Windows compatible machine in a tablet form factor. If I want a tablet that can’t run the full Adobe suite, I’ve got iPads for that. \n\nThat poor old Pro 3 is still chugging along. It’s useless as computer in its own anymore but it still makes a fabulous terminal for Remote Desktop or as a wireless and portable second display for a laptop. I got my money’s worth out of that thing.",
          "score": 6,
          "created_utc": 1749393369.0,
          "replies": [
            {
              "id": "mwo7j3t",
              "author": "ThatGuyTheyCallAlex",
              "body": "It’s Adobe’s fault their software doesn’t run natively on ARM, not Microsoft/the product’s fault. It’s a current software limitation because developers are lazy rather than a fundamental flaw with the product category.\n\nSupport for ARM is catching on really slowly in the Windows world, unlike with macOS where it literally had to happen overnight. Most Windows software will have to run through an emulation layer rather than natively.",
              "score": 8,
              "created_utc": 1749397270.0,
              "replies": [
                {
                  "id": "mwor2g4",
                  "author": "ineververify",
                  "body": "That’s just one example though.  I have many other pieces of software that will never get updated to function on ARM.",
                  "score": 1,
                  "created_utc": 1749403230.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwk3wqi",
          "author": "DecoyOne",
          "body": "It’s a product review. You don’t need to save a click with a product review. \n\nThis isn’t clickbait.",
          "score": 18,
          "created_utc": 1749333088.0,
          "replies": [
            {
              "id": "mwm429a",
              "author": "RippFlombay",
              "body": "i mean, to me being “saved a click” is more about saving time than avoiding clickbate. it’s more “answer to the question the headline is asking” so i don’t have to skim three paragraphs, rather than “is the article clickbate or not”.",
              "score": 10,
              "created_utc": 1749362601.0,
              "replies": []
            },
            {
              "id": "mwkzrr7",
              "author": "stefanopolis",
              "body": "Can someone get me a TLDR of this comment? /s",
              "score": 31,
              "created_utc": 1749344846.0,
              "replies": [
                {
                  "id": "mwmvudo",
                  "author": "doctorcapslock",
                  "body": "\"stfu\"\n\nthere u go",
                  "score": 16,
                  "created_utc": 1749378877.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwl68v7",
              "author": "Drill-In-Me63",
              "body": "Why click when you can stay on reddit did you write it",
              "score": 7,
              "created_utc": 1749347402.0,
              "replies": []
            },
            {
              "id": "mwl0lzr",
              "author": "Son_of_Macha",
              "body": "The Verge requires a subscription though",
              "score": 3,
              "created_utc": 1749345182.0,
              "replies": [
                {
                  "id": "mwl1row",
                  "author": "DecoyOne",
                  "body": "I read the entire article without a subscription",
                  "score": 0,
                  "created_utc": 1749345639.0,
                  "replies": [
                    {
                      "id": "mwo0ivv",
                      "author": "Son_of_Macha",
                      "body": "Did you sign in?",
                      "score": 0,
                      "created_utc": 1749395109.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwmouzp",
              "author": "_scorp_",
              "body": "And yet 81 currently - people disagree with you …",
              "score": 1,
              "created_utc": 1749374731.0,
              "replies": []
            },
            {
              "id": "mwofadj",
              "author": "FlyingBishop",
              "body": "Is this a product review or a fawning advertorial written by AI?",
              "score": 1,
              "created_utc": 1749399661.0,
              "replies": []
            },
            {
              "id": "mwk4vlt",
              "author": "noochies99",
              "body": "Thanks Magic 🪄",
              "score": -15,
              "created_utc": 1749333422.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwmviei",
          "author": "nagi603",
          "body": ">   While some apps, \n\nRiiight, \"some\".",
          "score": 1,
          "created_utc": 1749378684.0,
          "replies": []
        },
        {
          "id": "mwn263a",
          "author": "None",
          "body": "It’s trash lol",
          "score": 1,
          "created_utc": 1749382222.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mwn2j9p",
      "author": "motorboat_mcgee",
      "body": "Non paywall version\n\nhttps://archive.is/a3GQl",
      "score": 9,
      "created_utc": 1749382405.0,
      "replies": []
    },
    {
      "id": "mwk4cvg",
      "author": "spilk",
      "body": "I wish they would come out with an ARM version of the 10\" Surface Go",
      "score": 32,
      "created_utc": 1749333242.0,
      "replies": []
    },
    {
      "id": "mwl6dq2",
      "author": "remedialrob",
      "body": "I just upgraded from the Surface Pro 8 to the 12. I got the 13 inch with 32 GB of Ram and the 1 TB SSD. I do wish they were more variable with the colors since I wanted the Sapphire blue one but I always end up with Silver because they only make the interesting color versions with the most basic of specifications. So if you wanted an upgraded ram, processor, or storage you invariably end up with silver or black. I have noticed some screen wobble that wasn't present on my SP8 but other than that it's been a seamless transition except I can now do a lot more with the 12. Games specifically are much more playable than they were on the 8.",
      "score": 8,
      "created_utc": 1749347454.0,
      "replies": [
        {
          "id": "mx08brj",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1749558944.0,
          "replies": [
            {
              "id": "mx1lvit",
              "author": "remedialrob",
              "body": "Ah so I got ripped off... excellent.",
              "score": 1,
              "created_utc": 1749573832.0,
              "replies": [
                {
                  "id": "mx1nq4s",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1749574348.0,
                  "replies": [
                    {
                      "id": "mx1onec",
                      "author": "remedialrob",
                      "body": "Nope. Pretty sure I got screwed.",
                      "score": 1,
                      "created_utc": 1749574600.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mx8f5s9",
                  "author": "crazysoup23",
                  "body": "The 11 from last year (13 inch screen) is more powerful than the 12 from this year (12 inch screen).",
                  "score": 1,
                  "created_utc": 1749662518.0,
                  "replies": [
                    {
                      "id": "mxh126v",
                      "author": "remedialrob",
                      "body": "So I didn't get ripped off?",
                      "score": 1,
                      "created_utc": 1749771503.0,
                      "replies": [
                        {
                          "id": "mxh3cto",
                          "author": "crazysoup23",
                          "body": "I have no idea what you paid for it, but you did get the more powerful device.",
                          "score": 1,
                          "created_utc": 1749772295.0,
                          "replies": [
                            {
                              "id": "mxh6qe9",
                              "author": "remedialrob",
                              "body": "Well I added in the keyboard and pen. I'm supposed to get $610 back from my Surface 8 Trade in but the final amt before the trade in was $2018.89. Once I get the trade in money back it will end up being about $1,408. I think without the keyboard and pen it would have been closer to $1,100.",
                              "score": 1,
                              "created_utc": 1749773466.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwlzakf",
      "author": "GamingVision",
      "body": "After 3 surface products that have all failed in major ways, I don’t care if it’s Intel or ARM but I’m never buying one again.",
      "score": 11,
      "created_utc": 1749360055.0,
      "replies": [
        {
          "id": "mwsg9zy",
          "author": "REV2939",
          "body": "Its the most buggiest premium product I've ever used. Random hangs, screen goes black for periods of time, power save features work one day fail the next, etc.  Granted this has many traces back to Intel chipset/firmware but damn do they need to do better validation before releasing a product and charging a premium for it.",
          "score": 2,
          "created_utc": 1749451822.0,
          "replies": [
            {
              "id": "mwsrv9z",
              "author": "GamingVision",
              "body": "2/3 of mine had a battery behind the screen expand and pop the screen off.",
              "score": 1,
              "created_utc": 1749458629.0,
              "replies": [
                {
                  "id": "mwst1u3",
                  "author": "REV2939",
                  "body": "Sadly that happens to nearly all tablets that are used a lot from apple, to acer, to lenovo, etc. .",
                  "score": 1,
                  "created_utc": 1749459320.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwnt2uj",
      "author": "4ha1",
      "body": "Kinda bold to trust Microsoft with hardware at this point.",
      "score": 3,
      "created_utc": 1749392761.0,
      "replies": []
    },
    {
      "id": "mwne2d1",
      "author": "BigBobbyCrowbar",
      "body": "I will never trust Microsoft again after their firmware upgrade destroyed my just out of warranty Surface Pro 3 - by making it impossible to recharge the battery.",
      "score": 5,
      "created_utc": 1749387445.0,
      "replies": []
    },
    {
      "id": "mwrvfij",
      "author": "--Arete",
      "body": "Can't stand that unstable keyboard. Especially on the couch.",
      "score": 2,
      "created_utc": 1749441206.0,
      "replies": []
    },
    {
      "id": "mwkbciv",
      "author": "linuxsoftware",
      "body": "This is a bot",
      "score": 5,
      "created_utc": 1749335731.0,
      "replies": []
    },
    {
      "id": "mwp1ulu",
      "author": "djstealthduck",
      "body": "Guess it beats being a lap warmer",
      "score": 1,
      "created_utc": 1749406447.0,
      "replies": []
    },
    {
      "id": "mwse4cc",
      "author": "goldaxis",
      "body": "It's just a worse and slightly cheaper surface pro with a new size to sell more accessories. Even r/surface was unimpressed.",
      "score": 1,
      "created_utc": 1749450606.0,
      "replies": []
    },
    {
      "id": "mwte7l9",
      "author": "hedonistatheist",
      "body": "Paywall",
      "score": 1,
      "created_utc": 1749470170.0,
      "replies": []
    },
    {
      "id": "mwm3x6n",
      "author": "whlthingofcandybeans",
      "body": "Let me know when it can run Linux.",
      "score": -2,
      "created_utc": 1749362522.0,
      "replies": [
        {
          "id": "mwrlk0h",
          "author": "clvlndpete",
          "body": "It can. It’s called WSL.",
          "score": 2,
          "created_utc": 1749437130.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mwm4jzz",
      "author": "thedanyes",
      "body": "Personally I don't get the purpose of these big heavy tablets. Maybe for artists who were in the market for something like a Cintiq but cheaper?\n\nOtherwise why not just get a laptop. I'd choose a Thinkpad or Elitebook over this every time.",
      "score": -5,
      "created_utc": 1749362872.0,
      "replies": [
        {
          "id": "mwmp7xt",
          "author": "desf15",
          "body": "I have 13\" tablet and 13\" laptop and when sitting on a couch I pick first one every time. It's more convenient for me.  Just for web browsing, I'm not any kind of artist.",
          "score": 3,
          "created_utc": 1749374953.0,
          "replies": [
            {
              "id": "mwpfy6e",
              "author": "thedanyes",
              "body": "Sure tablet is more convenient than laptop for web browsing, but a 1.5 pound tablet is a shitty compromise form factor. For casual browsing and media, lightweight tablets are so much better and more ergonomic. For me that cut off is about 350g or 0.8lbs.",
              "score": 1,
              "created_utc": 1749410691.0,
              "replies": [
                {
                  "id": "mwsgnis",
                  "author": "desf15",
                  "body": "I have to disagree. I replaced 10\" tablet with aforementioned 13\" tablet (around 600g if I remember correctly) and it's better for me.",
                  "score": 1,
                  "created_utc": 1749452032.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwo22af",
          "author": "jezevec93",
          "body": "I think many people would like to replace both, their macbook and their ipad. This thing can replace both while it has LTE connection, good stylus and mature operating system. The only \"bad\" thing about it is app compatibility.",
          "score": 2,
          "created_utc": 1749395584.0,
          "replies": []
        },
        {
          "id": "mwobi0l",
          "author": "MisterDonutTW",
          "body": "Doesn't matter how heavy it is if you lay it on your desk.\n\nI don't see the appeal either though, seems pretty niche.",
          "score": 1,
          "created_utc": 1749398486.0,
          "replies": []
        },
        {
          "id": "mwmvzb0",
          "author": "nagi603",
          "body": "Here is one: I'd guess chrome is even more hostile to adblockers, like how the version on smartphones is. It's a lightweight, primarily browsing machine with more control ceded to the corporations.\n\nAnd a Cintiq is a display + drawing device, not an actual independent machine.",
          "score": 1,
          "created_utc": 1749378953.0,
          "replies": []
        }
      ]
    }
  ]
}