{
  "post": {
    "title": "Google wants to make stolen Android phones basically unsellable | Google is upgrading Factory Reset Protection to make it even harder for thieves to sell stolen phones",
    "author": "a_Ninja_b0y",
    "id": "1km92ry",
    "score": 3956,
    "created_utc": 1747206940.0,
    "selftext": "",
    "num_comments": 198,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1km92ry/google_wants_to_make_stolen_android_phones/"
  },
  "comments": [
    {
      "id": "ms8fil6",
      "author": "afurtivesquirrel",
      "body": "All this is actually going to do is take a chunk out of the secondary recycling/resale market. iPhones have had this for ages and it's not like no one steals them anymore.",
      "score": 886,
      "created_utc": 1747208490.0,
      "replies": [
        {
          "id": "ms8jux9",
          "author": "methanol_ethanolovic",
          "body": "If the posts here on Reddit are anything to go by, I'd believe most stolen iPhones are torn down for spare parts, as most people who've had their phone stolen report tracking it to a particular location in China. I think this wouldn't be as viable with Android phones, as for many models, spare parts are readily available, whereas if watching Louis Rossmann has taught me anything, it's that Apple makes extra sure you can't get spare parts for their stuff.",
          "score": 495,
          "created_utc": 1747211238.0,
          "replies": [
            {
              "id": "ms91if2",
              "author": "Slightlydifficult",
              "body": "iOS 18 actually started tying individual parts to an Apple Account to mitigate this. If your phone is stolen, the major parts are basically useless.",
              "score": 114,
              "created_utc": 1747221301.0,
              "replies": [
                {
                  "id": "msdptpx",
                  "author": "lostkavi",
                  "body": "And it has made not a damn difference in the scrap/salvage market. All it has done is make extracting diagnostic information from the phones harder.\n\nSource: Reseller prices haven't budged, but my own aggravation levels have substantially elevated.",
                  "score": 29,
                  "created_utc": 1747274993.0,
                  "replies": []
                },
                {
                  "id": "msf3n5g",
                  "author": "Frankie_T9000",
                  "body": "they didnt do it for this reason, they did it so they could maintain being the sole repairer in effect",
                  "score": 8,
                  "created_utc": 1747300162.0,
                  "replies": []
                },
                {
                  "id": "mspr0cf",
                  "author": "Background-Hyena",
                  "body": "So they register the individual parts' serial numbers to the account? Or is it all tied to the IMEI?",
                  "score": 1,
                  "created_utc": 1747440320.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms8kldx",
              "author": "None",
              "body": "[deleted]",
              "score": 95,
              "created_utc": 1747211711.0,
              "replies": [
                {
                  "id": "ms8yhhn",
                  "author": "None",
                  "body": "When I was in California I had my phone pickpocketed and a few of my other friends. The whole nightclub had to turn on the lights as nearly 50 people were missing phones. It was a ring of phone thief’s and they were targeting different clubs in the city I was in. Then me and my ex tracked our phones to china in little less than a week. It definitely is not your average crackhead it was some sorta operation going on",
                  "score": 103,
                  "created_utc": 1747219876.0,
                  "replies": [
                    {
                      "id": "ms9sift",
                      "author": "DoctorBlock",
                      "body": "Crazy. I lived in San Diego and LA for 8 years and never got pick pocketed. Sorry that happened to you but that is not a normal experience.",
                      "score": 23,
                      "created_utc": 1747231335.0,
                      "replies": [
                        {
                          "id": "ms9tdmt",
                          "author": "None",
                          "body": "It happened in LA and don’t apologize it’s no one fault people were out having a good time and while it sucked at least no one was injured. Stuff like this happens everywhere and it doesn’t make me think of the city any less lol I live in Chicago and it’s a pretty common thing here",
                          "score": 24,
                          "created_utc": 1747231607.0,
                          "replies": []
                        },
                        {
                          "id": "msedn1z",
                          "author": "benchmarkstatus",
                          "body": "I worked at clubs in California and it’s very normal",
                          "score": 3,
                          "created_utc": 1747284886.0,
                          "replies": []
                        },
                        {
                          "id": "msc194r",
                          "author": "VizualAbstract4",
                          "body": "Yeah never, experienced pickpocketing and have lived in Los Angeles for most of my life. Only time anything got “stolen” was when I dropped something at a festival and no one turned it in.",
                          "score": 1,
                          "created_utc": 1747254785.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms9l8at",
                  "author": "alexanderpete",
                  "body": "The pickpockets of London are very good at identifying phones instantly. I've heard just having an android is the most foolproof way to not get snatched.",
                  "score": 16,
                  "created_utc": 1747228961.0,
                  "replies": [
                    {
                      "id": "msaf3re",
                      "author": "stellvia2016",
                      "body": "Yeah, don't have an iPhone or a Samsung Galaxy and you're \"dead\" to any market interest in your phone of any kind.",
                      "score": 11,
                      "created_utc": 1747237974.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms8nzex",
                  "author": "methanol_ethanolovic",
                  "body": "You're probably right, average crackhead will likely not care what phone you have.",
                  "score": 47,
                  "created_utc": 1747213864.0,
                  "replies": [
                    {
                      "id": "ms8wop4",
                      "author": "Danjor_Dantra",
                      "body": "That might be true, but if no one will buy it from them then the average crackhead wont bother. After my state passed laws prohibiting scrap dealers from buying catalytic converters without proper paperwork the number of crackheads cutting them off vehicles went down drastically.",
                      "score": 69,
                      "created_utc": 1747218964.0,
                      "replies": [
                        {
                          "id": "ms92gnl",
                          "author": "MetriccStarDestroyer",
                          "body": "Just worried they'll do the apple route of locking parts to specific IDs",
                          "score": -2,
                          "created_utc": 1747221729.0,
                          "replies": [
                            {
                              "id": "msc2j14",
                              "author": "RadVarken",
                              "body": "It's a concern for the repair market, but having a phone to repair because it's unattractive to theives makes up for it.",
                              "score": 3,
                              "created_utc": 1747255204.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms9ed7r",
                      "author": "DefinitelyNotaGuest",
                      "body": "These phones are usually grabbed by professional theft rings operating together at large events or public spaces. Crackheads aren't smooth or casual looking enough, it's the people bumping in to you in line at the beer tent.",
                      "score": 13,
                      "created_utc": 1747226547.0,
                      "replies": [
                        {
                          "id": "ms9vc26",
                          "author": "methanol_ethanolovic",
                          "body": "Well maybe it's that I don't attend such events, or it's not a thing where I live. Almost everyone I know who's had their phone stolen had it snatched while outside, holding it in their hand.",
                          "score": 4,
                          "created_utc": 1747232209.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msbfi40",
                  "author": "ralts13",
                  "body": "I dont even care if it prevents theft. I feel a little better knowing whoever took my phone has a shit time with it. I hope we reach the point where they have to melt it down.",
                  "score": 8,
                  "created_utc": 1747248364.0,
                  "replies": []
                },
                {
                  "id": "msao13q",
                  "author": "Pigeoncow",
                  "body": "Whenever they find a stash of stolen phones they're almost all iPhones. [Here's an example.](https://www.bbc.co.uk/news/articles/c1wqgn2l7qeo.amp) Sometimes Samsung Galaxy phones get stolen too.",
                  "score": 8,
                  "created_utc": 1747240548.0,
                  "replies": []
                },
                {
                  "id": "msaj4dk",
                  "author": "Vegaprime",
                  "body": "A fellow at my work only got caught because after opening a return envelope he would stuff any android phones into a semi trailer wall cavity because he didn't want them.",
                  "score": 4,
                  "created_utc": 1747239127.0,
                  "replies": []
                },
                {
                  "id": "ms985gf",
                  "author": "Coverartsandshit",
                  "body": "Nice lil bubble you live in.",
                  "score": -3,
                  "created_utc": 1747224150.0,
                  "replies": []
                },
                {
                  "id": "ms94cke",
                  "author": "zkareface",
                  "body": "Likely not, people even struggle to tell if they use android or ios while owning the device. For a thief to notice would be rare I'd say.",
                  "score": -9,
                  "created_utc": 1747222566.0,
                  "replies": [
                    {
                      "id": "msbeqmj",
                      "author": "Sancticide",
                      "body": "Because most people don't care to know the difference and remain ignorant, but a thief is financially incentivized to know, based on sale value on the black market. Why take on risk stealing something they will get less money for? I can't believe this is something you have to think about for more than 5 seconds.",
                      "score": 5,
                      "created_utc": 1747248143.0,
                      "replies": [
                        {
                          "id": "msbfrc6",
                          "author": "zkareface",
                          "body": "You're crazy if you think they just don't drop it in nearest garbage can if they think they can't sell it.\n\nStealing phones is mostly just matter of opportunity, good luck spending time seeing what device it's behind the case. You see how many use those wallet cases on their phones? Best target to steal, no way you see what model it is unless it's unlocked and you shoulder surf the victim before snatching it.\n\nTheir incentive is to grab as many phones as possible in a crowd, dump to a second person and disappear in the crowd again.",
                          "score": 1,
                          "created_utc": 1747248438.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms8p520",
              "author": "arthurdentstowels",
              "body": "This makes the most sense to me. I remember when I was working in tech some time ago, Apple paired the fingerprint reader to the motherboard on the (I think) iPhone 5s so that replacements would render the reader useless.    \nIf people steal iPhones they would only have to discard the motherboard and a couple of other parts then sell the leftovers in the same way that people strip down cars. Replacement parts for a 16 Pro Max are insanely expensive. The battery is £120 just for the part and the screen alone is nearly £800 without installation for a genuine part. Even the lesser models of the 16 line aren't much cheaper because the difference is mostly in the motherboard and camera.   \nYou don't need to sell a complete phone once it's stolen, it's worth almost its retail value sold in pieces.",
              "score": 11,
              "created_utc": 1747214597.0,
              "replies": [
                {
                  "id": "ms8r0mr",
                  "author": "nagi603",
                  "body": "> Apple paired the fingerprint reader to the motherboard on the (I think) iPhone 5s so that replacements would render the reader useless.\n\nNot just that, but they also rendered completely legal OEM parts useless.",
                  "score": 18,
                  "created_utc": 1747215759.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms93e88",
              "author": "ThinkExtension2328",
              "body": "Yea so this dosent work, perhaps on old iPhones but modern iPhones have each component registered to a user. So say someone stole my Taptic sensor while I was getting a screen fix they couldn’t just slap it into another device as it will be paired to my account. To unpair it the user must have fully signed out and removed the device.",
              "score": 11,
              "created_utc": 1747222144.0,
              "replies": []
            },
            {
              "id": "msa441w",
              "author": "None",
              "body": "[removed]",
              "score": 1,
              "created_utc": 1747234811.0,
              "replies": [
                {
                  "id": "msa4471",
                  "author": "AutoModerator",
                  "body": "Your comment has been automatically removed.\n\nSocial media and social networking links are not allowed in /r/gadgets, as they almost always contain personal information and therefore break the [rules of reddit](http://reddit.com/rules).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": 1747234812.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mscatl1",
              "author": "TheDreamWoken",
              "body": "Yup",
              "score": 1,
              "created_utc": 1747257700.0,
              "replies": []
            },
            {
              "id": "msb6gj4",
              "author": "__theoneandonly",
              "body": "> if watching Louis Rossmann has taught me anything, it's that Apple makes extra sure you can't get spare parts for their stuff.\n\n[Apple has a website to buy parts and even rent or sell you the same tools that they use in the apple stores](https://selfservicerepair.com/en-US/order)\n\nLouis Rossmann only has issues because he buys counterfeit parts that are so bad that US customs refuses to let them in the country. Then he goes online and whines that there's some conspiracy that Apple is somehow puppeteering the US government into confiscating illegal goods",
              "score": -7,
              "created_utc": 1747245742.0,
              "replies": [
                {
                  "id": "msjtpra",
                  "author": "GreggAlan",
                  "body": "He bought macbook batteries from the same company that supplied them to Apple. Apple then contacted Canadian customs \\*and flat out lied that the batteries were counterfeit\\* to stop Rossmann from getting them.\n\nYou must either be an Apple employee or super fanboi.",
                  "score": 3,
                  "created_utc": 1747358036.0,
                  "replies": [
                    {
                      "id": "msk0cvc",
                      "author": "__theoneandonly",
                      "body": "Neither, because that’s just objectively not true. He bought them from a company that made samples for Apple, but Apple declined to purchase from that company. When they do that at the phase where batteries are being produced, it’s usually for things like failing Apple’s child labor audit. Then that company decided to continue building more batteries and selling them without authorization from Apple. That’s pretty much the straight up definition of counterfeit of a counterfeit part. So Rossmann was happy to swoop in and buy the counterfeit child labor parts.\n\nAlso, Apple did not contact customs about that shipment of batteries. Apple, like most companies, provide customs with a guide to determine if goods are genuine or not. And those batteries failed the test that Apple had given customs.\n\nHow does Rossmann’s dick taste?",
                      "score": -1,
                      "created_utc": 1747360484.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms8j8tc",
          "author": "Ijustdoeyes",
          "body": "The difference is that iPhone parts are worth money, there's only one source for them and Apple charges a lot for them Android parts not so much, Most manufacturers sell parts or knock offs from Shenzen will work fine.",
          "score": 58,
          "created_utc": 1747210849.0,
          "replies": [
            {
              "id": "ms9bsys",
              "author": "ToMorrowsEnd",
              "body": "samsung phones for parts is a hot market.   thieves want flagship phones not the low grade garbage prepaid stuff that people carry.",
              "score": 10,
              "created_utc": 1747225585.0,
              "replies": [
                {
                  "id": "ms9eiv6",
                  "author": "Ijustdoeyes",
                  "body": "If you steal an iPhone it's a hit market for parts no matter what, what's the point of stealing a low grade android now if you can't resell it?",
                  "score": -8,
                  "created_utc": 1747226604.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms8tvm9",
              "author": "dragon290513",
              "body": "you'd be surprised with the varieties of iphone aftermarket parts",
              "score": 4,
              "created_utc": 1747217430.0,
              "replies": [
                {
                  "id": "ms9381c",
                  "author": "spaceforcerecruit",
                  "body": "And you’d be surprised how frequently they don’t work or stop working after an update.",
                  "score": 12,
                  "created_utc": 1747222067.0,
                  "replies": []
                },
                {
                  "id": "ms9dw4z",
                  "author": "Hendlton",
                  "body": "It's so annoying. It'd be fine if they were at least honest about it. Even paying a lot of money doesn't guarantee quality.",
                  "score": 2,
                  "created_utc": 1747226373.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms920dg",
              "author": "radialmonster",
              "body": "thats not true at all",
              "score": -1,
              "created_utc": 1747221527.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms8lcwu",
          "author": "TheBlueJam",
          "body": "How so? Just reset your phone before selling it, no? What's different?",
          "score": 25,
          "created_utc": 1747212203.0,
          "replies": [
            {
              "id": "ms8mj8v",
              "author": "None",
              "body": "[deleted]",
              "score": 15,
              "created_utc": 1747212942.0,
              "replies": [
                {
                  "id": "ms8n08m",
                  "author": "TheBlueJam",
                  "body": "That's a fault of the person sending it to the reseller/recycler.",
                  "score": 41,
                  "created_utc": 1747213244.0,
                  "replies": [
                    {
                      "id": "ms94tzi",
                      "author": "Small_Editor_3693",
                      "body": "Yes. That’s the problem. It generated ewaste cause people are not smart enough to remove their Apple account.",
                      "score": 14,
                      "created_utc": 1747222775.0,
                      "replies": [
                        {
                          "id": "msa7xkv",
                          "author": "OpenSourcePenguin",
                          "body": "If they are sold with proof, Apple and Google and any other manufacturer should be compelled to remove the lock.",
                          "score": 2,
                          "created_utc": 1747235927.0,
                          "replies": [
                            {
                              "id": "msa8gpt",
                              "author": "Small_Editor_3693",
                              "body": "They shouldn’t be allowed to remove the lock. That just enables theft.",
                              "score": 8,
                              "created_utc": 1747236079.0,
                              "replies": [
                                {
                                  "id": "msb3ilj",
                                  "author": "BurlyJohnBrown",
                                  "body": "I'd prefer theft to massive amounts of ewaste. No other form of commodity is like this. I wouldn't want my jewelry to turn into ewaste if they were stolen either",
                                  "score": -3,
                                  "created_utc": 1747244918.0,
                                  "replies": [
                                    {
                                      "id": "mscokbg",
                                      "author": "Small_Editor_3693",
                                      "body": "If my jewelry got stolen I’d want a button to turn it to ash. Would be sick",
                                      "score": 1,
                                      "created_utc": 1747262121.0,
                                      "replies": [
                                        {
                                          "id": "mse3q0t",
                                          "author": "BurlyJohnBrown",
                                          "body": "Ash isn't ewaste.",
                                          "score": 1,
                                          "created_utc": 1747280431.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "msa8q15",
                                  "author": "OpenSourcePenguin",
                                  "body": "How? That makes no sense \n\nHow can theivs prove that they bought it?",
                                  "score": -2,
                                  "created_utc": 1747236153.0,
                                  "replies": [
                                    {
                                      "id": "msaatj4",
                                      "author": "Small_Editor_3693",
                                      "body": "If it’s stolen and sold on eBay, that’s proof of sale",
                                      "score": 9,
                                      "created_utc": 1747236754.0,
                                      "replies": [
                                        {
                                          "id": "msab80h",
                                          "author": "OpenSourcePenguin",
                                          "body": "That's just proof of buying from ebay, not the owner \n\nThese companies can create a system for buying from the owner specifically if they are so concerned about theft.",
                                          "score": -2,
                                          "created_utc": 1747236871.0,
                                          "replies": [
                                            {
                                              "id": "msabdpm",
                                              "author": "Small_Editor_3693",
                                              "body": "If the owner is involved Apple and Google can and will already remove the account… the issue is the owner doesn’t care",
                                              "score": 5,
                                              "created_utc": 1747236916.0,
                                              "replies": [
                                                {
                                                  "id": "msabubb",
                                                  "author": "OpenSourcePenguin",
                                                  "body": "They would care if the price offered to take it off their hand is different.",
                                                  "score": 1,
                                                  "created_utc": 1747237048.0,
                                                  "replies": [
                                                    {
                                                      "id": "msadgwt",
                                                      "author": "Small_Editor_3693",
                                                      "body": "Why would it be different? The buyer doesn’t know till it shows up at their door",
                                                      "score": 3,
                                                      "created_utc": 1747237513.0,
                                                      "replies": [
                                                        {
                                                          "id": "msaehao",
                                                          "author": "OpenSourcePenguin",
                                                          "body": "That is why things like escrow exist. The buyer also doesn't know if it's a brick until it arrives.",
                                                          "score": 2,
                                                          "created_utc": 1747237798.0,
                                                          "replies": [
                                                            {
                                                              "id": "msahssu",
                                                              "author": "Small_Editor_3693",
                                                              "body": "? So you want to ban selling devices on eBay and Facebook marketplace? Good luck",
                                                              "score": 2,
                                                              "created_utc": 1747238745.0,
                                                              "replies": [
                                                                {
                                                                  "id": "msai2sk",
                                                                  "author": "OpenSourcePenguin",
                                                                  "body": "That's not what I said at all.\n\nIt is like me asking so you are a pro scamer shipping a brick instead of a phone?",
                                                                  "score": 1,
                                                                  "created_utc": 1747238824.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "msaj4r7",
                                                                      "author": "Small_Editor_3693",
                                                                      "body": "And why would I tell you if I was?",
                                                                      "score": 1,
                                                                      "created_utc": 1747239130.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msasvt1",
                  "author": "0GsMC",
                  "body": "\"if you follow xyz on tiktok you'd know that....\"\n\n*slaps you in the face*",
                  "score": 5,
                  "created_utc": 1747241933.0,
                  "replies": []
                },
                {
                  "id": "ms95vha",
                  "author": "OneSeaworthiness7768",
                  "body": "Legitimate resellers/recyclers who take corporate devices have guidelines that the companies providing the phones need to properly wipe them (removing activation locked accounts) or they won’t pay out for them. Companies have device management platforms that remove activation lock without having to manually handle every phone. This is really only a problem for people who deal with stolen devices.",
                  "score": 12,
                  "created_utc": 1747223216.0,
                  "replies": []
                },
                {
                  "id": "msb7kaz",
                  "author": "USeaMoose",
                  "body": "That's an odd argument against this though. That people throw away devices incorrectly is not surprising. A device being sent away without unlocking it first is indistinguishable from one you had stolen. There should just be ways for users to remotely relinquish control of their devices.\n\nYour Apple/Google account should let you remove devices from your control, and trigger a mandatory factory reset. Maybe there could even be a way to trigger that process on a locked phone so that (a limited number of times) the previous owner can be prompted to remove their account.\n\nAnd I'm pretty sure systems like that already exist.",
                  "score": 2,
                  "created_utc": 1747246060.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msb9fnv",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1747246600.0,
              "replies": [
                {
                  "id": "msc4lyh",
                  "author": "ctzu",
                  "body": "> If I smash my screen to kingdom come, or if the battery dies dies and it won't boot - my device is now ewaste and unrepairable because there's no way for me to remove the lock before selling\n\nNothing about this is stopping you from just getting your phone repaired.",
                  "score": 1,
                  "created_utc": 1747255840.0,
                  "replies": [
                    {
                      "id": "msc516y",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1747255964.0,
                      "replies": [
                        {
                          "id": "msf7o3n",
                          "author": "ctzu",
                          "body": "First, that only applies to the niche case where: a) you smash your phone to the point of complete unusability, b) you decide that you do not want to repair it and instead buy a new one and c) a reseller is willing to buy a completely fucked up phone even though they can not  know how much of it is broken. Definitely not nearly common enough to be an argument against theft protection.\n\nSecond, this scenario is easily fixed. The reseller can either reimburse you for the repairs cost if they would normally let a third party fix the broken phone they bought, or, in case they do the repairs themselves, you send the phone in, they repair it, send it back to you to unlock it and then you send it to them again. Again, neither method is so complicated as to warrant not having theft protection on phones.",
                          "score": 1,
                          "created_utc": 1747302659.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msa3j48",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1747234643.0,
              "replies": [
                {
                  "id": "msb49lq",
                  "author": "TheBlueJam",
                  "body": "What? If your screen cracks and stops working resetting it won't fix the screen regardless, unless I'm missing your point?",
                  "score": 1,
                  "created_utc": 1747245126.0,
                  "replies": [
                    {
                      "id": "mscdwhv",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1747258645.0,
                      "replies": [
                        {
                          "id": "msdv2ge",
                          "author": "mailslot",
                          "body": "The owner can remotely erase it from their iCloud account. If it’s not actively marked as stolen, the parts will repair without issue.",
                          "score": 2,
                          "created_utc": 1747276941.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms99fx5",
          "author": "lost_send_berries",
          "body": ">iPhones have had this for ages and it's not like no one steals them anymore.\n\nYou've forgotten what it was like before iPhones had theft protection features.\n\nThis is \"we don't need police because there's no crime\" level logic.",
          "score": 27,
          "created_utc": 1747224669.0,
          "replies": [
            {
              "id": "msb409l",
              "author": "BurlyJohnBrown",
              "body": "I mean Baltimore does prove that fewer police can still coincide with less crime yeah. I think ewaste and resale market suppression are bigger problems than theft.",
              "score": 0,
              "created_utc": 1747245053.0,
              "replies": [
                {
                  "id": "msdw6kx",
                  "author": "mailslot",
                  "body": "Phone theft funds organized crime and spreads violence within communities. Blocking the sale of stolen goods is market suppression? Well shit. Let’s get rid of anti-theft tech in cars.",
                  "score": 2,
                  "created_utc": 1747277361.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msaqlf2",
              "author": "a_cute_epic_axis",
              "body": "> You've forgotten what it was like before iPhones had theft protection features.\n\nAbout the same, actually.",
              "score": -3,
              "created_utc": 1747241287.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms97zmb",
          "author": "Nakatsukasa",
          "body": "Make it an option for people to opt in\n\nMy petty ass will love to brick my 200 dollar android if it's stolen",
          "score": 3,
          "created_utc": 1747224083.0,
          "replies": []
        },
        {
          "id": "ms8jypv",
          "author": "Zillatrix",
          "body": "iPhones have had this for ages and it hasn't taken any chunk of their recycling/resale market. How is it going to affect Andoid?",
          "score": 13,
          "created_utc": 1747211306.0,
          "replies": []
        },
        {
          "id": "ms8h1t2",
          "author": "stuckyfeet",
          "body": "It's a travesty and such waste.\n\nEdit. Answer to the person who replied to me and deleted their comment;\n\nIt's not too hard it's impossible to reset second hand apple stuff, even if it's completely outdated and it produces a large amount of electrical waste. \n\nIn effect you don't actually own the device you buy from apple anymore, they own it and allow you to use it at their discretion.",
          "score": 11,
          "created_utc": 1747209447.0,
          "replies": [
            {
              "id": "ms8rczo",
              "author": "YZJay",
              "body": "They changed it last year. As long as a phone is unlinked from your account, you can harvest it for any part you need after you unlink and factory reset it.",
              "score": 14,
              "created_utc": 1747215964.0,
              "replies": [
                {
                  "id": "ms8rxcy",
                  "author": "stuckyfeet",
                  "body": "Yeah that's the issue though you can't factory reset it even something as simple as an ipod and the customer service is non existent. They even limit the amount of emails you can send from a single email account.",
                  "score": -12,
                  "created_utc": 1747216300.0,
                  "replies": [
                    {
                      "id": "ms950pj",
                      "author": "OneSeaworthiness7768",
                      "body": "Huh? Are you saying you can’t factory reset your own phone and remove your account? That’s blatantly false.",
                      "score": 8,
                      "created_utc": 1747222855.0,
                      "replies": [
                        {
                          "id": "ms95pgl",
                          "author": "stuckyfeet",
                          "body": "You can't factory reset an ipod as example to a fresh start without the activation lock removed. Contact the customer service, no help. Contact a couple of times more and you need a new email adress to contact again.",
                          "score": -5,
                          "created_utc": 1747223146.0,
                          "replies": [
                            {
                              "id": "ms96x3j",
                              "author": "OneSeaworthiness7768",
                              "body": "I think this is a you not knowing what you’re doing problem.",
                              "score": 8,
                              "created_utc": 1747223648.0,
                              "replies": [
                                {
                                  "id": "ms987sc",
                                  "author": "stuckyfeet",
                                  "body": "You can't circumvent an activation lock, even on older ipods so all activation locked older devices that should be reusable are not. It's a huge waste.",
                                  "score": -3,
                                  "created_utc": 1747224176.0,
                                  "replies": [
                                    {
                                      "id": "ms98h3h",
                                      "author": "OneSeaworthiness7768",
                                      "body": "You can’t circumvent an activation lock *of a device you don’t own*. You can reset your own device freely and remove your account if you want to resell it.",
                                      "score": 5,
                                      "created_utc": 1747224282.0,
                                      "replies": [
                                        {
                                          "id": "ms98v56",
                                          "author": "stuckyfeet",
                                          "body": "Not exactly. You can own the device but it can be activation locked if the old owner did not remove the account so it is effectively a huge waste of resources.",
                                          "score": -1,
                                          "created_utc": 1747224439.0,
                                          "replies": [
                                            {
                                              "id": "ms991s6",
                                              "author": "OneSeaworthiness7768",
                                              "body": "You’re completely distorting the argument now lmao. You first said you can’t reset your own devices. Now you’re talking about a second hand device you bought from a rando that was activation locked. Make up your mind. The person who sold you the device is at fault. You can still factory reset your own device and remove the account when you’re the device owner. You probably bought a stolen device, and that’s the whole point ✌️",
                                              "score": 6,
                                              "created_utc": 1747224512.0,
                                              "replies": [
                                                {
                                                  "id": "ms99giu",
                                                  "author": "stuckyfeet",
                                                  "body": "I'm not in an argument, it's just uneccessary electronical waste. \n\nImagine if old gameboys, vinyl players or c-casette walkmans were activation locked that would be nuts.",
                                                  "score": 1,
                                                  "created_utc": 1747224675.0,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "ms9w0hn",
                                                  "author": "nybble41",
                                                  "body": "Their argument has been consistent, and you are the one acting obtuse.\n\nThe owner of the *hardware* is not necessarily the same as the owner of the *account* the hardware is registered to. Apple refusing to recognize the legal owner of the hardware as the \"device owner\" is exactly the problem. It is not uncommon for someone to sell or otherwise legally transfer a device without unregistering it from the original account. They may not even have the necessary credentials for the account (lost password, device was inherited from someone else, abandoned property, etc.). Once those devices would have been usable after a factory reset. Now they are e-waste.",
                                                  "score": -4,
                                                  "created_utc": 1747232415.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms8t4gg",
                      "author": "YZJay",
                      "body": "You don’t own something that you can’t enforce the ownership of. If just about anyone can factory reset your phone and harvest it for parts without you disabling the lock, then it might as well not be your phone.",
                      "score": 8,
                      "created_utc": 1747216994.0,
                      "replies": [
                        {
                          "id": "ms8xcpq",
                          "author": "stuckyfeet",
                          "body": "Either way with the activation lock it never really was your property anyway. Ownership without autonomy is just licensed use.",
                          "score": -8,
                          "created_utc": 1747219308.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mschizs",
              "author": "RampantAI",
              "body": "If my phone gets stolen and I have to buy another that also results in e-waste. Parting out a fully functional phone and having to replace it with an entire new one is extremely wasteful.",
              "score": 1,
              "created_utc": 1747259777.0,
              "replies": [
                {
                  "id": "mse4mbh",
                  "author": "stuckyfeet",
                  "body": "Ok, so if your phone got stolen then you would replace it? I would probably too but buy second hand.",
                  "score": 1,
                  "created_utc": 1747280813.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "msui7pr",
          "author": "Krombasher",
          "body": "I just tried to give my wife my sister's phone and had to go through a whole bunch of hoops to do so.  It's fucking dumb and convoluted.  Lucky enough, I remembered some of my sisters info to do it.",
          "score": 2,
          "created_utc": 1747512935.0,
          "replies": []
        },
        {
          "id": "msa6rr4",
          "author": "system3601",
          "body": "Why? There should be an official way to get your phone ready for sale and factory set it, if someone steals it and doesnt have your fingerprint or password or both and cannot get it ready for sale it would be rendered dead.",
          "score": 1,
          "created_utc": 1747235591.0,
          "replies": []
        },
        {
          "id": "mso2gxu",
          "author": "DavidinCT",
          "body": "Part of me agrees but, part of knows, I have a modern top end Android phone,  if it's stolen from me, it's gone, no tracking and besides ESN ban from the carrier, it will be able to be sold as a complete phone without a problem.\n\nThis would stop that, just like the iPhone has had for years now...",
          "score": 1,
          "created_utc": 1747419920.0,
          "replies": []
        },
        {
          "id": "msamf57",
          "author": "snakeoilHero",
          "body": "You mean like how you cannot replace the screen in an iPhone anymore? \n\nIf you do, expect that camera to get wobbly. Software wobbly. Better buy the new one. Buy Buy Buy. Spend Spend Spend.\n\nNoobs don't know iOS breaks the camera app when it detects a non-matching screen. They must think it's $100 down the way and new screen just as good!",
          "score": -2,
          "created_utc": 1747240080.0,
          "replies": [
            {
              "id": "msdq4q7",
              "author": "lostkavi",
              "body": "Source please?\n\nI've never seen a phone screen replacement mess with the camera.\n\nWouldn't surprise me, but never seen it.",
              "score": 0,
              "created_utc": 1747275102.0,
              "replies": [
                {
                  "id": "msgqktj",
                  "author": "snakeoilHero",
                  "body": "Never answer trolls. They only get mad when proven wrong. Apple fanboy detected. Did you know iPhone is the only smartphone and mp3s didn't exist until iPod? Apple cult activation complete. Why stock going down when lobbyists so strong?",
                  "score": 0,
                  "created_utc": 1747323202.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms8dnks",
      "author": "internetlad",
      "body": "Fuck. Anyone who does tech support for their aging family is screaming in agony right now. ",
      "score": 369,
      "created_utc": 1747207318.0,
      "replies": [
        {
          "id": "ms8eokq",
          "author": "got-trunks",
          "body": "given the difficulty many experience with changing volume or brightness, I would just be proud if they managed to reset and brick their phone.\n\nIt's part of learning",
          "score": 120,
          "created_utc": 1747207960.0,
          "replies": [
            {
              "id": "ms9cvr4",
              "author": "kaisurniwurer",
              "body": "It was a part of learning, it seems. Now it will be a journey to buy a new phone.",
              "score": 8,
              "created_utc": 1747225996.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms8kc65",
          "author": "AzKondor",
          "body": "I've had to reset so many android phones and tablets, because everybody in my family just made a Google account and never had to log in again, ehh. Now I make them for them and force them to remember or write it in safe place down.",
          "score": 48,
          "created_utc": 1747211546.0,
          "replies": [
            {
              "id": "msa62on",
              "author": "Candle1ight",
              "body": "My parents passwords end up in my password manager because they're sure to forget it",
              "score": 9,
              "created_utc": 1747235388.0,
              "replies": [
                {
                  "id": "msadixw",
                  "author": "dandroid126",
                  "body": "I put all of my wife's passwords in my password manager. She tries to be good and use a different password for everything, but then she doesn't remember it. So in my password manager it goes.",
                  "score": 4,
                  "created_utc": 1747237529.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms9ec81",
              "author": "FoxyBastard",
              "body": "Same.\n\nRemember to write it down for yourself too.\n\nIf they're anything like my family, when the time comes, they will have no fucking clue where it is.",
              "score": 9,
              "created_utc": 1747226537.0,
              "replies": [
                {
                  "id": "msbg89q",
                  "author": "camwow13",
                  "body": "I just make a new bitwarden for each of the old people I support. Simplified so much of grandmas tech support...",
                  "score": 2,
                  "created_utc": 1747248572.0,
                  "replies": [
                    {
                      "id": "mscasz0",
                      "author": "FoxyBastard",
                      "body": "I have a tendency to do things like this \"manually\", but, after having a look at bitwarden, it does seem more logical.\n\nThanks for the suggestion.",
                      "score": 1,
                      "created_utc": 1747257694.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msc3p89",
              "author": "SuperFLEB",
              "body": "Cue \"Why is the password so long?\" complaining.",
              "score": 2,
              "created_utc": 1747255571.0,
              "replies": []
            },
            {
              "id": "msbyxun",
              "author": "a7Rob",
              "body": "Jup and good luck getting into your Google or Gmail Account even If you remember the Password but Had some failed attempts from a different device. Its byebye.\n\nComplete Joke that there is No customer service for gmail",
              "score": 1,
              "created_utc": 1747254055.0,
              "replies": []
            },
            {
              "id": "ms9f97v",
              "author": "Hendlton",
              "body": "That doesn't work. They'll just lose whatever they wrote it on. I hate the era of FRP with a passion.",
              "score": 1,
              "created_utc": 1747226868.0,
              "replies": [
                {
                  "id": "ms9pyqb",
                  "author": "SchighSchagh",
                  "body": "frp?",
                  "score": 5,
                  "created_utc": 1747230530.0,
                  "replies": [
                    {
                      "id": "ms9rp9i",
                      "author": "Hendlton",
                      "body": "Factory Reset Protection. Basically if you factory reset a phone that has it, it requires the user's email and password to unlock. The problem is that nobody remembers their damned emails and passwords. It would be nice if it actually worked for preventing theft or something, but you can literally just google \"how to bypass frp\" and you get instructions.\n\nIt does nothing to stop thieves and it locks legitimate users out of their phones. Only the dumb users, sure, but there are a lot of dumb people out there, which includes a significant portion of my friends and family.",
                      "score": 10,
                      "created_utc": 1747231082.0,
                      "replies": [
                        {
                          "id": "msadbpt",
                          "author": "dandroid126",
                          "body": "That last part sounds like an implementation problem, not a problem with FRP in theory.\n\nI really think we should normalize using password managers. That would solve the first issue.",
                          "score": 4,
                          "created_utc": 1747237473.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms8qmcq",
          "author": "nagi603",
          "body": "Also probably will attempt to kill the 3rd party ROMs. That continue to provide support to the users way longer and usually better than factory.",
          "score": 14,
          "created_utc": 1747215521.0,
          "replies": [
            {
              "id": "ms9k7rh",
              "author": "internetlad",
              "body": "We so badly need a good third option in phone OSes",
              "score": 10,
              "created_utc": 1747228617.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msaj15q",
          "author": "aj_thenoob2",
          "body": "But I think the article states only if you reset it through the software or using the find phone feature.",
          "score": 1,
          "created_utc": 1747239101.0,
          "replies": []
        },
        {
          "id": "ms8lu6e",
          "author": "Kazer67",
          "body": "That's why I'm the one that prepare any new phone before I hand them to my family.\n\n  \nI still need to find a somewhat secure way of having access to the phone if the screen die (would be cool to be able to unlock the phone in recovery with a PGP key of some kind. I know: backup, backup but I haven't found a good way to backup automatically important stuff which include contact, SMS and what not.  \nThe only way I found is to use syncthing in a way it isn't made to be used: sync toward the computer but without the deleting part of the syncro).",
          "score": 0,
          "created_utc": 1747212504.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms8jjnq",
      "author": "sithelephant",
      "body": "I have several times bought broken phones, and fixed them for personal use. \n\nNot at least being able to pop a message on the original account saying 'Your phone has been wiped, was it stolen?' and then permitting if not confirmed stolen or similar is unfortunate.\n\nIt also means that if your google account is deleted, or you can't access the internet, (either due to the wifi breaking or ...) if this is triggered, you're kinda fucked.",
      "score": 17,
      "created_utc": 1747211038.0,
      "replies": []
    },
    {
      "id": "ms8dddn",
      "author": "got-trunks",
      "body": "Finally using their invasive control for the betterment of the consumer. To a degree. Probably just had to iron out all the backdoors with 5 eyes partners.",
      "score": 79,
      "created_utc": 1747207143.0,
      "replies": [
        {
          "id": "ms93x6t",
          "author": "MetriccStarDestroyer",
          "body": "> betterment\n\nUntil it starts harming repairability :(",
          "score": 38,
          "created_utc": 1747222378.0,
          "replies": []
        },
        {
          "id": "msc8udj",
          "author": "takecare60",
          "body": "They're not doing it to deter thieves, they're doing it to have more control and worse repairability",
          "score": 8,
          "created_utc": 1747257100.0,
          "replies": []
        },
        {
          "id": "msagaxd",
          "author": "nonowords",
          "body": "lol, this isn't good for consumers, phones will still be stolen, but now normal legitimate secondary phone markets and repairs are gonna be harder.",
          "score": 10,
          "created_utc": 1747238314.0,
          "replies": []
        },
        {
          "id": "ms9c3kv",
          "author": "mirh",
          "body": "There were never no backdoors, in fact they had to plant a spyware in their servers 14 years ago.",
          "score": -14,
          "created_utc": 1747225697.0,
          "replies": [
            {
              "id": "ms9m7hu",
              "author": "ExtremeCreamTeam",
              "body": "> in fact they had to plant a spyware in their servers 14 years ago.\n\nMy web searches aren't turning up anything about this. What are you referring to?",
              "score": 7,
              "created_utc": 1747229290.0,
              "replies": [
                {
                  "id": "msa6ud0",
                  "author": "mirh",
                  "body": "https://en.wikipedia.org/wiki/MUSCULAR",
                  "score": -1,
                  "created_utc": 1747235613.0,
                  "replies": [
                    {
                      "id": "msbfbx7",
                      "author": "ExtremeCreamTeam",
                      "body": "I'm glad you actually had a source for something, but this isn't spyware. \n\nIt is however, a security breach, and one that has been remedied, according to your own link.",
                      "score": 5,
                      "created_utc": 1747248314.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "msadezn",
      "author": "Vexerino1337",
      "body": "just give us a self destruct option that can be triggered remotely",
      "score": 13,
      "created_utc": 1747237498.0,
      "replies": [
        {
          "id": "msb86cv",
          "author": "ApeApplePine",
          "body": "This",
          "score": 1,
          "created_utc": 1747246236.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msamx3u",
      "author": "John_Coutinho",
      "body": "sure. but in most countries...they use stolen phones for spare parts.",
      "score": 5,
      "created_utc": 1747240224.0,
      "replies": []
    },
    {
      "id": "ms8go0f",
      "author": "-Staub-",
      "body": "No way this isn't about removing the ability to resell phones.\n\nEDIT: People in the comments pointed out that it shouldn't affect reselling because it doesn't apply to all forms of reset by default",
      "score": 81,
      "created_utc": 1747209207.0,
      "replies": [
        {
          "id": "ms8jbdm",
          "author": "suvlub",
          "body": "Looks like this won't affect all methods of factory reset, and actually won't affect the most straightforward one that most people probably use (via the setting app)",
          "score": 20,
          "created_utc": 1747210893.0,
          "replies": [
            {
              "id": "msbgyxk",
              "author": "306bobby",
              "body": "Frp has been a thing for a while, it's just now more active. And yes, it mostly lies in bootloader/recovery factory resets, not userspace",
              "score": 2,
              "created_utc": 1747248785.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms8jsv2",
          "author": "Zillatrix",
          "body": "This is no way preventing any kind of resale, unless the phone was stolen. All you need to do is to reset your phone before selling it (which you should do) to skip this protection.\n\nBe suspicious but don't be paranoid.",
          "score": 81,
          "created_utc": 1747211201.0,
          "replies": [
            {
              "id": "msa49fv",
              "author": "Deep90",
              "body": "Actually has a chance to increase resale prices because stolen phones will be stripped and parted out instead.",
              "score": 2,
              "created_utc": 1747234854.0,
              "replies": []
            },
            {
              "id": "msah9zu",
              "author": "SegaGuy1983",
              "body": "![gif](giphy|BtvBUbRRJxwQ5gfvTm|downsized)",
              "score": 1,
              "created_utc": 1747238593.0,
              "replies": []
            },
            {
              "id": "ms9cb1o",
              "author": "jackmax9999",
              "body": "It's absolutely about harming resale and recycling. Loads of people just throw away their phones, forget passwords and not bother to unlock or factory reset anything. Protection against thieves is just a side effect and public-facing explanation.",
              "score": -8,
              "created_utc": 1747225777.0,
              "replies": [
                {
                  "id": "ms9cubw",
                  "author": "Zillatrix",
                  "body": "> just throw away their phones\n\nSo they aren't really reselling their phones.\n\n> not bother to unlock or factory reset anything\n\nThen they aren't really in the market for reselling their phones.\n\n> forget passwords\n\nThat's their problem. Can you sell your reddit account if you forget your password?\n\nIf phone owners forget their google account password AND their screen locks, then they haven't been actively using that phone for quite a while. They aren't any sizable part of the resale market.\n\nIn fact, according to my statistics that you have zero way of disproving, 99.98% of all phone sales that are legitimate (not stolen) are done by people who either remember their google account or their screen lock passwords.\n\nAlso, 100% of all stolen phone resales are done by people who can't log into the google account and can't know the screen lock.",
                  "score": 22,
                  "created_utc": 1747225981.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msb4rpw",
              "author": "BurlyJohnBrown",
              "body": "No one actually resets their phone. Few even remember their email and password. This will create tons of waste.",
              "score": -4,
              "created_utc": 1747245265.0,
              "replies": [
                {
                  "id": "msb58cx",
                  "author": "Zillatrix",
                  "body": "No one resets before selling? They just give it away with their dick picks on the phone?\n\nHow many phone sales have you participated in?\n\nAlso, those who don't remember their account passwords (most grannies) can still remember their screen lock, which is enough to reset with the new protection.",
                  "score": 6,
                  "created_utc": 1747245394.0,
                  "replies": []
                },
                {
                  "id": "msjkyef",
                  "author": "bigsquirrel",
                  "body": "You buy a lot of stolen phones huh?",
                  "score": 1,
                  "created_utc": 1747354731.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms9q9x2",
          "author": "alc4pwned",
          "body": "If anything shouldn't this improve resale values? Since there will be fewer stolen phones on the market.",
          "score": 6,
          "created_utc": 1747230629.0,
          "replies": []
        },
        {
          "id": "ms8kecq",
          "author": "Nyoka_ya_Mpembe",
          "body": "You're right, thief will have fewer options to resell.",
          "score": 11,
          "created_utc": 1747211585.0,
          "replies": []
        },
        {
          "id": "ms9rjda",
          "author": "timelessblur",
          "body": "More the other way around it will increase the value of the resale market as now it greatly reduces the likelihood that it is a stole Android phone belong flipped. \nIt does not take very many stolen phones on the market to really start tanking resale value across the board.",
          "score": 2,
          "created_utc": 1747231030.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms8f4j4",
      "author": "THX_2319",
      "body": "While this is somewhat positive news, there's always going to be a thriving market for parts",
      "score": 10,
      "created_utc": 1747208243.0,
      "replies": [
        {
          "id": "ms8fvv6",
          "author": "CoolDuud2000",
          "body": "Thats why apple has all parts coded",
          "score": 11,
          "created_utc": 1747208723.0,
          "replies": [
            {
              "id": "ms8jazy",
              "author": "sdavids6",
              "body": "I feel like apple does that to monopolise repairs and parts. Any benefit that comes around theft is likely coincidence",
              "score": 26,
              "created_utc": 1747210886.0,
              "replies": [
                {
                  "id": "ms8jhr7",
                  "author": "CoolDuud2000",
                  "body": "Yeah i thought about it too after i commented, repairwise, its terrible, i remember when i worked on iphone 6’s  when 7 was newest model. You literally buy multiple broken iphones and just mash them into one working one and it has no problems, only touch id should be same as it came with motherboard",
                  "score": 7,
                  "created_utc": 1747211005.0,
                  "replies": [
                    {
                      "id": "ms8k7oz",
                      "author": "THX_2319",
                      "body": "Yeah, the Apple thing is so anti right to repair. It's the extreme end of things which ultimately hurts consumers. You SHOULD be able to repair individual components yourself if you know how, especially considering that generally speaking, when a phone 'dies', there are functional parts that can be put on another phone that needs it. In an era where phones are lasting longer than they used to, this has never been more necessary. The trade off is that the market for these things continues to exist.",
                      "score": 2,
                      "created_utc": 1747211465.0,
                      "replies": [
                        {
                          "id": "ms8ldp1",
                          "author": "CoolDuud2000",
                          "body": "It all went downhill after glass back was introduced 😭",
                          "score": 2,
                          "created_utc": 1747212217.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "msb7l3u",
                  "author": "__theoneandonly",
                  "body": "Not really. These days, Apple won't stop an unauthorized part from running in their phone unless it's a part that was taken from a device that is marked as stolen. Then the OS will refuse to use that part.\n\nThey'll put a message in the settings menu that an unauthorized repair was done, and tell you which parts were replaced. It even tells you what authorized repairs were done, too. But I think that's a good thing, if you're buying a used phone, you'll want to see that.\n\nApple's gotten a lot more repair-friendly in the last few years. As the world governments have been trying to keep them on a tighter leash, they're trying to pick their battles more carefully.",
                  "score": 1,
                  "created_utc": 1747246067.0,
                  "replies": [
                    {
                      "id": "msc3jdb",
                      "author": "erdogranola",
                      "body": "They still limit the functionality though, for example auto brightness doesn't work unless you've had a certified repair",
                      "score": 1,
                      "created_utc": 1747255522.0,
                      "replies": [
                        {
                          "id": "mscnr96",
                          "author": "__theoneandonly",
                          "body": "That was a bug that was fixed like two years ago. Each screen has a configuration profile on Apple’s servers from the calibration done at the factory, and auto-brightness and True Tone require that configuration information. When you use a non-Apple screen, there was no profile to download so the phone would throw and error and disable the features. But now they have it where it defaults to a generic profile.",
                          "score": 1,
                          "created_utc": 1747261846.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "msbev3b",
              "author": "BlastFX2",
              "body": "You know how else they could completely obliterate that market? If they just fucking sold them!",
              "score": 2,
              "created_utc": 1747248179.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms9r2t7",
      "author": "Brave-Algae-3072",
      "body": "They aren't stealing it to resell it. They are selling it to be broken down and the gold extracted.",
      "score": 6,
      "created_utc": 1747230885.0,
      "replies": []
    },
    {
      "id": "ms9bie8",
      "author": "ToMorrowsEnd",
      "body": "google is like 400 years behind thieves.  they dont sell phones intact.  they send the phone to china buyers like they do with iphones.   the devices are stripped for parts.\n\nThey are worth more as parts than as a stolen phone.",
      "score": 8,
      "created_utc": 1747225472.0,
      "replies": [
        {
          "id": "ms9jiti",
          "author": "Smartnership",
          "body": "> google is like 400 years behind thieves\n\n“Thief”: it’s 2025, I’m combining 2 broken phones to make a working phone \n\nGoogle: *thievin’ witch, that ‘un* … filthy hobbitses …. *I says we burn’ em*",
          "score": 4,
          "created_utc": 1747228378.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms8grxt",
      "author": "IHave2CatsAnAdBlock",
      "body": "Like iPhones ?",
      "score": 4,
      "created_utc": 1747209276.0,
      "replies": []
    },
    {
      "id": "ms8qtui",
      "author": "NormanYeetes",
      "body": "1% less stolen phones and 2000% more sold used phones where the buyer notices after sale that the seller forgot to remove the Google account or, more likely, didn't give a shit that it was basically unusable.",
      "score": 15,
      "created_utc": 1747215647.0,
      "replies": [
        {
          "id": "ms9485j",
          "author": "MetriccStarDestroyer",
          "body": "Absolutely.\n\nA seller won't even be obliged to help after the sale. Who knows if buyers suddenly 180 and take the Google account itself",
          "score": 5,
          "created_utc": 1747222511.0,
          "replies": []
        },
        {
          "id": "msbg6nh",
          "author": "BlastFX2",
          "body": "But that would discourage people from buying second hand and surely Google wouldn't want that!",
          "score": 1,
          "created_utc": 1747248560.0,
          "replies": []
        },
        {
          "id": "mshcj79",
          "author": "notjfd",
          "body": "I'm gonna let you in on a secret: those sellers who \"forgot\" to remove their Apple account from the iphone they sold you were simply selling you stolen goods.\n\nAlso, who they hell buys electronics when they can't even verify that they work? (recyclers are a different bag, and there should be laws that penalise people who dispose of electronics without unlocking them)",
          "score": 1,
          "created_utc": 1747329608.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msanohl",
      "author": "TightFlatworm3536",
      "body": "There's nothing much to do. If they don't sell the phones, they sell it's parts.",
      "score": 2,
      "created_utc": 1747240447.0,
      "replies": []
    },
    {
      "id": "msbku7x",
      "author": "jert3",
      "body": "Sounds good to me.\n\nIphone's are very very hard to resell if stolen due to the iphone account needing to be signed out of. If this helps lower theft great.",
      "score": 2,
      "created_utc": 1747249914.0,
      "replies": []
    },
    {
      "id": "ms9h92u",
      "author": "1Body-4010",
      "body": "What happens when a user needs to reset their phone",
      "score": 4,
      "created_utc": 1747227578.0,
      "replies": [
        {
          "id": "ms9jqsx",
          "author": "Smartnership",
          "body": "Just buy a new phone\n\n\nAt retail.\n\nEverybody wins!",
          "score": 4,
          "created_utc": 1747228455.0,
          "replies": [
            {
              "id": "ms9k5ta",
              "author": "1Body-4010",
              "body": "That will get very expensive",
              "score": 3,
              "created_utc": 1747228598.0,
              "replies": [
                {
                  "id": "ms9ptqb",
                  "author": "Smartnership",
                  "body": "The word you’re looking for is \n\n*profitable*",
                  "score": 7,
                  "created_utc": 1747230485.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms9w918",
          "author": "timelessblur",
          "body": "They need to sign into the account the phone was originally or know the PIN code.",
          "score": 1,
          "created_utc": 1747232486.0,
          "replies": []
        },
        {
          "id": "ms9xnso",
          "author": "ar34m4n314",
          "body": "You can still reset your own phone using your PIN.",
          "score": 1,
          "created_utc": 1747232908.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms9wv6v",
      "author": "PM_ME_YOUR_SPAGHETTO",
      "body": "I sure love it when big corpo's have the ability to turn the things we buy into bricks. That's _definitely_ pro consumer!\n\n/s",
      "score": 3,
      "created_utc": 1747232671.0,
      "replies": []
    },
    {
      "id": "msaqhrr",
      "author": "toastronomy",
      "body": "No thanks, I'd rather have control over my device than lose it to make sure google doesn't lose out on pennies.",
      "score": 3,
      "created_utc": 1747241257.0,
      "replies": []
    },
    {
      "id": "msczlp4",
      "author": "goldaxis",
      "body": "Remove the phrases \"stolen\" and \"for thieves\" and you have the true version of the story.",
      "score": 2,
      "created_utc": 1747265904.0,
      "replies": []
    },
    {
      "id": "ms91f9c",
      "author": "bucklam676",
      "body": "Who steals Android phones to resell? They lose 60-75% of value within a month of release.",
      "score": 3,
      "created_utc": 1747221260.0,
      "replies": []
    },
    {
      "id": "msbm2de",
      "author": "KrackSmellin",
      "body": "So do what iPhone has done for ages now... nice of ya to catch up!",
      "score": 2,
      "created_utc": 1747250275.0,
      "replies": []
    },
    {
      "id": "ms8z7cs",
      "author": "sparkyblaster",
      "body": "Translation: google is doing everything it can to make your phone more disposable and harder to sell.",
      "score": 2,
      "created_utc": 1747220220.0,
      "replies": [
        {
          "id": "ms9u1bp",
          "author": "timelessblur",
          "body": "No Google is not doing that. It has zero effect on legal resale if anything it raises the value of resealing your phone due to greatly reducing the possibility of it being a stolen iPhone when buying a resale phone. \n\nThis only really effects the stolen phone market and effects it hard.",
          "score": 4,
          "created_utc": 1747231813.0,
          "replies": []
        },
        {
          "id": "msa6ozo",
          "author": "Candle1ight",
          "body": "Harder to sell? You sure as hell shouldn't be selling your phone before factory resetting it anyways, not sure why this affects you.",
          "score": 1,
          "created_utc": 1747235569.0,
          "replies": [
            {
              "id": "msdq0q9",
              "author": "sparkyblaster",
              "body": "Because it makes it harder to buy and sell a used phone. Lots of people buying reset iPhones where they did a force reset with iTunes but didn't deactivate (these are two separate things) both legit and none legit. \n\nI'm repairing some old iPhones. One an old house mate gave me that I am pretty sure he never got around to removing from his apple account. \n\nIt all sounds easy on paper but in practice it's not even when it's legit.",
              "score": 1,
              "created_utc": 1747275062.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms8szou",
      "author": "mcronin0912",
      "body": "What they meant to say was, they’re wanting to kill a second hand market for their phones. And they can sell this idea to multiple phone makers.",
      "score": 3,
      "created_utc": 1747216916.0,
      "replies": []
    },
    {
      "id": "msk30mg",
      "author": "braytag",
      "body": "Pretty sure this will further prevent lineage/alternative OS.",
      "score": 1,
      "created_utc": 1747361483.0,
      "replies": []
    },
    {
      "id": "mt1k5bf",
      "author": "Festering-Fecal",
      "body": "They will be scrapped for the parts.",
      "score": 1,
      "created_utc": 1747614216.0,
      "replies": []
    },
    {
      "id": "ms9dqca",
      "author": "Melodic-Comb9076",
      "body": "like 20 yrs later.\n\nwhat a failure.",
      "score": 3,
      "created_utc": 1747226313.0,
      "replies": []
    },
    {
      "id": "ms8it4y",
      "author": "shalol",
      "body": "So they’re requiring the part return its ID like Apple does?\n\nIt’s a good idea in principle, they just have to allow a decent amount of third party manufacturers to issue IDs.\n\nThieving orgs will turn to corrupting manufacturers and sell them stolen parts to get washed, which is better than doing nothing, but would work great with some oversight from google.\n\nIn this unideal world though, none of the above will go as idealized and google will probably turn it into a license issuing racket of their own.  \nHell, In an ideal world, we wouldn’t need to worry about thievery…",
      "score": 1,
      "created_utc": 1747210567.0,
      "replies": []
    },
    {
      "id": "ms95sh2",
      "author": "IgnitusBoyone",
      "body": "I once forgot my pin on a Samsung phone.  Just straight looked down and couldn't remember it.  Proceeded to guess things that came to mind and activated the lockout   this spiraled in to a one month  lockout or something insane as the delay kept increasing.\n\nEventually I gave up and reset the phone.  I swear to God no hacker/thief  would have tried so long to brute force my phone as the real owner attempting to honestly remember his password . They likely would of just used some exploit to get around it or reset it like I did.  If lockdown has been secure I likely would of been screwed as I doubt I would of ever had set up recovery on my 20th generation cellphone we replace them to often to bother after a while and issues only happen once in a blue moon. My honest guess is  making factory reset harder will only punish standard users in the end and is ultimately a sales ploy.",
      "score": 1,
      "created_utc": 1747223180.0,
      "replies": [
        {
          "id": "ms9acxl",
          "author": "lost_send_berries",
          "body": "There's no exploit unless you have CIA level resources. Even then they will probably not be able to unlock it.\n\nThe idea is after factory resetting the phone you need to log into the same Google account as before to set up the phone. Not that the screen lock is still in place.",
          "score": 5,
          "created_utc": 1747225026.0,
          "replies": [
            {
              "id": "ms9rtmh",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1747231120.0,
              "replies": [
                {
                  "id": "msaninv",
                  "author": "lost_send_berries",
                  "body": "It is allowed. We're talking about resetting a phone which was already set up once with a Google account and the screen unlock is forgotten.",
                  "score": 5,
                  "created_utc": 1747240400.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms9w2ng",
          "author": "timelessblur",
          "body": "That argument is like going to immobilized chips on  cars was to make it harder the car owners and way to force people to pay more money for keys. \n\nReality is immobilizer chips in cars drove car theft into the ground. It reduce it more to car jacking and ways that require the theft to get the key with the car. Well until Kia got caught cheaping out and the Kia boys happened.  There was a reason why the most common stolen cars was sticking around year 2000 never moving up. It was shortly before the chipped keys became common place. \n\nIt will basically drive phone theft into the ground and have very limited effect on resale. For every example like your chances are there are 10+ stolen phones this would protect from.",
          "score": 3,
          "created_utc": 1747232433.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms9y29n",
      "author": "JiveTalkerFunkyWalkr",
      "body": "It kills me to see all the Apple Watches iPhones and iPads that become garbage when they get lost though. I wish you could donate them to apple to give to poor people or something. \nI see tones of them at police/transit auctions. They sell for peanuts.",
      "score": 1,
      "created_utc": 1747233027.0,
      "replies": []
    },
    {
      "id": "ms9xj4n",
      "author": "burnerthrown",
      "body": "Security experts I swear are more focused on the game between them and criminals than aiding the user. Every single new security measure is like 'how can we put use of this device behind more b***s***?'. Passwords can now lock you out, TFA can lock you out, password rotation can lock you out, password lockers can lock you out, everything can lock you out and takes longer and longer to get thru. Meanwhile if this stuff is breached anyway it's like 'we'll get em next time'. We're not here as an objective for the security game.  \nWhere's the dynamic security? Where's 'we quick verify your identity and lock down activity and roll back all changes'?",
      "score": 1,
      "created_utc": 1747232869.0,
      "replies": []
    },
    {
      "id": "ms90ubg",
      "author": "Devilofchaos108070",
      "body": "Good",
      "score": -1,
      "created_utc": 1747220991.0,
      "replies": []
    },
    {
      "id": "ms91ck9",
      "author": "killroystyx",
      "body": "In theory this is like pink slips for cars, track the sales.\n\nIn practice this is just planned obsolescence, how many phones will get bricked because someone sold their phone legally without resetting it first?\n\nOnce again Google out here showing us why they no longer abide by \"Dont be evil\".\n\nReduce: people dont need to line up for a new phone every 6 months. Perceived obsolescence\nReuse: stop adding features that only function to make repairs and reselling unviable in a failed war on \"theft\" or \"hackers\". Planned obsolescence.\nRecycle: materials in these phones are valuable enough to ship old hardware around the world for the global poor to tear apart in hazardous conditions. The chip manufacturers should be required to buy back old hardware and use safe methods to reclaim material. Actual obsolescence.\n\nIf any multi-billion entity isn't pushing towards long term sustainably at every turn, they are the enemy of all life on Earth, and should be treated accordingly.",
      "score": -1,
      "created_utc": 1747221226.0,
      "replies": []
    },
    {
      "id": "msaydxu",
      "author": "llDurbinll",
      "body": "Good. Now they need to make it to where you can track your phone without having to have your location on 24/7. I don't understand how Apple is able to do that but Android can't. A thief would just turn location off on an Android phone the moment they get their hands on it and now you can't track it.",
      "score": 0,
      "created_utc": 1747243487.0,
      "replies": [
        {
          "id": "msh24fi",
          "author": "Neo_Techni",
          "body": "> I don't understand how Apple is able to do that but Android can't.\n\nApple has the Find My network and specific hardware for it. Android does not",
          "score": 1,
          "created_utc": 1747326594.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msc13m8",
      "author": "DarianYT",
      "body": "It's nice that people won't be able to steal them easily. The best way to make sure that your phone doesn't get stolen is to get A series Samsung Phone or one with Exynos.",
      "score": -2,
      "created_utc": 1747254736.0,
      "replies": [
        {
          "id": "mscbf1x",
          "author": "stromm",
          "body": "They’ll still be just as easy to steal. Just not as easy to use after.",
          "score": 2,
          "created_utc": 1747257881.0,
          "replies": []
        }
      ]
    }
  ]
}