{
  "post": {
    "title": "Razer’s new Blade 18 offers Nvidia RTX 50-series GPUs and a dual mode display",
    "author": "Movecanz",
    "id": "1iykl9k",
    "score": 194,
    "created_utc": 1740565994.0,
    "selftext": "",
    "num_comments": 70,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iykl9k/razers_new_blade_18_offers_nvidia_rtx_50series/"
  },
  "comments": [
    {
      "id": "mevyqeq",
      "author": "seaseme",
      "body": "Never again.",
      "score": 107,
      "created_utc": 1740579122.0,
      "replies": [
        {
          "id": "mewt3n4",
          "author": "AllOfTheFeels",
          "body": "My 2016 razer got bricked by an official BIOS update/download on its own product page. Razer refused to replace the MOBO and was going to charge me 2k to replace it. Neverrrrr fucking again. Thankfully I was already planning on moving away from gaming laptops.",
          "score": 57,
          "created_utc": 1740588255.0,
          "replies": [
            {
              "id": "mf05dlt",
              "author": "bcredeur97",
              "body": "I rarely see people have good long term experiences with gaming laptops.\n\nI’m excited for this new realm of very very good iGPU’s like in that Ryzen ai 395 whatever it’s called that we might be getting soon",
              "score": 11,
              "created_utc": 1740623690.0,
              "replies": [
                {
                  "id": "mf0jjlr",
                  "author": "AllOfTheFeels",
                  "body": "Yeah I’m much more interested in the handheld PCs with the new iGPUs! The GPD and ONEXPLAYER handhelds with the new ai chips are super nice",
                  "score": 7,
                  "created_utc": 1740628797.0,
                  "replies": [
                    {
                      "id": "mf1xl94",
                      "author": "ACanadianNoob",
                      "body": "I got an ROG Ally X to pair with my gaming PC and to take camping for those moments in the evening when you're bored. No regrets, other than the price.",
                      "score": 2,
                      "created_utc": 1740655714.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mf0sejz",
                  "author": "BetiseAgain",
                  "body": "This may be because the ones that are happy, don't speak up.\n\nMy Sager laptop with a 1070 is still running great, and I am currently gaming on it.",
                  "score": 4,
                  "created_utc": 1740632450.0,
                  "replies": []
                },
                {
                  "id": "mhfgi75",
                  "author": "Individual-Pay9662",
                  "body": "I've had good experience with my legion 7, although I keep it stationary and the soldered ram is annoying (need a whole new laptop just for more ram).",
                  "score": 1,
                  "created_utc": 1741804555.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mex2fh6",
              "author": "seaseme",
              "body": "Same.",
              "score": 1,
              "created_utc": 1740590874.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mewwcp0",
          "author": "semibiquitous",
          "body": "Had 2019 Razer Blade Advanced. Had to replace batteries every 1.5 years. Could cook eggs on its thermal vent. Finally the piece of shit died and wouldnt stay booted up for longer than 30 second. \n\n  \nHad 2 kinds of top end Razer mice and keyboards. All had double click issue or battery issue or literally just stopped working one day after only 2 years of life, right after warranty period ended.\n\n  \nRazer makes shit products and you will never convince me otherwise. I gave them an honest tries product after product after product.",
          "score": 14,
          "created_utc": 1740589163.0,
          "replies": [
            {
              "id": "mex2ic4",
              "author": "CosmicCreeperz",
              "body": "I still have my 2019 Advanced.  It runs hot with too much fan noise but overall I still like it.\n\nI am on the second battery though… the first one bulged to the point the trackpad wasn’t working.  Luckily it was a straightforward replacement I could do, but yeah, it wasn’t nearly old enough then to need a new battery.",
              "score": 2,
              "created_utc": 1740590897.0,
              "replies": [
                {
                  "id": "mexqboi",
                  "author": "xChaoctic",
                  "body": "Can I ask where you purchased the battery? I also have a bulging (just recently) razer blade advanced, and was wondering if Ebay batteries would be okay.",
                  "score": 3,
                  "created_utc": 1740597508.0,
                  "replies": [
                    {
                      "id": "mezwn8f",
                      "author": "wizardroach",
                      "body": "Had the same issue with my laptop.I bought a hella cheap battery off of eBay, and replaced it pretty easily. Just double check the type of battery bc I accidentally bought the wrong one. I haven’t had any issues with it, but honestly it’s a miracle that my 2019 advanced hasn’t bitten the bullet yet.",
                      "score": 2,
                      "created_utc": 1740620740.0,
                      "replies": [
                        {
                          "id": "mf6ciiq",
                          "author": "xChaoctic",
                          "body": "Thanks!",
                          "score": 1,
                          "created_utc": 1740705841.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mf1xt7r",
                  "author": "ACanadianNoob",
                  "body": "If your battery bulges even a little bit, replace it immediately. Don't wait for it to bulge so much it inconveniences you. It's a fire hazard the moment it starts to expand and should be buried in a bucket of sand until it can be disposed of.",
                  "score": 1,
                  "created_utc": 1740655828.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mex00ap",
              "author": "halomate1",
              "body": "There products must be shit now, I bought a razer naga hex from 2011 and I still have it to this day working fine. Also still have a keyboard from 2020",
              "score": 2,
              "created_utc": 1740590197.0,
              "replies": [
                {
                  "id": "mexagq4",
                  "author": "yepgeddon",
                  "body": "I had a basilisk fairly recently, other than it being a completely dog shit mouse to use, it died after two years and I was back to Logitech in a heartbeat.",
                  "score": -1,
                  "created_utc": 1740593113.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mezgp6k",
              "author": "Gloriathewitch",
              "body": "after the 2012 naga they went massively downhill",
              "score": 0,
              "created_utc": 1740615552.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mez8uv8",
          "author": "prawnjr",
          "body": "Same",
          "score": 0,
          "created_utc": 1740612970.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mev7cgl",
      "author": "doctorfluffy",
      "body": "Does it come with inflatable battery like the previous ones? At this point it’s not a bug, it’s a feature!",
      "score": 95,
      "created_utc": 1740567657.0,
      "replies": [
        {
          "id": "mf1dh46",
          "author": "hfjfthc",
          "body": "Can confirm, I’ve had not one but two batteries bloat",
          "score": 2,
          "created_utc": 1740643548.0,
          "replies": []
        },
        {
          "id": "mevhvmh",
          "author": "HeftyArgument",
          "body": "Pretty much all laptops do though 😅",
          "score": -22,
          "created_utc": 1740572843.0,
          "replies": [
            {
              "id": "mewnb2a",
              "author": "Spotter01",
              "body": "I’ve owned prob 15-25 laptops in my life Razer has been the only one to get a spicy pillow….",
              "score": 22,
              "created_utc": 1740586628.0,
              "replies": [
                {
                  "id": "mewsvuc",
                  "author": "Outrageous_Article87",
                  "body": "I got a spicy pillow on my HP work laptop a couple years ago. It also happened on an Alienware laptop after I gave it to my nephew. But I still think Razer gets them more. \n\nSuper slick looking laptops though. I dominated some great WoW raids on a Razer Blade back in the day.",
                  "score": 5,
                  "created_utc": 1740588194.0,
                  "replies": [
                    {
                      "id": "mewte6j",
                      "author": "Spotter01",
                      "body": "I still Love my 2022 Razer 15 it’s just a couple grams lighter now that I turned it into a quasi desktop/laptop where now it just runs off AC…. It only just recently got a spicy pillow, but I’m still thinking if it’s worth replacing if it’s just gonna happen again if it’s the same lithium chemistry from Razer…..",
                      "score": 2,
                      "created_utc": 1740588339.0,
                      "replies": [
                        {
                          "id": "meww6b6",
                          "author": "Outrageous_Article87",
                          "body": "Yeah I think 15 is still a weird place to go without battery but if I bought an 18 I would probably leave the battery out of it and solely use it as a desktop replacement that I can take with me sometimes.",
                          "score": 2,
                          "created_utc": 1740589114.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mewonh9",
                  "author": "sargonas",
                  "body": "Same, over the last 20 years I’ve probably owned around 15 laptops between personal and work uses. Five of those were razers and all five of those are the only ones to ever get spicy pillows.",
                  "score": 5,
                  "created_utc": 1740587008.0,
                  "replies": [
                    {
                      "id": "mewpbzg",
                      "author": "Spotter01",
                      "body": "Yep Exactly like my experience 100%",
                      "score": 0,
                      "created_utc": 1740587198.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mewtp6r",
                  "author": "Rdub",
                  "body": "I worked at a company that bought around 20 Blade 15s around 5 years ago, literally every single one of them suffered from battery bloat within a year of purchase. My specific laptop had 4 batteries bloat in 3 years. Never had battery bloat issues on any other laptop I've ever owned and I've also owned maybe a dozen over the years. Razer's battery issues are well known and much, much worse than any other laptop manufacturer.",
                  "score": 1,
                  "created_utc": 1740588424.0,
                  "replies": []
                },
                {
                  "id": "mex369m",
                  "author": "CosmicCreeperz",
                  "body": "That is crazy, same here.  Well not 15-25 but at least 10.  And probably 4 more my wife has owned.\n\nOnly my 2019 Razer had to have the battery replaced not because it was dead, but because the trackpad couldn’t be pressed down.  I was shocked to realize the trackpad was fine, it was the battery.",
                  "score": 1,
                  "created_utc": 1740591082.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mevmmtr",
              "author": "AmNoSuperSand52",
              "body": "Nah that’s mostly specific to Razer",
              "score": 6,
              "created_utc": 1740574784.0,
              "replies": [
                {
                  "id": "mevmrr9",
                  "author": "HeftyArgument",
                  "body": "every lithium ion battery has the potential to become a spicy pillow",
                  "score": -1,
                  "created_utc": 1740574839.0,
                  "replies": [
                    {
                      "id": "mevn0xu",
                      "author": "AmNoSuperSand52",
                      "body": "Agreed, but only Razer has the poor enough QC to have a 96Wh battery swell so much that it pops your trackpad out of the chassis\n\nThey cost way too much for this to be a reoccurring issue",
                      "score": 15,
                      "created_utc": 1740574940.0,
                      "replies": [
                        {
                          "id": "meyapzf",
                          "author": "podoka",
                          "body": "Thats actually really common with HP and Dell laptops as well. I work in IT and deal with inflated batteries regularly.",
                          "score": 5,
                          "created_utc": 1740603089.0,
                          "replies": []
                        },
                        {
                          "id": "mexf9dn",
                          "author": "Tabs_555",
                          "body": "This happened to me with my Razer Blade lmao. Never buying razer again. Sucks, theyre a cool brand with fun products, but every single one of the products I’ve bought from them breaks within a year or two.",
                          "score": 1,
                          "created_utc": 1740594442.0,
                          "replies": []
                        },
                        {
                          "id": "mevn5gs",
                          "author": "HeftyArgument",
                          "body": "Plenty of cases where that’s happened with Apple just as an example.",
                          "score": -7,
                          "created_utc": 1740574988.0,
                          "replies": [
                            {
                              "id": "mevn8k2",
                              "author": "AmNoSuperSand52",
                              "body": "Sure, just happens more often with Razer than anyone else",
                              "score": 8,
                              "created_utc": 1740575022.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mevleng",
      "author": "norse95",
      "body": "The Blade gets a lot of hate online (some warranted it sucks when they have issues) but I haven’t had any issues with mine and I love it.",
      "score": 29,
      "created_utc": 1740574299.0,
      "replies": [
        {
          "id": "mevoguy",
          "author": "Shosui",
          "body": "Same here. Got a 2020 model right when Covid first hit to use for work as well as light games and it's been great overall. The metal body feels leagues better than the plastic casings and textured rubber. It was easy to upgrade and the battery lasts surprisingly long for non-intensive usage. It's been one of the best laptops I have owned to date.",
          "score": 12,
          "created_utc": 1740575494.0,
          "replies": []
        },
        {
          "id": "mewklp6",
          "author": "manicMechanic1",
          "body": "I have a ‘17 Blade Pro and it’s been the best pc I’ve ever had. Never had a problem with it",
          "score": 6,
          "created_utc": 1740585850.0,
          "replies": []
        },
        {
          "id": "mewx2g3",
          "author": "Demented_Alchemy",
          "body": "I have a 15 from 2021 and I love mine, haven’t had any issues, but I dislike the lack of driver downloads. Razer expects you to use windows update for drivers, which is “ehhh” at best. Intel has an update tool as well, but that’s only for Intel products. I’m sure there’s microcode patches that need to be put out that Razer simply isn’t and it’s that aspect that bothers me about Razer’s product support. I have a dell xps that’s constantly betting bios updates and various patches left and right.",
          "score": 2,
          "created_utc": 1740589367.0,
          "replies": [
            {
              "id": "mf16oma",
              "author": "Chav",
              "body": "I have the 15 from 2020., it was great,  then saw it sitting at a crazy angle because the battery bloated enough to pop off the screws and bend the bottom casing.",
              "score": 1,
              "created_utc": 1740639545.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mez89o4",
          "author": "borninamsterdamzoo",
          "body": "Mine had a terrible noname SSD that was glitchy and slow and died after 2 years. Ever heard of Liteon SSDs? Yeah, me neither. Not something you'd expect inside a $3k laptop.",
          "score": 1,
          "created_utc": 1740612776.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mev5fwv",
      "author": "Kiflaam",
      "body": "in my experience, heat management becomes difficult once you get over 1200 dollars or so, for a laptop. Gonna have to listen to that fan 24/7\n\nfor 2400, might as well get a nice PC\n\nand why is that keyboard all scrunched in the middle? Honestly, I wish they would just offer laptops without the track pad so the keyboard is up front and more usable. The track pad could just be a usb peripheral or something, maybe even have a little cargo section in the bottom to store it.",
      "score": 31,
      "created_utc": 1740566569.0,
      "replies": [
        {
          "id": "mey4dcd",
          "author": "seiyamaple",
          "body": "> for 2400, might as well get a nice PC\n\nSomeone choosing a laptop to game on instead of a desktop isn’t doing so because of price. This statement makes no sense.",
          "score": 11,
          "created_utc": 1740601361.0,
          "replies": [
            {
              "id": "mey5mwp",
              "author": "Kiflaam",
              "body": "I disagree, I think it makes sense. I am presenting an argument that dissuades going for high-end laptops for gaming.\n\nAt such a pricy investment, especially since I have experience going this route, I am recommending against trying to have both portability and high-end gaming, and instead just get a desktop.\n\nIf they want to do it anyway, if portability is required alongside high-end gaming, then they should get ready for a well-known problem with laptops.",
              "score": -6,
              "created_utc": 1740601703.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mev85bv",
          "author": "Bloody_Sunday",
          "body": "From a noise perspective, any heat management for a discreet GPU in a laptop becomes an issue. It doesn't matter if it's below $1200 or not. It *will* get hot with a new-ish game, the fans will start reaching their max rpm... It's just the heat dissipation physics at work in the case of such a tiny space filled as tight as possible with components. So headphones are mandatory if it bothers you. \n\nWhat I personally do to help my own old-ish 2060 laptop is 1. set the fans at max, 2. use an elevated cooling pad with two big quiet fans, 3. optionally use headphones (noise cancelling helps but not strictly necessary). \n\nI've grown accustomed to the fan noise and it's not so loud. In everyday browsing/Office work it's very quiet and the fans are working on normal.",
          "score": 9,
          "created_utc": 1740568105.0,
          "replies": [
            {
              "id": "mevg5bu",
              "author": "Nightshade-Dreams558",
              "body": "My wife got a 3060 laptop back in 2020 and it heats up so much you can’t have it in your lap at times. It works fine, but it gets hot as hell and loud.",
              "score": 3,
              "created_utc": 1740572089.0,
              "replies": [
                {
                  "id": "mevnhg2",
                  "author": "Bloody_Sunday",
                  "body": "Unfortunately this is very true. Even new gaming laptops can be an insta-forget for using on the lap. They can get very hot - and not just when gaming.",
                  "score": 4,
                  "created_utc": 1740575117.0,
                  "replies": []
                },
                {
                  "id": "mevi2i6",
                  "author": "HeftyArgument",
                  "body": "Just a note, if you’re a guy and want to have kids; don’t use that laptop on your lap.",
                  "score": -1,
                  "created_utc": 1740572925.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mew6qms",
          "author": "Corgi_Koala",
          "body": "IMO if you want a mobile gaming solution the Steam Deck is a really good and affordable option.",
          "score": 2,
          "created_utc": 1740581725.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mewn1u2",
      "author": "Spotter01",
      "body": "That great but how’s the battery chemistry iykyk",
      "score": 4,
      "created_utc": 1740586555.0,
      "replies": []
    },
    {
      "id": "mewpehv",
      "author": "gamerfiiend",
      "body": "I have the mini led razer with 4090, and the dual mode display in it is okay. I never use the feature, it’s a little annoying when you unplug or plug the laptop in it swaps. It also had a ton of issues in the first year lol like screen not working, or just static. I think they resolved most of it tho",
      "score": 2,
      "created_utc": 1740587218.0,
      "replies": []
    },
    {
      "id": "mevkd07",
      "author": "Sinz_Doe",
      "body": "Is it good tho?  And what CPU it using?",
      "score": 2,
      "created_utc": 1740573882.0,
      "replies": []
    },
    {
      "id": "mexqgjv",
      "author": "NiteFyre",
      "body": "Yeah Razer makes cheap feeling plasticy products in my experience.\n\nI remember my dad buying a boomslang back in the day and it just felt nicely built even if it waas HUGE.\n\nThe build quality on my last razer product was awful.",
      "score": 1,
      "created_utc": 1740597545.0,
      "replies": []
    },
    {
      "id": "mexu0x3",
      "author": "Moogle14",
      "body": "My experience on 2019 is telling me no, again, not worth it",
      "score": 1,
      "created_utc": 1740598536.0,
      "replies": []
    },
    {
      "id": "mez3l8k",
      "author": "JumpyEntrance394",
      "body": "Awful experience with Razer.. 3 power supplies bricked within the first 6 months. Graphics card itself then bricked in year 3 and that was that. A lot of much better options out there.",
      "score": 1,
      "created_utc": 1740611268.0,
      "replies": []
    },
    {
      "id": "meza1wg",
      "author": "SeyJeez",
      "body": "I wish there was a competent laptop manufacturer that made windows “gaming” laptops in the Razer / MacBook look.",
      "score": 1,
      "created_utc": 1740613361.0,
      "replies": []
    },
    {
      "id": "meznj4s",
      "author": "xwillybabyx",
      "body": "My old razer got so hot I had to put towels on my hands to use wads because it would burn the palm of my hand. Nope.",
      "score": 1,
      "created_utc": 1740617759.0,
      "replies": []
    },
    {
      "id": "mezqsex",
      "author": "IAmWeary",
      "body": "I took a look at this earlier today. They want $1400 to go from a Ryzen AI 9 365 to a HX 370 on the new Razer Blade 16. $400 to go from a 5070 Ti to a 5080, and an insane $1400 to go from the 5070 Ti to a 5090. $700 to go from a 1TB to a 2TB SSD. $1800 to go with a 2x2TB SSD option from the single 1TB. $400 to go from 32GB to 64GB of RAM.\n\nTheir BTO price gouging could give Apple a stroke. Jesus Fuck, it's laughably grotesque. Who the fuck is buying this shit??",
      "score": 1,
      "created_utc": 1740618817.0,
      "replies": []
    },
    {
      "id": "mf1n93n",
      "author": "IT_techsupport",
      "body": "Who buys Razer? If their keyboard quality is indicative of their other produtcs then , you should steer away from anything Razers makes.",
      "score": 1,
      "created_utc": 1740649697.0,
      "replies": []
    },
    {
      "id": "mf80n57",
      "author": "imKaku",
      "body": "I know these crazy priced laptops exists, but geez the target audience must be extremely small. I’ve yet to hear about one even existing outside a review.",
      "score": 1,
      "created_utc": 1740732338.0,
      "replies": []
    },
    {
      "id": "mev6ol5",
      "author": "SenAtsu011",
      "body": "2 hour battery life and thermal throttles after 20 seconds, at which point that 50-series performs as well as a 780. Gaming laptops are a scam.",
      "score": -10,
      "created_utc": 1740567279.0,
      "replies": [
        {
          "id": "mev8tkt",
          "author": "Bloody_Sunday",
          "body": "a. You're never getting a gaming laptop to play on battery. \n\nb. In the rare cases that you would somehow want to do that, no, it definitely doesn't work \"as well as a 780\". As always with these designs, it's inevitably throttled down but not anywhere near as bad as that. \n\nc. \"Gaming laptops are a scam\". I hope you're not really expecting a discussion on that. 😄",
          "score": 19,
          "created_utc": 1740568475.0,
          "replies": [
            {
              "id": "mew7xj2",
              "author": "Corgi_Koala",
              "body": "I feel like way too many people compared gaming laptops to desktops. \n\nIf you're traveling and want a PC that can game it doesn't really matter that a desktop has better price to performance. It ain't fitting in my carry on.",
              "score": 5,
              "created_utc": 1740582092.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mewo8vn",
      "author": "chrischanhanson",
      "body": "After how shitty my mice and their customer service were, I have no idea who is spending $3000+ on laptops of theirs",
      "score": 0,
      "created_utc": 1740586892.0,
      "replies": []
    }
  ]
}