{
  "post": {
    "title": "iPhone AI features will be powered by Alibaba in China",
    "author": "a_Ninja_b0y",
    "id": "1iok51r",
    "score": 600,
    "created_utc": 1739456647.0,
    "selftext": "",
    "num_comments": 102,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iok51r/iphone_ai_features_will_be_powered_by_alibaba_in/"
  },
  "comments": [
    {
      "id": "mck39ig",
      "author": "Ivorybrony",
      "body": "“Alibaba has announced that it is partnering with Apple to provide artificial intelligence features to iPhones in China. Apple Intelligence features have not yet been enabled in China, which is thought to have contributed to the company’s local decline in smartphone sales.”\n\nApparently ChatGPT isn’t available in China, hence the Alibaba usage.",
      "score": 178,
      "created_utc": 1739458583.0,
      "replies": [
        {
          "id": "mcn19p0",
          "author": "brus_wein",
          "body": "Doesn't china also basically require you to enter into a joint venture to do business over there?",
          "score": 33,
          "created_utc": 1739488963.0,
          "replies": [
            {
              "id": "mcnq1f7",
              "author": "None",
              "body": "Not if you are big enough and you play by their rules",
              "score": 11,
              "created_utc": 1739497253.0,
              "replies": [
                {
                  "id": "mcontml",
                  "author": "EquipableFiness",
                  "body": "I think only Apple gets this privilege",
                  "score": 11,
                  "created_utc": 1739510072.0,
                  "replies": [
                    {
                      "id": "mcoym7v",
                      "author": "M0rtale",
                      "body": "Also Tesla",
                      "score": 10,
                      "created_utc": 1739515479.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mcoxjw1",
              "author": "war-and-peace",
              "body": "Tesla in china is not a joint venture.",
              "score": 6,
              "created_utc": 1739514900.0,
              "replies": [
                {
                  "id": "mcsjyaf",
                  "author": "TubasAreFun",
                  "body": "not when BYD is completely owning the market",
                  "score": 5,
                  "created_utc": 1739565802.0,
                  "replies": []
                },
                {
                  "id": "mcpx1wj",
                  "author": "FewHorror1019",
                  "body": "Not thay we know of",
                  "score": -1,
                  "created_utc": 1739535708.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcpgqtg",
              "author": "BrokenDownMiata",
              "body": "Not if you’re big enough and agree to the rules. Apple and Tesla are not joint ventures.\n\nChina’s whole ‘joint venture’ scheme is designed to extract knowledge from Foreign Company and use it to develop Domestic Company to make a better product domestically, which ends up pushing out Foreign Company.\n\nBut iPhones are considered status symbols in ways that no other Chinese brand can quite match. They’re not the most affordable, but that Apple icon means a lot.",
              "score": 3,
              "created_utc": 1739526469.0,
              "replies": []
            },
            {
              "id": "mcqena6",
              "author": "Xylus1985",
              "body": "No, there are a lot of WOFE (wholly owned foreign enterprise) here. I work for one right now and in the past 2 jobs. There are only a few heavily regulated industries where Joint Ventures are required",
              "score": 1,
              "created_utc": 1739542644.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcsqk1i",
          "author": "JaydedXoX",
          "body": "This might be enough for me to fully commit to Google Gemini instead of apple.",
          "score": 0,
          "created_utc": 1739567771.0,
          "replies": [
            {
              "id": "mcvd0e6",
              "author": "Wise_Business1672",
              "body": "That means only in China.\nRegardless I’m kinda weirded out by both Google and Apple caving in and renaming the Gulf of Mexico to Gulf of America",
              "score": 2,
              "created_utc": 1739605912.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mck2od8",
      "author": "Lost_Apricot_4658",
      "body": "Anyone else not even turn on iOS AI.",
      "score": 115,
      "created_utc": 1739458397.0,
      "replies": [
        {
          "id": "mclfa5p",
          "author": "WilmaLutefit",
          "body": "It’s dog shit",
          "score": 34,
          "created_utc": 1739472374.0,
          "replies": [
            {
              "id": "mcltxew",
              "author": "swarmski",
              "body": "Siri can change song on Spotify, IOS AI can’t even do that… useless",
              "score": 15,
              "created_utc": 1739476414.0,
              "replies": [
                {
                  "id": "mcm5rbj",
                  "author": "None",
                  "body": "[removed]",
                  "score": 10,
                  "created_utc": 1739479708.0,
                  "replies": [
                    {
                      "id": "mcnifqu",
                      "author": "shogun77777777",
                      "body": "I agree with you about apple, but wasn’t google maps just an easy download from the App Store?",
                      "score": 4,
                      "created_utc": 1739494658.0,
                      "replies": [
                        {
                          "id": "mcnpc1b",
                          "author": "None",
                          "body": "[removed]",
                          "score": 1,
                          "created_utc": 1739497010.0,
                          "replies": [
                            {
                              "id": "mcnxqja",
                              "author": "shogun77777777",
                              "body": "Oh nevermind I completely misread your comment lol",
                              "score": 1,
                              "created_utc": 1739499939.0,
                              "replies": []
                            },
                            {
                              "id": "mcpehgi",
                              "author": "NuPNua",
                              "body": "If you want a phone with good Google service integration, wouldn't it make more sense to get an android?",
                              "score": 1,
                              "created_utc": 1739525013.0,
                              "replies": [
                                {
                                  "id": "mcrn8uj",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 1,
                                  "created_utc": 1739556177.0,
                                  "replies": [
                                    {
                                      "id": "md8gdsd",
                                      "author": "Lucaboox",
                                      "body": "I like some of apples apps due to being in the ecosystem but like you’re saying I should be able to have one from Google that I think is better such as music and maps why should I be forced to use the inferior version by Apple (music might be a stretch but it’s cheaper to a degree since it also gives you YouTube red)",
                                      "score": 1,
                                      "created_utc": 1739793259.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mcnszqp",
                      "author": "silentcrs",
                      "body": "I think you misread the comment you replied to. The commenter was saying previous Siri had functionality that new Apple Intelligence doesn’t. They’re both Apple.",
                      "score": 2,
                      "created_utc": 1739498266.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcniktj",
                  "author": "None",
                  "body": "I was wondering why my iPhone suddenly wasn’t letting me change songs with Siri and shit on CarPlay.. \n\nAmazing.",
                  "score": 1,
                  "created_utc": 1739494705.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mck4qux",
          "author": "Zealousideal_Bad_922",
          "body": "I tried it on my Mac. 5 different things, 4 were met with “I don’t understand” and one question I asked just turned down the volume on my computer. I 100% had AI enabled. It’s useless.",
          "score": 21,
          "created_utc": 1739459048.0,
          "replies": [
            {
              "id": "mclptvk",
              "author": "Theverybest92",
              "body": "I can confirm this. Useless bloated upgrade. Don't download until they make it useful.",
              "score": 4,
              "created_utc": 1739475295.0,
              "replies": []
            },
            {
              "id": "mcpi6m4",
              "author": "TwofacedDisc",
              "body": "So it’s Siri 2",
              "score": 3,
              "created_utc": 1739527400.0,
              "replies": []
            },
            {
              "id": "mcmpmza",
              "author": "MassiveBoner911_3",
              "body": "Turn that shit off before it slows your computer down.",
              "score": 2,
              "created_utc": 1739485378.0,
              "replies": []
            },
            {
              "id": "mck5i53",
              "author": "PineapplePizza99",
              "body": "It’s not released yet",
              "score": 0,
              "created_utc": 1739459285.0,
              "replies": [
                {
                  "id": "mck7x5e",
                  "author": "Zealousideal_Bad_922",
                  "body": "Classic Reddit comment",
                  "score": -7,
                  "created_utc": 1739460025.0,
                  "replies": [
                    {
                      "id": "mckambw",
                      "author": "PineapplePizza99",
                      "body": "Yeah sorry. Apple Intelligence is not fully out yet and it is not going to be anywhere near done even when iOS 19 comes out. Half of the features that were advertised are out now (they are half baked), but the truly important stuff like Nextgen Siri is not out yet and I don’t think it will be out soon.\n\nSo what you tried on your Mac was literally old dumb Siri with a visual makeover. ",
                      "score": 17,
                      "created_utc": 1739460830.0,
                      "replies": [
                        {
                          "id": "mcknvp7",
                          "author": "Sylvurphlame",
                          "body": "I am coming around to the opinion that doing the visual overhaul first might have been a bad idea after all.",
                          "score": 5,
                          "created_utc": 1739464619.0,
                          "replies": []
                        },
                        {
                          "id": "mcknqmu",
                          "author": "Chishuu",
                          "body": "I think they announced a Siri update with AI in the next major patch for iOS? 18.4 I think",
                          "score": 1,
                          "created_utc": 1739464579.0,
                          "replies": []
                        },
                        {
                          "id": "mcnqiq1",
                          "author": "reinhardtmain",
                          "body": "It’s in beta- Apple themselves certainly wouldn’t call it a skin over old Siri.",
                          "score": 1,
                          "created_utc": 1739497418.0,
                          "replies": [
                            {
                              "id": "mcpqgu4",
                              "author": "PineapplePizza99",
                              "body": "It literally is a skin of old Siri. Look it up. The improvements to Siri are coming in 18.4 and LLM Siri is not coming out until 19.4. Currently Siri is as dumb and useless as ever, it is just shinier and can connect to ChatGPT for things it cannot do.",
                              "score": 1,
                              "created_utc": 1739532348.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mcw0vxg",
                          "author": "SlovenianSocket",
                          "body": "Nextgen siri comes out next week.",
                          "score": 1,
                          "created_utc": 1739620947.0,
                          "replies": []
                        },
                        {
                          "id": "mcl1e4c",
                          "author": "Zealousideal_Bad_922",
                          "body": "lol thanks for clarifying. That’s exactly what it felt like so it’s good to know the main features are still to come!",
                          "score": 1,
                          "created_utc": 1739468412.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mckj3r1",
                      "author": "Pineapple_Assrape",
                      "body": "No classic reddit comment is you not understanding you're doing shit wrong and then coming on here with fullmouthed declarations on the state of things, declaring it useless.\n\nSeems like you're just as confident as Siri while spouting bullshit, how fitting.",
                      "score": 3,
                      "created_utc": 1739463285.0,
                      "replies": [
                        {
                          "id": "mckpe1t",
                          "author": "Zealousideal_Bad_922",
                          "body": "lol google it. I’m sitting at my computer looking right at it. They had me opt in. I tried it. It’s useless.",
                          "score": 1,
                          "created_utc": 1739465042.0,
                          "replies": [
                            {
                              "id": "mckqu4c",
                              "author": "Pterodactyl_midnight",
                              "body": "lol google it. Apple Ai doesn’t answer questions yet, Siri update isn’t released. Only “writing tools,” notification summary, and image playground is out. So your test of Apple Ai is faulty. Test the things that are released.",
                              "score": 2,
                              "created_utc": 1739465449.0,
                              "replies": [
                                {
                                  "id": "mcksqnf",
                                  "author": "Zealousideal_Bad_922",
                                  "body": "Sorry when I said ask it questions, I meant feeding it prompts in general. This was a few weeks ago but I remember I asked it to summarize an email, which it didn’t understand. I DID ask it a question because it had a check box for integrating ChatGPT. The image creation is a different app on Mac and I haven’t had a need for that yet so maybe that works but Apple AI on Mac right now just seems to be a glowing Siri button. Even when I ask it what it can do, it says “resume book, pause timer, what time is sunset, send a message”.",
                                  "score": -1,
                                  "created_utc": 1739465976.0,
                                  "replies": [
                                    {
                                      "id": "mckti38",
                                      "author": "Pterodactyl_midnight",
                                      "body": "How are you “feeding it prompts?” There is nowhere to feed prompts. Like I said, Siri update hasn’t happened yet.\n\nMaybe don’t be so arrogant and tell people to “google it” when you don’t know what you’re talking about.\n\nEdit : And ChatGPT is for writing tools when it can’t do it locally.",
                                      "score": 1,
                                      "created_utc": 1739466192.0,
                                      "replies": [
                                        {
                                          "id": "mcoscuz",
                                          "author": "Zealousideal_Bad_922",
                                          "body": "Wow, how cool of you to edit a message after the fact to make yourself look big 😂😂 what a fucking loser.",
                                          "score": 0,
                                          "created_utc": 1739512222.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "mckyiao",
                                          "author": "Zealousideal_Bad_922",
                                          "body": "Pineapplepizza99 already responded and clarified that it’s essentially just a visual makeover for Siri right now. That was my experience.\n\nIs Apple ai out for Mac? Yes. Is it functional as an ai experience? Not unless you bend the current public understanding of the definition of ai. I apologize if my comment upset others (not saying you) but I am the layman here. I’ve had my Mac for 4 months. I was getting prompts every couple of days to activate AI. I activated it. Tried to get it to do the things I had heard it could do, tried to get things I’ve used GPT for, tried to use it as a search engine, it couldn’t do any of those things. People can argue with me about the semantics of “useless” or say I don’t know what I’m doing, but that doesn’t change the fact that it is just a reskinned Siri for now.\n\nIf they’re planning on adding additional features, that’s great! They shouldn’t have pushed it out and advertised it if its key features aren’t there. No hate. I just think it was a mistake.",
                                          "score": -1,
                                          "created_utc": 1739467596.0,
                                          "replies": [
                                            {
                                              "id": "mckz3fh",
                                              "author": "Pterodactyl_midnight",
                                              "body": "\nhttps://www.tomsguide.com/ai/apple-intelligence-release-date-heres-when-all-the-ai-features-are-coming",
                                              "score": 2,
                                              "created_utc": 1739467762.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mcko3s2",
                          "author": "None",
                          "body": "damn lol",
                          "score": -1,
                          "created_utc": 1739464682.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mckh0eh",
          "author": "SupaDave223",
          "body": "I did, but turned it off when my Authenticator apps notifications stopped coming in. Disabled AI and back to normal",
          "score": 2,
          "created_utc": 1739462679.0,
          "replies": [
            {
              "id": "mcko4zt",
              "author": "Sylvurphlame",
              "body": "Weird. It flags my Microsoft Authenticator notifications as important and pushes them through at all times.",
              "score": 2,
              "created_utc": 1739464692.0,
              "replies": [
                {
                  "id": "mclg7rz",
                  "author": "SupaDave223",
                  "body": "I made sure the setting in my notifications were set to time sensitive and everything.",
                  "score": 1,
                  "created_utc": 1739472639.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mclhcdg",
          "author": "SneakyFcknRusky",
          "body": "I did have it enabled for a while and periodically re-enable it but it is truly awful for me. \n\nIt doesn’t understand what I’m asking it at all and gives completely wrong results most of the time.  The summarisation feature gives incredibly wrong summaries. \n\nSiri is truly awful and it no longer understands me when I ask it to turn on and off home automations.",
          "score": 2,
          "created_utc": 1739472954.0,
          "replies": []
        },
        {
          "id": "mcmpjr0",
          "author": "MassiveBoner911_3",
          "body": "It stays on long enough to turn it right back off again every single new IOS update",
          "score": 2,
          "created_utc": 1739485351.0,
          "replies": []
        },
        {
          "id": "mcnk9sz",
          "author": "vid_icarus",
          "body": "I have and it sucks. It makes the earliest, most barebones versions of ChatGPT look like Einstein.",
          "score": 2,
          "created_utc": 1739495275.0,
          "replies": []
        },
        {
          "id": "mcplk1a",
          "author": "Stupidstuff1001",
          "body": "It’s just a spruced up Siri. Really useless for 95% of people.",
          "score": 2,
          "created_utc": 1739529479.0,
          "replies": []
        },
        {
          "id": "mcluxek",
          "author": "fatjeff1980",
          "body": "I turned it off after realizing it was eating my battery charge.",
          "score": 1,
          "created_utc": 1739476690.0,
          "replies": []
        },
        {
          "id": "mcrfikb",
          "author": "DJRR2011",
          "body": "I didn’t even know that is an option.",
          "score": 1,
          "created_utc": 1739553909.0,
          "replies": []
        },
        {
          "id": "mclga2y",
          "author": "x42f2039",
          "body": "Yep, it’s phenomenal",
          "score": -7,
          "created_utc": 1739472657.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mclmp6i",
      "author": "None",
      "body": "[removed]",
      "score": 41,
      "created_utc": 1739474437.0,
      "replies": [
        {
          "id": "mcowvv9",
          "author": "Lyndon_Boner_Johnson",
          "body": "The headline is fine, a lot of people just have terrible reading comprehension skills.",
          "score": 8,
          "created_utc": 1739514540.0,
          "replies": [
            {
              "id": "mcoxu6x",
              "author": "None",
              "body": "[removed]",
              "score": 6,
              "created_utc": 1739515055.0,
              "replies": [
                {
                  "id": "mcw69je",
                  "author": "eVaan13",
                  "body": "It's intentional clickbait. My first thought was the AI will be powered by a chinese company and then I reread it.",
                  "score": 2,
                  "created_utc": 1739623714.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mclsm31",
      "author": "None",
      "body": "[deleted]",
      "score": 16,
      "created_utc": 1739476058.0,
      "replies": [
        {
          "id": "mcohzf2",
          "author": "sayn3ver",
          "body": "😂",
          "score": 2,
          "created_utc": 1739507496.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mclwtzm",
      "author": "Lil_Drake_Spotify",
      "body": "BUY BABA STOCK",
      "score": 2,
      "created_utc": 1739477221.0,
      "replies": []
    },
    {
      "id": "mcqiptj",
      "author": "NotMalaysiaRichard",
      "body": "Do you guys even read the article (most likely not)?  This is for iPhones sold in China.",
      "score": 2,
      "created_utc": 1739544029.0,
      "replies": []
    },
    {
      "id": "mckc20e",
      "author": "TheGoldenCompany_",
      "body": "Ban this shit",
      "score": 9,
      "created_utc": 1739461249.0,
      "replies": [
        {
          "id": "mckfnz6",
          "author": "dropthemagic",
          "body": "I mean it’s nice if you don’t pay for chat gpt. You basically get x2 amount of queries per day. Not saying that the rest is where I want it to be. But we will see when contextual Siri comes out next month.",
          "score": 1,
          "created_utc": 1739462290.0,
          "replies": [
            {
              "id": "mckod3m",
              "author": "Sylvurphlame",
              "body": "Are we thinking it’s March, I thought it projected for April?",
              "score": 1,
              "created_utc": 1739464755.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mck2zhy",
      "author": "redddddddddditor",
      "body": "Will all searches on Winnie the Pooh be flagged by the CCP? 😂\n\nEdit: This was a rhetorical question.",
      "score": 4,
      "created_utc": 1739458496.0,
      "replies": [
        {
          "id": "mclewmc",
          "author": "homanagent",
          "body": "That's both hilarious AND original.\n\nThanks for sharing it with us.\n\nNow your country can go back to Holocausting the people of Palestine.",
          "score": 7,
          "created_utc": 1739472265.0,
          "replies": [
            {
              "id": "mclhvrj",
              "author": "Particular_Treat1262",
              "body": "You guys really can’t help but shove that into every hole you can find",
              "score": -4,
              "created_utc": 1739473104.0,
              "replies": [
                {
                  "id": "mcofnz1",
                  "author": "homanagent",
                  "body": "Ironic considering I see the stupid remark on winnie about a million times more but keep rimming.",
                  "score": 3,
                  "created_utc": 1739506547.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mck4ths",
          "author": "ab_90",
          "body": "Yes.",
          "score": -4,
          "created_utc": 1739459071.0,
          "replies": []
        },
        {
          "id": "mck561c",
          "author": "BearStrangler",
          "body": "Yes.",
          "score": -3,
          "created_utc": 1739459180.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcne7g5",
      "author": "olearyboy",
      "body": "So TikTok was bad because of what again?",
      "score": 1,
      "created_utc": 1739493251.0,
      "replies": []
    },
    {
      "id": "mcnlrgn",
      "author": "Bubbamusicmaker",
      "body": "No disassemble!",
      "score": 1,
      "created_utc": 1739495784.0,
      "replies": []
    },
    {
      "id": "mcouge3",
      "author": "OkMode3746",
      "body": "Ok so the tiktok ban and deepseek shit was hot garbage from the beginning great cool",
      "score": 1,
      "created_utc": 1739513277.0,
      "replies": []
    },
    {
      "id": "mcoukja",
      "author": "desterpot",
      "body": "Interesting",
      "score": 1,
      "created_utc": 1739513336.0,
      "replies": []
    },
    {
      "id": "mcp7txn",
      "author": "onclegrip",
      "body": "All good. America can’t be trusted at all.",
      "score": 1,
      "created_utc": 1739520825.0,
      "replies": [
        {
          "id": "mcs7gxf",
          "author": "ToastWJam32",
          "body": "Yes, probably better for you to place your trust in the China genoci- oops, I meant better for you to place your trust in China.",
          "score": 2,
          "created_utc": 1739562109.0,
          "replies": []
        },
        {
          "id": "mcprj3g",
          "author": "AugustWestWR",
          "body": "Just don’t use U.S.A. inventions then, like the cell phone, the internet, computers, or anything made with silicon chips 😉 problem solved!!",
          "score": 0,
          "created_utc": 1739532937.0,
          "replies": [
            {
              "id": "mcrpbe2",
              "author": "onclegrip",
              "body": "Classic right there.  Oh you don’t trust our government so dont use our inventions.   🤪🤣😂.",
              "score": 1,
              "created_utc": 1739556793.0,
              "replies": [
                {
                  "id": "mcsapye",
                  "author": "AugustWestWR",
                  "body": "Then don’t generalize! If you mean U.S. government, then say that. America is a whole continent comprising 57 different countries. 😜",
                  "score": 1,
                  "created_utc": 1739563062.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcpvrpa",
      "author": "heartbreakids",
      "body": "Wonder how this is going to work? Will the Chinese AI programmers get access to Apple data and have a chance to steal data or implement some kind of compromising code…. Kinda seems desperate of Apple to get back into China",
      "score": 1,
      "created_utc": 1739535102.0,
      "replies": []
    },
    {
      "id": "mcqez0b",
      "author": "Xylus1985",
      "body": "Why not use DeepSeek? It’s open source and free",
      "score": 1,
      "created_utc": 1739542758.0,
      "replies": []
    },
    {
      "id": "mdal2sj",
      "author": "Masturberic",
      "body": "\"in China\"\n\nOkay.",
      "score": 1,
      "created_utc": 1739818482.0,
      "replies": []
    },
    {
      "id": "mckokvl",
      "author": "mrverde92116",
      "body": "Ew!",
      "score": 1,
      "created_utc": 1739464816.0,
      "replies": []
    },
    {
      "id": "mcnqa0p",
      "author": "None",
      "body": "Apple ai is the worst feature to roll out ever, it is completely and utterly useless",
      "score": 1,
      "created_utc": 1739497336.0,
      "replies": []
    },
    {
      "id": "mcn2or9",
      "author": "simonscott",
      "body": "Bye bye Apple.",
      "score": 0,
      "created_utc": 1739489425.0,
      "replies": []
    },
    {
      "id": "mclrg5a",
      "author": "None",
      "body": "What??? No!! I just want a basic phone that does not facilitate any form of AI.\nI do not want this! Yet you are forcing it in updates!! Where is the option without this shitty early highly dangerous software digging in my shit!! Fuck! I want privacy and safety over fidgets! Get fucked Apple! I literally only used your device because it used to be the safest option. I need a flip phone! Fer fucks sake!",
      "score": -1,
      "created_utc": 1739475741.0,
      "replies": [
        {
          "id": "mcmhc8c",
          "author": "Kionera",
          "body": "Mate, cloud AI is optional. ChatGPT (the default outside China) is the last resort option, if the phone doesn't know what to do with your request, and it always asks the user whether or not to proceed to use it.\n\nYou can disable it entirely in Settings and then all requests will be processed on-device without leaving your phone.",
          "score": 3,
          "created_utc": 1739482969.0,
          "replies": [
            {
              "id": "mcoi4pf",
              "author": "sayn3ver",
              "body": "It's optional now. No one wants this shit",
              "score": -1,
              "created_utc": 1739507557.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mcmdcye",
      "author": "DarkarDruid",
      "body": "Yeah, no thanks.",
      "score": 0,
      "created_utc": 1739481842.0,
      "replies": []
    },
    {
      "id": "mcmpc0c",
      "author": "nicuramar",
      "body": "I mean, most of the features are provided by Apple themselves, on or off device, so it’s probably just a replacement for ChatGPT. ",
      "score": -1,
      "created_utc": 1739485286.0,
      "replies": [
        {
          "id": "mcn563l",
          "author": "Darknessie",
          "body": "It's not currently so why would it be for iPhone.\n\nAlibaba is a direct competitor to chatgpt",
          "score": 2,
          "created_utc": 1739490247.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mclja47",
      "author": "None",
      "body": "🤣",
      "score": -1,
      "created_utc": 1739473490.0,
      "replies": []
    },
    {
      "id": "mcm270d",
      "author": "None",
      "body": "lol ok, no problems here",
      "score": -1,
      "created_utc": 1739478713.0,
      "replies": []
    },
    {
      "id": "mcqtice",
      "author": "willowytale",
      "body": "i dont fucking care. china could have a personal file of photos of my junk and i wouldn't care. stop spamming me that the country that makes electronics has a hand in electronics",
      "score": -1,
      "created_utc": 1739547453.0,
      "replies": []
    },
    {
      "id": "mck6zoc",
      "author": "wotton",
      "body": "This is fantastic news.",
      "score": -4,
      "created_utc": 1739459743.0,
      "replies": []
    }
  ]
}