{
  "post": {
    "title": "NVIDIA Has Implemented a Massive Price Hike Across Its AI/Gaming GPU Offerings To Maximize Profitability & Counter Losses From China",
    "author": "a_Ninja_b0y",
    "id": "1kl47hu",
    "score": 2075,
    "created_utc": 1747084408.0,
    "selftext": "",
    "num_comments": 358,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kl47hu/nvidia_has_implemented_a_massive_price_hike/"
  },
  "comments": [
    {
      "id": "mrzde3a",
      "author": "Zuzumikaru",
      "body": "To the surprise of no one",
      "score": 862,
      "created_utc": 1747084653.0,
      "replies": [
        {
          "id": "ms0edz4",
          "author": "mqtgew",
          "body": "These price hikes are just NVIDIA flexing while they still can. They know they've got the market cornered for now, but Intel and AMD are catching up. Classic move to milk the cash cow before competition catches up. Either way, we're the ones paying for it.",
          "score": 217,
          "created_utc": 1747096953.0,
          "replies": [
            {
              "id": "ms0nwra",
              "author": "postedupinthecold",
              "body": "Gaming GPUs are now an incredibly small portion of NVIDIAs market share. this segment is no longer the cash cow, AI compute is",
              "score": 107,
              "created_utc": 1747100322.0,
              "replies": [
                {
                  "id": "ms1wfy8",
                  "author": "GuyWithLag",
                  "body": "Yea, people don't really _get_ that NVidia is a datacenter company, not a GPU company now...",
                  "score": 67,
                  "created_utc": 1747120144.0,
                  "replies": [
                    {
                      "id": "ms1zoxw",
                      "author": "NXGZ",
                      "body": "Is being a data center company the ultimate goal for a GPU company?",
                      "score": 3,
                      "created_utc": 1747122143.0,
                      "replies": [
                        {
                          "id": "ms3b32q",
                          "author": "joomla00",
                          "body": "Nvidia invested heavily into Ai for a loooong time.  So yes, that was one market they were set up to pivot to",
                          "score": 12,
                          "created_utc": 1747144425.0,
                          "replies": []
                        },
                        {
                          "id": "ms2lezb",
                          "author": "Tigerballs07",
                          "body": "Before ai probably not. But with Ai now that's where all the business consumers are who can shove out millions a purchase instead of thousands",
                          "score": 4,
                          "created_utc": 1747134736.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms1zkwf",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 17,
                  "created_utc": 1747122072.0,
                  "replies": [
                    {
                      "id": "ms27jlu",
                      "author": "Curse3242",
                      "body": "That's not a possibility anymore. The most basic AI is now being used in all workplaces, even in third world countries \n\nMy parents, even old grannies from the village know about AI & use ChatGPT. So it's definitely a bubble but it ain't popping",
                      "score": 11,
                      "created_utc": 1747127071.0,
                      "replies": [
                        {
                          "id": "ms28io1",
                          "author": "NLight7",
                          "body": "meh, the issue is that most people don't pay for AI right now. So it is yet another addition to the tech sphere like Youtube, Spotify, Netflix etc which don't make money and live on dreams. They are always at a risk to pop, not the whole market but one of the big players could pop any time which would have an effect.",
                          "score": 27,
                          "created_utc": 1747127685.0,
                          "replies": [
                            {
                              "id": "ms2gzb6",
                              "author": "GasolinePizza",
                              "body": "Individuals may not, but companies adding tooling for their employees workflows definitely are buying licenses and/or renting compute time.\n\nI suspect that's where most of the revenue for AI offerings are going to be coming from, at least for a while.",
                              "score": 4,
                              "created_utc": 1747132581.0,
                              "replies": [
                                {
                                  "id": "ms4f5n4",
                                  "author": "Broad_Match",
                                  "body": "We aren’t renting, it’s more cost effective to host it ourselves and use our own developers to leverage this beyond the offerings we get via existing licenses. \n\nThe appeal is to save money not spend more.",
                                  "score": 1,
                                  "created_utc": 1747156238.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ms2mz9d",
                              "author": "Curse3242",
                              "body": "I know a lot of companies & individual enthusiasts that are paying for AI. I'm not saying whatever I say is the truth but \"AI has no future\" could yet again be that reddit bubble that never seems to work out. Everyone was moving away from Reddit, Netflix... when new pricy plans rolled out.",
                              "score": 1,
                              "created_utc": 1747135441.0,
                              "replies": [
                                {
                                  "id": "ms2rc0z",
                                  "author": "NLight7",
                                  "body": "I am not saying they are dying, but you are just saying nonsense without looking. Every single big service is currently running on negative income. What I told you were stuff that seems profitable but is actually not. Netflix is negative, Youtube is negative, ChatGPT is negative, ALL OF THEM ARE GOING NEGATIVE INCOME.\n\nThey are currently living on investors investing in them, they have zero value currently, hence why any of these companies could die tomorrow if the investors realise there is no return on investment. The tech bubble is a real thing there is no profit to gain currently. And no AI will change that. People won't pay for AI just like they won't pay for a search engine. Some will but that is enough to float your toe.",
                                  "score": 2,
                                  "created_utc": 1747137314.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms2e061",
                          "author": "AStringOfWords",
                          "body": "You’re crazy to say this. ChatGPT isn’t even profitable on its $200 a month tier. The AI bubble pop is going to be the biggest we’ve ever seen, it’s going to make the dotcom bubble burst seem like a ripple.",
                          "score": 17,
                          "created_utc": 1747130962.0,
                          "replies": [
                            {
                              "id": "ms2n54d",
                              "author": "Curse3242",
                              "body": "I said this to the other guy too. Maybe. But also make sure this isn't another reddit bubble like the one where they were about to kill third party apps, Netflix new ad tier plan & countless more where everyone predicted it was about to die & nothing happened. AI is quite mainstream now.",
                              "score": 1,
                              "created_utc": 1747135514.0,
                              "replies": [
                                {
                                  "id": "ms32iz8",
                                  "author": "AStringOfWords",
                                  "body": "Being “mainstream” and actually turning a profit are two different things. LLMs and other GenAI cost billions to run and don’t come anywhere close to generating profits. Shareholder capital has to dry up at some point and then we’re in for a colossal crash. People aren’t going to pay for this crap, it’s only popular because it’s free to use.\n\nNvidia will wish for their gaming GPU business back again once it all comes crashing down.",
                                  "score": 3,
                                  "created_utc": 1747141554.0,
                                  "replies": [
                                    {
                                      "id": "ms36zpi",
                                      "author": "Curse3242",
                                      "body": "Well I don't think people will shy away from buying AI tools. If tommorow ChatGPT goes premium-only I will personally buy it. It's quite useful",
                                      "score": 0,
                                      "created_utc": 1747143082.0,
                                      "replies": [
                                        {
                                          "id": "ms3hu23",
                                          "author": "AStringOfWords",
                                          "body": "How much would you pay per month realistically? And what do you use it for?",
                                          "score": 3,
                                          "created_utc": 1747146507.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ms2umy4",
                                  "author": "GamePois0n",
                                  "body": "not even remotely similar comparison.\n\n\n\nyou are comparing foundation to roof boards, not even the whole roof\n\n\n\n\nit's like comparing gasoline to headlights on a car, can u run a car without headlights? now what about the fuel?",
                                  "score": 6,
                                  "created_utc": 1747138641.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms34jpj",
                          "author": "shadowtheimpure",
                          "body": ">in all workplaces\n\nNo, it's not. It's not even used in **most** workplaces.",
                          "score": 1,
                          "created_utc": 1747142255.0,
                          "replies": [
                            {
                              "id": "ms3772y",
                              "author": "Curse3242",
                              "body": "I mis-wrote. I wanted to write \"in all **type of** workplaces\"\n\nAt least everyone around me is, so IT, Trading, Stocks, Business Owners, CA's",
                              "score": 1,
                              "created_utc": 1747143153.0,
                              "replies": [
                                {
                                  "id": "ms37u4b",
                                  "author": "shadowtheimpure",
                                  "body": "For IT at least, it really depends on what aspect of IT you're in. I'm an end user support specialist level 3, nobody on my team uses AI for our work.",
                                  "score": 1,
                                  "created_utc": 1747143369.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms74yuz",
                          "author": "fmaz008",
                          "body": "AI is used so long as it's cheap. Valuation of AI companies far exceed their actual profitability. That's where the bubble is:\n\nAt some point investors will realized this AI stuff is very expensive and not making money as much as it should do be sustainable.\n\nAny AI that is free is deeply unsustainable. A lot of paid AI don't turn an actual profit. It's the .com bubble all over again.",
                          "score": 1,
                          "created_utc": 1747186954.0,
                          "replies": []
                        },
                        {
                          "id": "ms7piym",
                          "author": "modestlaw",
                          "body": "This feels like the dot com bubble all over again",
                          "score": 1,
                          "created_utc": 1747194776.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ms5cgn5",
                      "author": "TheSchlaf",
                      "body": "AI gonna pop the humanity bubble one day.",
                      "score": 1,
                      "created_utc": 1747165856.0,
                      "replies": []
                    },
                    {
                      "id": "ms8jyqt",
                      "author": "j_schmotzenberg",
                      "body": "The AI bubble is barely inflated. Companies are trying to use AI far more than the available compute allows. NVIDIA has room to sell tons more graphics cards at far higher margins than they can get for gaming cards.",
                      "score": 1,
                      "created_utc": 1747211307.0,
                      "replies": []
                    },
                    {
                      "id": "ms2nqoa",
                      "author": "p4ttythep3rf3ct",
                      "body": "Impossible at this point unless humanity, like the entire planet, outright bans it. ",
                      "score": 0,
                      "created_utc": 1747135781.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms285yk",
                  "author": "biggendicken",
                  "body": "if you can make good gaming GPUs you can make good AI compute cards too",
                  "score": 2,
                  "created_utc": 1747127463.0,
                  "replies": [
                    {
                      "id": "ms3gg1n",
                      "author": "postedupinthecold",
                      "body": "That is extremely far from the truth",
                      "score": 0,
                      "created_utc": 1747146088.0,
                      "replies": [
                        {
                          "id": "ms3iltd",
                          "author": "biggendicken",
                          "body": "No it isnt",
                          "score": 1,
                          "created_utc": 1747146739.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms0jkkd",
              "author": "Noselessmonk",
              "body": "I dunno about anyone else, but I'm not paying for it. The 5000 series seems underwhelming, overly power consuming and not without issues anyway.",
              "score": 110,
              "created_utc": 1747098801.0,
              "replies": [
                {
                  "id": "ms1qsau",
                  "author": "ArseBurner",
                  "body": "Far as I can see Nvidia hardly cares about the gaming segment anyway. We're getting the \"take it or leave it\" price treatment. \n\nIf nobody buys they'll just produce fewer 50 series GPUs and make more B200s.",
                  "score": 24,
                  "created_utc": 1747116868.0,
                  "replies": [
                    {
                      "id": "ms1u6xc",
                      "author": "burtmacklin15",
                      "body": "They don't even care enough to make working drivers at this point.",
                      "score": 11,
                      "created_utc": 1747118828.0,
                      "replies": [
                        {
                          "id": "ms28vkz",
                          "author": "ArseBurner",
                          "body": "😤✋ fake frames \n\n☺️👉 fake drivers",
                          "score": 11,
                          "created_utc": 1747127911.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ms8k2ly",
                      "author": "j_schmotzenberg",
                      "body": "This is correct. Every gaming card sold reduces their margins. They’re better off using the silicon elsewhere.",
                      "score": 1,
                      "created_utc": 1747211373.0,
                      "replies": []
                    },
                    {
                      "id": "ms3cm46",
                      "author": "joomla00",
                      "body": "Jensen doesn't seem like the type that wants to lose.  But they have a complete monopoly of the high-er end and up.  And their products have headroom to be cranked further if AMD puts out something wicked (thats actually a threat to their market share).  Combine that with enterprise cards that they can't sell fast enough, they literally have no incentive to do better.  People complain like they always do, and Nvidia will still have +80% of the gaming market.",
                      "score": 0,
                      "created_utc": 1747144906.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms10udz",
                  "author": "Kerrigore",
                  "body": "Agreed. I went with a 9070XT over a 5070ti and couldn’t be happier.",
                  "score": 32,
                  "created_utc": 1747104890.0,
                  "replies": [
                    {
                      "id": "ms1a2ac",
                      "author": "Aleyla",
                      "body": "Completely agree.  My 970 is doing just fine.",
                      "score": 11,
                      "created_utc": 1747108668.0,
                      "replies": [
                        {
                          "id": "ms1wfyi",
                          "author": "bonesnaps",
                          "body": "Going to wait another gen while my 3070 holds out, but amd is back on the menu.",
                          "score": 3,
                          "created_utc": 1747120144.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ms21y1y",
                      "author": "JohnnyOnslaught",
                      "body": "Yeah, I've been loving my AMD card. I'm not going back to NVIDIA until I see drastic changes out of them.",
                      "score": 2,
                      "created_utc": 1747123526.0,
                      "replies": []
                    },
                    {
                      "id": "ms284xc",
                      "author": "NLight7",
                      "body": "My next GPU is also def going be AMD, I am done with Nvidia.",
                      "score": 2,
                      "created_utc": 1747127445.0,
                      "replies": []
                    },
                    {
                      "id": "ms3dqs8",
                      "author": "TheAmorphous",
                      "body": "How's AMD on Linux these days?",
                      "score": 2,
                      "created_utc": 1747145259.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms27f1m",
                  "author": "Curse3242",
                  "body": "Well with GPUs there's that issue where regardless of how good a new iteration is, there's people with old hardware that waited & planned for a certain time frame to upgrade their piece & 5000 series will end up being the best option \n\nSame as phones. No reason for the iPhone to keep costing same/more than previous year, they've been the same for a decade. But people want to upgrade the hardware",
                  "score": 1,
                  "created_utc": 1747126989.0,
                  "replies": [
                    {
                      "id": "ms2oknk",
                      "author": "meistermichi",
                      "body": ">Well with GPUs there's that issue where regardless of how good a new iteration is, there's people with old hardware that waited & planned for a certain time frame to upgrade their piece & 5000 series will end up being the best option \n\n\nI'm still rocking a 2070 and was thinking about upgrading for a few years now but fuck no I ain't paying what they call for the 50s.      \nFor now it's still adequate for my use case so I'll just stick with it instead of buying.\n\nProbably gonna be an AMD once I really have to upgrade.",
                      "score": 1,
                      "created_utc": 1747136149.0,
                      "replies": [
                        {
                          "id": "ms2pvrl",
                          "author": "Curse3242",
                          "body": "2070 is still recent IMO. I have a 1060. And I am looking to upgrade to enjoy GTA6. So if 60 series RTX cards are out by the time GTA6 comes to PC, regardless of how shit they are I'd buy one. It'd be 10 years since my last GPU\n\nThat's what I'm saying. They will always have customers that want an upgrade \n\nTake my own self again when it comes to phone. I was pretty happy with my OnePlus7 until it broke. I had no choice but to buy a new phone. I wanted a cheaper option but the family urged me to just go for a better one now that I'm older so I got the S25. Many would say it's a pointless upgrade over S24. But it was the latest hence I got it.",
                          "score": 1,
                          "created_utc": 1747136716.0,
                          "replies": [
                            {
                              "id": "ms2rkd0",
                              "author": "meistermichi",
                              "body": ">2070 is still recent IMO. \n\n7 years it's been, so not that recent.\n\n> And I am looking to upgrade to enjoy GTA6. So if 60 series RTX cards are out by the time GTA6 comes to PC, regardless of how shit they are I'd buy one. It'd be 10 years since my last GPU\n>\n>That's what I'm saying. They will always have customers that want an upgrade \n\nPersonal choice though, you don't have to get the newest/highest tier of graphics card to enjoy GTA6.    \nUnless the 60 series has the best value for money on the market at the time there'll be other better options.\n\nThat's like saying I'll upgrade to a Lamborghini to enjoy the new road when an Audi or whatever would do the trick as well.\n\nThat being said to each their own, it's your money do with it what you think is best for you.\n\nHave a nice day, mate.",
                              "score": 1,
                              "created_utc": 1747137409.0,
                              "replies": [
                                {
                                  "id": "ms2slyc",
                                  "author": "Curse3242",
                                  "body": "Atleast it's a RTX card XD. Also a xx70 level which is quite good.\n\nI wouldn't have to buy a 60 series. I could buy a 50 series (although usually the newest cards end up being the best deals because especially now Nvidia does the whole limiting features thing). The fact is the same. A lot of people with old cards that already felt the prices of early RTX cards were a joke. Who now might give in anyways. \n\nAll we can hope for is a genuine competitor. Nvidia is expensive but if it has all the features then it's worth getting that because GPUs are a one time purchase \n\nBut yeah it's all personal opinion",
                                  "score": 1,
                                  "created_utc": 1747137834.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms32loz",
                  "author": "Naxirian",
                  "body": "I haven't bought an Nvidia since the GTX 600 series on principle. They're a greedy company. I bought an AMD 9070 XT this upgrade cycle and very happy with it for the price.",
                  "score": 1,
                  "created_utc": 1747141580.0,
                  "replies": []
                },
                {
                  "id": "ms43s8k",
                  "author": "i81u812",
                  "body": "Nope each card comes in it lower power consumption in total draw. And depending upon what card you're getting and where you're coming from is up to a huge potential Improvement finally the fourth generation was bullshit Improvement.\n\n\n\nThe cards are still preposterously overpriced now but we should be honest these cards are cutting edge.\n\n\nLike you and other mentioned it's not their business soon enough so they won't care. It will be left to Intel and AMD soon enough.",
                  "score": 1,
                  "created_utc": 1747152944.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms0qr8b",
              "author": "Phantomebb",
              "body": "They are catching up? Even with the 50 series paper launch Nvidia is around 90% of the market and last time it was even close to 60% was Q4 of 2011.\n\nSo maybe in a decade?",
              "score": 28,
              "created_utc": 1747101311.0,
              "replies": [
                {
                  "id": "ms0wik5",
                  "author": "Qulox",
                  "body": "Intel is in terrible shape now; I wouldn't be surprised if they abandon the GPU market, and AMD gave up in the high-end segment. The only real hope of competition is if China comes up with something decent, but that may take decades.",
                  "score": 18,
                  "created_utc": 1747103272.0,
                  "replies": [
                    {
                      "id": "ms1r2lb",
                      "author": "ArseBurner",
                      "body": "Intel knows it can't just pull out of GPUs if they want any part of the AI accelerator market. \n\nIt was their lack of GPU expertise in the first place that prevented them from being ready with their own chip, meanwhile AMD needed just one generation after the initial A100 launch to have an H100 competitor.",
                      "score": 4,
                      "created_utc": 1747117031.0,
                      "replies": []
                    },
                    {
                      "id": "ms0yjk5",
                      "author": "Phantomebb",
                      "body": "We as gpu consumers have to face the facts. There's no real money in normal gpus anymore. Data centers are the present and future. Just look at Nvidias earnings and you will see why they are making crappies products for more money every generation. \n\nIf you don't know in Q4 nvidia revenue was 2.8 billion for gaming and 18.4 billion for data centers.",
                      "score": 13,
                      "created_utc": 1747104017.0,
                      "replies": [
                        {
                          "id": "ms1b236",
                          "author": "jert3",
                          "body": "2.8 billion dollars is real money.\n\nAnd if you are developing cutting edge gpus, it's not much of a big deal at all to make a video card for gaming version and a data center / AI coprocessor card. It's just a different configuration of the same technology.",
                          "score": 9,
                          "created_utc": 1747109098.0,
                          "replies": [
                            {
                              "id": "ms1hs1q",
                              "author": "Phantomebb",
                              "body": "It's really not when you factor in everything. Driver support, marketing, packaging, shipping, dealing with 3rd parties card sellers, etc. Everything takes a chip out of revenue. \n\nIt's much easier to be Ferarri than Ford. And Data centers are massive right now. Everyone wants one, two, hell twenty if they could find the power. You can sell directly to large construction companies you know are good for it. We are talking hundreds if not thousands of H100 GPUs or equivalent per data center, design dependant. And those things are 30k+ a piece.\n\nThat's real money and it comes with more demand than regular GPUs and higher profit margins by far. \n\nTake a drive by Nvidias HQ. You will see a bunch of data centers and construction companies nearby. There's over 70 in Santa Clara alone and over 150 in the bay area. In fact there so many data centers SVP(Silcon Valley power) is out of power for years with no new major power consumption projects bring approved.",
                              "score": 7,
                              "created_utc": 1747112145.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ms6c6j3",
                          "author": "Bloody_Sunday",
                          "body": "I hope you don't actually mean or think that Nvidia will ignore its years-long leading position in GPU sales, and its considerable associated revenue and prestige. Or that it has any intention of giving it up to its competitor(s).",
                          "score": 0,
                          "created_utc": 1747176881.0,
                          "replies": [
                            {
                              "id": "ms6p0hu",
                              "author": "Phantomebb",
                              "body": "What does this even mean? They have a monopoly, therir quality has dipped considerably, and make less than 15% of there revenue from normal consumers gpus.",
                              "score": 1,
                              "created_utc": 1747181282.0,
                              "replies": [
                                {
                                  "id": "ms7dk8l",
                                  "author": "Bloody_Sunday",
                                  "body": "What it means is exactly what it says. For a variety of reasons including these, there's no way this market position and revenue can be considered to be either negligible or even worse, one to simply give up.",
                                  "score": 1,
                                  "created_utc": 1747190014.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms33dcd",
                      "author": "Naxirian",
                      "body": "AMD pulled out of the high end this gen. It's not the first time they've done it, 5700XT was mid range and the top AMD GPU of its generation, they resumed high end in the 6000 and 7000 series. It doesn't necessarily mean they won't do high end again, especially when there's a big price gap between Nvidia's high end.\n\n7900XTX competed just fine with the 4080, and the 5080 is a pretty bad deal for price/performance. There's plenty of room there for AMD to do high end again next gen.",
                      "score": 2,
                      "created_utc": 1747141851.0,
                      "replies": []
                    },
                    {
                      "id": "ms2claz",
                      "author": "Speedstick2",
                      "body": "There is no evidence that AMD has permanently given up on the high end market.",
                      "score": 1,
                      "created_utc": 1747130148.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mse6lik",
                  "author": "splerdu",
                  "body": "I think around end of 2004-early 2005 ATI was actually ahead of Nvidia. This would have been built on the incredible good will from the 9000 series of the time. The 9800 Pro was beast!",
                  "score": 2,
                  "created_utc": 1747281668.0,
                  "replies": []
                },
                {
                  "id": "ms1b7h6",
                  "author": "colin_colout",
                  "body": "And AMD / Intel have bad driver and platform support for the money making high end (mainly ML  / data science / AI workloads).\n\nAMD / Intel are PowerPC and Nvidia is x86. They have market share and platforms support and that doesn't seem to have changed.",
                  "score": -6,
                  "created_utc": 1747109162.0,
                  "replies": [
                    {
                      "id": "ms2cxk4",
                      "author": "Speedstick2",
                      "body": "Have you seen Blackwell drivers?",
                      "score": 1,
                      "created_utc": 1747130343.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms0qvzl",
              "author": "No-Bother6856",
              "body": "We are only the ones paying for it if we actually buy their product. Buy the Intel and AMD product. Having a few more frames in the latest game isn't something you actually need and supporting competition pays off in the long term.",
              "score": 15,
              "created_utc": 1747101358.0,
              "replies": [
                {
                  "id": "ms16olf",
                  "author": "_mannen_",
                  "body": "I did. \nI bought the Intel A770. It was terrible. Inference was a nightmare with very limited support in the open source field, especially for their own branch of Ollama. Linux drivers were poor, no way of controlling power draw or fans that got stuck at 100%.\nHad to return it and get a Nvidia card, and everything just works out of the box.\n\nEdit: Thanks for the downvotes guys... It's not my fault Intel lags behind and doesn't step up to make their stuff more compatible with Linux and LLM.",
                  "score": -3,
                  "created_utc": 1747107222.0,
                  "replies": [
                    {
                      "id": "ms2d1fd",
                      "author": "Speedstick2",
                      "body": "Why didn’t you go AMD?",
                      "score": 1,
                      "created_utc": 1747130403.0,
                      "replies": [
                        {
                          "id": "ms2o4aa",
                          "author": "_mannen_",
                          "body": "There was a good deal to be had on the RTX 3060. \n\nThe RX 7600 XT was about 50% more expensive and has worse memory bandwidth. The RX 7800 XT was more than double the price of the RTX 3060.",
                          "score": 1,
                          "created_utc": 1747135950.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms0q8jw",
              "author": "Neriya",
              "body": "I just ordered myself a 9070 XT. It'll be the first time I primaried an AMD GPU since a R9 290X.\n\nThough other systems in my home have featured an RX470, RX480, 5700XT, and still has a 6600XT, all of which have been excellent.\n\nAMD has had a decent option at almost every point, just not headlining and not always with a fully matching feature set. But there's never been a game that my wife or kid wanted to play in my house that their AMD GPUs couldn't handle.",
              "score": 10,
              "created_utc": 1747101130.0,
              "replies": [
                {
                  "id": "ms10jj2",
                  "author": "Omophorus",
                  "body": "Hell, the 7900XTX is an absolute raster monster.\n\nIt does not go blow for blow on RT, Dynamic Scaling (DLSS, FSR), or GPGPU tasks, but it absolutely hangs strong in any situation where rasterization is the main factor.\n\nSome games like Cyberpunk 2077 look better on my old 3090 than my 7900XTX, but most of the time games look every bit as good and just at a higher average FPS by some margin.  Very helpful for keeping 100+ FPS with settings cranked up at 1440p.",
                  "score": 5,
                  "created_utc": 1747104774.0,
                  "replies": []
                },
                {
                  "id": "ms2yft9",
                  "author": "Edarneor",
                  "body": "Hey, I had a 290X! Played Witcher 3 on it, and then some. Got it used, and it eventually died after several years, still great value! Between the prices and the ridiculous 8gb cards in 2025, screw nvidia",
                  "score": 1,
                  "created_utc": 1747140093.0,
                  "replies": [
                    {
                      "id": "ms3haxa",
                      "author": "Neriya",
                      "body": "Heck yeah.\n\nThe RX480/RX580 cards were insane values for 1080p gaming, both at release and immediately after the mining crash. I picked up several of them for $60 each at a time where they landed somewhere between a GTX 1060 and GTX 1070 in terms of late-life performance, but a GTX 1060 was selling for >$100 and only had 6GB of RAM. They made great little Fortnite cards.\n\nThe RX5700XT is sort of in that position now. You can find them as cheap as $100-$120, and they have the non-RT performance of an RTX 2070. Basically if a PS5 can play it, so can a RX5700XT, with the exception of the newest titles that require RT capabilities (looking at you Indiana Jones and Doom DA).",
                      "score": 2,
                      "created_utc": 1747146347.0,
                      "replies": [
                        {
                          "id": "ms3xaly",
                          "author": "Edarneor",
                          "body": "There are games that *require* RT now? Instead of it being optional?",
                          "score": 1,
                          "created_utc": 1747151048.0,
                          "replies": [
                            {
                              "id": "ms47s4m",
                              "author": "Neriya",
                              "body": "A few, yes. Indiana Jones and the Great Circle, and as of tomorrow Doom the Dark Ages. Thankfully the RT load on these games is relatively light and they run fairly well on even lower-end RT capable hardware.",
                              "score": 1,
                              "created_utc": 1747154117.0,
                              "replies": [
                                {
                                  "id": "ms58fwl",
                                  "author": "Edarneor",
                                  "body": "Yeah, I was wondering, since it should run on PS5 and it has an AMD gpu, and not the newest at that. Was it rdna 2?",
                                  "score": 1,
                                  "created_utc": 1747164674.0,
                                  "replies": [
                                    {
                                      "id": "ms59mdl",
                                      "author": "Neriya",
                                      "body": "The PS5 and Xbox Series is AMD Zen2+RDNA2 based. It doesn't have an exact dedicated GPU equivalent, but it's somewhere in the rough ballpark of a 6600 or 6600XT. The 5700XT is RDNA1 and is similar in raster performance to the 6600XT but lacks the RT capabilities.\n\nFor most games that don't require RT, the 5700XT can play at PS5-equivalent settings if you're comparing it to the PS5 'performance mode' in most games, and especially so if you're targeting 1080p or an upscaled 1440p. The 6600XT is similar, and the RT is weak, but it's technically capable of handling the RT required games.",
                                      "score": 2,
                                      "created_utc": 1747165028.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms1m8vw",
              "author": "Mehhish",
              "body": "A Volcano could erupt in Washington State, and NVIDIA would raise their prices and blame the eruption. Honestly, pretty much every company would probably do that. lol",
              "score": 5,
              "created_utc": 1747114407.0,
              "replies": []
            },
            {
              "id": "ms2onva",
              "author": "Zedrackis",
              "body": "Catching up is a matter of opinion. AMD is putting specs where it matters to  gamers, at a lower price point. Now a much lower price point. If ray tracing or AI frame gen don't matter AMD is already a better card at a better price.",
              "score": 2,
              "created_utc": 1747136188.0,
              "replies": []
            },
            {
              "id": "ms4tdo1",
              "author": "BlackSecurity",
              "body": ">were the ones paying for it\n\n\nWell...no one is forcing you/us! Unless you have some job or work that requires the most top of the line GPUs, there's no real need to pay $2000+ for one.",
              "score": 1,
              "created_utc": 1747160312.0,
              "replies": []
            },
            {
              "id": "msfm53a",
              "author": "None",
              "body": "As much as I want to believe for as long as Nvidia and AMD have been fighting people have been saying AMD is catching up... But it always with value, because thats the only way they can stay alive when you have to catch up. For all we know nvidia has tech waiting on the shelves for when the gap gets too close",
              "score": 1,
              "created_utc": 1747309785.0,
              "replies": []
            },
            {
              "id": "ms1vxcn",
              "author": "ki11bunny",
              "body": "Not being funny but AMD have been \"catching up\" backwards for the last 10 years.",
              "score": 0,
              "created_utc": 1747119836.0,
              "replies": []
            },
            {
              "id": "ms1wli7",
              "author": "_makura",
              "body": "> but Intel and AMD are catching up\n\nThey've been catching up for years, I fear nVidia is just too good.",
              "score": 0,
              "created_utc": 1747120238.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms23ldw",
          "author": "Chr0ll0_",
          "body": "Yep",
          "score": 1,
          "created_utc": 1747124570.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrzfbzh",
      "author": "Za_Lords_Guard",
      "body": "Now hear me out... I have a solution.  Don't buy Nvidia",
      "score": 254,
      "created_utc": 1747085252.0,
      "replies": [
        {
          "id": "mrzv0rs",
          "author": "KD--27",
          "body": "When I saw the prices of the latest cards I snortled. My entire system including the graphics card from Nvidia, was *less* than what they are charging for the latest card.",
          "score": 77,
          "created_utc": 1747090412.0,
          "replies": [
            {
              "id": "ms2ftep",
              "author": "breatheb4thevoid",
              "body": "And then other Chinese firms are bringing the price of FPV drones back the other way.\n\nI don't have to play video games Jensen if my other tech hobbies becomes cheaper. Don't we love free market capitalism?",
              "score": 2,
              "created_utc": 1747131959.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms0nc7i",
          "author": "TournamentCarrot0",
          "body": "Yeah think I’m out simply on principle ",
          "score": 9,
          "created_utc": 1747100123.0,
          "replies": [
            {
              "id": "ms27gzw",
              "author": "emorcen",
              "body": "Same, I'm now building Gundam models and playing VR games instead since my 1070 is on its last legs.",
              "score": 1,
              "created_utc": 1747127024.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrzvxwz",
          "author": "TheBoBiZzLe",
          "body": " *sighs and looks at all the games being made to basically only work with nvidias AI programs.”\n\nWish our elected officials would set up and support us.  Product us from predatory practices.  Stop lying to us and saying it’s a “free market” and “it’s just supply and demand” while they are controlling the supply and ignoring the demand.\n \nAMD dropped the ball this year to get its spot back in the market.  Damn.",
          "score": 7,
          "created_utc": 1747090729.0,
          "replies": [
            {
              "id": "ms049rk",
              "author": "CaptainDouchington",
              "body": "Why would anything change when everyone in congress is benefiting from this shit cause they own shares in these companies...\n\nWe are all acting shocked but when we were making money we didn't care...",
              "score": 15,
              "created_utc": 1747093504.0,
              "replies": []
            },
            {
              "id": "ms13r5z",
              "author": "noJokers",
              "body": "I dont really buy that at all. AMDs offerings are competitive this year, in fact for most people they are better value. But people claim its not good enough and buy Nvidia anyway for some reason and then wonder why the next generation doesnt get any better. Vote with your wallet.",
              "score": 17,
              "created_utc": 1747106026.0,
              "replies": [
                {
                  "id": "ms1rxgb",
                  "author": "TheBoBiZzLe",
                  "body": "Just feels that a smart move to follow up the Nvidia drama would be to undercut and flood the market with AMD.  The fear I have now is that so many new games look like garbage without their upscaling junk.  So if a game only supports one and not the other, a game company would be pretty stupid to not support DLSS.  But if the market floods and shifts to AMD, they could turn the market to start an “upscale” battle.   A competitive price isint going to switch people and developers over.  They’d need to make a move.\n\nBut… they won’t.  Especially with the switch taking on Nvidia and focusing on dsll.  AMD had their window.  /shrug",
                  "score": 1,
                  "created_utc": 1747117521.0,
                  "replies": [
                    {
                      "id": "ms27qki",
                      "author": "noJokers",
                      "body": "AMD did undercut nvidia. The 9070 and 9070xt are both cheaper than their rasterised performance nvidia counterparts. Yes upscaling will indeed be important and fsr is included in 99% of games with dlss, the only exception that I have seen is clairObscure. \n\nCustomers wont switch over night no matter how good AMD is, it took ryzen 6 generations straight of dunking on intel to even get to market parity. \n\nThe switch 2 was always going to be nvidia because the switch 1 uses nvidia and they wanted compatibility. Every other console (excluding the msi claw) uses an amd based APU including the ps5, xbox, steamdeck, legion etc. \n\nAMDs window is the same as it was with ryzen and like ryzen it will take time for them to build market share, UDNA is meant to be a continuation of these improvements and is likely AMDs ryzen 3000 moment.",
                      "score": 3,
                      "created_utc": 1747127194.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms1y0u9",
              "author": "cgaWolf",
              "body": ">AMD dropped the ball this year to get its spot back in the market. Damn.\n\nConsidering they have  nothing to rival a 5080 even, i think they played a bad hand of cards really well.",
              "score": 2,
              "created_utc": 1747121110.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms01o8t",
          "author": "magicomiralles",
          "body": "There is no competition :(\nAMD needs to step up their game.\n\nEDIT: I thought that I was in an AI subreddit.",
          "score": 2,
          "created_utc": 1747092653.0,
          "replies": [
            {
              "id": "ms05urh",
              "author": "JoostinOnline",
              "body": "Honestly, they have. This is the first generation since Polaris (the RX 400 and 500 series) where I think AMD has a really strong product. They finally have a decent hardware upscaler, and their encoders aren't shit anymore (meaning Twitch streaming on one isn't embarrassing). They've also ironically ended up with more stable drivers than Nvidia.\n\nIt's embarrassing that it took them this long to actually address the many issues they had, and I won't say all their features are as refined as Nvidia's, but they've hit that key \"good enough\" point to pass scrutiny.\n\nEdit: I should specify, I'm saying they're a good alternative for gaming. For content creation, there are still some downsides.",
              "score": 14,
              "created_utc": 1747094015.0,
              "replies": [
                {
                  "id": "ms0twiy",
                  "author": "NickCharlesYT",
                  "body": "Honestly, they haven't, because there's still no viable alternative to CUDA. If you game, and **only** game, fine. But if you do literally anything else, i.e. CAD, complex photo editing, video editing, AI, etc., then it's essentially Nvidia or nothing. OpenCL is terrible, if it's supported at all by your program of choice, and I haven't heard anything about ROCm since they announced it, what, a decade ago? They need to do better for the rest of us.",
                  "score": 10,
                  "created_utc": 1747102367.0,
                  "replies": [
                    {
                      "id": "ms102wv",
                      "author": "KetaNinja",
                      "body": "ROCm is still alive, but the number of supported consumer GPUs is so small that it might as well not be. RDNA 4 isn't even compatible yet lol",
                      "score": 2,
                      "created_utc": 1747104595.0,
                      "replies": []
                    },
                    {
                      "id": "ms2grx5",
                      "author": "RaspberryHungry2062",
                      "body": "Yeah as a 3D Artist it's also completely impossible to not go Nvidia if you wanna be competitive at all. It's a monopoly. I don't understand how Nvidia is allowed to keep CUDA proprietary.",
                      "score": 2,
                      "created_utc": 1747132472.0,
                      "replies": []
                    },
                    {
                      "id": "ms0w7y1",
                      "author": "JoostinOnline",
                      "body": "You're not wrong, and I'm not saying it's a viable alternative for everything. I'm a gamer (and previously a streamer), so that's where my focus is.\n\nThat being said, being a good alternative for a lot of people is very much a step in the right direction. These things usually don't happen all at once, but I'm glad they've got a good base for some people now.",
                      "score": 3,
                      "created_utc": 1747103166.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms1at94",
                  "author": "Aleyla",
                  "body": "> It's embarrassing that it took them this long to actually address the many issues they had.   \n   \nA few years ago they gutted most of the team that was addressing driver issues.   Maybe they finally rehired.",
                  "score": 1,
                  "created_utc": 1747108995.0,
                  "replies": [
                    {
                      "id": "ms46ky3",
                      "author": "JoostinOnline",
                      "body": "I don't know about that, but it was literally only 2 years ago they they STARTED working on an AI upscaler. Imagine if FSR4 had been around in 2020. I think we'd have a very different landscape now. The Radeon engineers have always been very resistant to new technologies. They seem content to make lesser clones of whatever Nvidia does.",
                      "score": 1,
                      "created_utc": 1747153765.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms06u6x",
                  "author": "fat-dumb-ugly-bitch",
                  "body": "Yeah lil bro just delete this comments spits on face",
                  "score": -36,
                  "created_utc": 1747094341.0,
                  "replies": [
                    {
                      "id": "ms07irw",
                      "author": "Toomanydamnfandoms",
                      "body": "??? you good bro?",
                      "score": 14,
                      "created_utc": 1747094572.0,
                      "replies": [
                        {
                          "id": "ms07thf",
                          "author": "JoostinOnline",
                          "body": "Pretty sure that's a teenager who thinks being \"edgy\" is hilarious content.",
                          "score": 12,
                          "created_utc": 1747094676.0,
                          "replies": [
                            {
                              "id": "ms0j20w",
                              "author": "ThePrussianGrippe",
                              "body": "Novelty accounts used to be clever.",
                              "score": 4,
                              "created_utc": 1747098617.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms06jl2",
              "author": "drmirage809",
              "body": "A couple buddies of mine jumped on the RDNA 4 train when those cards dropped and have nothing but praise for those cards. Those cards are serious powerhouses and AMD finally seems to have the whole ray tracing thing figured out properly. FSR4 is also really nice from all I've heard. (Haven't experienced it first hand yet.) And from all I've seen Intel actually make a solid card on a budget.\n\nThe game has been stepped up outside the upper echelons of things. Chasing that performance crown that Nvidia has held for the last decade or so is folly. But the rest of the market? That's a spicy scene.\n\n  \nEdit: should add we are in Europe. Tariffs aren't really a thing here.",
              "score": 7,
              "created_utc": 1747094243.0,
              "replies": [
                {
                  "id": "ms0rvde",
                  "author": "alidan",
                  "body": "the problem is nvidia is setting what needs to be done. \n\nwhat needs to be done is a great optimization of games, there is no justifiable reason new games should perform as bad as they do and barely look better than 10 year old games",
                  "score": 3,
                  "created_utc": 1747101693.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms0dmbf",
              "author": "fvck_u_spez",
              "body": "My 9070XT had been killer. And now apparently out performs a 5080 in the new Doom and a handful of other titles",
              "score": 3,
              "created_utc": 1747096682.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms4smmh",
          "author": "Reader3123",
          "body": "There isnt another nvidia. Most the open source developement is on nvidia. Trust me, i would love for my rx 6800 to be able to train my llms, amd just doesnt care about that as much",
          "score": 1,
          "created_utc": 1747160096.0,
          "replies": []
        },
        {
          "id": "ms2ecqd",
          "author": "LightBroom",
          "body": "The last Nvidia card I bought was the 8800 GT, about a million years ago.",
          "score": 1,
          "created_utc": 1747131157.0,
          "replies": [
            {
              "id": "ms3zcte",
              "author": "ResponsibleQuiet6611",
              "body": "😆 I had that card in my HP pre-built \"windows media center\" era PC in the mid 2000s as a teenager. I cooked it playing HL2 mods, BF2 and WoW lol.",
              "score": 1,
              "created_utc": 1747151643.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrzdvgx",
      "author": "NorysStorys",
      "body": "So to cover their loses in China, they want to increase their losses everywhere? Interesting strategy.",
      "score": 509,
      "created_utc": 1747084801.0,
      "replies": [
        {
          "id": "mrze6qe",
          "author": "compound-interest",
          "body": "This only happens in a rational market. In the current one they can release 8gb cards, broken drivers, and charge double, and they’ll still sell every single card they make. Obviously it’s not losing them money if demand is still there.",
          "score": 288,
          "created_utc": 1747084897.0,
          "replies": [
            {
              "id": "mrzfbru",
              "author": "PG908",
              "body": "Yep. For all economics is legitimate and valid and whatnot, sometimes assuming large groups of people (and algorithms) are rational and acting on complete, correct information is a bad assumption.",
              "score": 59,
              "created_utc": 1747085250.0,
              "replies": []
            },
            {
              "id": "ms1njh8",
              "author": "Dracogame",
              "body": "The 5000 series is selling very poorly compared to the previous one",
              "score": 8,
              "created_utc": 1747115093.0,
              "replies": []
            },
            {
              "id": "mrzi5x4",
              "author": "vulkur",
              "body": "What you are describing is a monopoly",
              "score": 28,
              "created_utc": 1747086140.0,
              "replies": [
                {
                  "id": "ms093fu",
                  "author": "French__Canadian",
                  "body": "It's not a monopoly if the competition just sucks.",
                  "score": 10,
                  "created_utc": 1747095112.0,
                  "replies": [
                    {
                      "id": "ms0pqr5",
                      "author": "alidan",
                      "body": "amd has been ahead of nvidia at points in the past, people never bought them. \n\namd will dominate nvidia in the future most likely if nvidia doesn't spin off gforce into a subsidiary with patent sharing, and people will still buy nvidia.\n\namd and intel can do nothing good in the eyes of gamers.\n\nnvidia fucked me over one time in the passed and unless they are the only option (msi held my amd gpu hostage for 3 months and it wasn't until I suggested I would take an nvidia from the current generation, at the time 1000, did they give me gpu back) and that was my last nvidia gpu, I have not considered nvidia an option given their batshit prices since.",
                      "score": 15,
                      "created_utc": 1747100963.0,
                      "replies": [
                        {
                          "id": "ms21xnq",
                          "author": "lemonade_eyescream",
                          "body": "If you're not a gamer here you probably don't even know there are non-nvidia options. The stock simply isn't there, or it's sitting on the shelves of boutique retailers.\n\nAt least we enthusiasts know AMD and Intel offering exist; good luck actually trying to buy them though, depending on where you live.",
                          "score": 6,
                          "created_utc": 1747123519.0,
                          "replies": [
                            {
                              "id": "ms23h6m",
                              "author": "alidan",
                              "body": "I have never been in a store that sells computers or computer parts and not seen amd, they sponsor games and get ads in them, and at the very least if you barely pay attention you know they have the best cpus currently.\n\nbut way it's meant to be played... god damn was that good marketing. \n\nas for intel, yea, uphill battle there, apparently they are extreme value for the money, like if the game properly works with the gpu they are a full tier higher performance for price wise than even amd when they aren't being stupid with pricing. \n\nAmd are likely making some big moves soon to kill off the mid range to lower high end gpu market entirely with future processors, if they put out a console like apu for pc, there goes that market entirely and I think they are moving toward that.",
                              "score": 2,
                              "created_utc": 1747124497.0,
                              "replies": [
                                {
                                  "id": "ms2rv89",
                                  "author": "TehOwn",
                                  "body": ">but way it's meant to be played... god damn was that good marketing. \n\nThe biggest part of this is simply the amount of time and money that NVIDIA spends working with game developer partners helping them to improve performance.\n\nThe only game I can think of that got that treatment from AMD is Civilization. And that's rarely GPU limited.",
                                  "score": 1,
                                  "created_utc": 1747137531.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms1oidm",
                          "author": "sold_snek",
                          "body": "Socially, the high end makes a company's brand. AMD has given up trying to win at that, at least with GPUs. It's why people have been saying \"haha Nvidia's going to regret this when everyone stops buying their overpriced shit!\" for the last decade. Yet Nvidia is bigger now than it's ever been.",
                          "score": 0,
                          "created_utc": 1747115610.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ms0nnsw",
                      "author": "csGrey-",
                      "body": "the competition doesnt suck but its not better either so its just straight up marketing",
                      "score": 4,
                      "created_utc": 1747100236.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mrzx6g5",
                  "author": "SerEx0",
                  "body": "Selling to market at the price that demand suggests? That’s capitalism, not a monopoly. You can choose to buy an Intel or AMD GPU, but gamers typically want the best, which NVIDIA makes. Hyperscalers also want the best for their AI data centers which means individuals have to compete with Google, Amazon, Microsoft, etc. who have a lot more money.",
                  "score": -7,
                  "created_utc": 1747091163.0,
                  "replies": [
                    {
                      "id": "ms00l66",
                      "author": "vulkur",
                      "body": "Technically you are correct, but I would still consider Nvidia a monopoly. They control over 80% of the market, maybe more? I don't think there is a solution unless AMD (or Intel) can get their shit together.",
                      "score": 15,
                      "created_utc": 1747092318.0,
                      "replies": [
                        {
                          "id": "ms063uu",
                          "author": "max8126",
                          "body": "Correct this is a technological monopoly",
                          "score": 18,
                          "created_utc": 1747094099.0,
                          "replies": []
                        },
                        {
                          "id": "ms0igdn",
                          "author": "inminm02",
                          "body": "Unfortunately AMD have decided to stop competing at the very high end of gaming hardware, I think it’s a damn shame but NVIDIA will have a complete monopoly on the best gaming hardware",
                          "score": 3,
                          "created_utc": 1747098405.0,
                          "replies": []
                        },
                        {
                          "id": "ms07612",
                          "author": "slut",
                          "body": "If they make that much better of a product than their competitor that doesn't make them a monopoly. They essentially invented the market and they're the only one moving the needle on all the software improvements happening. You can still buy graphics cards from other manufacturers they just aren't producing anything worth buying. That's more on Intel and AMD than it is NVIDIA.",
                          "score": -7,
                          "created_utc": 1747094450.0,
                          "replies": [
                            {
                              "id": "ms0gauc",
                              "author": "lordraiden007",
                              "body": "They can still be considered a monopoly, even given those circumstances. Also, they are engaging in anti-competitive (i.e. monopolistic) behavior on several fronts by artificially restricting hardware and forcing others to use software that exclusively works with their hardware in order to stifle competition. \n\nYou can very much be a monopoly if your competition is worse, especially if you are directly responsible for keeping people away from their products through unscrupulous means.",
                              "score": 5,
                              "created_utc": 1747097626.0,
                              "replies": [
                                {
                                  "id": "ms0he8q",
                                  "author": "slut",
                                  "body": "Under what existing case law? TSMC supply constraint isn't an artificial restriction, it makes perfect sense to prioritize the same chips to more profitable product lines and for that matter is good business. What software are they forcing others to use and where?\n\nEven the only DOJ inquiry I'm aware of isn't even looking at the consumer segment at all.",
                                  "score": 0,
                                  "created_utc": 1747098019.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ms0qfcw",
                              "author": "alidan",
                              "body": "amd made a cpu that shit on intel, intel decided to give a subsidy so high to dell and hp that even if they took amd gpus for free (amd offered that) they would lose money, intel fought the lawsuit over this for I believe 10~ years.\n\njust because you make something better (more than one company made better x86 cpus than intel, but intel sued them all on shakey grounds but they had the money and the others didn't, effectively halting them into irrelevancy)",
                              "score": -4,
                              "created_utc": 1747101196.0,
                              "replies": [
                                {
                                  "id": "ms0u12v",
                                  "author": "slut",
                                  "body": "Ok but in this hypothetical example the best product is coming out on top, there is no subsidy. People are just mad they aren't directing more chip production to much lower margin product lines, which is dumb.",
                                  "score": 3,
                                  "created_utc": 1747102410.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms0pwrn",
                      "author": "alidan",
                      "body": "amd was the best at multiple points in time, and the best value most generations when it comes to the top selling gpu bracket, and they STILL dont sell more than nvidia.",
                      "score": 2,
                      "created_utc": 1747101020.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms442h3",
              "author": "i81u812",
              "body": "I really do wish they would stop with the 8 GB card nonsense.",
              "score": 1,
              "created_utc": 1747153029.0,
              "replies": []
            },
            {
              "id": "mrzh8lz",
              "author": "SsooooOriginal",
              "body": "Gaming went really mainstream thanks to minecraft, fortnite, and roblox. \n\n\nMario was a global phenomenon eclipsed by pokemon which was eclipsed by minecraft.\n\n\n\nThe number of people making or buying PCs for gaming is probably higher than ever and will keep growing until the economy bottoms out.\n\n\nProblem is, most of them barely know how to research.",
              "score": -41,
              "created_utc": 1747085850.0,
              "replies": [
                {
                  "id": "mrzoxob",
                  "author": "--Arete",
                  "body": "> Gaming went mainstream thanks to Minecraft, fortnie, and Roblox\n\nAre you 10? I am pretty sure gaming was mainstream long before this.",
                  "score": 33,
                  "created_utc": 1747088337.0,
                  "replies": [
                    {
                      "id": "mrzqi6k",
                      "author": "SsooooOriginal",
                      "body": "Nah, are you 50?\n\n\nGoing by sales numbers, no, it really wasn't mainstream before minecraft. ",
                      "score": -48,
                      "created_utc": 1747088867.0,
                      "replies": [
                        {
                          "id": "mrzqv1s",
                          "author": "NO_SPACE_B4_COMMA",
                          "body": "lmao",
                          "score": 21,
                          "created_utc": 1747088989.0,
                          "replies": [
                            {
                              "id": "ms0qurz",
                              "author": "alidan",
                              "body": "no... he does have a point, at what point did people stop seeing you as a looser for playing video games, I know it was still that way before minecraft came out and I stopped caring at all a long time ago so I don't know if the stigma is still there.",
                              "score": -7,
                              "created_utc": 1747101346.0,
                              "replies": [
                                {
                                  "id": "ms168w4",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 4,
                                  "created_utc": 1747107045.0,
                                  "replies": [
                                    {
                                      "id": "ms1x3n7",
                                      "author": "alidan",
                                      "body": "for me that was the ass end of highschool, I managed to get the console in a class and just played doa4 on it against people without looking at the screen.\n\nthere are people who would play games, there are ones that would get into a conversation if it came up, but make no mistake everyone else thought you were a looser for openly talking about games. \n\nI think what people are getting stuck on is mainstream, because even I only know 1 of friend who didn't have at least 1 console. but for them it was something that got played rarely or every now and then, for me consoles were my free time till anime/computers took it over. \n\ncod may have hit the 13+ demo and stuck, but minecraft was a new generations first game.",
                                      "score": 1,
                                      "created_utc": 1747120542.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "ms1n38s",
                                      "author": "SsooooOriginal",
                                      "body": "How many girls would listen to you talk about COD?",
                                      "score": -3,
                                      "created_utc": 1747114854.0,
                                      "replies": [
                                        {
                                          "id": "ms1pz4m",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 4,
                                          "created_utc": 1747116412.0,
                                          "replies": [
                                            {
                                              "id": "ms1ui3v",
                                              "author": "SsooooOriginal",
                                              "body": "LMAO, only badfaith one is you claiming \"always\" when that is clearly no longer true. \n\n\nOh, and trying to use pacman as some example when it was topped out at 30 mil players, a tenth of minecraft. And in context, with way fewer competing games.\n\n\nGaming didn't really get mainstream until the 2010s. ",
                                              "score": -2,
                                              "created_utc": 1747119009.0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ms1wmuw",
                                          "author": "cgaWolf",
                                          "body": "I met my wife playing Counterstrike at a LAN :p",
                                          "score": 2,
                                          "created_utc": 1747120260.0,
                                          "replies": [
                                            {
                                              "id": "ms23krd",
                                              "author": "SsooooOriginal",
                                              "body": "How many girls?",
                                              "score": 1,
                                              "created_utc": 1747124559.0,
                                              "replies": [
                                                {
                                                  "id": "ms24om6",
                                                  "author": "cgaWolf",
                                                  "body": "Dunno, i just saw the one :D",
                                                  "score": 2,
                                                  "created_utc": 1747125268.0,
                                                  "replies": [
                                                    {
                                                      "id": "ms4a7zh",
                                                      "author": "SsooooOriginal",
                                                      "body": "That's my point, but cool flex dude.",
                                                      "score": 1,
                                                      "created_utc": 1747154832.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ms1mz0u",
                                  "author": "SsooooOriginal",
                                  "body": "My reasoning is this,\n\n\nMinecraft is *the* best selling game. By a huge margin.\n\n\nFortnite was the first game where I met women that were proud of playing if not addicted, outside of Mariokart.\n\n\nRoblox has the youth of today in a thrall.\n\n\nGaming before these three was still niche. No matter how many dudes can hum the Halo theme, or are Madden/FIFA addicts, or COD ragers. That wasn't mainstream, it was just popular for dudes.\n\n\nOfc gamedudebros don't want to recognize that girls getting into gaming was when things finally shifted. Now we have them talking about skyrim lore, raging in FPS or LoL, carrying Switch cases, building PCs. \n\n\nIt just wasn't much of a thing, even with the \"community\" of gamers being full of hate still, it used to be way worse and was way less accepted by society.",
                                  "score": -3,
                                  "created_utc": 1747114791.0,
                                  "replies": [
                                    {
                                      "id": "ms1wbwf",
                                      "author": "alidan",
                                      "body": "I had to look up when minecraft came out, and its about 3 years after I was out of highschool, and a good chance there are adults in this thread who never grew up being called a fucking looser because you still play videogames passed 13, god knows every did but you were never allowed to talk about it. \n\nyou had a few acceptable ones, cod, halo, sports, and MAYBE need for speed (I was still in school when nfs was at its peak) I had several girls who were friends who came over to play games, you know what never got brought up in school, they would ever associate with me for one of them, and the other it was never a videogame topic. \n\nminecraft sold 350 million coppies\n\ngta5 sold 210 million\n\nyou know what here\n\nhttps://en.wikipedia.org/wiki/List_of_best-selling_video_games\n\nyou have pokemon red blue yellow, which ill be honest, I know several kids who had 2 of those games, usually a red/blue and a yellow.\n\nthe oregon trail, I dont know if this is the entire seriese, or how it sold that many, but 65 million coppies. \n\nsuper mario bros which was a nintendo console pack in game\n\nbejewled (this is a game that appeled to women as well as men espeically at the time)\n\nwii fit\n\nworld of warcraft (in total over its lifespan whcih is 21 years now)\n\nsonic the hedge hog, likely every sonic the hedgehog game ever (genesis, game gear, and the multipule ports) made as it says multi platform \n\nmario kart wii\n\ngame boy tetris (it was a pack in game for a while along with a mario game) \n\nnew super mario bros\n\npokemon gold siver crystal\n\nduckhunt which was another pack in nes game for a while with mario and duck hunt\n\nwii play\n\nthose are the only games made before minecraft that crack the big boy numbers. \n\nonly 2 games cracked 100 million and they did it by a fucking lot, but nearly every one of these games is post minecraft. \n\nmost of these are pack in games, I really don't think people understand how massive it is to get people to play games early on and stay gamers, openly playing games.",
                                      "score": 3,
                                      "created_utc": 1747120076.0,
                                      "replies": [
                                        {
                                          "id": "ms228x3",
                                          "author": "SsooooOriginal",
                                          "body": "Minecraft really was a paradigm shift. Spanned generations and has core fans that went from playing it in elementary to adulthood.\n\n\nI never even tried it, just marveled at how much bigger it was than I wanted to admit when I first heard about it 10 years ago.\n\n\nIt's 14 years old now.\n\n\nI remember when talking about games was enough to be mocked or shunned in school. It has definitely changed after the younger crowds came up immersed and got a few games of their \"own\" rather than the \"old\" games like halo, cod, or pokemon.\n\n\nTho, shit, pokemon is strong as ever.",
                                          "score": 1,
                                          "created_utc": 1747123712.0,
                                          "replies": [
                                            {
                                              "id": "ms23wv7",
                                              "author": "alidan",
                                              "body": "not really given the numbers, the first 2 gens were cultural touchstones but they just don't sell nearly as well as that... still massively sold, but no close to what they were. \n\nand mine craft is digital legos, if you want to build something its a fantastic game for creativity, but with how little is in that game I always thought something new would take its place. but no, it kind of seems like minecraft is as complex as gamers will allow building to get in games, anything more complicated is a 3d program. in that regard, I think the best is currently shapelab but that's another thing entirely. \n\nI mean god damn, I am going to build a new desk in a bit, and im going to mock it up in minecraft because its going to be easier to scale 1 block to 1/16 an inch than it would be to get my plans put in a cad program.",
                                              "score": 3,
                                              "created_utc": 1747124773.0,
                                              "replies": [
                                                {
                                                  "id": "ms4a2n6",
                                                  "author": "SsooooOriginal",
                                                  "body": "The kids are into the cards, which I have mixed feelings on because adults have poisoned that well by making them small investment commodities.",
                                                  "score": 1,
                                                  "created_utc": 1747154789.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ms2dop3",
                                      "author": "Borghal",
                                      "body": "If we're going by personal experienced, I know a bunch of women who were far more into WoW back when it came out than many dudes I know.\n\nAnd more than a half of my girl schoolmates in high school played quite a bit of The Sims 1 or 2 at some point. I know this since we had a class board online where we traded tips 😀 \n\nAnd everyone on facebook and their grandma played Farmville at one point.\n\nSo much for anecdotal evidence \n\nGaming stopped being stigmatized in the early 00s and became mainstream shortly after, if you ask me. Minecraft followed shortly after, but it \"only\" gave a (big) push to a cart that was already rolling downhill at speed.",
                                      "score": 2,
                                      "created_utc": 1747130779.0,
                                      "replies": [
                                        {
                                          "id": "ms49mrw",
                                          "author": "SsooooOriginal",
                                          "body": "So you agree that minecraft, 2011, was at the turning point.\n\n\nWild how much disrespect yall are throwing at the best selling game. \"Only\" sold over 300 million.\n\n\nMy litmus is when did it become socially acceptable, outside of insular dudebros, to claim to be a \"gamer\"?\n\n\nIt wasn't the 2000s, it was the tens.\n\n\nIt was a culmination of a lot of things, but those three games are the generational juggernauts. Might as well include gtaV, wii sports that while being a pack in was unquestionably popular and responsible for many broken tvs, and skyrim. \n\n\nEdit: mixed up responses.",
                                          "score": 0,
                                          "created_utc": 1747154662.0,
                                          "replies": [
                                            {
                                              "id": "ms4cpnf",
                                              "author": "Borghal",
                                              "body": ">So you agree that minecraft, 2011, was at the turning point.\n\nI said Minecraft gave a push to an already rolling cart, how does one interpret that as a turning point?\n\nAnd I'm sure this will vary by country, city, and social circle, but being a gamer was already normal in the 00s in my experience.\n\nComing back to the anecdotes: Consoles were nonexistent, but everyone had a PC at home and every single of my high school classmates at the time played something, whether it was NFS, Sims, WoW, CoD, NHL or CS 1.6 - we even had a CS school tournament in 2006 or so, hah. \n\nIMO if you want to point at a turning point, a good sign is movie adaptations of games. There were a handful in the 90s, but from 2005 onwards there were multiple movies per year coming out, which signifies heightened public interest in video games to the point even movie investors saw a lot of potential profit (that the movies were mostly flops is neither here nor there :-D the point is publicity/investment). There is no single event you could point to, though. Just times slowly changing.",
                                              "score": 2,
                                              "created_utc": 1747155538.0,
                                              "replies": [
                                                {
                                                  "id": "ms4ez1o",
                                                  "author": "None",
                                                  "body": "[removed]",
                                                  "score": 1,
                                                  "created_utc": 1747156186.0,
                                                  "replies": [
                                                    {
                                                      "id": "ms4hfnd",
                                                      "author": "Borghal",
                                                      "body": "I agree that anecdotal evidence isn't the best. I'm using it since IIRC you were the one who asked something like \"how many woman gamers \\*\\*do you know\\*\\*\" somewhere else in this discussion, so you clearly value anecdotal evidence.\n\nAnd I did say that those movies being bad is beside the point, because the point was that people actually setting out to make them means the climate has shifted quite a bit.\n\nP.S. Tetris is the actual best \"selling\" video game of all time, if you want to argue that being first means somethig groundbreaking. But it's not really a great argument - the highest grossing film ever (Avatar) didn't really change the movie media landscape at all.\n\nThough - the highest grossing film of all time - adjusted for inflation - did change the movie landscape quite a bit. It was 1939's Gone with the Wind. In that sense, I'd say Minecraft is to Tetris what Avatar is to Gone With The Wind.",
                                                      "score": 2,
                                                      "created_utc": 1747156908.0,
                                                      "replies": [
                                                        {
                                                          "id": "ms4s28k",
                                                          "author": "SsooooOriginal",
                                                          "body": "You knew girl gamers in your school. \n\n\nHow many adult women gamers did you know?\n\n\nWho were they core audience of those bad game movies? Dudebros? Hardly mainstream.\n\n\nAnd how many tetris players were comfortable identifting as \"gamers\"? How many of them were women? Was the medium taken seriously by the mainstream or was it a novelty that started the revolution?\n\n\nAvatar spawned the much too soon 3D tv push. But again, when was being a \"movie goer\" ever stigmatised like being a \"gamer\"? Yall are the ones making unequivocal comparisons.",
                                                          "score": 1,
                                                          "created_utc": 1747159931.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ms1wj74",
                          "author": "cgaWolf",
                          "body": "Gaming has beaten Hollywood in revenue for decades*, even long before mobile gaming which is a juggernaut, and that's even ignoring that arcades beat hollywood in the 80ies already.\n\nWe're now at the stage where gaming comfortably beats Global Hollywood** + north american sports combined.\n\nTo argue that gaming isn't mainstream, or hasn't been for a long time, is ludicrous.\n\n*) Ages ago i wrote an article where this came up during research, which (back then) was a surprise, so it stuck in my mind.\n\n**) arguably the movie industry isn't just hollywood, but in terms of revenue H is where it's at.",
                          "score": 2,
                          "created_utc": 1747120199.0,
                          "replies": [
                            {
                              "id": "ms23h5u",
                              "author": "SsooooOriginal",
                              "body": "Hollywood ain't a good comparison for revenue? Lol\n\n\nAnd nobody ever got shunned for talking about going to the movies.\n\n\nHow old are you?\n\n\nVery weird how states-centric your talk is with austrian posts. Where is your experience coming from?\n\n\nIn the states, gaming has been a seen as mostly for kids until recently. And was mostly for boys until recent inclusion pushes that still make chuds mald. Fortnite and Apex still succeeded.\n\n\nBringing up arcade cabinets as if the culture isn't distinct from owning your own system and choosing/buying your own games, might as well start talking pinball or chess or any \"games\".\n\n\nWhich of those come with the \"gamer\" label? ",
                              "score": 1,
                              "created_utc": 1747124497.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ms170mb",
                          "author": "somesketchykid",
                          "body": "Minecraft is so huge from sales perspective BECAUSE of gamers nearing 50 realizing that it is a game that can be played by a 5 year old, is valuable from educational, hand eye, problem solving perspectives, and is better than letting YouTube or TikTok algorithm babysit them.\n\nUnfortunate reality of financial situation of most in US is that tablet is probably gonna do some babysitting from time to time, especially when both parents work.",
                          "score": 0,
                          "created_utc": 1747107361.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mrziauq",
                  "author": "compound-interest",
                  "body": "There are a lot more heavy hitters than just those three. If you delete those three games from history I still think you have the exact same problem, personally.",
                  "score": 11,
                  "created_utc": 1747086183.0,
                  "replies": [
                    {
                      "id": "mrzj9qx",
                      "author": "brett1081",
                      "body": "AI will drive chip production for the next decade or so.",
                      "score": 0,
                      "created_utc": 1747086488.0,
                      "replies": []
                    },
                    {
                      "id": "mrzq7jq",
                      "author": "SsooooOriginal",
                      "body": "Those three are what brought the alpha and z gens into gaming, by and large.\n\n\nThe current problems, are ofc, more complex than *just* more gamers than ever. It is still a part of it and to discount minecraft as if it hasn't made an unprecedented impact is laughable. The biggest cause of where we are at is, imo, the perfect storm of the 1080 being way more card than nvidia even knew *and* the crypto boom. That gave them reason and cause to gouge and bleed the growing gamer demographic.",
                      "score": -9,
                      "created_utc": 1747088767.0,
                      "replies": [
                        {
                          "id": "mrzws9q",
                          "author": "Any-Double857",
                          "body": "And every other group? Bro you have a very limited understanding of gaming history and what made it mainstream. Alpha an Z aren’t THE reason it’s mainstream. No more than the games you mentioned are the reason.",
                          "score": 7,
                          "created_utc": 1747091024.0,
                          "replies": [
                            {
                              "id": "mrzxxdz",
                              "author": "SsooooOriginal",
                              "body": "What about every other group? In terms of numbers, millenials are the only group rivaling them.\n\n\nYou gonna expound on that history? Tell me, go on.",
                              "score": -2,
                              "created_utc": 1747091427.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mrzpplf",
                  "author": "Kruxf",
                  "body": "Bro what? Go suck on your bottle.",
                  "score": 7,
                  "created_utc": 1747088597.0,
                  "replies": []
                },
                {
                  "id": "ms0l9h9",
                  "author": "Globalboy70",
                  "body": "All the titles you mentioned could run on a potato. None of them need high-end gaming PCs.",
                  "score": 1,
                  "created_utc": 1747099396.0,
                  "replies": [
                    {
                      "id": "ms0lk6n",
                      "author": "SsooooOriginal",
                      "body": "What's your point exactly? Potato hardware got most gamers into it, no?",
                      "score": 1,
                      "created_utc": 1747099501.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ms0cip8",
                  "author": "duckliin",
                  "body": "pshh ok kid",
                  "score": 0,
                  "created_utc": 1747096293.0,
                  "replies": [
                    {
                      "id": "ms0e3e7",
                      "author": "SsooooOriginal",
                      "body": "Truth really rustled some jimmies.",
                      "score": 1,
                      "created_utc": 1747096849.0,
                      "replies": [
                        {
                          "id": "ms0h04q",
                          "author": "duckliin",
                          "body": "only truth is that you know nothing.",
                          "score": 2,
                          "created_utc": 1747097878.0,
                          "replies": []
                        },
                        {
                          "id": "ms0gzdj",
                          "author": "duckliin",
                          "body": "only truth is that you know nothing.",
                          "score": 1,
                          "created_utc": 1747097870.0,
                          "replies": [
                            {
                              "id": "ms0isyu",
                              "author": "SsooooOriginal",
                              "body": "Haven't seen a single counterpoint that has any weight. Just seeing rustled jimmies from people upset they are old too but refuse to recognize reality.",
                              "score": 1,
                              "created_utc": 1747098528.0,
                              "replies": [
                                {
                                  "id": "ms0jqli",
                                  "author": "duckliin",
                                  "body": "we dont all have time to waste on people we dont know. i find all your comments comical. keep doing what you're doing.",
                                  "score": 1,
                                  "created_utc": 1747098859.0,
                                  "replies": [
                                    {
                                      "id": "ms0k298",
                                      "author": "SsooooOriginal",
                                      "body": "Lol, sure.\n\n\nBye bb.",
                                      "score": 1,
                                      "created_utc": 1747098974.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ms188ks",
                                  "author": "somesketchykid",
                                  "body": "OK, by most estimates, Pac Man arcade cabinet made more revenue by 1990 than Minecraft has made in its lifetime. There's yer counterpoint kid.\n\nGaming has always been popular and mainstream. Maybe not niche home gaming titles, but it's always been incredibly mainstream.\n\nYou can't really compare revenue from Roblox and Fortnite because both of these games use borderline predatory, high pressure microtransactions that are designed to keep kids begging their parents for a credit card swipe over and over.\n\nCan only really compare microtransaction games revenue with other mtx games",
                                  "score": 1,
                                  "created_utc": 1747107880.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrzrona",
          "author": "zachem62",
          "body": "Imagine it's the start of COVID and you have a monopoly on toilet paper. That's the situation they're in. This doesn't increase their losses. It's the perfect excuse they needed to crank up the price-gouging.",
          "score": 6,
          "created_utc": 1747089270.0,
          "replies": []
        },
        {
          "id": "ms0kkx7",
          "author": "ironroad18",
          "body": "Because Westerners are willing to camp out, beg, borrow, and steal to get a 5070 and above card.",
          "score": 11,
          "created_utc": 1747099155.0,
          "replies": []
        },
        {
          "id": "ms0izym",
          "author": "MrMxylptlyk",
          "body": "Nah, people will buy lol.",
          "score": 3,
          "created_utc": 1747098596.0,
          "replies": []
        },
        {
          "id": "mrzxkmt",
          "author": "Noshamina",
          "body": "What losses they are the most successful company in the last 10 years",
          "score": 4,
          "created_utc": 1747091301.0,
          "replies": []
        },
        {
          "id": "mrzexfl",
          "author": "BeautyInUgly",
          "body": "It’s because of tariffs, but they can’t say that or the administration will clamp down on them\n\nSo they have to make up some bullshit reason",
          "score": 9,
          "created_utc": 1747085127.0,
          "replies": []
        },
        {
          "id": "mrzmndk",
          "author": "xGHOSTRAGEx",
          "body": "Typical publicly traded company behaviour",
          "score": 3,
          "created_utc": 1747087578.0,
          "replies": []
        },
        {
          "id": "ms0789a",
          "author": "intelligentx5",
          "body": "They’re the only real game in town. They can charge whatever the fuck they want for now until someone catches up",
          "score": 2,
          "created_utc": 1747094471.0,
          "replies": []
        },
        {
          "id": "ms1jsmw",
          "author": "happyflowerzombie",
          "body": "You wish, maybe. They’ll be *fine* without your business or mine.",
          "score": 1,
          "created_utc": 1747113135.0,
          "replies": []
        },
        {
          "id": "mrzi64b",
          "author": "Cool-Tangelo6548",
          "body": "But but but, I thought China paid the taxes!?!?!?",
          "score": 0,
          "created_utc": 1747086142.0,
          "replies": [
            {
              "id": "ms220vv",
              "author": "lemonade_eyescream",
              "body": "*Red Sun In The Sky starts playing*",
              "score": 0,
              "created_utc": 1747123575.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms1jjpf",
          "author": "tlst9999",
          "body": "They're lying. Their sales in East Asia & Southeast Asia have increased severalfold. We know where those exports are going.",
          "score": 1,
          "created_utc": 1747113009.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrzgu2f",
      "author": "-Wicked-",
      "body": "Guess I held out way too long and am just going to have to continue to pew pew away on my 2080ti until it dies.",
      "score": 79,
      "created_utc": 1747085723.0,
      "replies": [
        {
          "id": "ms1jzi3",
          "author": "bokewalka",
          "body": "I have the same card and with lossless scaling it will hold up with current games die at least another gen.",
          "score": 6,
          "created_utc": 1747113231.0,
          "replies": []
        },
        {
          "id": "mrzy8vv",
          "author": "99asians",
          "body": "Better than my 590",
          "score": 5,
          "created_utc": 1747091539.0,
          "replies": []
        },
        {
          "id": "msfnuwx",
          "author": "LaconicLacedaemonian",
          "body": "I was similar but I pulled the trigger on a 5090 last week. I thought 2500 was expensive, with the $500 markup from Gigabyte. Turns out to be a deal!\n\n\nMy reasoning was that the 5000 series did nothing to drop 4000 series prices and it will be 2 years until the 6000 series. So i expected stable or rising prices. I might as well buy a card that will last me until 2030+",
          "score": 1,
          "created_utc": 1747310491.0,
          "replies": []
        },
        {
          "id": "ms2haki",
          "author": "PentaJet",
          "body": "I have the 2070 but what's the alternative, I should've not bought it and got 3000 or 4000 card?\n\nI'm still playing all the games I want at 4k",
          "score": -2,
          "created_utc": 1747132745.0,
          "replies": [
            {
              "id": "ms2jt63",
              "author": "IAcewingI",
              "body": "Lucky. Im stuck in low settings for VR games and sim racing on my 3080. Also some newer games like Black Wukong tax the fuck out of my card. I really want a 5080 and a Bigscreen Beyond VR set",
              "score": 2,
              "created_utc": 1747133983.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrzljff",
      "author": "ScotchToo",
      "body": "Tissues and soy milk just went up 25% in our grocery store and neither is from China. \n\nThis is working out well.",
      "score": 69,
      "created_utc": 1747087213.0,
      "replies": [
        {
          "id": "ms0gou3",
          "author": "xorthematrix",
          "body": "But what about eggs?",
          "score": 11,
          "created_utc": 1747097765.0,
          "replies": [
            {
              "id": "ms1ptc4",
              "author": "BINGODINGODONG",
              "body": "Even though his own foreign minister was concerned that the strategy would spark a trade war, and could drive up the price of imported eggs by 600 percent, tariffs fit into his larger vision for “liberating” his people from the shackles of a globalized world order.",
              "score": 5,
              "created_utc": 1747116323.0,
              "replies": [
                {
                  "id": "ms2a30c",
                  "author": "xorthematrix",
                  "body": "Interesting. You believe he has a \"vision\"?",
                  "score": 2,
                  "created_utc": 1747128660.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mrzpyak",
      "author": "KlatuuBaradaFickto",
      "body": "I love my 4090, hopefully by the next time I need to re-up, either NVIDIA will have their shit together or a competitor will have taken the lead.\n\n\nRegardless, not forking over that much cash over MSRP ever again.",
      "score": 73,
      "created_utc": 1747088678.0,
      "replies": [
        {
          "id": "ms08rcp",
          "author": "aspinalll71286",
          "body": "I'm still rocking a 1070 I bought almost 10 years ago. I can wait, I went from a 950 to a 1070. I technically also have a 2070 thats in my laptop but thats not my daily driver",
          "score": 13,
          "created_utc": 1747095000.0,
          "replies": [
            {
              "id": "ms0csmf",
              "author": "KlatuuBaradaFickto",
              "body": "My upgrade path that I can recall (and paid for) is Voodoo2 > ATI All-in Wonder 9800 Pro > GTX 580TI > GTX 1080TI > RTX 4090.\n\n\nI purchased the 4090 just last year, hoping the get about 5-7 years out if it.\n\n\nOf these, I have only lost the Voodoo2 .. freak lightning storm.\n\n\nIt's a strange thing to have such a nostalgic feeling about computer hardware.",
              "score": 5,
              "created_utc": 1747096390.0,
              "replies": [
                {
                  "id": "ms1jl31",
                  "author": "NePa5",
                  "body": "> GTX 580TI\n\nmmmm",
                  "score": 2,
                  "created_utc": 1747113028.0,
                  "replies": [
                    {
                      "id": "ms1m99q",
                      "author": "KlatuuBaradaFickto",
                      "body": "You know what, I think it was the 560TI now that you say that lol\n\n\nIt is in my detached garage and.. I'm not going out there right now.\n\nEdit: Found it on Newegg lol",
                      "score": 3,
                      "created_utc": 1747114412.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms01085",
          "author": "GreatStuffOnly",
          "body": "Same but since when does that happen? 4090 is the most expensive card at the time, 5090 is the most expansive card to date, I’m sure 6090 will be the same.\n\nThere are no competitions.",
          "score": 20,
          "created_utc": 1747092442.0,
          "replies": [
            {
              "id": "ms02t3p",
              "author": "Clugaman",
              "body": "People are wishing for a miracle too because other companies (AMD, Intel) are going to do the same thing because the tariffs affect every company and they all source materials from China. \n\nWe’re just getting started baby",
              "score": 5,
              "created_utc": 1747093024.0,
              "replies": []
            },
            {
              "id": "ms05neb",
              "author": "KlatuuBaradaFickto",
              "body": ">Same but since when does that happen?\n\n\nMaybe I'm dating myself a little here, two examples - 3dfx and ATI.\n\n\nCompetition will result from events and innovations that we now lack the imagination to envision ... that and price gouging lol",
              "score": 4,
              "created_utc": 1747093949.0,
              "replies": [
                {
                  "id": "ms0p5j9",
                  "author": "Shaunvfx",
                  "body": "Didn’t Nvidia acquire 3dfx and AMD acquire ATI? Same as it ever was.",
                  "score": 3,
                  "created_utc": 1747100756.0,
                  "replies": [
                    {
                      "id": "ms18ajp",
                      "author": "KlatuuBaradaFickto",
                      "body": ">Didn’t Nvidia acquire 3dfx and AMD acquire ATI?\n\n\nPRECISELY.\n\n\nThat is the point of mentioning them.\n\n\n>Same as it ever was.\n\n\nExcept it isn't lol\n\n\nDo you think AMD and NVIDIA are eternal?\n\n\nMaybe you once thought Intel is, like some people thought 3dfx and ATI were.\n\n\nThey're just companies, and one or few bad releases away from the same fate.",
                      "score": 5,
                      "created_utc": 1747107903.0,
                      "replies": [
                        {
                          "id": "ms1pch6",
                          "author": "sold_snek",
                          "body": "> Maybe you once thought Intel is\n\nI don't know enough to dispute any inaccuracies that may exist, but yeah it looks like Intel is been down year over year for several years in a row now. Almost looks like they never recovered from Covid.\n\nhttps://www.macrotrends.net/stocks/charts/INTC/intel/gross-profit",
                          "score": 1,
                          "created_utc": 1747116061.0,
                          "replies": [
                            {
                              "id": "ms31cy7",
                              "author": "KlatuuBaradaFickto",
                              "body": "Their \"top of the line\" 13th and 14th gen CPUs were garbage, it's a whole thing.\n\nEssentially the chips are inefficient, both with energy consumption and heat generation, unstable, stagnant performance gains, same socket used over three generations. Initially blamed users and mobo manufacturers  .. granted some stock settings were a little bit extra, but should have been able to tolerate that based on specs.\n\n  \nPair that with AMD's performance gains, competitive price, and enhanced feature chipset by comparison, released DURING this whole fiasco. The contrast was as wide as the grand canyon.\n\n  \nIntel can only afford one such stumble this decade (and maybe 15 year period) in my opinion, they have already spun off several subsidiaries.",
                              "score": 2,
                              "created_utc": 1747141139.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms0k52e",
                  "author": "Noselessmonk",
                  "body": "3dfx and ATI were competitive back when all companies were similar in terms of capability, but now Nvidia has the massive lead and the lead brings the money for R&D and marketing to stay in the lead and prevent the competition from gaining.\n\n  \nAMD's GPU division doesn't seem as magic as their CPU division; I'm not expecting a Radeon Ryzen-esque revolution from them.",
                  "score": 6,
                  "created_utc": 1747099002.0,
                  "replies": [
                    {
                      "id": "ms18jgm",
                      "author": "KlatuuBaradaFickto",
                      "body": "> ...has the massive lead and the lead brings the money for R&D and marketing to stay in the lead...\n\n\nTell that to Intel!",
                      "score": 2,
                      "created_utc": 1747108009.0,
                      "replies": []
                    },
                    {
                      "id": "ms15anb",
                      "author": "None",
                      "body": "[removed]",
                      "score": 2,
                      "created_utc": 1747106651.0,
                      "replies": [
                        {
                          "id": "ms19dao",
                          "author": "KlatuuBaradaFickto",
                          "body": "But they certainly *could*.\n\n\nEven before the trade war, did you see where they took a massive hit when China released Deepseek?\n\n\nThey're leaning heavily on the world-view that their GPUs are a prerequisite to develop advanced LLMs.\n\n\nAny real challenge to that belief (ala Deepseek et al) and they've got problems.",
                          "score": 1,
                          "created_utc": 1747108367.0,
                          "replies": [
                            {
                              "id": "ms1db68",
                              "author": "Consistent-Youth-407",
                              "body": "If AI busts that would just put NVIDIA in a even better position regarding GPUs. They’d have so much 50 series for cheap that AMD market share would drop to effectively 0.",
                              "score": 0,
                              "created_utc": 1747110088.0,
                              "replies": [
                                {
                                  "id": "ms1efvv",
                                  "author": "KlatuuBaradaFickto",
                                  "body": "It's not that AI is going to bust, it's that the preconceived notions on how to create/train/operate it (upon which NVIDIA relies) will.\n\n\nRegardless, before AI there was crypto.\n\n\nThere will likely always be a market force drawing GPUs away home users.",
                                  "score": 3,
                                  "created_utc": 1747110587.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms1xv1r",
                      "author": "cgaWolf",
                      "body": "Not in the highend space, no.\n\nBut in the midfield & integrated spaces, they're well positioned. A lot of that revenue hinges on what the next console generation goes with.",
                      "score": 1,
                      "created_utc": 1747121011.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mshhst4",
          "author": "NervyDeath",
          "body": "Could have upgraded from 4090 and made a profit",
          "score": 1,
          "created_utc": 1747331100.0,
          "replies": []
        },
        {
          "id": "msrizj9",
          "author": "packy21",
          "body": "Take this as someone coming from AMD to NVIDIA: NVIDIA's superiority is highly exaggerated. Obviously the card upgrade I made was good but my big rrason for switching brands was \"their drivers are better.\" No they are fucking not. For every issue I had with AMD that disappeared when I switched, I had another issue pop up with NVIDIA. I can't even reliably upgrade my drivers through their software. So far it has broken every time and I've had to do it manually. That's the level we are at.",
          "score": 1,
          "created_utc": 1747470839.0,
          "replies": [
            {
              "id": "mstnfgg",
              "author": "KlatuuBaradaFickto",
              "body": "I want to preface what I'm about to say by stating I'm not an NVIDIA fanboy, it's just that I've rarely had issues thus far with the brand.\n\n\nIf a better brand comes along, I will switch to that better brand.\n\n\nIf the 7900 XTX was essentially better in all categories than the 4090, I would be talking about the 7900 XTX.\n\n\nThat said, worst problem I had was on my 1080TI, and that was a software issue on Starfield launch.\n\n\nMy 4090 is working fine with a dualboot Windows 11/Arch Linux install. It appears to do equally well in both. I got WhisperX to transcribe a 1.5 hour audio interview, with the large model, with diarization, in like three minutes ... that is nuts!\n\n\nI genuinely don't remember any major issues .. maybe it's just that I don't mind the fiddly bits and don't recall when they occur?",
              "score": 1,
              "created_utc": 1747502763.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms0efvj",
      "author": "oxycontin_raised",
      "body": "Look, I love my 3080ti, I hope it last long, but I’ve decided my next gpu will be AMD.",
      "score": 9,
      "created_utc": 1747096972.0,
      "replies": []
    },
    {
      "id": "mrzvpsx",
      "author": "8bitjer",
      "body": "Didn’t they just announce a pause in tariffs? I’m sure these price hikes will go away right?…. RIGHT?!",
      "score": 27,
      "created_utc": 1747090650.0,
      "replies": [
        {
          "id": "ms0f3le",
          "author": "GeminiKoil",
          "body": "90 day pause and the ratchet effect isn't going to cause the prices to go down anyways.",
          "score": 20,
          "created_utc": 1747097204.0,
          "replies": [
            {
              "id": "ms1jmn7",
              "author": "tlst9999",
              "body": "90 day pause and then another price hike.",
              "score": 3,
              "created_utc": 1747113050.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms1pjdd",
          "author": "In-All-Unseriousness",
          "body": "Absolutely, just like how they lowered the prices after Covi... oh nevermind.",
          "score": 6,
          "created_utc": 1747116166.0,
          "replies": []
        },
        {
          "id": "ms07bd2",
          "author": "-Amplify",
          "body": "They only drop prices if people stop buying and people don’t stop buying",
          "score": 5,
          "created_utc": 1747094501.0,
          "replies": []
        },
        {
          "id": "ms07npy",
          "author": "JoostinOnline",
          "body": "At the risk of sounding like I'm defending these hikes (I'm not), it doesn't really work like that. We still had a month (or a year maybe? Idk, April alone felt like a decade) of imports being taxed at insane rates. There were definitely losses, and they'll want to recoup that somehow.\n\nObviously the prices won't go down even after that though, since people are willing to pay them. That's just capitalism, and it sucks.",
          "score": 7,
          "created_utc": 1747094620.0,
          "replies": []
        },
        {
          "id": "ms05ccl",
          "author": "grtk_brandon",
          "body": "> Didn’t they just announce a pause in tariffs?\n\nI'm impressed that we're this far in and you still have this much faith.",
          "score": 4,
          "created_utc": 1747093852.0,
          "replies": [
            {
              "id": "ms05n8h",
              "author": "8bitjer",
              "body": "Heavy dose of sarcasm in my reply lol.",
              "score": 3,
              "created_utc": 1747093948.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms0bdgk",
      "author": "--IIII--------IIII--",
      "body": "I'mma stick with my 2070 Super. Does everything I need. I'll upgrade to something used when I have to. This is the only way they will learn.",
      "score": 5,
      "created_utc": 1747095896.0,
      "replies": [
        {
          "id": "ms0khq4",
          "author": "Dakkadence",
          "body": "2070 Super gang! Still on 1080p 144hz and it easily maxes out on most of the games that I play. I was considering upgrading for Monster Hunter Wilds, but considering that even a 9070xt won't hit my monitor refresh rate, I decided it wasn't worth it.",
          "score": 2,
          "created_utc": 1747099124.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms12f4c",
      "author": "jlaine",
      "body": "That's cool. My 1080ti continues to hum along. Not getting a dime from me at these prices.",
      "score": 6,
      "created_utc": 1747105502.0,
      "replies": []
    },
    {
      "id": "ms0bgme",
      "author": "amiibohunter2015",
      "body": "Greedflation\n\nThe term Greedflation first appeared during the COVID-19 pandemic to describe the idea that some inflation is driven by increases in corporate profits. Suggested mechanisms include price gouging, price fixing, windfall gains resulting from information asymmetry, monopoly-like power, and external shocks to the economy.",
      "score": 19,
      "created_utc": 1747095926.0,
      "replies": [
        {
          "id": "ms1e0it",
          "author": "Consistent-Youth-407",
          "body": "You forgot one, AI, the thing you used to write this",
          "score": 8,
          "created_utc": 1747110397.0,
          "replies": []
        },
        {
          "id": "ms138ly",
          "author": "DifferentEvent2998",
          "body": "Nah, this is trumpflation.",
          "score": 5,
          "created_utc": 1747105820.0,
          "replies": [
            {
              "id": "ms13em9",
              "author": "amiibohunter2015",
              "body": "That's a part of it. He contributed to greedflation and they contributed to him.",
              "score": 6,
              "created_utc": 1747105887.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrzgbki",
      "author": "JP_32",
      "body": "Im glad that I bought my 4070super year ago, 5-series was joke and now this",
      "score": 14,
      "created_utc": 1747085562.0,
      "replies": [
        {
          "id": "ms1domk",
          "author": "Consistent-Youth-407",
          "body": "4070s and 4090 seem like potential OGs of the 40 series generation. Overpriced at launch, yes, but compared to their used pricing now it’s literally a steal.",
          "score": 0,
          "created_utc": 1747110251.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms03nkw",
      "author": "pizza5001",
      "body": "Welp, guess I’ll never be able to afford an NVIDIA card ever again?",
      "score": 3,
      "created_utc": 1747093303.0,
      "replies": []
    },
    {
      "id": "ms0r3at",
      "author": "No-Bother6856",
      "body": "Friendly reminder that Intel and AMD gaming cards exist.",
      "score": 3,
      "created_utc": 1747101430.0,
      "replies": []
    },
    {
      "id": "ms3cnd0",
      "author": "2Autistic4DaJoke",
      "body": "Ah. Still playing the “how much will they pay before we stop selling” strategy I see.",
      "score": 3,
      "created_utc": 1747144917.0,
      "replies": []
    },
    {
      "id": "ms5471o",
      "author": "RobertdBanks",
      "body": "#TOO MUCH WINNING",
      "score": 3,
      "created_utc": 1747163424.0,
      "replies": []
    },
    {
      "id": "mrzhemb",
      "author": "Tangentkoala",
      "body": "![gif](giphy|BZlNhp9L5WINi)",
      "score": 7,
      "created_utc": 1747085903.0,
      "replies": [
        {
          "id": "mrzkue2",
          "author": "BringBackBoshi",
          "body": "Dr. Nvidia: Here's the plan. We unveil the new flagship GPU, and we hold the customer at ransom for... one million dollars!\n\nNvidia employee #2: Don't you think we should ask for more than a million dollars?  A million dollars isn't that much money these days.\n\nDr. Nvidia: All right then...five million dollars!",
          "score": 5,
          "created_utc": 1747086989.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrzhpm5",
      "author": "stedun",
      "body": "What brands compete against NVIDIA?",
      "score": 8,
      "created_utc": 1747085999.0,
      "replies": [
        {
          "id": "mrzilge",
          "author": "shootamcg",
          "body": "AMD and Intel",
          "score": 19,
          "created_utc": 1747086275.0,
          "replies": [
            {
              "id": "mrznufo",
              "author": "obelix_dogmatix",
              "body": "They hardly compete. Intel hasn’t posted profits in over a year. AMD GPUs have been riding the coattails of Nvidia forever now.",
              "score": -51,
              "created_utc": 1747087974.0,
              "replies": [
                {
                  "id": "mrzx4yz",
                  "author": "shootamcg",
                  "body": "Intel as a whole or Intel GPUs? AMD competes just fine and sells a lot of GPUs including all the ones in every Xbox and PlayStation since 2014.",
                  "score": 15,
                  "created_utc": 1747091149.0,
                  "replies": [
                    {
                      "id": "ms025le",
                      "author": "obelix_dogmatix",
                      "body": "GPUs … noone is in the ballpark. You are thinking of gaming. Most of the business today is enterprise level computing. Nvidia is far ahead.",
                      "score": -15,
                      "created_utc": 1747092809.0,
                      "replies": [
                        {
                          "id": "ms04nfd",
                          "author": "shootamcg",
                          "body": "Yeah, but the post is primarily consumer GPU price increases.",
                          "score": 11,
                          "created_utc": 1747093630.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms02bnt",
                  "author": "PantherPL",
                  "body": "Why do you care about their profits? Why should a consumer *ever* care about a company's profits. Just put the GPU in the bag lil bro.",
                  "score": 9,
                  "created_utc": 1747092864.0,
                  "replies": [
                    {
                      "id": "ms1dwwa",
                      "author": "Consistent-Youth-407",
                      "body": "Cause since every company is shareholder value oriented the shareholders can literally say hey uhh we really need you to stop selling GPUs now we don’t like it if enough people did. Most companies would generally take action before it ever got to that point though.",
                      "score": -2,
                      "created_utc": 1747110353.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mrzu3ha",
                  "author": "StarGaurdianBard",
                  "body": "AMD GPUs have caught up a long time ago, especially their midrange GPUs and upper higher range. I think the only GPU that Nvidia is clearly above AMD is at the very top of the line, and even then you are talking about a 5% performance impact at best for a $1000 difference.",
                  "score": 0,
                  "created_utc": 1747090094.0,
                  "replies": [
                    {
                      "id": "mrzzne6",
                      "author": "Shoelebubba",
                      "body": "There is a generational level of performance between AMD’s last flagship (when they were trying to compete at the top end), the 7900XTX or its newest 9700XT.    \n    \nAnd that’s being generous.   \n    \nIt’s not 5% for $1,000.    \nThe Nvidia 5090 has a good 50%-66%+ lead on the AMD 7900XTX on raw rasterized performance, that lead can jump into the almost comical 200%+ range when you toggle Ray Tracing on.   \nThis is without any flavor of DLSS or FSR turned on.    \n    \nSame again against the AMD 9070XT, except it has a cheaper MSRP on launch than the older 7900XTX.    \n    \nYou’re right about AMD catching up to the midrange (except the mid range has fucking gotten to $500) but to say there’s only 5% performance difference with $1000 difference?    \n    \nThat is straight up completely and utterly wrong.",
                      "score": 5,
                      "created_utc": 1747092018.0,
                      "replies": []
                    },
                    {
                      "id": "mrzvjf6",
                      "author": "laseluuu",
                      "body": "Do they have cuda yet?",
                      "score": 0,
                      "created_utc": 1747090590.0,
                      "replies": [
                        {
                          "id": "ms00crm",
                          "author": "TrumpetSC2",
                          "body": "I am a GPU programmer and last I heard HIPIFY (which converts cuda code to run on AMD GPUs) worked pretty well, but I haven't tried it in recent years.",
                          "score": 5,
                          "created_utc": 1747092245.0,
                          "replies": [
                            {
                              "id": "ms03oa7",
                              "author": "laseluuu",
                              "body": "Funny I'm getting downvoted for asking a question, maybe it came off as hostile.",
                              "score": 0,
                              "created_utc": 1747093309.0,
                              "replies": [
                                {
                                  "id": "ms09pir",
                                  "author": "svanegmond",
                                  "body": "Since it’s an NVIDIA name for one of their technologies it’s kind of an unreasonable question.",
                                  "score": 8,
                                  "created_utc": 1747095318.0,
                                  "replies": []
                                },
                                {
                                  "id": "ms0stco",
                                  "author": "NotAHost",
                                  "body": "It’s like asking if android has iCloud yet.",
                                  "score": 1,
                                  "created_utc": 1747102001.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ms21p19",
                  "author": "ChrisFhey",
                  "body": "You're being downvoted, but you're absolutely right. I'd love to see Intel and AMD bring some actual competition to Nvidia, but as it stands Nvidia is effectively a monopoly in the high-end segment. There's literally nothing that can compete with their 5090 and even their 5080 when considering ray tracing.",
                  "score": 0,
                  "created_utc": 1747123372.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms1yx23",
          "author": "YouLostTheGame",
          "body": "At the top end, nobody, which is the problem",
          "score": 2,
          "created_utc": 1747121663.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms0qg3a",
      "author": "Sproketz",
      "body": "The Trump taxes are too damn high.",
      "score": 8,
      "created_utc": 1747101204.0,
      "replies": []
    },
    {
      "id": "ms06ybb",
      "author": "d_e_l_u_x_e",
      "body": "Corporation raises prices to get more profit, more at 11.",
      "score": 4,
      "created_utc": 1747094378.0,
      "replies": []
    },
    {
      "id": "ms0b4ze",
      "author": "Cubanitto",
      "body": "Nvidia fan boys will be pleased",
      "score": 3,
      "created_utc": 1747095816.0,
      "replies": []
    },
    {
      "id": "ms1brn5",
      "author": "wumr125",
      "body": "And somehow AMD will still find a way to not increase its market share",
      "score": 2,
      "created_utc": 1747109409.0,
      "replies": []
    },
    {
      "id": "ms1ftn9",
      "author": "PSU09",
      "body": "It’s about time ya weirdos crawl out of your caves and start touching grass. Don’t crawl back into that cave until prices come down to a reasonable level",
      "score": 2,
      "created_utc": 1747111217.0,
      "replies": []
    },
    {
      "id": "ms2e604",
      "author": "spoollyger",
      "body": "Was anyone even buying them when they are at the ‘lower’ price?",
      "score": 2,
      "created_utc": 1747131053.0,
      "replies": []
    },
    {
      "id": "ms5svyo",
      "author": "mrbenjamin48",
      "body": "Glad I built my new pc in January lol",
      "score": 2,
      "created_utc": 1747170604.0,
      "replies": []
    },
    {
      "id": "ms67fiu",
      "author": "bushmaster2000",
      "body": "I bought a 4080S the month they were disco'd at MSRP so i could sit on the side and watch  this shitshow eating my popcorn.",
      "score": 2,
      "created_utc": 1747175267.0,
      "replies": []
    },
    {
      "id": "ms6akut",
      "author": "TheDkone",
      "body": "for all but 30 years I was intel cpu only.  they proceeded to shit the bed the last couple of years.  bought my first AMD a couple of months ago and couldn't be happier.  Just saying... Nvidia will be the next to go.  I am sure i am not alone.",
      "score": 2,
      "created_utc": 1747176336.0,
      "replies": []
    },
    {
      "id": "ms6ecew",
      "author": "FartyFingers",
      "body": "My prediction when the chip embargo was put on china was that they would start developing their own tech very quickly.\n\nMy new prediction is that by 2027 we will see the US attempting to block chinese GPUs from flooding the market. \n\nI will predict these will be pretty good. Not blowing nVidia's out of the water in raw performance, but will have a few features which are killer for some. \n\nFor example, I will predict their lower end models will have piles of RAM for reasonable prices. Like 128GB for the same price as an nvidia with 12GB. Also, the number of compute cores might be bonkers. For the same price as an nvidia with 4000 cores my guess is you will get a chinese one with 10,000.\n\nThen the pedants will argue the ram isn't as fast, the cores as capable, etc. These will be somewhat true; but the reality is that for AI researchers, most want bags of ram.",
      "score": 2,
      "created_utc": 1747177640.0,
      "replies": []
    },
    {
      "id": "mrzytg3",
      "author": "StickAForkInMee",
      "body": "Thanks trump",
      "score": 6,
      "created_utc": 1747091740.0,
      "replies": []
    },
    {
      "id": "ms0ncia",
      "author": "nclh77",
      "body": "China has the world, US companies have the US and even the EU is bailing. Capatalism at work.",
      "score": 3,
      "created_utc": 1747100126.0,
      "replies": []
    },
    {
      "id": "mrznci0",
      "author": "ptraugot",
      "body": "What!?! Passing tariffs to customers???? No way. /s",
      "score": 5,
      "created_utc": 1747087808.0,
      "replies": []
    },
    {
      "id": "mrzp7jy",
      "author": "Kruxf",
      "body": "It needs to say, “To counter losses caused by president Trump”. Be mad at the right people yall.\n\nOr downvote and show you really have no clue.",
      "score": 6,
      "created_utc": 1747088428.0,
      "replies": [
        {
          "id": "mrzvczc",
          "author": "Eskareon",
          "body": "\"I know next to nothing about a P&L but I can still farm Karma\"",
          "score": -17,
          "created_utc": 1747090529.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms0bmcp",
      "author": "Majorjim_ksp",
      "body": "More reason to buy AMD… I think Nvidia doesn’t want to make gaming GPUs anymore..",
      "score": 2,
      "created_utc": 1747095982.0,
      "replies": []
    },
    {
      "id": "ms2vm4k",
      "author": "rushmc1",
      "body": "Don't buy Nvidia.  Problem solved.",
      "score": 2,
      "created_utc": 1747139022.0,
      "replies": []
    },
    {
      "id": "ms0pcyk",
      "author": "Died_Of_Dysentery1",
      "body": "Thank Pumpkin Spice Palpatine!",
      "score": 1,
      "created_utc": 1747100828.0,
      "replies": []
    },
    {
      "id": "ms16gr4",
      "author": "LookAlderaanPlaces",
      "body": "Class action lawsuit Trump supporters, they directly caused this with their vote for a fascist. This isn’t anyone else’s problem, people who voted against this shouldn’t have to foot the bill.",
      "score": 3,
      "created_utc": 1747107134.0,
      "replies": [
        {
          "id": "ms1k18i",
          "author": "Notgonnalir",
          "body": "Yes, this is the answer. Sue the majority of the American population,",
          "score": 3,
          "created_utc": 1747113256.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrzky6m",
      "author": "FaveDave85",
      "body": "Will amd follow suit?",
      "score": 1,
      "created_utc": 1747087022.0,
      "replies": []
    },
    {
      "id": "mrztih0",
      "author": "xnolmtsx",
      "body": "And here we come",
      "score": 1,
      "created_utc": 1747089895.0,
      "replies": []
    },
    {
      "id": "mrzygxv",
      "author": "smellycoat",
      "body": "Fuck’s sake Nvidia, I need to replace my 2080!",
      "score": 1,
      "created_utc": 1747091619.0,
      "replies": [
        {
          "id": "ms4eed1",
          "author": "dervu",
          "body": "Best time is ... now.",
          "score": 2,
          "created_utc": 1747156021.0,
          "replies": []
        },
        {
          "id": "mrzz2pg",
          "author": "StickAForkInMee",
          "body": "My 2070 super is still going strong but I’d like to upgrade asap",
          "score": 1,
          "created_utc": 1747091830.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms0av23",
      "author": "air_lock",
      "body": "Cool. So now not only will I not be able to get one due to lack of inventory, I’ll also not even be able to afford one even if there does happen to eventually be adequate inventory because of price hikes. Super.",
      "score": 1,
      "created_utc": 1747095721.0,
      "replies": []
    },
    {
      "id": "ms0cuds",
      "author": "EnvironmentalClue218",
      "body": "Wait, we need an executive order mandating an 80% reduction in prices. Now!",
      "score": 1,
      "created_utc": 1747096408.0,
      "replies": []
    },
    {
      "id": "ms0r03a",
      "author": "VirtuaFighter6",
      "body": "$749 for a 5070ti, they said. Lasted about a week.",
      "score": 1,
      "created_utc": 1747101398.0,
      "replies": []
    },
    {
      "id": "ms0we3e",
      "author": "baldycoot",
      "body": "Sorry for your loss. AMD thanks you for their gain.",
      "score": 1,
      "created_utc": 1747103226.0,
      "replies": []
    },
    {
      "id": "ms0yjoc",
      "author": "WeirdSysAdmin",
      "body": "They are trying to find the perfect number for where demand falls off but still sells out all the cards they make. \n\nAMD is content making mid market cards so there’s zero competition in that pricing segment.",
      "score": 1,
      "created_utc": 1747104018.0,
      "replies": []
    },
    {
      "id": "ms0ypus",
      "author": "EverLiving_night",
      "body": "They must REALLY need that money.",
      "score": 1,
      "created_utc": 1747104081.0,
      "replies": []
    },
    {
      "id": "ms0zfwf",
      "author": "TheJasonaut",
      "body": "I know they aren't the only company doing this, but I think they've done enough, this included, recently to make me want to avoid their cards if I can next time I upgrade. \n\nI just don't feel good about supporting a company that are so brazenly and solely focused on profit and cruising on past success.",
      "score": 1,
      "created_utc": 1747104351.0,
      "replies": []
    },
    {
      "id": "ms1b7ib",
      "author": "jert3",
      "body": "I'll prob be running my 2070 Super for at least another 2/3 years.",
      "score": 1,
      "created_utc": 1747109162.0,
      "replies": [
        {
          "id": "ms27bko",
          "author": "zombiegauze",
          "body": "Me too. I seem to have no real issues with the games I like.",
          "score": 1,
          "created_utc": 1747126927.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms1pd3d",
      "author": "StubbornPotato",
      "body": "Whelp, guess I will keep not buying a new GPU...",
      "score": 1,
      "created_utc": 1747116070.0,
      "replies": []
    },
    {
      "id": "ms1ql4g",
      "author": "jordzkie05",
      "body": "last i've seen a 5090 on amazon it's over 4k. lmao",
      "score": 1,
      "created_utc": 1747116758.0,
      "replies": []
    },
    {
      "id": "ms1xp2d",
      "author": "Gelbton",
      "body": "You know these prices will never return to normal. It will just stay like this until it is \"normal\"",
      "score": 1,
      "created_utc": 1747120909.0,
      "replies": []
    },
    {
      "id": "ms20jav",
      "author": "ajstont",
      "body": "Which is exactly why I won’t be buying one.",
      "score": 1,
      "created_utc": 1747122663.0,
      "replies": []
    },
    {
      "id": "ms2325e",
      "author": "thegamingdovahbat",
      "body": "Boy am I glad to have got the 4080S when I got it. Gonna hold on to it for as long as I can.",
      "score": 1,
      "created_utc": 1747124230.0,
      "replies": []
    },
    {
      "id": "ms27ieg",
      "author": "abody8",
      "body": "Ridiculous",
      "score": 1,
      "created_utc": 1747127049.0,
      "replies": []
    },
    {
      "id": "ms2c4yx",
      "author": "hindusoul",
      "body": "Ok.. moving along",
      "score": 1,
      "created_utc": 1747129887.0,
      "replies": []
    },
    {
      "id": "ms2ft11",
      "author": "HG21Reaper",
      "body": "Yeah, I rather not spend my money on that.",
      "score": 1,
      "created_utc": 1747131953.0,
      "replies": []
    },
    {
      "id": "ms2hdu6",
      "author": "nagatoyuki1897",
      "body": "I'm absolutely not buying Nvidia ever again, dog shit company",
      "score": 1,
      "created_utc": 1747132792.0,
      "replies": []
    },
    {
      "id": "ms2mnfp",
      "author": "Doppelkammertoaster",
      "body": "And because of greed like this gaming suffers. Heck productivity does. Good luck affording a good work rig.",
      "score": 1,
      "created_utc": 1747135294.0,
      "replies": []
    },
    {
      "id": "ms2nhw4",
      "author": "Alienhaslanded",
      "body": "And guess what, even if all of those tariffs got cancelled, those prices ain't going back down.",
      "score": 2,
      "created_utc": 1747135671.0,
      "replies": []
    },
    {
      "id": "ms2op99",
      "author": "_Kine",
      "body": "You couldn't even get a card for MSRP anyways.  Also, the comments on that article are wild and make no sense.",
      "score": 1,
      "created_utc": 1747136205.0,
      "replies": []
    },
    {
      "id": "ms2ta2e",
      "author": "ToeBeanTussle",
      "body": "Well then I won't buy it until something comes out with features that match the price, or I'll move to next gen AMD from my 3070.",
      "score": 1,
      "created_utc": 1747138103.0,
      "replies": []
    },
    {
      "id": "ms2tnmt",
      "author": "nicman24",
      "body": "my 9070xt was cheaper than half of the street price for a comparable card to nvidia",
      "score": 1,
      "created_utc": 1747138252.0,
      "replies": []
    },
    {
      "id": "ms3lql8",
      "author": "action_turtle",
      "body": "Companies keep moving to “whale hunting” strategies, but it’s not really sustainable, is it? At some point even they will tap out",
      "score": 1,
      "created_utc": 1747147680.0,
      "replies": []
    },
    {
      "id": "ms4q26j",
      "author": "IdontneedtoBonreddit",
      "body": "That'll teach the rest of the world that Merka is number one!  All those Chinese and stupid lib Europeans paying more for...   \n\"huh...who??\" \n\nHold on... someone is trying to explain something to me.. I better get off the computer so I can stick both thumbs in my ears!",
      "score": 1,
      "created_utc": 1747159354.0,
      "replies": []
    },
    {
      "id": "msbnqyx",
      "author": "luttman23",
      "body": "The Intel Arc B580 is looking tasty for the price though",
      "score": 1,
      "created_utc": 1747250770.0,
      "replies": []
    },
    {
      "id": "mss07oq",
      "author": "Dependent_Flatworm16",
      "body": "I didn't notice any GPU price raise in my country. Is it only US?",
      "score": 1,
      "created_utc": 1747481300.0,
      "replies": []
    },
    {
      "id": "msu4avm",
      "author": "sockydraws",
      "body": "Are the intel cards comparable yet?",
      "score": 1,
      "created_utc": 1747508273.0,
      "replies": []
    },
    {
      "id": "mrziyus",
      "author": "leon_262",
      "body": "So glad I got a fairly cheap 4080 super just before the release of the 50 series\n\nYikes",
      "score": 0,
      "created_utc": 1747086391.0,
      "replies": [
        {
          "id": "ms140r9",
          "author": "jmerr74",
          "body": "Yep. I did the same.",
          "score": -1,
          "created_utc": 1747106134.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrzi43x",
      "author": "East1st",
      "body": "Despite the grumpy faces, people will buy these anyway",
      "score": 1,
      "created_utc": 1747086125.0,
      "replies": [
        {
          "id": "ms1wqvj",
          "author": "Sweet_Concept2211",
          "body": "Nope. Just going to use cloud services when I need more compute.",
          "score": -2,
          "created_utc": 1747120326.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms14kyb",
      "author": "ResponsibleTruck4717",
      "body": "Give me native cuda support on Intel / Amd and I will buy them, the fact is that every piece of code is working on Nvidia.",
      "score": 1,
      "created_utc": 1747106360.0,
      "replies": []
    },
    {
      "id": "ms1f4a6",
      "author": "han_jobs5",
      "body": "lol",
      "score": 1,
      "created_utc": 1747110895.0,
      "replies": []
    },
    {
      "id": "ms1qbcr",
      "author": "ITGuy7337",
      "body": "I was just having the conversation with my GF about how it's basically not viable for us to build our own PCs anymore simply due to the cost of GPUs. It's cheaper to just buy a new pre-built PC that includes one. So, just buy a whole ass PC every X amount of years now instead of upgrading components? Seems like a shit system. Wtf happened?",
      "score": 1,
      "created_utc": 1747116604.0,
      "replies": []
    },
    {
      "id": "ms2hgft",
      "author": "Ok-Arm-3100",
      "body": "What losses? China is buying off GPUs from other countries across Asia through proxies and there are still shortages everywhere.",
      "score": 1,
      "created_utc": 1747132830.0,
      "replies": []
    },
    {
      "id": "mrztrgq",
      "author": "Dash_Rendar425",
      "body": "Paying Nvidia prices when there are competitors like AMD and Intel is insane.",
      "score": 1,
      "created_utc": 1747089980.0,
      "replies": [
        {
          "id": "mrzyzd7",
          "author": "StickAForkInMee",
          "body": "Intel offers products that are 4080 equivalent or 7900 XTX equivalent?",
          "score": 2,
          "created_utc": 1747091797.0,
          "replies": [
            {
              "id": "ms49ggl",
              "author": "Dash_Rendar425",
              "body": "I haven RX 7800 XT and it's more than sufficient.\n\nCost me $420 CAD.\n\nThe same thing in a 4080 would cost me AT LEAST $1K CAD. That's assuming I can find stock at all, and I'm likely seeing the card for $1200 CAD from secondary sources, or inflated MSRP.\n\nYou're telling me these prices are actually worth remortgaging your home for the same thing?\n\n[https://www.newegg.ca/p/pl?d=4080](https://www.newegg.ca/p/pl?d=4080)\n\nInsanity.",
              "score": 2,
              "created_utc": 1747154611.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrznhl9",
      "author": "RottenPingu1",
      "body": "I'm here for the cope. Their fanboys are just as bad as Elon Musks lost souls.",
      "score": -2,
      "created_utc": 1747087855.0,
      "replies": []
    },
    {
      "id": "ms2viq6",
      "author": "Leather-Map-8138",
      "body": "Remember, these cost increases were brought to you by your neighbors who voted for Donald.",
      "score": 0,
      "created_utc": 1747138986.0,
      "replies": [
        {
          "id": "ms4f7fp",
          "author": "stromm",
          "body": "Someone is out of reality.  Those prices were brought to us because of crypto mining  starting back in 2014. And they’ve just kept going up and up since.\n\nAlso, with the record LOW of tariffs between the US and China right now, any company jacking up prices are just pocketing what they blame on Trump.",
          "score": -1,
          "created_utc": 1747156253.0,
          "replies": [
            {
              "id": "ms54ha5",
              "author": "RobertdBanks",
              "body": "Record low? Lmao, yeah MARKETS *LOOOOOVE* INSTABILITY, right?\n\nBtw, over the past 7 years tariffs were 10-20%. How is 30% a record low?",
              "score": 2,
              "created_utc": 1747163507.0,
              "replies": [
                {
                  "id": "ms58crw",
                  "author": "stromm",
                  "body": "Obviously you haven’t paid attention to the news on tariffs over the past three days…",
                  "score": -1,
                  "created_utc": 1747164647.0,
                  "replies": [
                    {
                      "id": "ms6s16m",
                      "author": "RobertdBanks",
                      "body": "I have, which is exactly the numbers I quoted",
                      "score": 1,
                      "created_utc": 1747182359.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msbvm7f",
              "author": "Leather-Map-8138",
              "body": "Not remotely true. Inflation, caused by Trump bungling the pandemic, was brought under control by Biden.",
              "score": 0,
              "created_utc": 1747253085.0,
              "replies": [
                {
                  "id": "msc65fm",
                  "author": "stromm",
                  "body": "Hahahahahaha",
                  "score": 1,
                  "created_utc": 1747256292.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mrzl6sk",
      "author": "Psyb07",
      "body": "I'm so happy to have abandoned PC gaming, ps 5 pro and psvr2 fills all my needs this days.",
      "score": -10,
      "created_utc": 1747087099.0,
      "replies": [
        {
          "id": "mrzz50f",
          "author": "StickAForkInMee",
          "body": "Console pleb lmao",
          "score": -11,
          "created_utc": 1747091852.0,
          "replies": [
            {
              "id": "ms02sej",
              "author": "Psyb07",
              "body": "Hehehehe plebs unite! 😂",
              "score": 3,
              "created_utc": 1747093018.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrzw092",
      "author": "Alaskaguy",
      "body": "So glad I got my 5070ti a month ago before this occurred",
      "score": -1,
      "created_utc": 1747090751.0,
      "replies": [
        {
          "id": "ms0c02k",
          "author": "justhitmidlife",
          "body": "Same but a 5090!",
          "score": 0,
          "created_utc": 1747096114.0,
          "replies": []
        },
        {
          "id": "ms01lw4",
          "author": "kaleosaurusrex",
          "body": "Same",
          "score": -1,
          "created_utc": 1747092632.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms08q48",
      "author": "Ar6yl3",
      "body": "What whiney babies that company is worth so much already… 🙄",
      "score": 0,
      "created_utc": 1747094988.0,
      "replies": []
    },
    {
      "id": "ms09dq5",
      "author": "Optimus_Prime_Day",
      "body": "GREED!",
      "score": 0,
      "created_utc": 1747095207.0,
      "replies": []
    },
    {
      "id": "ms1922z",
      "author": "KK-Chocobo",
      "body": "I guess I'll just have to throw my 3440x1440 monitor out and go back to 1080p gaming.",
      "score": 0,
      "created_utc": 1747108233.0,
      "replies": []
    },
    {
      "id": "ms1an9q",
      "author": "creepilincolnbot",
      "body": "Figured their 99999999999 billion profit would be fine at 9999999999998 but i guess not",
      "score": 0,
      "created_utc": 1747108921.0,
      "replies": []
    },
    {
      "id": "ms2gn02",
      "author": "Recipe_Limp",
      "body": "Ok…and?",
      "score": 0,
      "created_utc": 1747132400.0,
      "replies": []
    },
    {
      "id": "ms08smn",
      "author": "Everheart1955",
      "body": "So… now\nThey’ll lower the price since the orange anus rescinded his idiotic tarrifs right?",
      "score": -3,
      "created_utc": 1747095012.0,
      "replies": [
        {
          "id": "ms1bt5z",
          "author": "safari_king",
          "body": "He didn't really rescind them - they've been lowered to 30%, which is still huge, and only for 90 days.",
          "score": 3,
          "created_utc": 1747109428.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms10htg",
      "author": "Jebusfreek666",
      "body": "Everyone giving me crap for \"overpaying\" for a 5080 a month ago can suck it lol.",
      "score": -2,
      "created_utc": 1747104756.0,
      "replies": []
    },
    {
      "id": "ms1ejdt",
      "author": "LaundryLunatic",
      "body": "More people who have good internet might embrace geforce now until they can afford the gpu they plan to invest in. Unless the prices for gfn go up too.",
      "score": -2,
      "created_utc": 1747110630.0,
      "replies": []
    },
    {
      "id": "ms0dyft",
      "author": "tyrannictoe",
      "body": "Feeling so lucky I got a 5090 for 3000 just last week 😊",
      "score": -5,
      "created_utc": 1747096800.0,
      "replies": []
    }
  ]
}