{
  "post": {
    "title": "The SSDs and RAM on this new Asus ROG Strix Scar 18 can be upgraded entirely without tools",
    "author": "a_Ninja_b0y",
    "id": "1hvs74u",
    "score": 1395,
    "created_utc": 1736258897.0,
    "selftext": "",
    "num_comments": 61,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hvs74u/the_ssds_and_ram_on_this_new_asus_rog_strix_scar/"
  },
  "comments": [
    {
      "id": "m5vfszq",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736258898.0,
      "replies": []
    },
    {
      "id": "m5vhb4e",
      "author": "None",
      "body": "I commend this. Usually these models have always been upgradable from the bottom with screws, but I don't see any more 2.5 inch bay. Having the lights around the top is an improvement. Previous version had the lights on the bottom, connected with thin ribbons cables that were easy to rip.",
      "score": 252,
      "created_utc": 1736259448.0,
      "replies": [
        {
          "id": "m5vurw1",
          "author": "DannyJJB",
          "body": "Those ribbon cables were a nightmare if you hadn't had to deal with them before or if you forget yourself when you are trying to pry the bottom open... One of the first times I opened it to upgrade my ram the cable got pulled tight and one of the corner led boards ripped clean off the bottom screw and all (the plastic casing was cracked where the screw was placed) Had to keep the board super glued down and the ribbon cable taped in place to keep from moving!\n\nStill got 5 years out of the machine tho before the battery and charging port started to go haywire",
          "score": 32,
          "created_utc": 1736263955.0,
          "replies": []
        },
        {
          "id": "m5wpxus",
          "author": "secretqwerty10",
          "body": ">Previous version had the lights on the bottom, connected with thin ribbons cables that were easy to rip.\n\nthat's on the 15 and 17 inch models. the 16 and 18 inch models, which these replace, also have the LED's on the keyboard without the ribbon cables.\n\nsource: i work at an ASUS ASP and see both pretty much daily",
          "score": 16,
          "created_utc": 1736273161.0,
          "replies": []
        },
        {
          "id": "m5yawpw",
          "author": "Starfox-sf",
          "body": "And that could’ve easily been avoided by an extra 1c worth of extra ribbon cable length.",
          "score": 5,
          "created_utc": 1736289704.0,
          "replies": []
        },
        {
          "id": "m5wjh6q",
          "author": "feint_of_heart",
          "body": "I always disconnect the leds anyhow.   \n   \nI've had to replace the power jack in the last two I've had.",
          "score": 9,
          "created_utc": 1736271294.0,
          "replies": [
            {
              "id": "m5wltlo",
              "author": "OkDragonfruit9026",
              "body": "Same. I disconnected them the first time I opened mine and left them this way. Never again.",
              "score": 7,
              "created_utc": 1736271976.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5vppcb",
      "author": "Azozel",
      "body": "When I worked as a computer tech in the 1990s you could replace the HDD and the ram without tools then too (you might need a small screw driver to open the ram compartment but I don't think that counts).\n\nMuch later, while working at a large computer company, I was surprised when a colleague asked if I could look at his daughter's laptop and there was no access to the ram or anything else.\n\nI guess we've come full circle now hmm?",
      "score": 64,
      "created_utc": 1736262337.0,
      "replies": [
        {
          "id": "m5wm774",
          "author": "zerosaved",
          "body": "I was about to say. This is absolutely full circle. I used to repair computers and laptops, and with the exception of Apple, *many* manufacturers used to have the spring/thumb latch designs that gave you access to more than just the memory modules, without needing any tools. Apple required the torx drivers + phillips and a ridiculous amount of convoluted disassembly to get to the internals, but at least you could still replace them.",
          "score": 29,
          "created_utc": 1736272085.0,
          "replies": [
            {
              "id": "m5xy4ms",
              "author": "SloppyCheeks",
              "body": "Apple repair has always been a nightmare, but their internals look *so good*",
              "score": 9,
              "created_utc": 1736285892.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m6219by",
          "author": "Mr_Nicotine",
          "body": "Because people hold onto their stuff for longer and they know that they’re doing marginal improvements year over year; can’t sell you a whole new laptop? Okay, here are some *official* parts! Enjoy!",
          "score": 1,
          "created_utc": 1736347978.0,
          "replies": []
        },
        {
          "id": "m66nyc8",
          "author": "None",
          "body": "In technology, most paradigms eventually come full circle after a while. The reality is many decisions hit a fork in the road with clear drawbacks in either direction. At some point, the route you select either becomes unwieldy or some breakthrough makes the other road more attractive so the paradigm reverses. Eventually those drawbacks become too much and another similar breakthrough now makes the original approach more attractive, repeat ad nauseam. This is just one more for the list.",
          "score": 1,
          "created_utc": 1736402943.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5vhkbw",
      "author": "Chronotaru",
      "body": "Looks beautiful. I've never seen a laptop with the back off that looks that nice. Of course part of that is because it has a *second* back.",
      "score": 73,
      "created_utc": 1736259541.0,
      "replies": [
        {
          "id": "m5vxe48",
          "author": "fire2day",
          "body": "Yeah, if you want to replace something like the wifi card, it looks like you're removing ~14 or so screws to get that inside plate off.",
          "score": 28,
          "created_utc": 1736264762.0,
          "replies": [
            {
              "id": "m5xlsga",
              "author": "DaoFerret",
              "body": "Which is what I had to remove on my last HP convertible to get to the battery and M.2 slot, so it seems like a step up.  \n\nWon’t count the complete disassembly to replace the power jack or the keyboard, since that’s probably just as bad (but that’s expected).",
              "score": 6,
              "created_utc": 1736282374.0,
              "replies": [
                {
                  "id": "m5xpwxb",
                  "author": "fire2day",
                  "body": "Oh yeah. HP is bad for that, and some Acers are even worse. The last one I had apart had like 18 screws, with 3 different types. Dell is one of the best, with there only being 8 or so in the bottom of my XPS.",
                  "score": 4,
                  "created_utc": 1736283536.0,
                  "replies": [
                    {
                      "id": "m5zsnzy",
                      "author": "Gauntlet4933",
                      "body": "Yeah my XPS 7590 has been pretty repairable, only exception now is the CMOS battery which requires full disassembly. Mostly everything else could be done with opening the panel and removing just the few necessary screws",
                      "score": 3,
                      "created_utc": 1736307856.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m61f5qt",
          "author": "TSrake",
          "body": "Have you seen MacBooks with the back off? The usually look pretty nice.",
          "score": 4,
          "created_utc": 1736339440.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m5vgny9",
      "author": "unematti",
      "body": "If you like that, check out the framework 16. Yeah you need tools, but they are coming with the laptop",
      "score": 35,
      "created_utc": 1736259215.0,
      "replies": [
        {
          "id": "m5w1mcp",
          "author": "X_SkillCraft20_X",
          "body": "Not to mention that literally EVERYTHING is upgradeable on that laptop, all the way down to the GPU/cpu main boards which you can replace/upgrade separately from eachother. Shit you can hot swap the whole damn keyboard if you want.",
          "score": 22,
          "created_utc": 1736266035.0,
          "replies": [
            {
              "id": "m5w5ycb",
              "author": "unematti",
              "body": "Wel there's only one gpu available yet... But can't wait for the update! Or you can get 2 ssds instead of a gpu, btw. 26TB total NVMe if you want.\n\nYou don't really swap the keyboard daily, but yeah it's easy",
              "score": 15,
              "created_utc": 1736267323.0,
              "replies": [
                {
                  "id": "m5wjjp1",
                  "author": "SchighSchagh",
                  "body": "FW also has 1TB expansion cards which work at close to NVMe speeds, just limited by USB-C to 1 GBps. So you could have up to 32 TB if you don't need any ports.",
                  "score": 10,
                  "created_utc": 1736271315.0,
                  "replies": [
                    {
                      "id": "m5xj9ee",
                      "author": "unematti",
                      "body": "Yup. For the like... 5h tops running time xD because you're not gonna charge it",
                      "score": 7,
                      "created_utc": 1736281646.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5vihua",
      "author": "General_Specific",
      "body": "That's awesome. My old MSI made me disassemble the laptop and flip the main board to add a SSD or RAM.",
      "score": 15,
      "created_utc": 1736259874.0,
      "replies": [
        {
          "id": "m5xuda9",
          "author": "mumbler1",
          "body": "Bruh same, but its my current laptop 😔",
          "score": 4,
          "created_utc": 1736284809.0,
          "replies": [
            {
              "id": "m5xzev2",
              "author": "General_Specific",
              "body": "My hinge broke and the whole thing stopped working.",
              "score": 4,
              "created_utc": 1736286264.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5x2r2e",
      "author": "AMetalWolfHowls",
      "body": "Tool-less parts changing was normal for most of computing’s history. It’s only a feature again because *checks notes* hardware is expensive",
      "score": 12,
      "created_utc": 1736276848.0,
      "replies": [
        {
          "id": "m5xfjme",
          "author": "ineververify",
          "body": "Well this is also a large laptop.  The reason modern laptops started sealing their components with screws and glue was because of their use is designed to be transportable.  \n\nThis is a big laptop that is designed to just sit on a desk.  So these design changes to make it easier to work on make sense.  It doesn’t make as much sense for a “air” style laptop which needs to be compact and hold together.",
          "score": 6,
          "created_utc": 1736280562.0,
          "replies": [
            {
              "id": "m5xo66m",
              "author": "AMetalWolfHowls",
              "body": "All of my MacBooks until the touchbar had tool-less ram. My Mac minis too. It was a big deal when Apple stopped making serviceable products. Real frustrating. \n\nI think the biggest consumer reason to go soldered in a laptop is vibration- ram is less likely to get knocked loose. I’ve had it happen several times over the years.\n\nI way prefer upgrading what I have to buying new so I hated the change. Of course, that’s the business reason- make people spend huge up front rather than waiting a year and upgrading as cheap memory floods the market.",
              "score": 4,
              "created_utc": 1736283046.0,
              "replies": []
            },
            {
              "id": "m5xrelx",
              "author": "therealdilbert",
              "body": "and what microscopic fraction of laptop users ever upgrade components?",
              "score": -5,
              "created_utc": 1736283965.0,
              "replies": [
                {
                  "id": "m5xrzs3",
                  "author": "ineververify",
                  "body": "The .05 % that consider themselves “power users” and use the most boring flavor of Linux to shit post on Reddit about how lame Apple is.",
                  "score": -8,
                  "created_utc": 1736284137.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m5x89j1",
      "author": "Emadec",
      "body": "That’s nice. Asus fix their cusstomer support yet?",
      "score": 10,
      "created_utc": 1736278457.0,
      "replies": []
    },
    {
      "id": "m5wbemt",
      "author": "GHOSTFUZZ99",
      "body": "WAOH HOLY SHIT WHO KNEW",
      "score": 6,
      "created_utc": 1736268930.0,
      "replies": []
    },
    {
      "id": "m5xivng",
      "author": "Plank_With_A_Nail_In",
      "body": "The back unclips...that's all it is reddit.",
      "score": 5,
      "created_utc": 1736281536.0,
      "replies": []
    },
    {
      "id": "m5xaxve",
      "author": "ShenmeNamaeSollich",
      "body": "What?!? What evil sorcerer’s magick is this!? Tis the serpent servant of Satan swaying you away from the Apple, whose internal workings are forbidden knowledge! Thou shalt not have any idea wtf a SoC is nor how it doth function! In the name of the solder, integrated RAM, and the holy tri-lobe screw. Amen.",
      "score": 4,
      "created_utc": 1736279226.0,
      "replies": []
    },
    {
      "id": "m5wim39",
      "author": "SchighSchagh",
      "body": "Love to see it.\n\nAlso in a very similar vein: Framework laptops come with a screwdriver. They _want_ to be opened up and tinkered with. Not toolless, but you don't need to buy/have any tools either.",
      "score": 6,
      "created_utc": 1736271041.0,
      "replies": []
    },
    {
      "id": "m5xkt9o",
      "author": "TheDevilsAdvokaat",
      "body": "I like this. I would like to see more manufacturers do this.",
      "score": 3,
      "created_utc": 1736282095.0,
      "replies": []
    },
    {
      "id": "m5ysjw8",
      "author": "Either_Opinion1145",
      "body": "Any computer can do that. Just download more RAM.",
      "score": 3,
      "created_utc": 1736295420.0,
      "replies": []
    },
    {
      "id": "m5yvk29",
      "author": "None",
      "body": "YES!!! More of this! I’m sick of these tech companies and their planned obsolescence.",
      "score": 3,
      "created_utc": 1736296397.0,
      "replies": []
    },
    {
      "id": "m5yxqbh",
      "author": "henryguy",
      "body": "Ah so now people can steal the shit in my laptop without taking the laptop or tools? Yay....",
      "score": 3,
      "created_utc": 1736297110.0,
      "replies": []
    },
    {
      "id": "m5x3ils",
      "author": "Primal_Thrak",
      "body": "This reminds me a lot of the 1008 Macbook I had. You could access the battery and HDD but not the ram, but it was a panel very much like this. I am really glad someone is bringing it back.",
      "score": 2,
      "created_utc": 1736277071.0,
      "replies": []
    },
    {
      "id": "m5zyu6w",
      "author": "Slipguard",
      "body": "Regulation works.",
      "score": 2,
      "created_utc": 1736310318.0,
      "replies": []
    },
    {
      "id": "m5wzh5a",
      "author": "llama_fresh",
      "body": "I still use a top of the line HP Elitebook from 2011 and it's a joy to work on.\n\nFull service manual online, everything accessible.\n\nIf you aren't wanting to play the latest games or doing processor intensive work, business laptops from a decade or so ago are perfectly adequate.",
      "score": 2,
      "created_utc": 1736275909.0,
      "replies": []
    },
    {
      "id": "m5z856m",
      "author": "NoSignificance4349",
      "body": "It is a shame that in 90s computers were more user friendly to fix and upgrade than nowadays. Compaq computers were so easy to work on.",
      "score": 1,
      "created_utc": 1736300580.0,
      "replies": []
    },
    {
      "id": "m5zcei9",
      "author": "MikeFencePence",
      "body": "My old sony vaio had this. Welcome back, 2008!!",
      "score": 1,
      "created_utc": 1736302043.0,
      "replies": []
    },
    {
      "id": "m5zoyr4",
      "author": "prateeksaraswat",
      "body": "I congratulate Framework on this trend.",
      "score": 1,
      "created_utc": 1736306467.0,
      "replies": []
    },
    {
      "id": "m6054qe",
      "author": "BIGBushido",
      "body": "Reminds me of the Asus G752. Missed having easy access to the ram and ssd when I upgraded to the strix series.",
      "score": 1,
      "created_utc": 1736313044.0,
      "replies": []
    },
    {
      "id": "m614fg2",
      "author": "InvertedEyechart11",
      "body": "Welcome back, 2000!",
      "score": 1,
      "created_utc": 1736333704.0,
      "replies": []
    },
    {
      "id": "m61qjhm",
      "author": "mdneilson",
      "body": "Too bad it's an Asus",
      "score": 1,
      "created_utc": 1736344167.0,
      "replies": []
    },
    {
      "id": "m63j7rw",
      "author": "BlackIceing",
      "body": "Now do the gpu. Oh wait. Lol, Framework 16 for life.",
      "score": 1,
      "created_utc": 1736364126.0,
      "replies": []
    },
    {
      "id": "m5x8nyw",
      "author": "TryingT0Wr1t3",
      "body": "Amazing! This may make me look at ASUS hardware again!",
      "score": 1,
      "created_utc": 1736278573.0,
      "replies": []
    },
    {
      "id": "m5w7lvm",
      "author": "GrayDaysGoAway",
      "body": "Damn shame it's such an ugly bastard of a laptop. I wouldn't be caught dead using something with that hideous Strix branding on the lid.",
      "score": -7,
      "created_utc": 1736267812.0,
      "replies": [
        {
          "id": "m5wjt9i",
          "author": "SchighSchagh",
          "body": "What a weird hill to die on.",
          "score": 2,
          "created_utc": 1736271391.0,
          "replies": [
            {
              "id": "m5wk7a8",
              "author": "GrayDaysGoAway",
              "body": "Lol it's not even remotely weird to care about the aesthetics of things you use.\n\nedit since /u/Plank_With_A_Nail_In is a coward who blocked me to keep me from responding to them.\n\nIt's really fucking pathetic that you feel the need to try to handwave my opinion like that. This has nothing to do with any influencer, I could not possibly care less what those leaches think of anything.",
              "score": 2,
              "created_utc": 1736271505.0,
              "replies": [
                {
                  "id": "m5xaf3f",
                  "author": "SchighSchagh",
                  "body": "Weird hill _to die on_ though.",
                  "score": 2,
                  "created_utc": 1736279076.0,
                  "replies": [
                    {
                      "id": "m5xjbpt",
                      "author": "Plank_With_A_Nail_In",
                      "body": "He will change his mind when his favorite influencer tells him what to think. Left to his own devices he just defaults to hating anything new.",
                      "score": 2,
                      "created_utc": 1736281665.0,
                      "replies": [
                        {
                          "id": "m5xqo1h",
                          "author": "TheChosenMuck",
                          "body": "what kinda asus simping is going on here , before you said influenzer i forgot all the drama with the asus waranty thanks for reminding.\n\nand hes right laptop lid is ugly just as the absolut dogshit gamer font they smeared on the keys",
                          "score": 3,
                          "created_utc": 1736283751.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m5yckwd",
              "author": "fairlyoblivious",
              "body": "Sometimes humans buy or use certain products at least partially based on design/aesthetics. It's only \"weird\" if you don't understand this. Where you're from does everyone wear the same outfit because it's the most functional? Are you all in engineer jumpsuits and wear Brooks Ghost shoes because they offer the best function over form?  \n  \n\n  \nWhat a weird thing to not understand about humans.",
              "score": 0,
              "created_utc": 1736290218.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m5wf9ne",
      "author": "WilkyBoy",
      "body": "Personally not a fan. Now the regular run-of-the-mill idiot can change out their SSD and then be stuck complaining their PC won't boot.",
      "score": -8,
      "created_utc": 1736270063.0,
      "replies": []
    }
  ]
}