{
  "post": {
    "title": "Nikon’s entry-level Z50II adds a dedicated button for color styles | The 20.9-megapixel Nikon Z50II also has a faster processor and improved video capabilities.",
    "author": "chrisdh79",
    "id": "1glst16",
    "score": 224,
    "created_utc": 1730992658.0,
    "selftext": "",
    "num_comments": 16,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1glst16/nikons_entrylevel_z50ii_adds_a_dedicated_button/"
  },
  "comments": [
    {
      "id": "lvwvh6u",
      "author": "Korrugate",
      "body": "This is a strange trend. Fujifilm has several camera with a dedicated dial for film simulations. I own two Fujifilm cameras, and the film sims are great but…. I definitely don’t change them often enough to have a physical control.",
      "score": 30,
      "created_utc": 1730994421.0,
      "replies": [
        {
          "id": "lvww57l",
          "author": "Legitimate-Wall3059",
          "body": "Also... Lightroom / DXO presets do the exact same thing.",
          "score": 8,
          "created_utc": 1730994617.0,
          "replies": [
            {
              "id": "lvwy6rq",
              "author": "dabocx",
              "body": "I think the idea that Fuji has pushed is that you don’t do any heavy editing with a computer. You setup your film simulation, you take your photo and you’re done. \n\nFuji isn’t aiming for people who want to spend hours staring at light room.\n\nAnd as someone who got burnt out doing professional photography and editing I am pretty happy with just my Fuji film now. It’s so much less work.",
              "score": 19,
              "created_utc": 1730995252.0,
              "replies": [
                {
                  "id": "lvwyjup",
                  "author": "Legitimate-Wall3059",
                  "body": "I get it but they could also have just bundled a small piece of software to batch process their raws into one of the presets. The button/wheel being there doesn't hurt me but I would much prefer a generic tactile wheel that I can use as a customizable function.",
                  "score": -5,
                  "created_utc": 1730995364.0,
                  "replies": [
                    {
                      "id": "lw09pzs",
                      "author": "QuickQuirk",
                      "body": "you've given the reason in your own text: They already *have* that software. Only a few owners of the camera actually use it. They're targeting the end user who wants a nice camera, but doesn't want to/doesn't know how to edit on the computer: Apply the simulation on the camera when taking the photo, and seamlessly upload it to your phone and preferred social in one go.",
                      "score": 4,
                      "created_utc": 1731030863.0,
                      "replies": []
                    },
                    {
                      "id": "lvwz4e2",
                      "author": "dabocx",
                      "body": "They do have that software actually. Only problem is you have to have the camera plugged in as it’s actually still processing on the camera. \n\nIt’s a little slow but it’s nice if you want to mess with a bunch of film simulations and apply them in batches",
                      "score": 1,
                      "created_utc": 1730995533.0,
                      "replies": [
                        {
                          "id": "lvyoi7j",
                          "author": "engineeringstoned",
                          "body": "Which is the worst idea in forever and a half.\nWhy not provide a small piece of desktop software, making it blazing fast?",
                          "score": -2,
                          "created_utc": 1731012848.0,
                          "replies": [
                            {
                              "id": "lvysukb",
                              "author": "imakesawdust",
                              "body": "Because then you wouldn't have to buy a Fuji camera.",
                              "score": 2,
                              "created_utc": 1731014080.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lw0h89c",
                      "author": "DiscountLlama",
                      "body": "Besides the other options people have mentioned, Lightroom has Fuji presets in it, so if you upload your RAWs you can apply whatever they were shot with automatically or just leave them alone to edit however. The processing is for JPGs out of the camera.",
                      "score": 1,
                      "created_utc": 1731033413.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lw204us",
          "author": "Less_Party",
          "body": "To be fair Fuji also has cameras with a dedicated shutter speed dial and then 2 assignable clickwheels where by default it makes one toggle between ISO and aperture control and then makes the other a redundant shutter speed dial for some reason. Sensible controls aren’t really their strong suit.",
          "score": 2,
          "created_utc": 1731060057.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvwscgy",
      "author": "TehFuckDoIKnow",
      "body": "I hate that",
      "score": 0,
      "created_utc": 1730993497.0,
      "replies": []
    },
    {
      "id": "lw1af2z",
      "author": "Even_Establishment95",
      "body": "Why does everyone want to be a photographer?",
      "score": -6,
      "created_utc": 1731044742.0,
      "replies": []
    },
    {
      "id": "lw1mzj7",
      "author": "RationalKate",
      "body": "But can it TEXT if no than, hard pass. We don't need it.",
      "score": -3,
      "created_utc": 1731051648.0,
      "replies": []
    }
  ]
}