{
  "post": {
    "title": "The Federal Trade Commission said yesterday it is sending over 1 million Dollars in refunds to 6,764 consumers who purchased Razer Zephyr masks that were deceptively marketed as providing N95 protection during the COVID-19 pandemic.",
    "author": "a_Ninja_b0y",
    "id": "1i1e8zn",
    "score": 1118,
    "created_utc": 1736882977.0,
    "selftext": "",
    "num_comments": 68,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i1e8zn/the_federal_trade_commission_said_yesterday_it_is/"
  },
  "comments": [
    {
      "id": "m75c5gd",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736882978.0,
      "replies": []
    },
    {
      "id": "m75ibp3",
      "author": "Gnarlodious",
      "body": "1,000,000 / 6764=$147.84. Better than the 27 cents I got from my last settlement.",
      "score": 303,
      "created_utc": 1736884766.0,
      "replies": [
        {
          "id": "m75pqow",
          "author": "Miss_Speller",
          "body": "From the article:\n\n>\"The FTC is sending checks and PayPal payments to 6,764 consumers who purchased the deceptively marketed products. Recipients will get a full refund,\" the agency said.\n\nSo yeah, a pretty good deal.  And just to be clear, since the headline isn't, the money is coming from a settlement with Razer:\n\n>The FTC sued Razer in April 2024, and the gaming-hardware company agreed to a settlement, including a $100,000 fine and $1,071,254.33 toward a fund for consumer relief.",
          "score": 124,
          "created_utc": 1736887023.0,
          "replies": []
        },
        {
          "id": "m764kvs",
          "author": "Beznia",
          "body": "Yeah seems like complete refunds. The masks were $100, and had bundles up to $150 which included 33 sets of filters.",
          "score": 56,
          "created_utc": 1736891798.0,
          "replies": [
            {
              "id": "m7c0f2j",
              "author": "randlemarcus",
              "body": "And the price of the masks is daft on eBay. Full refund and triple your money selling secondhand",
              "score": 13,
              "created_utc": 1736973309.0,
              "replies": [
                {
                  "id": "m7ebagg",
                  "author": "dark_gear",
                  "body": "Those are most likely just scalper accounts still trying to sell their initial purchase.\n\nI tried to purchase one of masks during the first 3 releases. They all sold out within seconds only to reappear on ebay for 3 times the price. Considering how well-known scalpers' tricks were at the height of the pandemic (looking at you GPU price gougers) it's really surprising Razer didn't come up with a means to establish some kind of buyer verification system.",
                  "score": 6,
                  "created_utc": 1737000302.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m75h3o2",
      "author": "1Steelghost1",
      "body": "Lol, I was so close to buying one then saw a video of them in use & realized they was no way they worked as advertised.",
      "score": 99,
      "created_utc": 1736884418.0,
      "replies": [
        {
          "id": "m7823n5",
          "author": "ethereal_intellect",
          "body": "I feel it was the same idea that made Elon do the cybertruck, \"why doesn't the future look like the future\"",
          "score": 42,
          "created_utc": 1736915834.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m75t5ea",
      "author": "Jasper0812",
      "body": "Razer is an awful company. I had a headset that was a couple months old and the mic boom began to sag and wouldn’t stay near my mouth. This was a pervasive issue judging from the reviews. I called and they refused to do anything and said it didn’t affect the performance of the mic. Thank god I bought it from Amazon and could still return it. That was 2-3 years ago and I have never and will never touch their products again.",
      "score": 108,
      "created_utc": 1736888404.0,
      "replies": [
        {
          "id": "m76b0sw",
          "author": "Low_Background3608",
          "body": "Their products were much better 5+ years ago. The enshittification of Razer is complete.",
          "score": 68,
          "created_utc": 1736893728.0,
          "replies": [
            {
              "id": "m76tz1o",
              "author": "garry4321",
              "body": "Their shit just gets cheaper and cheaper. They switch to continuously worse plastic quality to the point it’s just the same shit as those ones that come in bulk they pack into pc combos",
              "score": 43,
              "created_utc": 1736899892.0,
              "replies": [
                {
                  "id": "m778u28",
                  "author": "Low_Background3608",
                  "body": "I had a headset from them for YEARS that I loved… eventually broke because I kept dropping it while it was plugged in charging and the charging port just gave up. Anyways some friends gifted me a replacement of the “same model” but it no longer had voice/game splitting built in and the controls were all different in a slightly worse way. The new one had the mute built into flipping the mic boom, and that broke within 3 months. \n\nSame story with the keyboard, I had one for YEARS that I loved, that had the greatest wrist rest. When I replaced it with the “ultimate” or whatever version of the exact same model everything feels cheaper, the wrist rest no longer has padding, it’s just a cheap plastic piece.\n\nRazer will never get another dollar from me.",
                  "score": 19,
                  "created_utc": 1736904944.0,
                  "replies": []
                },
                {
                  "id": "m779ruq",
                  "author": "k3rr1g4n",
                  "body": "Logitech is a more preferred option to current Razer products. Especially their shitty chroma spyware they keep wanting to install with every accessory.",
                  "score": 15,
                  "created_utc": 1736905267.0,
                  "replies": [
                    {
                      "id": "m79pib7",
                      "author": "TombstoneSoda",
                      "body": "Logitech sent me 2 mice and 2 keyboards for free 15 years ago, after driver issues were causing failures I couldnt figure out.\n\nBoth of my items were 4 years old, 1 year past warranty.\n\nThey won me over for life, not gunna lie. Also easy to say since nothing higher end i've had from them has ever failed; only like a 10$ mouse....\n\nMeanwhile, i've never used a razer product aside from a usb hub that lasted a year without issue.",
                      "score": 5,
                      "created_utc": 1736948281.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m76yw2r",
              "author": "smulfragPL",
              "body": "Nope. Even 5 years ago i remember them being overpriced. Although it does matter what you buy from them",
              "score": 10,
              "created_utc": 1736901528.0,
              "replies": []
            },
            {
              "id": "m77f4bw",
              "author": "PotsAndPandas",
              "body": "over 5 years ago I got a mouse from them that broke within two months, they have always been a bit like dog water honestly",
              "score": 7,
              "created_utc": 1736907124.0,
              "replies": []
            },
            {
              "id": "m77n1ui",
              "author": "elementfx2000",
              "body": "I went through two of their gaming mice around 2003/2004... Both failed in under a year. Been using cheap Logitech or Microsoft mice ever since.\n\nOne product of theirs that I really like is an aluminum mousepad. Still use it to this day. It's pushing 20 years old.\nhttps://gamersnexus.net/hwreviews/128-razerexactmatxpad",
              "score": 5,
              "created_utc": 1736909934.0,
              "replies": []
            },
            {
              "id": "m77tooj",
              "author": "AuryGlenz",
              "body": "I had two of them or products break on me in within one year of use during my first year of college. \n\nThat was in 2006. They’ve been shit forever.",
              "score": 4,
              "created_utc": 1736912401.0,
              "replies": []
            },
            {
              "id": "m77xutw",
              "author": "None",
              "body": "I have the original naga mouse from 2012 and it works flawlessly to this day. I also have two other nagas given to me from a friend that are from post like 2018 ish and they’re all trash when you compare them to the 2012 model. Different cord, plastics, the degradation of important components is fast; the two newer ones already misclick and have a more limited range to get a click from angle you. The newer ones are significantly lighter, for sure. So that’s a positive if you want lighter.",
              "score": 3,
              "created_utc": 1736914045.0,
              "replies": []
            },
            {
              "id": "m7eu5tn",
              "author": "WhyYaGottaBeADick",
              "body": "Their products were shit as far back as 2012, around the introduction of their garbage cloud profile software.",
              "score": 1,
              "created_utc": 1737009173.0,
              "replies": []
            },
            {
              "id": "m7fomum",
              "author": "Spideryote",
              "body": "I was wondering why my blackwidow keyboard from 2018 is still going perfectly strong, minus one leg\n\nAnd to think, the only reason I never upgraded is because they got rid of the macro row",
              "score": 1,
              "created_utc": 1737027690.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m77c8hx",
          "author": "Kedodda",
          "body": "The only razer products I actually like and haven't replaced (they won't die for whatever reason) is my 2013 blackwidow keyboard, and the naga mouse I got in 2020 to replace my older 2014 naga that shocked me when I touched it and it quit working. \n\nLooking at other brands for replacement though",
          "score": 7,
          "created_utc": 1736906116.0,
          "replies": []
        },
        {
          "id": "m77wvp1",
          "author": "HeftyArgument",
          "body": "They sold me the only controller I’ve ever owned that got stick drift, after like a week of use.\n\nEven my joy cons don’t have drift after 5 years",
          "score": 3,
          "created_utc": 1736913649.0,
          "replies": []
        },
        {
          "id": "m78hqja",
          "author": "aaahhhhhhfine",
          "body": "My keyboard and mouse barely work because I need their app. And that app is buggy and a mess. Plus nothing of theirs seems to work through a KVM. \n\nI'm never buying razer garbage again.",
          "score": 2,
          "created_utc": 1736923699.0,
          "replies": []
        },
        {
          "id": "m77uq56",
          "author": "BbyJ39",
          "body": "They are no different than any other company. They make some good products and like anything else, there’s a small percentage of defective units. Your anecdotal experience is meaningless overall considering Razer annual revenue is 1.6 billion. They don’t get there by being a bad company that makes bad products. Here’s my anecdote: I’ve got a pair of Razer kraken headphones I bought on sale for $50, normally $90 that have better sound and build quality than anything else at that price point. The retractable mic works great. They’ve lasted me for years without issue. See how pointless it is for me to use my anecdotal evidence to prove Razer is a great company. You’re here on reddit crying about one little thing but right now Razer is selling thousands of items.",
          "score": 2,
          "created_utc": 1736912803.0,
          "replies": []
        },
        {
          "id": "m78tpia",
          "author": "ElsonDaSushiChef",
          "body": "When my Basilisk V3 Pro stopped working, I filed a notice with them with the cut cord and case number.\n\nThey somehow delivered me a brand new mouse, spanking new, plastic still on, and WORKING. For free.",
          "score": 1,
          "created_utc": 1736931182.0,
          "replies": [
            {
              "id": "m795htz",
              "author": "The_RealAnim8me2",
              "body": "That should be the bare minimum level of service you expect. Don’t put them on a pedestal for that.\n\nTheir products are still cheap garbage and their software is invasive as hell:",
              "score": 4,
              "created_utc": 1736938798.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m76kysx",
      "author": "chrischanhanson",
      "body": "Razer has been shit forever, I don’t know why people continue buying their garbage that they don’t stand behind",
      "score": 32,
      "created_utc": 1736896900.0,
      "replies": [
        {
          "id": "m76tctn",
          "author": "None",
          "body": "[deleted]",
          "score": 11,
          "created_utc": 1736899689.0,
          "replies": [
            {
              "id": "m77vr9h",
              "author": "BloodHaven357",
              "body": "Same here. M/KB last year and still works perfectly fine",
              "score": 2,
              "created_utc": 1736913205.0,
              "replies": [
                {
                  "id": "m789uky",
                  "author": "chrischanhanson",
                  "body": "All 3 of my Razer mice lasted around 1 year, the last one being a naga 2012, did an RMA request and they denied me for being one day out of warranty, they never got my money again lol. My naga molten was my favorite mouse ever but they were plagued with QC issues that I got tired of fixing, double clicking, broken wheel, intermittent failure to track movement for a few seconds, cable deteriorating. Enjoy your Razer stuff while it lasts, it’s a shame they fall apart because all their stuff is very ergonomic \n\nMeanwhile I have had my original Microsoft mlt mouse for 20 years, g506 for 10 years, and my (huge knock on wood) final mouse for 5 without the slightest hiccup. The only reason I even needed the nagas was for WoW arena binds and Razer was really the only one that did mmo mice",
                  "score": 2,
                  "created_utc": 1736919421.0,
                  "replies": [
                    {
                      "id": "m78afm5",
                      "author": "BloodHaven357",
                      "body": "I don't blame ya. I'd dip too if I had those problems. Here's to hoping I lucked out and got a good / decent batch.\n\nI miss WoW pvp. (Before resilience)",
                      "score": 2,
                      "created_utc": 1736919716.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m786knb",
          "author": "DGNightwing95",
          "body": "All the stuff I've bought from them has worked great. Only dud was a controller from a couple years ago.",
          "score": 1,
          "created_utc": 1736917819.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7681fd",
      "author": "thepetoctopus",
      "body": "I remember seeing the ad for this and being so confused because there was no way it would work as advertised. Sure enough….",
      "score": 12,
      "created_utc": 1736892827.0,
      "replies": []
    },
    {
      "id": "m78fwi0",
      "author": "Grindelbart",
      "body": "grab escape history grandiose person entertain weather bright rich crush\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 9,
      "created_utc": 1736922654.0,
      "replies": [
        {
          "id": "m79d61c",
          "author": "aldamith",
          "body": "Sad but true, stopped buying their stuff around the time they released the rgb mouse pad cause it was all bumpy and uneven, had it rma'ed and new one was the same, then they refused a refund so i charged it back and sold the mouse pad... Profit? 😂",
          "score": 1,
          "created_utc": 1736943007.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m75e4ul",
      "author": "That_Ganderman",
      "body": "Never thought they’d actually be good masks. I did think they might be cool at a rave, though",
      "score": 13,
      "created_utc": 1736883559.0,
      "replies": []
    },
    {
      "id": "m76mykl",
      "author": "None",
      "body": "“thank you Lina Khan” we all say in unison",
      "score": 8,
      "created_utc": 1736897566.0,
      "replies": []
    },
    {
      "id": "m7740gg",
      "author": "mattzuba",
      "body": "I bought one of these, looking forward to my refund!  It's now become a relic added to my museum of useless tech, haha.  Doesn't really even hold a charge anymore.  At least not a meaningful one.",
      "score": 6,
      "created_utc": 1736903274.0,
      "replies": []
    },
    {
      "id": "m78pcli",
      "author": "thedellis",
      "body": "Your daily reminder that Razer make some truly shit products. Razer, not even once.",
      "score": 6,
      "created_utc": 1736928331.0,
      "replies": []
    },
    {
      "id": "m7al3lv",
      "author": "DaisyMa1",
      "body": "Refunds are good but until people, not companies, start facing real consequences nothing will change.",
      "score": 3,
      "created_utc": 1736958587.0,
      "replies": []
    },
    {
      "id": "m77c9sd",
      "author": "15750hz",
      "body": "Score one for Naomi Wu. Hope she hears about this.",
      "score": 3,
      "created_utc": 1736906128.0,
      "replies": []
    },
    {
      "id": "m76t9a2",
      "author": "justhereforsee",
      "body": "They should be shuttered.",
      "score": 2,
      "created_utc": 1736899657.0,
      "replies": []
    },
    {
      "id": "m77e5gd",
      "author": "ParabellumJohn",
      "body": "Oh so the scalpers are getting their money back lol",
      "score": 2,
      "created_utc": 1736906785.0,
      "replies": []
    },
    {
      "id": "m7anmv5",
      "author": "KriptiKFate_Cosplay",
      "body": "I still want one of these just for the meme of it.",
      "score": 2,
      "created_utc": 1736959329.0,
      "replies": []
    },
    {
      "id": "m7mueb1",
      "author": "stringo0",
      "body": "Legal question, what if people died because of this or suffered COVID because of this? Can they sue again? How is the $147 paying for that grief, pain and torture?",
      "score": 2,
      "created_utc": 1737124979.0,
      "replies": []
    },
    {
      "id": "m7bviyj",
      "author": "cS47f496tmQHavSR",
      "body": "I wonder how many people died because of Razer re-using Samsung's 'marketing first, quality and legitimacy second' approach lol",
      "score": 2,
      "created_utc": 1736971927.0,
      "replies": []
    },
    {
      "id": "m77dky6",
      "author": "None",
      "body": "No shit... I have one still in the box ha",
      "score": 1,
      "created_utc": 1736906584.0,
      "replies": [
        {
          "id": "m79tu1p",
          "author": "kryst4line",
          "body": "I still want one for merely aesthetic reasons 😔✊🏻",
          "score": 1,
          "created_utc": 1736949881.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7kldat",
      "author": "MasterChiefB117",
      "body": "Just got my settlement check in the mail today.",
      "score": 1,
      "created_utc": 1737084822.0,
      "replies": []
    },
    {
      "id": "m8f5g3c",
      "author": "Gigaas",
      "body": "I got my check today, kind of poetic as I found the mask yesterday and tossed it, I didn't even know a refund was being issued.",
      "score": 1,
      "created_utc": 1737494454.0,
      "replies": []
    },
    {
      "id": "m7f017s",
      "author": "TouristKitchen",
      "body": "COVID has been proven to be as crooked as it was a way to break the small businesses.",
      "score": 0,
      "created_utc": 1737012558.0,
      "replies": []
    },
    {
      "id": "m75pbr7",
      "author": "FixTheUSA2020",
      "body": "Where's the class action from when the government told us regular masks worked?",
      "score": -52,
      "created_utc": 1736886854.0,
      "replies": [
        {
          "id": "m76veih",
          "author": "gdsmithtx",
          "body": "![gif](giphy|sRLpsHEM8eTOPxWdtX)",
          "score": 15,
          "created_utc": 1736900368.0,
          "replies": []
        },
        {
          "id": "m764a4t",
          "author": "Independent_Tone_570",
          "body": "No one ever said they stopped the spread completely, they said they helped stop the spread. If you’re too stupid to understand the difference, that’s on you. Anyone who paid attention even the slightest in high school biology can understand that a barrier to stop particle spreading from your respiratory system and the government was merely making a public health suggestion that you were able to accept or reject on your own.",
          "score": 28,
          "created_utc": 1736891712.0,
          "replies": [
            {
              "id": "m76vubn",
              "author": "gdsmithtx",
              "body": ">Anyone who paid attention even the slightest in high school biology …\n\nYou’ve very likely identified the problem.",
              "score": 17,
              "created_utc": 1736900513.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m78563d",
          "author": "1Beholderandrip",
          "body": "This may be hard to hear, but the government can legally lie to people without suffering any consequence.\n\nThe poison is in the details. If they order an act, then they there's the possibility of being held responsible. The reasoning behind the act used as a justification can be as incorrect and full of nonsense as they like and there's nothing that we can do about it.\n\nThe ordering of an action, with the consequence being it didn't help or make the situation worse, has no damaged party, so good luck arguing that in court.",
          "score": -5,
          "created_utc": 1736917171.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m77jg13",
      "author": "gamingsincepong",
      "body": "The dumbasses who purchased this don’t deserve anything back.",
      "score": -7,
      "created_utc": 1736908651.0,
      "replies": []
    },
    {
      "id": "m78ohyq",
      "author": "TouristKitchen",
      "body": "I mean it was all a load of BS I think we all deserve a refund on 2 years from a crooked government and internet misinformation from this Reddit and Farcebook and whatever social media platform was forced into lying for big Pharma",
      "score": -11,
      "created_utc": 1736927795.0,
      "replies": [
        {
          "id": "m7957of",
          "author": "The_RealAnim8me2",
          "body": "GTFO",
          "score": 8,
          "created_utc": 1736938628.0,
          "replies": [
            {
              "id": "m797rx1",
              "author": "TouristKitchen",
              "body": "Use your words.   These letters do not mean anything to me.   Good day son",
              "score": -9,
              "created_utc": 1736940139.0,
              "replies": [
                {
                  "id": "m7a8czq",
                  "author": "The_RealAnim8me2",
                  "body": "Ahem (clears throat)… Get the fuck out you conservative, conspiracy theorist shitbag.\n\nBetter?",
                  "score": 11,
                  "created_utc": 1736954751.0,
                  "replies": [
                    {
                      "id": "m7b5px6",
                      "author": "TouristKitchen",
                      "body": "There is not enough letters in your first statement for that.    Pardon but if you have a problem with others opinions please at least be smart enough to have a decent comeback.   Good day kiddo",
                      "score": -5,
                      "created_utc": 1736964544.0,
                      "replies": [
                        {
                          "id": "m7b6zs7",
                          "author": "The_RealAnim8me2",
                          "body": "I have no issues with opinions unless they are driven by a lack of understanding and baseless conspiratorial nonsense. You really aren't worth that much effort.  \nIt's also cute that you think I'm a \"kiddo\",",
                          "score": 7,
                          "created_utc": 1736964909.0,
                          "replies": [
                            {
                              "id": "m7b8gzj",
                              "author": "TouristKitchen",
                              "body": "I don't think you're a kid.   It's just obvious.   If you still have not figured out COVID was a scam and nothing more than a big pharma American made product.  You're a child at heart and so trusting of your government or you're not old enough to vote and a social media clown.",
                              "score": -1,
                              "created_utc": 1736965333.0,
                              "replies": [
                                {
                                  "id": "m7efbgn",
                                  "author": "pinetrees23",
                                  "body": "You are human garbage",
                                  "score": 3,
                                  "created_utc": 1737001977.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}