{
  "post": {
    "title": "Google seems to have called it quits on making its own Android tablets—again",
    "author": "Sariel007",
    "id": "1gy0ewn",
    "score": 1560,
    "created_utc": 1732370917.0,
    "selftext": "",
    "num_comments": 193,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gy0ewn/google_seems_to_have_called_it_quits_on_making/"
  },
  "comments": [
    {
      "id": "lym1xlk",
      "author": "None",
      "body": "I have friends that will jump into new hobbies, spend all their time and money on them, then months later they're done and they've moved on. This happened recently with a friend and taxidermy. She spent thousands on it and now she's given it up for something else. Google is just like this.",
      "score": 381,
      "created_utc": 1732385397.0,
      "replies": [
        {
          "id": "lyn8vma",
          "author": "Harley2280",
          "body": "Your friends may have ADHD. not saying they do, but the hyper fixation and then suddenly no longer being interested in something is very common among people with ADHD.",
          "score": 174,
          "created_utc": 1732399511.0,
          "replies": [
            {
              "id": "lynrlfk",
              "author": "Mama_Skip",
              "body": "Even if you stick to the same hobby it can be a problem, it just stages down. \n\nI have ADD and like to cook. I'm generally consistent about it, but the problem is my style of hobby progression. \n\nI'll hyperfixate on researching, cobbling together recipes, and optimizing a single dish, and then randomly, without even realizing it, get bored and move on. And I never remember to write anything down (my auto response is I'll do it later ofc), so months later I'll be like oh fuck what were the exact steps to the sous vide duck thighs? And I'll piece it together but usually feel I've forgotten a proportion, step, or ingredient. \n\nSo essentially I master a recipe only to forget it ever happened.",
              "score": 38,
              "created_utc": 1732406243.0,
              "replies": [
                {
                  "id": "lyowfch",
                  "author": "reddits_aight",
                  "body": "Been working on ADHD in therapy and one of the biggest things I learned early on was to write everything down IN ONE PLACE. Tasks, notes, appointments, things you want to remember, it can be disorganized or messy at first but it **can't** be scattered. Once you've started to form the habit you can work on adding more organization, but the first step is centralizing. \n\nThat combined with accepting that no system is perfect, so just accept whatever limitations your chosen system has instead of constantly jumping ship to a new calendar/notes platform or just abandoning it.",
                  "score": 25,
                  "created_utc": 1732422163.0,
                  "replies": [
                    {
                      "id": "lyp5lam",
                      "author": "rocketmonkeys",
                      "body": "A note-taking app on both computer & smartphone, with voice-to-text, where I put EVERYTHING.  Dr's appt notes, work notes, when I changed water filter in the fridge, ideas I had for projects, the size of my window sill, the model & serial number of my TV.  Everything.\n\nIt's amazing how often I go back and need to find things that are years old.",
                      "score": 7,
                      "created_utc": 1732426408.0,
                      "replies": [
                        {
                          "id": "lyp8ga2",
                          "author": "TitaniuIVI",
                          "body": "What app do you use?",
                          "score": 2,
                          "created_utc": 1732427868.0,
                          "replies": [
                            {
                              "id": "lyv7gi7",
                              "author": "rocketmonkeys",
                              "body": "I previously used Evernote before they stated imploding.\n\nNow I use joplin, mainly due to 1) open source, 2) completely self-hostable.  As a bonus, it's really customizable (I've started writing plugins to make my life easier, add AI, etc).\n\nJoplin does have paid-for hosted plans, which makes syncing even easier.\n\nThere are other open source and half-open-source notetakers available.  I work mainly in text, so joplin is a really good fit for me (even though it does support more than just text).",
                              "score": 2,
                              "created_utc": 1732514323.0,
                              "replies": []
                            },
                            {
                              "id": "lypatop",
                              "author": "The_Erlenmeyer_Flask",
                              "body": "I use alot of Google products. To use some of what /u/rocketmonkeys said, Google Docs is where I will put doctor appointment notes, work notes, ideas had for projects, size of the window sill & will type them up immediately. I will take a picture of the model & serial number of the TV & upload that to my Google Drive. Google Calendar for when I change the water filter in the fridge & a reminder in 6 months or whatever when to change it the next time.",
                              "score": 1,
                              "created_utc": 1732429133.0,
                              "replies": []
                            },
                            {
                              "id": "lyr5o1e",
                              "author": "valtmiato",
                              "body": "Google Keep",
                              "score": 0,
                              "created_utc": 1732463295.0,
                              "replies": [
                                {
                                  "id": "lyv7hth",
                                  "author": "rocketmonkeys",
                                  "body": "I still use keep for todo lists, but looking to replace that as well.",
                                  "score": 1,
                                  "created_utc": 1732514341.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lytrapq",
                  "author": "101_210",
                  "body": "Hi, to fuel this addiction that we share here are some rabbit hole suggestions:\n\n-Ramenlord book of ramen. You may or may not do like me and spend a week eating only ramen.\n\n-Chris Young cooks on YouTube. Like Kenji on crack. Science based cooking at its best, very good production value and challenging concepts we take for granted. He is also one of the authors of…\n\n-Modernist Cuisine. A different way to cook, using gels, siphons, sous vide, etc. All while going into excruciating details on the science and theory of everything food related.",
                  "score": 2,
                  "created_utc": 1732493102.0,
                  "replies": []
                },
                {
                  "id": "lypbz82",
                  "author": "crispy_gooner",
                  "body": "This is me to a tee, do I have ADHD?",
                  "score": 2,
                  "created_utc": 1732429762.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyn9we0",
              "author": "SteeveJoobs",
              "body": "ow i’m in this picture and i don’t like it",
              "score": 51,
              "created_utc": 1732399867.0,
              "replies": [
                {
                  "id": "lyq0vkj",
                  "author": "Foxnos",
                  "body": "It's not so bad if you are financially illiterate and never find out how much money you loose on hobbyjumping.",
                  "score": 6,
                  "created_utc": 1732445074.0,
                  "replies": [
                    {
                      "id": "lyqlbcj",
                      "author": "Smartnership",
                      "body": "Having money is tight.",
                      "score": 2,
                      "created_utc": 1732455848.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyps6q3",
              "author": "Luize0",
              "body": "We should stop associating everything with disorders or whatever you'd call it. Some people just like achieving a goal and then are ok with moving on to the next thing.",
              "score": 10,
              "created_utc": 1732439573.0,
              "replies": [
                {
                  "id": "lyr13a2",
                  "author": "Harley2280",
                  "body": ">Some people just like achieving a goal and then are ok with moving on to the next thing.\n\nThere is no goal being achieved in these cases. It's people spending a ton of money and doing nothing with the stuff they bought. \n\nIt's not associating everything with a disorder when it is an actual symptom of the disorder.",
                  "score": -3,
                  "created_utc": 1732461770.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyngh39",
              "author": "None",
              "body": "I highly suspect that to be the case. I have it and I'm that way. I tend to stick with a few specific interests and switch between them though.",
              "score": 2,
              "created_utc": 1732402188.0,
              "replies": []
            },
            {
              "id": "lyph3kk",
              "author": "k3v1n",
              "body": "It's one of the reasons I know so much about so many different things. Took a serious interest in things for a little while and then it was something else. I at least benefit from the fact that most of the things I find interesting don't really cost money and they just relate to learning about them.",
              "score": 1,
              "created_utc": 1732432698.0,
              "replies": []
            },
            {
              "id": "m5jb9fr",
              "author": "proto-x-lol",
              "body": "Harley2280 said:\n>Your friends may have ADHD. not saying they do, but the hyper fixation and then suddenly no longer being interested in something is very common among people with ADHD.\n\nI job hop every year to two years because I can’t see myself working at a company for more than a year or two. I become insane and feel my pupils dilate along my heart racing several BPM lol. \n\nI’m sure it’s not ADHD though. I just can’t tolerate mediocrity and stagnation. I think it should be illegal for anyone who seem okay with doing the same thing for more than two years, but that’s just me. 😂",
              "score": 1,
              "created_utc": 1736092479.0,
              "replies": []
            },
            {
              "id": "lyozos5",
              "author": "veevacious",
              "body": "I have ADHD and I do this. A lot of times I’ll circle back around, sometimes years later, but not always.",
              "score": 1,
              "created_utc": 1732423607.0,
              "replies": []
            },
            {
              "id": "lynn803",
              "author": "StijnDP",
              "body": "That's just being a curious human with more means than needs. The interest is not the hobby but learning the hobby.  \n\nNot every damn thing has to be some sickness for people to excuse their behaviour or their abuse of pharmaceutical drugs.  \n\nAlso get off tiktok and instagram. You don't have ADHD. Those apps have programmed your brain to behave similar to a singular symptom of ADHD.  \n\nAlso stop having 20 gadgets around you on the table when you need to do work. Obviously you're going to get distracted by them.  \n\nYou also don't have autism that you or anyone else should care about. It's a spectrum. Everyone is autistic. Save the tears for people who are on the spectrum where it becomes a hindrance to live their life.",
              "score": -4,
              "created_utc": 1732404646.0,
              "replies": [
                {
                  "id": "lynq20y",
                  "author": "orbix42",
                  "body": "The better thing to do here would have been to just not say anything, rather than contributing to the unnecessary stigma around ADHD and autism. No one brought up medication, no one brought up autism, and no one was making excuses for anything. There’s no need to show up yelling about things you don’t understand about people you don’t know.",
                  "score": 9,
                  "created_utc": 1732405682.0,
                  "replies": []
                },
                {
                  "id": "lyoq77u",
                  "author": "PuppetPal_Clem",
                  "body": "> Those apps have programmed your brain to behave similar to a singular symptom of ADHD. \n\nI'm in my mid 30's with ADHD and never once used tiktok and barely used instagram 10 years ago. I was Diagnosed at the age of 10 and because of people like you I convinced myself that it was all fake and refused medication and ruined my life in my 20's and had to start my life over at age 29. ADHD is primarily a dopamine base-level deficiency in the brain that causes cascading failure of other neurological processes that can cause severe malformation of other regions of the brain. Oftentimes it can be controlled with medication and intentional regimenting of ones daily life but to suggest that everyone with ADHD is just a tiktok addict who believes anything they hear is so fucking demeaning that it borders on outright insulting. How about you just shut the fuck up about things you literally don't know about, hm?",
                  "score": 5,
                  "created_utc": 1732419566.0,
                  "replies": [
                    {
                      "id": "lyp0wsc",
                      "author": "orbix42",
                      "body": "Fellow ADHDer here- wasn’t diagnosed until my late 30s (3 years ago) after hitting a wall in high school and again in college- this kind of bullshit is what made me write off ADHD and a lot of people that I knew growing up as well.\n\nThanks for fighting the good fight- I try to shut these assholes down where I can and it’s nice to see others doing the same.",
                      "score": 3,
                      "created_utc": 1732424156.0,
                      "replies": [
                        {
                          "id": "lypdyr9",
                          "author": "PuppetPal_Clem",
                          "body": "You have to try where you can at least. Most of these idiots refuse to even engage with the part of their brain required to reform an opinion so its often a lost cause. Still, I try.",
                          "score": 2,
                          "created_utc": 1732430870.0,
                          "replies": [
                            {
                              "id": "lype748",
                              "author": "orbix42",
                              "body": "I figure I’m almost never convincing the person commenting, but maybe someone seeing people offering a rebuttal might be inspired. Similarly, it’s not much, but it’s what I can do.",
                              "score": 2,
                              "created_utc": 1732431000.0,
                              "replies": [
                                {
                                  "id": "lypeg7l",
                                  "author": "PuppetPal_Clem",
                                  "body": "Exactly. You have to at least push back on anyone who may convince a young impressionable person in the same way I was.",
                                  "score": 2,
                                  "created_utc": 1732431138.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lynp4dl",
                  "author": "Harley2280",
                  "body": ">Also get off tiktok and instagram. You don't have ADHD.\n\n1. I'm not on either of those \n\n2. I don't think you're qualified to make that diagnosis. \n\n3. No one mentioned autism. \n\n4. Go touch grass you chronically online twat.",
                  "score": 10,
                  "created_utc": 1732405343.0,
                  "replies": [
                    {
                      "id": "lyor26k",
                      "author": "None",
                      "body": "you’re not qualified either",
                      "score": -5,
                      "created_utc": 1732419910.0,
                      "replies": [
                        {
                          "id": "lyp4gt4",
                          "author": "Harley2280",
                          "body": "Correct which is why my post says. \n\n> not saying they do,",
                          "score": 3,
                          "created_utc": 1732425842.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lyo05kb",
                  "author": "madmanz123",
                  "body": "Yeah... Shut up. You aren't a doctor so stop acting like one. You don't have enough information or training to speak on this.",
                  "score": 3,
                  "created_utc": 1732409383.0,
                  "replies": [
                    {
                      "id": "lyooxk1",
                      "author": "MisterDonutTW",
                      "body": "He is right though",
                      "score": -4,
                      "created_utc": 1732419051.0,
                      "replies": [
                        {
                          "id": "lyp6qib",
                          "author": "orbix42",
                          "body": "No, they’re just an asshole talking about things they don’t understand.",
                          "score": 1,
                          "created_utc": 1732426984.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyozrln",
              "author": "Bigpappa36",
              "body": "Definitely adhd. Speaking from experience, each years it’s gone something like rapping, bow and arrow, skateboarding, collecting Steelbooks, astronomy/ buying a telescope. - engulfed for 8-12 months then move on like it’s not own else’s business",
              "score": -1,
              "created_utc": 1732423641.0,
              "replies": []
            },
            {
              "id": "lyp73l5",
              "author": "RanierW",
              "body": "Google has ADHD then?",
              "score": -2,
              "created_utc": 1732427167.0,
              "replies": []
            },
            {
              "id": "lypsb8k",
              "author": "polopolo05",
              "body": "adhd for sure... thankfully I bounce between only a few hobbies. aka cycling, swim, 3d printing, lightsabers, ceramics.",
              "score": -2,
              "created_utc": 1732439653.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyohpbg",
          "author": "PlayingDoomOnAGPS",
          "body": "This, exactly. Google's internal workings reward *launching* things, not refining and supporting things. After Hangouts, I wouldn't even *consider* adopting a new Google product. I'm honestly shocked the Pixel line continues at all. Look at the Google products/services that have had longevity: Search? Ads & data collection. Gmail? Ads & data collection. Chrome? Ads & data collection. Android? Ads & data collection. Maps? Ads & data collection. YouTube? Ads & data collection. If a Google product doesn't revolve around ads and data collection, it's most likely just some exec's stepping stool to his next promotion and will be left to rot once he gets it.",
          "score": 21,
          "created_utc": 1732416213.0,
          "replies": [
            {
              "id": "lypoi0t",
              "author": "meleesurvive",
              "body": "Keep in mind Pixel used to be \"Nexus\", I wouldn't be surprised if they change it to something stupid like \"Google Play Phone\" within 3 years",
              "score": 9,
              "created_utc": 1732437223.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lypg2jt",
          "author": "nomadcrows",
          "body": "If I were trying to write a joke about this I don't think I would be clever enough to use taxidermy as the hobby, that is fucking hilarious 😂",
          "score": 4,
          "created_utc": 1732432077.0,
          "replies": []
        },
        {
          "id": "lyokmx6",
          "author": "3-DMan",
          "body": "> taxidermy\n\nWell, at least they've made some friends to talk to...",
          "score": 3,
          "created_utc": 1732417344.0,
          "replies": [
            {
              "id": "lyoqakf",
              "author": "None",
              "body": "I'm not sure the friends are in the best of conditions.",
              "score": 2,
              "created_utc": 1732419603.0,
              "replies": [
                {
                  "id": "lypbuce",
                  "author": "Viper67857",
                  "body": "They may be lacking internal organs, but I'm sure they look good as new.",
                  "score": 1,
                  "created_utc": 1732429687.0,
                  "replies": [
                    {
                      "id": "lypzigm",
                      "author": "None",
                      "body": "They’re not finished, as far as I know",
                      "score": 1,
                      "created_utc": 1732444226.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyqz7zt",
                  "author": "3-DMan",
                  "body": "Pivoting to Cronenberg Taxidermy!",
                  "score": 1,
                  "created_utc": 1732461137.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyqkzm3",
          "author": "Smartnership",
          "body": "https://killedbygoogle.com/\n\n\nBehold, the Google Graveyard … Like an island of misfit toys \n\n*The Google Squirrel Cycle*\n\n*-* Google gets an idea for a cool new thing.\n\n*-* Google announces cool new thing.\n\n*-* Google ‘new thing high’ wears off, just as someone shouts “SQUIRREL!”\n\n*-* Google head snaps to one side, immediately focuses on next new thing",
          "score": 2,
          "created_utc": 1732455712.0,
          "replies": [
            {
              "id": "lyqu87z",
              "author": "None",
              "body": "Some of the stories of these products are interesting. Some were not killed outright but rolled into other services or sold off. People were using YouTube for music anyway, and probably more than Google Music, so they rolled it into that and killed Google Music. Google Domains was sold off to SquareSpace (and I'm still bitter about it). \n\nSome products should never have happened like Threadit, YouTube Gaming, Google+, etc. And still others never had a chance, like Google Podcasts.",
              "score": 5,
              "created_utc": 1732459355.0,
              "replies": [
                {
                  "id": "lyqujy7",
                  "author": "Smartnership",
                  "body": "> Google Domains was sold off to SquareSpace (and I'm still bitter about it).\n\n\nSo bitter.  I can’t even with them anymore.",
                  "score": 5,
                  "created_utc": 1732459472.0,
                  "replies": [
                    {
                      "id": "lyqvv78",
                      "author": "None",
                      "body": "I won't start using Google for anything important now because of this. It's too much work to switch away from Google when they sell to the devil.",
                      "score": 3,
                      "created_utc": 1732459950.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lyli2yh",
      "author": "sirhoracedarwin",
      "body": "I love my pixel tablet, but the hub mode is very half baked",
      "score": 44,
      "created_utc": 1732379025.0,
      "replies": [
        {
          "id": "lynq8ec",
          "author": "setyourfacestofun174",
          "body": "Half baked kinda describes everything Google besides Android. \n\nIt’s like they really don’t believe in their own products sometimes. \n\nI remember owning the Nexus 7 and loving that thing. Wasn’t the best tablet but as a struggling college student who needed a cheap tablet, it was well worth it. I would say worth more than the cost I paid for it.",
          "score": 59,
          "created_utc": 1732405746.0,
          "replies": [
            {
              "id": "lyoiggx",
              "author": "PlayingDoomOnAGPS",
              "body": ">Half baked kinda describes everything Google besides Android.\n\nGmail! I absolutely *loathe* post-IPO Google and agree that most of their shit sucks, usually deliberately. But Gmail is still the absolute best mail experience I've ever had. Aside from YouTube, for which no real alternative exists, I de-Googled completely between 2020 and 2022. I even ported my Google Voice number that I've had since it was Grand Central over to my carrier. Gmail is the *only* thing I miss.\n\nNinja-edit: I lied. I also miss the Pixel camera and call screening. Not near as much as Gmail though. I'm honestly considering switching back to Gmail because Apple's Mail app is utter dogshit. They ought to be ashamed to put their name on it.",
              "score": 7,
              "created_utc": 1732416498.0,
              "replies": [
                {
                  "id": "lypvh1d",
                  "author": "OMGItsCheezWTF",
                  "body": "Gmail is a good email experience, but not the best. It's not even the best webmail experience Google have done. Google Inbox was incredible until Google killed it. I miss inbox a lot.",
                  "score": 3,
                  "created_utc": 1732441644.0,
                  "replies": [
                    {
                      "id": "lyrbjwf",
                      "author": "Chubacca",
                      "body": "Inbox was the cancellation that hurt me the most. I now use Shortwave which is a reasonable substitute.",
                      "score": 2,
                      "created_utc": 1732465210.0,
                      "replies": []
                    },
                    {
                      "id": "lyu3xez",
                      "author": "PlayingDoomOnAGPS",
                      "body": "I *hated* Inbox but I empathize with your pain. The way Google callously pulls the rug out from under you like that is why I've grown to hate them so much. For me, it was the straight-up murder of Hangouts that was the straw that broke my back. After that, I never tried another Google offering and, indeed, almost everything they've introduced in the last 10 years was taken out back and shot within a couple years. When it comes right down to it, Google is an advertising company engaged in rent seeking. The businesses that want to get my attention are Google's customers, not me, and Google mistreats them too!",
                      "score": 1,
                      "created_utc": 1732497685.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyol2vd",
                  "author": "HeftyArgument",
                  "body": "Just switch to the gmail app, if only for push notification capability.",
                  "score": 2,
                  "created_utc": 1732417519.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lypfhk7",
              "author": "Stuffthatpig",
              "body": "We still have the nexus 7. Too slow to do anything on it but Disney and Netflix still run so the kids use it to download and watch. Wifi is a giant battery suck so need to be in airplane mode. Charging port is mostly shot so there's a specific way to charge it. But it keeps limping along",
              "score": 3,
              "created_utc": 1732431738.0,
              "replies": [
                {
                  "id": "lyu015m",
                  "author": "rdbpdx",
                  "body": "Dunno about N7, but N7 2013 supports qi charging. You could even get a qi2 metal ring and stick it over the coil to make it more convenient to find the right spot.",
                  "score": 1,
                  "created_utc": 1732496239.0,
                  "replies": [
                    {
                      "id": "lyv3u05",
                      "author": "Stuffthatpig",
                      "body": "I think ours is the OG version. It's alright...12+ years is pretty good",
                      "score": 1,
                      "created_utc": 1732512422.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyok4wg",
              "author": "HeftyArgument",
              "body": "baked just enough to extract the maximum ROI, then throw it in the bin",
              "score": 4,
              "created_utc": 1732417148.0,
              "replies": []
            },
            {
              "id": "lyphf5n",
              "author": "gaytechdadwithson",
              "body": "i loved mine! no android since…",
              "score": 1,
              "created_utc": 1732432893.0,
              "replies": []
            },
            {
              "id": "lypztz9",
              "author": "hebrew12",
              "body": "Nexus 7 was amazing.  I sadly returned it because it couldn’t run a few of the things I needed it to in any of the browsers I tried.  So had to return it.  Amazing device though",
              "score": 1,
              "created_utc": 1732444429.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lynut84",
          "author": "getmoneygetpaid",
          "body": "The hub mode had 3 pretty major problems problems for me.\n\n1. Youtube Music gives me Ads even though I'm a subscriber. Because Google a clusterfuck, the Youtube Music team pointed me to the Pixel, and the Pixel Team pointed me to the Youtube Music Team. If nobody is supporting this problem, I can't imagine it'll get fixed.\n\n2. The dock sounds like shit. Slightly better than my Gen 1 Nest Mini, and slightly worse than my Gen 2 Nest Mini (both of which were given away for free). It actually has the same speaker as the Nest Mini, so that makes a lot of sense. Not even close to my other Google Home speakers. For £130 I was expecting it to sound like a Nest Hub at least. My other tablet's speakers sounds better than the Pixel Tablet's dock.\n\n3. Adding it to a Chromecast audio group with non-Google devices (Sony, Onkyo) would cause those devices to not work in the group any more.\n\nSo yeah, half-baked to say the least. I'd argue not fit for purpose.",
          "score": 6,
          "created_utc": 1732407431.0,
          "replies": []
        },
        {
          "id": "lylzf15",
          "author": "the_naughty_ottsel",
          "body": "How good is it? I was considering buying a pixel tablet soon. My kid is old enough to know we can watch bluey on my phone. I was considering the tablet to kind of be the kids device and just let shows be watched. I also am thinking of just not trading my current phone in when upgrade time comes.",
          "score": 2,
          "created_utc": 1732384594.0,
          "replies": [
            {
              "id": "lyn041x",
              "author": "sirhoracedarwin",
              "body": "I think it's completely functional. I really have no complaints. I use it on the stand in the kitchen to watch tv while I do the dishes and my daughter watches YouTube kids on it most weekend mornings.",
              "score": 4,
              "created_utc": 1732396528.0,
              "replies": []
            },
            {
              "id": "lyok0fd",
              "author": "PlayingDoomOnAGPS",
              "body": "I don't think there's any good reason for the average person to even consider an Android tablet. iPad completely outclasses Android on tablets and it's not even close. Despite Samsung's valiant efforts, the OS support isn't there and the app support isn't there. It would be one thing if they offered a compelling value but the entry-level iPad is pretty fantastic at the ~$300 price point ($250 on sale every holiday and various other times). \n\nIf you spend $300 or less on an Android tablet, you're getting a barely-usable piece of shit. Samsung makes the absolute best Android tablets and I've had (and enjoyed) several over the years but the cheap ones aren't good and the good ones aren't cheap. But even when the hardware and 1st-party software are good, Android doesn't scale up well and app developers don't give half a shit about Android tablets.",
              "score": 0,
              "created_utc": 1732417099.0,
              "replies": [
                {
                  "id": "lypm6za",
                  "author": "ThisIsAnArgument",
                  "body": "For most people's use cases - browsing, watching videos and video calling and playing simple games (think older parents or young kids) a decent android tab works well enough that paying twice as much for an iPad makes no sense. You especially see this outside of first world countries where everyone is all already used to Android because of cheap phones.",
                  "score": 1,
                  "created_utc": 1732435758.0,
                  "replies": [
                    {
                      "id": "lythcm2",
                      "author": "PlayingDoomOnAGPS",
                      "body": ">a decent android tab works well enough that paying twice as much for an iPad makes no sense\n\nThat's just it though: Android tablets are *not* more economical than iPads. Find me an Android tablet that's genuinely comparable to the base model iPad at $320, let alone $250 which is a sale price we see several times a year, let alone $160, which is what it would have to be for the iPad to be twice the cost. Do you honestly think any $160 Android tablets can be called \"decent?\" *Really*?",
                      "score": 2,
                      "created_utc": 1732489579.0,
                      "replies": [
                        {
                          "id": "lyvcndb",
                          "author": "ThisIsAnArgument",
                          "body": "Yes, I do. Because I've seen parents use the galaxy thing for YouTube, video calling grandkids and playing solitaire and those silly games that makes escape me, and they're absolutely fine for that. \n\nThey're not comparable to a base iPad because they don't need to be. The galaxy tab is currently half the cost of the iPad and I can't think of why an android using older person would switch ecosystems.",
                          "score": 0,
                          "created_utc": 1732517246.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lyln757",
      "author": "Shady_Jezus",
      "body": "What??? Google is discontinuing their products???",
      "score": 43,
      "created_utc": 1732380688.0,
      "replies": [
        {
          "id": "lyqlrz8",
          "author": "Smartnership",
          "body": "[296 Google projects abandoned *so far*](https://killedbygoogle.com/)",
          "score": 8,
          "created_utc": 1732456039.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lynf12z",
      "author": "yanginatep",
      "body": "Google hasn't gotten the value proposition right on Android tablets since the Nexus 7 (2012 and 2013).\n\nNo one is going to pay iPad-like prices for an Android tablet. iPads hold their value for years and get years of support with updates. Android tablets don't really.\n\nAlso Google really fucked up by killing the original tablet UI in Android 4.1 (originally introduced with Android 3.0) for a dumbed down UI that had a lot of wasted white space and no difference between a 12 inch screen and a 4 inch one. That signaled to developers to stop supporting a tablet UI so they did. Then about a decade later Google tried to bring back a tablet UI.",
      "score": 9,
      "created_utc": 1732401673.0,
      "replies": []
    },
    {
      "id": "lykxmu8",
      "author": "ProtomanBn",
      "body": "Google announced there stopping production on Pixel Tablet 2 but where still working on PT3",
      "score": 130,
      "created_utc": 1732371797.0,
      "replies": [
        {
          "id": "lyl6dzf",
          "author": "cbarrick",
          "body": "Google didn't announce anything.\n\nAs this Ars article puts it in **the first sentence**, some outlets are reporting that the PT2 was cancelled, while others are reporting that the PT3 was cancelled.",
          "score": 96,
          "created_utc": 1732375054.0,
          "replies": [
            {
              "id": "lylfa9d",
              "author": "hedoeswhathewants",
              "body": "I genuinely don't mean this an an insult, but based on their post English might not be their strong point.",
              "score": 37,
              "created_utc": 1732378094.0,
              "replies": [
                {
                  "id": "lytvusz",
                  "author": "TehOwn",
                  "body": "Judging by their mistakes, I agree but I also think it's their first language. You wouldn't believe how many people from England make these exact same mistakes.\n\nNothing is as bad as \"would of\", though.",
                  "score": 1,
                  "created_utc": 1732494716.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lymjvvt",
          "author": "InsaneNinja",
          "body": "It means they don’t like their initial ideas for PT2. Possibly wasn’t powerful enough for future Gemini nanos.",
          "score": 3,
          "created_utc": 1732391117.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyl0ptv",
      "author": "void_const",
      "body": "Typical Google. Release something and then stop supporting it soon after.",
      "score": 82,
      "created_utc": 1732372982.0,
      "replies": [
        {
          "id": "lylil02",
          "author": "None",
          "body": "[deleted]",
          "score": 16,
          "created_utc": 1732379191.0,
          "replies": [
            {
              "id": "lyn656q",
              "author": "KDLGates",
              "body": "Google Fi is less than a shadow of what Project Fi once was. I think the only reason they keep it operating as an MVNO is because it's profit on autopilot. The rate flexibility isn't any better than it used to be, the customer service is miserable compared to the early days when it was excellent, and if it even still does the network switching (they killed the codes that let you do it on demand), that's now done better by its competition.",
              "score": 8,
              "created_utc": 1732398579.0,
              "replies": [
                {
                  "id": "lynbwiu",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1732400571.0,
                  "replies": [
                    {
                      "id": "lyndkpi",
                      "author": "ersan191",
                      "body": "To be honest if you're using a lot of international data they are probably losing money with you as a customer.",
                      "score": 3,
                      "created_utc": 1732401162.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lym5rcr",
              "author": "tempnew",
              "body": "Gmail and Google docs are used by paying enterprise customers. Gmail is also the most popular email service and a lucrative ad target. So they're not going anywhere.",
              "score": 9,
              "created_utc": 1732386605.0,
              "replies": [
                {
                  "id": "lyn4bsw",
                  "author": "rasputin1",
                  "body": "I'm not entirely sure what's keeping Keep alive ",
                  "score": 4,
                  "created_utc": 1732397962.0,
                  "replies": [
                    {
                      "id": "lyoy28w",
                      "author": "Agent_03",
                      "body": "The data generated probably has advertising (shopping lists, gift lists etc) or AI training value (to-do lists). \n\nAlso, I doubt Keep costs much money to keep running.  Unless you're the rare user that attaches a lot of images, it's mostly small text snippets with limited markup.  The amount of bandwidth and server processing involved can't be huge.",
                      "score": 2,
                      "created_utc": 1732422878.0,
                      "replies": [
                        {
                          "id": "lyplqt4",
                          "author": "rasputin1",
                          "body": "I have like 2 gigs worth of data in Keep lol",
                          "score": 1,
                          "created_utc": 1732435479.0,
                          "replies": [
                            {
                              "id": "lyr0upk",
                              "author": "Agent_03",
                              "body": "I suspect you're a *bit* of an outlier there...\n\nAlthough even 2 GB isn't really that much for a cloud provider, as long as most of it is cold and it doesn't have to process through it much.  \n\nThat said, Google will probably abandon Keep at some point so it may be worth thinking what your transition plan would look like.",
                              "score": 1,
                              "created_utc": 1732461691.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lynljne",
                      "author": "stevewmn",
                      "body": "My biggest use for it has been shopping lists. maybe I'm not alone, and that can be monetized?\n\nWhat I like is that I can pull my phone as items I need pop into my head, and since I use a checklist I can re-sort the list on shopping day  match my route around the store. I also leave everything I bought in there and uncheck it when I need it again.",
                      "score": 2,
                      "created_utc": 1732404032.0,
                      "replies": [
                        {
                          "id": "lyo2yiz",
                          "author": "rasputin1",
                          "body": "yea I mean it * could * be monetized but it's been around for years and years with somehow no obvious monetization or any clear incentive for Google at all really. not to mention they have a basically duplicate app, Tasks. which also seems to have no business reason to exist. except I guess just generally trying to keep people in the Google ecosystem...?🤷",
                          "score": 2,
                          "created_utc": 1732410461.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lylvv27",
          "author": "hyperforms9988",
          "body": "Eh... I feel like this is in a different category.  This is not like... something like Stadia, where it's an entire proprietary platform and when they stop supporting that, then all your shit is gone, the related devices are rendered completely worthless and can't do anything anymore, and there's no alternative device out there that can access the same thing.\n\nThis is a tablet running Android.  If they stop making tablets... then get an Android tablet made by somebody else when it's time to get a new one.  Who gives a shit?  The only loss to anybody here is if somehow somebody is a Google tablet loyalist and refuses to buy anything but Google tablets... and I don't know how many of those people are out there.   It's the software that matters in a tablet.  Android clearly isn't going anywhere, and your shit is tied to a Google account and not a physical device.  If what they've already built and released is going to get regular OS and security updates, then Google not making any more tablets is frankly meaningless.  If they're dropping OS/security update support early because they've dropped physical hardware support, then that's where this would be a bigger deal.\n\nI have an Android tablet and... I can't say it's completely useless, but it's little more than an alarm clock, a web browser, and a Discord screen for me.  A simple jailbroken/rooted Amazon Fire tablet can do that for me.  Pixel Tablet at regular price is $700 CDN for 128GB  of storage.  Are you **insane**?  But then again, I'm only looking at it for what I would use a tablet for.  It's on a Black Friday sale on Amazon for $500 CDN currently.  I can get an Amazon Fire HD 8 for $65 CDN for 32GB of storage on a Black Friday sale.  Fire HD 10 with 64GB is going for $170 CDN on sale.  You can get Samsung Android tablets for cheaper too.  Google has no chance trying to charge people that much money for a tablet.",
          "score": 8,
          "created_utc": 1732383489.0,
          "replies": [
            {
              "id": "lymn70v",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1732392218.0,
              "replies": [
                {
                  "id": "lytwakb",
                  "author": "TehOwn",
                  "body": ">The docking experience is a huge component of this device.\n\nCan you expand on this?",
                  "score": 1,
                  "created_utc": 1732494875.0,
                  "replies": [
                    {
                      "id": "lytwr9u",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 3,
                      "created_utc": 1732495045.0,
                      "replies": [
                        {
                          "id": "lyur5ts",
                          "author": "TehOwn",
                          "body": "What is that purpose, though? What does it do? You talking about it just sitting in a charger?",
                          "score": 1,
                          "created_utc": 1732506621.0,
                          "replies": [
                            {
                              "id": "lywkz9r",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1732542484.0,
                              "replies": [
                                {
                                  "id": "lyws8uk",
                                  "author": "TehOwn",
                                  "body": "You were talking about \"the docking experience\", so I asked you what that was. Better to hear from an actual user than a marketing page. Otherwise, what's the point in even being on Reddit?",
                                  "score": 2,
                                  "created_utc": 1732545232.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyo5oka",
              "author": "ArchusKanzaki",
              "body": "The problem with Google not having any investment on tablet, is that everyone else can only do so much to push the OS. Samsung is doing the herculean task of being the only company pushing for premium android tablet experience, and built so many things expected of premium tablet nowadays that Google just did not. \n\n>700$ CDN for 128 GB\n\nThat's what Ipad Mini and Air users are paying right now. Ipad Mini is literally the only option left for premium 7-8\" tablet. Being honest, having Ipad Mini for several years is part of the reason why I switched to iOS recently.",
              "score": 2,
              "created_utc": 1732411534.0,
              "replies": []
            },
            {
              "id": "lyn4b15",
              "author": "atomic1fire",
              "body": "I feel like the thing that helps and hinders Android as a whole is that it's essentially Windows but mobile.\n\nYou can find a windows PC at nearly any price, but a low end mac is always going to beat a low end Windows PC just because the cheapest mac will still have better hardware.\n\nIf you go with a manufacturer that makes a decent flagship device running android, you'll have a decent android device, but most people aren't going to pay a higher cost for an android device.\n\nPlus I think chromebooks and foldable models are probably more emphasized in general and it wouldn't shock me at all if a merger between Chrome OS and Android resulted in better marketing for Android.",
              "score": -5,
              "created_utc": 1732397955.0,
              "replies": [
                {
                  "id": "lyoifxj",
                  "author": "stovebison",
                  "body": "a low end mac isn't comparable to a low end pc, completely different price points.",
                  "score": 4,
                  "created_utc": 1732416492.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyr9qw4",
          "author": "Spidaaman",
          "body": "“Felt cute, might stop support later. Idk lol”",
          "score": 2,
          "created_utc": 1732464625.0,
          "replies": []
        },
        {
          "id": "lz8250y",
          "author": "Enough-Meaning1514",
          "body": "And now they announced that they are working on a MacBookAir competitive running some version of Android (not ChromeOS). Guess what will be the outcome 😏\n\nStill, I approve these activities. I generates income for engineers and suppliers 👍Google has too much money anyway...",
          "score": 2,
          "created_utc": 1732704005.0,
          "replies": []
        },
        {
          "id": "lylid3d",
          "author": "maccaroneski",
          "body": "What have they stopped supporting?",
          "score": -9,
          "created_utc": 1732379118.0,
          "replies": [
            {
              "id": "lylilbw",
              "author": "PM_UR_REPARATIONS",
              "body": "https://killedbygoogle.com/",
              "score": 16,
              "created_utc": 1732379194.0,
              "replies": [
                {
                  "id": "lylis5c",
                  "author": "maccaroneski",
                  "body": "Yes, I am aware, but what tablet have they stopped supporting? The article is about development of future tablets, not deprecation or support of existing ones.",
                  "score": -13,
                  "created_utc": 1732379257.0,
                  "replies": [
                    {
                      "id": "lylqjj9",
                      "author": "tnnrk",
                      "body": "Did you…click the article?",
                      "score": 3,
                      "created_utc": 1732381771.0,
                      "replies": [
                        {
                          "id": "lylr3aj",
                          "author": "maccaroneski",
                          "body": "Yes. The article talks about development of the pixel 2 or 3, noone is sure, but I see nothing about products they have launched and are not supporting, unless you can point out something I missed.",
                          "score": 7,
                          "created_utc": 1732381948.0,
                          "replies": [
                            {
                              "id": "lymb829",
                              "author": "AutistcCuttlefish",
                              "body": "That's because they can't point to such a thing. Google has the worst rep when it comes to supporting services but when it comes to hardware only Apple does better. Even product lines they stop making still get updates for the entire promised life and it's not uncommon for them to get updates beyond the original promise even when the production line has ceased years ago and few people have adopted the product.\n\nIt's just with cloud services and software only products that they can't be relied on.",
                              "score": 4,
                              "created_utc": 1732388340.0,
                              "replies": [
                                {
                                  "id": "lymbnaw",
                                  "author": "maccaroneski",
                                  "body": "And still I get \"Did you read the article???\".",
                                  "score": 2,
                                  "created_utc": 1732388477.0,
                                  "replies": [
                                    {
                                      "id": "lymbv8r",
                                      "author": "AutistcCuttlefish",
                                      "body": "Ignore em. They didn't even read the fucking headline. Let alone the article.",
                                      "score": 1,
                                      "created_utc": 1732388549.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lymk50z",
                      "author": "InsaneNinja",
                      "body": "It’s about having another available when it’s time to update.  \n\nWith the fruit company, if it breaks, you can always go and get a better one than your current one.\n\nWith Pixel brand, the only available option might be three years old and nearly discontinued\n\nIt’s like if your favorite car just kept selling the 2016 model for a decade. They make parts, but sometimes you just want to know you can update to a newer one.",
                      "score": 1,
                      "created_utc": 1732391200.0,
                      "replies": [
                        {
                          "id": "lymloik",
                          "author": "maccaroneski",
                          "body": "That may be so but that's not what the comment to which I responded is suggesting.",
                          "score": 1,
                          "created_utc": 1732391707.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lyl1381",
      "author": "MadOrange64",
      "body": "“I’m absolutely shocked and never saw this coming 😳”\n\n-literally nobody.",
      "score": 36,
      "created_utc": 1732373122.0,
      "replies": []
    },
    {
      "id": "lyn205e",
      "author": "Bonzey2416",
      "body": "That's why third party apps aren't optimised for Android tablets.",
      "score": 6,
      "created_utc": 1732397173.0,
      "replies": []
    },
    {
      "id": "lynukcl",
      "author": "wardial",
      "body": "who exactly is the Android tablet market?  extreme Apple haters?",
      "score": 7,
      "created_utc": 1732407341.0,
      "replies": []
    },
    {
      "id": "lymi4fy",
      "author": "GagOnMacaque",
      "body": "But I thought they were going to take it serious this time.",
      "score": 7,
      "created_utc": 1732390545.0,
      "replies": [
        {
          "id": "lyp4a21",
          "author": "RaccoonDu",
          "body": "We think that everytime they release something pixel related",
          "score": 2,
          "created_utc": 1732425748.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lym5kwd",
      "author": "coupl4nd",
      "body": "Nothing was lost.",
      "score": 3,
      "created_utc": 1732386548.0,
      "replies": [
        {
          "id": "lyzbe70",
          "author": "Millkstake",
          "body": "Except my $500, but I'm an idiot since I didn't learn my lesson from the last time. Finished with Google hardware, they are just absolutely terrible in this space.\n\nIf there's something they SHOULD abandon it's tensor.",
          "score": 2,
          "created_utc": 1732573836.0,
          "replies": []
        },
        {
          "id": "lymeihv",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1732389393.0,
          "replies": [
            {
              "id": "lymn8am",
              "author": "InsaneNinja",
              "body": "You think they hired a lot of extra people for that? They were told to work on this as well as the phones.",
              "score": 1,
              "created_utc": 1732392230.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyo1kak",
      "author": "gio5568",
      "body": "I can’t say I’m surprised. The pixel tablet just seems like a very niche product. If you’re buying it to be a home hub with the dock it’s $500, which is kinda wild to me. I could buy several different combinations of the nest hub/nest hub max and have home control and media streaming for that much money. If I got all nest hubs (the smaller one) I could have one in almost every room in my house lol. On the tablet side, even $400 is a lot for a (based on audience probably a casually/seldom used) android tablet. iPad has just dominated that space for so long and you can get one for less than that now that does everything the average user would want and it’s not a first gen product so there’s more consumer confidence for an iPad over this I would think? Neat idea, but it doesn’t seem to perform any better than the nest hub as a home control/hub device and based on market share, not many people seem to buy android tablets in general unless it’s a cheap one for their kids because who cares if your 5 yr old drops the $60 Walmart special tablet versus a larger $400 tablet 😂\n\nOk rant over, fun idea, but meh, doesn’t surprise me they may cancel it. And at least make the $129 speaker sound better than a nest mini 🙄 rather buy two of those and set them up as a group/pair for less than the dock if music and sound quality was my main use case.",
      "score": 3,
      "created_utc": 1732409923.0,
      "replies": []
    },
    {
      "id": "lymqhyj",
      "author": "pioniere",
      "body": "Seems like Google has made more unsuccessful products than successful ones.",
      "score": 5,
      "created_utc": 1732393324.0,
      "replies": [
        {
          "id": "lyoz0vz",
          "author": "Agent_03",
          "body": "Almost all of Google's successful products date back over a decade, and most are over 15 years old. \n\nGoogle has lost the ability to deliver real innovation.  They are just stuck in a cycle of launch and abandon.  They get away with this because they hold monopolies on search and ads. \n\nHonestly this is a really strong argument for breaking them up via antitrust.  As separate companies they would have to deliver and maintain consumer-valuable products to survive.",
          "score": 6,
          "created_utc": 1732423313.0,
          "replies": [
            {
              "id": "lyqo7xw",
              "author": "ccthrowaways",
              "body": "Either copycats of existing products or acquisitions. Google will learn the hard way the power of habit.",
              "score": 1,
              "created_utc": 1732457038.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyqm6c1",
          "author": "Smartnership",
          "body": "There may be a way to predict this.\n\nTheir most successful projects tend to feed into data mining for ads, their core business.",
          "score": 1,
          "created_utc": 1732456206.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyl7yfc",
      "author": "None",
      "body": ">> Google seems to have called it quits on _____\n\nNo. Way. 😳 \n\nThis has gotta be a first. Google *never* gives up on projects, and has no history of doing so. \n\n*cat nod*",
      "score": 8,
      "created_utc": 1732375605.0,
      "replies": []
    },
    {
      "id": "lynkfjf",
      "author": "None",
      "body": "That one was supposed to be the iPad killer. Priced just right and includes the hub. Very stylish design and all.\n\nI’m all Apple which makes me curious about how Apple is challenged, I really believed Google had something here: a modern design, a tiny price, quality, a hub, a perfect entry into a Google ecosystem.\n\nBut I don’t know about day to day with it. \n\nWhat disappointed users?",
      "score": 2,
      "created_utc": 1732403626.0,
      "replies": [
        {
          "id": "lyouwai",
          "author": "MrLiterato",
          "body": "Might just be me, but I never even knew it existed.",
          "score": 1,
          "created_utc": 1732421498.0,
          "replies": []
        },
        {
          "id": "lyt8rui",
          "author": "Orthopraxy",
          "body": "A tiny price? That thing was over 400 bucks where I live, almost 500 when you price in the dock that was its big gimmick. That's a substantial purchase, and for the specs the pixel tablet had, and the generally mid experience that is Andoid on a tablet, that was asking waaay too much money.\n\nPriced at 250 bucks? Then I might have bitten. Maybe I'll get one on clearence.",
          "score": 1,
          "created_utc": 1732486683.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyofwqz",
      "author": "slickrasta",
      "body": "What a shame. Android tablets are so hard to love and I was hoping Google could make a competitive model. I guess I'll wait for the fire sale and pick one up to root. Anything not to own Apple frankly.",
      "score": 2,
      "created_utc": 1732415516.0,
      "replies": []
    },
    {
      "id": "lyou2np",
      "author": "ZellZoy",
      "body": "Google and killing products. Name a more iconic duo",
      "score": 2,
      "created_utc": 1732421146.0,
      "replies": [
        {
          "id": "lyuiyqk",
          "author": "None",
          "body": "Microsoft and making decent products but ruining it over time.",
          "score": 1,
          "created_utc": 1732503358.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lypfy3d",
      "author": "BioticVessel",
      "body": "I'll miss not having them next to Pixel Tablet, maybe I'll but another of these.  Every one else wants to add too much of their own crap that doesn't work.  The Pixel is the even soldier I use reading, listening to audio books, finding this and that. I'm sorry there's not going to be a Pixel Tablet 3.",
      "score": 2,
      "created_utc": 1732432005.0,
      "replies": []
    },
    {
      "id": "lyvnvth",
      "author": "wsippel",
      "body": "There was a story a few days ago that they plan to switch to ChromeOS for tablets. ChromeOS can run Android apps, so why would they continue working on Android for tablets if that’s what they’re ultimately going for?",
      "score": 2,
      "created_utc": 1732524303.0,
      "replies": []
    },
    {
      "id": "lykxlrc",
      "author": "None",
      "body": "[removed]",
      "score": 14,
      "created_utc": 1732371785.0,
      "replies": [
        {
          "id": "lymxbz9",
          "author": "_BMS",
          "body": "Samsung tablets are really the only ones that compete with iPads.",
          "score": 6,
          "created_utc": 1732395582.0,
          "replies": []
        },
        {
          "id": "lykz420",
          "author": "cat_prophecy",
          "body": "The problem for me is that even if it were as good as an ipad, if it costs the same then the point is moot, I'll just get the iPad and so would most people.",
          "score": 19,
          "created_utc": 1732372370.0,
          "replies": [
            {
              "id": "lyl09ch",
              "author": "doomrider7",
              "body": "Versatility. I can get whatever apps I want. In genera, I also vastly prefer Android over Apple.",
              "score": 33,
              "created_utc": 1732372806.0,
              "replies": [
                {
                  "id": "lyl4aoz",
                  "author": "YesIlBarone",
                  "body": "No-one ever mentions it but iPads are completely the wrong shape for watching media - almost square. Most android tabs are much closer to TV aspect ratio",
                  "score": 11,
                  "created_utc": 1732374304.0,
                  "replies": [
                    {
                      "id": "lypop2q",
                      "author": "jb32647",
                      "body": "On the flip side, 4:3 is quite close to the ratio of A4 paper (~3:4.2) so it’s a better size for note taking.",
                      "score": 2,
                      "created_utc": 1732437349.0,
                      "replies": []
                    },
                    {
                      "id": "lyl610m",
                      "author": "appletinicyclone",
                      "body": "whats a great cheap android tab, need it for a parent. it'll be used for record keeping documents with photos and youtube and email basically",
                      "score": 3,
                      "created_utc": 1732374926.0,
                      "replies": [
                        {
                          "id": "lyl6rfq",
                          "author": "YesIlBarone",
                          "body": "Galaxy tab A9 is a great cheap tablet, but no stylus support. Galaxy tab S9 FE is much more powerful with stylus support but priced like basic ipads",
                          "score": 8,
                          "created_utc": 1732375187.0,
                          "replies": [
                            {
                              "id": "lylvp36",
                              "author": "luckymethod",
                              "body": "The problem with the galaxy is they are either slow or expensive, no in between.",
                              "score": 3,
                              "created_utc": 1732383436.0,
                              "replies": [
                                {
                                  "id": "lymi0de",
                                  "author": "YesIlBarone",
                                  "body": "I think the S9FE is a happy middle ground. The big issue with tablets is support, because you tend to hold a lot longer than your phone, and Samsung is OK in that regard",
                                  "score": 1,
                                  "created_utc": 1732390508.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lylvgc6",
                              "author": "Dantaro",
                              "body": "An S8 might be a better choice than the 9 FE from a performance to cost perspective, but it's older and won't get as many software updates so ymmv",
                              "score": 1,
                              "created_utc": 1732383357.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lymq886",
                      "author": "ace_master",
                      "body": "This. I only ever used my iPad for media consumption anyway so when it came time to upgrade, I bought a Galaxy Tab S8 which is way superior to watch videos on with its 16:10 aspect ratio.",
                      "score": 3,
                      "created_utc": 1732393233.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lymm7ol",
                  "author": "InsaneNinja",
                  "body": "“I prefer whatever apps I want” just means “I want to be able to side load utility things in case there are things Apple won’t let me.”\n\nBut.. There are so many useful apps on iPad that just aren’t available on Android, because the developers never put in the time. Like Photoshop for iPad doesn’t have an Android counterpart.",
                  "score": 2,
                  "created_utc": 1732391886.0,
                  "replies": []
                },
                {
                  "id": "lyl22m9",
                  "author": "Oddity_Odyssey",
                  "body": "I prefer android over iOS too but the utility of the iPad is absolutely unmatched. I got rid of my iPhone and Apple watch but when it comes time to upgrade my tablet I will be purchasing another iPad.",
                  "score": 3,
                  "created_utc": 1732373487.0,
                  "replies": [
                    {
                      "id": "lyl2bxg",
                      "author": "doomrider7",
                      "body": "What's the utility you get out of it vs Android. Legit curious.",
                      "score": 16,
                      "created_utc": 1732373583.0,
                      "replies": [
                        {
                          "id": "lyl2v2e",
                          "author": "Oddity_Odyssey",
                          "body": "Well the apple pencil is seamless. The battery lasts for days even as it's 4 years old. Sidecar or whatever it's called is great when I'm working on my Mac and need extra space. The size and weight of it is wonderful and it feels premium in the hand. Also iOS on the iPad works so much better than on the iPhone. And the iPads have touch id still so you don't have to worry with the finicky face id. \n\nI had several Samsung tablets before I got the iPad and none of them lasted more than 6 months. I even had one Samsung tablet completely die on me and all I did was leave it in a drawer for a few months. When I went back to it it was totally dead and nothing would get it back working.\n\nEdit to mention that it's an apple product so I'm not worried that it will suddenly become a brick.",
                          "score": 10,
                          "created_utc": 1732373779.0,
                          "replies": [
                            {
                              "id": "lyl98nj",
                              "author": "None",
                              "body": "I’m responding to you on an IPad 2 that I purchased when it was first released. It has a cracked screen with a couple of chunks missing and is still using the original battery flawlessly. I use it all the time and I’m going to replace it but damn, it just keeps working.",
                              "score": 3,
                              "created_utc": 1732376049.0,
                              "replies": [
                                {
                                  "id": "lylwcfq",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 1,
                                  "created_utc": 1732383644.0,
                                  "replies": [
                                    {
                                      "id": "lym0qga",
                                      "author": "None",
                                      "body": "My cat once knocked it over while charging and the male end of the charging cord broke off in it. I pulled out what i could and took it to an Apple repair guy. He marveled at my ancient iPad and told me that the 2 was when Apple figured out they were making a big mistake making such a good product. They fixed that when moving on to the 3. \n\nDon’t know if it’s true or not but makes sense to me. Oh, he pulled a couple little wires out, said it was fine and no charge.  There was a cat sitting on the counter. lol",
                                      "score": 2,
                                      "created_utc": 1732385015.0,
                                      "replies": [
                                        {
                                          "id": "lym97wx",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 1,
                                          "created_utc": 1732387690.0,
                                          "replies": [
                                            {
                                              "id": "lymy730",
                                              "author": "None",
                                              "body": "Thank you for the explanation. I figured there had to be a little more to it but I’m a Luddite lol. I’ve had really good luck with Apple until i went from a 6s phone ( no more updates) to an 11. For the first time I’m experiencing a crappy phone. Oh well. It’s been a really good run. \n\nSorry about the 3. It’s all a crap shoot anymore.",
                                              "score": 2,
                                              "created_utc": 1732395879.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lyl6sur",
                          "author": "IndianaJoenz",
                          "body": "I'm of two minds.\n\n1: The iPad has better APIs and libraries IMO (inherited from OS X), and this generally results in higher quality, more capable apps. The multimedia layers are lightyears ahead of android. I feel Android also has too many \"layers\" at work to be responsive enough for many applications. \n\n2: The locked down app installs suck. iOS is too locked down and money-grubbing overall. I am not crazy about the gestures. Android wins here. It is easier to use Android like a \"normal computer\" or a \"hacker's computer\" IMO.  The fact that you can make and sell products running Android is a *huge* advantage. Expect to have a rough time if you want to use it as a musical instrument, or media production tool, though.",
                          "score": 4,
                          "created_utc": 1732375201.0,
                          "replies": []
                        },
                        {
                          "id": "lyqbpp7",
                          "author": "JavaRuby2000",
                          "body": "The Apps don't exist for Android tablets.  Google can use the best hardware in the world and let you side load anything you want but, unless developers start making software for it then it will never catch up.  I don't mean little utility apps but, the main stream ones such as Affinity designer, Procreate,  or Photoshop.\n\nIf you want a tablet that runs all the latest productivity software your only choices are iPad or Surface.",
                          "score": 1,
                          "created_utc": 1732451409.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lymyfl1",
                      "author": "mikka1",
                      "body": "So much this. \n\nI still have Android phone, but after 5 or 6 Android tablets I finally called it quits and got the cheapest iPad. This thing is so responsive compared to Android tablets, the difference is just mind blowing.",
                      "score": 1,
                      "created_utc": 1732395961.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyl7l5u",
                  "author": "luger718",
                  "body": "Yeah if you like blown up phone apps. That's what the issue was (at least when I last used an android tablet). Most devs did not include a tablet interface on their apps, idk if it was difficult due to all the various screen sizes and aspect ratios or what. I loved my nexus 7.",
                  "score": 0,
                  "created_utc": 1732375478.0,
                  "replies": [
                    {
                      "id": "lyli8bs",
                      "author": "Throwaway-tan",
                      "body": "Most developers don't bother with tablet UI because the market is so small. But it's kind of a vicious cycle because that results in poor user experience and thus less people buy Android tablets.",
                      "score": 3,
                      "created_utc": 1732379073.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyli22u",
                  "author": "poopyheadthrowaway",
                  "body": "This is probably a \"bad opinion\", but as someone who's used iPads and Android tablets, I prefer Chrome OS tablets. Beyond a certain size (for me it's around 7-8\"), I'd rather just use a full desktop web browser for most things (especially since they support more extensions), and Chrome OS can run Android apps for the handful of things that a web browser can't do that mobile apps can. On a 10\" tablet (which is basically the minimum size they make tablets these days aside from the iPad Mini), rather than the Reddit app, I'd much rather run Reddit on a web browser with the old Reddit, RES, and uBlock extensions, for example.",
                  "score": 2,
                  "created_utc": 1732379017.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyl6fof",
              "author": "zkareface",
              "body": "Unless you want to watch video on it because then the Ipads are the wrong shape.",
              "score": 4,
              "created_utc": 1732375071.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lymv0yv",
      "author": "COdreaming",
      "body": "Additionally,  [https://www.androidauthority.com/chrome-os-becoming-android-3500661](Google is beginning development to replace chrome os with android) . \n\nIMO they are cancelling the tab 2 so that they can release something similar with the new android os version which sounds like it might be a game changer. \n\nI'll say it now tho: RIP Chrome OS - Google loves to sunset things and it probably just made the list.\n\nEdit: idk why the link markup is broken 😓",
      "score": 1,
      "created_utc": 1732394820.0,
      "replies": [
        {
          "id": "lyqmhye",
          "author": "Smartnership",
          "body": "[Corrected link](https://www.androidauthority.com/chrome-os-becoming-android-3500661)",
          "score": 2,
          "created_utc": 1732456337.0,
          "replies": []
        },
        {
          "id": "lyopf2p",
          "author": "BeesOfWar",
          "body": "you got the markup switched around ~ it's\n\n[text](url)",
          "score": 1,
          "created_utc": 1732419251.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyn2vw0",
      "author": "lazzzym",
      "body": "Fucking Google.....",
      "score": 1,
      "created_utc": 1732397474.0,
      "replies": []
    },
    {
      "id": "lyn3nr1",
      "author": "Mistaken_Indemnity",
      "body": "If it wasn't such a mid device, the PT would've sold better. Hell, I have everything else Pixel but the damn tablet because it was so mediocre compared to the Samsung tablet.",
      "score": 1,
      "created_utc": 1732397737.0,
      "replies": []
    },
    {
      "id": "lynacri",
      "author": "EfficientAccident418",
      "body": "Google’s pricing isn’t great. They don’t exactly have a reputation for quality products or long-term support. $1000 for a Pixel 9 Pro and $800 for the vanilla Pixel 9 is crazy considering how Google just wipes out entire product lines and divisions on a whim",
      "score": 1,
      "created_utc": 1732400027.0,
      "replies": []
    },
    {
      "id": "lynau85",
      "author": "Ok-Sorbet9418",
      "body": "Pixel tablet was overpriced and couldn’t compete with apples iPad from the get go. It’s sad how they half arse products and then drop them quickly.",
      "score": 1,
      "created_utc": 1732400196.0,
      "replies": []
    },
    {
      "id": "lyrlnag",
      "author": "None",
      "body": "Good, they’re awful.",
      "score": 1,
      "created_utc": 1732468407.0,
      "replies": []
    },
    {
      "id": "lysdex4",
      "author": "Relevant-Doctor187",
      "body": "That Nintendo money probably. They axed their tablets when Nintendo licensed the SOC for the switch.",
      "score": 1,
      "created_utc": 1732476984.0,
      "replies": []
    },
    {
      "id": "lywb4ef",
      "author": "elfmere",
      "body": "They just put them up for 50% off. Was thinking of buying 2 for my 2 young boys... still a good idea?",
      "score": 1,
      "created_utc": 1732538328.0,
      "replies": []
    },
    {
      "id": "lym3e06",
      "author": "BaconPoweredPirate",
      "body": "Never realised they'd started again. \nI liked my Nexus at the time, but my pixel phone isn't anything special",
      "score": 1,
      "created_utc": 1732385859.0,
      "replies": []
    },
    {
      "id": "lykxpmv",
      "author": "NiteFyre",
      "body": "Who is the tablet market for?\n\nI understand business use but where is the consumer use that cant be better served by a laptop/smartphone combo.",
      "score": -3,
      "created_utc": 1732371827.0,
      "replies": [
        {
          "id": "lyl0cmc",
          "author": "m0stlydead",
          "body": "I use mine for 1) reading books, 2) displaying chords and song structure while listening to the original recording while silently practicing my instrument, 3) mounting on a mic stand while rehearsing and performing for control of our mixer, 4) standing it on a treadmill and watching a show while I walk and run indoors, and 5) having access to my other content (music, shows) while doing any of those things anywhere, such as on a plane, in a hotel gym, at a band mates house, at a gig, or anywhere else. \n\nI’m fine with doing those things on my phone too, but a bigger screen is obviously better, and a laptop is too much when I don’t need a keyboard to do any of those things. I’m not bringing a $2000 laptop to a gig let alone mounting it on a mic stand. \n\nIt’s cool if just a laptop/smartphone combo works for you, I don’t hear anyone questioning that ever, but there’s obviously a market for iPads. Every musician I know owns an iPad or an android tablet.",
          "score": 19,
          "created_utc": 1732372841.0,
          "replies": [
            {
              "id": "lyq4f0c",
              "author": "Kitakitakita",
              "body": "Oh God you're the person we see in the commercials",
              "score": 0,
              "created_utc": 1732447228.0,
              "replies": [
                {
                  "id": "lyq7cks",
                  "author": "m0stlydead",
                  "body": "Using a product, amazing. Here you are using a smartphone. Equally amazing.",
                  "score": 1,
                  "created_utc": 1732448989.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyl64va",
          "author": "chayan4400",
          "body": "Go into any university lecture today and you’ll see that tablets have replaced notebooks for a good number of students. Laptops aren’t nearly as good for that, especially in equation/diagram-heavy STEM courses.",
          "score": 5,
          "created_utc": 1732374964.0,
          "replies": []
        },
        {
          "id": "lyl10vo",
          "author": "spif",
          "body": "There's a niche market for people who use iPads for creative stuff like drawing, music or video because of the touch screen interface enabling apps that can't really work as well on Mac.\n\nAnd then there's the Amazon Fire tablets that are cheap media consumption alternatives to the iPad, mainly for children or old people I would assume anecdotally. Or people use them basically as a second small TV/PC in their kitchen, bedroom, etc.",
          "score": 7,
          "created_utc": 1732373098.0,
          "replies": [
            {
              "id": "lyl3iho",
              "author": "None",
              "body": "Bingo. It’s a portable tv. Streaming allows the tablet market to exist. I can watch movies on it in the laundry room while I fold without needing to mount a tv in there. I can take it on flights and have a dedicated media player that won’t drain my phone or work laptop. \n\nI bought a cheap one, the higher end tablets are just for idiots or businesses that really need the storage space. Work laptop is great at spreadsheets but is generally a shitty laptop. And my phone I just want to stay charged as long as possible cause who knows when you’ll charge again when you’re on the move",
              "score": 5,
              "created_utc": 1732374019.0,
              "replies": [
                {
                  "id": "lyl652l",
                  "author": "appletinicyclone",
                  "body": "whats a good cheap android one?",
                  "score": 0,
                  "created_utc": 1732374966.0,
                  "replies": [
                    {
                      "id": "lyl8lqe",
                      "author": "None",
                      "body": "Look for battery life and compare specs. You can find a decent refurbished one, especially on Black Friday sales. Don’t look for the best specs and go above $200. Just make sure the screen resolution and battery life are up to YOUR standard. I’m just watching Hulu and YouTube on it so I don’t expect 4k whatever.\n\nI’m rocking a used Samsung tablet. It’s not great for much else besides what I use. Idk why anyone would spend more on a high end tablet. But hey whatever",
                      "score": 1,
                      "created_utc": 1732375829.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lylpuk7",
              "author": "greenknight",
              "body": "I just put away my 5gen Fire tablets(2015) with lineage OS last year. Stuck on a crufty Lenovo yoga book and I want to go back but they were stuck on Android 12 and we (the xda forum) couldn't get the hardware to make the next jump and the apps kept dropping support...",
              "score": 1,
              "created_utc": 1732381545.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyl2t3s",
          "author": "Jakucha",
          "body": "I turned mine into a totally legal retro games console, I use it for comics and DND related activities and all of my school books are on mine as well. Not to mention Reddit, YouTube, a picture frame and idle web surfing.",
          "score": 4,
          "created_utc": 1732373758.0,
          "replies": []
        },
        {
          "id": "lyl5skn",
          "author": "Optimus_Prime_Day",
          "body": "The business market is for business and children. Parents give their kids tablets as coparents a lot of times.",
          "score": 2,
          "created_utc": 1732374843.0,
          "replies": []
        },
        {
          "id": "lylpw7g",
          "author": "Corgi_Koala",
          "body": "I mostly use mine when I travel. Better than a phone for reading/movies on a plane. But 95% of the time I just use my phone.",
          "score": 1,
          "created_utc": 1732381560.0,
          "replies": []
        },
        {
          "id": "lyq4chp",
          "author": "Kitakitakita",
          "body": "Kids and restaurants",
          "score": 1,
          "created_utc": 1732447185.0,
          "replies": []
        },
        {
          "id": "lykz55w",
          "author": "TheGodEmperorOfChaos",
          "body": "Boomers who have learned they can watch all their favorite trash on their phones but want a bigger screen.",
          "score": -10,
          "created_utc": 1732372382.0,
          "replies": [
            {
              "id": "lyl2s87",
              "author": "challengeaccepted9",
              "body": "One of the newspapers I read on the regular used to have an app version of the print edition (ie same layout as print edition, not just the website).\n\n\nI had a cheap tablet back in 2009 and remember thinking how much I wanted to be able to read it like that.\n\n\nBy the time I had a job that paid enough to afford a subscription, they'd long since pulled the app.\n\n\nOther people ITT have set out some of their reasons.\n\n\nSo no, just not boomers watching Netflix. Try and use your imagination rather than listening to that chip on your shoulder.",
              "score": 2,
              "created_utc": 1732373749.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lymj9sl",
      "author": "EmperorAcinonyx",
      "body": "i figured this would happen. bought an ipad pro instead - couldn't be happier with the decision.",
      "score": 0,
      "created_utc": 1732390917.0,
      "replies": []
    },
    {
      "id": "lymaujn",
      "author": "BJozi",
      "body": "Did Apple not just announce a similar product? I find it ironic that Apple is *copying* Google with this and now Google is supposedly cancelling something",
      "score": -1,
      "created_utc": 1732388217.0,
      "replies": [
        {
          "id": "lymnj9e",
          "author": "InsaneNinja",
          "body": "Apple never announced anything. Some guy is leaking that in their lab, they are working on a Siri echo show.",
          "score": 1,
          "created_utc": 1732392333.0,
          "replies": [
            {
              "id": "lymv52p",
              "author": "BJozi",
              "body": "So neither some or Google have announced anything?",
              "score": 0,
              "created_utc": 1732394857.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}