{
  "post": {
    "title": "AMD deploys its first Ultra Ethernet ready network card — Pensando Pollara provides up to 400 Gbps performance | Enabling zettascale AMD-based AI cluster.",
    "author": "chrisdh79",
    "id": "1lad3we",
    "score": 640,
    "created_utc": 1749812712.0,
    "selftext": "",
    "num_comments": 66,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lad3we/amd_deploys_its_first_ultra_ethernet_ready/"
  },
  "comments": [
    {
      "id": "mxknx0p",
      "author": "synthdrunk",
      "body": "Been out of HPC for a while is Ethernet really the interconnect these days?? That’s wild to me.",
      "score": 53,
      "created_utc": 1749826747.0,
      "replies": [
        {
          "id": "mxkyv5m",
          "author": "WolpertingerRumo",
          "body": "Yes. We’re up to cat 8.2, but in essence, it’s still the same. There is fibre, but Copper is still standard.",
          "score": 44,
          "created_utc": 1749829826.0,
          "replies": [
            {
              "id": "mxm3mf5",
              "author": "synthdrunk",
              "body": "What’s done about the latency?",
              "score": 9,
              "created_utc": 1749841446.0,
              "replies": [
                {
                  "id": "mxo1ijy",
                  "author": "CosmicCreeperz",
                  "body": "I think on the NIC, RDMA (remote DMA, basically zero copy where the data goes directly from the wire into application memory with no OS or CPU involvement) is the biggest optimization, and on switches, cut-through switching (ie the switch starts forwarding the frame before it has received the whole thing).\n\nBut I’m sure there are tons of other optimizations…",
                  "score": 14,
                  "created_utc": 1749864302.0,
                  "replies": [
                    {
                      "id": "mxo6wa7",
                      "author": "lunar_bear",
                      "body": "I don’t think it’s cut-through.  But the latency is reduced by replacing TCP with UDP. The RDMA sits atop UDP packets.  But it is still lossless delivery because the switches are essentially doing a kind of QOS to ensure the UDP delivery.  And there are advanced congestion control algorithms at play.  Read about stuff like PFC and ECN.",
                      "score": 11,
                      "created_utc": 1749866200.0,
                      "replies": [
                        {
                          "id": "mxoymgt",
                          "author": "CosmicCreeperz",
                          "body": "Yeah cut-through is for reducing switch latency, not for this NIC.  It’s important for for switches between the hosts.\n\nAnd sure RoCEv2 is over UDP but the main point is the NIC can transfer data directly to app RAM - in these cases even directly to GPU RAM via PCIe without the CPU being involved.",
                          "score": 3,
                          "created_utc": 1749877486.0,
                          "replies": [
                            {
                              "id": "mxozi9j",
                              "author": "lunar_bear",
                              "body": "Yeah, I understand RDMA.  RDMA isn’t new.  What is relatively novel is moving that RDMA off of a point-to-point network like Infiniband, and putting it on a packet switched network like Ethernet.  All things being equal that Infiniband is going to be faster just due to less protocol overhead….or, you know….headers in the frame.  Ethernet also isn’t new.  So with Ultra Ethernet (and to a lesser extent RoCEv2), the question becomes WTF are they doing to the Ethernet frame, and to congestion control, and other mitigations to make it suitably fast and low latency for HPC.   And beyond that…at what point do we just say it’s “good enough” because it’s 40% cheaper than Infiniband?",
                              "score": 4,
                              "created_utc": 1749877929.0,
                              "replies": []
                            },
                            {
                              "id": "mxrzycm",
                              "author": "lunar_bear",
                              "body": "cut-through is largely for fibre channel storage switches.   High speed Ethernet switches are store-and-forward.",
                              "score": 1,
                              "created_utc": 1749924046.0,
                              "replies": [
                                {
                                  "id": "mxxrxgc",
                                  "author": "CosmicCreeperz",
                                  "body": "It’s standard in fiber channel, yeah, but the whole point of why it’s interesting here is it’s now being used more in HS Ethernet switching to reduce latency.  I was answering commenter’s question on that.\n\nIt was actually originally invented for and used in the first Ethernet switches… it’s just more complicated and expensive to implement (and not really usable with mixed rate networks etc where it may need to buffer).  Definitely a resurgence with more recent ultra HS Ethernet though, that’s the point.",
                                  "score": 2,
                                  "created_utc": 1750007560.0,
                                  "replies": [
                                    {
                                      "id": "mxxs9l9",
                                      "author": "lunar_bear",
                                      "body": "Well, my point is, I have several Nvidia SN5600 800GbE switches, their fastest Ethernet switch, and it is store-and-forward.",
                                      "score": 1,
                                      "created_utc": 1750007663.0,
                                      "replies": [
                                        {
                                          "id": "mxxwrvg",
                                          "author": "CosmicCreeperz",
                                          "body": "It certainly supports a cut through mode even if you aren’t using it :)",
                                          "score": 2,
                                          "created_utc": 1750009018.0,
                                          "replies": [
                                            {
                                              "id": "mxxy79f",
                                              "author": "lunar_bear",
                                              "body": "I mean, you may be right, but I’m not seeing how it’s applicable to this convo.  I’m running RoCEv2 on it, followed all the guides, even had the setup eval’d by Nvidia.  There’s nothing involving cut-through.  Not saying it’s impossible, or that it won’t somehow be incorporated in Ultra Ethernet.  As for the real world today, I’m already using the fastest Ethernet products that are generally available, and they are all just using store-and-forward.  That’s why the depth and speed of packet buffers is such a big deal",
                                              "score": 1,
                                              "created_utc": 1750009448.0,
                                              "replies": [
                                                {
                                                  "id": "mxz5dxb",
                                                  "author": "CosmicCreeperz",
                                                  "body": "It’s applicable because the original commenter asked what technologies are being used these days with HS Ethernet to reduce latency, and cut through in switches is a significant technique being used when latency is a priority.\n\nIt’s just a fact, your individual experience is what it is but it doesn’t change that.  You’re the one who jumped in to my general answer to that question with your own anecdotes. “Convo” wasn’t originally about you 🤷‍♂️\n\nAnd, from NVIDIA’s OWN WHITE PAPER on them:\n\n“NVIDIA Spectrum switches operate in a cut-through forwarding mode by default, which offers lower latency compared to store-and-forward switching. Cut-through switching forwards packets as soon as the destination MAC address is read, minimizing delay, but it can lead to forwarding corrupted packets if errors are present. NVIDIA Spectrum switches are designed to handle this by having large, shared buffers that can accommodate traffic bursts and minimize packet loss.”\n\nAlso, a [brief post and config guide](https://enterprise-support.nvidia.com/s/article/switch-forwarding---160---store-and-forward--vs---cut-through-x) on their support portal.  Guess maybe you don’t actually “know everything” about it ;)",
                                                  "score": 1,
                                                  "created_utc": 1750022854.0,
                                                  "replies": [
                                                    {
                                                      "id": "mxz6bvk",
                                                      "author": "lunar_bear",
                                                      "body": "oh come now, I never said I know everything about it.  Just that I use these daily, I configure them myself, and cut-through hasn’t come up at any time in my experience.  oh well, my feelings aren’t hurt.",
                                                      "score": 1,
                                                      "created_utc": 1750023167.0,
                                                      "replies": [
                                                        {
                                                          "id": "mxz797g",
                                                          "author": "CosmicCreeperz",
                                                          "body": "Ok sure, not meaning to hurt anyones’s feelings (and I’m sure you are an expert in this field overall), but I just thought it was pretty obvious why it was “applicable to this convo” that was not actually a one involving you originally ;)",
                                                          "score": 1,
                                                          "created_utc": 1750023479.0,
                                                          "replies": [
                                                            {
                                                              "id": "mxz7gvf",
                                                              "author": "lunar_bear",
                                                              "body": "let’s be friends.  the networking world has room for us both. sorry if I offended you.",
                                                              "score": 1,
                                                              "created_utc": 1750023550.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mxpzntk",
                      "author": "Doppelkammertoaster",
                      "body": "You seem to know this shit: Does it still make a difference if one uses wifi or ethernet cable from the modem to the machine these days?",
                      "score": 0,
                      "created_utc": 1749898689.0,
                      "replies": [
                        {
                          "id": "mxr5rrb",
                          "author": "CosmicCreeperz",
                          "body": "Well… we are talking $2000+ just for these NICs… and like $20k for a switch this speed.  Vastly different from consumer networking.\n\nAt home, Ethernet will always be lower latency and have no chance at interference from other WiFi networks (or your microwave, etc).  But honestly for many people WiFi can have higher total throughput.\n\nI just upgraded my home network - I actually have 10Gb switches now, but currently only 1 computer that can do 10Gbps Ethernet (and a laptop that can do 2.5G with a USB Ethernet adapter… but also a bit under 2Gbps with WiFi).  But my PHONE now gets 1.6Gbps with WiFi.  And those are WiFi 6.  6e/7 devices would be even faster.\n\nIMO for most people the only reason to have multi Gig Ethernet is to connect WiFi 6e/7 mesh APs together in a larger home (since if you want to get multi Gig WiFi speeds the range is limited).",
                          "score": 7,
                          "created_utc": 1749914753.0,
                          "replies": [
                            {
                              "id": "mxrf7zn",
                              "author": "Doppelkammertoaster",
                              "body": "Thank you!",
                              "score": 2,
                              "created_utc": 1749917679.0,
                              "replies": []
                            },
                            {
                              "id": "mxrznef",
                              "author": "lunar_bear",
                              "body": "Nvidia ConnectX-7 NIC is only around $1750 ☺️",
                              "score": 1,
                              "created_utc": 1749923951.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxpzkc2",
              "author": "ioncloud9",
              "body": "I’ve never pulled anything higher than Cat6a. There is little demand to getting more than 10G Ethernet to the workstation over copper. Most things that need PoE can do fine with a slower connection. High end WiFi APs with lots of radios usually have dual ports or one SFP+ port for a fiber connection and a poe port for management and power.",
              "score": 3,
              "created_utc": 1749898638.0,
              "replies": [
                {
                  "id": "mxq5d64",
                  "author": "WolpertingerRumo",
                  "body": "I am currently installing an 8.2, between two switches, and between the switches and servers. That’s the only reason to do it.\n\nThat’s why 8.2 also is optimised for short ranges. You don’t need more.",
                  "score": 2,
                  "created_utc": 1749901461.0,
                  "replies": []
                },
                {
                  "id": "mxs08i7",
                  "author": "lunar_bear",
                  "body": "These are HPC-grade or Telco-grade datacenter networks.   It’s literally for supercomputers.  And not much else.",
                  "score": 1,
                  "created_utc": 1749924135.0,
                  "replies": [
                    {
                      "id": "mxs0sc2",
                      "author": "ioncloud9",
                      "body": "Yeah that’s what I suspected. There are few use cases outside of that. Even in data centers, you’d think fiber would be the preferred option.",
                      "score": 1,
                      "created_utc": 1749924309.0,
                      "replies": [
                        {
                          "id": "mxs1dy1",
                          "author": "lunar_bear",
                          "body": "Dude this can use fiber.  It’s going to use fiber.  That’s just the Layer 1 medium.  Whether it’s Ethernet or Infiniband, both can use either fiber or copper. but as switch density increases, fiber becomes a necessity.  the gauge of copper becomes too thick to manage the cabling in such a way that it doesn’t trap heat and block airflow.",
                          "score": 1,
                          "created_utc": 1749924499.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxq2cc0",
              "author": "mark-haus",
              "body": "It’s incredible to me how much longevity the Ethernet standard has. Obviously it’s evolved a lot, even in the medium used, but the same basic concept holds",
              "score": 3,
              "created_utc": 1749900039.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mxm7ocw",
          "author": "gramathy",
          "body": "Notably Ethernet is just the framing/layer 2 process. You can transmit Ethernet over any medium with a variety of encoding schemes, and connections like this are not twisted pair cable, they are generally either fiber (using either multiple strands or multiple wavelengths in parallel) or directly attached shielded copper (common for in-rack data center connections from 10gbps and higher) that effectively just connect the data lines on one card to the data lines on the other with no other intermediary",
          "score": 9,
          "created_utc": 1749842635.0,
          "replies": [
            {
              "id": "mxnckzi",
              "author": "chrisni66",
              "body": "Great point. It is technically possible to run Ethernet over carrier pidgeon, although the packet loss, latency and jitter is a bit of a problem.",
              "score": 5,
              "created_utc": 1749855422.0,
              "replies": [
                {
                  "id": "mxnih3l",
                  "author": "jaredb",
                  "body": "[RFC 2549](https://www.rfc-editor.org/rfc/rfc2549.html)",
                  "score": 3,
                  "created_utc": 1749857436.0,
                  "replies": [
                    {
                      "id": "mxnl3v9",
                      "author": "chrisni66",
                      "body": "An excellent RFC, but over looks some important points. Like the section on NAT challenges rightly points out the pigeon may eat the NATs, but omits any discussion on the fact that making a Private pidgeon Public negates its ability to find its way back home.\n\nEdit: it’s also not explained how you would train the pigeon to rewrite the IP for the NAT. How would it even hold the pen?",
                      "score": 3,
                      "created_utc": 1749858349.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mxo5m30",
          "author": "lunar_bear",
          "body": "You may wanna read about Slingshot if you’ve been away for a while",
          "score": 2,
          "created_utc": 1749865743.0,
          "replies": []
        },
        {
          "id": "mxnlg40",
          "author": "lynxblaine",
          "body": "Ethernet in its own is not the primary interconnect. Fibre/copper cables may connect the fabrics like Ethernet but it’s infiniband or slingshot. The top three supercomputers use slingshot. Which is a very modified Ethernet network with fabric manager. Current gen is 200GbE next gen is 400GbE.",
          "score": 1,
          "created_utc": 1749858468.0,
          "replies": [
            {
              "id": "mxntu5n",
              "author": "synthdrunk",
              "body": "I'm familiar with infiniband from 'the day, that was my confusion.",
              "score": 1,
              "created_utc": 1749861542.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mxpevp0",
          "author": "paradoxbound",
          "body": "Depends on the cluster and expected work loads but Ethernet is one option. Infiniband and the Intel spin off who's name escapes me is another player.",
          "score": 1,
          "created_utc": 1749886352.0,
          "replies": []
        },
        {
          "id": "my27tmn",
          "author": "IDDQD-IDKFA",
          "body": "Ethernet is a protocol.\n\n\nCopper or fiber are the interconnect types. Both are widely used.\n\n\nIn HPC racks, a lot of it is copper DAC cables internally with fiber uplinks.",
          "score": 0,
          "created_utc": 1750072369.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxjrm68",
      "author": "andygon",
      "body": "Err the name loosely translates to ‘thinking about dicks’, in Spanish lol",
      "score": 88,
      "created_utc": 1749816111.0,
      "replies": [
        {
          "id": "mxkd1k2",
          "author": "santathe1",
          "body": "And if you get their card, you won’t need to just think of them.",
          "score": 22,
          "created_utc": 1749823580.0,
          "replies": []
        },
        {
          "id": "mxl9im0",
          "author": "picardo85",
          "body": "So, you're saying it's made for browsing porn faster? :)",
          "score": 9,
          "created_utc": 1749832879.0,
          "replies": []
        },
        {
          "id": "mxmwny0",
          "author": "CosmicCreeperz",
          "body": "Only an AI cluster can really calculate optimal [tip to tip](https://youtu.be/DzmehB3K4dQ) efficiency.",
          "score": 3,
          "created_utc": 1749850124.0,
          "replies": []
        },
        {
          "id": "mxnv88e",
          "author": "karatekid430",
          "body": "Yeah I was thinking what the hell are they doing",
          "score": 2,
          "created_utc": 1749862052.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxkac8k",
      "author": "Top-Respond-3744",
      "body": "How many 8K movies can it download in a second?",
      "score": 11,
      "created_utc": 1749822736.0,
      "replies": [
        {
          "id": "mxkzwdl",
          "author": "Macho_Chad",
          "body": "0.284, if the movie is 176GB and you’re pulling 50GB/s",
          "score": 10,
          "created_utc": 1749830118.0,
          "replies": [
            {
              "id": "mxkzzoa",
              "author": "Top-Respond-3744",
              "body": "I can wait that long.",
              "score": 4,
              "created_utc": 1749830144.0,
              "replies": [
                {
                  "id": "mxl0cej",
                  "author": "Macho_Chad",
                  "body": "I’m gonna wait another 10 years for better/cheaper hardware so I only have to wait 1 second.",
                  "score": 7,
                  "created_utc": 1749830243.0,
                  "replies": [
                    {
                      "id": "mxl6teq",
                      "author": "Top-Respond-3744",
                      "body": "It was less than 3rd of a second. No?",
                      "score": 2,
                      "created_utc": 1749832101.0,
                      "replies": [
                        {
                          "id": "mxlkskp",
                          "author": "Macho_Chad",
                          "body": "At that rate, you’ll download 0.284 movies per second, so 3 seconds :(",
                          "score": 5,
                          "created_utc": 1749836018.0,
                          "replies": [
                            {
                              "id": "mxlp6mo",
                              "author": "Top-Respond-3744",
                              "body": "Oh. I cannot read apparently.",
                              "score": 3,
                              "created_utc": 1749837264.0,
                              "replies": [
                                {
                                  "id": "mxlpjli",
                                  "author": "Macho_Chad",
                                  "body": "It’s alright fam.",
                                  "score": 1,
                                  "created_utc": 1749837366.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mxo20fu",
              "author": "CosmicCreeperz",
              "body": "As long as you have 200GB of RAM to store it in.  Not writing it to any storage that fast :)",
              "score": 2,
              "created_utc": 1749864478.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mxjmydk",
      "author": "rip1980",
      "body": "Erm, I get it's tweaked for lower latency, but is it cheaper than existing commodity 800gbe flavors?  Because the upto 25% tweaks wouldn't seem to offset the raw speed.",
      "score": 30,
      "created_utc": 1749814177.0,
      "replies": [
        {
          "id": "mxnihss",
          "author": "flickerdown",
          "body": "“Cheaper” is relative in the space this is being used for.  You will spend appreciably more on storage and compute than you will on network.  This becomes a rounding error problem esp if the gain in performance due to UE’s packet ordering, etc achieves better utilization.",
          "score": 9,
          "created_utc": 1749857443.0,
          "replies": [
            {
              "id": "mxrsbcu",
              "author": "tecedu",
              "body": "Ehhh not really, a good storage will set 300k for a cluster. Compute a 128cpu epyc with 640mhz ram is around 20k.\n\nThe networking is about 2* switches so 60k. Nics are around 2.5k a pop, in my small cluster, we have around 12 so 30k. Then comes cables, if you go dac cables it’s cheap enough but still about 5k in cables without that, transceivers would be close to 20k. \n\nSo 110k for network compared to 300k for storage, which is not insignificant.",
              "score": 0,
              "created_utc": 1749921736.0,
              "replies": [
                {
                  "id": "mxry31s",
                  "author": "flickerdown",
                  "body": "I mean, I work for a storage company in this space and I have access to our BoMs. Switching is a negligible cost compared to software licensing for storage, support, compute, and storage medium themselves.  So…yeah.",
                  "score": 1,
                  "created_utc": 1749923470.0,
                  "replies": [
                    {
                      "id": "mxrz659",
                      "author": "tecedu",
                      "body": "I mean yeah when you get into Huge 100+ nodes clusters yes. I got the pricing of the company I work at cluster. Storage I included ddn boxes rough pricing. \n\nFor us everytime we need to purchase a new node its about 12-15% networking price.",
                      "score": 1,
                      "created_utc": 1749923803.0,
                      "replies": [
                        {
                          "id": "mxs19w7",
                          "author": "flickerdown",
                          "body": "Ah DDN.  See, THAT is where you’re overpaying ;)",
                          "score": 1,
                          "created_utc": 1749924463.0,
                          "replies": [
                            {
                              "id": "mxsn0op",
                              "author": "tecedu",
                              "body": "Ah no, I just run a plain nfs on top of block netapp e series. I just wanted ddn for some high tier appliance out of box",
                              "score": 1,
                              "created_utc": 1749931551.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mxtbi1o",
      "author": "farsonic",
      "body": "There are a lot of smarts in these pollara NICs that are purely operating using RoCEv2 offload at this point and Ultra Ethernet in the near future, with a firmware change.\n\nWhen using Pollara RoCEv2 QPs are modified down to the packet level to adjust the source port to the known number of upstream switch uplinks to increase entropy for ECMP hashing, providing packet spraying. Memory pointers are added to each packet as well...this combination allows for retransmission of a single packet always and not larger parts of the flow. \n\nThe approach allows for packet spraying, selective acknowledgement, congestion control and individual packet retransmission and put of order delivery into memory. The smarts here make RoCEv2 sing on standard Ethernet networks that now only require ECN to be configured. \n\nUltra Ethernet builds on this and will be a multi vendor standard for Interop.",
      "score": 2,
      "created_utc": 1749939652.0,
      "replies": []
    },
    {
      "id": "mxwb1xa",
      "author": "Svardskampe",
      "body": "The fastest nvme speeds currently available are 7.5 gbps btw. ",
      "score": 1,
      "created_utc": 1749989408.0,
      "replies": []
    },
    {
      "id": "mxjjyhi",
      "author": "danielv123",
      "body": "Why would one want to use one of these over a Mellanox offering?",
      "score": -7,
      "created_utc": 1749812852.0,
      "replies": [
        {
          "id": "mxjm14i",
          "author": "Ordinary_dude_NOT",
          "body": "It’s in the article, please read it.",
          "score": 8,
          "created_utc": 1749813776.0,
          "replies": [
            {
              "id": "mxk6cf1",
              "author": "French87",
              "body": "Can u just tell us pls",
              "score": -6,
              "created_utc": 1749821429.0,
              "replies": [
                {
                  "id": "mxkc5ix",
                  "author": "Ordinary_dude_NOT",
                  "body": "“AMD claims that its Pollara 400GbE card offers a 10% higher RDMA performance compared to Nvidia's CX7 and 20% higher RDMA performance than Broadcom's Thor2 solution.”\n\n“The Pensando Pollara 400GbE NIC is based on an in-house designed specialized processor with customizable hardware that supports RDMA, adjustable transport protocols, and offloading of communication libraries. “",
                  "score": 10,
                  "created_utc": 1749823304.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mxrshc6",
          "author": "tecedu",
          "body": "Higher price per perf",
          "score": 1,
          "created_utc": 1749921786.0,
          "replies": []
        },
        {
          "id": "mxkdel5",
          "author": "imaginary_num6er",
          "body": "Because it's still better than Intel's card",
          "score": 0,
          "created_utc": 1749823691.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mxrrnu7",
      "author": "None",
      "body": "#WWYUE http://network-security.mil",
      "score": 0,
      "created_utc": 1749921541.0,
      "replies": []
    }
  ]
}