{
  "post": {
    "title": "Microsoft discontinues lackadaisically updated Surface Studio all-in-one desktop",
    "author": "Sariel007",
    "id": "1h9jptf",
    "score": 1614,
    "created_utc": 1733667310.0,
    "selftext": "",
    "num_comments": 265,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1h9jptf/microsoft_discontinues_lackadaisically_updated/"
  },
  "comments": [
    {
      "id": "m116wai",
      "author": "rnilf",
      "body": "People won't buy a product that lacks long-term support and broad appeal ↔ Company won't provide long-term support and broaden the product line because people won't buy it",
      "score": 747,
      "created_utc": 1733667620.0,
      "replies": [
        {
          "id": "m11ll5h",
          "author": "Sariel007",
          "body": "🎶Its the circle of suck🎶",
          "score": 209,
          "created_utc": 1733673014.0,
          "replies": [
            {
              "id": "m11u9m9",
              "author": "Starfox-sf",
              "body": "Cortana?",
              "score": 61,
              "created_utc": 1733675836.0,
              "replies": [
                {
                  "id": "m12j896",
                  "author": "Griffdude13",
                  "body": "Windows Phone?",
                  "score": 43,
                  "created_utc": 1733683636.0,
                  "replies": [
                    {
                      "id": "m12ku2v",
                      "author": "MINKIN2",
                      "body": "Zune.",
                      "score": 33,
                      "created_utc": 1733684127.0,
                      "replies": [
                        {
                          "id": "m12qrhu",
                          "author": "Moon_stares_at_earth",
                          "body": "Kinect, Lumia Phones, SPOT Watches, Microsoft Roundtable, MSN TV/Web TV, Skype, Internet Explorer, Windows NetMeeting, more are coming.",
                          "score": 33,
                          "created_utc": 1733685950.0,
                          "replies": [
                            {
                              "id": "m12tbu4",
                              "author": "1sttimeverbaldiarrhe",
                              "body": "Does anyone remember their Surface meeting table that could play a special version of Settlers of Cataan? I remember drooling over that. \n\nhttps://www.youtube.com/watch?v=6fVL6GOCGi8",
                              "score": 22,
                              "created_utc": 1733686746.0,
                              "replies": [
                                {
                                  "id": "m15w767",
                                  "author": "ThePowerOfStories",
                                  "body": "The best was this version of the original ad for it, but with a parody voiceover: https://youtu.be/CZrr7AZ9nCY\n\n“The future is here, and it’s a big-ass table.”\n\n(Also, holy hell, that was seventeen years ago, the same year the first iPhone came out, how do I have brain cells dedicated to remembering particular YouTube videos that made me snicker back then?)",
                                  "score": 2,
                                  "created_utc": 1733729979.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m16g7gt",
                              "author": "thejoeblack",
                              "body": "Don't forget Microsoft Band, those smartwatches were way ahead of their time. I still have my Band 2 and works (+10 years old)",
                              "score": 4,
                              "created_utc": 1733743646.0,
                              "replies": []
                            },
                            {
                              "id": "m12wskk",
                              "author": "sillypicture",
                              "body": "Man Lumia had potential.",
                              "score": 9,
                              "created_utc": 1733687830.0,
                              "replies": [
                                {
                                  "id": "m160nlk",
                                  "author": "ralphonsob",
                                  "body": "And after they went to the trouble of [planting their man at Nokia to destroy it from the inside](https://en.wikipedia.org/wiki/Stephen_Elop#CEO_of_Nokia) in order to get the tech. Unbelievable evil and astonishing incompetence.",
                                  "score": 7,
                                  "created_utc": 1733732988.0,
                                  "replies": [
                                    {
                                      "id": "m16kgho",
                                      "author": "sillypicture",
                                      "body": "Man. Nokia also had so much potential.",
                                      "score": 3,
                                      "created_utc": 1733746080.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m12tzd6",
                              "author": "thumpertastic",
                              "body": "My adult sons are still scarred by their Lumia phone experiences from their childhood.  Spotify did not play well with that os.",
                              "score": 4,
                              "created_utc": 1733686952.0,
                              "replies": [
                                {
                                  "id": "m12v0tv",
                                  "author": "Griffdude13",
                                  "body": "I had a Lumia 1020, and I loved that thing. The 41 megapixel camera was ahead of its time. Once again, great ideas, poor execution",
                                  "score": 16,
                                  "created_utc": 1733687278.0,
                                  "replies": []
                                },
                                {
                                  "id": "m14s4di",
                                  "author": "thanatossassin",
                                  "body": "Spotify worked fine, but Zune Music Pass was a tremendously better value. Unlimited, no ads music streaming like Spotify, plus 15 DRM-free song downloads per month. I have no idea how Microsoft made any money off of that service.",
                                  "score": 5,
                                  "created_utc": 1733711107.0,
                                  "replies": [
                                    {
                                      "id": "m15sl38",
                                      "author": "TechGoat",
                                      "body": ">I have no idea how Microsoft made any money off of that service. \n\nOh I bet we all can guess their goal\n\n(hint: the phrase Loss Leader)",
                                      "score": 4,
                                      "created_utc": 1733727689.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m1c10gv",
                                  "author": "got-trunks",
                                  "body": "\\*Sobs in HTC Touch Diamond\\*\n\nActually was not a bad phone when I first got it, it just cost me an arm and a leg as a fresh highschool grad lol... Cause it was sold along side a 1GB data plan... I think it was like $170-180 CAD/m for me hahaha. Still the best phone in the friend group, it's too bad it didn't have a proper headphone output.",
                                  "score": 1,
                                  "created_utc": 1733821087.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m16fp8r",
                              "author": "nagi603",
                              "body": "If there was a realistic alternative, Windows and Office would also join this list post-haste. (see also: windows 10 is the last version!)",
                              "score": 0,
                              "created_utc": 1733743332.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m18kvr3",
                          "author": "Forrest319",
                          "body": "Zune was great and the story of why it was discontinuted it interesting. It was growing, highly profitable, and bringing in hundreds of millions of dollars of revenue for Microsoft. But Ballmer cut every business unit that wasn't making billions of dollars. Hundreds of millions wasn't big enough for MS.",
                          "score": 1,
                          "created_utc": 1733771541.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m140c8z",
                  "author": "stackjr",
                  "body": "What in the fuck is the point of Cortana?! Does anyone actually enable that \"feature\"?",
                  "score": 5,
                  "created_utc": 1733700871.0,
                  "replies": [
                    {
                      "id": "m15wf11",
                      "author": "KrawhithamNZ",
                      "body": "It's Clippy 2.0",
                      "score": 8,
                      "created_utc": 1733730123.0,
                      "replies": []
                    },
                    {
                      "id": "m15v7c0",
                      "author": "OtakuAttacku",
                      "body": "It’s just microsoft’s answer to Siri. But no one uses a voice assistant on a computer, that’s if their desktop even came with a microphone. They killed Windows Phone so Cortana just kinda exists. It’s cool they got Jen Taylor tho.",
                      "score": 5,
                      "created_utc": 1733729331.0,
                      "replies": [
                        {
                          "id": "m16nwvn",
                          "author": "OptimalMain",
                          "body": "All laptops has built in microphones though.  Great excuse to always be listening",
                          "score": 1,
                          "created_utc": 1733747857.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m18l23z",
                      "author": "Forrest319",
                      "body": "It's a timer app. Just like siri, google assistant, and alexa.",
                      "score": 2,
                      "created_utc": 1733771596.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m12brd1",
              "author": "blackmagic999",
              "body": "#Look Simba, everything the light touches is our kingdom. \n\n(Gestures to warehouses full of unsold surface studio all-in-ones)",
              "score": 17,
              "created_utc": 1733681364.0,
              "replies": []
            },
            {
              "id": "m12zqwa",
              "author": "None",
              "body": "[removed]",
              "score": 16,
              "created_utc": 1733688761.0,
              "replies": [
                {
                  "id": "m16bo1b",
                  "author": "PoorMansTonyStark",
                  "body": "Yep, MS always pulls of stunts like this. Hence I refuse to buy anything they make.",
                  "score": 1,
                  "created_utc": 1733740731.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m12sqek",
          "author": "Mr-EdwardsBeard",
          "body": "Yup. Only so many times I can get burned by MS-Zune, Windows Phone, Surface RT (and Windows 8), Xbox One + Kinect (still was great when it worked,) Surface Book hot bags and now no progression past 10, etc etc. in the Apple camp now. It’s boring but well supported.\n\nEdit: and the Band. Forgot about that one. It’s in a drawer full of other MS stuff I have",
          "score": 20,
          "created_utc": 1733686561.0,
          "replies": [
            {
              "id": "m12uftm",
              "author": "tiroc12",
              "body": "You also didn't mention that Microsoft is very actively trying to drop support for the Xbox. Their new \"Everything is an Xbox \" campaign basically says, \"We no longer want to support Xbox hardware, so buy a game pass and stop buying Xbox consoles.\" What they don't say in that campaign is that no other devices support your current Xbox library. So lose all of your games so you can play Xbox games pass games on your phone for a subscription. Screw you and what you have already paid for",
              "score": 23,
              "created_utc": 1733687096.0,
              "replies": [
                {
                  "id": "m12wogz",
                  "author": "Mr-EdwardsBeard",
                  "body": "Ugh. Did not know this (as I’m playing my Xbox)",
                  "score": 6,
                  "created_utc": 1733687795.0,
                  "replies": [
                    {
                      "id": "m13jujb",
                      "author": "AshIsGroovy",
                      "body": "Yep, PC gaming has been making huge gains as the cost to build a decent gaming system has, in some cases, gotten cheaper than buying a console. Something like 95% of PC gaming is done on Microsoft. Xbox One was a sales disappointment for Microsoft, and in all reality, if the 360 wasn't the massive hit it turned into, Microsoft would have already killed it off years ago. Even the most recent generation of Xbox has underperformed and why the talk of killing Xbox off is being floated again. Hell, even talk like this hurts a brand because of the history of Microsoft has concerning products. Why buy another Xbox is Microsoft is just going to kill it in a year or two.",
                      "score": 12,
                      "created_utc": 1733695172.0,
                      "replies": [
                        {
                          "id": "m161hkx",
                          "author": "_Lucille_",
                          "body": "That used to be more true, but given how expensive GPUs have gotten, it is likely not going to be cost effective to beat the next round of consoles when they get released.",
                          "score": 3,
                          "created_utc": 1733733575.0,
                          "replies": [
                            {
                              "id": "m16xqam",
                              "author": "Jon_TWR",
                              "body": "It’s rarely cost effective to build a PC that can outperform a newly released console, but a CPU/GPU generation or two into its lifecycle, the math changes.",
                              "score": 0,
                              "created_utc": 1733752160.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m12ww8u",
              "author": "sillypicture",
              "body": "And yet they still don't want to drop their browser.",
              "score": 3,
              "created_utc": 1733687862.0,
              "replies": []
            },
            {
              "id": "m16br0h",
              "author": "tankpuss",
              "body": "You missed Windows CE.",
              "score": 1,
              "created_utc": 1733740786.0,
              "replies": [
                {
                  "id": "m18frzc",
                  "author": "Mr-EdwardsBeard",
                  "body": "So many",
                  "score": 1,
                  "created_utc": 1733769970.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m126hbs",
          "author": "hi_internet_friend",
          "body": "I suppose this is a \"water is wet\" type comment, but I believe companies should always be up front about length of support and then follow through. Erodes trust otherwise and makes people not buy from the company again",
          "score": 23,
          "created_utc": 1733679722.0,
          "replies": [
            {
              "id": "m12f0g2",
              "author": "Voidtalon",
              "body": "I feel like Sony and Microsoft are learning this in the video game space. Trust in a console to delivery quality games that respect players time is dead.\n\nFor the love of god Sony had like what, 12 Live-Service games in development at once? 5-6 released, one of which was Concord?",
              "score": 10,
              "created_utc": 1733682365.0,
              "replies": [
                {
                  "id": "m12mn49",
                  "author": "Dependent-Zebra-4357",
                  "body": "Were 5-6 actually released? The only one (besides Concord) that comes immediately to mind is Helldivers 2.",
                  "score": 5,
                  "created_utc": 1733684681.0,
                  "replies": [
                    {
                      "id": "m12q8ix",
                      "author": "Voidtalon",
                      "body": "I honestly don't remember. I'm not deep-dived on it only passively aware of how much is being wasted on live services in hopes of capturing the next Fortnight money printer.",
                      "score": 1,
                      "created_utc": 1733685786.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m12l0le",
          "author": "TomfromLondon",
          "body": "Have they dropped support or just no longer making them?",
          "score": 6,
          "created_utc": 1733684182.0,
          "replies": [
            {
              "id": "m16vtkk",
              "author": "GasolinePizza",
              "body": "They're just no longer making them.",
              "score": 1,
              "created_utc": 1733751384.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m12cvb6",
          "author": "omega552003",
          "body": "It's also very expensive for what it provides.",
          "score": 2,
          "created_utc": 1733681710.0,
          "replies": []
        },
        {
          "id": "m14223m",
          "author": "TheNorthComesWithMe",
          "body": "Not releasing new products in a product line and not supporting products are completely different things.",
          "score": 2,
          "created_utc": 1733701482.0,
          "replies": []
        },
        {
          "id": "m11pkzq",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1733674324.0,
          "replies": [
            {
              "id": "m13f655",
              "author": "Aleyla",
              "body": "No, it really isn’t.  Not when you have an established history of abandoning projects.  That tells people you have no staying power.  And a whole lot of people don’t like replacing shit just because some suit decides they have made enough money and want to move on.",
              "score": 2,
              "created_utc": 1733693638.0,
              "replies": [
                {
                  "id": "m13fu4r",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1733693855.0,
                  "replies": [
                    {
                      "id": "m13h40e",
                      "author": "Aleyla",
                      "body": "Yes. Do you?   \n    \nIf MS wants people to buy their shit then they need to commit to supporting it.   Long term support should not require a certain level of sales.  Making it dependent on that is short term thinking and directly leads to the situation of a consumer market having no faith in the products.    \n   \nEvery hardware vendor knows this.  Apple built a fantastic hardware business by standing by their products *long term*, regardless of the immediate income.   \n   \nInstead of following that model, MS follows the model of over promising and pulling out as soon as there is a dip.    This ends of making it harder and harder for them to succeed and likely has directly leads to a ton of different product failures.",
                      "score": 5,
                      "created_utc": 1733694267.0,
                      "replies": []
                    },
                    {
                      "id": "m13t4a5",
                      "author": "kevin7eos",
                      "body": "Joseph Heller originally wanted to call his book “Catch-18” before settling on “Catch-22” due to a pre-existing novel titled “Mila 18” that was popular at the time; the number “22” was chosen more for its sound than any specific meaning",
                      "score": 1,
                      "created_utc": 1733698299.0,
                      "replies": [
                        {
                          "id": "m13v4xa",
                          "author": "shogun77777777",
                          "body": "Interesting, but That’s not relevant in this context",
                          "score": 1,
                          "created_utc": 1733699008.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1171o4",
      "author": "void_const",
      "body": "Microsoft doesn’t finish anything they start.",
      "score": 343,
      "created_utc": 1733667681.0,
      "replies": [
        {
          "id": "m11am3k",
          "author": "AshIsGroovy",
          "body": "Right! At a point Microsoft having a long history of not supporting their products or discontinuing them shortly after launch keeps people from buying the products from the get go. Microsoft can and does make good stuff but the fact they don't believe in their own products isn't a great way to sell things. I keep hoping that one day we get an android version of the ipad mini. That tablet is a great size perfect for reading but even Google can't seem to make a decent tablet instead they do a weird hybrid home system with a base. Jesus just give me a moderately priced tablet that has access to the google play store.",
          "score": 93,
          "created_utc": 1733669095.0,
          "replies": [
            {
              "id": "m11cqo1",
              "author": "LoudAndCuddly",
              "body": "Google is guilty of this as well",
              "score": 78,
              "created_utc": 1733669898.0,
              "replies": [
                {
                  "id": "m11f3vk",
                  "author": "void_const",
                  "body": "Yep. Android phones are end-of-life after just three years. And they actually have the balls to brag about how they believe in “sustainability”. \n\nhttps://sustainability.google",
                  "score": 41,
                  "created_utc": 1733670758.0,
                  "replies": [
                    {
                      "id": "m11gyc0",
                      "author": "BellerophonM",
                      "body": "They pushed it to 5 years of system updates with the Pixel 6 and then 7 years with the Pixel 8, so they're improving, at least.",
                      "score": 44,
                      "created_utc": 1733671418.0,
                      "replies": [
                        {
                          "id": "m12lrit",
                          "author": "Askymojo",
                          "body": "Considering how unusably slow Android updates have made Pixel phones after just 3 years or so in the past, I have a hard time believing people will still be able to use their 7 year old Pixel phone if they are still pushing new Android versions onto it.  Hopefully they just mean security updates and that's it.",
                          "score": -4,
                          "created_utc": 1733684410.0,
                          "replies": [
                            {
                              "id": "m16a2tp",
                              "author": "rolfraikou",
                              "body": "As someone who still owns a functioning pixel 1 that I used the crap out of, as a phone, until I finally upgraded the phone, but have kept using the pixel 1 as a dedicated emulation device, and passed down my pixel 3a to a room mate that had no issue using it, I gotta say, that's, for some reason, not the experience that everyone has with these devices.",
                              "score": 8,
                              "created_utc": 1733739646.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m11vyte",
                          "author": "kidno",
                          "body": "Honestly at this point it’s more lip service because phones are matured now and Google wants to do things in the cloud anyway.  So supporting multiple years of OS updates now doesn’t mean what it did 3 years ago.",
                          "score": -8,
                          "created_utc": 1733676377.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m11pjmr",
                      "author": "LaTienenAdentro",
                      "body": "This is just false if you refer to Android as an operating system and not just \"Google phones\" \n \nYes the device won't be top of the line anymore but you can definitely use it for years on end with good functionality and battery life as long as its well maintained in terms of battery and physical health.",
                      "score": 9,
                      "created_utc": 1733674312.0,
                      "replies": []
                    },
                    {
                      "id": "m11fun1",
                      "author": "clgoh",
                      "body": "7 years for Google phones.",
                      "score": 18,
                      "created_utc": 1733671023.0,
                      "replies": [
                        {
                          "id": "m11gdi8",
                          "author": "void_const",
                          "body": "Just got rid of a Pixel 5. Released in 2020, discontinued in 2023.",
                          "score": 18,
                          "created_utc": 1733671210.0,
                          "replies": [
                            {
                              "id": "m11kip7",
                              "author": "proanimus",
                              "body": "Yeah, in my opinion it doesn’t count until the phone *actually* gets all those updates. Not just promises for the future.",
                              "score": 15,
                              "created_utc": 1733672656.0,
                              "replies": [
                                {
                                  "id": "m11x5p3",
                                  "author": "clgoh",
                                  "body": "They never gave less than promised, anyone's more. And they just added more years of support than promised to the Pixel 6 and 7.",
                                  "score": 7,
                                  "created_utc": 1733676753.0,
                                  "replies": [
                                    {
                                      "id": "m16nvlt",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 1,
                                      "created_utc": 1733747840.0,
                                      "replies": [
                                        {
                                          "id": "m172oh2",
                                          "author": "clgoh",
                                          "body": "False. Pixel 5 and earlier still have unlimited storage. It was changed for new buyers of Pixel 6.",
                                          "score": 1,
                                          "created_utc": 1733754103.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m11wpxq",
                              "author": "clgoh",
                              "body": "They just retroactively added 2 more years to the Pixel 6 & 7.",
                              "score": 7,
                              "created_utc": 1733676615.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m13021p",
                      "author": "funforgiven",
                      "body": "How are you expecting them to support Android devices owned by other companies? They are already providing 7 years of updates for their own phones.",
                      "score": 0,
                      "created_utc": 1733688860.0,
                      "replies": [
                        {
                          "id": "m15j4my",
                          "author": "alvenestthol",
                          "body": "Not to mention Google can push partial functionality and security updates to older Android versions through Google Play Services, with almost 10 years of additional support; Google Wallet also supports 6-7 year old Android versions.\n\nFor comparison, the last 3G-only Samsung Galaxy phone is the Galaxy S4 (2013), but 3G networks started shutting down in 2022, giving it a 9-year lifespan as a mobile phone; and the first 3G iPhone was in 2008, with a lifespan of 14 years.",
                          "score": 3,
                          "created_utc": 1733722418.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m18jzus",
                      "author": "GoneSuddenly",
                      "body": "They don't make android phone, why would they support it?  They make pixel phone.",
                      "score": 0,
                      "created_utc": 1733771266.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m12fjsk",
                  "author": "ArtOfWarfare",
                  "body": "Google is the definition of abandonware.\n\nMicrosoft actually couldn’t be further from that. They’re probably second only to IBM in supporting absurdly outdated stuff, as long as they’re paid for that support.\n\nJust consider how long they supported XP or IE. I can’t think of other software where the masses had left it decades prior and it was still receiving critical patches.",
                  "score": 13,
                  "created_utc": 1733682527.0,
                  "replies": [
                    {
                      "id": "m12tyz9",
                      "author": "LoudAndCuddly",
                      "body": "Which was kind of my point",
                      "score": 0,
                      "created_utc": 1733686949.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m13dlsy",
              "author": "Plank_With_A_Nail_In",
              "body": "Can you give one other example of a product Microsoft gave up supporting quickly. As far as I can see MS only makes the surface line, the XBOX and some keyboards what are these other products?\n\nMS sold Zune's for 6 years.",
              "score": 4,
              "created_utc": 1733693134.0,
              "replies": [
                {
                  "id": "m13hyb7",
                  "author": "AshIsGroovy",
                  "body": "The Band only lived for two years; Lumia Smartphones made it three years, and Zune and Groove made it the longest with six years. However, with all these examples of hardware, Microsoft had very little support backing them out the gate or, in some cases, released them half-baked, and by the time they were fully cooked, they were cut. Even Xbox has been on the chopping block as recently as the current gen, as with the Xbox One underperforming, there was talk of exiting the market. It was talked about after the Xbox, and if the 360 hadn't been the hit it was, Microsoft would have killed it then. They have the money, resources, and talent but never want to give the products time to grow or be found by the consumer. I've been a big pixel fan since the OG, and Google took its time and learned from each generation. Imagine if they had just given up after the first or second gen.",
                  "score": 5,
                  "created_utc": 1733694543.0,
                  "replies": [
                    {
                      "id": "m14c4si",
                      "author": "squish8294",
                      "body": "Google did give up. Remember the Nexus?",
                      "score": 1,
                      "created_utc": 1733705094.0,
                      "replies": [
                        {
                          "id": "m14ib3h",
                          "author": "AshIsGroovy",
                          "body": "> Nexus\n\nI'd argue that Pixel is just the natural evolution of the Nexus line. Nexus was built by third-party companies under a license, while Pixel is built by Google.",
                          "score": 4,
                          "created_utc": 1733707391.0,
                          "replies": [
                            {
                              "id": "m14wvyp",
                              "author": "squish8294",
                              "body": "https://en.wikipedia.org/wiki/Google_Nexus#Phones\n\nGoogle managed the design, development, marketing, and support of these devices, but some development and all manufacturing were carried out by partnering with original equipment manufacturers (OEMs).\n\n^ from the wikipedia article\n\nDesigned, most of the development, support from Google. Some development, and the manufacture of, from OEM's.\n\nGoogle had a product line and gave up on it after 6 years. Google has a long history of killing products and shouldn't be in the same sentence as Microsoft. https://killedbygoogle.com/",
                              "score": 2,
                              "created_utc": 1733712941.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m16e8ty",
                  "author": "None",
                  "body": "Surface Duo, released in 2020 and abandoned in 2023.",
                  "score": 1,
                  "created_utc": 1733742416.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m149edn",
              "author": "gagreel",
              "body": "This is nothing compared to Wacom's dismal support",
              "score": 2,
              "created_utc": 1733704118.0,
              "replies": []
            },
            {
              "id": "m149ivu",
              "author": "None",
              "body": "[removed]",
              "score": 1,
              "created_utc": 1733704161.0,
              "replies": [
                {
                  "id": "m14jkrp",
                  "author": "AshIsGroovy",
                  "body": "Everything you are pointing to is software, which, granted, is their bread and butter, but IE became Edge, and Bing was the result of Microsoft trying to get into the ad space with their own search engine. Office and Windows are the backbone of Microsoft. Copilot replaced Cortona but Cortona only got worse till it was replaced as Microsoft yet again pulled resources and basically stopped support.",
                  "score": 1,
                  "created_utc": 1733707872.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m11d0u3",
              "author": "BytchYouThought",
              "body": "I don't really have a need personally for a tablet, but if you don't want an iPad then I hear Samsung has been stepping up a lot more in recent years and has dex and what not.",
              "score": -2,
              "created_utc": 1733670004.0,
              "replies": [
                {
                  "id": "m11hb74",
                  "author": "r_sarvas",
                  "body": "I've actually gone the Chromebook route for tablets lately. My use case is mostly reading, watching videos, and occasional casual games installed via Google Play store.\n\nFor anything more complicated, I have desktops and servers - nothing running a Microsoft OS.",
                  "score": 0,
                  "created_utc": 1733671543.0,
                  "replies": [
                    {
                      "id": "m11t6mh",
                      "author": "void_const",
                      "body": "Google is basically spyware though",
                      "score": 0,
                      "created_utc": 1733675486.0,
                      "replies": [
                        {
                          "id": "m11vjhe",
                          "author": "r_sarvas",
                          "body": "You are not entirely wrong about that. This is why I host my own services and block traffic at the network level.",
                          "score": 3,
                          "created_utc": 1733676241.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m11bfqv",
          "author": "jmo1",
          "body": "I mean to be fair the surface studio has been going for 8 years. It’s fun to give m$ft shit but at the end of the day if no one is buying these and it costs them a lot it makes sense to not keep them going",
          "score": 29,
          "created_utc": 1733669408.0,
          "replies": [
            {
              "id": "m11d7o8",
              "author": "MontyDyson",
              "body": "8 years is hardly a badge of honour. The iMac which is close enough to this and has been going strong for 26 years because Apple properly updated it every 3-4 years.",
              "score": -8,
              "created_utc": 1733670074.0,
              "replies": [
                {
                  "id": "m11ytav",
                  "author": "jmo1",
                  "body": "I’m not saying it’s a badge of honor, I’m saying it’s enough time for a product to bleed money and decide to can it",
                  "score": 9,
                  "created_utc": 1733677285.0,
                  "replies": [
                    {
                      "id": "m141i67",
                      "author": "VoodooMamaJuuju",
                      "body": "People forget that these companies are not running a charity.  It's a business.  No money then no more product.",
                      "score": 2,
                      "created_utc": 1733701288.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m11du4g",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1733670303.0,
                  "replies": [
                    {
                      "id": "m11eme7",
                      "author": "MontyDyson",
                      "body": "It’s a desktop computer with a large screen. The drawing factor is the reason why it failed. It’s a product no one asked for or wanted. It being something “architects used to have” 30 years ago is why it’s even dafter. Apple sells most of its desktops and laptops to businesses, if you think it’s because they want to be “fashionable” then I have a bridge to sell you.",
                      "score": 2,
                      "created_utc": 1733670586.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m11eyn9",
          "author": "jonathanrdt",
          "body": "Azure is cooking just fine, along with dozens of other major business units. They don’t continue the things that don’t make money…just like every other company.",
          "score": 12,
          "created_utc": 1733670706.0,
          "replies": [
            {
              "id": "m11l67f",
              "author": "Initial_E",
              "body": "If anything Microsoft supports shit much longer than anyone thought they would. Well, used to. Nowadays the product support cycle is much tighter.",
              "score": 6,
              "created_utc": 1733672877.0,
              "replies": []
            },
            {
              "id": "m12m4ee",
              "author": "MINKIN2",
              "body": "Azure and Office are the only things that I can appreciate from them,  and I will still argue the advantages of office over all other alternatives. Sheets ain't got anything on Excel.",
              "score": 1,
              "created_utc": 1733684521.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m12mwbf",
          "author": "Soaddk",
          "body": "Zune remembers",
          "score": 3,
          "created_utc": 1733684759.0,
          "replies": []
        },
        {
          "id": "m145p7q",
          "author": "ImpossibleClothes892",
          "body": "I feel the same with Google. They start all these projects to either disrupt and gain a chunk of a market, sometimes with some pretty compelling features. Some of them succeed like the Google office suite (Google Docs, Slides, Gmail, etc) or Google Pixel, but a lot of them start off strong only to  whimper out like Chromecast, Stadia, Google +, or Google Glass.",
          "score": 3,
          "created_utc": 1733702797.0,
          "replies": []
        },
        {
          "id": "m1av62h",
          "author": "_AARAYAN_",
          "body": "Google has same problem. Google glass, modular phones, stadia, daydream vr all closed. Their netbooks, chrome os, nexus phones, tablets are all dead too. \nMicrosoft and google tried hard to become Apple but always failed",
          "score": 3,
          "created_utc": 1733799397.0,
          "replies": []
        },
        {
          "id": "m11gdxn",
          "author": "narwhal_breeder",
          "body": "Starts a product line, doesn’t immediately succeed, cancels product line.",
          "score": 8,
          "created_utc": 1733671215.0,
          "replies": [
            {
              "id": "m11wvl5",
              "author": "trowayit",
              "body": "It's been available for *years*.  First model was released in like 2016.",
              "score": 22,
              "created_utc": 1733676665.0,
              "replies": [
                {
                  "id": "m1211sx",
                  "author": "hedoeswhathewants",
                  "body": "I'm surprised it stuck around this long. The market for it is tiny and it's quite expensive.",
                  "score": 1,
                  "created_utc": 1733677999.0,
                  "replies": [
                    {
                      "id": "m121g0k",
                      "author": "trowayit",
                      "body": "Price is the biggest issue imo.  I bought a refurb studio 2 (not 2+) with 16gb and have been using it as my primary machine for creating 2d game art.  Works great for that and was cheaper than buying a new Wacom screen (which requires a PC connected).   Iirc, the refurb studio was $1800 and a new Wacom is around $2400.  Sure it loads up krita or affinity slower than my 14700k/64gb/rtx3080, but it does what it's advertised to do and I've been quite happy with it.  Now for $4500???  Nope, I'd get a Wacom.",
                      "score": 3,
                      "created_utc": 1733678124.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m11gxct",
          "author": "Kurren123",
          "body": "Windows forms is still supported…",
          "score": 2,
          "created_utc": 1733671408.0,
          "replies": []
        },
        {
          "id": "m11uscn",
          "author": "disneycorp",
          "body": "They are trying to finish the Xbox",
          "score": 1,
          "created_utc": 1733676005.0,
          "replies": []
        },
        {
          "id": "m14ib27",
          "author": "milky_mouse",
          "body": "You mean the finish (kill) what they start 🤣",
          "score": 1,
          "created_utc": 1733707391.0,
          "replies": []
        },
        {
          "id": "m15tts3",
          "author": "endermanbeingdry",
          "body": "Is that the reason behind their browser’s name?",
          "score": 1,
          "created_utc": 1733728459.0,
          "replies": []
        },
        {
          "id": "m1cwwm2",
          "author": "captainpott",
          "body": "Crying into my Surface Duo right now",
          "score": 1,
          "created_utc": 1733838911.0,
          "replies": []
        },
        {
          "id": "m11kwjy",
          "author": "Initial_E",
          "body": "Sure, nobody ever bought an Xbox.",
          "score": 1,
          "created_utc": 1733672788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m11acgd",
      "author": "gnmpolicemata",
      "body": "Didn't they promise a standalone Surface Studio display a long time ago? I guess that never came to be..",
      "score": 56,
      "created_utc": 1733668993.0,
      "replies": [
        {
          "id": "m12zpv0",
          "author": "Statsmakten",
          "body": "That’s all we ever wanted",
          "score": 21,
          "created_utc": 1733688752.0,
          "replies": []
        },
        {
          "id": "m13ytmy",
          "author": "Wixred",
          "body": "They never promised that. Tech commentators just begged for it.",
          "score": 9,
          "created_utc": 1733700328.0,
          "replies": []
        },
        {
          "id": "m12xqc6",
          "author": "Fedoraus",
          "body": "I'd be soooo into that if they did it. I don't want to be locked into all in one specs and formfactor",
          "score": 3,
          "created_utc": 1733688126.0,
          "replies": [
            {
              "id": "m13scza",
              "author": "gnmpolicemata",
              "body": "It could've been so good if you weren't so limited hardware wise",
              "score": 2,
              "created_utc": 1733698039.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m12yv9c",
      "author": "nohpex",
      "body": "TIL I've been mispronouncing \"lackadaisical.\"\n\nI'm glad I learned a new thing, but I'm pretty disappointed in myself.",
      "score": 21,
      "created_utc": 1733688486.0,
      "replies": [
        {
          "id": "m14wr00",
          "author": "grumd",
          "body": "TIL this word exists. How did you mispronounce it?",
          "score": 9,
          "created_utc": 1733712887.0,
          "replies": [
            {
              "id": "m15746p",
              "author": "lunaflect",
              "body": "Probably “laxadaisical”",
              "score": 3,
              "created_utc": 1733716968.0,
              "replies": [
                {
                  "id": "m180f8g",
                  "author": "nohpex",
                  "body": "Yup!\n\nI've never heard it any other way, and I don't think I've ever seen it spelled out either.",
                  "score": 2,
                  "created_utc": 1733765260.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m11dzgr",
      "author": "EfficientAccident418",
      "body": "$4300 for a Windows PC? Someone tell them that even Apple starts its all-in-ones at less than half that",
      "score": 84,
      "created_utc": 1733670355.0,
      "replies": [
        {
          "id": "m13f4ag",
          "author": "jl2352",
          "body": "It’s the screen. The moment you use a non-standard screen, it gets very expensive. The Surface has two of them side by side.",
          "score": 36,
          "created_utc": 1733693621.0,
          "replies": [
            {
              "id": "m143cs1",
              "author": "GregLittlefield",
              "body": "Maybe, but it's a stupid idea. They priced that product out of the market. What was the point?",
              "score": 9,
              "created_utc": 1733701948.0,
              "replies": [
                {
                  "id": "m14591j",
                  "author": "jl2352",
                  "body": "I have one. Having a machine that was one giant screen was fucking awesome.\n\nIt was also a show piece. It was not designed to take on the iMac and have loads sold. I saw one recently in an upmarket store for homes, and that’s the type of place you also saw them used.",
                  "score": 19,
                  "created_utc": 1733702633.0,
                  "replies": [
                    {
                      "id": "m146kq3",
                      "author": "GregLittlefield",
                      "body": "Even as a PR stunt it was terrible. That pricepoint was just laughable. Apple can afford to release a product at that price and that won't hurt them in anyway. MS is not Apple. \n\nIt could have been interesting if it was a product they kept supporting and introduced a whole new 'premium' line of products updated every couple years. But no, it was just a one off. It's nice that it existed, but that was just weird..",
                      "score": 3,
                      "created_utc": 1733703111.0,
                      "replies": []
                    },
                    {
                      "id": "m14wdzl",
                      "author": "greenandseven",
                      "body": "You bought a 2K Apple studio display for a $800 M1 Mac mini. \n\nNo regretssss",
                      "score": 0,
                      "created_utc": 1733712745.0,
                      "replies": [
                        {
                          "id": "m160xfb",
                          "author": "jl2352",
                          "body": "I bought it about six years ago. The M1 Mac Mini and the Apple Studio display did not exist.",
                          "score": 1,
                          "created_utc": 1733733179.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m15qoo7",
                      "author": "datumerrata",
                      "body": "Why is it cool? A small computer like a Nuc lends to being more easily replaced, repaired, and upgraded. You could mount it to the underside of a desk, if you wanted.",
                      "score": 0,
                      "created_utc": 1733726576.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m13l7yz",
          "author": "ChunkStumpmon",
          "body": "We have one of these where I work - it broke and got replaced- absolute shite.",
          "score": 7,
          "created_utc": 1733695628.0,
          "replies": []
        },
        {
          "id": "m16unh5",
          "author": "ArriePotter",
          "body": "The most frustrating aspect of this is how amazing the product would be if it were just sold as a giant Walcom-style monitor with support for accessories. I have aac and even with limited software support I would buy that",
          "score": 1,
          "created_utc": 1733750898.0,
          "replies": []
        },
        {
          "id": "m13e18k",
          "author": "Plank_With_A_Nail_In",
          "body": "If you don't like the price don't buy it. Not ever product is aimed at you and you don't have to buy every new thing that is made.",
          "score": -8,
          "created_utc": 1733693274.0,
          "replies": [
            {
              "id": "m13eb4z",
              "author": "EfficientAccident418",
              "body": "I can’t buy it anymore because it’s discontinued. And apparently no one else bought it either.",
              "score": 7,
              "created_utc": 1733693364.0,
              "replies": [
                {
                  "id": "m13hx9t",
                  "author": "patelbadboy2006",
                  "body": "I had one, so someone did buy it.\n\nThe MS one is touchscreen and more for creative designs and work, then using it as a pc.\n\n\nIts nice but not for everyone",
                  "score": 1,
                  "created_utc": 1733694534.0,
                  "replies": [
                    {
                      "id": "m13iyjw",
                      "author": "EfficientAccident418",
                      "body": "Seems like an interesting concept, but the price should have started at $2500. And the lack of at least a processor update every two years is mystifying. All it needs to be is a big LCD touchscreen with PC internals.",
                      "score": 1,
                      "created_utc": 1733694876.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m11asmd",
      "author": "Beginning_Tea5009",
      "body": "The Zune of all-in-one’s.",
      "score": 58,
      "created_utc": 1733669166.0,
      "replies": [
        {
          "id": "m127on4",
          "author": "NessieReddit",
          "body": "So it was great? But under appreciated and poorly marketed? Because the Zune was amazing.",
          "score": 25,
          "created_utc": 1733680099.0,
          "replies": [
            {
              "id": "m130km6",
              "author": "Seeking_Singularity",
              "body": "The zube tried to be a social media location for music and launched without for a full year. It's gen 1 track pad wasn't a track pad and people didn't like that. \n\nSetting up a zune account was difficult and you couldn't buy single songs, you had to buy bundles of $5+, zune was also 5 years too late to the market and doing what iPod did but worse. It had wifi but would not let users use it except to send songs to other zunes which in turn took a long time and sharing an earbud was easier \n\nThen one year after Zune came out the iPhone came out and took away the point of the device",
              "score": -5,
              "created_utc": 1733689022.0,
              "replies": [
                {
                  "id": "m132rfk",
                  "author": "NSMike",
                  "body": "As someone who had and used the shit out of their Zune... Most of those issues were corrected VERY shortly after release.",
                  "score": 8,
                  "created_utc": 1733689726.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m12rq45",
              "author": "Beginning_Tea5009",
              "body": "You think Zune failed because of marketing?  lol. Okay.",
              "score": -9,
              "created_utc": 1733686249.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m13duuz",
          "author": "Plank_With_A_Nail_In",
          "body": "Zune was sold for 6 years its not the same at all.\n\nhttps://en.wikipedia.org/wiki/Zune\n\n> Zune was a brand of digital media products and services that was marketed by Microsoft from November 2006 until it was discontinued in June 2012.",
          "score": 1,
          "created_utc": 1733693216.0,
          "replies": [
            {
              "id": "m14r9sp",
              "author": "Malcopticon",
              "body": "    6 years ≠ 8 years\n\n    6 ≠ 8\n\nMath checks out.",
              "score": 1,
              "created_utc": 1733710784.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1183a8",
      "author": "Jonathank92",
      "body": "Yea I’m going to be very selective about my my next laptop and I’m leaning towards a Mac. Apple seems to give great extended support vs windows who constantly tries to get you to upgrade machines that work",
      "score": 70,
      "created_utc": 1733668104.0,
      "replies": [
        {
          "id": "m11auvo",
          "author": "StylishUnicorn",
          "body": "The Apple Silicon laptops are in such a completely other realm of power, battery life, affordability, stability, and longevity that I can’t think of a reason to get a Windows laptop over an Apple one. The base $999 air is good for most people.",
          "score": 65,
          "created_utc": 1733669190.0,
          "replies": [
            {
              "id": "m11em5j",
              "author": "Walter___",
              "body": "Apple silicone is amazing, but you have to be ok with Mac OS. While still lagging behind the Apple silicon, The current gen of windows laptops are much better than they ever have been. I got the new Lenovo Yoga Slim 7i recently. It’s fantastic.",
              "score": 13,
              "created_utc": 1733670583.0,
              "replies": [
                {
                  "id": "m11paam",
                  "author": "USPS_Nerd",
                  "body": "Silicon, not silicone… 2 different things.",
                  "score": 8,
                  "created_utc": 1733674227.0,
                  "replies": [
                    {
                      "id": "m11tv8z",
                      "author": "El-Sueco",
                      "body": "Both great gadgets!",
                      "score": 3,
                      "created_utc": 1733675711.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m11gmk7",
                  "author": "narwhal_breeder",
                  "body": "Does it still try and change your default browser to edge and sell you 365 every update?",
                  "score": 26,
                  "created_utc": 1733671300.0,
                  "replies": [
                    {
                      "id": "m11kpw0",
                      "author": "_RADIANTSUN_",
                      "body": "Uhhhh no and that's actually never happened with updates. You seem to have some fundamental misapprehension of how Windows updates work. Maybe you mean upgrading the actual windows version like 10>11?",
                      "score": 3,
                      "created_utc": 1733672725.0,
                      "replies": [
                        {
                          "id": "m128d92",
                          "author": "reinhardtmain",
                          "body": "I’m on windows 11 and it absolutely has tried to sell me 365 after numerous updates lol",
                          "score": 24,
                          "created_utc": 1733680313.0,
                          "replies": []
                        },
                        {
                          "id": "m11pzy5",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 13,
                          "created_utc": 1733674458.0,
                          "replies": [
                            {
                              "id": "m121r6j",
                              "author": "_RADIANTSUN_",
                              "body": "You open any updated or new browser and it'll ask if you want to make it default. Literally any one. Literally even Safari does this. The \"ad\" I'm guessing was just an Edge window after an update. So again I'm not really seeing the issue here. You can disable Edge entirely.",
                              "score": -2,
                              "created_utc": 1733678225.0,
                              "replies": [
                                {
                                  "id": "m12b17l",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 1,
                                  "created_utc": 1733681139.0,
                                  "replies": [
                                    {
                                      "id": "m12b93z",
                                      "author": "_RADIANTSUN_",
                                      "body": "I've never seen a \"full screen ad\" for Edge so idk what you're talking about. I've seen it open an Edge window with \"here's what's new\" or something like that.",
                                      "score": -5,
                                      "created_utc": 1733681207.0,
                                      "replies": [
                                        {
                                          "id": "m12mast",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": -2,
                                          "created_utc": 1733684575.0,
                                          "replies": [
                                            {
                                              "id": "m12x6tf",
                                              "author": "_RADIANTSUN_",
                                              "body": "Notice how that's **NOT AN AD AT ALL** (and not at all for Edge) but an actually important message about the actual OS software support? lmao.",
                                              "score": 3,
                                              "created_utc": 1733687955.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "m14s6h2",
                                              "author": "kilowhom",
                                              "body": "That has nothing to fucking do with what is being discussed at all.",
                                              "score": 1,
                                              "created_utc": 1733711130.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m13cf1m",
                          "author": "SmooK_LV",
                          "body": "This is regional. In some countries it happens while in others it doesn't",
                          "score": 2,
                          "created_utc": 1733692756.0,
                          "replies": [
                            {
                              "id": "m16fq7q",
                              "author": "None",
                              "body": "Also differences between the Home and Pro versions.",
                              "score": 2,
                              "created_utc": 1733743348.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m13xhpk",
                          "author": "Dje4321",
                          "body": "Literally have had this happen multiple times. There are some thing I cannot even unset edge for like outlook",
                          "score": 1,
                          "created_utc": 1733699848.0,
                          "replies": []
                        },
                        {
                          "id": "m16ju56",
                          "author": "ldAbl",
                          "body": "That's bs, edge often ends up on the taskbar after major updates.",
                          "score": 1,
                          "created_utc": 1733745742.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m11gopf",
                  "author": "xaphod2",
                  "body": "Lol macOS is so much nicer to use than windows, once i left windows i never looked back, i dont miss constant restarts for updates, blue screens, “drivers” to name a few",
                  "score": 13,
                  "created_utc": 1733671322.0,
                  "replies": [
                    {
                      "id": "m12reje",
                      "author": "plissk3n",
                      "body": "Disagree, I use both OSes a lot and much prefer Windows for everything. MacOS forces you to use it the way it wants you to and you have to put effort into to make it usable if you prefer other workflows. Also MacOS is a lot buggier for me than my Windows PCs.",
                      "score": 15,
                      "created_utc": 1733686148.0,
                      "replies": []
                    },
                    {
                      "id": "m11tbzm",
                      "author": "BIGSTANKDICKDADDY",
                      "body": "The weirdest quirk with macOS is that there is still no volume mixer. At this point I can only assume the reason is that Apple, in their infinite wisdom, knows exactly what volume all applications should run at. Far better than I could ever know myself.",
                      "score": 4,
                      "created_utc": 1733675536.0,
                      "replies": [
                        {
                          "id": "m11yt6s",
                          "author": "xaphod2",
                          "body": "There are quite a few apps that offer this. Soundsource is the one i use",
                          "score": 5,
                          "created_utc": 1733677284.0,
                          "replies": [
                            {
                              "id": "m13ctcc",
                              "author": "SmooK_LV",
                              "body": "And they still are bad compared to how much control Windows gives you. I tried. MacOS just doesn't stand on equal footing with Windows when it comes to covering all usecases.",
                              "score": 4,
                              "created_utc": 1733692883.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m11kwk4",
                      "author": "_RADIANTSUN_",
                      "body": "None of that happens on modern windows systems and it hasn't for a while, meanwhile on MacOS I had a lot of fun finding out Deezer suddenly doesn't work cuz I updated to Sequoia...",
                      "score": 10,
                      "created_utc": 1733672788.0,
                      "replies": [
                        {
                          "id": "m11qwmg",
                          "author": "xaphod2",
                          "body": "Bullshit i have windows 11 on a gaming pc and it constantly stops working and needs updates and reboots",
                          "score": -4,
                          "created_utc": 1733674749.0,
                          "replies": [
                            {
                              "id": "m14scv3",
                              "author": "kilowhom",
                              "body": "It's so wild the shit people blame for their shit not working\n\nPCs are complicated and you built yours wrong",
                              "score": 6,
                              "created_utc": 1733711198.0,
                              "replies": [
                                {
                                  "id": "m14yv75",
                                  "author": "xaphod2",
                                  "body": "Lol its a completely prebuilt asus gaming pc didnt build it",
                                  "score": 1,
                                  "created_utc": 1733713719.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m11rgnu",
                              "author": "pohui",
                              "body": "That's not a universal experience. I don't have any issues with my Windows 11 gaming PC or laptop, but I hate using my work Macbook. You're allowed to prefer one or the other.",
                              "score": 15,
                              "created_utc": 1733674926.0,
                              "replies": []
                            },
                            {
                              "id": "m1217ll",
                              "author": "_RADIANTSUN_",
                              "body": "Sounds like a \"you\" problem",
                              "score": 15,
                              "created_utc": 1733678050.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m13clzo",
                      "author": "SmooK_LV",
                      "body": "I had to restart Mac multiple times because apps get frozen and overlay everything. Don't pretend it doesn't happen on Mac OS",
                      "score": 4,
                      "created_utc": 1733692818.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m11fu8b",
                  "author": "void_const",
                  "body": "Comparing a Lenovo Yoga to a Mac 😂🤣😆",
                  "score": -2,
                  "created_utc": 1733671018.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m11gekl",
              "author": "BytchYouThought",
              "body": "That used to be true, but now you're out of date with the times. Others have caught up and a different OS makes a difference depending on what you want to do on the laptop to begin with. Mac laptops are my go to now, but I will say there are some annoyances on how macOS handles certain shit. I definitely still run VM's for that reason. \n\nLiek why tf can't they get Windows management right. Especially full screen. Still misses me off at times. Same for connecting monitors. Windows just randomly disappear for me or resolution may be weird. I have to use third party apps just to try and get basic shit to flow better. With the new windows laptops, I'm tempted to try both and only didn't get both, because windows is a spyware piece of shit with that flashback feature ir wtf they calll it where they spy on your shit.\n\nI don't trust that. There are plenty of reasons still folks may want a windows laptop. My sister hates apple and isn't tech literate. Windows is familiar and has came up in those areas you mentioned. I still think apple is a better laptop buy **if** macos even supports your needs, but windows side of the house isn't as far off as you claim.",
              "score": 4,
              "created_utc": 1733671221.0,
              "replies": [
                {
                  "id": "m15nnnu",
                  "author": "habitual_viking",
                  "body": "iOS is on a similar downwards spiral. It feels like the development no longer has a single focus, things are all over the place.\n\nFor instance calendar signin is now under the specific app, requiring several menu navigations and a huge scroll. Even when prompted for a login refresh iOS can’t itself navigate to the right place.\n\nAnd navigation is all over the place, why isn’t there a single correct way to navigate back??? Why do I have to drag down in some apps and slide from left in others? The android “button” is ugly as fuck, but at least it works consistently.",
                  "score": 1,
                  "created_utc": 1733724826.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m11n2m3",
              "author": "Jelly_Mac",
              "body": "Amazing hardware. Thing is, I just really, really hate MacOS. Had a MacBook over a decade ago and even with years of using it I still despised the OS. And now with the new Apple silicon I can’t dual boot Windows/Linux anymore or even have them running in a VM.",
              "score": 3,
              "created_utc": 1733673508.0,
              "replies": [
                {
                  "id": "m137qcp",
                  "author": "cape2cape",
                  "body": "You can easily have Windows or Linux running in a VM. Linux VMs can even use the Rosetta Intel-ARM translator.",
                  "score": 2,
                  "created_utc": 1733691273.0,
                  "replies": []
                },
                {
                  "id": "m11pfla",
                  "author": "USPS_Nerd",
                  "body": "I much prefer an OS that isn’t trying to throw ads at me, or auto update at night without me opting in.",
                  "score": 1,
                  "created_utc": 1733674275.0,
                  "replies": [
                    {
                      "id": "m11qb2j",
                      "author": "Jelly_Mac",
                      "body": "I feel you, latest updates of windows are pissing me off and windows 11 is starting to bring in the stuff I hate about MacOS (my desktop will stay on 10 until it can’t anymore, my laptop came with 11). That said I still strongly prefer Windows and Linux to MacOS. I don’t even like helping my mom on her MacBook because doing anything beyond opening a web browser feels so frustrating",
                      "score": 8,
                      "created_utc": 1733674556.0,
                      "replies": []
                    },
                    {
                      "id": "m12cedd",
                      "author": "BIGSTANKDICKDADDY",
                      "body": "With Apple incorporating more and more advertising into iOS it seems inevitable that we'll get the same experience on macOS. The new settings app on macOS has all the little ads for free trials and add-on services, same as the ones we get on iPhone. It feels as gross and unnecessary as a fresh Windows install trying to get you to sign up for Microsoft's junk.",
                      "score": 0,
                      "created_utc": 1733681577.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m163tkx",
              "author": "Matt32490",
              "body": "I have one purely for gaming (I travel a good amount). Honestly if Macs werent so bad at game support I would buy one.",
              "score": 1,
              "created_utc": 1733735224.0,
              "replies": []
            },
            {
              "id": "m12ya3d",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1733688300.0,
              "replies": [
                {
                  "id": "m13d47u",
                  "author": "SmooK_LV",
                  "body": "ChromeOS Flex would be great for those people haha",
                  "score": 1,
                  "created_utc": 1733692978.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m11tynl",
              "author": "sunkenrocks",
              "body": "Power wise they still have a decent price advantage but battery has mostly been matched with both the Snapdragons and the next gen of x86 chips, Intel's at least.\n\nNow the mac mini, that really is a good deal right now.",
              "score": 0,
              "created_utc": 1733675741.0,
              "replies": [
                {
                  "id": "m16g47t",
                  "author": "randomusername8472",
                  "body": "Same for mini pcs! My laptop was packing in after 8 years and I realized I needed an upgrade, and that my laptop battery was so long dead id basically become accustomed to using it like a desktop anyway.\n\n\nSo I bought a new mini PC with very impressive stats for ~£500, which would have been an absolute top of the range laptop for ~£2k. \n\n\nOkay, I also had to spend an extra £100 on peripherals too but it's brilliant. \n\n\n(Just checked, its equivalent to a £999 mac mini, 16gb + memory addon)",
                  "score": 1,
                  "created_utc": 1733743588.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m11eqlg",
          "author": "mr_bots",
          "body": "I went with an M2 MBA for my laptop after being pretty much nothing but windows. The weight, battery life, build quality, and overall snappiness blows any windows laptop I’ve had out of the water. Their trade-in process is also easier and snore available than pretty much everyone else’s. I hardly ever even touch my gaming desktop anymore versus just using my MBA with a dock.",
          "score": 14,
          "created_utc": 1733670627.0,
          "replies": [
            {
              "id": "m13c8o7",
              "author": "SmooK_LV",
              "body": "Meanwhile I have been on M2 for a year nearly and I hate using it compared to proper Windows machine. Speakers and battery life are nice though.",
              "score": 1,
              "created_utc": 1733692699.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m11kbn1",
          "author": "_RADIANTSUN_",
          "body": "Honestly what the fuck does this even mean? Windows doesn't get updates or something? How does Windows \"constantly try to get you to upgrade machines\"? Please explain in concrete terms. \n\nLike you get that there's a difference between the Surface hardware and Windows, the OS right?",
          "score": 15,
          "created_utc": 1733672588.0,
          "replies": [
            {
              "id": "m11oka8",
              "author": "Jonathank92",
              "body": "Windows 10 being advertised as the last operating system you’ll need and then they’ve done a 180 and will now stop supporting it in a year",
              "score": 0,
              "created_utc": 1733673995.0,
              "replies": [
                {
                  "id": "m124txc",
                  "author": "_RADIANTSUN_",
                  "body": "You thought that marketing line means they would support Windows 10 forever? It just meant a continuous update model. They do seem to be attempting the same on Win 11, upgrade was free etc",
                  "score": 5,
                  "created_utc": 1733679209.0,
                  "replies": [
                    {
                      "id": "m12e3xx",
                      "author": "Jonathank92",
                      "body": "Words mean things ",
                      "score": 0,
                      "created_utc": 1733682089.0,
                      "replies": [
                        {
                          "id": "m12xwo7",
                          "author": "_RADIANTSUN_",
                          "body": "Well if you die before W10 EOL then it would be truly the \"last OS you'll ever need\" in a literal sense.\n\nIf you overclock your brain cells to at least 1hz then it's easy to understand what they mean here in the non literal sense too.",
                          "score": 3,
                          "created_utc": 1733688182.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m142hcw",
                  "author": "TheNorthComesWithMe",
                  "body": "> Windows 10 being advertised as the last operating system you’ll ever need\n\nOne person said that one time in an unofficial capacity. Microsoft never actually said that let alone advertised it.",
                  "score": 3,
                  "created_utc": 1733701634.0,
                  "replies": []
                },
                {
                  "id": "m19vth3",
                  "author": "haahaahaa",
                  "body": "That wasn't anything Microsoft ever said or advertised toward.",
                  "score": 1,
                  "created_utc": 1733786529.0,
                  "replies": []
                },
                {
                  "id": "m11xj2u",
                  "author": "Mindereak",
                  "body": "Oh no, people will have to update the version of their OS after 10 years, what a sad world we live in.",
                  "score": 2,
                  "created_utc": 1733676873.0,
                  "replies": [
                    {
                      "id": "m11xy82",
                      "author": "Jonathank92",
                      "body": "You’re clearly purposely missing the issue. I would upgrade to Windows 11 if I could. It’s the fact that they’re requiring working hardware to be disposed of to upgrade. Huge amount of e waste. ",
                      "score": 2,
                      "created_utc": 1733677008.0,
                      "replies": [
                        {
                          "id": "m12mejp",
                          "author": "FrozenLogger",
                          "body": "Yeah about that. It's two registry settings if you want to upgrade.\n\nI say skip it and get better OS and put linux on it, but there is nothing actually stopping you from an change to 11.",
                          "score": 1,
                          "created_utc": 1733684608.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m11oj8l",
          "author": "cmyklmnop",
          "body": "I swapped to Mac years ago and love it mostly. Just for starters I still have Mac’s in my shop 6-7 years old making money",
          "score": 5,
          "created_utc": 1733673985.0,
          "replies": []
        },
        {
          "id": "m11bb00",
          "author": "sigmund14",
          "body": "I mean, hardware is completely separated from software. You can go with non-Apple laptop and not use Windows, if you want.",
          "score": 2,
          "created_utc": 1733669359.0,
          "replies": [
            {
              "id": "m11gpb9",
              "author": "fixminer",
              "body": "In theory maybe, but your only other good option is Linux (which is decent but not for everyone). Installing MacOS on a random laptop is highly unsupported, if it works at all.",
              "score": 5,
              "created_utc": 1733671328.0,
              "replies": [
                {
                  "id": "m12nkkb",
                  "author": "sigmund14",
                  "body": "Yeah, true that.",
                  "score": 1,
                  "created_utc": 1733684966.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m11abw2",
          "author": "KidsSeeRainbows",
          "body": "Refurbished M1 airs are pretty affordable, plus they’re not technically eol yet. My 3 year old M1 Pro works great, and I think it will for at least another four or five years. \n\nRemember when we all gasped when chromebooks started coming with a 7 year support cycle to better assist schools? I’ve never had a windows laptop last me 7 years, or even 5 of regular use lol. I’ve had the surface rt (play toy, not used for real), surface book, surface 7 pro, other non Microsoft laptops… they’re all junk after 3 or 4 years because something ends up dying, and then support is non existent, or things are hard to track down. \n\nAdmittedly apple isn’t perfect there either, but their stuff doesn’t have a consistent reputation for crapping out and it’s not hard to find the pieces, but it is expensive. \n\nPutting an eol on their m series will be very telling of how apple feels about them. I’m expecting to upgrade around m10 (mX?), given the cadence of upgrades thus far.",
          "score": 3,
          "created_utc": 1733668987.0,
          "replies": []
        },
        {
          "id": "m13fk79",
          "author": "jl2352",
          "body": "I own a Surface Studio. It was one of the best machines I’ve ever owned. Today I use it only as a TV, and have since moved to Mac.\n\nAs long as the Apple Silicon chips remain dominant, I don’t see myself ever switching back.",
          "score": 1,
          "created_utc": 1733693766.0,
          "replies": []
        },
        {
          "id": "m14r3vq",
          "author": "ElusiveGuy",
          "body": "tl;dr: Windows lifecycle support is historically *longer* than macOS. Win11 requirements change things a bit, M1 might change things, but still in the same ballpark for now.\n\n---\n\nM1 was only released in 2020. Remains to be seen how long the support for it will be, since they do own more of the hardware stack than previously.\n\nHistorically, we're looking at maybe 8-10 years support for macOS on older hardware. As in, right now in 2024 the oldest supported hardware is from 2017. Anything older is unsupported. And even the 2017 hardware is only supported on previous versions of macOS that will EoL in 2025 or 2026, it's already been dropped from latest.\n\nWindows, well. Windows 10/11 is a bit of an outlier, since historically you've been able to upgrade just the OS side for well over a decade but the upgrade also wasn't free. Win10 made the upgrade free but then Win11 introduced the first *recent*(ish) processor limits in forever. The support for a single OS version is 10 years from OS release date (which is not tied to hardware, so support for specific hardware ends up varying).\n\nWhat does that look like? Win11 supports processors from 2018 onwards, so those will be good through at least 2031 (10 years from Win11 release). Win10 is EoL in 2025 and the last supported version for 2017 and older processors. So also 8 years for Win10 with 2016/2017 CPUs, 13 years minimum expected for Win11 with 2018 CPUs, and easily over 20 years if you look back at the *oldest* CPUs Win10 supported. All over the shop, but let's go with 8 as a minimum - about the same as current macOS, plus or minus a year.\n\nIn all cases I'm considering latest supported version of the OS for that hardware, upgrades included. Because if we're talking about excluding supported upgrades (like people who insist on staying on Win10 despite Win11 being supported on their hardware), well, you kinda have to apply the same idea to macOS - which is only supported for 3 years per version. So say you insist on staying on macOS 14 despite knowing it'll EoL in 2 years, and refuse to install macOS 15... that's kinda self-inflicted, no?",
          "score": 1,
          "created_utc": 1733710721.0,
          "replies": []
        },
        {
          "id": "m19vmbs",
          "author": "haahaahaa",
          "body": "They've stopped selling the model, they havent stopped supporting it.  Its a windows machine, so it will continue to get software updates until windows 11 goes EoL in like 10 years.  This isn't a phone.",
          "score": 1,
          "created_utc": 1733786459.0,
          "replies": []
        },
        {
          "id": "m13rehp",
          "author": "AliveAndNotForgotten",
          "body": "As a longtime Mac user, I recently switched to windows and it’s been great. The base MacBook Pro just got worse and worse and more expensive",
          "score": 0,
          "created_utc": 1733697710.0,
          "replies": []
        },
        {
          "id": "m11alnt",
          "author": "NeverComments",
          "body": "Apple will just as easily cut a product loose if the sales don’t justify further investment (they dropped support for that little 12” MacBook after just five years, for example) and their long term support is non-committal (Google promises a minimum of ten years for ChromeOS devices, in contrast). We’ll get what we get on Apple’s timeline, whatever they decide that looks like. \n\nA real concern for me with my M1 MacBook is how Apple will treat these devices once they reach EOL - it’s not like you can easily replace macOS with an actively updated alternative given the lack of Bootcamp and limitations with Asahi Linux. ",
          "score": -1,
          "created_utc": 1733669090.0,
          "replies": []
        },
        {
          "id": "m11uq3r",
          "author": "None",
          "body": "plus the community picks up where apple drop off. i have a 9 year old macbook but i run Sequoia (last osx) because some geeks ctreated a patcher for it! its dope. my mac was fully loaded when i got it and it's still okay to use for most things and it feels really rewarding to have a community dedicated to helping. it's awesome. oh! apple supported it until earlier this year.. wait wait, they still provide full support thru just don't allow me to upgrade to the latest osx. it stopped allowing me to upgrade BUT they are still providing FULL support for the older osx. they figured a lot of shit out.",
          "score": -2,
          "created_utc": 1733675985.0,
          "replies": [
            {
              "id": "m11xjjn",
              "author": "Jonathank92",
              "body": "Right that’s all I’m asking for. Support/security patching. Half the world is on Windows 10 and you’re just going to drop support just because?? That’s insane ",
              "score": -2,
              "created_utc": 1733676877.0,
              "replies": [
                {
                  "id": "m12y2h0",
                  "author": "TwoToedSloths",
                  "body": "You guys realize you can just force the update on your machine? \n\nThis guy is talking about using an open source project to run Sequoia on his unsupported computer. Windows just lets you upgrade the OS yourself? Get a grip.",
                  "score": 2,
                  "created_utc": 1733688232.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m11icxl",
      "author": "OreoSwordsman",
      "body": "Microsoft once again running ads for Linux lmfao",
      "score": 5,
      "created_utc": 1733671910.0,
      "replies": []
    },
    {
      "id": "m11jst1",
      "author": "Akujux",
      "body": "Dude this was a great all in one. wtf Microsoft?!?!? \nThis would’ve been a great niche product for the digital art and video makers.\n\nCouple that with  low cost version and you’d be printing money. 😭",
      "score": 9,
      "created_utc": 1733672409.0,
      "replies": [
        {
          "id": "m12fjtd",
          "author": "_mizzar",
          "body": "I remember the launch ad for this with the Charlie and the chocolate factory song was sick.",
          "score": 4,
          "created_utc": 1733682527.0,
          "replies": []
        },
        {
          "id": "m16chu9",
          "author": "epsilona01",
          "body": "They made it so they had a sexy product to do product placement with on TV shows, beyond that it was essentially vapourware. As soon as the TV sponsorship program ended they killed the machine.",
          "score": 1,
          "created_utc": 1733741280.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m119pjh",
      "author": "TheModeratorWrangler",
      "body": "I was one of the first people to receive a Surface RT tablet from Sinofsky himself, no less. I was #13 in the country to receive an Xbox One during The NY Times Square launch event… \n\nI now use Mac exclusively. That’s how bad Microsoft is doing as of late and it’s heartbreaking.",
      "score": 25,
      "created_utc": 1733668748.0,
      "replies": [
        {
          "id": "m11anbc",
          "author": "Shivaess",
          "body": "I loved my surface book. Innovative form factor with cool capabilities. But they seem more intent on squeezing shareholder value out of everything than producing a good product.\n\nThat said WSL2 and VSCode are legitimately awesome products, and they’re giving them away for free.",
          "score": 15,
          "created_utc": 1733669108.0,
          "replies": [
            {
              "id": "m11dsfg",
              "author": "AshIsGroovy",
              "body": "The reason they are giving them away is to gain market share and hopefully become the defacto choice.",
              "score": 2,
              "created_utc": 1733670287.0,
              "replies": []
            },
            {
              "id": "m11b3qr",
              "author": "TheModeratorWrangler",
              "body": "I guess that’s… good? It’s just that after multiple Surface products (still have a Surface Book 2)… I realized I was spending more time tinkering with OS hiccups and a lack of ease of use compared to a MBP + iPad Pro combo. Throw in AirDrop, and it’s painfully obvious that Microsoft only now cares about profits over the customers like me who wanted anything BUT Apple, until I finally caved. I’ve never been happier with a PC like my MacBook M2 Pro and it’s just mind blowing how Microsoft never learned.\n\nDon’t even get me started on trying to fix a Surface product, while I can just walk into an Apple Store and be done with any hardware issues within the day.",
              "score": 2,
              "created_utc": 1733669284.0,
              "replies": [
                {
                  "id": "m11drcw",
                  "author": "Shivaess",
                  "body": "100% I’m apple products everywhere but my home built workstation and servers. Surface book 2 got replaced with an iPad Pro with the Magic Keyboard *shrug*",
                  "score": 6,
                  "created_utc": 1733670276.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m116nkc",
      "author": "None",
      "body": "Oooooo",
      "score": 4,
      "created_utc": 1733667521.0,
      "replies": []
    },
    {
      "id": "m12iomg",
      "author": "Metrobolist3",
      "body": "£4700 for an 11th gen i7 and a laptop grade GPU with a nice screen, that probably has zero repair-ability. Can't imagine why people weren't queuing round the block for that.",
      "score": 4,
      "created_utc": 1733683471.0,
      "replies": [
        {
          "id": "m13cosm",
          "author": "StreetwalkinCheetah",
          "body": "Can confirm zero repairability sadly. I had two crap out on me. The screen was (is) amazing. I need to figure out how to reuse it.",
          "score": 3,
          "created_utc": 1733692843.0,
          "replies": [
            {
              "id": "m13f24j",
              "author": "Metrobolist3",
              "body": "Sucks man - hope it's possible.",
              "score": 1,
              "created_utc": 1733693602.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m136frn",
          "author": "QuaitheLogic",
          "body": "Also mine only has 8GB of non-upgradeable RAM.  Ugh.",
          "score": 2,
          "created_utc": 1733690859.0,
          "replies": [
            {
              "id": "m13c07c",
              "author": "Metrobolist3",
              "body": "Oh, nice touch there. We can be Apple too, eh Microsoft? Pity anyone who might have been interested in this kinda thing will have just bought an Apple instead.",
              "score": 1,
              "created_utc": 1733692625.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m12qvqf",
      "author": "imironman2018",
      "body": "I thought the surface studio was an amazing computer for graphics designer or artists or doodlers. But it was so under powered and didn’t allow any upgrades to its computer. Wished they did a Stand alone display.",
      "score": 3,
      "created_utc": 1733685986.0,
      "replies": []
    },
    {
      "id": "m125jmr",
      "author": "Party_Cold_4159",
      "body": "I hate this so fucking much. \n\nIt’s a beautiful display with an awesome stand. But they keep fucking themselves by trying to make it an iMac. \n\niMacs are going out of style and they think they can keep this going?? Once they updated it with a laptop CPU, a graphics card that was years old at the time and bad when it came out, at like $3-4k. \n\nI gave up.",
      "score": 8,
      "created_utc": 1733679431.0,
      "replies": []
    },
    {
      "id": "m11cxcw",
      "author": "sandman795",
      "body": "But how will I update my zune now?",
      "score": 3,
      "created_utc": 1733669968.0,
      "replies": []
    },
    {
      "id": "m11jm2b",
      "author": "Framed-Photo",
      "body": "I love the concept of this device but it really should have just been a monitor.",
      "score": 3,
      "created_utc": 1733672345.0,
      "replies": []
    },
    {
      "id": "m136lce",
      "author": "BreakdownEnt",
      "body": "This should be (have been) a monitor that works with every pc",
      "score": 3,
      "created_utc": 1733690908.0,
      "replies": []
    },
    {
      "id": "m149c8y",
      "author": "WhoRoger",
      "body": "I saw one at a store, it was 4 grand.\n\nThere's unrealistic, there's completely batshit insane and there's Microsoft.",
      "score": 3,
      "created_utc": 1733704097.0,
      "replies": []
    },
    {
      "id": "m11qgc7",
      "author": "VoidMageZero",
      "body": "Such a cool idea but with such bad execution. RIP. 💀",
      "score": 2,
      "created_utc": 1733674602.0,
      "replies": []
    },
    {
      "id": "m13x9hw",
      "author": "Dje4321",
      "body": "Literally the only thing this needed was an input to reuse the display. Otherwise its always seen as a bad idea because the display outlasts the hardware and makes it useless. 60+% of the cost went towards the display and in 3-5 years, the entire thing is useless.",
      "score": 2,
      "created_utc": 1733699767.0,
      "replies": []
    },
    {
      "id": "m11e1yk",
      "author": "Deadaghram",
      "body": "Now what will the NFL use to watch live tape back with?",
      "score": 1,
      "created_utc": 1733670380.0,
      "replies": [
        {
          "id": "m11ho3n",
          "author": "khan800",
          "body": "I didn't realize those tablets they hold were actually all-in-one desktops, like this article refers to.",
          "score": 4,
          "created_utc": 1733671671.0,
          "replies": [
            {
              "id": "m11juxf",
              "author": "Deadaghram",
              "body": "I'm confusing two different pieces of technology, aren't I?",
              "score": 4,
              "created_utc": 1733672429.0,
              "replies": [
                {
                  "id": "m11wjyh",
                  "author": "2g4r_tofu",
                  "body": "Microsoft makes several products with \"surface\" in the name",
                  "score": 8,
                  "created_utc": 1733676562.0,
                  "replies": []
                },
                {
                  "id": "m12biua",
                  "author": "khan800",
                  "body": "They're still making Surface tablets, just discontinuing this drafting table all in one.",
                  "score": 2,
                  "created_utc": 1733681290.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m11gitu",
      "author": "raining_sheep",
      "body": "They made the surface studio to compete with Wacom but made a tablet that wasn't as good and failed\n\nThey made the surface to compete with the iPad but made a tablet that wasn't as good and the software didn't really support it and it failed.\n\nMSFT doesn't know how to make products.",
      "score": 2,
      "created_utc": 1733671263.0,
      "replies": [
        {
          "id": "m13rqri",
          "author": "AliveAndNotForgotten",
          "body": "A company with billions of dollars could’ve easily beat Wacom. They have a ton of connection issues that could probably be fixed with more engineers thrown at it",
          "score": 1,
          "created_utc": 1733697829.0,
          "replies": [
            {
              "id": "m143ry7",
              "author": "TheNorthComesWithMe",
              "body": "Making a drawing tablet + stylus that has the same level of functionality and sensitivity is a lot harder when you also have to avoid infringing on a bunch of patents.",
              "score": 1,
              "created_utc": 1733702099.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m11h864",
      "author": "souvlaki_",
      "body": "The display was great but it was overpriced and underpowered from the start. It could have succeeded if they weren't so stupid about it",
      "score": 1,
      "created_utc": 1733671514.0,
      "replies": []
    },
    {
      "id": "m11kids",
      "author": "Kep0a",
      "body": "Just fell to my knees in a Microsoft store.",
      "score": 1,
      "created_utc": 1733672653.0,
      "replies": []
    },
    {
      "id": "m11tx8m",
      "author": "Suzzie_sunshine",
      "body": "The problem with this thing is that you could build a pc with a 24\" wacom for the same price. It's too expensive.",
      "score": 1,
      "created_utc": 1733675728.0,
      "replies": []
    },
    {
      "id": "m11y1f0",
      "author": "dropthemagic",
      "body": "I never saw one in the wild. Crazy",
      "score": 1,
      "created_utc": 1733677036.0,
      "replies": []
    },
    {
      "id": "m121bpc",
      "author": "None",
      "body": "Maybe it will work as a large display only.",
      "score": 1,
      "created_utc": 1733678086.0,
      "replies": []
    },
    {
      "id": "m124dtm",
      "author": "LevelWriting",
      "body": "It was also ridiculously expensive and didn't have enough horsepower but man, I so wish I had one. An artists wet dream to draw on.",
      "score": 1,
      "created_utc": 1733679067.0,
      "replies": []
    },
    {
      "id": "m12hjpg",
      "author": "5TP1090G_FC",
      "body": "When will they have a 'fire sale' on these all-in-one desktop.",
      "score": 1,
      "created_utc": 1733683128.0,
      "replies": []
    },
    {
      "id": "m13cmwm",
      "author": "starsfan18",
      "body": "Blame Amy Hood.",
      "score": 1,
      "created_utc": 1733692827.0,
      "replies": []
    },
    {
      "id": "m13ef8b",
      "author": "Akira_Yamamoto",
      "body": "Really goes to show how premium that lineup was when they discontinue support for it so quickly. You can't trust Microsoft to make a good product",
      "score": 1,
      "created_utc": 1733693400.0,
      "replies": []
    },
    {
      "id": "m14b4me",
      "author": "None",
      "body": "Let’s not take feedback into account and fix promising product. Instead let’s produce scam box Microsoft link instead. Apple is a genius compared to these dimwits",
      "score": 1,
      "created_utc": 1733704736.0,
      "replies": []
    },
    {
      "id": "m14i7fd",
      "author": "milky_mouse",
      "body": "Their mouse is consistently shit",
      "score": 1,
      "created_utc": 1733707353.0,
      "replies": []
    },
    {
      "id": "m15cbqd",
      "author": "aitacarmoney",
      "body": "to be honest, it’s a pretty rad concept. dope hinge, high quality color accurate screen, had it shipped with current gen hardware at the time it would have made it all that better.\n\none of those things i think would be neat to have but would never actually buy even if i had the means.",
      "score": 1,
      "created_utc": 1733719174.0,
      "replies": []
    },
    {
      "id": "m164o0v",
      "author": "SeaCorrect348",
      "body": "This product was cool but for what it was doing at the same time as an ipad pro did not help and the lack of anything post just fed into it. There were some really cool features that might have had me in 2015 but not today.",
      "score": 1,
      "created_utc": 1733735823.0,
      "replies": []
    },
    {
      "id": "m16beln",
      "author": "rolfraikou",
      "body": "I love the design of the hinge and the pen. I just wanted them to sell the damn thing as a monitor. Kick wacom's ass directly at their own game. \n\nIt always surprises me that with so many windows enthusiasts being people willing to build their own PCs that Microsoft doesn't lean more into making high quality components and peripherals than they do. Instead they lean in to all-in-ones. \n\nI own like 7 different surface pens for the few surface pros I've owned over the years. I love them for art on the go. I get home, I use a huion. I would *love* to use those surface pens for my desktop, but they don't offer a particularly large (Ideally 25\"ish) drawing display that just works with the PC I built. I could kinda mirror the surface pro, but it's smaller, no VESA mount, puts unnecessary strain on the battery, etc.\n\nLong ago I remember they even had a gaming keyboard that a lot of people seemed to really like. Not to mention the intellimouse basically being a gaming mouse *before* gaming mice were a thing. \n\nI dunno, seems like they want to win over the \"it just works\" apple crowd, when everyone I know that likes microsoft are basically tinkerers and builders, that generally don't like all-in-ones.",
      "score": 1,
      "created_utc": 1733740553.0,
      "replies": []
    },
    {
      "id": "m16d2ot",
      "author": "CammKelly",
      "body": "This was such a good idea, and Microsoft goes and does what Microsoft does best and half asses investment in the ecosystem then wonders why it never took off.",
      "score": 1,
      "created_utc": 1733741660.0,
      "replies": []
    },
    {
      "id": "m16fmkg",
      "author": "uniquelyavailable",
      "body": "this is the first time I've heard of this thing and i work in tech",
      "score": 1,
      "created_utc": 1733743286.0,
      "replies": []
    },
    {
      "id": "m16qrbq",
      "author": "GamerRadar",
      "body": "If it isn’t Windows or Office then Microsoft will probably kill it off..\n\nCortona, Zune, Windows Phone all missed hits from Microsoft. Nokia was a huge win for them. They could have really done well with some of this stuff",
      "score": 1,
      "created_utc": 1733749200.0,
      "replies": []
    },
    {
      "id": "m18oime",
      "author": "tom_abbott",
      "body": "I have a MS Studio Laptop 2 running Win11 and it works great for me, does all the basic stuff plus video editing. Updates are pushed regularly. That all-in-one machine was eye-candy but way too expensive. Surprised MS did not kill it years ago, but enough people must have bought them to avoid this EOL decision.",
      "score": 1,
      "created_utc": 1733772668.0,
      "replies": []
    },
    {
      "id": "m19v07q",
      "author": "haahaahaa",
      "body": "I saw one the these in person when they first released and was really impressed.  Really well designed.  Looked phenominal in person.  The price though, holy fuck.  Nobody was paying that much for a fancy mount, a big touchscreen and laptop internals.",
      "score": 1,
      "created_utc": 1733786241.0,
      "replies": []
    },
    {
      "id": "m11mxau",
      "author": "FEEEETY",
      "body": "What did we expect when they were insanely overpriced? A direct iMac competitor without the unnecessarily complex hinge and without a touch screen would’ve sufficed. The all-in-one pc market is surprisingly lacking. I have a hard time deciding if any of them are worth considering.",
      "score": 1,
      "created_utc": 1733673460.0,
      "replies": [
        {
          "id": "m13da2o",
          "author": "StreetwalkinCheetah",
          "body": "The hinge and the monitor as a whole were amazing I wish they had just made it a standalone Wacom competitor. Mine died after 18 months and its replacement maybe lasted two years. Biggest waste of money ever but if anyone has ever figured out how to make it work with a Mac Mini or Mac Studio I still have my beautiful dead device.",
          "score": 5,
          "created_utc": 1733693030.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m13xi31",
      "author": "h0g0",
      "body": "Crazy how bad Microsoft blew the surface line. Absolutely gorgeous with terrible specs and outrageous pricing",
      "score": 1,
      "created_utc": 1733699852.0,
      "replies": []
    },
    {
      "id": "m11pet5",
      "author": "Roozbeh_m",
      "body": "This was still around? Microsoft and their stupid all-in-ones.",
      "score": 0,
      "created_utc": 1733674268.0,
      "replies": []
    },
    {
      "id": "m13hdz5",
      "author": "None",
      "body": "I never saw one in a store or in action.",
      "score": 0,
      "created_utc": 1733694358.0,
      "replies": [
        {
          "id": "m13ikpk",
          "author": "and_sama",
          "body": "Same",
          "score": 2,
          "created_utc": 1733694749.0,
          "replies": []
        }
      ]
    }
  ]
}