{
  "post": {
    "title": "Motorcycle for the skies: Volonaut airbike flies and glides for the first time",
    "author": "diacewrb",
    "id": "1kd1qfw",
    "score": 995,
    "created_utc": 1746194569.0,
    "selftext": "",
    "num_comments": 248,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kd1qfw/motorcycle_for_the_skies_volonaut_airbike_flies/"
  },
  "comments": [
    {
      "id": "mq7zwlw",
      "author": "williwolf8",
      "body": "I was just talking to my friend about how motorcycles are too safe. This couldn’t have come soon enough.",
      "score": 347,
      "created_utc": 1746203360.0,
      "replies": [
        {
          "id": "mq83pht",
          "author": "jupiternimbus",
          "body": "Omg I know. Thank the Lord.",
          "score": 36,
          "created_utc": 1746204445.0,
          "replies": [
            {
              "id": "mq8awzm",
              "author": "williwolf8",
              "body": "Buy one of these and you can thank him in person.",
              "score": 55,
              "created_utc": 1746206466.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqayptt",
          "author": "xclame",
          "body": "I mean to be fair, if it's in the air a lot of things that make riding motorcycles dangerous are gone.",
          "score": 15,
          "created_utc": 1746237257.0,
          "replies": [
            {
              "id": "mqbspnj",
              "author": "cutelyaware",
              "body": "Yep. No ground in the air.",
              "score": 21,
              "created_utc": 1746250691.0,
              "replies": []
            },
            {
              "id": "mqk9sdi",
              "author": "Drewbeede",
              "body": "Only to introduce a lot of new ones.",
              "score": 1,
              "created_utc": 1746377719.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq8s7jc",
          "author": "Known-Name",
          "body": "This one got an audible laugh from me. Thanks!",
          "score": 7,
          "created_utc": 1746211419.0,
          "replies": [
            {
              "id": "mqbkbqu",
              "author": "Geekygamertag",
              "body": "I laughed via text. lol 😆",
              "score": 2,
              "created_utc": 1746246316.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqb7cu6",
          "author": "redalert825",
          "body": "Flying motorcycles, you say? Gives new meaning to Hell's Angels.",
          "score": 4,
          "created_utc": 1746240641.0,
          "replies": []
        },
        {
          "id": "mqi93yd",
          "author": "Gui1tyspark",
          "body": "![gif](giphy|Qr6IxCV9ZUe4jnjSIi|downsized)",
          "score": 2,
          "created_utc": 1746347934.0,
          "replies": []
        },
        {
          "id": "mqr88hl",
          "author": "Crobran",
          "body": "But he's wearing a helmet, so...",
          "score": 1,
          "created_utc": 1746471901.0,
          "replies": []
        },
        {
          "id": "mqa1jbn",
          "author": "Original_moisture",
          "body": "Finally, I can blame Boeing for another crash.\n\n#highsidegang",
          "score": 1,
          "created_utc": 1746225376.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7t06q",
      "author": "doubleE",
      "body": "Can't find any video that has the actual sound. It must be loud as fuck.",
      "score": 112,
      "created_utc": 1746201387.0,
      "replies": [
        {
          "id": "mqa69qt",
          "author": "ExdigguserPies",
          "body": "Yes it'll be banned from populated areas on that alone.",
          "score": 41,
          "created_utc": 1746227009.0,
          "replies": [
            {
              "id": "mqbj7pp",
              "author": "imagicnation-station",
              "body": "Imagine flying that over cars or people.",
              "score": 9,
              "created_utc": 1746245774.0,
              "replies": []
            },
            {
              "id": "mql5p8g",
              "author": "prove____it",
              "body": "Along with all of the flying cars people are investing in.",
              "score": 1,
              "created_utc": 1746387473.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqbx66f",
          "author": "Glucker4000NancyReag",
          "body": "So, like terrestrial Harleys",
          "score": 21,
          "created_utc": 1746253240.0,
          "replies": []
        },
        {
          "id": "mqaoq2i",
          "author": "Pauleke",
          "body": "This thing actually uses jet power instead of propellers. Straight outta Star Wars!",
          "score": 20,
          "created_utc": 1746233556.0,
          "replies": []
        },
        {
          "id": "mqhtulf",
          "author": "Moto_Guzzisti",
          "body": "It's not real. Watch the vids. Aside from being obvious CGI, there is no propulsion system, no lift system, and it doesn't move correctly in the air. The \"inventor\" says it weighs 7 times less than a superbike, lol. Ok, so aside from that not being possible, the \"inventor\" doesn't understand how math works.",
          "score": 8,
          "created_utc": 1746338739.0,
          "replies": [
            {
              "id": "mqiqpil",
              "author": "_jr05_",
              "body": "it would have to be 30kg lol",
              "score": 3,
              "created_utc": 1746358361.0,
              "replies": [
                {
                  "id": "mqjprc9",
                  "author": "Moto_Guzzisti",
                  "body": "Absolutely, lol. With a jet engine, fuel tank, ducting system with control motors, frame, electricals, electronics, human interface, (none of which is present in those videos other than a frame, btw). It blows my mind that anyone sees these videos and believes it's real. The fuel tank would need to be much larger than the CGI videos suggest. Jet engines are very thirsty at low altitude, low speed flight. Small jet engines are even worse, because they're turbojet design rather than the more modern turbofan, to save space and weight. In the video, there is no thrust apparatus, no lift apparatus, no space within that body for a jet engine, no space for a fuel tank (unless the entire body is a fuel tank with nothing else in there), no air intake for the massive amount of air ingested by a jet engine. the frame looks like it would barely be strong enough to hold a grown man. \nA jet engine spinning several hundred thousand rpm generates a good amount of rotational inertia. You have to have an entire system designed into the vehicle to counteract rotational inertia (even more weight and space requirements), or you just flip over as soon as you leave the ground. There have been full-sized aircraft that struggled to deal with rotational inertia due to improper engineering, and that's even with massive flight surfaces (wings) giving it stability. The thing in these videos has NO flight surfaces. \nThe problems go on and on. This guy made a few AI-generated CGI videos and has been promoting it as real to get traffic to his socials. Don't fall for it. When someone makes claims of a paradigm shift gadget that turns everything on its head, it is not the time to suspend all disbelief and critical thinking.\n\nI have a small jet engine that generates 1000 lbs of thrust, which is likely too small for an application such as this. It weighs almost 300 lbs on its own, dry, sitting on the bench. It is also long enough that you'd see it stick out in front or behind the tiny body of the BS we see in those videos.\n\n2nd point, that number is assuming he MEANT to say 1/7th the weight of a superbike. Not the same thing as saying 7 times lighter, which is mathematically impossible.",
                  "score": 2,
                  "created_utc": 1746371517.0,
                  "replies": [
                    {
                      "id": "mqt615d",
                      "author": "StickyNebbs",
                      "body": "that's cool and all, but we've been making 40lb turbojet engines that can lift a person since the 70's. with carbon fiber and new material science it is totally conceivable to make that weight. also this tech is not new by any means, Gravity Industries makes a wearable pack that you attach the jets to your wrist and also only weighs 60 pounds. repackaging it into a bike form would take reengineering but far from impossible. your anecdotal experience with one jet engine that you're not even sure of the actual performance ability of doesn't make you an expert on the feasibility of these things nor put you in a position to so boldly claim that the entire presentation is fake",
                      "score": 1,
                      "created_utc": 1746494163.0,
                      "replies": [
                        {
                          "id": "mqtwt3a",
                          "author": "Moto_Guzzisti",
                          "body": "This has all been covered already. Name the model of these turbojets that weigh 40 lbs, and can lift a person, plus an entire vehicle, plus the amount of fuel you would need for more than 1 minute of flight, plus all the control motors and ducting you would need on a vehicle that you would not need on a human mounted system, given that a jetpack uses the humans own body as the thrust vectoring system (not how it works on an actual vehicle), etc, etc, etc. also.. the loooong list of other problems detailed. There ARE actually modern small jet engine jet packs that people can wear and 'fly'. Sort of. For 1 to 3 minutes before it runs out of fuel. There is a world of difference between a thing that a human can wear and hover around for a minute or two, and a vehicle that requires all the controls and ducting and higher thrust, and higher lift, and far, far more fuel, and rotational inertia countermeasure systems that a vehicle would need. personal aircraft. They're big and heavy, they're slow, they have 4 massive electric motors driving propellers or ducted fans, they have large fuel tanks or even larger batteries. You think this scam is real? Contact him and ask for a press call so you can film it in person. He won't do it. If he does, I have no problem paying my own way to fly to Italy and film it in person. I'll do it tomorrow. I wish it were real.. or even just remotely possible, but I'm not going to stop using critical thinking just because I want it to be real. That's just religion, lol.\n\nI'm not sure why you think I don't know about my own jet engine that I've rebuilt several times and have used to make speed runs on a motorcycle on the Bonneville salt flats, but I certainly never said I don't know the engine. It's not an anecdote. It's the entire aeronautical industry. \n\nA paradigm shift gadget that turns an entire industry on its head demands extreme proof. That's why when the Segway was invented, they held countless press calls and allowed everyone to film it. Every news outlet had their own videos. People were allowed to ride it, but that's just cherry on top. The cake is being allowed to film it, rather than shit websites being the only ones regurgitating the obvious CGI released by the \"inventor\".. a known scammer who stole money from investors on prior projects, and looks to be doing the same here. Try to find any real news outlet that has covered this thing and filmed it. By all means though, send him your retirement savings. I'm sure it'll work out. Who needs due diligence?",
                          "score": 2,
                          "created_utc": 1746504278.0,
                          "replies": [
                            {
                              "id": "mqu7s2b",
                              "author": "TonyBennett3000",
                              "body": "What jet engine do you have? Any tips on finding a similar small one?",
                              "score": 1,
                              "created_utc": 1746509528.0,
                              "replies": [
                                {
                                  "id": "mquanvx",
                                  "author": "Moto_Guzzisti",
                                  "body": "There are many brands making jet engines in every size down to tiny things for RC jets. The subject is too broad to help someone find one without knowing a lot about the intended project. If you're actually interested, rather than just trying for a gotcha, start googling. Mine is about 3 ft long, and is from an old aerial unmanned target drone commonly used for test purposes. I got it cheap from a private contracting firm while I worked on the White Sands Missile Range. It was one from their inventory that never got used when their contract ended, and the target drone model was deemed obsolete as tech advancements allowed a shift in target design to much, much cheaper design schemes. It was good for my use because there are many, many parts available for it online. It wasn't designed for longevity, but I use it for short, high speed salt-flat runs, so it's fine for me, and I can just rebuild it as necessary. I'm not going to say the brand or model number. There are many options and many brands to choose from if you're going to get into jet powered stuff. Hold onto your wallet, it's an expensive hobby.",
                                  "score": 1,
                                  "created_utc": 1746511112.0,
                                  "replies": [
                                    {
                                      "id": "mqudiu5",
                                      "author": "TonyBennett3000",
                                      "body": "Ideally, I want the smallest turbofan putting out over 500lbs of thrust, I'd settle for a turbojet as well, but the fan would be better from an efficiency standpoint. I know  a fair amount about turbines in general, and have a few RC model ones, but finding larger ones is a mystery to me. If I could find a williams small turbofan I'd be thrilled, but I doubt those ever hit the civilian market.",
                                      "score": 1,
                                      "created_utc": 1746512767.0,
                                      "replies": [
                                        {
                                          "id": "mqw75yp",
                                          "author": "Moto_Guzzisti",
                                          "body": "That's a big segment. Lots of options from a decent list of manufacturers. There are models that aren't sold to the civilian market, but you can find them online. Or make friends with people in defense contracting.\n\nI once found a crashed rocketdyne engine just outside of WSMR while hiking. It was never gonna fly again so I left it there. Desert decorations, lol.",
                                          "score": 1,
                                          "created_utc": 1746543248.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqluoi9",
              "author": "Supper_Champion",
              "body": "Yeah, this looks fake as fuck.",
              "score": 3,
              "created_utc": 1746395352.0,
              "replies": []
            },
            {
              "id": "mqkn0sb",
              "author": "ModestMoose99",
              "body": "Nah, the video looks a little weird and was probably heavily edited, but it's clearly not AI or CGI. It claims to use an electric jet engine, and you can see the air displacement hitting the ground clearly throughout the video. I'm guessing it has an incredibly short runtime and it's very weird to ride, though.",
              "score": 2,
              "created_utc": 1746381651.0,
              "replies": [
                {
                  "id": "mqntdpp",
                  "author": "Moto_Guzzisti",
                  "body": "No it actually is CGI, and it is obvious to anyone with any experience in video graphic design. The plume of air displacement you're referring to is, wait for it.. CGI. Watch any Sci Fi movie. You see the same thing. Star Wars did it in the 1970s, just not as polished. Doesn't mean Sci Fi is real. You can literally do that with a few basic and well-known video AI prompts. It is also obvious to anyone who has edited videos of real objects that fly, or anyone who understands aeronautical engineering, or the physics of flying objects. This thing does not move correctly. It is also literally missing things it needs. Things that you'd be able to see. Anyway, see the long (and incomplete) list of other reasons why this thing is not possibly real. Read the entirety of my breakdown comment within my own post about this thing, within the r/gadgets sub.",
                  "score": 0,
                  "created_utc": 1746422732.0,
                  "replies": [
                    {
                      "id": "mqrc9zb",
                      "author": "ModestMoose99",
                      "body": "Yes, I am aware that sci-fi movies aren't real. But I doubt some small personal aviation company is making cgi that looks better than big budget movies. And while it's getting better, AI is still easy to spot at this point. By all means though, if you think you can get AI to make something that looks even close to this, show me. There might be some kind of video trickery/editing to make this look better, but that's definitely a real physical thing with a real person on it. \nAgain, it probably flies for 5 minutes and is loud as hell, but it more than likely exists.",
                      "score": 1,
                      "created_utc": 1746473108.0,
                      "replies": [
                        {
                          "id": "mrb2lcl",
                          "author": "ElToroBlanco25",
                          "body": "I haven't seen videos of it taking off or landing. The \"jet wash\" looks laughably fake. The thing doesn't move with real physics.",
                          "score": 1,
                          "created_utc": 1746736022.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mridmei",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1746836199.0,
                      "replies": [
                        {
                          "id": "mrpktyh",
                          "author": "Moto_Guzzisti",
                          "body": "That was a prototype which he used to get investor money, which he then stole. It didn't actually hit the market.\n\nAnyway, aside from that, look at the differences. On the jetson one, there are lift systems right where they need to be. You can see the quadcopter motors and propellers. It's large, it's heavy, it has a very short range, it's realistic. This new thing, aside from the only video in existence being proven CGI, is entirely impossible from an engineering standpoint, AS he has presented it. The technology is there for sure, and has existed for decades, but it would be bigger and much heavier. The lift system would be visible, lol. You can't hide a VTOL lift system away while it operates. It literally must be where it can get intake air, and downward thrust ducting would be very visible. Jet engines consume WAAAAY more air than you could believe, so the intake and exhaust on this would be very visible and gaping. Even the F35, being a stealth jet costing hundreds of millions of dollars and being very large, has to have the VTOL system visible and obviously exposed while in use. The thing this guy presented is a thought exercise at best, another money-grab scam at worst. Given his track record, it's probably another scam. He just didn't bother to make a real vehicle to scam investors this time, electing rather to have AI make a CGI video of something that doesn't exist.",
                          "score": 1,
                          "created_utc": 1746944590.0,
                          "replies": [
                            {
                              "id": "mu3mpg0",
                              "author": "ModestMoose99",
                              "body": "There's another video up now. Unless AI videos have advanced incredibly over the last few weeks, this is still clearly not AI. Too many little details that are correct, and none of the AI tells. I'm sure it's still not a viable product due to runtime, noise, awkward flying dynamics, etc., but it certainly appears to be a real prototype.\n\nhttps://youtu.be/Q74qlF48qX0?si=rzSe_o81r-4pOQqx",
                              "score": 1,
                              "created_utc": 1748135581.0,
                              "replies": [
                                {
                                  "id": "mu3pcwc",
                                  "author": "Moto_Guzzisti",
                                  "body": "No that's a segment from a prior video. Doesn't matter how many things are right when impossible things are wrong. It is CGI. This isn't my analysis alone. It has been discussed in engineering circles and AI CGI professional circles and has been confirmed fake. The 'creator' is a known scammer who has previously stolen investor money before abandoning 'projects'.",
                                  "score": 1,
                                  "created_utc": 1748136628.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mv2u2i0",
              "author": "g8trgr8t",
              "body": "[Star Wars Speeder Bikes Are Now Real – and They Can Fly Over 120 MPH](https://www.msn.com/en-us/news/technology/star-wars-speeder-bikes-are-now-real-and-they-can-fly-over-120-mph/ar-AA1FFgg1?ocid=entnewsntp&pc=U531&cvid=78aa43fcd20647f7b13ea2cfd7389780&ei=61)",
              "score": 1,
              "created_utc": 1748617005.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqbaxov",
          "author": "CommunalJellyRoll",
          "body": "Ducted fans are loud as fuck",
          "score": 5,
          "created_utc": 1746242122.0,
          "replies": [
            {
              "id": "mqcw6ao",
              "author": "gerwen",
              "body": "I had an tiny RC airplane with a 28mm (1.1\") ducted fan.  That thing just screamed.  Sounded great, but packed a lot of noise in a small plane.\n\nCan't imagine how this thing sounds.",
              "score": 6,
              "created_utc": 1746273690.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mt88728",
          "author": "wchris63",
          "body": "Look at the shadow behind it on the 'desert' clip.  It's AI generated, total pipe dream.",
          "score": 1,
          "created_utc": 1747706546.0,
          "replies": []
        },
        {
          "id": "mv2u0ta",
          "author": "g8trgr8t",
          "body": "[Star Wars Speeder Bikes Are Now Real – and They Can Fly Over 120 MPH](https://www.msn.com/en-us/news/technology/star-wars-speeder-bikes-are-now-real-and-they-can-fly-over-120-mph/ar-AA1FFgg1?ocid=entnewsntp&pc=U531&cvid=78aa43fcd20647f7b13ea2cfd7389780&ei=61)",
          "score": 1,
          "created_utc": 1748616992.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq75fgq",
      "author": "diacewrb",
      "body": ">Specs-wise, the flying superbike features a jet propulsion that brings it up in the air. The air vehicle can only carry one person, and its speed can reach up to 200 km/h or 124 mph. The inventor says that Volonaut Airbike also has a proprietary stabilization system. The design team enhances it using a flight computer, giving the flying superbike automatic hovering capabilities.\n\nJust need to add some blasters to it.",
      "score": 137,
      "created_utc": 1746194608.0,
      "replies": [
        {
          "id": "mq7jvxr",
          "author": "kickasstimus",
          "body": "Cool until you get a flameout or something. Then you’re falling - possibly at 124mph.",
          "score": 52,
          "created_utc": 1746198813.0,
          "replies": [
            {
              "id": "mq7mfku",
              "author": "jai151",
              "body": "Or some asshole with a lightsaber cuts off your stabilizer fins and you go spinning into a tree",
              "score": 113,
              "created_utc": 1746199531.0,
              "replies": [
                {
                  "id": "mq81s83",
                  "author": "nixboner",
                  "body": "Utini",
                  "score": 35,
                  "created_utc": 1746203896.0,
                  "replies": []
                },
                {
                  "id": "mq7n6zu",
                  "author": "kickasstimus",
                  "body": "The chances are never zero …",
                  "score": 13,
                  "created_utc": 1746199746.0,
                  "replies": []
                },
                {
                  "id": "mq945qj",
                  "author": "beegtuna",
                  "body": "![gif](giphy|l3fZS9GDy1JSWycdq)",
                  "score": 22,
                  "created_utc": 1746214972.0,
                  "replies": [
                    {
                      "id": "mv2u9ek",
                      "author": "g8trgr8t",
                      "body": "[Star Wars Speeder Bikes Are Now Real – and They Can Fly Over 120 MPH](https://www.msn.com/en-us/news/technology/star-wars-speeder-bikes-are-now-real-and-they-can-fly-over-120-mph/ar-AA1FFgg1?ocid=entnewsntp&pc=U531&cvid=78aa43fcd20647f7b13ea2cfd7389780&ei=61)",
                      "score": 0,
                      "created_utc": 1748617059.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mq9tizs",
                  "author": "ryannelsn",
                  "body": "Or EMP gun",
                  "score": 3,
                  "created_utc": 1746222662.0,
                  "replies": []
                },
                {
                  "id": "mq7uebj",
                  "author": "HarrisonSpartan",
                  "body": "This got me. Lmao!",
                  "score": 5,
                  "created_utc": 1746201783.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq9dxfo",
              "author": "Agamemnon323",
              "body": "Speed probably increases while falling.",
              "score": 7,
              "created_utc": 1746217870.0,
              "replies": []
            },
            {
              "id": "mqbopc4",
              "author": "Perfect-Mistake5435",
              "body": "I mean we have street legal bikes that go over 200 so I don't see the big deal with this",
              "score": 6,
              "created_utc": 1746248532.0,
              "replies": [
                {
                  "id": "mqem7yc",
                  "author": "nachobeeotch",
                  "body": "How about being able to be off any road.",
                  "score": 2,
                  "created_utc": 1746294514.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mqa6t49",
          "author": "theangryintern",
          "body": "Perfect for going into Tosche Station for some power converters.",
          "score": 14,
          "created_utc": 1746227193.0,
          "replies": []
        },
        {
          "id": "mq8rofw",
          "author": "AShitTonOfWeed",
          "body": "Holy shit we got speeders",
          "score": 14,
          "created_utc": 1746211262.0,
          "replies": [
            {
              "id": "mqbimxp",
              "author": "Mugaraica",
              "body": "… before GTA6",
              "score": 8,
              "created_utc": 1746245502.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq9func",
          "author": "Kirlad",
          "body": "This straight out of Akira",
          "score": 4,
          "created_utc": 1746218437.0,
          "replies": []
        },
        {
          "id": "mq923le",
          "author": "vipperofvipp",
          "body": "Watch out for Ewoks",
          "score": 4,
          "created_utc": 1746214360.0,
          "replies": []
        },
        {
          "id": "mv2u7o3",
          "author": "g8trgr8t",
          "body": "prefer their airbike\n\n[Star Wars Speeder Bikes Are Now Real – and They Can Fly Over 120 MPH](https://www.msn.com/en-us/news/technology/star-wars-speeder-bikes-are-now-real-and-they-can-fly-over-120-mph/ar-AA1FFgg1?ocid=entnewsntp&pc=U531&cvid=78aa43fcd20647f7b13ea2cfd7389780&ei=61)",
          "score": 1,
          "created_utc": 1748617046.0,
          "replies": []
        },
        {
          "id": "mqhu7t8",
          "author": "Moto_Guzzisti",
          "body": "Spec-wise, it doesn't exist and is entirely AI-generated CGI.",
          "score": 1,
          "created_utc": 1746338948.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7t3zd",
      "author": "OddNothic",
      "body": "Does not list flight time, guessing about three minutes.",
      "score": 62,
      "created_utc": 1746201418.0,
      "replies": [
        {
          "id": "mq97i62",
          "author": "GrafZeppelin127",
          "body": "Well, in fairness, the similar Williams X-Jet from a few decades back could fly for 30-45 minutes, but the concept never went anywhere because it was basically had all the downsides of a helicopter, but even worse—and didn’t even do better at any of the helicopter’s upsides, either.",
          "score": 24,
          "created_utc": 1746215970.0,
          "replies": []
        },
        {
          "id": "mqa0w42",
          "author": "Forward_Willow123",
          "body": "20 minute flight time apparently.",
          "score": 14,
          "created_utc": 1746225150.0,
          "replies": [
            {
              "id": "mqb3me9",
              "author": "KnightedIbis",
              "body": "Need to 6x that and I’m down.",
              "score": 6,
              "created_utc": 1746239148.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq96n90",
          "author": "Knut79",
          "body": "5 at most.",
          "score": 3,
          "created_utc": 1746215716.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7a7vl",
      "author": "None",
      "body": "I bet the One Wheel community is losing their shit right now.",
      "score": 40,
      "created_utc": 1746196036.0,
      "replies": [
        {
          "id": "mq88jgo",
          "author": "ImperialTzarNicholas",
          "body": "lol I hilariously only got an electric unicycle because I was obsessed with the Williams x-jet ( https://youtu.be/wLsqyphVERA?si=b42NoSY2PyrU8muq ). The video for the device is even shown in nearly identical ways (demonstrating maneuverability via forest.    I may be wrong but the device when launched for public use back in the 1970s was like 35k.   But Basicly even then the device controls like an EUC or Segway.",
          "score": 13,
          "created_utc": 1746205802.0,
          "replies": [
            {
              "id": "mq8g2yk",
              "author": "DanimusMcSassypants",
              "body": "I remember when they incorporated a version of the x-jet into the GI Joe universe.  I knew then that the future had truly arrived.",
              "score": 3,
              "created_utc": 1746207916.0,
              "replies": [
                {
                  "id": "mq98xyu",
                  "author": "None",
                  "body": "The Trouble Bubble!",
                  "score": 3,
                  "created_utc": 1746216396.0,
                  "replies": [
                    {
                      "id": "mr61snw",
                      "author": "albtraum2004",
                      "body": "don't forget about serpentor's air chariot! that had fans, though.",
                      "score": 1,
                      "created_utc": 1746666084.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mq9op4f",
          "author": "RedCrabb",
          "body": "I love my Onewheel, would not get on that thing ever",
          "score": 1,
          "created_utc": 1746221115.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq8jfg3",
      "author": "Fluid_Maybe_6588",
      "body": "I’m pretty sure this thing glides about as well as a meatball sub if the engine quits.",
      "score": 35,
      "created_utc": 1746208860.0,
      "replies": [
        {
          "id": "mq9os8f",
          "author": "djshadesuk",
          "body": "I'm glad someone else thought that. For a moment I was beginning to think the definition of Glide had been secretely changed to mean the exact opposite.",
          "score": 17,
          "created_utc": 1746221142.0,
          "replies": []
        },
        {
          "id": "mqbes0j",
          "author": "damndammit",
          "body": "It glides; just very steeply.",
          "score": 13,
          "created_utc": 1746243773.0,
          "replies": [
            {
              "id": "mqm3dop",
              "author": "VayVay42",
              "body": "1:∞ glide ratio...",
              "score": 2,
              "created_utc": 1746398345.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqaf671",
          "author": "Utter_Rube",
          "body": "Yeah, really not sure why they used the word \"glide\" in the promo material... thing definitely needs to be powered at all times",
          "score": 9,
          "created_utc": 1746230082.0,
          "replies": []
        },
        {
          "id": "mqd4h7m",
          "author": "FartedBlood",
          "body": "You can land any aerial vehicle at least once.",
          "score": 5,
          "created_utc": 1746277166.0,
          "replies": [
            {
              "id": "mqhsnfw",
              "author": "GQ_silly_QT",
              "body": "Every time in fact.",
              "score": 1,
              "created_utc": 1746338056.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq942bd",
      "author": "Incontinento",
      "body": "There's no gliding. None. No wings equals no glide. You turn the engine off and you are plummeting into the Earth.",
      "score": 16,
      "created_utc": 1746214944.0,
      "replies": [
        {
          "id": "mqd13p7",
          "author": "duhvorced",
          "body": "> no wings equals no glide\n\nGyrocopters and autorotation enter the chat.",
          "score": 3,
          "created_utc": 1746275809.0,
          "replies": [
            {
              "id": "mqd2v1e",
              "author": "Incontinento",
              "body": "The blades are rapidly spinning \"wings,\" essentially.",
              "score": 5,
              "created_utc": 1746276532.0,
              "replies": [
                {
                  "id": "mqd629q",
                  "author": "duhvorced",
                  "body": "… much like the compressor blades in this contraption’s jet engine?\n\n[‘Just arguing for argument’s sake here, to point out that “has wings” is a slippery slope.  Maybe “maneuverable flight surfaces” would be a more-correct term?\n\n… but, whatever.  We all know what you mean. 🙂]",
                  "score": 0,
                  "created_utc": 1746277778.0,
                  "replies": [
                    {
                      "id": "mqd6frl",
                      "author": "Incontinento",
                      "body": "Try auto rotating this thing, then get back to me.",
                      "score": 3,
                      "created_utc": 1746277921.0,
                      "replies": [
                        {
                          "id": "mqdb3t5",
                          "author": "duhvorced",
                          "body": "Nah, you first.  Tell me why helicopter blades are wings but compressor fan blades aren't.",
                          "score": 0,
                          "created_utc": 1746279635.0,
                          "replies": [
                            {
                              "id": "mqddj8p",
                              "author": "Incontinento",
                              "body": "Nah, enjoy your pedantry all by yourself.",
                              "score": 2,
                              "created_utc": 1746280478.0,
                              "replies": []
                            },
                            {
                              "id": "mql41c5",
                              "author": "Fuzzy_Foundation6806",
                              "body": "Compressor fan blades have an airfoil profile, sure, but I guarantee they are not helping me not die in a helicopter autorotation. They aren't producing lift here, they're producing a thrust vector that overcomes drag/gravity. Think rocket, not helicopter.",
                              "score": 2,
                              "created_utc": 1746386942.0,
                              "replies": [
                                {
                                  "id": "mqli5ix",
                                  "author": "duhvorced",
                                  "body": "This is actually a good argument, one that I will happily concede.\n\nThe only other (weak) argument I could offer here is that you don't need \\[much\\] lift to have a non-zero glide ratio.  Any configuration and orientation of the vehicle + pilot that imparts forward motion while falling arguably results in \"gliding\".  Albeit with a still-fatal end result.\n\nAnd I'll just self-counter-argue that by pointing to the Unpowered flight section of the Wikipedia article on [Flying and Gliding Animals](https://en.wikipedia.org/wiki/Flying_and_gliding_animals#Unpowered), that defines gliding thusly:\n\n>Gliding flight: falling at an angle less than 45° from the horizontal with lift from adapted aerofoil membranes.\n\n... which is probably as good a definition as any.  And definitely rules out the vehicle above.",
                                  "score": 0,
                                  "created_utc": 1746391370.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq8kox5",
      "author": "msherretz",
      "body": "This can't be true because they didn't mention adding AI to the control software",
      "score": 18,
      "created_utc": 1746209222.0,
      "replies": [
        {
          "id": "mqa7fjj",
          "author": "LARGames",
          "body": "Things like this are what AI is actually good at.",
          "score": 6,
          "created_utc": 1746227406.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq9y5pp",
      "author": "CrailFlap",
      "body": "We got the Oppressor in real life before GTA 6",
      "score": 13,
      "created_utc": 1746224208.0,
      "replies": [
        {
          "id": "mqasfhv",
          "author": "WeOutHereInSmallbany",
          "body": "Jfc 😂 and they literally delayed the game again today",
          "score": 3,
          "created_utc": 1746234914.0,
          "replies": []
        },
        {
          "id": "mqtuydu",
          "author": "Rymazon",
          "body": "I literally came here just to leave that exact comment lol 💀",
          "score": 1,
          "created_utc": 1746503471.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq790vj",
      "author": "TLKimball",
      "body": "People are going to die.",
      "score": 35,
      "created_utc": 1746195684.0,
      "replies": [
        {
          "id": "mq7ey9x",
          "author": "TheSecretofBog",
          "body": "Came here to see this comment. Unless the license to operate one is super stringent and requires as much training as a pilot, these will simply become urban guided missiles.",
          "score": 18,
          "created_utc": 1746197403.0,
          "replies": [
            {
              "id": "mq9wjzh",
              "author": "nathism",
              "body": "the current administration will treat it like the e-scooters and leave it to the cities",
              "score": 11,
              "created_utc": 1746223663.0,
              "replies": [
                {
                  "id": "mqjsivy",
                  "author": "Insert_Blank",
                  "body": "This is a good idea.  I can already see these things crashed on the side of the road in shady parts of town.",
                  "score": 1,
                  "created_utc": 1746372386.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mqde67n",
              "author": "taz_78",
              "body": "Somewhat guided missiles.",
              "score": 6,
              "created_utc": 1746280697.0,
              "replies": [
                {
                  "id": "mqhtdex",
                  "author": "GQ_silly_QT",
                  "body": "This the real answer lmao",
                  "score": 2,
                  "created_utc": 1746338466.0,
                  "replies": [
                    {
                      "id": "mqhtfy9",
                      "author": "GQ_silly_QT",
                      "body": "They had an intended direction",
                      "score": 2,
                      "created_utc": 1746338506.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mqawwz7",
              "author": "haarschmuck",
              "body": "You would need a pilots license to fly this. It's an aircraft. \n\nMax speed for the ultralight category where you don't need a license is 55kts. This exceeds that.",
              "score": 3,
              "created_utc": 1746236593.0,
              "replies": []
            },
            {
              "id": "mq7wpfg",
              "author": "Maleficent-Owl",
              "body": "Legally, this thing's weight and top speed are high enough to qualify it as a full-sized aircraft, not an ultralight, so you would need an actual private pilot's license and FAA airworthiness certification for the aircraft. We already have the legal framework for this kind of thing, and it involves miles of red tape for a new craft like this.\n\nI'm not an expert, but that's what a few minutes of searching turned up.",
              "score": 7,
              "created_utc": 1746202443.0,
              "replies": []
            },
            {
              "id": "mqbsrmr",
              "author": "calcium",
              "body": "Wait until the tech bros start getting them…",
              "score": 1,
              "created_utc": 1746250721.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq88s2x",
          "author": "jpweaver303",
          "body": "But, but, cars….",
          "score": 5,
          "created_utc": 1746205869.0,
          "replies": []
        },
        {
          "id": "mqa64va",
          "author": "andrw_xxx",
          "body": "We all are eventually anyway",
          "score": 5,
          "created_utc": 1746226962.0,
          "replies": [
            {
              "id": "mqaahsg",
              "author": "TLKimball",
              "body": "My preference is in bed with a cat on my lap rather than impaled on tree branches.",
              "score": 8,
              "created_utc": 1746228453.0,
              "replies": [
                {
                  "id": "mqar187",
                  "author": "picklepaller",
                  "body": "Or strangled on a 500kV transmission line.",
                  "score": 7,
                  "created_utc": 1746234398.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq7uf7b",
          "author": "Rawt0ast1",
          "body": "Open sourcing 9/11",
          "score": 10,
          "created_utc": 1746201790.0,
          "replies": []
        },
        {
          "id": "mqdt252",
          "author": "Designer-Cry1940",
          "body": "People die every day.",
          "score": 1,
          "created_utc": 1746285525.0,
          "replies": []
        },
        {
          "id": "n68yvfj",
          "author": "Lord-Liberty",
          "body": "Doubt this is much more dangerous than motorcycles",
          "score": 1,
          "created_utc": 1754000815.0,
          "replies": []
        },
        {
          "id": "mq7prf8",
          "author": "PixelAstro",
          "body": "Probably safer than motorcycles",
          "score": -5,
          "created_utc": 1746200478.0,
          "replies": [
            {
              "id": "mqa6k6y",
              "author": "ExdigguserPies",
              "body": "It's like a motorcycle, but in the sky. Yes, it must be safer!",
              "score": 6,
              "created_utc": 1746227108.0,
              "replies": []
            },
            {
              "id": "mq7qpc6",
              "author": "TLKimball",
              "body": "I doubt that.",
              "score": 9,
              "created_utc": 1746200742.0,
              "replies": [
                {
                  "id": "mq7x851",
                  "author": "PixelAstro",
                  "body": "Motorcycles have to contend with other drivers and road conditions. I reckon that most motorcycle accidents are because of human error, if this engine stabilization is reliable it might be less dangerous.",
                  "score": 4,
                  "created_utc": 1746202593.0,
                  "replies": [
                    {
                      "id": "mq7xuu7",
                      "author": "TLKimball",
                      "body": "Trees, mechanical/electrical failure/wind/gravity…",
                      "score": 8,
                      "created_utc": 1746202770.0,
                      "replies": [
                        {
                          "id": "mq7yakv",
                          "author": "PixelAstro",
                          "body": "Pick your poison",
                          "score": 0,
                          "created_utc": 1746202894.0,
                          "replies": []
                        },
                        {
                          "id": "mq8abft",
                          "author": "PaulWoolsey",
                          "body": "Those are all ALSO issues for motorcycles, technically. \n\nYou would at least trade “humans are dumb, panicky animals” for “gravity can and will kill you at any moment. Be prepared.” At least gravity is consistent.",
                          "score": -1,
                          "created_utc": 1746206300.0,
                          "replies": [
                            {
                              "id": "mq8f906",
                              "author": "TLKimball",
                              "body": "I don’t see any braking mechanism, roll bars, or airbags on this contraption.  Maybe there are seatbelts but that only ensures that some of your body can be found with the wreckage.",
                              "score": 5,
                              "created_utc": 1746207681.0,
                              "replies": [
                                {
                                  "id": "mq8ir4k",
                                  "author": "PaulWoolsey",
                                  "body": "I’ve never seen rollbars or airbags on a motorcycle either. Given that it is essentially an oversized drone, from a performance perspective, we can expect similar physics. So we should think less of braking (there’s nothing to apply friction to, for one thing), and more of “acceleration in the opposite direction.” \n\nWith all that said: we know NOTHING about this vehicle apart from a few videos. There are no specs. No closeups. No feature lists. No actual hands-on anything. \n\nI’m not holding my breath on whether this thing ever hits the public. Likely it’ll end up in some rich nerd’s private collection painted up like a Star Wars speeder bike. \n\nBut if it does hit the public, it won’t do so without adequate safety regulations. At least as adequate as modern motorcycles. Most of that safety comes in the form of “wear a helmet, don’t be an idiot, and you signed the waiver.”",
                                  "score": 3,
                                  "created_utc": 1746208669.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mqchvth",
                      "author": "meh4ever",
                      "body": "Almost half of all motorcycle wrecks are single vehicle incidents. Wanna know how to tone that number down? Stop doing dumb shit.",
                      "score": 3,
                      "created_utc": 1746266145.0,
                      "replies": []
                    },
                    {
                      "id": "mqb0f4u",
                      "author": "MattInSoCal",
                      "body": "If your human error comment applies much moreso to the operators of the motorcycles than the unsuspecting vehicle operators being just barely missed when they are passed by a death missile lane splitting 65 MPH above the posted speed limit, I’ll agree. Not to mention the takeover gangs doing wheelies across several lanes of the freeway in heavy traffic. Lots of meat crayons to be found in the early morning hours crossing Camp Pendleton, especially on the coastal side of the base, who weren’t as invincible as they thought. \n\nI have nothing at all against safe operators, but on the Southern California streets and highways it’s rare to see one.\n\nIf they ever do commercialize this, I hope they limit the maximum altitude to something less than the height of a house. I can’t imagine how many of these would fall out of the sky, and that’s before people start attempting trick riding.",
                      "score": 1,
                      "created_utc": 1746237902.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mq90l56",
              "author": "Unique-Fan-3042",
              "body": "A low bar",
              "score": 2,
              "created_utc": 1746213907.0,
              "replies": [
                {
                  "id": "mq91ik6",
                  "author": "PixelAstro",
                  "body": "Very!",
                  "score": 1,
                  "created_utc": 1746214184.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq95wyn",
      "author": "thesamim",
      "body": "ELI5: how can it \"glide\" if there are no visible lift surfaces? \n\nI mean, hover I get. \n\nBut when the engine quits?",
      "score": 10,
      "created_utc": 1746215500.0,
      "replies": []
    },
    {
      "id": "mq9ct6j",
      "author": "ajhedges",
      "body": "Glide? You sure about that?",
      "score": 7,
      "created_utc": 1746217542.0,
      "replies": [
        {
          "id": "mqbgtaw",
          "author": "richcournoyer",
          "body": "Rocks glide, right?",
          "score": 6,
          "created_utc": 1746244667.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7zijd",
      "author": "johnnytoothpaste",
      "body": "Cue up the gta griefers",
      "score": 13,
      "created_utc": 1746203248.0,
      "replies": [
        {
          "id": "mqaaw0v",
          "author": "TsunGeneralGrievous",
          "body": "All i could think of if it comes to LA is a bunch of people flying around shooting rockets",
          "score": 11,
          "created_utc": 1746228588.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7skr8",
      "author": "kadinshino",
      "body": "and to think, this was what i thought the hardest thing in star wars would be to build. and here we are....",
      "score": 11,
      "created_utc": 1746201269.0,
      "replies": [
        {
          "id": "mq8cjta",
          "author": "mildirritation",
          "body": "Not the Death Star?",
          "score": 13,
          "created_utc": 1746206920.0,
          "replies": [
            {
              "id": "mq8jfhh",
              "author": "ChimRichaldsOBGYN",
              "body": "Ha. Or any of the myriad of faster than light traveling space ships.",
              "score": 11,
              "created_utc": 1746208860.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq7gtu2",
      "author": "ramsey17",
      "body": "Throw some homing missiles on there and your laughing. Rockstar should get some credit here.",
      "score": 12,
      "created_utc": 1746197941.0,
      "replies": []
    },
    {
      "id": "mq964dj",
      "author": "Knut79",
      "body": "Jeez.\n\nTurbine powered so it flies for a max of 5 minutes.\n\nOn top of that. Your legs are in a position they should NEVER be when a turbine is starting up. (Never stand perpendicular to a turbine starting up unless you enjoy having hypersonic micro death blades flying through your body if something goes wrong)\n\nAnd we're not including that these turbines should be sent in for maintenance at the manufacturer every X amount of flying hours.",
      "score": 4,
      "created_utc": 1746215560.0,
      "replies": []
    },
    {
      "id": "mqbkzlw",
      "author": "seddit_rucks",
      "body": "Battlestar Galactica had a brief sequel series in 1980.  People were pissed that the OG series had been cancelled so rapidly, so the network contacted the producer, and gave him the green light for the sequel series.\n\n...but no money for it.  The original series was far too expensive for a TV show, that's one of the main reasons it was canceled.  So the sequel nixed Apollo & Starbuck, recycled a lot of the effects, and even changed up the premise: Galactica had finally found Earth, and the crew was trying to figure out what to do next.\n\nSetting most of the action on contemporary Earth made budgetary sense.  Want to film a bar scene?  Go to a regular bar and film it.  Most of the \"costumes\" were off-the-rack regular clothes.  Cheap and easy.\n\nBut it wasn't like the Galactica bellied up to Earth and announced their presence.  They wanted to do some surveillance, so they sent a couple spies to the planet, to infiltrate modern American society.  They were given modern clothes, currency, and transportation that could help them blend in.  I think there was maybe a hint of Prime Directive going on, something like that.\n\nAnyway, and thanks for staying with me here, that transportation was pretty cool to 8-year old me.  Believe me, just a few years later, I was avidly catching as many episodes as I could of Knight Rider, Airwolf, Streethawk, Blue Thunder, Viper, and all the other shows based around cool vehicles.  But that sequel series?  That's where it started for me.\n\nBecause, and I can hardly believe I'm typing this, but it's totally true: Battlestar Galactica had flying motorcycles, and [here](https://www.youtube.com/watch?v=y7CvyLCZtMg) is the receipt.  And believe me again: even 8-year old me looked at that and thought \"This is stupid, those guys are going to kill themselves.\"\n\nI remain convinced that the meager budget would have served the show much better had it been spent on Apollo & Starbuck, rather than a pair of stupid flying motorcycles.  Life lesson.",
      "score": 5,
      "created_utc": 1746246642.0,
      "replies": [
        {
          "id": "mqbxrv6",
          "author": "Buscemi_D_Sanji",
          "body": "Haha I appreciated the backstory on this!",
          "score": 2,
          "created_utc": 1746253594.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqqfy7z",
      "author": "shralpy39",
      "body": "None of these articles or videos have any real technical details beyond marketing copy that is similar to Chinese e-bike marketing copy. It's all talking about \"lightweight carbon fiber\" and \"how you have a 360 view\" when a vehicle like this would be revolutionary from a technical engineering perspective. There is no direct discussion of the power system or how it's controlled other than \"proprietary stabilization\". The videos on the company's youtube channel are weirdly coordinated, and the website looks like something you would build in middle school computer class.\n\nI just don't believe this thing is real. I think this is someone trying to build it and generating investment interest or revenue, and frankly I don't think this type of vehicle is possible for someone to build currently. At least that size and as described.\n\nIt's too powerful and light, it would be incredibly unstable even with a very well-configured and powerful flight computer. If it truly has ONE jet engine and no spinning props (as the website claims) there is just no way you'd be able to have yaw control or reasonably slow down from 124mph without becoming unstable.\n\n\"With the real JetCat, data the calculus tips hard against feasibility: **the Airbike would guzzle roughly a gallon of Jet‑A per minute**, so any credible demo flight would need a sizeable, visible fuel tank and considerably more thrust than three P400s can deliver.\"   Revision of the most critical article reveals the fuel/power situation is actually worse than even they estimated.\n\nAnd regarding control:\n\n# Stopping from 124 mph: the energy you must dump\n\n* **Drag alone won’t do it.** Assuming a frontal area \\~0.5 m² and a bluff‑body drag coefficient ≈1.0, parasitic drag at 200 km/h (55 m/s) is only \\~900 N ≈ **200 lbf**.\n* The claimed all‑up thrust is \\~300 lbf (three JetCat‑class turbines). To decelerate in, say, 6–8 s you must pitch the bike back ≥35‑40 ° to vector most of that thrust rearwards, while still keeping enough vertical component to stay airborne. That demands a **large gimbal angle** and very fast flight‑computer corrections; nothing on the Airbike CAD images suggests such a mechanism.\n* Any miss‑timed pitch‑up at those speeds would torque‑roll the pilot into a flat spin, precisely because there is no tailplane or wing to stabilise the manoeuvre.\n\n  \nUnless Volonaut can point to:\n\n* **Twin or multi‑engine architecture** (or clearly visible reaction‑control jets) that create yaw authority in hover, **and**\n* A tested high‑deflection gimbal or air‑brake system able to vector 300‑plus lbf of thrust rearwards for deceleration,\n\n…the Airbike’s single‑jet concept cannot satisfy even the first‑order physics of yaw control or safe high‑speed braking. Current footage and press‑kit renders show none of the hardware that serious VTOL builders use, scepticism is well‑founded.",
      "score": 5,
      "created_utc": 1746463722.0,
      "replies": [
        {
          "id": "mrie11i",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1746836350.0,
          "replies": [
            {
              "id": "mrigxp4",
              "author": "shralpy39",
              "body": "That's just what he's betting on, I think. There are some fundamental differences between them that are not apples to apples. There is a reason hobbyists can build amazing quadcopters at home and few are building cool jet-powered vehicles.\n\nIf you want to make this point, go for it, but please support it with some actual arguments instead of just blindly believing the marketing.",
              "score": 1,
              "created_utc": 1746837452.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq7qc5l",
      "author": "DanBarLinMar",
      "body": "This was what the Wright Brothers dreamed of",
      "score": 3,
      "created_utc": 1746200639.0,
      "replies": []
    },
    {
      "id": "mq8ptj0",
      "author": "pmxp",
      "body": "I see someone finally made an IRL version of the Tears of the Kingdom hoverbike!",
      "score": 3,
      "created_utc": 1746210712.0,
      "replies": []
    },
    {
      "id": "mq8xsu5",
      "author": "milelongpipe",
      "body": "Star Wars coming true!",
      "score": 3,
      "created_utc": 1746213077.0,
      "replies": [
        {
          "id": "mq91nv3",
          "author": "Gnarl3yNick",
          "body": "Queue the speeder hums that are now stuck in my head.",
          "score": 3,
          "created_utc": 1746214227.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqca79r",
      "author": "wellwellwelly",
      "body": "I don't know why everyone is shitting on this and moaning about it. It's cool as fuck.",
      "score": 3,
      "created_utc": 1746261225.0,
      "replies": []
    },
    {
      "id": "mq7c5kb",
      "author": "AtariAtari",
      "body": "This is great for getting some more organ donations!",
      "score": 6,
      "created_utc": 1746196597.0,
      "replies": [
        {
          "id": "mq869pg",
          "author": "StatisticallySoap",
          "body": "What use the organs gonna be if the splatter radius for them is 3 meters wide upon impact though",
          "score": 5,
          "created_utc": 1746205158.0,
          "replies": [
            {
              "id": "mq91nf0",
              "author": "gargravarr2112",
              "body": "Salsa donations.",
              "score": 4,
              "created_utc": 1746214224.0,
              "replies": []
            },
            {
              "id": "mq8pqrh",
              "author": "Addmoregunpowder",
              "body": "Easy to find organs though. No need for surgery. Need a spleen? Its right over there",
              "score": 2,
              "created_utc": 1746210689.0,
              "replies": [
                {
                  "id": "mqb2lvo",
                  "author": "Fafnir13",
                  "body": "…and there….and there….and there…",
                  "score": 1,
                  "created_utc": 1746238746.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq7wkik",
          "author": "Cat-Cow-Boy",
          "body": "Man that’s great for getting tacos!!!",
          "score": 2,
          "created_utc": 1746202405.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7amio",
      "author": "OrangeRipple55",
      "body": "Reminds me of this \n\nhttps://youtu.be/7WrOz05mtcs?si=PQkgF21unByUjXEL",
      "score": 2,
      "created_utc": 1746196154.0,
      "replies": []
    },
    {
      "id": "mq7jt2i",
      "author": "Adventurous-Start874",
      "body": "If these go to mass market, surely they would have a regulator to limit how high you can go, say 15 inches off the ground maybe. Traffic height. Right?",
      "score": 2,
      "created_utc": 1746198791.0,
      "replies": [
        {
          "id": "mqb2vda",
          "author": "Fafnir13",
          "body": "These will never be a mass market item, don’t worry.",
          "score": 2,
          "created_utc": 1746238849.0,
          "replies": []
        },
        {
          "id": "mq9wwgq",
          "author": "Strooonzo",
          "body": "Right?",
          "score": 1,
          "created_utc": 1746223779.0,
          "replies": [
            {
              "id": "mqa2a7m",
              "author": "Adventurous-Start874",
              "body": "Anybody?",
              "score": 1,
              "created_utc": 1746225638.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mqax9v7",
          "author": "haarschmuck",
          "body": "You would need a pilots license to operate this. It exceeds the max speed for the ultralight category, the only category where you don't need a license to fly.",
          "score": 1,
          "created_utc": 1746236724.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq8s98b",
      "author": "redditmademeregister",
      "body": "That’s probably the only place safe enough to use it. People can barely operate something that moves on the ground.  \n\nTo add to that, In the US because it’s in the air they’d have to get some sort of license from the FAA and the large majority of those people would fail that test.",
      "score": 2,
      "created_utc": 1746211433.0,
      "replies": []
    },
    {
      "id": "mq9zoh4",
      "author": "EkimGoRedd",
      "body": "Man I hate not being able to trust my own eyes. I want it to be true, but parts of the video look like poorly done green screen.",
      "score": 2,
      "created_utc": 1746224729.0,
      "replies": []
    },
    {
      "id": "mqa4zyx",
      "author": "roboticfedora",
      "body": "If they'd just admit to and release ufo tech.",
      "score": 2,
      "created_utc": 1746226576.0,
      "replies": []
    },
    {
      "id": "mqa8tny",
      "author": "mishyfuckface",
      "body": "Drone that you straddle*",
      "score": 2,
      "created_utc": 1746227881.0,
      "replies": []
    },
    {
      "id": "mqb1zf5",
      "author": "handsoffdick",
      "body": "Terrible video",
      "score": 2,
      "created_utc": 1746238506.0,
      "replies": []
    },
    {
      "id": "mqc39fz",
      "author": "greifinn24",
      "body": "watched a couple of vids of this, the rider looks very stiff like he is afraid of upsetting the balance . doesn´t even move his head fast.",
      "score": 2,
      "created_utc": 1746256878.0,
      "replies": []
    },
    {
      "id": "mqe2ag3",
      "author": "None",
      "body": "Motorskycle",
      "score": 2,
      "created_utc": 1746288409.0,
      "replies": []
    },
    {
      "id": "mq7i538",
      "author": "Medium_Banana4074",
      "body": "Wasted potential. They should have it look like one of those speeder bikes. I mean, they're halfway there already.\n\nHowever: I wouldn't ride this. Ever. There seems to be no redundancy on an inherently unstable craft.",
      "score": 2,
      "created_utc": 1746198318.0,
      "replies": []
    },
    {
      "id": "mq8miu1",
      "author": "StimulatedUser",
      "body": "this looks so fake, is there any vids that show how it works?",
      "score": 2,
      "created_utc": 1746209745.0,
      "replies": [
        {
          "id": "mqax5hq",
          "author": "haarschmuck",
          "body": "It's real, but the danger is these kinds of aircraft use air as thrust. This means that any power loss results it in dropping like a rock. \n\nHelicopters on the other hand use rotating airfoils, which generate lift and in the event of power loss can actually glide a little.",
          "score": 2,
          "created_utc": 1746236679.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7a7hz",
      "author": "skysquid3",
      "body": "Some of the footage feels generated to me. Not trying to jam them, but just doesn’t look right. Like the lack of shadow around 1:42. Doesn’t feel right. Website doesn’t have a lot of detail and other online videos seem AI. I don’t think it is real. I want it to be real!",
      "score": 2,
      "created_utc": 1746196033.0,
      "replies": [
        {
          "id": "mq8917o",
          "author": "The_Procrastibator",
          "body": "There's a shadow to the bottom left",
          "score": 3,
          "created_utc": 1746205940.0,
          "replies": []
        },
        {
          "id": "mq7j4xa",
          "author": "nailbunny2000",
          "body": "100% this is suspicious as hell. I don't think it's AI, but it sure looks too cool to be true.\n\nEdit: This is actually a different video than I saw the other day, I had to edit my entire comment as this is far more impressive than what I saw before. Some actual wide angle shot shots, etc.  I can't get how it is so stable, and I'm still very skeptical, but it certainly seems more legit than I thought.",
          "score": 4,
          "created_utc": 1746198601.0,
          "replies": [
            {
              "id": "mqs27kh",
              "author": "A_typical_native",
              "body": "Look at the Williams X Jet from the 80's, this tech is old, this is just modernized and miniaturized.",
              "score": 1,
              "created_utc": 1746480788.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq7fgrs",
          "author": "Silly-Victory8233",
          "body": "Wife showed me this last night and there was a lot about the video that looked fake.",
          "score": -1,
          "created_utc": 1746197550.0,
          "replies": []
        },
        {
          "id": "mq8iv3s",
          "author": "EverSeeAShitterFly",
          "body": "Some of it looked like a video game with really high quality graphics.",
          "score": 0,
          "created_utc": 1746208701.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq7iyhs",
      "author": "mkvii1989",
      "body": "GTAO griefers all have full erections right now.",
      "score": 1,
      "created_utc": 1746198551.0,
      "replies": [
        {
          "id": "mq7np42",
          "author": "kbthewriter",
          "body": "This bike reminds me a lot of the Opressor Mk2",
          "score": 1,
          "created_utc": 1746199889.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq87pod",
      "author": "ric0shay",
      "body": "I always think this types of systems will be excellent for first responders.",
      "score": 1,
      "created_utc": 1746205566.0,
      "replies": [
        {
          "id": "mq9jpv8",
          "author": "PreposterousHalcyon",
          "body": "Imagine the uses for delivering supplies and medevac in war zones too. Small enough to maybe not get targeted by SAMs, wont set off mines, etc.",
          "score": 1,
          "created_utc": 1746219573.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq89w94",
      "author": "SirButternutsIII",
      "body": "![gif](giphy|1x2mV3HdX1og7JYqNB)",
      "score": 1,
      "created_utc": 1746206180.0,
      "replies": []
    },
    {
      "id": "mq8begi",
      "author": "4889645",
      "body": "I love the part of the video where the rider is purposefully striding to the bike in a dimly lit building with a low roof.  “I love my air bike”. Bonk!!",
      "score": 1,
      "created_utc": 1746206602.0,
      "replies": []
    },
    {
      "id": "mq8hzwd",
      "author": "EverSeeAShitterFly",
      "body": "Shit will be crazy once they put missiles on it.",
      "score": 1,
      "created_utc": 1746208456.0,
      "replies": []
    },
    {
      "id": "mq90xmg",
      "author": "Incorporeal999",
      "body": "I'd put pontoons on it and cruise over water at a safe speed and height, maybe.",
      "score": 1,
      "created_utc": 1746214009.0,
      "replies": []
    },
    {
      "id": "mq9gyc3",
      "author": "OutrageXXX",
      "body": "https://youtu.be/BLwe7UqUX7k?si=p-wOy29s3gGfPGv_",
      "score": 1,
      "created_utc": 1746218761.0,
      "replies": []
    },
    {
      "id": "mq9hfnk",
      "author": "jtinz",
      "body": "Oh, it's something new. I thought it was about the [Williams X-Jet](https://en.m.wikipedia.org/wiki/Williams_X-Jet).",
      "score": 1,
      "created_utc": 1746218901.0,
      "replies": [
        {
          "id": "mqs2ovb",
          "author": "A_typical_native",
          "body": "Yeah, tons of people see this and think \"it can't be real\"\n\nThis has been done before over 40 years ago. This is just modernized and miniaturized.",
          "score": 1,
          "created_utc": 1746480939.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq9ovt9",
      "author": "Scottishlassincanada",
      "body": "Hagred rides again!!!",
      "score": 1,
      "created_utc": 1746221172.0,
      "replies": []
    },
    {
      "id": "mq9slil",
      "author": "WestSea76",
      "body": "“I’ll get you my, pretty!” 🧙‍♀️",
      "score": 1,
      "created_utc": 1746222363.0,
      "replies": []
    },
    {
      "id": "mqa1g6d",
      "author": "Apprehensive_Web803",
      "body": "Oh cool, hover crafts.",
      "score": 1,
      "created_utc": 1746225345.0,
      "replies": []
    },
    {
      "id": "mqa2aes",
      "author": "ThoughtFission",
      "body": "Wouldn't want to get the equivalent of a flat tire, even at 20 or 30 meters.",
      "score": 1,
      "created_utc": 1746225640.0,
      "replies": []
    },
    {
      "id": "mqae25y",
      "author": "Legitimate_Drive_693",
      "body": "How fast I could get to work every day",
      "score": 1,
      "created_utc": 1746229692.0,
      "replies": []
    },
    {
      "id": "mqasbhz",
      "author": "WeOutHereInSmallbany",
      "body": "Playing too much GTA Online",
      "score": 1,
      "created_utc": 1746234873.0,
      "replies": []
    },
    {
      "id": "mqaxvwl",
      "author": "Buckwheat469",
      "body": "Reminds me of the book Ringworld by Larry Niven. He described some flying motorcycles in detail at the start of the book, with one notable description being that they create rotating wind currents that trap a feather and levitate it along with the flying vehicle (I read it nearly 30 years ago, could be misremembering).",
      "score": 1,
      "created_utc": 1746236947.0,
      "replies": [
        {
          "id": "mqb1yhq",
          "author": "Sibby_in_May",
          "body": "I remember that. The Logan’s Run book (not movie) had something similar as well.",
          "score": 1,
          "created_utc": 1746238496.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mqb0ogv",
      "author": "rudyattitudedee",
      "body": "This will never make it to the public.",
      "score": 1,
      "created_utc": 1746238000.0,
      "replies": [
        {
          "id": "mqeprki",
          "author": "GagOnMacaque",
          "body": "I'm going to guess because the FAA will never clear this for the public, just like the Moller sky car.\n\nThis might be something for search and rescue, military, firefighting.",
          "score": 1,
          "created_utc": 1746295569.0,
          "replies": [
            {
              "id": "mqgxaxh",
              "author": "rudyattitudedee",
              "body": "Because the size and speed will make it so that everyone needs a pilot license, based on the specs I could find.",
              "score": 1,
              "created_utc": 1746323656.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mqb10ff",
      "author": "Irrelevantitis",
      "body": "Megaforce!",
      "score": 1,
      "created_utc": 1746238127.0,
      "replies": []
    },
    {
      "id": "mqbc5ew",
      "author": "arcana73",
      "body": "Can’t wait to see how the military weaponizes this",
      "score": 1,
      "created_utc": 1746242645.0,
      "replies": []
    },
    {
      "id": "mqbc89v",
      "author": "AnyAtmosphere420",
      "body": "I hope they include heat seaking missiles to an accessory package.",
      "score": 1,
      "created_utc": 1746242680.0,
      "replies": []
    },
    {
      "id": "mqbgpmn",
      "author": "Riotdiet",
      "body": "Honestly pretty cool. Which they had shot some video showing off its speed",
      "score": 1,
      "created_utc": 1746244622.0,
      "replies": []
    },
    {
      "id": "mqbkes0",
      "author": "1zeewarburton",
      "body": "Starwars motorcycle",
      "score": 1,
      "created_utc": 1746246358.0,
      "replies": []
    },
    {
      "id": "mqc1x07",
      "author": "DarthTempi",
      "body": "Darth Maul would like a word",
      "score": 1,
      "created_utc": 1746256057.0,
      "replies": []
    },
    {
      "id": "mqcrr71",
      "author": "obidie",
      "body": "This is as dumb as the machines with the thrusters on your forearms. Yeah, you look cool, but that's about it. Completely impractical.",
      "score": 1,
      "created_utc": 1746271614.0,
      "replies": []
    },
    {
      "id": "mqf6pz3",
      "author": "notjordansime",
      "body": "oh shiiiiit they made the flying bike thingy from gta online real 😳",
      "score": 1,
      "created_utc": 1746301043.0,
      "replies": []
    },
    {
      "id": "mqgrebe",
      "author": "fireandbass",
      "body": "Sweet!  I've been waiting for the flying motorcycles from The Island!  Only took 20 years.",
      "score": 1,
      "created_utc": 1746321324.0,
      "replies": []
    },
    {
      "id": "mqhdfai",
      "author": "BeautifulPutz",
      "body": "I mean, if we're allowed to ride this 50ft off the ground and do direct flights to destinations (instead of using roads) i might try it until there's too much traffic in the air.",
      "score": 1,
      "created_utc": 1746330412.0,
      "replies": []
    },
    {
      "id": "mqhefj9",
      "author": "Reinier_Reinier",
      "body": "It would have been nice if the reporter had asked:\n\nHow high does it fly?\n\nHow far can you go on a single charge?\n\nHow long does it take to charge?\n\nIs an autopilot feature planned for the future?",
      "score": 1,
      "created_utc": 1746330872.0,
      "replies": []
    },
    {
      "id": "mqhhvrj",
      "author": "Slow_Tap2350",
      "body": "Lame.",
      "score": 1,
      "created_utc": 1746332487.0,
      "replies": []
    },
    {
      "id": "mql0dzx",
      "author": "Punanijedi69",
      "body": "This is why I’m sick of technology. I just learned how to ride a fucking unicycle, and now this?",
      "score": 1,
      "created_utc": 1746385779.0,
      "replies": []
    },
    {
      "id": "mqooz9u",
      "author": "spock_9519",
      "body": "and no one says when you can purchase the machine or how much it will cost\n\n  \njust another empty promise",
      "score": 1,
      "created_utc": 1746441921.0,
      "replies": []
    },
    {
      "id": "mqpcouw",
      "author": "ObsessedChutoy3",
      "body": "Zoom in and look closely at the edges of the bike as it moves. There is a complete CGI artefact outline of the whole bike standing out from the scenery or is it just me?\n\n\nhttps://youtu.be/-Fev5M_7Wnw?si=UCbgR0JfFvtTC7FG",
      "score": 1,
      "created_utc": 1746451765.0,
      "replies": []
    },
    {
      "id": "mqxiblc",
      "author": "mfeldmannRNE",
      "body": "When someone buys one to go deer hunting, that’s OK. That’s their business. But when the Pentagon buys 10,000, that’s when we have a real issue. “What’s your name, citizen?”",
      "score": 1,
      "created_utc": 1746556709.0,
      "replies": []
    },
    {
      "id": "mqz3xy0",
      "author": "robrast",
      "body": "Was curious what this would actually sound like so added the sound from the flyboard, what you think?\nhttps://youtu.be/wiBS38DY3ZM",
      "score": 1,
      "created_utc": 1746573943.0,
      "replies": []
    },
    {
      "id": "mqz3yr2",
      "author": "robrast",
      "body": "Was curious what this would actually sound like so added the sound from the flyboard, what you think?\nhttps://youtu.be/wiBS38DY3ZM",
      "score": 1,
      "created_utc": 1746573950.0,
      "replies": []
    },
    {
      "id": "mt87yhn",
      "author": "wchris63",
      "body": "Seeing as the video is 100% AI generated C.R.A.P., you won't be seeing this live any time soon.",
      "score": 1,
      "created_utc": 1747706455.0,
      "replies": []
    },
    {
      "id": "mtut0i5",
      "author": "midnightbandit-",
      "body": "This thing desperately needs deployable wings. It would make it so much safer.",
      "score": 1,
      "created_utc": 1748015787.0,
      "replies": []
    },
    {
      "id": "mv2txh4",
      "author": "g8trgr8t",
      "body": "[Star Wars Speeder Bikes Are Now Real – and They Can Fly Over 120 MPH](https://www.msn.com/en-us/news/technology/star-wars-speeder-bikes-are-now-real-and-they-can-fly-over-120-mph/ar-AA1FFgg1?ocid=entnewsntp&pc=U531&cvid=78aa43fcd20647f7b13ea2cfd7389780&ei=61)",
      "score": 1,
      "created_utc": 1748616966.0,
      "replies": []
    },
    {
      "id": "mxtxwcq",
      "author": "nuecastle",
      "body": "Nice try Diddy. #aideepfake",
      "score": 1,
      "created_utc": 1749947718.0,
      "replies": []
    },
    {
      "id": "mqawrk3",
      "author": "haarschmuck",
      "body": "No such thing as flying cars or airbikes.\n\nThe moment a vehicle leaves the ground it is considered and aircraft and falls under the regulatory authority of the FAA. \n\nYou will need a pilots license to operate this as it can operate above the max speed of 55kts.\n\nAlso would never fly something like this. Even helicopters can glide when suffering power loss (as helicopters use rotating airfoils), these are even worse. They will drop like a rock if anything happens.",
      "score": 1,
      "created_utc": 1746236536.0,
      "replies": [
        {
          "id": "mqb2dls",
          "author": "Bairy_Halls",
          "body": "TIL a Polish guy in Poland has to conform to American regulations \n\n/r/USdefaultism",
          "score": 7,
          "created_utc": 1746238659.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq9k9q5",
      "author": "TheKnife142",
      "body": "WWOOOAAAHHHHHH!!!!! A MOTORCYCLE THAT FLIES THROUGH THE AIR!?!?!?!? OKAYYYY!!!!",
      "score": 0,
      "created_utc": 1746219739.0,
      "replies": []
    },
    {
      "id": "mqbyybf",
      "author": "benjatunma",
      "body": "I love this think about it like in the 1700 it took people weeks on a train to get places. Now with car it takes hrs from SF to LA. Imagine with this, we can go places cars cannot go. Like explore the desert, yosemeti, kings canyon. I wnat one",
      "score": 0,
      "created_utc": 1746254296.0,
      "replies": [
        {
          "id": "mqepenm",
          "author": "GagOnMacaque",
          "body": "The problem with this is going to be FAA clearances. This is pretty much why the molar sky car never made it.\n\nThis would be more for search and rescue.",
          "score": 1,
          "created_utc": 1746295462.0,
          "replies": [
            {
              "id": "mqf9nvm",
              "author": "benjatunma",
              "body": "What if,,, we put some apple airtags?",
              "score": 1,
              "created_utc": 1746302029.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}