{
  "post": {
    "title": "Even Apple wasn’t able to make VR headsets mainstream in 2024",
    "author": "BlueLightStruct",
    "id": "1hnfbds",
    "score": 593,
    "created_utc": 1735307565.0,
    "selftext": "",
    "num_comments": 370,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hnfbds/even_apple_wasnt_able_to_make_vr_headsets/"
  },
  "comments": [
    {
      "id": "m4159se",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735307565.0,
      "replies": []
    },
    {
      "id": "m416afk",
      "author": "No_1_OfConsequence",
      "body": "Can’t be mainstream if nobody can afford it. Simple really.",
      "score": 1006,
      "created_utc": 1735307992.0,
      "replies": [
        {
          "id": "m4177wv",
          "author": "Ben_Kenobi_",
          "body": "Yeah, I mean, I don't think mainstream was their goal with that price point. I'm not fully sure what their goal is. Maybe just R&D and releasing something to recoup some costs, then come out with a mainstream model later. Also testing the water with enterprise adoption. \n\nOculus has a much better chance with their price point, but idk what's going to get them there. I bet something smaller, lighter, with better battery life and perfect hand controls instead of using controllers would help, but that's probably still a bit off. Also, obviously, some killer apps.",
          "score": 182,
          "created_utc": 1735308376.0,
          "replies": [
            {
              "id": "m419ub0",
              "author": "ExtruDR",
              "body": "I think the point was to kick-start the development of apps that could or would become killer apps compelling people to buy an Apple  VR unit in the future.\n\nMost people, certainly most of their customers are awash in screens, the have an iPhone, probably an iPad, maybe a MacBook, maybe an Apple Watch, might very well have Apple TV… really, I mean, more devices? Better have a good use case even if money was no object.",
              "score": 75,
              "created_utc": 1735309434.0,
              "replies": [
                {
                  "id": "m41f8qc",
                  "author": "pinkynarftroz",
                  "body": "The only good use case I’ve seen are games where your avatar is stationary - basically racing game and flight sims.\n\nEvery single other use case is better with a real screen and actual objects. \n\nIt really hard to convince people VR is cool when almost every experience with it is worse than the alternative right now.",
                  "score": 37,
                  "created_utc": 1735311482.0,
                  "replies": [
                    {
                      "id": "m42dad5",
                      "author": "muskratboy",
                      "body": "You’ve clearly never seen kids playing that dang playground game. It makes me instantly motion sick, but they can do things in there that wouldn’t be the same on a single flat screen.",
                      "score": 15,
                      "created_utc": 1735322664.0,
                      "replies": [
                        {
                          "id": "m4fhe4g",
                          "author": "TacoCommand",
                          "body": "What playground game?",
                          "score": 2,
                          "created_utc": 1735512544.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m444vs3",
                      "author": "kevihaa",
                      "body": ">It really hard to convince people VR is cool when almost every experience with it is worse than the alternative right now.\n\nI’ve found the bigger issue to be that folks underestimate how social an experience gaming can be, *even if you’re playing a single player game*. Kids, roommates, friends, significant others, etc can dip in and out and watch what you’re doing, ask what’s going on, etc the same as they would if you were watching a movie. \n\nWhereas, VR is *extremely* isolating. The benefit is that the level of immersion, even in lower resolution games, is absolutely astounding. The problem is that the cost of that immersion is to be *completely* cut off from the rest of the world. \n\nLike, I think VR is awesome. I have had gaming experiences in VR that are unmatched by 30 years of playing “pancake” games, *and yet*, my VR headsets gather dust because it’s just too challenging to find time where I know I can be **completely** isolated vs just booting up Steam and knowing I can dip out if something comes up.",
                      "score": 13,
                      "created_utc": 1735343768.0,
                      "replies": [
                        {
                          "id": "m46kes1",
                          "author": "PelvisResleyz",
                          "body": "This right here.",
                          "score": 4,
                          "created_utc": 1735387410.0,
                          "replies": []
                        },
                        {
                          "id": "m4pu4s5",
                          "author": "JoeyBigtimes",
                          "body": "Which is why apple put that creepy screen on the front of their goggles, and why every VR company pushes mixed/altered reality.",
                          "score": 1,
                          "created_utc": 1735664822.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m427u8l",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 11,
                      "created_utc": 1735320950.0,
                      "replies": [
                        {
                          "id": "m42fqw3",
                          "author": "2_Spicy_2_Impeach",
                          "body": "100%. Got an Index over pandemic because I figured I’d be inside a lot. Alyx is fucking amazing. Played a couple other games but got bored.",
                          "score": 7,
                          "created_utc": 1735323442.0,
                          "replies": []
                        },
                        {
                          "id": "m44f2nm",
                          "author": "locke_5",
                          "body": "There are a handful of great full games now. \n\n- Half-Life: Alyx\n\n- Assassin’s Creed: Nexus\n\n- Batman: Arkham Shadow\n\n- Lone Echo\n\n- Lone Echo 2\n\n- Asgard’s Wrath\n\n- Asgard’s Wrath 2\n\n- Skyrim VR (with VRIK and HIGGS mods)",
                          "score": 1,
                          "created_utc": 1735347488.0,
                          "replies": [
                            {
                              "id": "m4arj98",
                              "author": "eggard_stark",
                              "body": "Into the radius 1\n\nInto the radius 2. \n\nMetro\n\nBlade and sorcery. \n\nPavlov\n\nThe list continues. Can’t see how someone could play a “few games” and be bored with it.",
                              "score": 1,
                              "created_utc": 1735442160.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m41pwb9",
                      "author": "DarthBuzzard",
                      "body": "> The only good use case I’ve seen are games where your avatar is stationary\n\nMaybe that's because you've only seen VR and haven't tried it? If anything it's the opposite. Many of the most popular and highest rated games are ones where you move fast.",
                      "score": 18,
                      "created_utc": 1735315148.0,
                      "replies": [
                        {
                          "id": "m47esax",
                          "author": "pinkynarftroz",
                          "body": "I’ve tried it extensively. I wanted to like it and was excited, but there are just so many compromises for games it’s actually anti immersive.",
                          "score": 1,
                          "created_utc": 1735400993.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m423uy2",
                      "author": "Mother_Restaurant188",
                      "body": "Watching film and TV is great in VR, and especially on the Vision Pro.\n\nComfort is still an issue for those sensitive to it. But visually it’s stunning. 3D content is particularly exquisite.\n\nStill, I sadly plan on returning my Vision Pro soon. \n\nIt’s a fun piece of tech but I’m disappointed by how lackluster Apple’s own efforts have been at investing in the platform.\n\nI understand why third party devs aren’t going all in (small user base -> low revenue potential). But I’m baffled at why *Apple* hasn’t ported or created their own apps except for the few they did make.\n\nThe Immersive content has been nice but that’s basically has been it in terms of new content. And the episodes are like max 20 minutes.\n\nNot even a single tv+ film or TV show shot in 3D. Or hell, at least converted to 3D. \n\nFoundation would look stunning in 3D, for instance.\n\nSo I’ll just wait for the platform to mature a bit before hopping on.",
                      "score": 5,
                      "created_utc": 1735319678.0,
                      "replies": [
                        {
                          "id": "m42o2th",
                          "author": "DaoFerret",
                          "body": "Apple allowed phones to start recording in 3D for AppleVision with the 15 (pro I think?)\n\nDefinitely only the beginning of the maturity cycle.",
                          "score": 5,
                          "created_utc": 1735326088.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m41jqb3",
                      "author": "Lari-Fari",
                      "body": "Hard disagree. Lots of genres profit from VR.",
                      "score": -6,
                      "created_utc": 1735313065.0,
                      "replies": []
                    },
                    {
                      "id": "m41ir9y",
                      "author": "imnotabotareyou",
                      "body": "Speak for yourself. VR is worlds better for most game types.\n\nEdit: downvotes are from the chubalubs that are too fat and out of shape to play VR unless they are melting into a chair lmao",
                      "score": -22,
                      "created_utc": 1735312732.0,
                      "replies": [
                        {
                          "id": "m42erk0",
                          "author": "doge1976",
                          "body": "Sorry, this isn’t true at all. You’re basing your assumption on your own feelings. In truth, if this was the case, then the VR industry would be doing much better than it currently is.\n\nI own a PSVR2 and a Meta Quest 3, but my go-to is still PC/PS5/Xbox before VR gaming.\n\nVR gaming is great for short stints but nothing longer than 1-2 hours at a time, which isn’t enough time to truly get into a game.",
                          "score": 2,
                          "created_utc": 1735323132.0,
                          "replies": [
                            {
                              "id": "m42lqi4",
                              "author": "DarthBuzzard",
                              "body": "> then the VR industry would be doing much better than it currently is.\n\nThat's not how it works. There's only so many parts currently in circulation for headsets to be manufactured, and outside of Meta, they are pricey. Meta is doing decent enough, but it's a slow rollout because it logistically has to be - it's a new medium and you can't just have everyone turn up interested knowing what to expect - it's a try in-person thing.",
                              "score": 2,
                              "created_utc": 1735325343.0,
                              "replies": [
                                {
                                  "id": "m45ket6",
                                  "author": "Radulno",
                                  "body": "VR \"came back\" 8 years ago in 2016 with the Rift, it's not a new thing anymore.",
                                  "score": 1,
                                  "created_utc": 1735364783.0,
                                  "replies": [
                                    {
                                      "id": "m46o6it",
                                      "author": "DarthBuzzard",
                                      "body": "Regardless, most people have not tried VR and have no idea what it's like.\n\nAnd like I said, there is no mass manufacturing going on right now because the industry has not hit a threshold of economies of scale. MicroOLED displays (Apple Vision Pro's displays) in particular are a big bottleneck, with only several hundred thousand of these being manufactured worldwide annually, currently.",
                                      "score": 1,
                                      "created_utc": 1735389616.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m43ldjp",
                  "author": "Durzel",
                  "body": "Problem with that logic is that in order to kick-start development of killer VR apps on Vision Pro, there has to be a viable market of buyers to sustain app makers.\n\nIf the only people that can actually afford the equipment are like-minded developers and a small cadre of influencers, that's a pretty dry well to make a living off of.  All you're going to end up with is people doing proof of concept apps for an echo chamber of users.\n\nOnly way it would get off the ground in that scenario if Apple were resolute on the pricing would be if they subsidised development and/or worked with a selection of key iOS/iPadOS developers to get their apps ported over.",
                  "score": 1,
                  "created_utc": 1735336898.0,
                  "replies": [
                    {
                      "id": "m44igi7",
                      "author": "ExtruDR",
                      "body": "Given how much redundancy and unoriginality exists in software development, I would think that a big part of speculatively developing new software is coming up with a \"killer app\" or an application category, or work flow or interface mechanic that becomes revolutionary and sort of \"brings\" people to the product.\n\nThe stimulus, like with other devices before, might be the actual hardware.  I think that this is very much what the original Apple Vision Pro is about.  Putting enough of them out on peoples' hands that are more-or-less industry connected to come up with ideas and maybe pursue them.",
                      "score": 1,
                      "created_utc": 1735348754.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41jilo",
              "author": "Kamakaziturtle",
              "body": "Actually the oculus 3 is pretty close to what you described.  I was pretty impressed with it.\n\nThough the killer apps thing is still the stickler, sure from a games standpoint VR does have some solid options now.  But there’s still not enough outside of games to get people not just interested in games to want a headset.  And I don’t think VR is ever going to be mainstream only as a gaming system.",
              "score": 21,
              "created_utc": 1735312993.0,
              "replies": [
                {
                  "id": "m41qm36",
                  "author": "speculatrix",
                  "body": "I use my quest 3 more for non-games than games. Virtual concerts. Tourism. 3D image viewing (I have a 3D lens/camera combo). I don't have tons of games but I do really enjoy them. I'm certainly happy with the money I spent on it, I also bought the kiwi battery/strap which makes it much more comfortable.",
                  "score": 12,
                  "created_utc": 1735315385.0,
                  "replies": []
                },
                {
                  "id": "m42mbk2",
                  "author": "turb0_encapsulator",
                  "body": "I have one that I use for VR walkthroughs. When I get it working right, it does the job. But it’s such a half-baked piece of shit with bad software and bugs galore. Meta is the last company that should be building a product like this. Their move-fast-and-break-things dogshit culture really shows in the Oculus.",
                  "score": 3,
                  "created_utc": 1735325529.0,
                  "replies": []
                },
                {
                  "id": "m41xyhp",
                  "author": "StarsMine",
                  "body": "The oculus 3 has a very damning feature though. Its oculus. The zuk buying it and changing the culture to push carmack out immediately doomed the brand",
                  "score": 10,
                  "created_utc": 1735317786.0,
                  "replies": [
                    {
                      "id": "m42cnr4",
                      "author": "drmirage809",
                      "body": "Never knew Carmack was pushed out of the thing. I always thought he left as he lost interest. \n\nAlthough, I can totally see them getting tired of him very quickly. He wants to be at the forefront of rendering tech, pioneering new ways to further optimise code and squeeze every bit of power out of the hardware. Stuff like that takes a team of skilled coders. And those are expensive.",
                      "score": 2,
                      "created_utc": 1735322469.0,
                      "replies": [
                        {
                          "id": "m42mi7p",
                          "author": "StarsMine",
                          "body": "He lost interest because the culture changed. It wasn’t an antagonistic thing.",
                          "score": 2,
                          "created_utc": 1735325588.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m420b5e",
                      "author": "Kamakaziturtle",
                      "body": "Eh, Apples not exactly that great, Valve has been at the forefront of pretty much every shitty gaming practice, and Vive… honestly are they even seriously in the game?  And of all those only one really manages to keep the prices at a reasonable amount.\n\nYeah it’s lining another crappy billionaire CEOs pockets, but that’s kinda unavoidable",
                      "score": 3,
                      "created_utc": 1735318539.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m44fnvf",
                  "author": "locke_5",
                  "body": "The killer app will be monitor replacement.\n\nIt’s already there for me, but different people have different comfort levels they’ll tolerate. I use my Vision Pro during the work day to display my Windows desktop. I can connect via kb+m and use it just like I normally would. 5:00 hits and I pull the screen into my living room, turn on my controller, boot up Steam, and now I’m gaming on the couch. It’s really fantastic.",
                  "score": 1,
                  "created_utc": 1735347706.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m42djjq",
              "author": "Fickle-Lunch6377",
              "body": "I learned to play drums from an app that overlays its graphics to your drumset and turns it basically into rockband. There’s another one like that for piano. They should push and develop more things like that.",
              "score": 10,
              "created_utc": 1735322745.0,
              "replies": []
            },
            {
              "id": "m420ccm",
              "author": "fasada68",
              "body": "I'd rather use controllers while gaming than making pew pews with my fingers.",
              "score": 6,
              "created_utc": 1735318550.0,
              "replies": [
                {
                  "id": "m428lcg",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1735321189.0,
                  "replies": [
                    {
                      "id": "m42b2y3",
                      "author": "fasada68",
                      "body": "I'd like to play boxing games without the controllers though.",
                      "score": 3,
                      "created_utc": 1735321975.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m42gde0",
              "author": "hikingforrising19472",
              "body": "I’m convinced that AI/LLMs completely changed their plans. Before ChatGPT, Siri wasn’t that helpful for voice only control, but now that ChatGPT can handle natural language very well, and with the camera able to interpret what it’s looking at real time, it completely changed the ability to just use a camera vs needing to have a sizable  computer on your head. \n\nThis is where Apple is going to be at a crossroads. Will you really need hardware when these cloud based LLMs/AI and agents can do many of the things you need?",
              "score": 2,
              "created_utc": 1735323640.0,
              "replies": [
                {
                  "id": "m46rbax",
                  "author": "DarthBuzzard",
                  "body": "> This is where Apple is going to be at a crossroads. Will you really need hardware when these cloud based LLMs/AI and agents can do many of the things you need?\n\nAI is limited if it's on a phone, because AI is all about inference. The more it knows what the user wants, the more it can provide utility. If it can see through your eyes and hear through your ears, it will be working at maximum efficiency, and that's where smartglasses and eventually AR glasses come in.",
                  "score": 2,
                  "created_utc": 1735391273.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m449s7r",
              "author": "NervousSubjectsWife",
              "body": "I can afford an oculus, just can’t afford an apartment with enough space to use it lol",
              "score": 2,
              "created_utc": 1735345559.0,
              "replies": []
            },
            {
              "id": "m42c5yf",
              "author": "Sa0t0me",
              "body": "Reason I didn’t get an Oculus is because it is tied to Derpbook … even I … have standards",
              "score": 2,
              "created_utc": 1735322314.0,
              "replies": []
            },
            {
              "id": "m42vfre",
              "author": "Deferty",
              "body": "In the keynote speech about the VR headset, they explicitly stated that they have patents for all of the technology that they designed for the headsets. In case Zuckerberg is correct, and VR headsets are the future, Apple will be in a great position to continue.",
              "score": 4,
              "created_utc": 1735328438.0,
              "replies": []
            },
            {
              "id": "m421enw",
              "author": "sold_snek",
              "body": "The amount of people saying the Apple headset was going to kill the Quest was hilarious. There was no fucking way a $3,500 was even going to make a dent in the market. That was a wild ass fumble decided by someone who has already made more than I will in my entire life.",
              "score": 4,
              "created_utc": 1735318891.0,
              "replies": []
            },
            {
              "id": "m41bvdg",
              "author": "Sylvurphlame",
              "body": "I tend to agree. They’re Apple: they know people will buy them. It looks like they sold the amount of units they were predicted to be able to produce. (How many people kept them is a different question perhaps.)\n\nBut yeah, they’ll have to work their way to something more cost effective, and easier to use for longer periods before they can truly mainstream it.",
              "score": 4,
              "created_utc": 1735310222.0,
              "replies": [
                {
                  "id": "m44r7dc",
                  "author": "Speedy-08",
                  "body": "Iirc they actually cut back on the production of Vision Pro's a while back due to how lackluster the expected vs actual sales were.",
                  "score": 3,
                  "created_utc": 1735352126.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m421dwx",
              "author": "cat_prophecy",
              "body": "Isn't Oculus its own ecosystem though? Can you plug it into another system and get output?\n\nTo me, the big reason why VR isn't attractive is that 1) I don't have a room that I can basically dedicate to it, 2) it doesn't seem to lend itself to casual experiences.",
              "score": 2,
              "created_utc": 1735318884.0,
              "replies": [
                {
                  "id": "m47s9o0",
                  "author": "LeatherDude",
                  "body": "Oculus can do with PC VR and play games from Steam that have VR support.  \n\nYou definitely don't need a whole room.  I play in the living room and have enough space if I move the coffee table.  The oculus is pretty casual friendly, other wired headsets are not.",
                  "score": 1,
                  "created_utc": 1735405535.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m429cle",
              "author": "Reinis_LV",
              "body": "Apples VR seemed more like virtual workplaces. I bet the idea was coined durring lockdowns",
              "score": 1,
              "created_utc": 1735321429.0,
              "replies": []
            },
            {
              "id": "m42r669",
              "author": "Specialist-Rope-9760",
              "body": "I think Apple saw competitors getting stuff together and they wanted to be ready with something in case the whole thing took off. But it never took off",
              "score": 1,
              "created_utc": 1735327073.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41kk8k",
          "author": "byerss",
          "body": "Apple Vision is like the opposite of a mainstream product. ",
          "score": 28,
          "created_utc": 1735313349.0,
          "replies": [
            {
              "id": "m45de9d",
              "author": "Triaspia2",
              "body": "I imagine theyll release a 1000$ version in a year or two alongside a vision pro for $3500 thats maybe got a bigger battery\n\nOriginal gets people excited about the concept and gives devs and early adopters a head start on the platform as well as bugfixes and usage data.\n\nBasically repeat the occulus > quest path but entirely in house",
              "score": 0,
              "created_utc": 1735361409.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41lgh2",
          "author": "ThatLaloBoy",
          "body": "It’s not just the price since they’ve had no problem selling expensive devices to the public in the past (insert Steve Ballmer quote about how iPhone would flop for being too expensive). It also needs to have a clear function and sell exactly why someone wants this. \n\nThey’ve running into the same problem Microsoft ran into with the Windows Phone. Devs aren’t going to invest resources into a product with a small user base. And that user base isn’t going to grow if there are no apps they want to use. Unless Apple finds that killer must-have app, it won’t matter how cheap it is. They’ll be joining Oculus in making a relatively niche product.",
          "score": 10,
          "created_utc": 1735313651.0,
          "replies": [
            {
              "id": "m41s04d",
              "author": "nemoknows",
              "body": "The  stupid thing is they should know better: all of their biggest products (Apple II, Mac, iPod, iPhone) all shipped with a dedicated OS, a well designed and intuitive UI, and out-of-the box useful functionality/apps. The vision… didn’t. It’s like launching a console without a AAA launch title.",
              "score": 3,
              "created_utc": 1735315849.0,
              "replies": []
            },
            {
              "id": "m41y4r0",
              "author": "Skellos",
              "body": "I'm pretty sure Apple were banking on Meta's attempts to make it mainstream enough that they could have their luxury headset.\n\nBut that's not happened nor is it likely to happen.",
              "score": 1,
              "created_utc": 1735317842.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41xtaw",
          "author": "QuestionablePanda22",
          "body": "Also for the average consumer these things just don't really add much to your life for the value. These headsets needed to come out around the early era of smartphones and tablets to try to directly compete with those decives' market share imo\n\nPhones are essential for modern life so people will shill out $1k+, PCs/gaming consoles/TVs etc aren't essential but if you want to watch movies or play games you need one (and the entry price is much lower)\n\nI have a TV, phone, PC, gaming console. What is this or any headset going to do for me to justify the cost of pretty much upgrading my entire current setup?",
          "score": 3,
          "created_utc": 1735317740.0,
          "replies": []
        },
        {
          "id": "m4199zo",
          "author": "Soaddk",
          "body": "Everyone can afford META’s headsets but it’s still not mainstream. VR is a niche product and will stay that way - the last 15 years of tech history has shown us this.",
          "score": 19,
          "created_utc": 1735309209.0,
          "replies": [
            {
              "id": "m41c0z0",
              "author": "ZSpark85",
              "body": "I actually enjoy them but I can only use the product for like 5-10 minutes before my brain needs a break.  I get motion sick pretty easy with those.",
              "score": 13,
              "created_utc": 1735310282.0,
              "replies": [
                {
                  "id": "m458ln4",
                  "author": "click4dylan",
                  "body": "Keep at it. I was the same way for years and someone told me to just keep using it and you will get used to it. They were right and now I never get sick at all and can wear it for as long as I want. I originally wanted to throw up after a few minutes. Only took like a month or less of using it daily and it’s gone forever",
                  "score": 2,
                  "created_utc": 1735359256.0,
                  "replies": [
                    {
                      "id": "m4bj9ih",
                      "author": "cpt-derp",
                      "body": "Gotta earn yer VR legs, arrgh.",
                      "score": 1,
                      "created_utc": 1735454794.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41bvd5",
              "author": "Undeity",
              "body": "There will be a turning point eventually. But only after the form factor changes, and it becomes less limited.",
              "score": 16,
              "created_utc": 1735310222.0,
              "replies": [
                {
                  "id": "m41c7i6",
                  "author": "Soaddk",
                  "body": "Agree. But I think it will be more in the form of augmented reality like ordinary glasses that displays information like a Headup display.",
                  "score": 7,
                  "created_utc": 1735310352.0,
                  "replies": [
                    {
                      "id": "m41cg48",
                      "author": "Undeity",
                      "body": "I'd argue they're two sides of the same coin. It's just about how immersed you need to be for a given activity.",
                      "score": 2,
                      "created_utc": 1735310444.0,
                      "replies": [
                        {
                          "id": "m41d0az",
                          "author": "Soaddk",
                          "body": "True, but the shape of the device will be a lot different if you need to go into full immersion compared to augmented. Full immersion will need goggles to keep the real world / light out while augmented can be achieved with ordinary glasses (in the future).",
                          "score": 3,
                          "created_utc": 1735310659.0,
                          "replies": [
                            {
                              "id": "m41de4e",
                              "author": "Undeity",
                              "body": "Maybe. It's not like it's truly full sensory immersion, either way. There might be more specialized products that prioritize as much immersion as possible, but I don't see why you can't still get plenty of mileage out of VR in a glasses form. \n\n*Edit: Our brains are already pretty good at tuning out irrelevant sensory information, but if it truly is absolutely necessary for meaningful VR, there are methods out there that can use light to unobtrusively \"wash out\" your peripheral vision. Physically blocking all outside light is hardly the only option.*",
                              "score": 0,
                              "created_utc": 1735310803.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m48ieox",
                      "author": "None",
                      "body": "AR and VR have completely disparate use cases - like, they're basically polar opposites within the XR sphere - but i think google's making the right play by linking the two via Android XR\n\ngiving devs all the tools up front for both technologies, and putting both in the public eye simultaneously, feels like it might help push one or the other over the edge\n\nthe big hurdles remaining are that AR and VR face essentially opposite challenges, too - AR specs are awfully close to a \"oh i thought those were regular glasses\" form factor, but they're kinda a solution looking for a problem. e.g. the appeal of live, blended audiovisual translation just doesn't add much to the average person's life\n\nin total contrast, VR could theoretically be fun/educational/therapeutic for anybody with the time and space to use it. but the form factor and overall tech are just not there quite yet.\n\nVR engineers gotta figure out how top mitigate the nausea and dizziness, for one thing. stops me in my tracks (although i have tried in a couple years TBH, it might have changed)",
                      "score": 1,
                      "created_utc": 1735414026.0,
                      "replies": []
                    },
                    {
                      "id": "m41q30n",
                      "author": "DarthBuzzard",
                      "body": "Not really. They're separate things. AR will be something akin to smartphones, and VR will be more akin to PCs and tablets.\n\nSmartphones may reign supreme, but PCs and tables are still mainstream - mega mainstream even.",
                      "score": 0,
                      "created_utc": 1735315210.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4f6ltw",
                  "author": "StopVapeRockNroll",
                  "body": "Not really. Thankfully not everyone is stupid enough to strap bright ass screens inches from their eyes.",
                  "score": 1,
                  "created_utc": 1735509088.0,
                  "replies": [
                    {
                      "id": "m4fadsi",
                      "author": "Undeity",
                      "body": "Of course, because potential health concerns have definitely stopped the adoption of convenient new technologies before.\n\nYou hate it, we get it. At least find a better excuse.",
                      "score": 1,
                      "created_utc": 1735510287.0,
                      "replies": [
                        {
                          "id": "m4fguqu",
                          "author": "StopVapeRockNroll",
                          "body": "Your excuse is even lamer. It's your eyes, not mine, lol. This technology is dumb anyway.",
                          "score": 1,
                          "created_utc": 1735512369.0,
                          "replies": [
                            {
                              "id": "m4fhuqv",
                              "author": "Undeity",
                              "body": "Keep telling yourself that. It's not like this has been said about every major advance in media technology ever. Oh wait...",
                              "score": 0,
                              "created_utc": 1735512692.0,
                              "replies": [
                                {
                                  "id": "m4fi5eh",
                                  "author": "StopVapeRockNroll",
                                  "body": "People will defend anything...",
                                  "score": 1,
                                  "created_utc": 1735512789.0,
                                  "replies": [
                                    {
                                      "id": "m4fifis",
                                      "author": "Undeity",
                                      "body": "I'll defend rock and roll, too! \n\nCould take or leave vaping though.",
                                      "score": 1,
                                      "created_utc": 1735512881.0,
                                      "replies": [
                                        {
                                          "id": "m4fk73d",
                                          "author": "StopVapeRockNroll",
                                          "body": "> I'll defend rock and roll, too!\n\n> Could take or leave vaping **weed** though.\n\nLol, we're on the same page here. Cheers!",
                                          "score": 3,
                                          "created_utc": 1735513468.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m41fi5t",
                  "author": "pinkynarftroz",
                  "body": "This will be either matrix jacking, or the holodeck - neither of which are remotely realistic. But that’s what it would take for mass adoption. Nothing short of that will take off.",
                  "score": 0,
                  "created_utc": 1735311576.0,
                  "replies": [
                    {
                      "id": "m46rieb",
                      "author": "DarthBuzzard",
                      "body": "r/agedlikemilk. \n\nThe idea that anyone needs a holodeck or to jack-in to find VR valuable is hysterical. No one needs it to go far - people just want VR to be streamlined, easy, and comfortable while still providing high immersion.",
                      "score": 1,
                      "created_utc": 1735391370.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m44ogh6",
              "author": "Peteostro",
              "body": "While it’s “nitch” it’s growing, meta quest app was the #1 free app in the App Store on Christmas Day.",
              "score": 2,
              "created_utc": 1735351043.0,
              "replies": []
            },
            {
              "id": "m41f2i3",
              "author": "CaptainBayouBilly",
              "body": "concerned ancient consist marry dam deliver tub squeal wild materialistic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 3,
              "created_utc": 1735311418.0,
              "replies": [
                {
                  "id": "m41qbgh",
                  "author": "Steamcurl",
                  "body": "So...porn?",
                  "score": 6,
                  "created_utc": 1735315287.0,
                  "replies": [
                    {
                      "id": "m47ss92",
                      "author": "LeatherDude",
                      "body": "If more people knew how good VR porn is, they'd sell a shitload more hardware.",
                      "score": 2,
                      "created_utc": 1735405705.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m49ew59",
              "author": "deathlydope",
              "body": "all I see here are a bunch of older people complaining about new technology being uncomfortable for them. Gorilla Tag has seen over 1mil active daily players in the past and more than 10mil unique players over its short lifetime. yall are not the target audience anymore.",
              "score": 0,
              "created_utc": 1735424819.0,
              "replies": [
                {
                  "id": "m49fjj3",
                  "author": "Soaddk",
                  "body": "I don’t think you know what mainstream means.",
                  "score": 1,
                  "created_utc": 1735425038.0,
                  "replies": [
                    {
                      "id": "m4cdkvy",
                      "author": "deathlydope",
                      "body": "I don't think you can see the writing on the wall...",
                      "score": 1,
                      "created_utc": 1735473948.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m41b8b5",
          "author": "GuybrushBeeblebrox",
          "body": "Came to say this. I'm in my late 40s and can't justify it. How the hell is their target demographic supposed to afford one??",
          "score": 3,
          "created_utc": 1735309974.0,
          "replies": [
            {
              "id": "m49f6c7",
              "author": "deathlydope",
              "body": "kids get $500+ devices handed to them constantly. the Meta Quest 3S starts at $299. they've sold millions of units..",
              "score": 1,
              "created_utc": 1735424914.0,
              "replies": [
                {
                  "id": "m49fn7f",
                  "author": "GuybrushBeeblebrox",
                  "body": "Can I get adopted by these parents lol",
                  "score": 0,
                  "created_utc": 1735425072.0,
                  "replies": [
                    {
                      "id": "m4cdihq",
                      "author": "deathlydope",
                      "body": "most smartphones cost more than that, just about every kid has one.",
                      "score": 1,
                      "created_utc": 1735473909.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m41ovzz",
          "author": "choatec",
          "body": "Even if it was affordable idt the interface/tech is there yet for mass adoption.",
          "score": 1,
          "created_utc": 1735314810.0,
          "replies": []
        },
        {
          "id": "m424kgp",
          "author": "alkrk",
          "body": "but people are buying $1000 bucks iPhones and Galaxys.",
          "score": 1,
          "created_utc": 1735319902.0,
          "replies": []
        },
        {
          "id": "m42fnrv",
          "author": "Corgi_Koala",
          "body": "I agree that the price point is going to limit the audience, but I think it's also just the practical applications. \n\nThere just aren't many applications besides games where virtual reality headsets enhance the experience. I think there's going to be a lot more use cases in the commercial and industrial space But we are a long way off from the average person getting home from work and slapping on a headset to browse Reddit.",
          "score": 1,
          "created_utc": 1735323414.0,
          "replies": []
        },
        {
          "id": "m42rngx",
          "author": "IranianLawyer",
          "body": "I think they’re supposedly making a cheaper version for next gen, but it’s just unconfirmed rumors.",
          "score": 1,
          "created_utc": 1735327225.0,
          "replies": []
        },
        {
          "id": "m443zi7",
          "author": "Katnisshunter",
          "body": "Can’t be mainstream because the company leading the charge is a fkn ad company.  Who wants ad in your face.",
          "score": 1,
          "created_utc": 1735343440.0,
          "replies": []
        },
        {
          "id": "m4526km",
          "author": "Peakomegaflare",
          "body": "It's not even just price, but space too.",
          "score": 1,
          "created_utc": 1735356537.0,
          "replies": []
        },
        {
          "id": "m458lxy",
          "author": "Happy-go-lucky-37",
          "body": "Seriously. For the price of a heavy bulky battery-draining headache-inducer, you can amost cover your computer room in wall-to wall HD monitors…",
          "score": 1,
          "created_utc": 1735359260.0,
          "replies": []
        },
        {
          "id": "m45n88p",
          "author": "african_cheetah",
          "body": "They track usage of their devices. Even those who could afford it didn’t really use it that much. In contrast iPhones, iPods, macs were an almost everyday use device. \n\nI have a few friends who were very enthusiastic and put their vacation money in the headset. Now it’s collecting dust.",
          "score": 1,
          "created_utc": 1735366267.0,
          "replies": []
        },
        {
          "id": "m466qrz",
          "author": "SickRanchezIII",
          "body": "Yeah what the fuck is so tough to grasp about this?",
          "score": 1,
          "created_utc": 1735378375.0,
          "replies": []
        },
        {
          "id": "m46vsog",
          "author": "isjahammer",
          "body": "And actually being worse in several aspects than a product that only costs 1/7 of the cost doesn't help.",
          "score": 1,
          "created_utc": 1735393411.0,
          "replies": []
        },
        {
          "id": "m49ad5h",
          "author": "None",
          "body": "No one really wants to wear that stupid thing on your head",
          "score": 1,
          "created_utc": 1735423279.0,
          "replies": []
        },
        {
          "id": "m49jgp6",
          "author": "start_select",
          "body": "It can’t really be mainstream as it is anyway.  It’s too antisocial.\n\nA lot of peoples first introductions to VR is standing in a room unable to interact with anyone there, while everyone watches them fumble.\n\nIt’s very me-centric and isn’t that appealing to the majority of people.  If I’m playing games in a room with someone else there, I want to be able to talk to them, and they don’t want to feel like a 3rd wheel to a headset.",
          "score": 1,
          "created_utc": 1735426382.0,
          "replies": []
        },
        {
          "id": "m4cf4ji",
          "author": "kinkycarbon",
          "body": "Missing locked ecosystem. Made it obsolete the same year Apple released their VR headset. This is currently the most recent product failure of Apple.",
          "score": 1,
          "created_utc": 1735474842.0,
          "replies": []
        },
        {
          "id": "m41em0y",
          "author": "pinkynarftroz",
          "body": "Even if it’s affordable it’s not enough. VR in its current form just sucks. There’s too many compromises in the tech, and I think the minimum for mass adoption will either be matrix jacking or the holodeck, neither of which are remotely realistic.",
          "score": 1,
          "created_utc": 1735311252.0,
          "replies": [
            {
              "id": "m41gwrz",
              "author": "iguacu",
              "body": "Fine, I'll settle for a replicator then.",
              "score": 3,
              "created_utc": 1735312082.0,
              "replies": []
            },
            {
              "id": "m41q9u6",
              "author": "DarthBuzzard",
              "body": ">  I think the minimum for mass adoption will either be matrix jacking or the holodeck, neither of which are remotely realistic\n\nThen you thought wrong. No one needs something like that to be convinced that VR is worthwhile. What people need is the mature version of how VR works in headset form. Small, comfortable, easy to use.",
              "score": 2,
              "created_utc": 1735315272.0,
              "replies": [
                {
                  "id": "m41rfu1",
                  "author": "pinkynarftroz",
                  "body": "My assertion is that the headset form factor itself has too many inherent downsides to make mass adoption a thing. \n\nThere exist small comfortable headsets now, but the form the technology takes has so many drawbacks that the majority of the people cannot see it as a serious tool for work or leisure. \n\nNot sure you can argue this point. Adoption and use has been abysmal for almost a decade.",
                  "score": 5,
                  "created_utc": 1735315662.0,
                  "replies": [
                    {
                      "id": "m41ss27",
                      "author": "DarthBuzzard",
                      "body": "> There exist small comfortable headsets now\n\n$1000 headsets that are physically tethered to a $1000+ pc don't count since those are for enthusiasts and there's such a small supply of them in the first place.\n\nGetting this to run as a standalone device with 100-200g of weight is a tall order. Right now standalone headsets are about 3x the size and 3x the weight.\n\n> Not sure you can argue this point. Adoption and use has been abysmal for almost a decade.\n\nThe same could be said for the first decade of PCs, consoles, and cellphones. A decade is typically not a long time for the adoption of new hardware platforms.",
                      "score": 0,
                      "created_utc": 1735316103.0,
                      "replies": [
                        {
                          "id": "m41tdcy",
                          "author": "pinkynarftroz",
                          "body": "> The same could be said for the first decade of PCs, consoles, and cellphones. A decade is typically not a long time for the adoption of new hardware platforms.\n\nThe key difference is adoption of PCs GREW year after year. VR adoption has remained stagnant or declining.",
                          "score": 3,
                          "created_utc": 1735316299.0,
                          "replies": [
                            {
                              "id": "m41v8v4",
                              "author": "DarthBuzzard",
                              "body": "Incorrect. PCs had two different periods of stagnation/decline before they took off. One in the mid 1980s and one towards the end and approaching the early 1990s.\n\nSteve Jobs even spoke about this in 1985 and how not to be discouraged due to the inevitability of the market.",
                              "score": 1,
                              "created_utc": 1735316911.0,
                              "replies": [
                                {
                                  "id": "m41vma5",
                                  "author": "pinkynarftroz",
                                  "body": "Line goes up.\n\nhttps://www.ibisworld.com/us/bed/percentage-of-households-with-at-least-one-computer/4068/",
                                  "score": 1,
                                  "created_utc": 1735317031.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m41bsvo",
          "author": "riddlerjoke",
          "body": "Many fan afford it.\nThere is no use, no need though.",
          "score": -3,
          "created_utc": 1735310196.0,
          "replies": []
        },
        {
          "id": "m421ov3",
          "author": "kBajina",
          "body": "Carrying a brick on your head will never be mainstream",
          "score": 0,
          "created_utc": 1735318983.0,
          "replies": []
        },
        {
          "id": "m430299",
          "author": "MyReddittName",
          "body": "Nintendo could not do it in 1995 either. \n\nhttps://en.m.wikipedia.org/wiki/Virtual_Boy",
          "score": 0,
          "created_utc": 1735329940.0,
          "replies": []
        },
        {
          "id": "m45dfcw",
          "author": "Dtoodlez",
          "body": "Nah, it’s not mainstream because it requires you to wear a face crab while using it",
          "score": 0,
          "created_utc": 1735361422.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41bcpx",
      "author": "Macshlong",
      "body": "Weird how a £3000 toy isn't in everyone's house isn't it?",
      "score": 226,
      "created_utc": 1735310022.0,
      "replies": [
        {
          "id": "m41bzhr",
          "author": "Obi-Lan",
          "body": "4000€ here. So silly.",
          "score": 51,
          "created_utc": 1735310266.0,
          "replies": []
        },
        {
          "id": "m41kf29",
          "author": "jamiestar9",
          "body": "Yet their stock went up like there was a Vision Pro headset under every Christmas tree. Perhaps investors still expect that to happen next Black Friday? 🤷🏻‍♂️",
          "score": 9,
          "created_utc": 1735313299.0,
          "replies": [
            {
              "id": "m46dr55",
              "author": "notatrashperson",
              "body": "I don’t think any investor is expecting VR to be a real revenue stream any time in the immediate future",
              "score": 3,
              "created_utc": 1735383121.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m43qxzt",
          "author": "ernyc3777",
          "body": "Not only that but I know a ton of Apple sheeple who traded it in or sold it shortly after because it wasn’t ground breaking enough to justify wearing it. \n\nThese are the same ones who argue for the $1000 iMac display stand.",
          "score": 3,
          "created_utc": 1735338786.0,
          "replies": []
        },
        {
          "id": "m462uio",
          "author": "J1m1983",
          "body": "Still not sure how many people would buy one if it were £1,000",
          "score": 1,
          "created_utc": 1735375753.0,
          "replies": []
        },
        {
          "id": "m4gbg91",
          "author": "LucklessCope",
          "body": "I'd say we're still at the doorstep of VR. It's not like people could afford a personal computer on their houses when there were consoles back in the 80s and 90s.",
          "score": 1,
          "created_utc": 1735522715.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41991p",
      "author": "lastMinute_panic",
      "body": "I used to make VR games. One of the biggest hurdles we couldn't ever solve was some intersection of fatigue and unease with shutting out the world. With normal games, after a given round you can traverse the world (look at your phone, take a sip of water, talk to someone) with relative ease. That isn't true with VR headsets. It's very cumbersome and the physical and psychological barrier of covering your eyes, even partially, is just asking too much of the user.\n\n\nWe concluded that people will say they want \"more immersion,\" but only in acute/short bursts. We abandoned the market entirely a few years ago. Games are hard enough.",
      "score": 189,
      "created_utc": 1735309198.0,
      "replies": [
        {
          "id": "m41wdow",
          "author": "Jlchevz",
          "body": "Yeah. There’s a reason why games have had the same format for decades. A controller or device for input and a screen for feedback. It’s simple and it works well. And unless something else comes that is as simple as that but providing a more immersive experience (without more annoying drawbacks) it will continue to be that way. That’s my opinion. VR gaming and “life enhancing” is too cumbersome.",
          "score": 27,
          "created_utc": 1735317277.0,
          "replies": [
            {
              "id": "m42nqu8",
              "author": "Horis_Schitt",
              "body": "What I've wanted from vr, especially gaming, is the ability to be immersed visually by the game, but still interact comfortably with a controller. I love that the game surrounds me and I feel like a part of it, but I want to be able to sit, chill, and use my controller to interact and move around. Having to stand, sit, squat, throw, etc gets tiring and limits how much time I want to spend with it.",
              "score": 11,
              "created_utc": 1735325981.0,
              "replies": [
                {
                  "id": "m42nzfn",
                  "author": "Jlchevz",
                  "body": "Yeah exactly, it becomes a bit tiresome or awkward. Your idea is good in my opinion.",
                  "score": 3,
                  "created_utc": 1735326058.0,
                  "replies": [
                    {
                      "id": "m44any3",
                      "author": "jzr171",
                      "body": "A good portion of PSVR2 games have controller support. But I realize that's only a small portion of the VR market",
                      "score": 6,
                      "created_utc": 1735345881.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4gvzc3",
              "author": "Salacious_B_Crumb",
              "body": "The gaming experience in \"Her\" looked pretty neat.",
              "score": 2,
              "created_utc": 1735530243.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m42o220",
          "author": "Horis_Schitt",
          "body": "As passthrough improves maybe this will be less of an impedance in the future",
          "score": 4,
          "created_utc": 1735326081.0,
          "replies": [
            {
              "id": "m45955z",
              "author": "eist5579",
              "body": "I’m all in on AR.  I think apples headset sets the direction correctly for the industry in that it actually focuses on AR, VR is like yes but is not the core software/OS use case.  \n\nThe deal breaker for me is that the AR is achieved with cameras, so you’re looking at a video recording of outside the helmet.  That right there is a huge attempt at hacking out experience of reality, and no, no thanks.  I’m holding out until they don’t need to do that.  10 years out.",
              "score": 3,
              "created_utc": 1735359491.0,
              "replies": [
                {
                  "id": "m46pccg",
                  "author": "DarthBuzzard",
                  "body": "> I’m holding out until they don’t need to do that. 10 years out.\n\nThey'll still be doing that in 10 years simply because these will be two separate product lines. This passthrough AR is only really meant to be used indoors, whereas what you're after is the seethrough outdoors AR.\n\nWe need two separate versions because seethrough will be a lot more limited - you're adding photons on top of real world photons - you're always going to have limitations with image quality, color, and field of view. Passthrough AR gives you access to edit every pixel of the real world, so essentially you can make people invisible, remove a building, and just have virtual objects that are indistinguishable from real ones. Seethrough AR will struggle here, but I'm sure it will be very popular since it's the mobile outdoor version of this.",
                  "score": 3,
                  "created_utc": 1735390253.0,
                  "replies": [
                    {
                      "id": "m47t4ny",
                      "author": "eist5579",
                      "body": "Great thoughts.  I’m basing my ideas a lot on Microsoft’s HoloLens, which I never did demo.  And I imagine it suffers from the limitations you mentioned.  I don’t know what happened to that device, but damn it seemed like they were really heading somewhere.  That Minecraft demo blew my mind back in the day.",
                      "score": 3,
                      "created_utc": 1735405819.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m460b62",
          "author": "corgis_are_awesome",
          "body": "Just make VR games that are designed to be played while sitting down while holding a controller.\n\nI want 3D immersive graphics, but I don’t want to be working out in the middle of a room while flailing my arms and worrying about running into furniture.\n\nI play games to relax. I don’t want to have to work out to play a game. The less physical involvement the better. Sweat fogging up the lenses is super annoying, too.\n\nWhy is this so hard for so many VR companies to understand??",
          "score": 3,
          "created_utc": 1735374067.0,
          "replies": [
            {
              "id": "m46h64s",
              "author": "audigex",
              "body": "Yeah I don’t want Wii games and “everything is the game” reality shifting, I want Flight Simulator and F1 etc\n\nStop treating it as a paradigm shift for all gaming and instead treat it as a TV/monitor for immersion while sitting down",
              "score": 5,
              "created_utc": 1735385372.0,
              "replies": [
                {
                  "id": "m5u5h7c",
                  "author": "MrCatSquid",
                  "body": "Pretty much every racing game and Flight Simulator has this feature already.",
                  "score": 1,
                  "created_utc": 1736233439.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m43jjm3",
          "author": "JMDeutsch",
          "body": "Can you say that part about “covering your eyes” a little bit louder for the people in the back lol!\n\nI’ve said many times for many years this product will never go anywhere because people don’t want to wear shit on their face.\n\nApparently that’s a wild for some people. I have an Oculus and it’s fun, but for short bursts.\n\nI can play a console game for easily 10x the time.",
          "score": 4,
          "created_utc": 1735336298.0,
          "replies": [
            {
              "id": "m44ufws",
              "author": "lastMinute_panic",
              "body": "Haha, yeeeep.\n\n\nThe reason this has stretched on for so long (imo) is people drunk on easy money chasing big wins. This tech coincided with really lax monetary policy. Debt was super cheap,  along with juggernauts like Meta just burning cash in this space. The company I was with (and some I consulted for) were all too happy to take investor cash, knowing full well the end product would go nowhere. \n\n\nI knew it the first time I used the Vive that the tech wouldn't survive as a veil headset. I was open about AR hybrids and thought if anyone would have a breakthrough it would be a company like Apple. But they take on SO MUCH debt just to get the hardware prototype off the ground that they are willing to handwave fundamentals like fatigue/anxiety. Vision Pro is neat for watching a short video, alone, if you have an extra $3000 laying around. How on earth does this pass the sniff test? They throw around phrases like \"paradigm shift,\" and choose to ignore such simple feedback. Perhaps this is what happens when you have mountains of cash and a bunch of hits behind you.",
              "score": 4,
              "created_utc": 1735353421.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m449sv0",
          "author": "VVLynden",
          "body": "I hope VR will continue to advance. I don’t want it to replace normal gaming at all, I want it in addition to my regular choices. \n\nI think a lot of people get swept up in the idea that VR should, or is trying to, replace sitting on your couch or in front of your tv. It’s not. It’s an alternative. \n\nVR is incredible, every time I jump in I feel like the future is now. I would be really bummed out if developers ever stopped pushing for progress.",
          "score": 1,
          "created_utc": 1735345566.0,
          "replies": [
            {
              "id": "m44vl58",
              "author": "lastMinute_panic",
              "body": "There are some interesting, novel experiences - no doubt about that. But in the circles I'm in, for at least the past 10 years, I've been hearing \"that killer app is coming!\" and it just never does. \n\n\nIt's a fun, niche idea. But until I can pop in a pair of contact lenses, or at worst use a pair of lightweight frames with absolutely perfect composite integration - I don't expect much from the medium as a whole. Adoption is low, and attrition/abandonment is super high for a reason.\n\n\nFor developers, the juice isn't worth the squeeze. The market is just too small and what products you have seen released in the last few years have either been mediocre/terrible or propped up by easy money (or both). That isn't a recipe for long term success, I'm afraid. ",
              "score": 1,
              "created_utc": 1735353888.0,
              "replies": [
                {
                  "id": "m44xnje",
                  "author": "VVLynden",
                  "body": "I’m just hopeful. I would love for it to succeed, but tbh I feel like it has succeeded to a degree. It might not be totally altering the landscape of gaming, or in every home, but it’s definitely made a splash and opened up the imaginations of a lot of people. I think it’s a perfectly fine addition to gaming, similar to how music peripherals were big for a few years.",
                  "score": 1,
                  "created_utc": 1735354709.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m46t376",
          "author": "raziel686",
          "body": "Finally someone pointed out the big one that gets ignored all the time in these threads. \"Shutting out the world\" is a _massive_ impediment to the adoption of VR. This directly conflicts with a key point of VR, total immersion, too. The people who can afford these things are adults, and the people least able to remove themselves from what is going on around them are... adults. \n\nI've really wanted to play Half Life: Alyx for a long time, but I probably never will. Between a wife, kids, a dog, visitors, work, etc. I am constantly getting pulled away from my PC. No big deal with traditional games, just pause and get up. With VR my wife would have to walk over and smack me in the back of the head (which would be justified). The only people who can do that are kids and single adults without much going on. That's a poor and small market respectively. The money just isn't there. \n\nAR is a possibility, but it won't take off until they can cram the tech into something that genuinely looks like a pair of glasses, and can also function as corrective glasses for those who need them. Couple that with good battery life and you've got a long, long wait before tech like that is ready for the mainstream.",
          "score": 1,
          "created_utc": 1735392140.0,
          "replies": []
        },
        {
          "id": "m41c1w9",
          "author": "riddlerjoke",
          "body": "good call. vr is like 3d TVs. Not sth we necessarily asked for.",
          "score": -16,
          "created_utc": 1735310292.0,
          "replies": [
            {
              "id": "m41h895",
              "author": "iguacu",
              "body": "That's a little far of a comparison, VR is MUCH better than 3D TVs, which were practically dead on arrival.  And just looking at scifi in media, we did kinda ask for it.",
              "score": 16,
              "created_utc": 1735312196.0,
              "replies": [
                {
                  "id": "m41yk8w",
                  "author": "Vegaprime",
                  "body": "For me, it was the lack of content.",
                  "score": 2,
                  "created_utc": 1735317979.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m41qgsr",
              "author": "DarthBuzzard",
              "body": "VR is more like PCs. It's a general purpose tool that will be used in stationary locations, but will not take over as a mobile device.",
              "score": 3,
              "created_utc": 1735315336.0,
              "replies": [
                {
                  "id": "m44yhmf",
                  "author": "lastMinute_panic",
                  "body": "I wouldn't say VR headsets are a general purpose tool. They are a niche product shoehorned into some very narrow experiences. In this way, I think that places them pretty closely with 3D TV's in terms of utility. \n\n\nDesktop PCs have the benefit of 50 years of development in HCI and ergonomics. Phones are miniaturized versions of this (and early smartphones mostly sucked btw). \n\n\nThere's so much BS marketing attached to VR/AR as an \"enhanced\" experience. The tradeoff of immersion over fatigue just isn't there. Can looking at a monitor or phone eventually cause eyestrain/fatigue? Sure, but the delta between those experiences and VR is very wide. ",
                  "score": 2,
                  "created_utc": 1735355040.0,
                  "replies": [
                    {
                      "id": "m4cp3se",
                      "author": "riddlerjoke",
                      "body": "They can downvote all day but its the reality on VR. People dont like it, people dont ask for it.\n\nWatching a basketball game from a 75in rectangle tv is pretty good. No one needs to have some headset on.\n\nYou play a game, its totally fine to look at a display and if you want to look right, then you use your mouse or gamepad to look right. Most people do not like to have to turn their neck to right, make moves etc to have that 3D experience. Current input methods and thise rectangle displays are pretty good.",
                      "score": 1,
                      "created_utc": 1735479894.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m41u8w9",
      "author": "Abridged6251",
      "body": "If anyone made it mainstream, it was Meta. The Meta Quest 3S is such good value for what you get, the price just needs to come down a bit more and the headset needs to be a little smaller.",
      "score": 14,
      "created_utc": 1735316586.0,
      "replies": [
        {
          "id": "m45tbbo",
          "author": "FoRiZon3",
          "body": "Butbut, **NOT APPLE NO BUY!!!!**",
          "score": 5,
          "created_utc": 1735369646.0,
          "replies": []
        },
        {
          "id": "m477qnt",
          "author": "dat_oracle",
          "body": "330 is already cheap af. I got a meta quest 3 for 550 bucks and I'm pretty much impressed by the overall functionality and experience \n\nThat said... it's still buggy and feels unfinished. sadly",
          "score": 2,
          "created_utc": 1735398425.0,
          "replies": []
        },
        {
          "id": "m4eswrb",
          "author": "ledow",
          "body": "I absolutely detest Meta as a company, but this is right.\n\n(I have an HTC Vive Pro... it's incredible.  I have set up half a dozen friend's Meta headsets for them, so they are definitely mainstream.  I wouldn't touch Apple's \"VR\" offering with a barge pole, thanks.  You could literally give me one for free, I'd sell it, buy a Vive Pro, and then spend the difference on.... another Vive Pro).",
          "score": 1,
          "created_utc": 1735504887.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4166fm",
      "author": "Team_Ed",
      "body": "It’s *great* for cockpit-based simulation games (ie: flight and racing sims), a few specific gaming titles have figured out a great formula (Half Life Alyx, Superhot, Thrill of the Fight), nothing else is particularly worthwhile, and porn is the killer app.",
      "score": 54,
      "created_utc": 1735307946.0,
      "replies": [
        {
          "id": "m4204zg",
          "author": "Silviecat44",
          "body": "VTOL VR is one of my favourite games of all time. VR is perfect for flight sims",
          "score": 14,
          "created_utc": 1735318485.0,
          "replies": []
        },
        {
          "id": "m4208q1",
          "author": "shifty_coder",
          "body": "I have a handful of ‘escape room’ games that are really fun. It’s a lot of exploration of your space and puzzle solving while interacting with the virtual objects around you.",
          "score": 9,
          "created_utc": 1735318518.0,
          "replies": []
        },
        {
          "id": "m41uy9k",
          "author": "denM_chickN",
          "body": "Cyberpunk 2077 w Luke Ross VR is tons of fun. For those who don't know, most titles have some hobbyist working on a VR version and w the right equipment it is a blast.\n\n\nI believe the actual downfall of VR is fatigue as someone commented above.",
          "score": 7,
          "created_utc": 1735316815.0,
          "replies": []
        },
        {
          "id": "m41fnpy",
          "author": "MHWGamer",
          "body": "is the appleVr by now an open system? Last time I checked it did not and therefore is basically dead on arrival. I think even porn apps are severly limited on apple.. and that is the death sentence number 1 lol",
          "score": 7,
          "created_utc": 1735311631.0,
          "replies": [
            {
              "id": "m41gt0z",
              "author": "Team_Ed",
              "body": "I mean VR generally. The Apple version can’t do most of these things.",
              "score": 5,
              "created_utc": 1735312046.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41ywme",
          "author": "Vegaprime",
          "body": "The porn feels like cheating to me and that was 5 years ago vr.",
          "score": 4,
          "created_utc": 1735318090.0,
          "replies": []
        },
        {
          "id": "m450alh",
          "author": "None",
          "body": "It’s the same reason steering wheels are great on paper but is a niche accessory",
          "score": 1,
          "created_utc": 1735355764.0,
          "replies": []
        },
        {
          "id": "m45lbqb",
          "author": "Full-0f-Beans",
          "body": "Adding to the list - Eleven Table Tennis. Probably as close to IRL as we can get currently.",
          "score": 1,
          "created_utc": 1735365255.0,
          "replies": []
        },
        {
          "id": "m41qkrw",
          "author": "DarthBuzzard",
          "body": "I think you just haven't played many games, because SuperHot and Thrill of the Fight aren't considered top of the line anymore.",
          "score": -1,
          "created_utc": 1735315373.0,
          "replies": [
            {
              "id": "m41r54o",
              "author": "Team_Ed",
              "body": "I mean, sure, but they’re still the games I would most recommend to someone who got a VR headset and doesn’t know what to pick up.\n\nI personally use it regularly for driving sims.",
              "score": 5,
              "created_utc": 1735315562.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m41xpqr",
      "author": "Chronotaru",
      "body": "That wasn't an attempt to make VR mainstream, it makes no sense to assign goalposts that whoever is responsible hasn't even set for themselves.",
      "score": 47,
      "created_utc": 1735317708.0,
      "replies": [
        {
          "id": "m42xh80",
          "author": "textredditor",
          "body": "Exactly my thoughts. Apple was strategic about Vision Pro, hell it’s in the name (and price point). This article trying to make “Fetch happen” happen. It’s dumb.",
          "score": 9,
          "created_utc": 1735329099.0,
          "replies": []
        },
        {
          "id": "m46x47s",
          "author": "Ancient-Shelter7512",
          "body": "True. But most people don’t see how Apple is playing the long game. It’s “Pro” for a reason. And they were already prepared for the number sold. I remember when it was not even released and people were shocked at the low amount of headsets they produced.\n\nMeanwhile, Valve and Google are seriously going back to VR. This is going to be interesting.",
          "score": 1,
          "created_utc": 1735394010.0,
          "replies": [
            {
              "id": "m472o68",
              "author": "Chronotaru",
              "body": "Valve never really left, they've just been low profile for a bit. But Google, they pretty much abandoned it, what makes you think they're going back to VR?",
              "score": 1,
              "created_utc": 1735396415.0,
              "replies": [
                {
                  "id": "m49z0si",
                  "author": "Ancient-Shelter7512",
                  "body": "https://9to5google.com/2024/12/12/android-xr-announcement/",
                  "score": 2,
                  "created_utc": 1735431799.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m45wzi2",
          "author": "chris8535",
          "body": "This is cope. The product has failed. ",
          "score": -1,
          "created_utc": 1735371908.0,
          "replies": [
            {
              "id": "m46fvyi",
              "author": "megotlice",
              "body": "It failing as a product and it not being targeted at a general audience are not mutually exclusive.",
              "score": 2,
              "created_utc": 1735384534.0,
              "replies": [
                {
                  "id": "m47pvch",
                  "author": "chris8535",
                  "body": "This is… the dumbest cope I’ve ever heard",
                  "score": 0,
                  "created_utc": 1735404743.0,
                  "replies": [
                    {
                      "id": "m47sjtc",
                      "author": "megotlice",
                      "body": "\"chris8535 wasn't able to cure cancer this year.\"  \nDamn bro how does it feel to fail?",
                      "score": 1,
                      "created_utc": 1735405629.0,
                      "replies": [
                        {
                          "id": "m47t47l",
                          "author": "chris8535",
                          "body": "They can’t even sell current units.  Stop with the cope. ",
                          "score": 0,
                          "created_utc": 1735405815.0,
                          "replies": [
                            {
                              "id": "m483jap",
                              "author": "megotlice",
                              "body": "Now there you have something; they misjudged the market, but that still doesn't mean the goal was mainstream adoption.",
                              "score": 3,
                              "created_utc": 1735409217.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m43lan9",
          "author": "twigboy",
          "body": "TheVerge loves Apple so much, this article is basically fantasy football for them",
          "score": -1,
          "created_utc": 1735336870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m418fj7",
      "author": "DFGBagain1",
      "body": "Too expensive + too uncomfortable + too ugly",
      "score": 38,
      "created_utc": 1735308870.0,
      "replies": [
        {
          "id": "m41buyy",
          "author": "riddlerjoke",
          "body": "Too impractical in general.",
          "score": 20,
          "created_utc": 1735310218.0,
          "replies": []
        },
        {
          "id": "m43ms51",
          "author": "Durzel",
          "body": "Seeing people on Twitch walking around *Disneyland* wearing these things I knew who they were aiming at.  Shame those people just returned them as soon as the novelty had worn off.",
          "score": 1,
          "created_utc": 1735337370.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m417urb",
      "author": "okvrdz",
      "body": "More like Apple wasn’t able to make spending $3,500 USD on a vanity gadget, mainstream. To me it only shows how out of touch corporations are when it comes to household economics.\nThe automotive industry is facing the same realization; they are complaining that “nobody is buying cars anymore” well yes, because you price tag is ridiculous. More expensive cars, more expensive the insurance, etc So, no.",
      "score": 57,
      "created_utc": 1735308638.0,
      "replies": [
        {
          "id": "m41dfru",
          "author": "guyinnoho",
          "body": "Make affordable dependable stuff. And if possible make it in America.\n\nThere should be a wiki that lists such products and brands and lets people rate them. Something more searchable than googling through r/BuyItForLife etc.",
          "score": 11,
          "created_utc": 1735310820.0,
          "replies": [
            {
              "id": "m420bl5",
              "author": "NonPolarVortex",
              "body": "Yeah, this cannot jibe with late stage capitalism ",
              "score": -1,
              "created_utc": 1735318543.0,
              "replies": [
                {
                  "id": "m420xnc",
                  "author": "guyinnoho",
                  "body": "I mean, there are still things made here. There are still good products out there. I'm just saying we should seek them out and support them as opposed to the expensive stuff churned out by globalist firms, manufactured overseas. Don't be such a theoretician.",
                  "score": 0,
                  "created_utc": 1735318740.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m418i7q",
          "author": "MVPizzle_Redux",
          "body": "lol I’ve been saying that exact point all year. I genuinely don’t think that people outside of Wall Street / Silicon Valley have a remote clue of the economic situation of an average suburban American.",
          "score": 5,
          "created_utc": 1735308901.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m417xpg",
      "author": "Durzel",
      "body": "TIL mainstream means being able to drop $3,499 minimum on a VR headset.",
      "score": 22,
      "created_utc": 1735308671.0,
      "replies": [
        {
          "id": "m41av1e",
          "author": "kokopoo12",
          "body": "Still sounds fucking stupid even saying 3500 for a vr headset. It was never going to be mainstream.",
          "score": 5,
          "created_utc": 1735309830.0,
          "replies": []
        },
        {
          "id": "m45t8v7",
          "author": "FoRiZon3",
          "body": "According to Verge, anything not Apple isn't relevant.",
          "score": 2,
          "created_utc": 1735369606.0,
          "replies": []
        },
        {
          "id": "m41gs22",
          "author": "MCA2142",
          "body": ">TIL mainstream means being able to drop $3,499 minimum on a VR headset.\n\nThe article is literally about how $3499 price was not, in fact, mainstream.",
          "score": -1,
          "created_utc": 1735312036.0,
          "replies": [
            {
              "id": "m41z36k",
              "author": "Durzel",
              "body": "It may well be, but the headline feigns ignorance. Using the word “mainstream” in the context of a $3,499 VR headset is disingenuous at best.\n\nFrankly, it’s a pointless thesis *because* the price is so outlandish. It doesn’t matter how good it is or how far forward it moves the tech when the entry price is so high. “Mainstream” and “$3,499” should not exist in the same breath.",
              "score": 3,
              "created_utc": 1735318149.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m41ozqa",
      "author": "PatNMahiney",
      "body": "If Apple really wanted to make a mainstream headset, they would have used cheaper hardware and shipped a much cheaper product. Making a cheap, mainstream headset was clearly not their intention. So saying that Apple \"wasn't able\" seems disingenuous.",
      "score": 8,
      "created_utc": 1735314845.0,
      "replies": []
    },
    {
      "id": "m41md3n",
      "author": "MrMoussab",
      "body": "Even Apple? What does this mean? Like Apple is some magic company that can make everything mainstream?",
      "score": 5,
      "created_utc": 1735313960.0,
      "replies": []
    },
    {
      "id": "m427brs",
      "author": "Vo_Mimbre",
      "body": "It’s not price nor tech. Even free and full immersion isn’t a real huge market.\n\nPeople don’t want the level of separation from others, and certainly don’t want to look ridiculous while doing it. \n\n*Some* do, and that’s Meta’s entire market, which probably loses them money given the cost to make these things.",
      "score": 4,
      "created_utc": 1735320786.0,
      "replies": []
    },
    {
      "id": "m42pwhu",
      "author": "dangerfielder",
      "body": "Meta is eating their lunch. I had five friends get VR for their families. All five got 3s sets.",
      "score": 3,
      "created_utc": 1735326671.0,
      "replies": []
    },
    {
      "id": "m42q9h6",
      "author": "Riptide360",
      "body": "The Dev community wasn’t with Apple on this one.",
      "score": 4,
      "created_utc": 1735326785.0,
      "replies": [
        {
          "id": "m46wuor",
          "author": "isjahammer",
          "body": "Well. No controllers. Would have been a superb gaming platform with controllers we would have seen many ports from the quest but with better graphics. And porn not working properly out of the box is also a big fail. I it's priced at 7 times more it should at least be able to do everything the competition can.",
          "score": 3,
          "created_utc": 1735393890.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m416wsa",
      "author": "None",
      "body": "Apple didn't plan on the first version of the headset going mainstream. This has been discussed ad nauseum.",
      "score": 25,
      "created_utc": 1735308250.0,
      "replies": [
        {
          "id": "m41w2uc",
          "author": "MechaZain",
          "body": "Everyone's too busy trying to get knock Apple down a few pegs all the time to listen. I'll never forget the internet ridiculing tf out of the Airpods announcement and now I see every other person in New York City wearing them.",
          "score": 9,
          "created_utc": 1735317179.0,
          "replies": []
        },
        {
          "id": "m43n7uh",
          "author": "Durzel",
          "body": "I'm not sure what the point is, though.  If they release a Vision Pro Lite in the future, with cut down features, that's hardly aspirational - is it?  \"Look at what you could've won\".\n\nThe only way it would seem to make sense is if the current Vision Pro ended up costing like 1/3 of the price, with an even better version that takes its place price wise.",
          "score": 1,
          "created_utc": 1735337516.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41g528",
      "author": "MHWGamer",
      "body": "Mark The Zucc was actual right for once. The quest 3 is overall a great product for 500 bucks and everybody who is into VR just gets that one and has everything he needs (minus facebook bullshit obviously).\nImagine paying 7 times to have a better hardware device but is basically useless for things you actually wanna do with a VR headset. Mild shock that it didn't work",
      "score": 16,
      "created_utc": 1735311805.0,
      "replies": [
        {
          "id": "m4275zb",
          "author": "jekpopulous2",
          "body": "They also have the Quest 3S for $299 bundled with the new Batman game and three months of Quest +. I’ve even seen that bundle on sale for $250 over the holidays. It’s just an insane value and Meta is going to completely dominate this space for the foreseeable future.",
          "score": 9,
          "created_utc": 1735320736.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42w3rn",
      "author": "Right_Hour",
      "body": "Too expensive. And look stupid. Gee, I wonder why they didn’t take off?",
      "score": 3,
      "created_utc": 1735328651.0,
      "replies": []
    },
    {
      "id": "m43r6at",
      "author": "MasteroChieftan",
      "body": "Was it because it was prohibitively priced? lmao",
      "score": 3,
      "created_utc": 1735338865.0,
      "replies": []
    },
    {
      "id": "m43rs23",
      "author": "Jonathank92",
      "body": "all the tech giants are desperately searching for their next \"thing\" to rake in cash and consumers don't want to be guinea pigs. Why drop thousands on new tech when it's going to be killed off in 2-3 yrs?",
      "score": 3,
      "created_utc": 1735339071.0,
      "replies": []
    },
    {
      "id": "m43ugg3",
      "author": "None",
      "body": "Can’t make anything mainstream when it’s $3500",
      "score": 3,
      "created_utc": 1735339996.0,
      "replies": []
    },
    {
      "id": "m44cj14",
      "author": "Fidodo",
      "body": "Other than having really impressive AR tracking, I felt like it didn't really introduce anything new and while there were a couple great ideas I think the UI was atrocious and the OS had a lot of bugs.",
      "score": 3,
      "created_utc": 1735346558.0,
      "replies": []
    },
    {
      "id": "m46gzka",
      "author": "audigex",
      "body": "“Even Apple” as though Apple haven’t had their share of flops over the years\n\nIt was $3k and most people couldn’t see a real use-case for themselves for that kind of money. For $300 we’d be seeing a bunch more early adopters trying it out (and maybe discovering the use case), but $3k is a lot for all except the richest nerds to drop on a new toy\n\nAt $300 I’d have one already, at $3k I’m not even vaguely considering it",
      "score": 3,
      "created_utc": 1735385251.0,
      "replies": []
    },
    {
      "id": "m41aqzj",
      "author": "xtremitys",
      "body": "$5000 CAD can get me a car.",
      "score": 4,
      "created_utc": 1735309787.0,
      "replies": []
    },
    {
      "id": "m41i5i1",
      "author": "TrippTrappTrinn",
      "body": "I have no idea what I should use it for... which I assume is the case for most people.",
      "score": 2,
      "created_utc": 1735312524.0,
      "replies": [
        {
          "id": "m46xnn9",
          "author": "isjahammer",
          "body": "Well it's not gaming and it's not porn. So... watch movies and... work?",
          "score": 1,
          "created_utc": 1735394254.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41v3aw",
      "author": "None",
      "body": "Well it’s kind of hard to sell when the price is ridiculously high, there’s a very limited amount of VR games (and non VR games for Apple) and there are much cheaper options. You could buy a kick ass, way more powerful PC for that price with a bunch of games, controller and headset.",
      "score": 2,
      "created_utc": 1735316861.0,
      "replies": []
    },
    {
      "id": "m41vps6",
      "author": "DXsocko007",
      "body": "You can’t make something main stream that after taxes is 4 grand.",
      "score": 2,
      "created_utc": 1735317063.0,
      "replies": []
    },
    {
      "id": "m41w1gr",
      "author": "Jlchevz",
      "body": "It’s really simple. VR has its place but it’s cumbersome and it’s uncomfortable. It gets in the way of doing things seamlessly.",
      "score": 2,
      "created_utc": 1735317167.0,
      "replies": []
    },
    {
      "id": "m41wq6f",
      "author": "ButterscotchLow8950",
      "body": "Yeah. Aside from being ridiculously priced. VR headsets are too heavy, battery life stinks, and the content just isn’t there yet. And until someone can make these things smaller, lighter, more affordable AND more entertaining…. They will continue to be more of a novelty item.",
      "score": 2,
      "created_utc": 1735317390.0,
      "replies": []
    },
    {
      "id": "m41xlb8",
      "author": "Accurate_Stuff9937",
      "body": "I really like VR but I get vertigo instantly and it's too heavy to have on my head. I don't like not being able to see my surroundings.",
      "score": 2,
      "created_utc": 1735317669.0,
      "replies": []
    },
    {
      "id": "m420vnn",
      "author": "Blapanda",
      "body": "Sure, base model 3500 bucks, fully filled with other stuff 4600+.\nNo one was going to buy an expensive paperweight.",
      "score": 2,
      "created_utc": 1735318722.0,
      "replies": []
    },
    {
      "id": "m428bru",
      "author": "mattsslug",
      "body": "Apple didn't even try to make them mainstream.\nThey created a device with limited functionality and charged a HUGE amount for it.",
      "score": 2,
      "created_utc": 1735321105.0,
      "replies": []
    },
    {
      "id": "m42a2u4",
      "author": "fenriq",
      "body": "Lol, for a mere $3500? How could they have failed?",
      "score": 2,
      "created_utc": 1735321660.0,
      "replies": []
    },
    {
      "id": "m42he3g",
      "author": "trekxtrider",
      "body": "$3500 for a VR headset is never going to make it mainstream. Apple could have done it cheaper but chose not to because they are one of the greediest companies to exist.",
      "score": 2,
      "created_utc": 1735323962.0,
      "replies": []
    },
    {
      "id": "m42l8lf",
      "author": "noflooddamage",
      "body": "My issue with vr has always been the lack of centralization. You’ve got different hardware from each company and none of it is really standardized. Everyone wants a piece of the pie and none care what the consumer wants/needs. \n\nThis has led to a niche market becoming even more niche because of course you can’t use your psvr with your oculus quest games, so i guess we’ll drop another $500 on a headset that will get limited game development and become obsolete in a few years.\n\nI love vr. There were a handful of times where I’ve been legitimately blown away by a video game experience. Going from ps2 to ps3 was one of them, and another was the first time I used an oculus. \n\nI just wish there was a single platform where there could be some meaningful and accessible development happening.",
      "score": 2,
      "created_utc": 1735325183.0,
      "replies": []
    },
    {
      "id": "m42uvwi",
      "author": "MrFiendish",
      "body": "The reason that PlayStation got off the ground was that Sony sold it at a slight loss. They played the long game and knew that if everyone had a PS, the software would follow.",
      "score": 2,
      "created_utc": 1735328261.0,
      "replies": []
    },
    {
      "id": "m439ikb",
      "author": "sarhoshamiral",
      "body": "Hasn't Meta have been fairly successful? Apple never had a chance since even trying their headset in the store was a hassle.\n\nAppearently I needed an appointment while the story was fairly empty and there was a person telling me that I needed an appointment that could have just helped me to try the stupid headset for a few seconds.",
      "score": 2,
      "created_utc": 1735333021.0,
      "replies": []
    },
    {
      "id": "m44a583",
      "author": "jzr171",
      "body": "The AVP was not remotely worth the price. Not even half price. It didn't do anything as well as its competition. Every selling point could be accomplished by a $300 Meta Quest, often better. But honestly I think we've hit Max capacity for VR users. I want to be a VR user but it's definitely a once in a while activity for me.",
      "score": 2,
      "created_utc": 1735345692.0,
      "replies": []
    },
    {
      "id": "m44nklr",
      "author": "TheCatanRobber",
      "body": "I got a Meta Quest 3S for Christmas and it’s awesome. Way way less than what Apple wants for theirs.",
      "score": 2,
      "created_utc": 1735350700.0,
      "replies": []
    },
    {
      "id": "m44vk8o",
      "author": "xraig88",
      "body": "They weren’t trying to were they? You don’t price something at $3500 if you want it mainstream.",
      "score": 2,
      "created_utc": 1735353877.0,
      "replies": [
        {
          "id": "m452jj8",
          "author": "Benjamoose",
          "body": "Came here for this comment.\n\nSeems a pretty biased headline.\n\nVR is doing fine in gaming circles but you're never going to get mass adoption at $3500, and at the layman affordability range VR is a wholly unimpressive affair (such as the devices that turn your phone into a VR headset).\n\nUntil a decent, entry level headset is available for dirt cheap, which will ultimately happen in the future when manufacturing gets cheaper and there's a whole slew of older headsets in the market, it's not going to get mass adoption.",
          "score": 2,
          "created_utc": 1735356685.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m45959g",
      "author": "spinosaurs70",
      "body": " VR is the surround sound of visual entertainment; most people don't really need immersion. They are fine with reality and the fake world of digital tech and movies being separate.",
      "score": 2,
      "created_utc": 1735359492.0,
      "replies": [
        {
          "id": "m46oyte",
          "author": "DarthBuzzard",
          "body": "I disagree. Well I mean maybe you're right on \"most\" since most people don't even need a PC or tablet, but those products still serve absurdly large markets.\n\nVR's utility is that it's a currently janky, but eventually a streamlined pseudo-teleportation device. Most people do not have the time, money, or ability to go to the places they want to go, attend the events they'd like to attend, and see the people they want to see, on a frequent basis if at all. VR will be the next best thing and a clear mile better than any other alternative. \n\nSo things like holocalls and volumetric sporting events/concerts could be a gamechanger. People would feel like they are there at the event or there with the person.",
          "score": 1,
          "created_utc": 1735390047.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m45djay",
      "author": "Dtoodlez",
      "body": "If quest didn’t become huge after having a wireless standalone headset there’s no chance VR takes off as long as it’s strapped to your face.",
      "score": 2,
      "created_utc": 1735361473.0,
      "replies": []
    },
    {
      "id": "m45z697",
      "author": "boersc",
      "body": "If anyone can currently do it, it's Sony. Ps5 sales are at alltime high  so the base config is there. The headset was sold at a high discount (some 300 euros) and they have a monthly growing library of games in PS Plus Premium of excellent vr games.\n\nIt's affordable, easy to use and has the base library to boot.\nNow, we just have to see if it really latches on .",
      "score": 2,
      "created_utc": 1735373321.0,
      "replies": [
        {
          "id": "m46teus",
          "author": "fixITman1911",
          "body": "Facebook/meta already has this with the quest. You can get one in the $300 range. They have a bunch of content that will run right through the set, or you can pair it to your PC and play anything on STEAM or from the META app.\n\nHonestly, the biggest thing holding it back is probably that it is owned by meta/facebook",
          "score": 2,
          "created_utc": 1735392294.0,
          "replies": [
            {
              "id": "m471aaf",
              "author": "boersc",
              "body": "That's exactly why I won't get a quest...",
              "score": 1,
              "created_utc": 1735395835.0,
              "replies": [
                {
                  "id": "m471v9j",
                  "author": "fixITman1911",
                  "body": "I have to say it's not super intrusive that it's meta, and worth it IMO. I have quite a lot of fun with mine",
                  "score": 0,
                  "created_utc": 1735396081.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m46fog8",
      "author": "BelCantoTenor",
      "body": "Such a tone deaf response to the current situation in the US. Homelessness is up 18%. People are struggling to afford food and shelter. Why won’t people buy our overpriced luxury electronics product? Oh gee, let me see…",
      "score": 2,
      "created_utc": 1735384396.0,
      "replies": []
    },
    {
      "id": "m4a9g5x",
      "author": "Grizzly_Berry",
      "body": "To become \"mainstream,\" VR will need a better selection of games (currently seems like the options are either short party game like beatsaber, shallow sandbox game like HHH, or VR versions of preexisting games), headsets more affordable, and better peripherals like movement rigs, controller configurations/holders (swords, guns, etc), and cable management solutions.\n\nI know one major thing that breaks immersion and contributes to motion sickness is movement. I'd love a walking rig instead of joysticking or clicking where I want to go.",
      "score": 2,
      "created_utc": 1735435363.0,
      "replies": []
    },
    {
      "id": "m4n47wd",
      "author": "HanzoNumbahOneFan",
      "body": "Well they didn't fuckin try did they? Insane price point, no games for it, barely any software that supported it, designed to be worn all day but given like a 2 hour battery life and also gave it a terribly designed head strap for long term use. Like what. You couldn't even watch a full movie on it without being uncomfortable as hell and needing to plug it into the wall. And that was basically the only use for it.",
      "score": 2,
      "created_utc": 1735618049.0,
      "replies": []
    },
    {
      "id": "m41d1fv",
      "author": "okram2k",
      "body": " VR continues to be a solution in search of a problem. some of the apple vr stuff was impressive but it was also at a price point targeted at business and professionals not casual users. META has likewise tried to rebrand itself as a business solution instead of a novelty gaming apparatus but I just don't see many business needs that aren't easier, faster, and cheaper to do without VR instead of with.",
      "score": 4,
      "created_utc": 1735310671.0,
      "replies": [
        {
          "id": "m41yjbw",
          "author": "BlazeOfGlory72",
          "body": "> VR continues to be a solution in search of a problem.\n\nThis is really the crux of it. When given the option to use VR for basically anything, my question is always “why?” It is almost always easier and more convenient to use current methods of interaction, so why would anyone actually use VR beyond the novelty?",
          "score": 2,
          "created_utc": 1735317971.0,
          "replies": [
            {
              "id": "m423ma6",
              "author": "DarthBuzzard",
              "body": "Because it's fun and useful?",
              "score": 0,
              "created_utc": 1735319601.0,
              "replies": [
                {
                  "id": "m4262a6",
                  "author": "Vo_Mimbre",
                  "body": "Fun sometimes, useful rarely. In very specialized cases it can be superior to flat screen. But that doesn’t a market make:",
                  "score": 4,
                  "created_utc": 1735320380.0,
                  "replies": [
                    {
                      "id": "m426kyb",
                      "author": "DarthBuzzard",
                      "body": "I would not consider communication and education to be specialized usecases. Those are very broad sectors, and communication in particular is the #1 usecase of every computing device ever, with VR being the clear winner in real-time communication capabilities even in its early state.",
                      "score": 0,
                      "created_utc": 1735320551.0,
                      "replies": [
                        {
                          "id": "m427ivw",
                          "author": "Vo_Mimbre",
                          "body": "That’s the *potential*. And we’ve heard that since the 00s.\n\nWhat’s the *actual* though?",
                          "score": 1,
                          "created_utc": 1735320850.0,
                          "replies": [
                            {
                              "id": "m429a2u",
                              "author": "DarthBuzzard",
                              "body": "Millions of people are *already* using it for these purposes. Yeah there is a certain potential that is unfulfilled in the sense that avatars need to get to complete photorealism to get the masses on board, but the early adopters are making great use of the tech currently.",
                              "score": 1,
                              "created_utc": 1735321407.0,
                              "replies": [
                                {
                                  "id": "m43d4v8",
                                  "author": "Vo_Mimbre",
                                  "body": "Yes. Millions. Best estimates I’ve seen is 170MM worldwide. That’s impressive, but it hasn’t been some meteoric growth once peak interest started falling off around 2018. Healthcare and education have the highest growth potential. That’s important because while it’s useful there, that’s not *consumer*.\n\nConsumer/home use isn’t the be-all/end-all. But that’s what Apple and Meta are trying for.\n\nAnd yet, adoption of tech like this hasn’t historically started at home. It was *brought* home. Then it evolved. It tools companies distributing Blackberries to pave a path to iPhone, workers bringing work home to drive PC sales, that sorta thing.\n\nApple tried to skip that step. A market *for them* does not exist yet.\n\nAnd the projected growth of AR is so much higher because it has more tangible usefulness for everyday living. VR is cool and fun, I have a few, I’ve tried most since the 90s, when it works well it’s amazing. But not as an everyday thing for normies.",
                                  "score": 0,
                                  "created_utc": 1735334198.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m424hyd",
      "author": "Son-of-Suns",
      "body": "Apple didn't TRY to make a mainstream VR headset.",
      "score": 4,
      "created_utc": 1735319881.0,
      "replies": []
    },
    {
      "id": "m423f95",
      "author": "chris8535",
      "body": "For everyone defending Apple and trying to post justify this failing remember this:\n\nJonny Ive the most successful product designer in history quit over this and told Tim Cook this would be a failure that he would never be associated with and Steve Jobs would have never wanted.  ",
      "score": 3,
      "created_utc": 1735319539.0,
      "replies": []
    },
    {
      "id": "m419ho0",
      "author": "None",
      "body": "[deleted]",
      "score": 5,
      "created_utc": 1735309293.0,
      "replies": [
        {
          "id": "m41msni",
          "author": "Fluggernuffin",
          "body": "That’s an interesting take, I had the opposite experience. I bought the Quest 2 basically as they were about to stop selling them in favor of the 3rd gen headsets, which meant I got it for $250. I did have a little headset jealousy at first, but the Quest 2 does just fine and here I am a year later, still logging on and playing Walkabout Mini Golf with random folks from discord.",
          "score": 2,
          "created_utc": 1735314106.0,
          "replies": [
            {
              "id": "m41nko4",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1735314368.0,
              "replies": [
                {
                  "id": "m41o4fj",
                  "author": "Fluggernuffin",
                  "body": "Yeah, that would be frustrating if you didn’t know it was coming. I also think the difference between the 1 vs the 2 is more stark than the 2 vs the 3.  The 3 has a lot more features like color passthrough, but the 2 was a huge leap forward in VR tech, much more comfortable and capable than the original Quest.",
                  "score": 1,
                  "created_utc": 1735314553.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m41sh3j",
      "author": "LeCrushinator",
      "body": "Apple wasn’t trying to make a mainstream device. They’re not stupid, they knew that price wouldn’t be mainstream.",
      "score": 4,
      "created_utc": 1735316004.0,
      "replies": []
    },
    {
      "id": "m41ld12",
      "author": "Ancient-Beat-1614",
      "body": "Lol check OP's account, this guy is the #1 VR doomposter",
      "score": 3,
      "created_utc": 1735313618.0,
      "replies": []
    },
    {
      "id": "m4191m8",
      "author": "Kromo5050",
      "body": "Correct the cost $3500",
      "score": 2,
      "created_utc": 1735309116.0,
      "replies": []
    },
    {
      "id": "m42adlf",
      "author": "RightToTheThighs",
      "body": "Apple couldn't at $3.5k, but meta could at <$500.  Stupid headline",
      "score": 2,
      "created_utc": 1735321755.0,
      "replies": []
    },
    {
      "id": "m437oa5",
      "author": "BloodSteyn",
      "body": ". . . Mainstream?  At that price point. Bah, don't make us laugh.\n\nI could buy my whole family Meta Quest 2's for the price of one overpriced Apple flop.",
      "score": 2,
      "created_utc": 1735332423.0,
      "replies": []
    },
    {
      "id": "m448nt9",
      "author": "Mr_Gaslight",
      "body": "VR headsets are a solution in search of a problem to solve.",
      "score": 2,
      "created_utc": 1735345154.0,
      "replies": []
    },
    {
      "id": "m41fj0e",
      "author": "thinkfast37",
      "body": "it’s in very much still in a development and early adopter kind of stage. Affordability and market penetration was not the goal.\n\nThe convergence of AI and VR, though is gonna be very interesting.",
      "score": 2,
      "created_utc": 1735311584.0,
      "replies": []
    },
    {
      "id": "m419n6v",
      "author": "themarouuu",
      "body": "Nothing to do with Apple, or price, or anything like that.\n\nEven using the latest and best Apple had, not caring about the price, rather making the product good... the tech is not there.\n\nNo one wants the weight and size, no one wants to look through binoculars, and no one wants that tiny battery.\n\nThe products offered by the competition are cheaper but they suck even more.\n\nMaybe in 5 years or something.",
      "score": 1,
      "created_utc": 1735309355.0,
      "replies": [
        {
          "id": "m41lb2v",
          "author": "deVliegendeTexan",
          "body": "People have been saying “maybe in 5 years” about VR for about 25 years. It’s the new flying cars. \n\nI have no doubt it’ll happen eventually. But we need a complete revolution in both display technology and battery technology before it will happen. It’ll take off when people can wear glasses that are completely indistinguishable from regular reading glasses, or even contact lenses. And probably not a moment sooner.",
          "score": 2,
          "created_utc": 1735313600.0,
          "replies": [
            {
              "id": "m41r3rr",
              "author": "DarthBuzzard",
              "body": "No serious money and investment was put into VR until about a decade ago.",
              "score": 3,
              "created_utc": 1735315549.0,
              "replies": []
            },
            {
              "id": "m41rrj5",
              "author": "themarouuu",
              "body": "I know :) I tried a pair like 25 years ago, not even kidding. \n\nIt really hasn't changed all that much to be honest. At least not on a fundamental level.",
              "score": 0,
              "created_utc": 1735315770.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41cf4r",
          "author": "riddlerjoke",
          "body": "Bigger problem is no one wants to have 3D view stuff.\nMost people dont want to move, look left right up and down for their games etc.",
          "score": 2,
          "created_utc": 1735310434.0,
          "replies": [
            {
              "id": "m41rwdg",
              "author": "themarouuu",
              "body": "Cmon man, it's for porn.",
              "score": 2,
              "created_utc": 1735315815.0,
              "replies": [
                {
                  "id": "m42655b",
                  "author": "Vo_Mimbre",
                  "body": "Why they’re investing in robots now.",
                  "score": 1,
                  "created_utc": 1735320405.0,
                  "replies": [
                    {
                      "id": "m42bpx6",
                      "author": "themarouuu",
                      "body": "iHole ?",
                      "score": 2,
                      "created_utc": 1735322175.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m41dji5",
      "author": "ConstructionBig1810",
      "body": "I found the headset intriguing as someone who loves movies, but that was really the only use case I saw for it personally. And for the amount you’d have to spend on the Apple headset, you could buy an OLED tv, full soundbar setup, and a great 4k player that would also be useful for non VR applications. Until they become lighter, wireless, and cheaper, they won’t really stand a chance of penetrating the market in a meaningful way.",
      "score": 1,
      "created_utc": 1735310860.0,
      "replies": []
    },
    {
      "id": "m41oj9k",
      "author": "HatingGeoffry",
      "body": "They say this and then Meta Quest 3/3S is topping Amazon charts during the holidays. VR is mainstream, it's just more Wii-like. They're buying hardware and not software which is the biggest issue for the VR industry",
      "score": 1,
      "created_utc": 1735314691.0,
      "replies": []
    },
    {
      "id": "m41pdre",
      "author": "leathco",
      "body": "Still on a Quest 2. Now that the Quest 3 512 has come down to 500 tho I plan on getting one.",
      "score": 1,
      "created_utc": 1735314974.0,
      "replies": []
    },
    {
      "id": "m4262rb",
      "author": "tenroy6",
      "body": "They’re too expensive lol.",
      "score": 1,
      "created_utc": 1735320384.0,
      "replies": []
    },
    {
      "id": "m428zp5",
      "author": "WordNERD37",
      "body": "No one wants to lug around $3k targets for mugging everywhere they go.",
      "score": 1,
      "created_utc": 1735321316.0,
      "replies": []
    },
    {
      "id": "m42ay3f",
      "author": "Specialist_Brain841",
      "body": "because it’s a fake trend",
      "score": 1,
      "created_utc": 1735321933.0,
      "replies": []
    },
    {
      "id": "m42dpso",
      "author": "mikeyunk",
      "body": "Because they are $3500, duh.",
      "score": 1,
      "created_utc": 1735322800.0,
      "replies": []
    },
    {
      "id": "m42g451",
      "author": "diditformoneydog",
      "body": "It was groceries for my kids or the VR thingy.",
      "score": 1,
      "created_utc": 1735323559.0,
      "replies": []
    },
    {
      "id": "m42ga6b",
      "author": "pizoisoned",
      "body": "I’m not sure anyone wanted shut out the world VR. I think most people think it’s an interesting novelty, but not at the price point it’s at and not at the expense of being shut out of their environment. \n\nApples headset was fine as far as tech, but it’s too expensive and too niche to ever be practical for a wider market. You’d have thought their internal studies would have shown that before they invested in it.",
      "score": 1,
      "created_utc": 1735323612.0,
      "replies": []
    },
    {
      "id": "m42hpkq",
      "author": "A_Dragon",
      "body": "Maybe because it was too expensive.",
      "score": 1,
      "created_utc": 1735324062.0,
      "replies": []
    },
    {
      "id": "m42zuch",
      "author": "Obi177",
      "body": "I think VR is awesome but unfortunately until it is more affordable and consistently affordable I will not be participating in making it more mainstream",
      "score": 1,
      "created_utc": 1735329870.0,
      "replies": []
    },
    {
      "id": "m438qw5",
      "author": "Jepperto",
      "body": "Ive had most of the headsets and its still not there. It hurts your face. Nobody wants to hurt their face for a hobby.",
      "score": 1,
      "created_utc": 1735332772.0,
      "replies": []
    },
    {
      "id": "m43l19v",
      "author": "WolfWomb",
      "body": "Unnecessary. Will always be unnecessary.",
      "score": 1,
      "created_utc": 1735336785.0,
      "replies": []
    },
    {
      "id": "m44vjn4",
      "author": "Thisiscliff",
      "body": "I thought they look cool but i can’t justify $5k cad",
      "score": 1,
      "created_utc": 1735353871.0,
      "replies": []
    },
    {
      "id": "m44ye44",
      "author": "bad_robot_monkey",
      "body": "I migrated from developing VR productivity apps to developing productivity apps that can benefit from baked-in VR integration…because you can’t force adoption with a sledgehammer over the head.  You have to give compelling use cases without forcing people to abandon that with which they are already comfortable.",
      "score": 1,
      "created_utc": 1735355001.0,
      "replies": []
    },
    {
      "id": "m455m91",
      "author": "Lthstudios",
      "body": "Too early. Some people still have friends irl.",
      "score": 1,
      "created_utc": 1735357963.0,
      "replies": []
    },
    {
      "id": "m457hgc",
      "author": "mencival",
      "body": "Newsflash: Apple never intended to make VR headsets mainstream in 2024.",
      "score": 1,
      "created_utc": 1735358767.0,
      "replies": []
    },
    {
      "id": "m45nvyk",
      "author": "WrongUserID",
      "body": "Even if they idea is good, there is no real mainstream purpose of using it. Not yet at least as it's quite clumsy.\n\nWhen it's the size of Google Glasses with a powerful computer, it would be more interesting. Yet I still have a hard time coming up with a real purpose of VR/AR in my daily routines.",
      "score": 1,
      "created_utc": 1735366616.0,
      "replies": []
    },
    {
      "id": "m45vnhj",
      "author": "Ok-Alarm7257",
      "body": "VR has existed in many forms through the years and was always gimmicky, nothing about a virtual world is interesting enough to spend that many hours wearing something on your face",
      "score": 1,
      "created_utc": 1735371064.0,
      "replies": []
    },
    {
      "id": "m45wnyg",
      "author": "Mister_Squirrels",
      "body": "I would buy one right now if the price came way way down",
      "score": 1,
      "created_utc": 1735371703.0,
      "replies": []
    },
    {
      "id": "m4656u6",
      "author": "BrokkelPiloot",
      "body": "Vendor lock in doesn't help with adaption rate.",
      "score": 1,
      "created_utc": 1735377328.0,
      "replies": []
    },
    {
      "id": "m46755m",
      "author": "zillskillnillfrill",
      "body": "Way too expensive for what they were",
      "score": 1,
      "created_utc": 1735378646.0,
      "replies": []
    },
    {
      "id": "m46ha6c",
      "author": "zerGoot",
      "body": "in what fucking universe is a several thousand dollar headset able to become mainstream??",
      "score": 1,
      "created_utc": 1735385445.0,
      "replies": []
    },
    {
      "id": "m46kgv6",
      "author": "divineaction",
      "body": "I can barely afford an iphone. How am i going to afford a headset.",
      "score": 1,
      "created_utc": 1735387445.0,
      "replies": []
    },
    {
      "id": "m46mk9t",
      "author": "tionong",
      "body": "Vr is just my beat Saber console.",
      "score": 1,
      "created_utc": 1735388692.0,
      "replies": []
    },
    {
      "id": "m46tfeu",
      "author": "Vegetable_Tackle4154",
      "body": "EvenAapple? Apple hasn’t done much worth talking about since the iPhone.",
      "score": 1,
      "created_utc": 1735392301.0,
      "replies": []
    },
    {
      "id": "m46u172",
      "author": "Ab47203",
      "body": "If it was $500 or lower people would buy them like crazy.",
      "score": 1,
      "created_utc": 1735392588.0,
      "replies": []
    },
    {
      "id": "m46w6y3",
      "author": "HotHamBoy",
      "body": "VR won’t ever be mainstream because it requires cutting you off from your surrounding environment and most humans don’t like doing that in practice, they only think it would be cool in theory.\n\nWhen the novelty wears off, people move on\n\nAR maybe, i dunno, not at $3.5k",
      "score": 1,
      "created_utc": 1735393592.0,
      "replies": []
    },
    {
      "id": "m46wf2p",
      "author": "BassWingerC-137",
      "body": "Not at half that price.",
      "score": 1,
      "created_utc": 1735393695.0,
      "replies": []
    },
    {
      "id": "m470432",
      "author": "Grumpycatdoge999",
      "body": "If it was $1000 or less, people might’ve considered it",
      "score": 1,
      "created_utc": 1735395333.0,
      "replies": []
    },
    {
      "id": "m47asyk",
      "author": "geckogirl92",
      "body": "Ony",
      "score": 1,
      "created_utc": 1735399564.0,
      "replies": []
    },
    {
      "id": "m47v1in",
      "author": "vid_icarus",
      "body": "Price point + lack of everyday practical application = no buy",
      "score": 1,
      "created_utc": 1735406447.0,
      "replies": []
    },
    {
      "id": "m48box7",
      "author": "t3hd0n",
      "body": "This was the biggest example of why console devs get Dev kits instead of bs commercially available \"pro\" models. If you dug under the headlines they were claiming these were supposed to be just for devs, like a macbook pro is for artists. There was supposed to be a cheaper entry level headset to come out down the line but no they've also trained their fanboys to just get anything labeled pro and then surprise pikachu face'd when everyone expected it to have a fully realized app store straight out the gate day 1",
      "score": 1,
      "created_utc": 1735411853.0,
      "replies": []
    },
    {
      "id": "m4isafb",
      "author": "crasspy",
      "body": "I don't think Apple intended it to be a mass consumer item, at this stage. The headset, which is pretty much the state of the art, was more a technological proof of concept and top tier item for early adopters. Check back in ten years to see if they've made headsets of some type mainstream.",
      "score": 1,
      "created_utc": 1735566439.0,
      "replies": []
    },
    {
      "id": "m4tluj7",
      "author": "Th3_Eleventy3",
      "body": "“Cheaply enough” they could not do it cheaply enough. That and it was neck achingly heavy.  \nDevelopment adoption and frame rate s needed to be higher.  \nI mean there are some technological hurdles.",
      "score": 1,
      "created_utc": 1735719187.0,
      "replies": []
    },
    {
      "id": "m41achl",
      "author": "deja_geek",
      "body": "VR headsets won't become a thing until we figure out a full immersion experience.  Otherwise, the are just a gimmick",
      "score": 1,
      "created_utc": 1735309631.0,
      "replies": [
        {
          "id": "m41qnyt",
          "author": "DarthBuzzard",
          "body": "VR is a lot more immersive than you think. Give it a try.",
          "score": 2,
          "created_utc": 1735315402.0,
          "replies": []
        },
        {
          "id": "m41loxa",
          "author": "deVliegendeTexan",
          "body": "I don’t think that’s it. You could probably compromise on the immersion if you made them actually practical and stylish to wear. Give me something only marginally better than the Google Glass of 10 years ago, but make it completely indistinguishable from a regular pair of reading glasses? I’d be all over that.",
          "score": 1,
          "created_utc": 1735313732.0,
          "replies": [
            {
              "id": "m41qzho",
              "author": "SUPRVLLAN",
              "body": "Yeah you're right. VR isn't the future, whoever figures out how to get AR into a normal pair of Raybans at a reasonable price is going to win.",
              "score": 3,
              "created_utc": 1735315509.0,
              "replies": [
                {
                  "id": "m41xnvx",
                  "author": "DarthBuzzard",
                  "body": "We'll have photorealistic VR curved sunglasses years before you get actual high quality all-day wearable AR into a normal pair of raybans.\n\nThe technological hurdles for AR are much higher than VR, which means VR is the future first.",
                  "score": 1,
                  "created_utc": 1735317692.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m41qwi7",
              "author": "DarthBuzzard",
              "body": "> Give me something only marginally better than the Google Glass of 10 years ago\n\nYou already have that. It's called a 2024 smartwatch. The concept is the same. It does everything Google Glass did, but with more than a decade of extra power and features.\n\nThis is why you don't want Google Glass-like devices, because there isn't a need for them. VR is able to justify itself because the high level of immersion is a unique property.",
              "score": 1,
              "created_utc": 1735315482.0,
              "replies": [
                {
                  "id": "m41rmrf",
                  "author": "deVliegendeTexan",
                  "body": "You’re not wrong that the Apple Watch is basically a more functional Glass. I have a Watch, and I had a Glass (through a work project). \n\nBut if you could give me what Apple Watch does, but put it in a pair of regular glasses, I would 100% take the glasses over the watch. This is fry-take-my-money-dot-gif territory.",
                  "score": 3,
                  "created_utc": 1735315726.0,
                  "replies": [
                    {
                      "id": "m41s8oq",
                      "author": "DarthBuzzard",
                      "body": "I mean sure I can see how it could change things from a usability standpoint, going from your wrist to your face. I just don't see mainstream appeal for that since there's very few extra features you'd be getting.",
                      "score": 0,
                      "created_utc": 1735315927.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m41bolb",
      "author": "Oiggamed",
      "body": "Still wondering why they think everyone would use them. For what exactly…?",
      "score": 1,
      "created_utc": 1735310150.0,
      "replies": []
    },
    {
      "id": "m41q0ib",
      "author": "eulynn34",
      "body": "Surely it didn't have anything to do with the nearly 4 grand price tag",
      "score": 1,
      "created_utc": 1735315187.0,
      "replies": []
    },
    {
      "id": "m41v3ex",
      "author": "ballsmigue",
      "body": "Duh. They priced them so high a regular consumer wouldn't be able to afford them.",
      "score": 1,
      "created_utc": 1735316862.0,
      "replies": []
    },
    {
      "id": "m41vhch",
      "author": "Wpgjetsfan19",
      "body": "$3500 usd and they were cracking.",
      "score": 1,
      "created_utc": 1735316988.0,
      "replies": []
    },
    {
      "id": "m41xz2n",
      "author": "luckylebron",
      "body": "Price is insane for competitive headset.",
      "score": 1,
      "created_utc": 1735317791.0,
      "replies": []
    },
    {
      "id": "m422ptk",
      "author": "JojoBaliah",
      "body": "I just want insulin",
      "score": 1,
      "created_utc": 1735319313.0,
      "replies": []
    },
    {
      "id": "m43zv0e",
      "author": "QuantumQuantonium",
      "body": "Lol dont rely on apple to make anything mainstream. Their ideas like notches and removing headphone jacks and bottom facing charging on mice and $1k monitor stands aren't exactly the brightest.\n\nMeta/oculus is the one to look at for this, getting closer to making VR mainstream with the 3 and 3s at a reasonable low-mid range price. Next we need Valve to reenter the hardware vr market and then someone like Samsung to reenter with a budget solution like something using phones again.\n\nNintendo and valve didnt make handheld consoles/PC mainstream by releasing a $600 device, they did so by releasing something affordable, and then others stepped in to offer higher end and more expensive alternatives. This sounds like the same path VR should go by.",
      "score": 1,
      "created_utc": 1735341926.0,
      "replies": []
    },
    {
      "id": "m419bgn",
      "author": "h0tel-rome0",
      "body": "Apple didnt even try",
      "score": 0,
      "created_utc": 1735309225.0,
      "replies": [
        {
          "id": "m41c3la",
          "author": "riddlerjoke",
          "body": "They definitely did. Burned tons of money",
          "score": -1,
          "created_utc": 1735310310.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41cugc",
      "author": "imacmadman22",
      "body": "Clearly, no one learned anything from the flop that was **Virtual Boy.**\n\n\nhttps://en.wikipedia.org/wiki/Virtual_Boy?wprov=sfti1",
      "score": 0,
      "created_utc": 1735310597.0,
      "replies": [
        {
          "id": "m41xrio",
          "author": "DarthBuzzard",
          "body": "Virtual Boy has nothing to do with VR, lol.",
          "score": 2,
          "created_utc": 1735317724.0,
          "replies": [
            {
              "id": "m41zpig",
              "author": "imacmadman22",
              "body": "Interesting that, given the name and all…",
              "score": 0,
              "created_utc": 1735318349.0,
              "replies": [
                {
                  "id": "m423c6d",
                  "author": "DarthBuzzard",
                  "body": "Marketing at work.",
                  "score": 2,
                  "created_utc": 1735319511.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m41htjo",
      "author": "iguacu",
      "body": "Keep in mind that when laptops came out, they were \\~$5000 adjusted for inflation.  Now we hand them out to elementary school students for free.",
      "score": 0,
      "created_utc": 1735312407.0,
      "replies": [
        {
          "id": "m42dty9",
          "author": "ynwahs",
          "body": "Where were the sub $400 options?",
          "score": 1,
          "created_utc": 1735322836.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41kehq",
      "author": "PastaVeggies",
      "body": "Looking forward to moving past the VR fad that no one has time for.",
      "score": -1,
      "created_utc": 1735313294.0,
      "replies": [
        {
          "id": "m438y7d",
          "author": "DarthBuzzard",
          "body": "Maybe you missed the memo, but it's not a fad and Apple are not giving up.",
          "score": -1,
          "created_utc": 1735332838.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41l2rl",
      "author": "HeirOfBreathing",
      "body": "vr users when 40-70% of ppl who use vr still get motion sickness and until this wall is passed there will be no mass adoption of their middling platforms: 😮",
      "score": -1,
      "created_utc": 1735313523.0,
      "replies": []
    },
    {
      "id": "m41aq4k",
      "author": "Majorjim_ksp",
      "body": "They won’t be mainstream for another 50 years.",
      "score": 0,
      "created_utc": 1735309777.0,
      "replies": []
    },
    {
      "id": "m41dpsk",
      "author": "objecter12",
      "body": "I just think VR has a long way to go before it’s adopted as mainstream. \n\nIf any company could’ve done it by now it would’ve the one that made smartwatches common a decade ago, and they couldn’t.",
      "score": 0,
      "created_utc": 1735310924.0,
      "replies": []
    },
    {
      "id": "m41dt9e",
      "author": "TGAILA",
      "body": "It's too bulky and expensive right now.   It was not intended for the mainstream market. Eventually, they will have to streamline it.  Make it more affordable. It takes several generations to produce a good product.  They just keep it on the back burner for now.",
      "score": 0,
      "created_utc": 1735310959.0,
      "replies": []
    },
    {
      "id": "m41oauz",
      "author": "MeatHamster",
      "body": "Did they try?",
      "score": 0,
      "created_utc": 1735314612.0,
      "replies": []
    },
    {
      "id": "m41qbtd",
      "author": "Chef_GonZo",
      "body": "I just got the $300 Quest 3S and I can’t put it down! VR has come a long way but $3500 is too much",
      "score": 0,
      "created_utc": 1735315290.0,
      "replies": []
    },
    {
      "id": "m41sng3",
      "author": "versionii",
      "body": "They need to allow porn.",
      "score": 0,
      "created_utc": 1735316062.0,
      "replies": []
    },
    {
      "id": "m41uvp8",
      "author": "BlazeOfGlory72",
      "body": "At the end of the day, convenience is king, and strapping a monitor to your face is never going to be more convenient then sitting on your couch or at your desk to play games and do other activities. VR is never going to take off in it’s current form.",
      "score": 0,
      "created_utc": 1735316792.0,
      "replies": []
    },
    {
      "id": "m41yw0j",
      "author": "pukem0n",
      "body": "Nobody wants a stupid headset on their head for anything for a prolonged time. It's not rocket science.",
      "score": 0,
      "created_utc": 1735318084.0,
      "replies": []
    },
    {
      "id": "m424334",
      "author": "shadowmage666",
      "body": "It’s a prosumer $3000+  device. It’s not meant for mainstream. What a dumb fucking article.",
      "score": 0,
      "created_utc": 1735319749.0,
      "replies": []
    },
    {
      "id": "m428fx1",
      "author": "QueanLaQueafa",
      "body": "Cant really be mainstream when the majority of the population has to chose between food/housing or an insanely expensive gift",
      "score": 0,
      "created_utc": 1735321141.0,
      "replies": []
    },
    {
      "id": "m42bcb6",
      "author": "Dry_Ad_9085",
      "body": "Meh VR is just a new shiny toy IMO.  It's nice and maybe fun, but it will die off like all other useless toys. Now AR, that is a technology that I see taking off and eventually going mainstream.  Being able to overlay on the existing environment around you?  So many useful applications for that tech.",
      "score": 0,
      "created_utc": 1735322058.0,
      "replies": [
        {
          "id": "m43a5xt",
          "author": "DarthBuzzard",
          "body": "This is a very out of touch statement. AR is much harder technology to solve, so the days when it will be broadly useful will be beyond when VR will be broadly useful.\n\nVR is used for education, communication, training, telepresence, design, fitness, health, and other areas *already*. AR has just about no uptake in these and will lag behind VR for at least another decade.\n\nAlso consoles are technically useless toys, but they didn't die off.",
          "score": 1,
          "created_utc": 1735333231.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42fo9d",
      "author": "f_o_t_a",
      "body": "Apple products are also seen as social capital that make you look cool. Nobody looks cool wearing VR goggle",
      "score": 0,
      "created_utc": 1735323419.0,
      "replies": []
    },
    {
      "id": "m42ipj1",
      "author": "tightloose",
      "body": "I don’t give a fuck about an overpriced vr headset. I want free healthcare and reasonably priced housing",
      "score": 0,
      "created_utc": 1735324378.0,
      "replies": []
    },
    {
      "id": "m42pzoy",
      "author": "chrisagiddings",
      "body": "Apple knew they wouldn’t. \n\nThey even called out that the Vision Pro was an early adopter device. \n\nBut Apple is high on the upside. \n\nAnd, not to be an apologist … I think Jobs would have been more demanding of the engineering before releasing it. But Steve did tell Tim not to base his decisions on what Steve would have done.",
      "score": 0,
      "created_utc": 1735326698.0,
      "replies": []
    },
    {
      "id": "m43fbx9",
      "author": "0110110111",
      "body": "They never tried to make it mainstream or sell millions of the thing. Right now VP is serving as a testbed for the platform and its technologies. They’re gleaning information on how it’s being used and ways to lower production costs. Future iterations will be cheaper and focused on different use cases; that’s when they’ll try to make it more mainstream.",
      "score": 0,
      "created_utc": 1735334919.0,
      "replies": []
    },
    {
      "id": "m43qoiy",
      "author": "LibraryBig3287",
      "body": "Maybe once Apple Intelligence is integrated into the VR set… We will all love being in the Metaverse so much that we will skidi riz Ohio something I don’t know.",
      "score": 0,
      "created_utc": 1735338696.0,
      "replies": []
    },
    {
      "id": "m43s791",
      "author": "russnem",
      "body": "LOL. What a stupid premise. What a ridiculous thing to believe, that they wanted to make VR headsets “mainstream”.",
      "score": 0,
      "created_utc": 1735339216.0,
      "replies": []
    },
    {
      "id": "m43yth2",
      "author": "misterjefe83",
      "body": "Everyone here complaining about price has no idea how apple operates.  “Who would buy a thin laptop with less features and double the price” -> MacBook Air eating everyone’s lunch later.  “Who would buy a gold plated watch that’ll be obsolete in a year” -> best selling wearable lol.  \n\n\nApple literally doesn’t give a shit if u can’t afford their product in a new segment, that’s the entire point and they constantly do it.  To make people feel exclusive and fund development down the road.  They just failed for this one, but just know it wasn’t bc of the price.",
      "score": 0,
      "created_utc": 1735341547.0,
      "replies": []
    },
    {
      "id": "m44lv6p",
      "author": "action_nick",
      "body": "VR will never be mainstream because it stops me from mindlessly pulling my phone out of my pocket to check on nothing.",
      "score": 0,
      "created_utc": 1735350050.0,
      "replies": []
    },
    {
      "id": "m44oj92",
      "author": "Aprice40",
      "body": "As real reality progressively gets worse, vr headsets will up tick. ;)",
      "score": 0,
      "created_utc": 1735351073.0,
      "replies": []
    },
    {
      "id": "m452hkc",
      "author": "immersive-matthew",
      "body": "Apple was not trying to make the Vision Pro mainstream though? What an odd article that is clearly written by someone not in the XR industry and not paying attention. \n\nLike why did it say this upfront:\n\n“Glasses may be more promising as the head-worn computers of the future — and there’s a chance Apple might be looking in that direction.”\n\nThere is a chance?  Apple has absolutely said the Vision Pro was a stepping stone to glasses and that today it is only a device for developers and enthusiasts.  Apple knew it was not mainstream as they too are very aware of all the issues with current XR tech holding it back from mass adoption.  Will we ever get there?  Of course it will as the tech will only get better and will solve all the issues holding it back for many.  The real question is not if, but rather when it will all work in a way that most will consider dropping their smartphones for AR glasses.  I suspect by the end of the decade we will start to see the adoption growing in a major way and by 2035-40 most will have AR glasses. Guess we will see.",
      "score": 0,
      "created_utc": 1735356662.0,
      "replies": []
    },
    {
      "id": "m45e2oc",
      "author": "Va1crist",
      "body": "a 3k worthless headset wasn’t going to make VR main stream ..",
      "score": 0,
      "created_utc": 1735361720.0,
      "replies": []
    },
    {
      "id": "m47fdj4",
      "author": "Own-Opinion-2494",
      "body": "Because they are stupid",
      "score": 0,
      "created_utc": 1735401200.0,
      "replies": []
    },
    {
      "id": "m4bnj81",
      "author": "jonnyozo",
      "body": "I’m mean they were charging enough for a family of three to eat for a month or more . That’s like 200 coconuts for you, math nerds.",
      "score": 0,
      "created_utc": 1735457263.0,
      "replies": []
    },
    {
      "id": "m4ci8e0",
      "author": "_RADIANTSUN_",
      "body": "The best shot anyone has is Meta and they will do it IMO. They are taking the slow and steady route and the Quest line is getting better and better as a general computing platform. Plus their Orion demo is IMO the way of the future. They have their eyes on target.",
      "score": 0,
      "created_utc": 1735476561.0,
      "replies": []
    },
    {
      "id": "m4db5bh",
      "author": "TWaldVR",
      "body": "Bla Bla! Since Meta, VR has gone mainstream! [9.6 million VR headsets projected for 2024](https://advanced-television.com/2024/12/19/report-9-6m-vr-headsets-shipped-in-2024/?fbclid=IwZXh0bgNhZW0CMTEAAR3tpnReFK7u0BUNmh3HFHm1HKT-a_g24wkOLj2nJ9DqH98_NoRxJjY1kLg_aem_n5y7O30MEvTw8ZYWIVsLPA) are a strong argument. Plus over 20 million Meta VR headsets sold, along with VR headsets from other manufacturers. The big issue remains motion sickness, which, in my opinion, will be resolved in the coming years.",
      "score": 0,
      "created_utc": 1735488297.0,
      "replies": []
    },
    {
      "id": "m4196sm",
      "author": "None",
      "body": "[removed]",
      "score": -5,
      "created_utc": 1735309173.0,
      "replies": [
        {
          "id": "m44bgqc",
          "author": "VVLynden",
          "body": "Hang on now.. you’re implying the meta quest is stealing info and spying on us? \n\nWhatever you say, grandpa.",
          "score": 0,
          "created_utc": 1735346170.0,
          "replies": [
            {
              "id": "m44cdoo",
              "author": "None",
              "body": "[removed]",
              "score": -2,
              "created_utc": 1735346503.0,
              "replies": [
                {
                  "id": "m44l8w4",
                  "author": "VVLynden",
                  "body": "That doesn’t mention the Quest at all, it’s talking about photos and videos uploaded to Facebook.",
                  "score": 1,
                  "created_utc": 1735349813.0,
                  "replies": [
                    {
                      "id": "m44m00t",
                      "author": "None",
                      "body": "[removed]",
                      "score": 0,
                      "created_utc": 1735350101.0,
                      "replies": [
                        {
                          "id": "m44sao1",
                          "author": "VVLynden",
                          "body": "I just don’t want to believe it!",
                          "score": 1,
                          "created_utc": 1735352561.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m453cjw",
      "author": "rdrTrapper",
      "body": "No one gives a shit about VR, AI, foldable phones, or any of the other slurm they’re trying to shove down our throats",
      "score": -3,
      "created_utc": 1735357015.0,
      "replies": []
    },
    {
      "id": "m41dpae",
      "author": "JP_32",
      "body": "The problem is the price, and there just isn't that many games/apps available, so VR is just not appealing. I bought the ps4 vr and the astro bot game was good, psychonauts was also a decent experience, but it was short, and there just wasn't that many games available and a lot of them are just super short \"experiences\". Plus the move controllers are awful and the games I tried didn't even support the move controller with the analog stick, so playing something like doom VFR was an awful experience, and the poor graphics wasn't immersive in the slightest. I tried the google cardboard vr with my phone, but google has abandoned it long time ago so it was only good for watching 3D videos, even finding those was difficult and AFAIK streaming sites like netflix dont have any 3D content available. \n\n  \nSure theres the META vr, BUT it requires facebook account linked to it. apple VR is super expensive. HTC's has some decent options, but the availability is ass or nonexistent if you live outside of America. Steam VR seems to be the best, but also requires a decent gaming PC, the tracking boxes and is very costly. Nintendos cardboard VR thing (remember that one?) was just one of nintendos quirky experiments that was forgotten after month.",
      "score": -1,
      "created_utc": 1735310919.0,
      "replies": [
        {
          "id": "m41n34o",
          "author": "Omephla",
          "body": "Meta doesn't require a Facebook account. It also happens to be a damn fine VR/MR experience for the price (Quest 3 anyway). Maybe jump back in and update your opinions on it?",
          "score": 3,
          "created_utc": 1735314204.0,
          "replies": [
            {
              "id": "m42nlxr",
              "author": "JP_32",
              "body": "Oh neat, I never gave it any though when it still required fb account, but now I might buy one",
              "score": 1,
              "created_utc": 1735325937.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m423bjr",
      "author": "None",
      "body": "Who said that was their plan? The first series was a test bed for tech enthusiasts and rich people. The real test is gen 2+",
      "score": -1,
      "created_utc": 1735319506.0,
      "replies": []
    },
    {
      "id": "m42suko",
      "author": "SenAtsu011",
      "body": "Apple never intended for Apple Vision Pro to see mainstream commercial success, they even said so. It was more of a devkit or enthusiast device than anything else, and that wasn’t a secret and everyone knew it.",
      "score": -1,
      "created_utc": 1735327607.0,
      "replies": []
    },
    {
      "id": "m42xq9o",
      "author": "textredditor",
      "body": "“Apple wasn’t able to do something it never set out to do.” \n\n- Better Title",
      "score": -1,
      "created_utc": 1735329181.0,
      "replies": []
    },
    {
      "id": "m43476h",
      "author": "poutinegalvaude",
      "body": "They weren’t trying to though- it was always supposed to be dev facing",
      "score": -1,
      "created_utc": 1735331284.0,
      "replies": []
    },
    {
      "id": "m436nql",
      "author": "crimxxx",
      "body": "They didn’t even attempt that they called it pro because the target wasn’t regular consumers. Probably they figure we’ll release this thing and figure out what to keep for the real one they want to release to regular consumers. The price point was in no way we are making a product we expect none enthusiast or bussinesses to buy.",
      "score": -1,
      "created_utc": 1735332091.0,
      "replies": []
    },
    {
      "id": "m45k541",
      "author": "adrenareddit",
      "body": "\"even Apple\"?\n\nDo they have a history of taking existing cutting edge technology and bringing it to the mainstream? \n\nThe iPhone can be considered mainstream in wealthy countries, even though it has less than 30% market share globally. However that was a new innovation, not an attempt to tackle an existing technology and provide a solution for the masses.\n\nI can't think of anything Apple has made that represents that concept.  The Mac computer (and subsequent MacBooks) could be construed as an attempt at this, but again we're talking about a sliver of the market share (15%). \n\nApple builds things for a niche consumer, and they usually do it pretty well. They have a standard for the level of quality they want to produce, and often times the design of those products is a higher priority than affordability.",
      "score": -1,
      "created_utc": 1735364647.0,
      "replies": []
    },
    {
      "id": "m48whm1",
      "author": "Snacks612",
      "body": "They weren’t trying to do that lol.",
      "score": -1,
      "created_utc": 1735418673.0,
      "replies": []
    },
    {
      "id": "m44opvn",
      "author": "werepenguins",
      "body": "VR headsets are a germ factory.  I mean, probably not, but there is no way I'll ever feel comfortable using one for an extended period of time.  Not worth buying for me at any price or quality.  I really hope this ends the VR push.  The only VR I'd be down for would be ones like in SAO, but thankfully that isn't a possibility.  And I mean, side criticism of SAO, who puts a device on their head that shoots microwaves at their brain?",
      "score": -5,
      "created_utc": 1735351146.0,
      "replies": []
    }
  ]
}