{
  "post": {
    "title": "Nintendo issues Switch 2 supply warning in Japan | 2.2 million people have applied to buy the new console in Japan so far, which ‘far exceeds’ Nintendo’s expectations.",
    "author": "chrisdh79",
    "id": "1k5xpvh",
    "score": 4257,
    "created_utc": 1745410723.0,
    "selftext": "",
    "num_comments": 379,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k5xpvh/nintendo_issues_switch_2_supply_warning_in_japan/"
  },
  "comments": [
    {
      "id": "molifai",
      "author": "UnsorryCanadian",
      "body": "But I thought they said they were \"ordering so many Switch 2 consoles to be made that there couldn't possibly be a shortage\"\n\n\nOr something",
      "score": 1271,
      "created_utc": 1745411263.0,
      "replies": [
        {
          "id": "moljwxo",
          "author": "SomeBoxofSpoons",
          "body": "To be fair, Japan has their own unique SKU. Production targets had to be split between how many to make just for Japan and how many to make for the rest of the world, and it sounds like that ratio might’ve ended up lighter on the “for Japan” side than it needed. At least for the My Nintendo Store orders.",
          "score": 479,
          "created_utc": 1745411836.0,
          "replies": [
            {
              "id": "momlpwm",
              "author": "Jazs1994",
              "body": "I like to think because the Japanese language models are cheaper than the rotw that people were happy to just buy it at face value",
              "score": 72,
              "created_utc": 1745423749.0,
              "replies": [
                {
                  "id": "mommcr6",
                  "author": "SomeBoxofSpoons",
                  "body": "Other people have said that it’s only really cheaper going by official exchange rates, and that going by the actual buying power of the Yen right now it’s about as big an expense for them as our prices are for us.",
                  "score": 39,
                  "created_utc": 1745423932.0,
                  "replies": [
                    {
                      "id": "mop1rj8",
                      "author": "submerging",
                      "body": "But what about the countless other countries that have less buying power than the US, yet still have US-adjusted console prices?",
                      "score": 24,
                      "created_utc": 1745449977.0,
                      "replies": [
                        {
                          "id": "mope5xm",
                          "author": "rpkarma",
                          "body": "“Sucks to suck” basically lol\n\nIt’s wild to see kids defending region locking. Y’all don’t know how bad the rest of us get fucked by it",
                          "score": 24,
                          "created_utc": 1745454188.0,
                          "replies": [
                            {
                              "id": "morfk7b",
                              "author": "error521",
                              "body": "To be fair it's more language locked. I believe game cards are still region free on that console and they are offering a more expensive region-free variant.",
                              "score": 4,
                              "created_utc": 1745488211.0,
                              "replies": [
                                {
                                  "id": "mornvsh",
                                  "author": "rpkarma",
                                  "body": "Eshop is locked too and that locks you out of games unfortunately (and credit/debit cards etc)",
                                  "score": 1,
                                  "created_utc": 1745492579.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mork379",
                          "author": "Wizard-of-pause",
                          "body": "Did you forget that Nintendo hates it's fans? If they could they would drown every single consumer. Not to gain anything but just out of pure hate.",
                          "score": -2,
                          "created_utc": 1745490714.0,
                          "replies": [
                            {
                              "id": "mos86ai",
                              "author": "Bowserbob1979",
                              "body": "Bro chill out, no corporation is your friend. Sony doesn't love you, Microsoft isn't your bro, and there is no other company out there that says they really care about you and it's more than lip service.",
                              "score": 3,
                              "created_utc": 1745500553.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "momon6a",
                      "author": "None",
                      "body": "Yeah. It’s still relatively more expensive in Japan than say a Switch 1. \n\nBut they’re making that Japanese exclusive model that is region locked to discourage people in the West, who hold stronger currencies from buying a Japanese model Switch that is artificially cheaper for them because of the strength of their currency relative to the Yen. \n\nOtherwise many in the West would just buy tons of JPN Switch 2s for like ~$330 and just change the language and region — essentially stealing a console that could have been sold to a Japanese consumer — or at the very least outbidding them.",
                      "score": 23,
                      "created_utc": 1745424607.0,
                      "replies": [
                        {
                          "id": "moqhhck",
                          "author": "SupMonica",
                          "body": "I somehow assumed that the Yen was more or less on Par with the US dollar. 1 Yen was like a 1 Cent coin.",
                          "score": 1,
                          "created_utc": 1745468852.0,
                          "replies": [
                            {
                              "id": "moqn22k",
                              "author": "ThataSmilez",
                              "body": "It's a bit weaker than that now; want to say it's more like 140 yen to a dollar nowadays.",
                              "score": 2,
                              "created_utc": 1745471354.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "moo1c5a",
                          "author": "MisterBosko",
                          "body": "\"Stealing\" wild take.",
                          "score": -8,
                          "created_utc": 1745438657.0,
                          "replies": [
                            {
                              "id": "mooa2bq",
                              "author": "None",
                              "body": "Stealing an opportunity. \n\nAnd that’s not far from the truth of it. If people in the US are importing tons of consoles that are artificially cheaper when buying the Japanese model, then that leaves lower stock available for Japanese consumers. And Japanese consumers can’t turn around and import stock from other Europe or somewhere because the Yen is weaker, so it would just be even more expensive than if purchased locally. \n\nThat’s a problem that could get out of control very quickly — making for a massive shortage of devices for the company’s home market. \n\nMarkets have to be supported if they’re going to succeed there and Nintendo can’t leave the Japanese market unprotected in this economic situation, given how important the Japanese market is to their overall success.",
                              "score": 6,
                              "created_utc": 1745441185.0,
                              "replies": [
                                {
                                  "id": "moqhkk8",
                                  "author": "Inner-Bread",
                                  "body": "So are they selling Japanese models at a loss or price gouging the rest of us though? It’s not like the production costs per unit change just the shipping/tariffs.",
                                  "score": 2,
                                  "created_utc": 1745468891.0,
                                  "replies": [
                                    {
                                      "id": "mos8dus",
                                      "author": "F1yMo1o",
                                      "body": "1.  All of the big players have considered selling the base consoles at a loss in order to lock in the market/player and make money in the lifetime of the unit (not stating that is necessarily so now and it changes the further they get from launch). \n\n2.  Cost structures are different in the various regions - marketing is different, logistics/distribution can be different. It isn’t 1x1 and I’m sure tariffs play a role now too. \n\n3.  If Nintendo releases geographic segment data in their financials, you can see the impact of whichever strategies they pick in their results.",
                                      "score": 2,
                                      "created_utc": 1745500623.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "moo2q5h",
                              "author": "AuroraFinem",
                              "body": "There’s a limited supply, it’s an absolutely valid concern and term used.\n\nProduct costs are adjusted based on buying power in that locality and the costs to produce and import to that location. It’s not really a big issue to use a VPN into a low cost country and purchase something digital for cheaper because there are no physical barriers.\n\nWhen it comes to physical product, you’re taking a limited supply item, which is reduced cost only because of the local buying power, out of circulation for that target population. They would then have to pay scalped prices because someone else took one they weren’t supposed to be allowed to purchase. Region locking is almost universally used in order to make this not appeal to people trying to snipe a cheaper one from a country with higher buying power in order to make sure supply remains available at the local price point that people there can actually afford.",
                              "score": 2,
                              "created_utc": 1745439065.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "moq1ryd",
                      "author": "roehnin",
                      "body": "Yes it’s more expensive than the previous one by quite a bit.  \n\nIn terms of buying power and average salaries, it’s probably a higher relative expense to income than the U.S. price to Americans. \n\nFor foreigners living in Japan wanting to buy the international model, it’s *very* expensive.",
                      "score": 2,
                      "created_utc": 1745462459.0,
                      "replies": []
                    },
                    {
                      "id": "monr0gy",
                      "author": "DragonDropTechnology",
                      "body": "Yeah, that was basically the point of Nintendo offering this Japan-only region locked Switch 2.",
                      "score": 1,
                      "created_utc": 1745435660.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "momgkd5",
              "author": "cosmos7",
              "body": "> To be fair, Japan has their own unique SKU. \n\nThere's no hardware difference though... it's just software region-locking bullshit.",
              "score": 18,
              "created_utc": 1745422260.0,
              "replies": [
                {
                  "id": "momljbf",
                  "author": "SomeBoxofSpoons",
                  "body": "Yes, but that means separate batches of consoles with different firmware installed in the factory. It’s not like they can change which version it is after they packaged it.",
                  "score": 83,
                  "created_utc": 1745423697.0,
                  "replies": [
                    {
                      "id": "momrwg9",
                      "author": "Cakeking7878",
                      "body": "It’s a sign this person hasn’t worked in manufacturing before. Everything from ordering the right number of boxes with the Japanese text to ordering different plugs, to different manuals, etc etc etc. Hell just doing a separate job to open up packages product, to wipe it then put the new firmware all takes time and then mistakes might happen in doing that and break your product. \n\nEspecially for large production runs with millions of consoles. You can’t just move things around this was all planed out months in advance and even with years of experience still run into issues. Hell I’m just spitting balling there’s probably so many more issues",
                      "score": 67,
                      "created_utc": 1745425566.0,
                      "replies": [
                        {
                          "id": "momv9ci",
                          "author": "SomeBoxofSpoons",
                          "body": "Exactly. Regardless of what a different SKU is, a different SKU is a different product. Full stop.",
                          "score": 21,
                          "created_utc": 1745426548.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "momrl6i",
                  "author": "fevildox",
                  "body": "Well no. Before a company ramps up to mass production of a consumer product (even if they're only ever going to make an international unlocked version), the operations people need to split quantity depending on the SKUs, i.e., US market gets 30%, APAC gets 40%, etc. This is based on forecasted demand, and is needed to figure out shipping from FATP and downstream supply chain.\n\nIf the demand suddenly goes beyond what was forecasted prior to product announcement and/or ramp to MP, there's of course going to be an imbalance. Hence, the warning.",
                  "score": 6,
                  "created_utc": 1745425474.0,
                  "replies": []
                },
                {
                  "id": "mommr6a",
                  "author": "windowtosh",
                  "body": "The idea is to make sure Japanese consumers have stock available to them without having to compete with international markets. There will still be region unlocked consoles, but more limited.",
                  "score": 9,
                  "created_utc": 1745424049.0,
                  "replies": []
                },
                {
                  "id": "momh7ec",
                  "author": "SegaTetris",
                  "body": "Yeah but the supposed hypocrisy being pointed out in the first place doesn't make sense is the point. There very well could be enough for the US, Canada, and Europe. Japan's situation is irrelevant to this community.",
                  "score": 8,
                  "created_utc": 1745422446.0,
                  "replies": [
                    {
                      "id": "moolzr7",
                      "author": "Jsr1",
                      "body": "But if they miscalculated for Japanese market, how much do you trust the other country estimates….",
                      "score": 2,
                      "created_utc": 1745444780.0,
                      "replies": [
                        {
                          "id": "moqm4q6",
                          "author": "stellvia2016",
                          "body": "Global logistics is hard and it's a video game console. We'll live.",
                          "score": 1,
                          "created_utc": 1745470912.0,
                          "replies": [
                            {
                              "id": "mor8ncn",
                              "author": "AnRealDinosaur",
                              "body": "I was about to say it's not like this is the only production run and this is your only chance, but then who knows what the situation will be in the US. We could get 5000% tariffs on \"things that are square\" tomorrow.",
                              "score": 1,
                              "created_utc": 1745483922.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "molqvwa",
          "author": "FisicoK",
          "body": "Nearly every single console launch in Japan has shortage, a typical launch week number there is in the 100-600k range (the latter is the historical record, it was PS2), not sure what's the worth of that 2.2M number but if these are real potential buyers W1 this is a ludicrous number  \n  \nThe question is whether the shortage will last a couple weeks or a couple months (it can come back later on like it did for NSW eventually after COVID)",
          "score": 38,
          "created_utc": 1745414340.0,
          "replies": [
            {
              "id": "mom3rew",
              "author": "AStringOfWords",
              "body": "This one was going to be different. Nintendo wanted to avoid being tarred with the “paper launch” accusations of the Nvidia 5000 series and PS5, so they made FOUR MILLION units for pre order.\n\nEven that wasn’t enough 😂",
              "score": 16,
              "created_utc": 1745418497.0,
              "replies": []
            }
          ]
        },
        {
          "id": "molk5ss",
          "author": "Cottontael",
          "body": "This is the cheap Japan only version since their economy is fucked right now. I'm not sure what the difference is besides software, but I imagine there's at least an added chip for region locking.",
          "score": 67,
          "created_utc": 1745411930.0,
          "replies": [
            {
              "id": "molnjii",
              "author": "masagrator",
              "body": "They already said that your language is locked to Japanese and your eshop account will be locked to Japan. No region locking games (which means you can still play cartridges from other countries), only region locking eshop and language.",
              "score": 69,
              "created_utc": 1745413162.0,
              "replies": [
                {
                  "id": "molobzs",
                  "author": "Cottontael",
                  "body": "Yeah, I understand that, I just figured they would do something to stop people from flashing the international is/firmware onto the cheaper Japan hardware. I don't know how feasible that is, I am not a genius.",
                  "score": 21,
                  "created_utc": 1745413447.0,
                  "replies": [
                    {
                      "id": "molzukj",
                      "author": "masagrator",
                      "body": "On Switch 1 you can do that only on hacked Switch (Chinese units have separate firmware), but after reflashing you won't be able to use any Nintendo Online functionality (Game updates, eshop, NSO) without getting swiftly banned. So while Switch 2 is not hacked there is nothing people can even try to do.",
                      "score": 15,
                      "created_utc": 1745417311.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mom1240",
                  "author": "Kalicolocts",
                  "body": "Do you know if games downloaded from the eshop will be playable only in japanese?",
                  "score": 4,
                  "created_utc": 1745417690.0,
                  "replies": [
                    {
                      "id": "mom1nwv",
                      "author": "masagrator",
                      "body": "Unless game has option in menu to change language, they will be locked to Japanese. Almost all Nintendo games on Switch 1 don't have such menu.",
                      "score": 13,
                      "created_utc": 1745417874.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mom5p5z",
                  "author": "stellvia2016",
                  "body": "It will mean you don't have access to some games, however, as AFAIK there are digital-only games that only appear on the eShop in some regions.",
                  "score": 2,
                  "created_utc": 1745419074.0,
                  "replies": [
                    {
                      "id": "mom7wx2",
                      "author": "masagrator",
                      "body": "That's correct, but there was nothing stopping you from changing eshop region to Japan and buying that game from f.e. USA. Only con was that you were losing money in wallet when changing region + you could use only Japanese debit cards and gift carts.",
                      "score": 2,
                      "created_utc": 1745419728.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "momf6be",
                  "author": "TomTomMan93",
                  "body": "I'm probably out of the loop here but why do they do this? If the games aren't region locked and the locks are mostly software based, why not just have more of the same product? If you want more in Japan, just allocate more to Japan. Itd take away from the global supply but still seems like a cheaper option.",
                  "score": 2,
                  "created_utc": 1745421857.0,
                  "replies": [
                    {
                      "id": "moqmqhr",
                      "author": "stellvia2016",
                      "body": "Because the yen devalued against the US dollar by like 35-40% over the last 3-4 years or so. So they decided to release the console into their home market at a significantly reduced price in USD to offset that disparity in purchasing power.\n\nHowever that means scalpers and drop-shippers would seek to buy up the Japanese stocks en-masse to resell in other markets at US MSRP and turn a tidy profit.\n\nHence Nintendo putting hard limits onto the Japanese SKU to combat that. (Although I'm sure someone will figure out how to bypass it eventually)",
                      "score": 4,
                      "created_utc": 1745471198.0,
                      "replies": []
                    },
                    {
                      "id": "momfzs1",
                      "author": "masagrator",
                      "body": "It shows they didn't expect such high Japan sales in preorders. I bet if they knew that it will sold so well in Japan, they wouldn't make special cheaper unit for Japan. Last data they had was that whole globe preordered 1.5 mln Switches. And now in Japan alone you have 2.2 mln preordered Switches 2 excluding third party stores.",
                      "score": 2,
                      "created_utc": 1745422094.0,
                      "replies": [
                        {
                          "id": "momzmvd",
                          "author": "sali_nyoro-n",
                          "body": "I mean, they might. The Japanese market is a higher priority for them than foreigners.",
                          "score": 1,
                          "created_utc": 1745427799.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mompo06",
                      "author": "Swastik496",
                      "body": "japan has cheaper models than the rest of the world. By $100+ even on switch 1",
                      "score": 0,
                      "created_utc": 1745424908.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "morj8y9",
                  "author": "staryoshi06",
                  "body": "Why though",
                  "score": 1,
                  "created_utc": 1745490264.0,
                  "replies": []
                },
                {
                  "id": "mp2zy8h",
                  "author": "Embarrassed-Weird173",
                  "body": "That's dumb. They should at least let you switch to American so that everyone could use it. ",
                  "score": 1,
                  "created_utc": 1745635259.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "molkmcu",
              "author": "Gnash_",
              "body": "probably no added chip but firmware changes and specific packaging which makes Nintendo allocating more Switch 2 to Japan not an instant thing.",
              "score": 11,
              "created_utc": 1745412101.0,
              "replies": []
            },
            {
              "id": "mom5hl1",
              "author": "stellvia2016",
              "body": "Remember that this may be \"cheap\" to you, but because of the 40% currency deflation that happened to them over the last couple years, it's basically about the same equivalent price in purchasing power to the global version.",
              "score": 15,
              "created_utc": 1745419011.0,
              "replies": [
                {
                  "id": "mom6ggg",
                  "author": "tastyratz",
                  "body": "Interesting point and a perspective I wasn't aware of as someone not following their economic intricacies.",
                  "score": 5,
                  "created_utc": 1745419298.0,
                  "replies": [
                    {
                      "id": "moo2v1h",
                      "author": "pay_student_loan",
                      "body": "I was just in Akihabara and saw shops selling used PS5s for 50000yen. That roughly converts to $350USD which isn’t terrible for Americans but that feels like $500 for Japanese people as for the longest time 100yen roughly equaled a $1. That’s awful for a used console 4+ years into its life.",
                      "score": 4,
                      "created_utc": 1745439105.0,
                      "replies": [
                        {
                          "id": "moqn3rm",
                          "author": "stellvia2016",
                          "body": "They're even more screwed in the PC hardware market: The 4090 sells/sold for over $4k USD... Prebuilt gaming systems you'd get for maybe $2k in the US were going for like $3500 there...",
                          "score": 2,
                          "created_utc": 1745471377.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mopx72a",
                      "author": "Worried_Pineapple823",
                      "body": "It’s something that can make or break the bottom line for international companies. I remember during the Wii era, that the yen to dollar changed so much, that both Nintendo and Sony stopped exchanging the currency on  sales in usd to yen. The exchange rate at least for the Wii had effectively dropped the cost by the equivalent of $100. (In that at launch $300 usd was say 30k yen, and when they made the decision, $300 usd was only 20k yen. Numbers estimated/made up for example purposes)",
                      "score": 1,
                      "created_utc": 1745460825.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mom5sb9",
                  "author": "Cottontael",
                  "body": "Yeah mate that's why I called it fucked. 👍",
                  "score": 6,
                  "created_utc": 1745419100.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "molyvtp",
              "author": "Mean-Evening-7209",
              "body": "I'm sure they just modified firmware/logic to implement a region lock. With all the SoCs they use nowadays you can do pretty much anything on it.",
              "score": 5,
              "created_utc": 1745417004.0,
              "replies": []
            },
            {
              "id": "moum13s",
              "author": "wrektcity",
              "body": "How is their economy fucked ?",
              "score": 1,
              "created_utc": 1745525560.0,
              "replies": [
                {
                  "id": "mounuw4",
                  "author": "Cottontael",
                  "body": "Their economy is finally catching up to US. They've been in deflation for like 2 generations, but strain from Covid and wage stagnation for them finally quickened inflation rates a year ago. They are starting to feel poor.",
                  "score": 1,
                  "created_utc": 1745526096.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "monp9s1",
          "author": "KazzieMono",
          "body": "I don’t think that was ever the case. They came out saying they produced like a million consoles for launch and I’m just like. Oh. So it’s going to be out of stock everywhere.",
          "score": 3,
          "created_utc": 1745435147.0,
          "replies": [
            {
              "id": "mor9em0",
              "author": "AnRealDinosaur",
              "body": "3rd party US sellers opened their pre-orders at midnight last night and they're already sold out from what I can tell. Nintendo themselves is doing their lottery/invite thing in May. \nI wouldn't worry though. This is still all pre-order and they might be hard to get at first but it's not like they're only producing a set amount or something. I remember being super frustrated on the waitlist for a steam deck but once production got going it all worked out.",
              "score": 1,
              "created_utc": 1745484405.0,
              "replies": []
            }
          ]
        },
        {
          "id": "moqlhjv",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1745470616.0,
          "replies": [
            {
              "id": "mot0fq5",
              "author": "Madblaster6",
              "body": "Tell me you have 0 clue how logistics for large companies and demand works without telling me.",
              "score": 2,
              "created_utc": 1745509070.0,
              "replies": [
                {
                  "id": "motyyym",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 0,
                  "created_utc": 1745518773.0,
                  "replies": [
                    {
                      "id": "mou719c",
                      "author": "Madblaster6",
                      "body": "Tell me you're a sheeple that yells the same things everyone else does even though it's drama over a toy without telling me.",
                      "score": 1,
                      "created_utc": 1745521115.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "molkuty",
      "author": "Gnash_",
      "body": "Title is slightly underselling the Switch 2’s preorder situation: 2.2 million people have ordered the Switch 2 in Japan… through the My Nintendo Store. So the actual number is probably even higher",
      "score": 300,
      "created_utc": 1745412188.0,
      "replies": [
        {
          "id": "mom63qi",
          "author": "RoyalCities",
          "body": "Was it the only place you could pre order for the Japanese model? It could be matter of people placing it there \"just in case\" \n\nI know a bunch of people try to preorder at different stores just because there's a chance their preorder is cancelled - then they can it at the extra stores once they know they're safe and it's coming.",
          "score": 49,
          "created_utc": 1745419194.0,
          "replies": [
            {
              "id": "mom91hb",
              "author": "Gnash_",
              "body": "Preorders haven’t opened in other Japanese stores from what I understand, so it’s hard to gauge what the actual number of preorders will be, plus Nintendo said “a significant number” of people who participated in the raffle will not have a Switch 2. So yeah I don’t know hard to say anything conclusive atp.\n\nIt will be interesting to see how popular the Switch 2 will be at launch though, Nintendo seems to have set incredibly high expectations for themselves this launch window.",
              "score": 11,
              "created_utc": 1745420057.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mopbnzk",
          "author": "noor2436",
          "body": "Actual demand must be insane. Nintendo's about to print money with this launch. Scalpers are gonna have a field day if they can't meet demand.",
          "score": 3,
          "created_utc": 1745453324.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moljr77",
      "author": "meunbear",
      "body": "They always do this with launches. They don’t even realize they are Nintendo.",
      "score": 366,
      "created_utc": 1745411777.0,
      "replies": [
        {
          "id": "molmzvj",
          "author": "EtalusEnthusiast420",
          "body": "If they do it every launch, it’s their marketing strategy. Clearly it works too.",
          "score": 173,
          "created_utc": 1745412966.0,
          "replies": [
            {
              "id": "molvaav",
              "author": "HKei",
              "body": "I mean you don't _want_ undersupply as a company, it's not good for customer relations and you're leaving money on the table (you'd rather have money now than later most of the time).\n\nBut you REALLY don't want oversupply. Your product staying unbought on shelves forever is a bad look PR wise and you're printing negative money.",
              "score": 67,
              "created_utc": 1745415837.0,
              "replies": [
                {
                  "id": "molzdy9",
                  "author": "davidm2d3",
                  "body": "Over supply was one of the factors of the US videogame crash in the 80's",
                  "score": 28,
                  "created_utc": 1745417165.0,
                  "replies": [
                    {
                      "id": "momg86l",
                      "author": "billythygoat",
                      "body": "It's nearly impossible to have an oversupply of a video game console now. If nintendo made 20 million Switch 2's, they would all be sold. The thing is making enough now so they don't have a ton of excess right before launch because 20 million consoles is a lot to have on hand. Also ordering takes time, if there are any major issues with the console they sometimes do a lightly updated version on the next batch too.",
                      "score": 8,
                      "created_utc": 1745422163.0,
                      "replies": [
                        {
                          "id": "momws6o",
                          "author": "Slight_Ad5318",
                          "body": "Well there was the Wii U. A Fun console I really enjoyed, but it sold like shit. \n\n\nNot that I don't think the new switch is going to be a massive success.",
                          "score": 9,
                          "created_utc": 1745426985.0,
                          "replies": [
                            {
                              "id": "mon5601",
                              "author": "JustHereSoImNotFined",
                              "body": "to be the fair, the marketing around the Wii U was abysmal",
                              "score": 4,
                              "created_utc": 1745429360.0,
                              "replies": [
                                {
                                  "id": "moowrkk",
                                  "author": "Slight_Ad5318",
                                  "body": "Oh yeah they really fucked the launch on that up. \n\n\nMy point isn't that I think the switch2 is going to flop, it's just that they do stumble sometimes and they seem to like playing it safe.",
                                  "score": 3,
                                  "created_utc": 1745448323.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "moqnxby",
                          "author": "stellvia2016",
                          "body": "Storing the excess in warehouses costs money, it also multiplies any miscalculations in supply for specific markets.\n\nAnd another consideration: If Nintendo can even reserve any more production capacity from Samsung for the chips. They may not be on the very latest process, but they're still on one of the leading edge ones, so I'm sure demand is still high for their fabs.",
                          "score": 3,
                          "created_utc": 1745471776.0,
                          "replies": [
                            {
                              "id": "morqt5w",
                              "author": "billythygoat",
                              "body": "Yep, I aggree",
                              "score": 1,
                              "created_utc": 1745493919.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "momsigd",
                  "author": "chief_yETI",
                  "body": ">I mean you don't _want_ undersupply as a company, it's not good for customer relations and you're leaving money on the table (you'd rather have money now than later most of the time).\n\nI dunno, seems to be working for console that has had supply shortages at launch so far (Wii, PS4, OG Switch, PS5)\n\nGamers have too much ADHD and low Vitamin D levels that companies can get away with a lot when selling things to them (but not *everything* as demonstrated by Microsoft)",
                  "score": 4,
                  "created_utc": 1745425746.0,
                  "replies": [
                    {
                      "id": "moqdk1k",
                      "author": "pmjm",
                      "body": "For things like GPUs, undersupply can work in their favor.\n\nBut consoles are essentially a loss-leader. The manufacturers might make a modest profit margin, but the real money is in selling games, which they can't do if people don't have consoles.\n\nUndersupply ensures they don't take an L on a potential flopped launch, but it also puts a ceiling on earnings.",
                      "score": 2,
                      "created_utc": 1745467169.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mook918",
                  "author": "cat_prophecy",
                  "body": "The sale will be made regardless of supply. Whether the person buys from them immediately, buys from a scalper, or waits and buys it once supply stabilizes is irrelevant. Nintendo is just gambling that people won't be turned away even if they have to wait or overpay for a console and largely they are right.",
                  "score": 3,
                  "created_utc": 1745444232.0,
                  "replies": []
                },
                {
                  "id": "mom5se6",
                  "author": "Competitive-Call6810",
                  "body": "The marketing gimmick of this console seems to be online play with friends. I already have friends who can’t afford it, gonna suck if I also have friends who just can’t get ahold of it.",
                  "score": 3,
                  "created_utc": 1745419101.0,
                  "replies": [
                    {
                      "id": "momgh58",
                      "author": "FriendShapedRMT",
                      "body": "What’s the gimmick? Isn’t online play with friends already a feature of Nintendo Switch Online?",
                      "score": 3,
                      "created_utc": 1745422234.0,
                      "replies": [
                        {
                          "id": "moq1t35",
                          "author": "Chubby_Bub",
                          "body": "They have a goofy thing called \"GameChat\" that’s basically a built-in Discord call where you can talk (the device has a microphone), stream your gameplay at about 5 FPS, and have a facecam if you shell out $55 more dollars for it. That’s what the secret new button is for. It's a neat idea I guess, but I'm not sure why they're pushing it so hard as *the* new feature.",
                          "score": 3,
                          "created_utc": 1745462470.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mon8bu9",
                      "author": "addamee",
                      "body": "On the bright side, your supply of friends sounds like it’s doing okay",
                      "score": 2,
                      "created_utc": 1745430254.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mopmwoq",
                  "author": "teeny_tina",
                  "body": "when it comes to japanese products *occasionally* you get a genuine issue of undersupply, but for the most part it's artificial scarcity. You cap the first round of orders to (1) see what the demand is like and (2) increase the people's FOMO/impression of the product, then open subsequent orders with stronger metrics. Not sure if they do this is as much in the US but it's a common sales strategy in south korea and japan",
                  "score": 1,
                  "created_utc": 1745457220.0,
                  "replies": []
                },
                {
                  "id": "monuji0",
                  "author": "None",
                  "body": "Undersupply has been the rules of the game from Nintendo for a long while, which is how they \"justify\" prices never going down, it was a particularly nasty artificial scarcity around the amiibos.",
                  "score": 0,
                  "created_utc": 1745436694.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mop67v4",
              "author": "Enchelion",
              "body": "Building enough supply to completely cover launch demand would likely mean delaying to console (and related software) by years. Or so massively over-committing to manufacturing lines that you have to over-pay and lose tons of money. In both cases you risk massive overstock that screws your finances.",
              "score": 2,
              "created_utc": 1745451469.0,
              "replies": []
            },
            {
              "id": "molrkea",
              "author": "JorgenAge",
              "body": "Yet, they deny decades of artificial scarcity tactics. \nI remember getting a GameCube and not being able buy memory cards at least a month later.",
              "score": 0,
              "created_utc": 1745414575.0,
              "replies": [
                {
                  "id": "moluvh7",
                  "author": "AStringOfWords",
                  "body": "2 million units on preorder is not artificial scarcity, that’s incredible demand.",
                  "score": 24,
                  "created_utc": 1745415701.0,
                  "replies": [
                    {
                      "id": "molvr8t",
                      "author": "OccamPhaser",
                      "body": "Far from uninticipated. This is the longest Nintendo have ever gone without a console release. Can't brag that you won't have shortages when you aren't even gonna try to meet the goal you should be able to at least somewhat calculate",
                      "score": 7,
                      "created_utc": 1745415990.0,
                      "replies": [
                        {
                          "id": "momgwk6",
                          "author": "billythygoat",
                          "body": "150 million switches (all three kinds) have been sold since launch.",
                          "score": 2,
                          "created_utc": 1745422358.0,
                          "replies": []
                        },
                        {
                          "id": "mom6svj",
                          "author": "AStringOfWords",
                          "body": "They calculated the demand before people saw the Mario Kart World trailer and lost their collective shit.\n\nSorry not sorry for making the most popular game in the world.",
                          "score": 4,
                          "created_utc": 1745419399.0,
                          "replies": []
                        },
                        {
                          "id": "moqou7m",
                          "author": "stellvia2016",
                          "body": "The PS4 had a bit over one million pre-orders and sold 2M units worldwide going into Xmas. They also delayed the Japan release 3 months to boost supplies to the US and EU markets.\n\n2M people expressed interest in pre-ordering, that doesn't guarantee they would follow through with the purchase. Especially if you consider some of them may be kids using the eshop and clicking it and hoping to beg their parents, etc.\n\nGlobal supply chains and worldwide releases for products with millions of units up front is insanely challenging to get right. Read up on the crazy lengths Apple has to go to for the new iphone release every year.",
                          "score": 0,
                          "created_utc": 1745472227.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "molvzem",
                      "author": "OccamPhaser",
                      "body": "Never mind please ignore me. I just saw you like Nintendo an want them to make money. Didn't realize i was talking to a boot licker. It's so sad that people are running defense and shilling for a corp",
                      "score": -13,
                      "created_utc": 1745416065.0,
                      "replies": [
                        {
                          "id": "mom6brh",
                          "author": "AStringOfWords",
                          "body": "lol what? The company that makes the games I’ve loved playing since I was a kid?\n\nI’m a boot licker for wanting them to succeed, to carry on making games in the future?\n\nWhat?",
                          "score": 4,
                          "created_utc": 1745419260.0,
                          "replies": [
                            {
                              "id": "moohuek",
                              "author": "aguadiablo",
                              "body": "That commenter is been called boot licker so many times but doesn't know what it means",
                              "score": 3,
                              "created_utc": 1745443491.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "moqdxhi",
                  "author": "pmjm",
                  "body": "Nintendo didn't become an 88 billion dollar company by selling consoles, they did it by selling games.\n\nScarcity runs counter to that goal.",
                  "score": 2,
                  "created_utc": 1745467330.0,
                  "replies": [
                    {
                      "id": "moqxvkc",
                      "author": "JorgenAge",
                      "body": "Ok. I’ll take off my tin foil take. They have been terrible at planning the logistics of their consoles for decades as they run into major shortages. Every. Time.",
                      "score": 2,
                      "created_utc": 1745477185.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mopvz77",
                  "author": "Chrisnness",
                  "body": "Nintendo wants to sell as many as they can make",
                  "score": 1,
                  "created_utc": 1745460397.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mopvzri",
              "author": "Chrisnness",
              "body": "Nintendo wants to sell as many as they can make",
              "score": 1,
              "created_utc": 1745460402.0,
              "replies": []
            }
          ]
        },
        {
          "id": "molofgp",
          "author": "Just_This_Dude",
          "body": "Idk, $80 Mario kart says they do know they’re Nintendo.",
          "score": 24,
          "created_utc": 1745413482.0,
          "replies": []
        },
        {
          "id": "mom3uac",
          "author": "AStringOfWords",
          "body": "3DS didn’t sell out on launch.",
          "score": 3,
          "created_utc": 1745418520.0,
          "replies": [
            {
              "id": "monopv3",
              "author": "m0rogfar",
              "body": "To be fair, that launch was uniquely bad. Launching with an updated port of Nintendogs as the big launch title, and then only having two N64 ports in the pipeline until nine months after launch was a bizarre content strategy.",
              "score": 6,
              "created_utc": 1745434983.0,
              "replies": [
                {
                  "id": "morg4gv",
                  "author": "error521",
                  "body": "Who needs Mario or Zelda when you have Steeldiver?",
                  "score": 1,
                  "created_utc": 1745488534.0,
                  "replies": []
                },
                {
                  "id": "mosgcr9",
                  "author": "AStringOfWords",
                  "body": "So they don’t “always do this” with launches then.",
                  "score": 1,
                  "created_utc": 1745503203.0,
                  "replies": []
                },
                {
                  "id": "moslomz",
                  "author": "DinosaurAlive",
                  "body": "I worked retail and I can say that people didn’t like Nintendo as much back then.  So many people thought 3D was a gimmick, or claimed it gave them headaches.  Nintendo was also seen as the console for children.  It really wasn’t until the Switch that a lot of my peers finally got a Nintendo since the Wii, or previous, without ever getting any DS/3DS variant.",
                  "score": 1,
                  "created_utc": 1745504798.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "molotzj",
          "author": "zeelbeno",
          "body": "\"But we made the switch 2 really expensive... why is everyone still buying it like Reddit doesn't matter\"",
          "score": 19,
          "created_utc": 1745413624.0,
          "replies": [
            {
              "id": "mon7am0",
              "author": "h2o_hero",
              "body": "You do know that it's $340 in Japan, right? Also Reddit definitely seems more pro Switch 2 then anti S2 as the upvotes in every thread seem to indicate",
              "score": 0,
              "created_utc": 1745429964.0,
              "replies": [
                {
                  "id": "moqpbuf",
                  "author": "stellvia2016",
                  "body": "Their currency against the dollar went from like 110:1 to 160:1 in a couple years. If you divide the 50,000 yen MSRP by 110 you get -- $454 USD hmm... that price sounds familiar...",
                  "score": 2,
                  "created_utc": 1745472474.0,
                  "replies": []
                },
                {
                  "id": "mon7zh6",
                  "author": "zeelbeno",
                  "body": "Weird that Japan are buying it using US dollars\n\nI see you haven't been on r/gaming or r/memes",
                  "score": 1,
                  "created_utc": 1745430158.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "molqnip",
          "author": "Kep0a",
          "body": "Could be some culture from Wii U. I think it was entirely the opposite. Overstock seems like a much bigger issue than understock.",
          "score": 3,
          "created_utc": 1745414260.0,
          "replies": [
            {
              "id": "mon0c91",
              "author": "sali_nyoro-n",
              "body": "They were even understocking the 3DS. They **always** aim to make _exactly_ as many of the console as they 100% knew they'd sell, because they're a toy company and toy companies always make less of a product than they know they can sell for psychological reasons so people know it's in high demand.",
              "score": -1,
              "created_utc": 1745428000.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mompxq4",
          "author": "cyanraichu",
          "body": "I always just assume it's intentional \n\nI plan on getting one later this year and am ok with waiting a bit. I want to get one for myself as a graduation present in August but if I have to wait a while longer that's fine.",
          "score": 1,
          "created_utc": 1745424985.0,
          "replies": []
        },
        {
          "id": "mon48dp",
          "author": "BeetsBy_Schrute",
          "body": "It’s the third best selling game console of all time at ~150M units, behind PS2 and Nintendo DS. Remove handhelds (DS) it’s the second best of all time and the best Nintendo console seller. \n\nAnd yet Nintendo themselves still are standing there with a shocked pikachu face.",
          "score": 1,
          "created_utc": 1745429099.0,
          "replies": [
            {
              "id": "morahk9",
              "author": "AnRealDinosaur",
              "body": "Reminder too that PS2 only sold so well because it played DVDs and was cheaper than a DVD player at the time. I'm not saying it was a bad system, it was absolutely phenomenal but the sales got a major boost from that functionality.",
              "score": 1,
              "created_utc": 1745485082.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mon4slq",
          "author": "None",
          "body": "Yeah, like, what are their \"expectations\"? They're constantly making the best selling consoles of all time, they can't really be that clueless.",
          "score": 1,
          "created_utc": 1745429256.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moltebj",
      "author": "SheepWolves",
      "body": "This is why they don't give a crap about people complaining about pricing. It's still gonna sell out everywhere.",
      "score": 155,
      "created_utc": 1745415205.0,
      "replies": [
        {
          "id": "molz402",
          "author": "Pingy_Junk",
          "body": "I remember someone telling me this was a grand mistake on nintendos part and that I should wait until right after launch because it’ll get massively discounted from not selling. Not defending the pricing model but I’m really confused by all the people convinced it’s going to be a terrible selling mistake.",
          "score": 44,
          "created_utc": 1745417078.0,
          "replies": [
            {
              "id": "mom4th0",
              "author": "BMO888",
              "body": "If you’re old enough this happens every release cycle. “Nintendo is doomed, and will go the way of Sega” headline has been said every console release since GameCube. \n\nFor some reason Nintendo (and companies like Apple) really get under the skin of “gamers” because it doesn’t fit their definition of their hobby.",
              "score": 41,
              "created_utc": 1745418811.0,
              "replies": [
                {
                  "id": "momrzfs",
                  "author": "Arctiiq",
                  "body": "Part of it is just console wars too. They see Nintendo as a threat to their box for some reason.",
                  "score": 5,
                  "created_utc": 1745425590.0,
                  "replies": [
                    {
                      "id": "mop2na2",
                      "author": "Pingy_Junk",
                      "body": "I’ll never get console wars. Just get the ones that you like the feel of and have games you wanna play. It’s really that simple. They’re all corporations who couldn’t give a rats ass about anything but money.",
                      "score": 3,
                      "created_utc": 1745450269.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "momau5o",
                  "author": "None",
                  "body": "To be totally fair, it was only a decade ago that Nintendo was in *real* dire straits.\n\nI don’t think it’s likely, but way too many people assume it’s impossible, which simply isn’t true",
                  "score": 10,
                  "created_utc": 1745420587.0,
                  "replies": [
                    {
                      "id": "momcr8v",
                      "author": "UnidentifiedRoot",
                      "body": "Not really tbh, they broke even on the Wii U generation, thanks to the 3ds, which isn't preferable of course but given the war chest of cash they had thanks to the Wii I'm not sure I'd call it dire. Like it wasn't as bad for them as the PS3 gen was for Sony where they actually made a pretty rough loss. Obviously it's not impossible, especially now where they don't have a second device acting as a safety net, but people overestimate just how bad the Wii U gen was for them.",
                      "score": 7,
                      "created_utc": 1745421152.0,
                      "replies": [
                        {
                          "id": "momdhw3",
                          "author": "None",
                          "body": "Look nobody is saying that Nintendo was gonna totally die out but similar to where Microsoft seems to be heading atm, it’s not an impossibility that they would have had to pull out of the console market. Yeah the 3DS was still doing well, absolutely but if the Switch had underperformed or even flopped like the Wii U did (and the Wii U *did* do bad) Then Nintendo as we know it today absolutely would not be around",
                          "score": 2,
                          "created_utc": 1745421368.0,
                          "replies": [
                            {
                              "id": "mome7v9",
                              "author": "UnidentifiedRoot",
                              "body": "Yeah for sure, if the followup up to the Wii U had flopped as bad as the Wii U they 100% would have then been in a pretty dire situation.",
                              "score": 0,
                              "created_utc": 1745421578.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "momk9t4",
                      "author": "CrashNebulaOn_Ice",
                      "body": "They really were. Luckily they were able to price drop and 3DS their way through the wiiu dark era, back to being anti-consumer. Excited to see the scales adjust again.",
                      "score": 1,
                      "created_utc": 1745423331.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mop7v1o",
                  "author": "Enchelion",
                  "body": "It's the entitlement a lot of people seem to feel. If something is too expensive or not easily available they for some reason take it as a personal slight instead of just saying \"this is too much so I just won't buy it\" and moving on. The endless complaints that Nintendo doesn't run huge sales (because they don't have to and their games continue selling well) exemplify this.",
                  "score": 3,
                  "created_utc": 1745452020.0,
                  "replies": []
                },
                {
                  "id": "mom653o",
                  "author": "Pingy_Junk",
                  "body": "I’ve been a “gamer” since I was fairly young and honestly I love a lot of Nintendo’s products (even if I disagree with some of their policy and pricing) I dont understand the hatred of more casual gamers.",
                  "score": 5,
                  "created_utc": 1745419205.0,
                  "replies": [
                    {
                      "id": "momlsg1",
                      "author": "OldeArrogantBastard",
                      "body": "Yup. It’s been this way since the PlayStation 2 days when the GameCube came out. People shit on Nintendo for making a weaker console spec wise but Nintendo just kept humming along. Then people laughed at the Wii announcement, and we all know how well that turned out for Nintendo.",
                      "score": 4,
                      "created_utc": 1745423769.0,
                      "replies": [
                        {
                          "id": "moo0e4p",
                          "author": "mangetouttoutmange",
                          "body": "Funny thing is the GameCube was more capable than the ps2 ",
                          "score": 2,
                          "created_utc": 1745438383.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mon66nc",
                  "author": "None",
                  "body": "Not being \"for gamers\" has been Apple's culture for 30 years.  Obviously Nintendo is for gamers 😂",
                  "score": 1,
                  "created_utc": 1745429649.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mon5vcj",
              "author": "None",
              "body": "I'm not really a Nintendo fan, have no desire to own the switch 2, the last Nintendo console I owned was a GameCube.  But you'd have to be an idiot to think they're not going to sell like crazy.  It could be $1000 with $150 games and they could punch you in the face every time you turn it on and people would still be out there waving cash like the shut up and take my money meme.",
              "score": 2,
              "created_utc": 1745429559.0,
              "replies": []
            }
          ]
        },
        {
          "id": "momv404",
          "author": "KorolEz",
          "body": "It costs $100 less, and the games are probably cheaper as well. Most people who complained are most likely non-Japanese",
          "score": 4,
          "created_utc": 1745426506.0,
          "replies": []
        },
        {
          "id": "molxww5",
          "author": "TheNinjaDC",
          "body": "Japan has a significantly cheaper price for the system and game than the rest of the world. The Switch 2 cost like $330. And the games are around $60.",
          "score": 14,
          "created_utc": 1745416691.0,
          "replies": [
            {
              "id": "molyudt",
              "author": "Corderoy",
              "body": "The yen is weak in Japan so that doesn't convert into being cheap",
              "score": 20,
              "created_utc": 1745416990.0,
              "replies": [
                {
                  "id": "mom2lmu",
                  "author": "cm757200",
                  "body": "Using today's average prices, and the base prices for their respective country, here's the cost in:\n\n\nUnleaded petrol: USA - 486 litres, Japan - 294 litres\n\nMilk:  USA - 486 litres, Japan - 250 litres. \n\nPornhub premium subscription: USA - 45 months, Japan 33 - months",
                  "score": 6,
                  "created_utc": 1745418155.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "molytmf",
          "author": "imetators",
          "body": "Gamers have complained about God knows how much things over the years and barely if any complaints were heard and acted upon. Even if we all can agree on loot boxes being toxic to gamers, we still have loot boxes in games years after first complaints.\n\nIn other words, paint me surprused that there is only 2m pre-orders in Japan.",
          "score": 2,
          "created_utc": 1745416984.0,
          "replies": []
        },
        {
          "id": "molvs0t",
          "author": "AStringOfWords",
          "body": "For every person complaining about pricing there are 10 people screaming shut up and take my money.\n\nAnd you just know that 9 out of 10 of the people whining about the price are sitting on at least one preorder already. \n\nReddit these days is just a joke, people say shit just to say shit. They don’t even mean it most of the time, it’s just a karma farming contest where you try and guess what the groupthink is and capitalise on it.",
          "score": 3,
          "created_utc": 1745415998.0,
          "replies": []
        },
        {
          "id": "mombbl7",
          "author": "ChocoJesus",
          "body": "I’m not happy about the console price increase but it at least sounds reasonable \n\nThe game price increase was what I thought everyone was really angry about. But considering the amount of Nintendo fans, even if Reddit protests generally impacted stuff, I don’t think it would matter here",
          "score": 1,
          "created_utc": 1745420732.0,
          "replies": []
        },
        {
          "id": "morap1r",
          "author": "AnRealDinosaur",
          "body": "I'll be more interested in seeing sales numbers for $80 games. People are used to shelling out for a new console, it's a one time expense. Repeatedly paying that much for games is a different story.",
          "score": 1,
          "created_utc": 1745485216.0,
          "replies": []
        },
        {
          "id": "mom716v",
          "author": "Bakanyanter",
          "body": "If so many people are buying it, then pricing clearly isn't an issue. People are willing to pay for quality.",
          "score": -2,
          "created_utc": 1745419467.0,
          "replies": []
        },
        {
          "id": "mopw8f1",
          "author": "Chrisnness",
          "body": "It does matter long and medium-term",
          "score": 0,
          "created_utc": 1745460486.0,
          "replies": []
        },
        {
          "id": "moquyw7",
          "author": "Hakaisha89",
          "body": "Do remember that its 330 dollars in japan",
          "score": 0,
          "created_utc": 1745475499.0,
          "replies": []
        }
      ]
    },
    {
      "id": "momgnqq",
      "author": "SwampOfDownvotes",
      "body": "*Nintendo, smirking when asked about scalpers*: \"We will just make enough Switch 2s that there will be no issue with scalpers!\"\n\n*Pre-orders go live*: \"wait, we can't make that many!\"",
      "score": 8,
      "created_utc": 1745422287.0,
      "replies": []
    },
    {
      "id": "mollcij",
      "author": "Noto987",
      "body": "The only guarantees in life is death, taxs and nintendo shortages",
      "score": 24,
      "created_utc": 1745412370.0,
      "replies": [
        {
          "id": "moqufn2",
          "author": "Protomau5",
          "body": "Cause Xbox and PlayStation didn’t have shortages this gen /s",
          "score": 0,
          "created_utc": 1745475200.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moniwfn",
      "author": "Z34N0",
      "body": "Is the hype justified?\n\nIt’s a buffed up Switch. Nothing super new really.\n\nI don’t mind waiting. I love Nintendo but this isn’t revolutionary from what I’ve seen.",
      "score": 16,
      "created_utc": 1745433290.0,
      "replies": [
        {
          "id": "moq5h89",
          "author": "x2what",
          "body": "From what I've seen online of the remastered Zelda: Breath of the Wild and Zelda: Tears of the Kingdom games running at a much higher frame rate (at least 60 fps, though I think it might be 120fps) with no slowdowns, much faster load times, and higher resolutions, the games look amazing.\n\nAlso, the videos of the new Mario Kart World game look significantly better than Mario Kart 8.\n\nOf course the fact that it's a handheld system is going to prevent the graphics from being equal to a PS5 for example, I've read that the graphics are on par with a PS4, which is pretty darn good for a thin handheld system.\n\nIf you haven't already, I would check out the videos of those games, and others for the Switch 2 to help you decide if it's worth it for you.",
          "score": 5,
          "created_utc": 1745463873.0,
          "replies": [
            {
              "id": "moqupes",
              "author": "Protomau5",
              "body": "Already put hundreds of hours in both Zelda’s.  Not really a selling point.  Glad they look amazing tho, BOTW was out of this world when it released 8 years ago lol.",
              "score": 5,
              "created_utc": 1745475352.0,
              "replies": []
            },
            {
              "id": "moqwyfu",
              "author": "Z34N0",
              "body": "I’m definitely going to get a Switch 2 eventually.. but I haven’t seen anything that makes me want to rush.\n\nIf they were releasing a NEW (exclusive to Switch 2) Zelda title, I would grab a big wad of cash and demand Nintendo to take it and give me the new Switch right now. The upgraded versions of BotW and TotK look great, but I’ve already spent a combined total of 500+ hours on those games in recent years. They truly are amazing games and I’m sure they will be fantastic to revisit after I have more time away from them, but for me, it hasn’t been long enough to feel like it’s worth starting over.\n\nI mostly play single-player adventure stuff and always in handheld mode so a new Mario Kart isn’t really enticing.\n\nBy the way, I’m not trying to bash the new Switch. Just surprised by the hype. Cool upgrades but it’s not mind-blowing and it doesn’t inspire me to get a pre-order or anything.",
              "score": 2,
              "created_utc": 1745476650.0,
              "replies": []
            },
            {
              "id": "mosl9yo",
              "author": "Tackit286",
              "body": "So yeah it’s literally just a buffed up Switch",
              "score": 1,
              "created_utc": 1745504679.0,
              "replies": [
                {
                  "id": "mosnntr",
                  "author": "x2what",
                  "body": "Yeah, though the same can be said of nearly every console and its predecessor. The whole point is every new system is more powerful than the one that came before.\n\nI took the question to be if the upgrade was noticeably different and worth the upgrade.\n\nAs I said, everyone will have their own opinion on whether it's worth upgrading.",
                  "score": 1,
                  "created_utc": 1745505384.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "motn1k7",
          "author": "None",
          "body": "The PS5 is a buffed PS4. What do you want from a new console? Should it make you a cup of tea?",
          "score": 5,
          "created_utc": 1745515451.0,
          "replies": []
        },
        {
          "id": "mp37d9q",
          "author": "aristidedn",
          "body": "> It’s a buffed up Switch. Nothing super new really. \n\nA buffed up Switch is literally what the entire market has been asking after for years.\n\nIt doesn't need to be super new. It needs to be what the market wants.",
          "score": 2,
          "created_utc": 1745638118.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mom7ow6",
      "author": "Chill_Roller",
      "body": "Worth pointing out the Japanese version is region locked and a good chunk cheaper than the worldwide version the rest of schmucks get the option to buy. Not really surprising the Japanese version is popular, not just amongst the Japanese",
      "score": 26,
      "created_utc": 1745419662.0,
      "replies": [
        {
          "id": "mop6rqx",
          "author": "Enchelion",
          "body": "It's about the same price in terms of internal buying power because the Japanese economy is in rough shape right now. Just not in terms of direct currency exchange.",
          "score": 11,
          "created_utc": 1745451654.0,
          "replies": [
            {
              "id": "moqbwkw",
              "author": "soldat21",
              "body": "Will they release a Brazilian version for the same price because “buying power sucks”?",
              "score": 4,
              "created_utc": 1745466465.0,
              "replies": [
                {
                  "id": "moqprg5",
                  "author": "Enchelion",
                  "body": "Probably not because they're not a Brazilian company. Of course Nintendo is going to prioritize their home market over others.",
                  "score": 9,
                  "created_utc": 1745472695.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mor23rt",
          "author": "adamus13",
          "body": "Ah so no one did read the article where it says the multilingual version is the one thats exclusive through the MyNintendo store, thus the japanese are dealing with what the “rest of us schmucks” will.",
          "score": 1,
          "created_utc": 1745479753.0,
          "replies": []
        }
      ]
    },
    {
      "id": "molmv6n",
      "author": "vicalpha",
      "body": "I thought they had this figured out for the Switch 2 launch?!",
      "score": 10,
      "created_utc": 1745412919.0,
      "replies": [
        {
          "id": "monixmc",
          "author": "That_guy1425",
          "body": "I mean, 2.2 million is 1/6 the first year global sales of the switch 1. They probably didn't expect preorders from a single location to hit that high. It would be if the US preorded almost 5 million.",
          "score": 5,
          "created_utc": 1745433299.0,
          "replies": []
        },
        {
          "id": "molv3q0",
          "author": "AStringOfWords",
          "body": "They do. This is just a warning that you might not get one week 1.",
          "score": 16,
          "created_utc": 1745415776.0,
          "replies": []
        },
        {
          "id": "molqc7n",
          "author": "herbertfilby",
          "body": "Right? Like the fact that they even have an actual customer list of loyal fans requesting their upcoming product IS the number they need to “expect”. Other companies would kill to be in a situation like this.",
          "score": 1,
          "created_utc": 1745414151.0,
          "replies": []
        },
        {
          "id": "mor53fn",
          "author": "Ipokeyoumuch",
          "body": "Nintendo reportedly made over 4 million in anticipation for the launch which is more than they did for the Switch 1 and those sold like hotcakes.",
          "score": 1,
          "created_utc": 1745481630.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mona6xv",
      "author": "neonlights326",
      "body": "These are applications to pre-order the console, not actual pre-orders. This does not necessarily mean they are going to sell x amount Day One, as there is no commitment to buy if your application gets accepted.\n\n\nI have little to no intention of buying the console now but I still submitted an application in the US \"just in case\", as there was no reason for me not to.",
      "score": 3,
      "created_utc": 1745430776.0,
      "replies": []
    },
    {
      "id": "moljxwp",
      "author": "None",
      "body": "![gif](giphy|dZEoQE2qlzwx3IP98G)",
      "score": 10,
      "created_utc": 1745411847.0,
      "replies": []
    },
    {
      "id": "momjg74",
      "author": "TheEvilBlight",
      "body": "They should prioritize their home markets and the jp-only switch2.",
      "score": 2,
      "created_utc": 1745423095.0,
      "replies": []
    },
    {
      "id": "moo72a2",
      "author": "astro_plane",
      "body": "They delayed it a year and they still have a supply shortage? Lets not forget Nintendo has a history of keeping supply low to keep demand up, create hype, and to stay in the news. Amiibos, the Wii, the SNES Classic, their 64 controllers, and some of the biggest NES releases followed that strategy.",
      "score": 2,
      "created_utc": 1745440320.0,
      "replies": []
    },
    {
      "id": "moob9dm",
      "author": "cashfile",
      "body": "They sold over 150 million switches... They didn't assume that even 2% of users would want switch 2 day one????",
      "score": 2,
      "created_utc": 1745441534.0,
      "replies": []
    },
    {
      "id": "mopi4nk",
      "author": "OldWrangler9033",
      "body": "Hmmm...will it have enough games warrant the cost.",
      "score": 2,
      "created_utc": 1745455560.0,
      "replies": []
    },
    {
      "id": "moqb8kr",
      "author": "baldycoot",
      "body": "2.2 million _pre-orders_ on day 1, through just one channel and in one territory, is _insane_.",
      "score": 2,
      "created_utc": 1745466187.0,
      "replies": []
    },
    {
      "id": "molle17",
      "author": "KrookedDoesStuff",
      "body": "I highly doubt that it exceeds any expectation. Nintendo is known for creating artificial scarcity with their products.",
      "score": 18,
      "created_utc": 1745412385.0,
      "replies": [
        {
          "id": "mopwgmi",
          "author": "Chrisnness",
          "body": "Artificial scarcity isn't a thing. If Nintendo believes they'll sell 12 million per year, then the first few months of production will only be 2 million. Obviously demand for the first few months is more than 2 million, but that's all you can do",
          "score": 3,
          "created_utc": 1745460565.0,
          "replies": []
        },
        {
          "id": "mom7uu9",
          "author": "BMO888",
          "body": "Artificial scarcity is not a thing in this scenario. Any company that would do this in the technology market would fire whoever is in charge of this “tactic”. They would be leaving money on the table. People don’t realize it’s a constant juggle between manufacturing, storing and distributing. Nintendo is known to be conservative and not have too much overhead. This includes products and manufacturing contracts. You all act like they can just fire up factory’s to produce switches instantly. The whole product pipeline takes a long time.",
          "score": -1,
          "created_utc": 1745419711.0,
          "replies": [
            {
              "id": "mombqsc",
              "author": "xixbia",
              "body": "Can I introduce you to De Beers?\n\nDon't get me wrong, that's an incredible outlier as it's basically a massive cartel ran by the entire diamond industry. \n\nBut articial scarcity absolutely exists, just not in this context. It would be incredibly stupid in this context. It's just that Nintendo doesn't want to produce more than they can sell. Scarcity is problematic but can be resolved by additional production, having excess inventory can bankrupt a company.",
              "score": 5,
              "created_utc": 1745420856.0,
              "replies": [
                {
                  "id": "momcvns",
                  "author": "BMO888",
                  "body": "I should’ve clarified it does exist but not in this scenario or anything in the technology market. Diamonds a very specific market.",
                  "score": 7,
                  "created_utc": 1745421188.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "momfyyq",
              "author": "BedditTedditReddit",
              "body": "You must have never heard of apple, or you are young, or both.",
              "score": 1,
              "created_utc": 1745422088.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mollklx",
          "author": "badger906",
          "body": "Artificial scarcity is better than over production with a low demand!",
          "score": -23,
          "created_utc": 1745412452.0,
          "replies": [
            {
              "id": "molo2hq",
              "author": "eilrah26",
              "body": "All I care about is whether I can buy a new switch or not. Obviously a scalper with that mindset.",
              "score": 9,
              "created_utc": 1745413352.0,
              "replies": [
                {
                  "id": "molog8d",
                  "author": "badger906",
                  "body": "Obviously a scalper? 1) I’ve never bought a new console or device and sold it at a profit.. in fact I sold my switch 1 to a young colleague for half price 4 months after launch. 2) if I buy a new console, I don’t want it to be half price in 3 months attached to a financially crippled company that put all their eggs on one basket. \n\nBut no.. sensible adult who understands business.. scalper..",
                  "score": -6,
                  "created_utc": 1745413489.0,
                  "replies": [
                    {
                      "id": "moqu7gm",
                      "author": "eilrah26",
                      "body": "Looks like people disagree with you 🤷‍♂️",
                      "score": 1,
                      "created_utc": 1745475073.0,
                      "replies": [
                        {
                          "id": "moqzcrp",
                          "author": "badger906",
                          "body": "Yeah and people also voted for trump. Not everyone can be right or know the truth.",
                          "score": 2,
                          "created_utc": 1745478062.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "molrqo3",
                      "author": "garyb50009",
                      "body": "literally every word you said there screams reseller. a normal person wouldn't laud selling a used console to a kid (young colleague, the fuck are you smoking) for half price. selling a used anything for half price is what normal people would consider average or appropriate. secondly, no normal person would consider the short term resale value of a product they purchase and actually intend to use for personal enjoyment. when a normal person purchases a console they don't intend to resell, these sort of thoughts just don't come up in their mind. because who in their right mind would plan on reselling something they will be making use of for the foreseeable future.",
                      "score": -7,
                      "created_utc": 1745414634.0,
                      "replies": [
                        {
                          "id": "molst42",
                          "author": "badger906",
                          "body": "I sold it because I wasn’t using it, as the next game I wanted (Mario) wasn’t out for 6-7 months post launch, and my colleague was struggling to get one. \nI didn’t sell it for personal gain, or lack of enjoyment, I sold it to be nice. \nIn fact I’ve only ever sold 2 other consoles in the 36 years I’ve been alive. That being an n64 to fund my ps2 (still have it) and a ps4 pro, as I got a ps5, and that was sold to a family friend at Christmas for her kids. Again, at a price lower than I could have got for it at the local cex or cash converters.\n\nSome of us.. aren’t materialistic.. and some of us don’t give a shit about trying to make as much money as possible. \nI’m a store owner.. I’m the little guy, my entire job revolves around fighting big companies at low margins.. trust me, I can’t abide ripping people off more than the average person..",
                          "score": 3,
                          "created_utc": 1745415000.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "molr01s",
              "author": "FisicoK",
              "body": "\\*Wii U enters the room\\*",
              "score": 1,
              "created_utc": 1745414380.0,
              "replies": []
            },
            {
              "id": "molnot2",
              "author": "uncreativemind2099",
              "body": "If you aren’t an investor why do you care?",
              "score": -2,
              "created_utc": 1745413215.0,
              "replies": [
                {
                  "id": "molo4sh",
                  "author": "badger906",
                  "body": "If someone buys a full price console that’s dramatically reduced a few months later, they’re entitled to be annoyed. as would you be if you bought one and the over production caused its downfall and it flopped or the company folded. \n\n“I just spent $550 on a console and a game and the company is now bust and I’ll get no new games, but it’s ok, I didn’t invest in stocks” doesn’t exactly sound like a normal statement.",
                  "score": -10,
                  "created_utc": 1745413375.0,
                  "replies": [
                    {
                      "id": "molofjd",
                      "author": "KrookedDoesStuff",
                      "body": ">> If someone buys a full price console that’s dramatically reduced a few months later\n\nNintendo doesn’t reduce prices. The 3DS being an obvious exception, and the Wii U for a very **very** short period of time, but a Nintendo Switch today costs the same amount it did when it launched.",
                      "score": 5,
                      "created_utc": 1745413482.0,
                      "replies": [
                        {
                          "id": "molrftc",
                          "author": "FisicoK",
                          "body": "The real price cut they did on NSW is not increasing its price in a market where everyone else increased prices (it's an half serious answer)\n\nOtherwise DS, 3DS, GC, Wii, Wii U even NSW with the Lite SKU went through some kind of price drops.  \nIf the hardware is successfull it's through a cheaper SKU usually (Wii Mini, DS Lite, 2DS...) or a straight up price cut if the hardware isn't successful (GC, Wii U)",
                          "score": 2,
                          "created_utc": 1745414531.0,
                          "replies": []
                        },
                        {
                          "id": "mon3h7y",
                          "author": "Kramer7969",
                          "body": "People don’t remember that Nintendo used to have tons of flops. Technically the game cube and the n64 sold horribly compared to the competition from Sony. There is no guarantee the switch 2 will not be another Wii U.",
                          "score": 1,
                          "created_utc": 1745428888.0,
                          "replies": []
                        },
                        {
                          "id": "molp0z0",
                          "author": "badger906",
                          "body": "Ok.. so just because they haven’t done something recently.. or before. Doesn’t mean they won’t ever do it. \n\nAnd you just proved that 2 of their consoles in the past have been reduced. Also missed off the original game boy. That was reduced not long after launch.",
                          "score": 0,
                          "created_utc": 1745413692.0,
                          "replies": [
                            {
                              "id": "molve61",
                              "author": "AStringOfWords",
                              "body": "They aren’t reducing the Switch 2, not for the foreseeable future. People are preordering it like crazy.",
                              "score": 5,
                              "created_utc": 1745415872.0,
                              "replies": [
                                {
                                  "id": "mom1yqp",
                                  "author": "badger906",
                                  "body": "I know. I didn’t say they were reducing the price. I said someone would be annoyed if Nintendo over produced, it lacked demand and thus was sold cheaper to clear inventory. \nSo planned scarcity is a better outcome from a business standpoint point.",
                                  "score": 0,
                                  "created_utc": 1745417965.0,
                                  "replies": [
                                    {
                                      "id": "mom47ai",
                                      "author": "AStringOfWords",
                                      "body": "True, but they didn’t do that either. They genuinely thought a production run of 4 million units would cover all preorders and allow them to still have stock on launch day.\n\nTo be fair, everyone would have thought the same, to expect the switch 2 to outsell the switch 1 by over 3 times as many units would be crazy optimistic. Yet here we are.",
                                      "score": 1,
                                      "created_utc": 1745418627.0,
                                      "replies": [
                                        {
                                          "id": "mom500q",
                                          "author": "badger906",
                                          "body": "Could be back to scalpers. They’ve had a good run with the ps5 and the latest batch of graphics cards.\nBut I hope nintendos not too demanding requirements for their store will help combat it to an extent. I pre ordered through a normal retail store. I’m doubtful I’ll get mine at launch.",
                                          "score": 1,
                                          "created_utc": 1745418866.0,
                                          "replies": [
                                            {
                                              "id": "mosjor9",
                                              "author": "AStringOfWords",
                                              "body": "Me too, I’ve got a retail pre order (UK). I signed up for the Nintendo store and the Amazon wait lists and got an email from both saying sorry you’ve not been successful.\n\nSo I camped out every retail website for 12 hours and snagged a restock.\n\nI don’t think there will be any problems for retailers fulfilling preorders, Nintendo will deliver the exact number of units they promised. Only issue is if your retailer was sloppy and accidentally sold too many, and even then Nintendo are usually pretty good and over-allocate a small percentage to account for that.\n\nI have faith we will both be playing MKW on launch day :)",
                                              "score": 1,
                                              "created_utc": 1745504209.0,
                                              "replies": [
                                                {
                                                  "id": "moskujd",
                                                  "author": "badger906",
                                                  "body": "I got mine through game! They were out of stock one minute and then allowed me to check out the next. I too failed on Amazon and Nintendo! \n\nI think game had a system that it was in your basket reserved for 30 minutes, and I managed to get one that wasn’t checked out",
                                                  "score": 1,
                                                  "created_utc": 1745504552.0,
                                                  "replies": [
                                                    {
                                                      "id": "motasjm",
                                                      "author": "AStringOfWords",
                                                      "body": "👍 nice\n\nGame are pretty solid in terms of not over-selling what they’ve been allocated, and being a bricks and mortar (for now!) they will have some units allocated to in-store stock as kind of a buffer.",
                                                      "score": 1,
                                                      "created_utc": 1745512008.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "molv8vf",
                  "author": "AStringOfWords",
                  "body": "We like Nintendo and don’t want them to lose money",
                  "score": -5,
                  "created_utc": 1745415824.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "montto5",
      "author": "_Kine",
      "body": "\"applied to buy\" is such a dystopian phrase",
      "score": 2,
      "created_utc": 1745436486.0,
      "replies": [
        {
          "id": "mor569a",
          "author": "Ipokeyoumuch",
          "body": "It was very Japanese too. They use a lottery for the chance to purchase the items to deal with scalpers and shortages. ",
          "score": 5,
          "created_utc": 1745481680.0,
          "replies": []
        },
        {
          "id": "mosk601",
          "author": "error521",
          "body": "Dystopia is when a game console has limited supply",
          "score": 3,
          "created_utc": 1745504352.0,
          "replies": []
        }
      ]
    },
    {
      "id": "molxz9r",
      "author": "Laserous",
      "body": "There's always a shortage of Nintendo hardware at launch. It's been that way since the SNES.",
      "score": 3,
      "created_utc": 1745416712.0,
      "replies": []
    },
    {
      "id": "mome4y8",
      "author": "Lost_Apricot_4658",
      "body": "This is made up to push share prices",
      "score": 3,
      "created_utc": 1745421555.0,
      "replies": []
    },
    {
      "id": "momme3d",
      "author": "Metazolid",
      "body": "And this is why they have no problem charging 90 bucks for a game. Enough people happily eat it up.",
      "score": 3,
      "created_utc": 1745423942.0,
      "replies": []
    },
    {
      "id": "molsxu1",
      "author": "None",
      "body": "“We didn’t think this many people would want one”",
      "score": 2,
      "created_utc": 1745415046.0,
      "replies": [
        {
          "id": "moly1m9",
          "author": "AStringOfWords",
          "body": "That kind of is what unexpectedly high demand means, yes.\n\nOriginal Switch sold 1.5M units worldwide week 1, and that was seen as an amazing success.\n\nOther huge launches:\n\nPS1, sold around 500K units worldwide week 1.\nPS4, 1M units worldwide.\n\n2.2M units on the Japanese Nintendo store alone is *CRAZY* nobody would have expected that. It means global demand is somewhere north of 4 million units… on PREORDER.\n\nTotally unheard of.",
          "score": 20,
          "created_utc": 1745416733.0,
          "replies": [
            {
              "id": "molyb83",
              "author": "None",
              "body": "Ok when you put it into perspective that is quite a lot",
              "score": 4,
              "created_utc": 1745416819.0,
              "replies": [
                {
                  "id": "mom5bpi",
                  "author": "AStringOfWords",
                  "body": "Considering there’s only two games when it comes out it’s insane.\n\nImagine when there’s a Mario, a Smash Bros and a Zelda. Shits gonna be wild.",
                  "score": 4,
                  "created_utc": 1745418963.0,
                  "replies": [
                    {
                      "id": "mom69ue",
                      "author": "None",
                      "body": "Yeah it’s gonna be crazy",
                      "score": 1,
                      "created_utc": 1745419245.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "momfqke",
              "author": "Corinite",
              "body": "Japan accounts for around just 20% of Nintendo's revenue, Europe is barely any more. US accounted for 37% in 2024.\n\n4 million is low balling. Could be double that easily.",
              "score": 1,
              "created_utc": 1745422020.0,
              "replies": [
                {
                  "id": "momjrln",
                  "author": "AStringOfWords",
                  "body": "I think tariffs probably got people crazy and it’s going to be like 20 million preorders in the US 😂",
                  "score": 1,
                  "created_utc": 1745423185.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mom6st1",
          "author": "Optimus_Prime_Day",
          "body": "To be fair, they have to plan for less or they end up in a WiiU situation with overstock they can't sell, which is a loss to the company.",
          "score": 2,
          "created_utc": 1745419399.0,
          "replies": []
        }
      ]
    },
    {
      "id": "molucg9",
      "author": "ElkSad9855",
      "body": "Looks like I’ll be getting my hands on one in 2-3 years.. Dang.",
      "score": 2,
      "created_utc": 1745415526.0,
      "replies": [
        {
          "id": "molyyso",
          "author": "AStringOfWords",
          "body": "Nah they will definitely restock before December.",
          "score": 1,
          "created_utc": 1745417030.0,
          "replies": [
            {
              "id": "mom7hfu",
              "author": "ElkSad9855",
              "body": "Yeah I’m thinking more about the scalpers.",
              "score": 1,
              "created_utc": 1745419601.0,
              "replies": [
                {
                  "id": "mome1qs",
                  "author": "AStringOfWords",
                  "body": "I think nintendos approach will be to flood the market to make scalping unprofitable. I guess we will see how that pans out.",
                  "score": 3,
                  "created_utc": 1745421530.0,
                  "replies": [
                    {
                      "id": "moqj33a",
                      "author": "levilee207",
                      "body": "Well they're apparently doing a pretty poor job so far ",
                      "score": 1,
                      "created_utc": 1745469542.0,
                      "replies": [
                        {
                          "id": "moqx57s",
                          "author": "AStringOfWords",
                          "body": "Idiotic take. The console isn’t even out.",
                          "score": 1,
                          "created_utc": 1745476758.0,
                          "replies": [
                            {
                              "id": "mosn2e7",
                              "author": "levilee207",
                              "body": "Right; it's not even out and they're already issuing a supply warning. Doesn't look great",
                              "score": 1,
                              "created_utc": 1745505208.0,
                              "replies": [
                                {
                                  "id": "mot9xvq",
                                  "author": "AStringOfWords",
                                  "body": "Depends on your point of view I guess. As someone who already bagged a preorder this is great news. I know the console that I took a small gamble on being successful will definitely be successful, beyond even Nintendo’s wildest dreams.\n\nAn established user base of over 5 million users in the first month of release can only mean tons of third party games, which is good for me.",
                                  "score": 2,
                                  "created_utc": 1745511767.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "momm4tc",
      "author": "zehn78",
      "body": "They’ve been doing this since the Wii (at least).",
      "score": 2,
      "created_utc": 1745423868.0,
      "replies": []
    },
    {
      "id": "mooakho",
      "author": "Stanky_fresh",
      "body": "Impossible. Reddit told me that Nintendo is evil and priced this way too high and that the Switch 2 was going to flop just like the Wii U did",
      "score": 2,
      "created_utc": 1745441334.0,
      "replies": [
        {
          "id": "mopc42j",
          "author": "triadwarfare",
          "body": "The Japanese price is lower than the rest of the world.",
          "score": 3,
          "created_utc": 1745453479.0,
          "replies": [
            {
              "id": "mopqaam",
              "author": "Beginning_Bee4823",
              "body": "Heard Its around $350 for Japanese version; it will be locked to their country and have periodically checkups to still have acess. Also only supports Japanese and won't support other languages.",
              "score": 1,
              "created_utc": 1745458416.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "molzbdr",
      "author": "internetlad",
      "body": "At this point I'm convinced miyamoto could shit in a plastic cube and people would pay $500 for it. ",
      "score": 2,
      "created_utc": 1745417142.0,
      "replies": []
    },
    {
      "id": "moloi3y",
      "author": "lloydsmith28",
      "body": "Guess I'm waiting for the second run lol",
      "score": 1,
      "created_utc": 1745413507.0,
      "replies": []
    },
    {
      "id": "mon92b8",
      "author": "flux_capacitor3",
      "body": "Wonder how many of those are scalpers.",
      "score": 1,
      "created_utc": 1745430460.0,
      "replies": []
    },
    {
      "id": "monwbeu",
      "author": "Star_bobo",
      "body": "How are they still surprised by this? The demand for Nintendo consoles will always be high and production will not meet demand. \n\nThis has to be part of the gimmick.",
      "score": 1,
      "created_utc": 1745437210.0,
      "replies": []
    },
    {
      "id": "monwbqf",
      "author": "galloway188",
      "body": "Scalpers gonna get screwed or they are gonna screw people over that want one?",
      "score": 1,
      "created_utc": 1745437213.0,
      "replies": [
        {
          "id": "monz3qm",
          "author": "TheInfiniteArchive",
          "body": "I mean international scalpers but locals would have already have pre bought several.",
          "score": 1,
          "created_utc": 1745438016.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moo2mll",
      "author": "Background-Zombie-20",
      "body": "Just hype",
      "score": 1,
      "created_utc": 1745439035.0,
      "replies": []
    },
    {
      "id": "moodjd7",
      "author": "Wandering_Savage",
      "body": "This isn’t surprising. Nintendo always does this for the launch and first year or so of a new console. They keep the supply limited then flood the market.",
      "score": 1,
      "created_utc": 1745442192.0,
      "replies": []
    },
    {
      "id": "moohaeg",
      "author": "TbonerT",
      "body": "It reminds me of the NES Mini launch. It was very popular and hard to find but the main reason you couldn’t find them anywhere was that they only made like a million of them. To put that number into context, Apple sells more iPhones every day before lunch.",
      "score": 1,
      "created_utc": 1745443321.0,
      "replies": []
    },
    {
      "id": "mooyg45",
      "author": "perfectfate",
      "body": "Here we go",
      "score": 1,
      "created_utc": 1745448880.0,
      "replies": []
    },
    {
      "id": "mopaa53",
      "author": "sharrrper",
      "body": "I was curious so I went and looked up the numbers.\n\nSwitch 1 sold about 330,000 in Japan the first weekend and about 500,000 the first month.\n\nSo 2.2 million pre-orders for the followup is quite a boost.\n\nNow, on the other side though, people were a bit skeptical about the Switch when it was first announced. So initial orders may have been a little slow, but it really caught on once people started trying it out. Switch being a known quantity and very popular they *should* have been expecting a better out of the gate response with their estimates this time.\n\nAlso, Nintendo being Nintendo, was that 500,000 in the first month bavknin 2017 all they could move or was that all that was available? I don't know for sure which. If the latter that needs to be accounted for as well. My 30 seconds of research didn't turn up what sort of supply was avaliable at the time.",
      "score": 1,
      "created_utc": 1745452844.0,
      "replies": []
    },
    {
      "id": "mopafqd",
      "author": "qb_master",
      "body": "Oh look, Nintendo's gonna play the Nvidia game on us.",
      "score": 1,
      "created_utc": 1745452897.0,
      "replies": []
    },
    {
      "id": "moptecn",
      "author": "FerretBusinessQueen",
      "body": "Am I the only one who just doesn’t care about this? I have Switch I used a lot during the pandemic (animal crossing) but I personally don’t care for the latest playstyle of Zelda games. I love me some Mario Bros but only one or two titles a gen come out that really interest me. The fun of Mario Party runs out once I get sick of the maps. No shade on the people who love these things or others or find them repayable, I just might not be their target demographic.",
      "score": 1,
      "created_utc": 1745459491.0,
      "replies": []
    },
    {
      "id": "moqcidr",
      "author": "J663_atric_0n3",
      "body": "I’m gonna have to import mine myself. Japan versions are better to",
      "score": 1,
      "created_utc": 1745466719.0,
      "replies": []
    },
    {
      "id": "moqg2cw",
      "author": "None",
      "body": "Suffering From Success\n\n![gif](giphy|hAcDHEhZHA2bu|downsized)",
      "score": 1,
      "created_utc": 1745468243.0,
      "replies": []
    },
    {
      "id": "moqhp3f",
      "author": "i__hate__stairs",
      "body": "Ah shit, here we go again.",
      "score": 1,
      "created_utc": 1745468945.0,
      "replies": []
    },
    {
      "id": "moqo63m",
      "author": "SierraBravo94",
      "body": "The FOMO is strong... for a console with an expected lifecycle of +5years. people need to chill.",
      "score": 1,
      "created_utc": 1745471896.0,
      "replies": []
    },
    {
      "id": "moqtd2f",
      "author": "Chr0ll0_",
      "body": "Wild stuff",
      "score": 1,
      "created_utc": 1745474602.0,
      "replies": []
    },
    {
      "id": "mor1ekl",
      "author": "mintysoul",
      "body": "they shouldn't send any switches to Putin supporting US, only after they repent",
      "score": 1,
      "created_utc": 1745479317.0,
      "replies": []
    },
    {
      "id": "mor60y2",
      "author": "kswong98",
      "body": "2 million scalpers\n0.2 million players",
      "score": 1,
      "created_utc": 1745482220.0,
      "replies": []
    },
    {
      "id": "morhknn",
      "author": "buttholecake",
      "body": "“Far exceeds” You guys dont pay attention to demand?",
      "score": 1,
      "created_utc": 1745489351.0,
      "replies": []
    },
    {
      "id": "mornufi",
      "author": "GregSimply",
      "body": "They’ll do a lottery system then, that’s always what they want.",
      "score": 1,
      "created_utc": 1745492562.0,
      "replies": []
    },
    {
      "id": "morp0y0",
      "author": "aliasbgb",
      "body": "It's amazing how upset a population of adults has gotten over the lack of availability of a *children's console.* \n\nLike, I'm not the type to gatekeep things due to age, but grown Westerners are genuinely disturbingly hung up on the most childish IPs in gaming, rapidly becoming exclusive to the Switch. We've got 1000s of dudes who should be focused on literally anything else whining because they can't access the latest Smash Bros. innstallment. \n\nGet over it, the console is very clearly for children, and your internationally scaled states of arrested development have now actively kept children from being able to access entertainment made specifically for them.  I pray you all feel really good about your inability to be responsible adults, because apparently the majority of you *were* playing Animal Crossing instead of voting or taking any sort of action against the things you've all complained about for the entirety of this year.",
      "score": 1,
      "created_utc": 1745493121.0,
      "replies": [
        {
          "id": "mort8lm",
          "author": "TaGoonkGoonk",
          "body": "I’m convinced men today *cannot enjoy anything that doesn’t relate or require you being absolutely drained of any kind of happiness*\n\n*you like shooters? You’re violent.\nYou like fighting games? You have anger problems.\nYou like playing/interacting with women characters? You’re a porn addict.\nYou like action/masculinity? You hate women and you’re a misogynist* .\n\nShut. The. Fuck. Up. *please*",
          "score": 2,
          "created_utc": 1745494970.0,
          "replies": [
            {
              "id": "mortkpl",
              "author": "aliasbgb",
              "body": "I don't really think any of that is relevant to the fact that grown adults buying up the entire projected stock for a *children's console* keeps those consoles and games from ever reaching any *children* who can enjoy them.",
              "score": 1,
              "created_utc": 1745495110.0,
              "replies": [
                {
                  "id": "morto3s",
                  "author": "TaGoonkGoonk",
                  "body": "Because it’s a free country, and people can do whatever the Fuck they want. Who cares.",
                  "score": 2,
                  "created_utc": 1745495149.0,
                  "replies": [
                    {
                      "id": "mortrt9",
                      "author": "aliasbgb",
                      "body": "You're missing the point I'm making about said \"free country\" being full of grown children, and you're also simultaneously proving it. So, thanks?",
                      "score": 1,
                      "created_utc": 1745495192.0,
                      "replies": [
                        {
                          "id": "morv4gl",
                          "author": "TaGoonkGoonk",
                          "body": "You’re missing the point, where i said i don’t care. And plus you’re a random nobody on the internet; you’re opinion is moot. Have a good one!",
                          "score": 1,
                          "created_utc": 1745495749.0,
                          "replies": [
                            {
                              "id": "morw0i7",
                              "author": "aliasbgb",
                              "body": "To summarize this thread for any spectators:\n\n- She thinks she won because she claimed not to care, similar to that one girl who bullied you in high school for being lame, but likely made hilariously bad decisions as an adult regardless of her prior high-horse. \n\n- Western adults mass-preordering children's content is depriving children of that content. \n\n- Americans cannot and will not ever accept responsibility for their gross state of arrested development, but they will continue to claim to hate ALL children in public places while simultaneously shoveling children's content into their gullets like the distraction from their quite un-free lives that video games were always meant to be.",
                              "score": 0,
                              "created_utc": 1745496107.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mos37i0",
      "author": "MonStarBigFoot",
      "body": "Every. Single. Time.",
      "score": 1,
      "created_utc": 1745498825.0,
      "replies": []
    },
    {
      "id": "moljchp",
      "author": "ottoIovechild",
      "body": "I’m pleased to know that buying 4 pro controllers wasn’t a waste",
      "score": 0,
      "created_utc": 1745411621.0,
      "replies": [
        {
          "id": "molw7ab",
          "author": "AStringOfWords",
          "body": "Wasn’t it?",
          "score": 5,
          "created_utc": 1745416137.0,
          "replies": [
            {
              "id": "momftu1",
              "author": "ottoIovechild",
              "body": "They’re compatible with switch 2",
              "score": 4,
              "created_utc": 1745422046.0,
              "replies": [
                {
                  "id": "momjgjj",
                  "author": "AStringOfWords",
                  "body": "Oh yeah sick. I kinda regret selling mine now.",
                  "score": 2,
                  "created_utc": 1745423097.0,
                  "replies": []
                },
                {
                  "id": "moof01h",
                  "author": "Kitakitakita",
                  "body": "But they can't wake up the console, you'll forever be a second class citizen in the eyes of Miyamoto",
                  "score": 1,
                  "created_utc": 1745442627.0,
                  "replies": [
                    {
                      "id": "mooh2vn",
                      "author": "ottoIovechild",
                      "body": "I’ll probably buy a new one and just leave some others for when the gang wants to play Mario Party\n\nJust kidding. There is no gang.",
                      "score": 4,
                      "created_utc": 1745443258.0,
                      "replies": [
                        {
                          "id": "moohiof",
                          "author": "Kitakitakita",
                          "body": "At least you have your camera",
                          "score": 1,
                          "created_utc": 1745443392.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "morblbg",
                      "author": "AnRealDinosaur",
                      "body": "Really? Ugh that sucks but I'm not about to buy an entire new controller just to avoid getting off my ass & pressing a button.",
                      "score": 1,
                      "created_utc": 1745485789.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "momqbmx",
                  "author": "cyanraichu",
                  "body": "Oh hell yeah, this makes me happy to hear!",
                  "score": 1,
                  "created_utc": 1745425100.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "momsxp6",
      "author": "bonesnaps",
      "body": "Enjoy your $120+ CAD after tax games, I'll pass.",
      "score": 1,
      "created_utc": 1745425870.0,
      "replies": []
    },
    {
      "id": "moll3tw",
      "author": "drlyle",
      "body": "birthrate will keep dropping 📉",
      "score": 0,
      "created_utc": 1745412280.0,
      "replies": []
    },
    {
      "id": "molw4i5",
      "author": "BrownEyesJ",
      "body": "I feel that is almost all of the gamers who are going to get the Switch 2 in a really long period before either more 1st party titles like open world Zelda gets released or a price drop. Let’s see if Nintendo is lucky enough this time.",
      "score": 1,
      "created_utc": 1745416112.0,
      "replies": []
    },
    {
      "id": "mom36hb",
      "author": "spaceocean99",
      "body": "Amazing how impatient people can be. Just wait a year and they’ll be plenty and you can avoid the scalper prices. Yall need to chill.",
      "score": 1,
      "created_utc": 1745418327.0,
      "replies": []
    },
    {
      "id": "molr099",
      "author": "Maghorn_Mobile",
      "body": "Does Nintendo keep forgetting how popular they are or something?",
      "score": 1,
      "created_utc": 1745414382.0,
      "replies": [
        {
          "id": "molxegq",
          "author": "AStringOfWords",
          "body": "Nope. They know people will wait for them to make more.",
          "score": 2,
          "created_utc": 1745416525.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moly0o0",
      "author": "Griffdude13",
      "body": "I imagine having a separate sku that is designed with a more affordable price made a lot of folks happy over there.",
      "score": 1,
      "created_utc": 1745416725.0,
      "replies": []
    },
    {
      "id": "mom91hl",
      "author": "Jumpy-Coffee-Cat",
      "body": "I don’t need a switch 2, my PS5 and PC hardly get used as my limited free time is split between my wife, my guitar, and exercising…. But I just know if I don’t preorder one I’m going to obsess about finding one for months of shortages. My wife and I used to have a blast on the OG switch but it kind of fell by the wayside before we sold it and moved on.",
      "score": 1,
      "created_utc": 1745420057.0,
      "replies": []
    },
    {
      "id": "momgpz0",
      "author": "Sharpshooter188",
      "body": "Im surprised so many were preordered. Though I guess it makes sense in Japan as Sony and Nintendo are the video game power houses over there. When I saw everything going on with pricing along with a few other things with the switch 2, I said F that.",
      "score": 1,
      "created_utc": 1745422305.0,
      "replies": []
    },
    {
      "id": "momuljv",
      "author": "konfliicted",
      "body": "All the scalpers need to stock up to try and screw the rest of us",
      "score": 1,
      "created_utc": 1745426357.0,
      "replies": []
    },
    {
      "id": "monpun8",
      "author": "DavidinCT",
      "body": "Yea, $330 USD for the Switch in Japan....... Nintendo is screwing everyone else.... in Mexico it comes out to $692.15 USD.... \n\nNintendo is smoking crack, the new CEO is young and is only after the bottom line, not what people want like the old Nintendo....",
      "score": 1,
      "created_utc": 1745435319.0,
      "replies": [
        {
          "id": "moqpn94",
          "author": "stellvia2016",
          "body": "No, you're merely ignorant of how exchange rates and global markets work. The exchange rate for yen to usd was 110 a few years ago, then it declined rapidly to over 160:1 at the worst point -- yet their workers aren't being paid any different.\n\nDivide 50,000yen (the Japan MSRP) by 110 and you get ~$450 USD... does that price sound familiar to you?",
          "score": 0,
          "created_utc": 1745472635.0,
          "replies": []
        }
      ]
    },
    {
      "id": "moo3le7",
      "author": "Gravelayer",
      "body": "It's because people found out it's $100 cheaper in Japan but the games can still play in English lol",
      "score": 1,
      "created_utc": 1745439319.0,
      "replies": []
    },
    {
      "id": "moo47ym",
      "author": "GummyPandaBear",
      "body": "Don’t fall for it! they want this scarcity bullshit for the holidays so they can cash in and scalpers make bank.",
      "score": 1,
      "created_utc": 1745439500.0,
      "replies": []
    },
    {
      "id": "mooxpaj",
      "author": "intelligentx5",
      "body": "This shit is Nintendo bullshit scarcity rinse and repeat",
      "score": 1,
      "created_utc": 1745448633.0,
      "replies": []
    },
    {
      "id": "moltoa7",
      "author": "blacksoxing",
      "body": "First off, I'm American and not Japanese, but I feel this means that us Americans are going to be worse off. For that, I am now going to camp in digital line tonight for a shot at a Switch 2. I hate it but that's life. I fear the lotto on 5/8 for us Americans won't bode well",
      "score": 0,
      "created_utc": 1745415298.0,
      "replies": [
        {
          "id": "molyp97",
          "author": "AStringOfWords",
          "body": "Anyone fooled by Reddit into thinking the price is too high and nobody will want a Switch 2 is deluding themselves.\n\nThis will be the most popular games console ever made.\n\nGrab a preorder as soon as you possibly can.",
          "score": 8,
          "created_utc": 1745416944.0,
          "replies": []
        },
        {
          "id": "momgsoa",
          "author": "Corinite",
          "body": "US should be better off. It's Nintendo's biggest market (accounting for 37% of their revenue last year).\n\nThey started producing consoles in Vietnam just to avoid tariffs and most of those units are coming straight to America, an entire new supply chain made just for America.",
          "score": 0,
          "created_utc": 1745422327.0,
          "replies": []
        }
      ]
    },
    {
      "id": "molwp8f",
      "author": "arsinoe716",
      "body": "So.... What does that mean? Shortages in other markets? Thankfully it costs  so much that I will not be buying it this soon.",
      "score": 0,
      "created_utc": 1745416300.0,
      "replies": []
    },
    {
      "id": "momcz9u",
      "author": "Azrael-XIII",
      "body": "Here comes Nintendo with the artificial scarcity *yet again*… 🙄",
      "score": 0,
      "created_utc": 1745421218.0,
      "replies": []
    },
    {
      "id": "momrxd9",
      "author": "TylerDTA",
      "body": "False demand.",
      "score": 0,
      "created_utc": 1745425574.0,
      "replies": []
    },
    {
      "id": "molq09u",
      "author": "Hot_Cheese650",
      "body": "This is exactly why they will continue to raise the price. They probably think not including the tech demo $10 game with the console is a genius move.",
      "score": -3,
      "created_utc": 1745414036.0,
      "replies": [
        {
          "id": "mom7tcs",
          "author": "Optimus_Prime_Day",
          "body": "Their pricing is perfectly in line with all other handheld PCs though, and this even has better features, power, and screen. Any other brand would cost $1000. \n\nEven Steam Deck is old, and this out powers it.\n\n(Not that I'm cool with $700 CDN consoles, but let's compare to all the competition here and be honest)",
          "score": 2,
          "created_utc": 1745419698.0,
          "replies": [
            {
              "id": "mommabi",
              "author": "Hot_Cheese650",
              "body": "You forgot to mention 1st party Nintendo games will cost $80 each and they never go on sale. \n\nOther PC handheld can buy lots of games from Steam for cheap. There’s like 4-5 major Steam sales every year.",
              "score": 1,
              "created_utc": 1745423912.0,
              "replies": [
                {
                  "id": "momsf4m",
                  "author": "Optimus_Prime_Day",
                  "body": "Yea, but games on ps5 cost the same also. I was just looking at some yesterday, and they're $90 in Canada. So they're not the only ones doing that.\n\n3rd party games on switch do drop in price, just not their 1st party games.",
                  "score": -1,
                  "created_utc": 1745425719.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mome4xy",
      "author": "Flimsy_Atmosphere_55",
      "body": "Am I missing somewhere here? Someone please tell me. The switch 2’s price is 450 dollars, isn’t fully backwards compatible with all switch 1 games, and has 80 dollars games. You can get a steam deck CHEAPER and it has way cheaper selection of games. Why is it so popular? I would love an answer because I genuinely do not understand.",
      "score": -2,
      "created_utc": 1745421555.0,
      "replies": [
        {
          "id": "momm0hn",
          "author": "geminijono",
          "body": "A Steam deck is not going to play (legally) Nintendo games. Nintendo’s IP are its main draw, everything from Mario to Metroid to Zelda to Pokemon. That is why people will pay a premium for a Nintendo console. As the Switch 2 will play Nintendo games, they will be thoughtfully designed, have good art direction, and will be fun, they will sell like hotcakes.",
          "score": 7,
          "created_utc": 1745423833.0,
          "replies": []
        },
        {
          "id": "momeeuy",
          "author": "flirtmcdudes",
          "body": "Nintendo games aren’t on pc… so there’s that. But this happens with any new console, so it’s barely news honestly",
          "score": 2,
          "created_utc": 1745421635.0,
          "replies": [
            {
              "id": "momesj0",
              "author": "Flimsy_Atmosphere_55",
              "body": "That’s completely fair, maybe I just don’t have the love for the Nintendo IPs as other people? Even then, I feel like if there were similar IPs that I liked on another handheld console I still wouldn’t put up with the bullshit like 80 dollar games.",
              "score": 2,
              "created_utc": 1745421746.0,
              "replies": []
            }
          ]
        },
        {
          "id": "momjpy9",
          "author": "TheEvilBlight",
          "body": "I’m a steam deck owner but switch2 is engineered to try and stay relevant at the end of the 8 year lifecycle. The SD is gonna have to pull aggressive optimization tricks for the same or tap out on high compute games.\n\nThat and you’re in for exclusives.",
          "score": 2,
          "created_utc": 1745423171.0,
          "replies": [
            {
              "id": "momkh6d",
              "author": "Flimsy_Atmosphere_55",
              "body": "That’s fair but these “high compute games” might not even be on the switch 2 because the switch 2 would t be powerful enough. Correct me if I’m wrong, but iirc the switch 2 functionally has an upgraded switch processor. The steam deck might be more powerful than the switch 2. I couldn’t get a straight answer on this when I looked online though so I might be wrong.",
              "score": 1,
              "created_utc": 1745423390.0,
              "replies": [
                {
                  "id": "mommukw",
                  "author": "geminijono",
                  "body": "It does not matter how powerful a steam deck is relative to a Switch 2, only the latter will (legally) play Nintendo games, which are the main draw. People pay for beautiful art direction, fun gameplay, and with the exception of Pokemon Scarlet/Violet, a quality product. The Switch 2 only needs to be the Switch, but able to output 4K at decent framerates, and it is golden. It will sell like hotcakes, regardless.",
                  "score": 3,
                  "created_utc": 1745424077.0,
                  "replies": [
                    {
                      "id": "momwxlh",
                      "author": "Flimsy_Atmosphere_55",
                      "body": "I think the biggest reason I can’t understand how well it seeks is the lack of full backwards compatibility. I know for many consoles they also don’t have full backwards compatibility but with the switch no one wants to carry around 2 handhelds. With a living room type console it’s not hard to just keep two consoles there.",
                      "score": 1,
                      "created_utc": 1745427028.0,
                      "replies": [
                        {
                          "id": "mon3bhu",
                          "author": "geminijono",
                          "body": "Backwards compatibility almost never covers the entire catalog, regardless of system. A handful of games from PS1 would not work on PS2, and more than a few PS2 games would not work on PS3 (further compounded by later hardware revisions, and eventual removal of backwards compatibility completely). Nintendo has done this before, as you cannot trade/import Pokemon from Gens 1-2 to Gen 3 games (with original hardware, under normal circumstances). It is in their best interest to make sure all the greatest hits play on their latest system, but it appears that they built a Switch 1 emulator into the Switch 2, likely to save costs, but the trade is that not all games may function with it :(",
                          "score": 2,
                          "created_utc": 1745428844.0,
                          "replies": [
                            {
                              "id": "mon4m5m",
                              "author": "Flimsy_Atmosphere_55",
                              "body": "I get why not all games are backwards compatible in most consoles but, from what I can find, a switch 2 is just an upgraded switch so the hardware should be very very compatible. It’s not like the x86 and PowerPC of the OG XBox and XBox 360",
                              "score": 1,
                              "created_utc": 1745429205.0,
                              "replies": [
                                {
                                  "id": "mon6a99",
                                  "author": "geminijono",
                                  "body": "That is extremely reductive and nitpicky. Nothing is ever that simple under the hood, or at the firmware level. Most people who want a Switch 2 will already have an OG Switch to play that back catalog natively. Nintendo wants people to buy the Switch 2. This is the cycle of consumerist things. \n\nFurther, games like Labo and Ring Fit Adventure require OG Switch hardware, because they were made to use that hardware. At the software level, not every developer is going to do the legwork or spend the money to make and issue an update to ensure compatibility, but some will make an effort. \n\nJust enjoy things as they are, or, if you really are so inclined do something to make them better.",
                                  "score": 2,
                                  "created_utc": 1745429678.0,
                                  "replies": [
                                    {
                                      "id": "mon84wb",
                                      "author": "Flimsy_Atmosphere_55",
                                      "body": "I don’t think my take is nitpicky or reductive at all. The difference between other consoles and a handheld one like the switch is that other consoles sit at home there’s nothing extra that needs to done but carrying around 2 handhelds is something extra. “Just enjoy things as they are” is not a very good take imo because there’s always something that could be improved and since I’m not a developer at Nintendo there is nothing I can do to make it better lol. I wasn’t trying to stir any debate I was just trying to understand and I have gotten a lot of opinions that changed my mind at least somewhat. I could see my take as reductive if Nintendo didn’t do something similar before but the Wii had excellent GameCube support because at the heart the Wii was just a super beefed GameCube. If there plan is to make 98% of games backwards compatible and will improve their selection over time then I will retract my criticism of the backwards compatibility.",
                                      "score": 1,
                                      "created_utc": 1745430200.0,
                                      "replies": [
                                        {
                                          "id": "mona8yf",
                                          "author": "geminijono",
                                          "body": "There are over 12,000 games on the Switch, and Nintendo themselves says about 140-150 OG Switch games will not run on Switch 2. If you do the math, that works out to a minuscule 1.25% of OG Switch games that will not work on Switch 2. That means that about 98.75% of OG Switch games will work on Switch 2, and that number will rise as some devs issue updates to their games. \n\nBy your own math, you may calm down about any worries about backward compatibility :-D",
                                          "score": 1,
                                          "created_utc": 1745430791.0,
                                          "replies": [
                                            {
                                              "id": "monaq7w",
                                              "author": "Flimsy_Atmosphere_55",
                                              "body": "I’ll have to see it to believe it but if it all goes to what they say then yeah it’s that’s good. I was under the impression that it was less than a thousand.",
                                              "score": 1,
                                              "created_utc": 1745430925.0,
                                              "replies": [
                                                {
                                                  "id": "monc7iy",
                                                  "author": "geminijono",
                                                  "body": "Here are Nintendo's own numbers:\nhttps://www.nintendo.com/us/gaming-systems/switch-2/transfer-guide/compatible-games/?srsltid=AfmBOooRZWI2psDyvMhcC_mIbblKOsPfs8MBp9g-vztMiU85hqDqqRTj\n\nTurns out there are even more 3rd party games than my original count, which pushes the total % of incompatible games even lower. A great deal of those are probably slop, but the ones that sold well, will likely receive updates. \n\nAs for Nintendo-made games, most will work with Switch 2, which to be honest, are the main draw for any Nintendo system. \n\nCompatibility crisis averted.",
                                                  "score": 2,
                                                  "created_utc": 1745431345.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "momq7kb",
          "author": "error521",
          "body": "The Switch 2, while still fairly large, is still a much skinnier and more portable device I could actually take out on the bus without feeling like a giant tit. Cannot say the same about the Steam Deck. I have a gaming laptop so if I need a powerful enough PC that I can still lug around places that has me covered. Steam Deck's less powerful and jankier than that and isn't really portable enough to be something I can comfortably lug around wherever, so it's basically no man's land territory for me.\n\nAlso, don't have to mess about with tweaking settings to get games to run okay, it's (probably) more powerful, switching between docked and handheld is seamless, first party games, etc. As for game sales, while Steam definitely has the advantage there, a lot of third-party games go on the eShop for cheap frequently. For example, right now you can get Diablo 2 and 3 for £17, Skyrim for £16, Hogwarts Legacy for £12, Doom for £4, etc. you aren't paying full price for every game on there.",
          "score": 1,
          "created_utc": 1745425067.0,
          "replies": [
            {
              "id": "momsshg",
              "author": "Flimsy_Atmosphere_55",
              "body": "All of those are valid criticisms but hardware to hardware, from what I can find anyway (very limited information on the switch 2 hardware rn) the steam deck is still more powerful. HOWEVER I do understand that with the switches experience the games should be more optimized. I’m probably just the wrong audience which is why I don’t understand because I just can’t fathom paying that much extra for a handheld device because of Nintendo exclusives but I’m sure there are people that would. I expected it to sell well just not this well considering the switch 2 doesn’t even have full backwards compatibility with switch games. Which to me is probably the worst thing about it imo.",
              "score": 0,
              "created_utc": 1745425828.0,
              "replies": [
                {
                  "id": "momz8n8",
                  "author": "error521",
                  "body": ">All of those are valid criticisms but hardware to hardware, from what I can find anyway (very limited information on the switch 2 hardware rn) the steam deck is still more powerful. HOWEVER I do understand that with the switches experience the games should be more optimized.\n\nIt's apples to oranges since we're comparing an x86 PC to an ARM games console, but at the very least third party games do seem to look and run meaningfully better on Switch 2. You could argue console optimization plays a part in that, but the end result is ultimately what matters.\n\n>I’m probably just the wrong audience which is why I don’t understand because I just can’t fathom paying that much extra for a handheld device because of Nintendo exclusives but I’m sure there are people that would\n\nI mean, the lowest end model of the Steam Deck is only around £50 cheaper and that's with a worse screen and no dock included.\n\nAs for the game prices, I mean, yeah, it's a little bit of a piss take but Mario Kart World comes cheaper if you get the console bundle so there's that. And I'm in the UK, where Nintendo is actually much better than most other gaming companies about doing currency conversion instead of just going £ = $. So even MK World is basically just the same price as a lot of the other full-priced games on PlayStation. (Though to be fair, Valve is also better about it so it is a bit of a wash)\n\n>I expected it to sell well just not this well considering the switch 2 doesn’t even have full backwards compatibility with switch games. Which to me is probably the worst thing about it imo.\n\nIt's not an arbitrary whitelist or anything though, Nintendo is trying to get everything up and running. Just some compatibility issues to hash out, which is pretty common for backwards compatible consoles.  We'll have to wait and see how it shakes out at launch but I suspect it'll be fine in the long run even if not everything works completely 100%",
                  "score": 1,
                  "created_utc": 1745427685.0,
                  "replies": [
                    {
                      "id": "mon5k6a",
                      "author": "Flimsy_Atmosphere_55",
                      "body": "Yeah having to excuse the price of games because one is included is kind of a piss take lol. It may look like it’s only 50 dollar savings up front but you have to consider online services, game prices, etc. the other things are definitely valid.",
                      "score": 1,
                      "created_utc": 1745429471.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "momgwre",
      "author": "DarkS7Maneuver",
      "body": "Trying to generate hype for lack of pre orders or preparation everyone for not enough inventory",
      "score": -1,
      "created_utc": 1745422360.0,
      "replies": []
    },
    {
      "id": "moln9b4",
      "author": "piratecheese13",
      "body": "![gif](giphy|lbAgIgQ6Dytkk)\n\nGot some rare things on sale stranger",
      "score": 0,
      "created_utc": 1745413060.0,
      "replies": []
    },
    {
      "id": "mom01vb",
      "author": "snakeoilHero",
      "body": "I want to applaud the marketing manipulation boys behind the curtain. \n\n**APPLY TO BUY**  ✅\n\n**Pre-ORDER**  ❌\n\n[\"I Have teh Powa!\"](https://www.youtube.com/watch?v=ZbGvK-lgWSM&t=1s) -Nintendo to \"customers\"",
      "score": 0,
      "created_utc": 1745417375.0,
      "replies": []
    },
    {
      "id": "momztf3",
      "author": "Onetimehelper",
      "body": "What did they expect? 2.1 million? ",
      "score": 0,
      "created_utc": 1745427850.0,
      "replies": []
    },
    {
      "id": "mon2o4t",
      "author": "GroblyOverrated",
      "body": "Somehow we can get phones made with more power and mass produce them but Nintendo can't make their always outdated piece of plastic with mass production. Sure Nintendo.  Sure.",
      "score": 0,
      "created_utc": 1745428663.0,
      "replies": []
    },
    {
      "id": "mon6f7j",
      "author": "RedArmyRockstar",
      "body": "That's really unfortunate. Was hoping costumers would actually have some backbone, but hoping for that is always disappointing!",
      "score": 0,
      "created_utc": 1745429717.0,
      "replies": []
    },
    {
      "id": "moncsum",
      "author": "ASpiralKnight",
      "body": "So much for the pricing backlash.",
      "score": 0,
      "created_utc": 1745431516.0,
      "replies": [
        {
          "id": "monjpbh",
          "author": "X_chinese",
          "body": "There is no backlash there because the price is $100 cheaper than the rest of the world.",
          "score": 2,
          "created_utc": 1745433526.0,
          "replies": []
        }
      ]
    },
    {
      "id": "monqlll",
      "author": "None",
      "body": "So much for complaining about the prices.",
      "score": 0,
      "created_utc": 1745435539.0,
      "replies": [
        {
          "id": "moqlmcd",
          "author": "Neo_Techni",
          "body": "The Japanese one is over $100 cheaper than the rest of the world's",
          "score": 1,
          "created_utc": 1745470677.0,
          "replies": []
        }
      ]
    },
    {
      "id": "monu58w",
      "author": "shutyourbutt69",
      "body": "Yeah that’s what happens when it’s priced reasonably somewhere",
      "score": 0,
      "created_utc": 1745436578.0,
      "replies": []
    },
    {
      "id": "moom651",
      "author": "Beefygaybro",
      "body": "BS plant article. It’s gonna flop",
      "score": 0,
      "created_utc": 1745444835.0,
      "replies": []
    },
    {
      "id": "mosvu0s",
      "author": "anarchangalien",
      "body": "Oh bullshit. This is not Nintendo‘s first rodeo.",
      "score": 0,
      "created_utc": 1745507753.0,
      "replies": []
    },
    {
      "id": "mot5368",
      "author": "Gumbi_Digital",
      "body": "Going to be 100 million here in the US with 99.999% being scalpers…",
      "score": 0,
      "created_utc": 1745510376.0,
      "replies": []
    },
    {
      "id": "mox0b96",
      "author": "goldaxis",
      "body": "Breaking news: Switch 2 has sold out! [https://www.forbes.com/sites/johngaudiosi/2012/11/18/nintendo-wii-u-consoles-sold-out-already-selling-for-over-500-on-ebay/](https://www.forbes.com/sites/johngaudiosi/2012/11/18/nintendo-wii-u-consoles-sold-out-already-selling-for-over-500-on-ebay/)\n\nWhoops, sorry wrong link.",
      "score": 0,
      "created_utc": 1745554804.0,
      "replies": []
    },
    {
      "id": "mom2pr6",
      "author": "Malufeenho",
      "body": "Classic nintendo bullshit and fake scarcity. They never change and idiots will buy into that EVERY TIME!",
      "score": -9,
      "created_utc": 1745418190.0,
      "replies": [
        {
          "id": "mombv1a",
          "author": "gman5852",
          "body": "2.2 mil in japan alone far exceeds fake scarcity. The Switch 1 sold 4.4 million globally first month.\n\nClassic angry redditor. Never changes and idiots complain instead of doing basic research EVERY TIME!",
          "score": 5,
          "created_utc": 1745420890.0,
          "replies": [
            {
              "id": "momf5nv",
              "author": "Malufeenho",
              "body": "they do it all the time bro. Everyone who is around for a long time knows that nintendo is very famous for pulling out it. Get mad as much as you want but some of us still remember the amiibo bullshit.",
              "score": -7,
              "created_utc": 1745421852.0,
              "replies": [
                {
                  "id": "mon6lul",
                  "author": "TheGhostlyGuy",
                  "body": "And the rest of us remember people like you were saying the same shit when the first switch had shortages but completely ignored Nintendo was shipping them by plain which cost them alot more just to try and meet demand",
                  "score": 1,
                  "created_utc": 1745429769.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mom4zfb",
      "author": "diacewrb",
      "body": "Factoring tariffs as well, Nintendo can probably prioritise their home country and other markets over america until the trade war is over.",
      "score": -3,
      "created_utc": 1745418861.0,
      "replies": [
        {
          "id": "mombjpk",
          "author": "gman5852",
          "body": "US is 1/3 of the market and production has a good amount in  Vietnam which currently has minimal tariffs. They're mass shipping US shipments right now per bloomberg to have as many in the US as possible pretarrif",
          "score": 4,
          "created_utc": 1745420798.0,
          "replies": []
        }
      ]
    },
    {
      "id": "molkajt",
      "author": "Hikaru321",
      "body": "“Exceeds expectations” no it didn’t. There’s no way they couldn’t have seen the insane demand coming. Especially with a cheaper option available there",
      "score": -16,
      "created_utc": 1745411979.0,
      "replies": [
        {
          "id": "mollwdj",
          "author": "Kientha",
          "body": "The OG Switch sold 1.5 million units internationally in its first week. So 2.2 million domestically would certainly be way beyond expectations being 6x the number of units sold in the first week in Japan",
          "score": 14,
          "created_utc": 1745412572.0,
          "replies": [
            {
              "id": "molqhea",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1745414201.0,
              "replies": [
                {
                  "id": "molsjy2",
                  "author": "Kientha",
                  "body": "More being expected is fine, the demand in just Japan being higher than the international sales of any console in its launch period would have been a ridiculous expectation to account for.",
                  "score": 4,
                  "created_utc": 1745414913.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "momsxmd",
      "author": "Salty_Injury66",
      "body": "The Japanese are getting a lil stimulus check I hear. They’re all spending it on the Switch 2",
      "score": -1,
      "created_utc": 1745425869.0,
      "replies": []
    },
    {
      "id": "mon0lzj",
      "author": "jcstrat",
      "body": "Gee, who might have predicted another fake shortage. I’m not really asking. That was rhetorical.",
      "score": -1,
      "created_utc": 1745428077.0,
      "replies": []
    },
    {
      "id": "molw4gr",
      "author": "Golden--",
      "body": "All that hype for easily the most underwhelming console. Xbox and PlayStation at least are competitive with each other (despite PS5 winning that battle). The switch just has specs from 5 years ago and arguably the worst exclusives. \n\nEven if you like the exclusives, buy a streamdeck and emulate them for a significantly better experience.\n\n\nEdit: Turning off replies because the Nintendo fanboys are out in full force straight up lying. The Steamdeck can absolutely emulate Switch 1 games with no issues currently. It's clear they haven't tried doing it themselves because the performance is straight up better. I own a switch 1. I own a steamdeck. I don't understand why anyone would argue this. There's no reason to believe that the switch 2 will be any different since we know the hardware.",
      "score": -14,
      "created_utc": 1745416111.0,
      "replies": [
        {
          "id": "mom6ie4",
          "author": "error521",
          "body": "You are *not* emulating Switch 2 games on the Steam Deck.",
          "score": 3,
          "created_utc": 1745419314.0,
          "replies": [
            {
              "id": "mom8e2r",
              "author": "Golden--",
              "body": "Not on release date but it won't take long before there's a working emulator.",
              "score": -3,
              "created_utc": 1745419868.0,
              "replies": [
                {
                  "id": "moma43w",
                  "author": "error521",
                  "body": "A) There is zero guarantee that there will be a working emulator anytime soon. There were a lot of factors in the relatively quick development of Switch 1 emulation that won't apply here.\n\nB) The Steam Deck only barely has the headroom to emulate Switch 1 games as is and by most metrics the Switch 2 will be comparable or more powerful than it. It's like trying to write a PS5 emulator for Xbox Series X. Even a hypothetical Steam Deck 2 emulating it is dubious.",
                  "score": 4,
                  "created_utc": 1745420370.0,
                  "replies": [
                    {
                      "id": "momdojq",
                      "author": "Golden--",
                      "body": "> There is zero guarantee that there will be a working emulator anytime soon.\n\nTechnically true there's no guarantee but it's definitely likely we have one in within the year. \n\n> The Steam Deck only barely has the headroom to emulate Switch 1 games\n\nIt can run switch games better than the switch currently can and in terms of processing power, should have no problem with switch 2, if an emulator is able to be created.",
                      "score": -4,
                      "created_utc": 1745421424.0,
                      "replies": [
                        {
                          "id": "momj4ql",
                          "author": "error521",
                          "body": ">Technically true there's no guarantee but it's definitely likely we have one in within the year. \n\nI cannot stress enough how asinine and overconfident this is. If you see an emulator in the first year (and that's a massive, massive if) it is going to be extremely primitive at best and take years and years before even light titles are playable.\n\n>It can run switch games better than the switch currently can and in terms of processing power, should have no problem with switch 2, if an emulator is able to be created.\n\nIt can run *some* Switch games better. Others, such as Xenoblade 3, are unstable and barely playable. And even the most conservative estimates (and I do mean conservative) of the Switch 2's power peg it as being five times more powerful than the Switch 1. Even if an amazingly optimized and highly compatable emulator came out for it, we're still talking about performance that'd be in \"seconds per frame\" territory.\n\nIt's really painfully obvious here that you just don't understand how emulation works at all or what goes into it.",
                          "score": 3,
                          "created_utc": 1745423002.0,
                          "replies": []
                        },
                        {
                          "id": "momi5x2",
                          "author": "None",
                          "body": "A powerful PC can run Switch a lot better than the Switch can. A Deck cannot.",
                          "score": 2,
                          "created_utc": 1745422723.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "momdxtc",
                  "author": "Dt2_0",
                  "body": "No, you will not be emulating Switch 2 Games on Steam Deck.\n\nThe Switch 2 has (at least from the specs we know) more raw horsepower than the Steam Deck in the first place. The Steam Deck can barely emulate Switch 1 games.\n\nYou don't emulate on a computer with less processing power than your emulation target. Emulation on it's own takes up a large amount of resources that is not being used to actually play the game, limiting performance even more.\n\nDesktop PCs? Sure, those will probably be able to emulate Switch 2 games on current hardware in a few years once the emulator builders get a good feel for optimizing the emulator and what games people want to emulate.",
                  "score": 3,
                  "created_utc": 1745421499.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mooa8ak",
      "author": "Boring-Attorney1992",
      "body": "My parents will be visiting Japan in a week. Will it be possible for them to buy the S2 there and bring it back to the US? Will it be cheaper? Will I have any restrictions as far as system/region locks go?",
      "score": -2,
      "created_utc": 1745441234.0,
      "replies": []
    },
    {
      "id": "mollr6k",
      "author": "fullload93",
      "body": "How the hell could that far exceed their expectations? Don’t they mean far exceeds their supply capacity? If Nintendo couldn’t have imagined this many would be interested in buying it… well they are just living under a rock.",
      "score": -14,
      "created_utc": 1745412519.0,
      "replies": [
        {
          "id": "molob4h",
          "author": "eilrah26",
          "body": "1.5 million switch sales internationally in its first week of release. Switch 2 has 2.2 million in Japan alone wanting to purchase, so yes, far exceeding their expectations.",
          "score": 17,
          "created_utc": 1745413439.0,
          "replies": [
            {
              "id": "molwphu",
              "author": "AStringOfWords",
              "body": "People saying this is going to be a flop because of the high price are going to look so, so stupid in about 6 weeks.",
              "score": 8,
              "created_utc": 1745416302.0,
              "replies": [
                {
                  "id": "mon76dg",
                  "author": "TheGhostlyGuy",
                  "body": "Reminds me of the og switch, so many people saying it would flop",
                  "score": 2,
                  "created_utc": 1745429931.0,
                  "replies": [
                    {
                      "id": "mosirkr",
                      "author": "AStringOfWords",
                      "body": "OG switch is one of the best selling consoles of all time if not the best selling of all time, and even that “only” sold 1.5 million units worldwide in the first week of launch.\n\nNintendo have already sold over 4 million preorders worldwide, and demand isn’t even close to calming down. I think they could probably have made 40 million units available for preorder and still would have sold all of them.\n\nThis level of demand hasn’t been seen for a new video game console *ever*.\n\nIf you added together the preorder volume of the Xbox one, PS4, Xbox series X and PS5 put together I don’t think it would be 4 million.",
                      "score": 2,
                      "created_utc": 1745503933.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "molp0wz",
      "author": "BUROCRAT77",
      "body": "Something something fake supply issues something something",
      "score": -11,
      "created_utc": 1745413691.0,
      "replies": [
        {
          "id": "molweee",
          "author": "AStringOfWords",
          "body": "Nah. Fake supply issues would be only making 2 million consoles worldwide. Like the SNES mini or something.\n\nThey made 10 million and are still going to sell out. This shit is bananas.",
          "score": 9,
          "created_utc": 1745416203.0,
          "replies": [
            {
              "id": "molz77g",
              "author": "BUROCRAT77",
              "body": "Manufacturing demand. Make more. They do this every time.",
              "score": -4,
              "created_utc": 1745417105.0,
              "replies": [
                {
                  "id": "mom4yl0",
                  "author": "AStringOfWords",
                  "body": "No they don’t. The 3DS had plenty of stock by week 3. GameCube was on the shelves pretty much from day 1. \n\nYou just remember the ones where demand was too high or supply was too low.\n\nThey made 4 million of the damn things, what do you want, blood?",
                  "score": 4,
                  "created_utc": 1745418854.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "molnmkz",
      "author": "ChrisBtheRedditor",
      "body": "I guess the people have voted with their wallets and agreed to ~$100 games.",
      "score": -15,
      "created_utc": 1745413193.0,
      "replies": [
        {
          "id": "molnvw0",
          "author": "None",
          "body": "[deleted]",
          "score": 7,
          "created_utc": 1745413286.0,
          "replies": [
            {
              "id": "molwif6",
              "author": "Golden--",
              "body": "Which is absolutely overpriced.",
              "score": 1,
              "created_utc": 1745416240.0,
              "replies": [
                {
                  "id": "mom6a72",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1745419247.0,
                  "replies": [
                    {
                      "id": "mom8aqk",
                      "author": "Golden--",
                      "body": "No game is worth $80, especially not a Nintendo game that has 16 different versions of it.",
                      "score": -1,
                      "created_utc": 1745419842.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "molx4dl",
              "author": "ChrisBtheRedditor",
              "body": "Yeah the price is hilarious. They think they're GTA 6 or something?",
              "score": -5,
              "created_utc": 1745416436.0,
              "replies": []
            }
          ]
        },
        {
          "id": "molrze2",
          "author": "Tolucawarden01",
          "body": "Lets quit it with the hyperbole. By saying “durr hurr its $100 games” makes the ACTUAL $80 games seem more reasonable (which it is not)",
          "score": 4,
          "created_utc": 1745414717.0,
          "replies": [
            {
              "id": "molx50k",
              "author": "None",
              "body": "[removed]",
              "score": -1,
              "created_utc": 1745416441.0,
              "replies": [
                {
                  "id": "molxdz1",
                  "author": "Tolucawarden01",
                  "body": "What the actual fuck are you talking about 😂",
                  "score": 1,
                  "created_utc": 1745416521.0,
                  "replies": [
                    {
                      "id": "mom5zo1",
                      "author": "AStringOfWords",
                      "body": "People bought the Civ 7 deluxe edition for $120 and nobody was crying about it.",
                      "score": 0,
                      "created_utc": 1745419161.0,
                      "replies": [
                        {
                          "id": "mom6ti6",
                          "author": "Tolucawarden01",
                          "body": "I certainly didnt. What was your point of brining an entirely unrelated point here?",
                          "score": 1,
                          "created_utc": 1745419405.0,
                          "replies": [
                            {
                              "id": "mom76ty",
                              "author": "None",
                              "body": "[removed]",
                              "score": -1,
                              "created_utc": 1745419514.0,
                              "replies": [
                                {
                                  "id": "mom7l5h",
                                  "author": "Tolucawarden01",
                                  "body": "Jesus christ dude the fuck is your problem. Get a job",
                                  "score": -2,
                                  "created_utc": 1745419632.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "molqtb2",
          "author": "Emekasan",
          "body": "The Switch 2 could be a $1000 with $150 games and people would still buy it en mass.",
          "score": 3,
          "created_utc": 1745414316.0,
          "replies": [
            {
              "id": "molwvd9",
              "author": "AStringOfWords",
              "body": "Neo Geo enters the chat",
              "score": 3,
              "created_utc": 1745416355.0,
              "replies": []
            },
            {
              "id": "molvr57",
              "author": "ChrisBtheRedditor",
              "body": "Yes this is true. Gamers are idiots especially Nintendo fanboys. They'll buy anything with a Nintendo logo on it.",
              "score": -6,
              "created_utc": 1745415989.0,
              "replies": [
                {
                  "id": "momretz",
                  "author": "error521",
                  "body": "Yeah that's why the Wii U did so well",
                  "score": 1,
                  "created_utc": 1745425423.0,
                  "replies": [
                    {
                      "id": "mon279u",
                      "author": "ChrisBtheRedditor",
                      "body": "Don't forget the Pokemon mainline games.",
                      "score": -1,
                      "created_utc": 1745428533.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "molt2qn",
          "author": "Pokedudesfm",
          "body": "I suppose 80 is ~100. So 80 is also ~70, which people are okay with. I guess.",
          "score": 2,
          "created_utc": 1745415093.0,
          "replies": [
            {
              "id": "moluw7n",
              "author": "ChrisBtheRedditor",
              "body": "Lol you think we're paying RRP for our games?",
              "score": -1,
              "created_utc": 1745415707.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mona9o2",
          "author": "replus",
          "body": "This is in Japan, though, where there isn't quite the same notion of a fixed $70 (ex-$60) price tag for AAA games. The game pricing structure is probably not as unsettling to Japanese customers, who have been accustomed to games sometimes costing this much for a while now. For example, Monster Hunter Wilds just launched at 9,990 yen, the same price as Mario Kart World.",
          "score": 1,
          "created_utc": 1745430797.0,
          "replies": []
        }
      ]
    }
  ]
}