{
  "post": {
    "title": "Apple Launched the Controversial 'Trashcan' Mac Pro 11 Years Ago Today",
    "author": "chrisdh79",
    "id": "1hiibrh",
    "score": 1085,
    "created_utc": 1734696140.0,
    "selftext": "",
    "num_comments": 130,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hiibrh/apple_launched_the_controversial_trashcan_mac_pro/"
  },
  "comments": [
    {
      "id": "m2yy86y",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1734696141.0,
      "replies": []
    },
    {
      "id": "m2z4bz9",
      "author": "lawndartdesign",
      "body": "That machine made me a lot of money as a freelance animator. It was worth every penny at the time. I still have it sitting on a shelf.",
      "score": 579,
      "created_utc": 1734699250.0,
      "replies": [
        {
          "id": "m2zeyft",
          "author": "nomadwannabe",
          "body": "It made a perfect portable editing / transcode unit when I used to work freelance film/tv. I had a little pelican case for it!\nNow I run a server on it, still chugging away!",
          "score": 191,
          "created_utc": 1734703764.0,
          "replies": [
            {
              "id": "m2zfsv9",
              "author": "lawndartdesign",
              "body": "Yep when I'd travel I had a pelican case that would fit a wireless keyboard, mouse, and cables. It was a great machine let down by no official upgrade support. \n\nI now have a fully maxed out Mac Studio that work provided and it's essentially the spiritual successor to the tube/trash can.",
              "score": 58,
              "created_utc": 1734704099.0,
              "replies": [
                {
                  "id": "m32d2ef",
                  "author": "Cloudraa",
                  "body": "i just replaced two of the trashcans with mac studios for a client lol, it really feels like the next gen version",
                  "score": 17,
                  "created_utc": 1734741128.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m323373",
              "author": "sryidc",
              "body": "I have one as my plex server and it’s awesome. I always liked how they looked.",
              "score": 8,
              "created_utc": 1734737161.0,
              "replies": []
            },
            {
              "id": "m339ji6",
              "author": "whatlineisitanyway",
              "body": "Oh that is a good idea. Doubt I could sell it for much. This would be a good use.",
              "score": 2,
              "created_utc": 1734754898.0,
              "replies": [
                {
                  "id": "m33j7pj",
                  "author": "nomadwannabe",
                  "body": "Yeah they don’t go for a whole lot sadly. I used it to learn proxmox, now I have AdHuard home, Plex and Home Assistant chugging along beautifully and kept my little trash can with purpose :)",
                  "score": 2,
                  "created_utc": 1734759854.0,
                  "replies": [
                    {
                      "id": "m34m68q",
                      "author": "whatlineisitanyway",
                      "body": "Nice. A friend convinced me to build my first PC and I still feel a dirty about it 😆. I swear the little guy knows and has been acting up more because of it. Would be good to let it know it will still have a purpose.",
                      "score": 1,
                      "created_utc": 1734784397.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2zh6uv",
          "author": "Spidaaman",
          "body": "How useful would one be today? I use a 2018 Mac mini as a media hub. I’m sure it would be overkill for that though.",
          "score": 16,
          "created_utc": 1734704648.0,
          "replies": [
            {
              "id": "m2zjcmf",
              "author": "lawndartdesign",
              "body": "It’s probably hard to justify one over a new m4 Mac mini these days. Back in 2014 they were absolutely great and as a freelancer it was my FIRST big purchase as far as tools go.",
              "score": 25,
              "created_utc": 1734705484.0,
              "replies": [
                {
                  "id": "m3216vh",
                  "author": "DepthHour1669",
                  "body": "https://browser.geekbench.com/macs/mac-pro-late-2013-intel-xeon-e5-1620-v2-3-7-ghz-4-cores\n\n751 single core, 2624 multi core\n\nModern M4 mac mini:\n\nhttps://browser.geekbench.com/v6/cpu/8853585\n\n3711 single core, 14678 multi core\n\nSo a modern M4 mac mini is about 7-9x faster.",
                  "score": 24,
                  "created_utc": 1734736421.0,
                  "replies": [
                    {
                      "id": "m33gvj4",
                      "author": "x925",
                      "body": "A new mac m4 mini isnt outrageously more expensive for the base model compared to a used 2013 mac pro, it is over twice the price, but a $600 new pc that is much faster than a ~$250 used desktop isnt terrible.  A 2018 mac mini for $300 with an i7 and thunderbolt might be a better option for some.",
                      "score": 5,
                      "created_utc": 1734758555.0,
                      "replies": []
                    },
                    {
                      "id": "m7m5q6d",
                      "author": "None",
                      "body": "Pretty much any modern processor is faster than the 12 year old CPU... even cheap x86 300€ laptops:\n\nhttps://browser.geekbench.com/v6/cpu/9969707",
                      "score": 1,
                      "created_utc": 1737115465.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2zvhfm",
              "author": "The-Rizztoffen",
              "body": "Maxed out trash can is barely better than a base m1 mini while eating much more power and being less reliable",
              "score": 25,
              "created_utc": 1734709802.0,
              "replies": []
            },
            {
              "id": "m30qual",
              "author": "InOutlines",
              "body": "I still use mine. Riding it til the wheels fall off. But lately I am running into compatibility issues. Its been years since Apple stopped including it in the latest OS updates, so mine is still in stuck in 2020 or so. And it doesn’t play well with many of the latest apps.",
              "score": 9,
              "created_utc": 1734720229.0,
              "replies": [
                {
                  "id": "m30yl4f",
                  "author": "hatfield_makes_rain",
                  "body": "Open Core Legacy Patcher works great to run newer OS on the Trashcan.  Despite fact Handbrake still can’t see the GPU’s for hardware encoding.  I love my trash can (3.5ghz 12 cores 128GB RAM and 2TB Assad) and am equally impressed newer Minis are faster.",
                  "score": 8,
                  "created_utc": 1734722829.0,
                  "replies": [
                    {
                      "id": "m313g4j",
                      "author": "InOutlines",
                      "body": "Thank you!!!",
                      "score": 2,
                      "created_utc": 1734724475.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m339rvr",
              "author": "whatlineisitanyway",
              "body": "Depends on what you want to do with it. Creative work? Not so much as you would have to run old versions of Adobe or Resolve. That said while it is showing its age mine still runs well and is as stable as the day I got it. That said there is better value out there now.",
              "score": 1,
              "created_utc": 1734755008.0,
              "replies": []
            },
            {
              "id": "m38izox",
              "author": "splitplug",
              "body": "I have one that I’ve been trying to sell.  Bought it from my office, but they removed the harddrive.  Not sure what to do with it.",
              "score": 1,
              "created_utc": 1734838992.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m32a2fx",
          "author": "Hoserposerbro",
          "body": "Bro I’m still using it full time. Video editor",
          "score": 3,
          "created_utc": 1734739929.0,
          "replies": [
            {
              "id": "m384xwd",
              "author": "thinvanilla",
              "body": "Without sounding condescending, why would you subject yourself to that??? The M4 Mac mini outperforms it today.",
              "score": 4,
              "created_utc": 1734832742.0,
              "replies": [
                {
                  "id": "m39n3dl",
                  "author": "Hoserposerbro",
                  "body": "Not condescending. M4 Mac mini is the first time I’ve considered upgrading only because premiere no longer supports my system and they’re not that big of an investment since the lower tier can work for what I do. But I’m an avid editor and never had a slow down or a problem since I work low rez. Even gfx work is still okay. THE MAIN REASON that an upgrade is unnecessary at moment is that, since Covid, everything is remote and I’m simply logging into a system miles away that’s actually doing all the labor. I’m basically just streaming video.",
                  "score": 4,
                  "created_utc": 1734864252.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m33jk8y",
          "author": "FightSmartTrav",
          "body": "Mine started shutting down randomly without warning.  Something is corrupted in there.",
          "score": 2,
          "created_utc": 1734760043.0,
          "replies": []
        },
        {
          "id": "m38ney6",
          "author": "flux8",
          "body": "What do you think it would sell for today?",
          "score": 1,
          "created_utc": 1734841056.0,
          "replies": [
            {
              "id": "m3a5nqn",
              "author": "rathlord",
              "body": "You can easily check eBay to validate but a rough guess would be $150-$250.",
              "score": 1,
              "created_utc": 1734875416.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2zk5bn",
      "author": "Savings_Opening_8581",
      "body": "I worked for Apple at the time this was released to the public as a genius and was one of the first genius crews to learn how to disassemble and repair it. \n\nIt straight up felt like disassembling an IED and would explode at any moment. \n\nGlad they moved away from this design.",
      "score": 213,
      "created_utc": 1734705784.0,
      "replies": [
        {
          "id": "m3163hi",
          "author": "will-this-name-work",
          "body": "Yeah, it was a brilliant design for cooling but not for expansion or repairing",
          "score": 51,
          "created_utc": 1734725372.0,
          "replies": [
            {
              "id": "m31cibh",
              "author": "Savings_Opening_8581",
              "body": "It wasn’t even that good at cooling tbh",
              "score": 47,
              "created_utc": 1734727578.0,
              "replies": [
                {
                  "id": "m33mkaf",
                  "author": "Shadowhawk109",
                  "body": "That's just Apple things.\n\n\nLooks pretty. \n\n\nFunctionally mid. \n\n\nRidiculously hard to repair/replace. \n\n\nExpensive as hell. \n\n\n11/10 next generation must buy ",
                  "score": 36,
                  "created_utc": 1734761736.0,
                  "replies": [
                    {
                      "id": "m34quk3",
                      "author": "Savings_Opening_8581",
                      "body": "I would argue they aren’t difficult to repair/replace if you know how to handle delicate computer parts properly and understand the build process. \n\nA lot of the time it’s like just putting an expensive puzzle together in a specific order, everything has its place. \n\nI could strip a MacBook Pro down to just parts and back together again in less than a half an hour after some practice. \n\nThe replacement parts are the difficult part to acquire if you’re not Apple themselves or an authorized repair dealer. \n\nThe rest, you’re bang on.\n\nOn your functionally mid point actually, I would like to add that I somewhat disagree. Hardware wise, yes they could be leaps and bounds better, but the software and the accessibility features alone that allow nearly any human on the planet to use their computers, regardless of physical or mental disabilities is quite astounding and it’s surprising they don’t charge more for the software alone.",
                      "score": 11,
                      "created_utc": 1734786760.0,
                      "replies": []
                    },
                    {
                      "id": "m3a65xu",
                      "author": "rathlord",
                      "body": "> Functionally mid\n\nAh yes, the batlecry of the Redditor riding the peak of the dunning Kruger wave. \n\nThese, like most Mac products, were excellent for the people they were meant for. \n\nPeople’s opinion’s about Apple probably chart almost 1:1 along the Dunning Kruger chart. You learn a bit about computers and think you’re an expert, you hate Apple for a bunch of really shallow reasons that sound good to average people. And then the more expertise or actual professional experience you have, the more likely you understand the point and that they do have their place.",
                      "score": 3,
                      "created_utc": 1734875655.0,
                      "replies": []
                    },
                    {
                      "id": "m37mqxv",
                      "author": "bigsquirrel",
                      "body": "In a thread full of professionals talking about how essential this computer was you make a comment like that?  “Functionally mid”…. Sure. \n\nThese computers aren’t made for you. You don’t get them, that doesn’t make millions of people and thousands of companies idiots.  If you play video games on your computer these are not for you.  Believe it or not most of the world uses their computers for work, the things you care about mean very little to them.",
                      "score": 3,
                      "created_utc": 1734825269.0,
                      "replies": [
                        {
                          "id": "m382tsv",
                          "author": "Shadowhawk109",
                          "body": "You're right, most of the world uses their computers for work.\n\nWhich is why most of the world uses Windows. *Especially* programmers and developers, who (gasp) make programs for the rest of the world. And I say that as a professional programmer who has tried using XCode of that era. Visual studio spanks that ass.\n\nI didn't start the \"being a dick\" contest with the whole \"believe it or not\" thing, but BELIEVE IT OR NOT, the world ain't just about video games, and your trashcan is proof Apple wasn't the be-all-end-all the cult thought it was then.",
                          "score": -2,
                          "created_utc": 1734831872.0,
                          "replies": [
                            {
                              "id": "m388f4i",
                              "author": "bigsquirrel",
                              "body": "My man it just shows how completely out of touch you are if you think most professional programmers are using fucking windows 🤣🤣🤣",
                              "score": 9,
                              "created_utc": 1734834205.0,
                              "replies": [
                                {
                                  "id": "m3az97y",
                                  "author": "CatInAPottedPlant",
                                  "body": "eh, I've worked as a software engineer in 5 different unrelated fields and companies so far and they've all used Windows for dev machines. we might have a couple specific teams using Linux but everyone else is on Windows. never seen a Mac, either. maybe it's different out in silicone valley but not where I'm at.",
                                  "score": 1,
                                  "created_utc": 1734886742.0,
                                  "replies": [
                                    {
                                      "id": "m3bpfkn",
                                      "author": "bigsquirrel",
                                      "body": "Mac’s are extremely common. Aside from being Unix even if you’re not doing server side stuff, if you’re developing for anything iOS you practically need one. It starts as maybe an extra computer you only use for development then slowly turns into your main machine. \n\nNot to make to many assumptions but are you basically developing for windows machines?",
                                      "score": 0,
                                      "created_utc": 1734895359.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m3bcpme",
                              "author": "positronik",
                              "body": "Bro programmers use macs too. In fact everywhere I've worked the other devs have been jealous of the devs who have a macbook instead of a Dell. VS Code works on macbook too. I do think Apple is overpriced but their products work well. The majority of programmers don't use them but artists, content creators, and music producers/composers prefer mac because of the software. \n\nYour vitriol is wild especially with how ass Windows 11 is.",
                              "score": 2,
                              "created_utc": 1734891276.0,
                              "replies": []
                            },
                            {
                              "id": "m39a064",
                              "author": "Mayor__Defacto",
                              "body": "Most people that use Windows for work do so because that’s what their company has issued to them. When given a choice most people pick a Macbook.",
                              "score": 3,
                              "created_utc": 1734854690.0,
                              "replies": [
                                {
                                  "id": "m3bdclq",
                                  "author": "positronik",
                                  "body": "As a programmer this has been my experience. It also wasn't strange to see computer science students use one. They have the same software/IDE's and the apple OS is snappy",
                                  "score": 1,
                                  "created_utc": 1734891482.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m3304v0",
          "author": "jenorama_CA",
          "body": "I left Apple in 2022. The last team I worked on did WiFi antenna performance testing. When the new Mac Pro was in development, we had to run legacy testing on the previous generation, which was this guy. None of us had any of these units, so I had to reach out to Continuation Engineering and rolled out of Wolfe 2 with 25 of these guys. I had to take one apart to perform some tests on it. Pretty neat design overall and I used one as my desktop admin for a long time. I might still have one at home too.",
          "score": 28,
          "created_utc": 1734750715.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2zpzdi",
      "author": "Dank_801",
      "body": "I personally loved the look of these",
      "score": 47,
      "created_utc": 1734707893.0,
      "replies": [
        {
          "id": "m32sccl",
          "author": "neeks84",
          "body": "Same. I’m considering buying a used one off Marketplace, they go for a couple or so bucks now. But I generally dig unconventional design.",
          "score": 8,
          "created_utc": 1734747413.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2z27jb",
      "author": "GenghisConnieChung",
      "body": "Say what you want about them, but mine has been rock solid for years and is still a pretty  good machine for recording/audio production. I was working on a pretty big mix last night and only hitting about 60% CPU usage. I’m sure on a new M4 that number would be much lower, but as long as it’s below like 90% I really don’t care.",
      "score": 63,
      "created_utc": 1734698233.0,
      "replies": [
        {
          "id": "m31bu3h",
          "author": "CrustyBappen",
          "body": "Utilisation and CPU speed are different things.",
          "score": -20,
          "created_utc": 1734727345.0,
          "replies": [
            {
              "id": "m321bqz",
              "author": "Temporary_Carrot7855",
              "body": "Did they say they weren't?",
              "score": 15,
              "created_utc": 1734736475.0,
              "replies": [
                {
                  "id": "m35cby3",
                  "author": "None",
                  "body": "Let him have his moment. it’s all he has to make himself happy. poor guy been waiting so long to finally share that information",
                  "score": 10,
                  "created_utc": 1734795587.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2z1jaq",
      "author": "superpj",
      "body": "I like this model now that it’s under $400 on eBay with pretty ok specs.",
      "score": 16,
      "created_utc": 1734697891.0,
      "replies": [
        {
          "id": "m33ac1s",
          "author": "whatlineisitanyway",
          "body": "Have they been selling for that? Am retiring mine and if I can't find a use for it I'd be thrilled with $400.",
          "score": 7,
          "created_utc": 1734755268.0,
          "replies": [
            {
              "id": "m33dvrn",
              "author": "superpj",
              "body": "The 12 core ones in good shape often do.",
              "score": 3,
              "created_utc": 1734756990.0,
              "replies": [
                {
                  "id": "m34lzvk",
                  "author": "whatlineisitanyway",
                  "body": "Yeah mine is only the six with everything else even the ram maxed. Was thinking more like $300 for that.",
                  "score": 5,
                  "created_utc": 1734784297.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m37f52l",
          "author": "f_14",
          "body": "You can find them going for $25 on govdeals.com auctions pretty regularly. ",
          "score": 4,
          "created_utc": 1734822190.0,
          "replies": [
            {
              "id": "m37kwlh",
              "author": "superpj",
              "body": "Oh neat.",
              "score": 2,
              "created_utc": 1734824514.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m31nx9g",
      "author": "Arcandys",
      "body": "A smaller 2025 version of this with Apple Silicon would slay. The design was soooo insane, i still love them, they slay.",
      "score": 10,
      "created_utc": 1734731504.0,
      "replies": []
    },
    {
      "id": "m2yyt7i",
      "author": "mumblesthemeek",
      "body": "It wasn't bad on paper. Just really expensive. About the only apple product that truly tried to innovate rather than steal ideas and market it as a new technology.",
      "score": 96,
      "created_utc": 1734696461.0,
      "replies": [
        {
          "id": "m2yzig0",
          "author": "drmirage809",
          "body": "And it just didn’t work as I high end workstation. The form factor for the high end workstation was perfected 30 years ago. Big case, lots of room for parts and cooling and we fill that room with the most powerful hardware we can put in there. \n\nHaving said that, the last Intel Mac Pro was a solid return to form and the Mac Studio is a solid successor.",
          "score": 56,
          "created_utc": 1734696835.0,
          "replies": [
            {
              "id": "m2z2lge",
              "author": "Economy-Bid8729",
              "body": "They still make the Mac Pro.  The last GOOD workstation they had was the old tower that migrated from the IBM POWER to Intel chips in the Lian Li rip off style case with solid upgradability.  \n\nWorkstations should be big a chonky with plenty of external facing slots of lots of IO and lots of internal slots for lots of juicy expansion cards, massive core count CPUs and GOBSSSS!!!! of memory and you should be able to swap out and upgrade all of this.  Dual sockets are nice as well.",
              "score": 18,
              "created_utc": 1734698421.0,
              "replies": [
                {
                  "id": "m2z59is",
                  "author": "danielv123",
                  "body": "The new mac studio has lots of expansion slots and the only thing you can put in them is basically pcie to nvme adapters",
                  "score": 14,
                  "created_utc": 1734699677.0,
                  "replies": [
                    {
                      "id": "m2zvn4n",
                      "author": "The-Rizztoffen",
                      "body": "Only real use case is nvme expansion and sound interfaces. Sad that you can’t do GPUs anymore. Would be rad as hell",
                      "score": 7,
                      "created_utc": 1734709856.0,
                      "replies": []
                    },
                    {
                      "id": "m2zklxa",
                      "author": "guzhogi",
                      "body": "And maybe networking cards",
                      "score": 2,
                      "created_utc": 1734705954.0,
                      "replies": []
                    },
                    {
                      "id": "m3060xj",
                      "author": "Iliyan61",
                      "body": "mac pro not studio but yeh",
                      "score": 2,
                      "created_utc": 1734713342.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2zcseu",
              "author": "Eruannster",
              "body": "I think it could have worked as an optional Mac \"Mini\" Pro or something, much like what the Mac Studio is now, for certain workflows and that had they retained the big chonker Pro as well. \n\n\nThey should also have supplied it with parts for longer than five minutes. If it was actually upgradeable (admittedly with Apple-specific parts) I think it would have done a lot better.",
              "score": 3,
              "created_utc": 1734702888.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2z4a2w",
          "author": "ouatedephoque",
          "body": "This is not unique to Apple, loads of companies improve on existing ideas. Samsung is another great example. \n\nApple seems to be the best at it and people like to hate them for it, especially on Reddit. \n\nApple haters are even more annoying than Apple fanboys.",
          "score": 28,
          "created_utc": 1734699226.0,
          "replies": [
            {
              "id": "m2zepx5",
              "author": "sylfy",
              "body": "Apple haters think they’re real original. The irony of it all.",
              "score": 12,
              "created_utc": 1734703669.0,
              "replies": [
                {
                  "id": "m2zfnk7",
                  "author": "mumblesthemeek",
                  "body": "What Irony?",
                  "score": 5,
                  "created_utc": 1734704040.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2zfjl8",
              "author": "mumblesthemeek",
              "body": "Yes but apple kinda has the patent on claiming old tech",
              "score": 6,
              "created_utc": 1734703997.0,
              "replies": [
                {
                  "id": "m35e2ev",
                  "author": "ouatedephoque",
                  "body": "I really don’t get why some people take issue with a company taking existing/old tech and improving on it. This is literally how we get great products. \n\nThink of cars, planes, boats, skyscrapers, I mean pretty much everything is an improvement of something that existed before. \n\nThe first iteration is never perfect either.",
                  "score": 4,
                  "created_utc": 1734796213.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2zx60s",
          "author": "HHegert",
          "body": "“Apple steals ideas”\nMeanwhile world’s biggest companies in the same area of business follow Apple’s decisions as fast as possible, some even mock them at first and then go and follow what they mocked Apple for.",
          "score": 24,
          "created_utc": 1734710365.0,
          "replies": [
            {
              "id": "m303r25",
              "author": "drmirage809",
              "body": "And so many of them kinda fail at stealing Apple's design. The only high end laptops I've seen that's really managed to clone what makes the Macbook Pro so good are Galaxy Books. Namely: A enormous trackpad that's pleasant to use. And even then, Windows is just kinda clunky on a trackpad. Mac OS seems more designed around using one of those.",
              "score": 8,
              "created_utc": 1734712591.0,
              "replies": []
            },
            {
              "id": "m31kcol",
              "author": "Celtictussle",
              "body": "Other companies innovate. Apple refines, and then everyone else falls in line with the standard.",
              "score": 1,
              "created_utc": 1734730263.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m313vvo",
          "author": "melancious",
          "body": "You Apple haters are wild",
          "score": 4,
          "created_utc": 1734724623.0,
          "replies": []
        },
        {
          "id": "m2yzlof",
          "author": "KrackSmellin",
          "body": "Since this BS model was joined, every subsequent model created has been over the top expensive.  Guess they’ve been making up for it ever since.",
          "score": 2,
          "created_utc": 1734696883.0,
          "replies": []
        },
        {
          "id": "m2z13vg",
          "author": "Initial_E",
          "body": "Anyone would take a look at it and know you can’t upgrade anything on it. At least the g4 cube had passive cooling as a thing.",
          "score": 2,
          "created_utc": 1734697673.0,
          "replies": [
            {
              "id": "m2zvx8n",
              "author": "The-Rizztoffen",
              "body": "Yeah you only have one drive (proprietary m2 ssd) and only easily upgradable thing is RAM. CPU upgrade is a pain and you are stuck with D300/500/700 GPUs",
              "score": 5,
              "created_utc": 1734709949.0,
              "replies": []
            },
            {
              "id": "m31ss04",
              "author": "Accomplished_Dark_37",
              "body": "Yeah, but the Cube was only 450mhz. I had one for a couple years, upgraded it with an OG Mac GeForce 3 card, but that got too warm before it failed one day. I had a dual 450mhz cpu to put in, but I threw in the towel bc it wasn’t worth the hassle. I’d love a trashcan Mac Pro  if I could get one on the cheap, using an old Mac pro 5,1 currently, but it’s overkill for what I use it for and very power hungry (dual 6 core cpus).",
              "score": 1,
              "created_utc": 1734733258.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2zvrza",
      "author": "Jkay064",
      "body": "Wow the 11th anniversary! Such a significant milestone. I’m certain looking forward to next year when they copy/paste this same article, but replace 11 with 12.",
      "score": 5,
      "created_utc": 1734709901.0,
      "replies": []
    },
    {
      "id": "m34es7w",
      "author": "BalerionSanders",
      "body": "I recognize all the weaknesses of the product, but like the G4 cube, I just can’t hate it 🤷‍♂️",
      "score": 3,
      "created_utc": 1734780023.0,
      "replies": []
    },
    {
      "id": "m37ypeg",
      "author": "rickie-ramjet",
      "body": "Just got a new Mac Pro tower to replace one of these. Still running my “trash Can” until I am sure everything crosses over. It’s been on day and night most of the time over 10 years. I subscribe to Adobe and it’s running the very latest, however it maxed out on Mac OS at Mohave…. At home, I have a 9500 and several G3’s and a G5 that all work great, just outlived technology. I love people who replace their windows machines every few years who say Mac’s  are over priced. I have a windows machine on my desk at work, third or 4th one since I got my Mac…. They have a large bin of windows machines to be recycled… but not my Mac… it’s the only one in the place lol.",
      "score": 3,
      "created_utc": 1734830155.0,
      "replies": []
    },
    {
      "id": "m2zdr0s",
      "author": "-Dixieflatline",
      "body": "I think this thing rubbed people the wrong way initially because workstation class PC's and MAC's before this were all about onboard expansion and ease of part replacement over form factor. That resulted in cavernous cases with tons of internal slots for RAM, PCI-Express cards, and SATA connectors/bays. But things changed between the G5 and this MAC Pro.  Efficiency started to outweigh old school brute force. No more dual CPU's. You no longer needed a spindle drive RAID array, and RAM density improved to a point you didn't require 8 ram slots to hit 16-32gigs. Also port/connector bandwidth had reached a point where workflow bottleneck was hardly an issue for many people (not all, but many). So having the older full size case might not have been as important moving forward. Really depended on the use/industry, but many working professionals were fine with this as-is. \n\nI think it was a mistake for Apple to pull back from dictating hardware relevance here and going back to a conventional PC case (well, as conventional as Apple does one). They have a history of telling consumers the correct path, and are mostly right about it. Ditching floppy discs, Flash, CD/DVD's, as a few examples of when they made the right calls, even if the general public didn't initially like it. Here, they developed an innovative quiet cooling solution with the main downside being lack of internal modularity, but that might not have even mattered to a lot of working professionals as the machine could have been configured quite powerful out of the box. The path ahead might make more sense to just replace the entire PC a few years down the line if it ends up being a company expense anyway, instead of just upgrading things piecemeal.",
      "score": 7,
      "created_utc": 1734703278.0,
      "replies": []
    },
    {
      "id": "m30ptve",
      "author": "FightOnForUsc",
      "body": "This always looked great but now with apple silicon might actually work well",
      "score": 2,
      "created_utc": 1734719892.0,
      "replies": []
    },
    {
      "id": "m31p01l",
      "author": "Fractured_Senada",
      "body": "They should bring it back. I just got a mac mini and I can easily see them updating the hardware inside for this design and it working for the studio if not a new pro line.\n\nI think this design was ahead of it's time. It always invoked more jet engine than trash can to me, but I definitely see how people call it a trash can.",
      "score": 2,
      "created_utc": 1734731886.0,
      "replies": []
    },
    {
      "id": "m31u4ik",
      "author": "scotianheimer",
      "body": "How is Phil Schillers ass these days?",
      "score": 2,
      "created_utc": 1734733757.0,
      "replies": [
        {
          "id": "m37fsxk",
          "author": "AdventurousTime",
          "body": "in…novating",
          "score": 1,
          "created_utc": 1734822456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m339f50",
      "author": "whatlineisitanyway",
      "body": "Will be retiring mine here in the next few weeks. That trashcan served me well. Only in the last few months has it really shown its age with no longer being able to update Adobe suite or Resolve.",
      "score": 2,
      "created_utc": 1734754842.0,
      "replies": []
    },
    {
      "id": "m38yua0",
      "author": "ryo4ever",
      "body": "Always wanted one but was sadly too expensive. I still rock with the 2012 Mac Pro though.",
      "score": 2,
      "created_utc": 1734847212.0,
      "replies": []
    },
    {
      "id": "m392e46",
      "author": "None",
      "body": "Another Jony Ive idiocy that got him one step closer to his eventual firing…",
      "score": 2,
      "created_utc": 1734849448.0,
      "replies": [
        {
          "id": "m39hu7h",
          "author": "beaglepooch",
          "body": "That and him being a bit of a tool.",
          "score": 2,
          "created_utc": 1734860388.0,
          "replies": [
            {
              "id": "m3clncw",
              "author": "None",
              "body": "Full of himself. He very nearly destroyed Apple after Steve died. While Cook allowed him to gang himself he’s caused plenty of damage …",
              "score": 1,
              "created_utc": 1734906202.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m30xr6k",
      "author": "None",
      "body": "I got one a few weeks ago. 6 core cpu and d700 graphics, 32gb ram and 500gb ssd. I updated it to 12 core cpu, 64GB ram and 1tb ssd, I added open core patcher now the mac running macOS sequoia. Without a problem getting updates etc.",
      "score": 3,
      "created_utc": 1734722542.0,
      "replies": [
        {
          "id": "m337mbv",
          "author": "KingOfConsciousness",
          "body": "Any special steps to swap the 6-core to 12-core? OS X recognized the new processor without any problems?",
          "score": 1,
          "created_utc": 1734754003.0,
          "replies": [
            {
              "id": "m33fwov",
              "author": "None",
              "body": "What I would recommend is get yourself some good quality thermal paste like artic mx6 and replace all the thermal paste on the cpu and the GPUs also take your time. There are loads of videos on YouTube showing how to update the cpu and thermal paste have a watch to see if you feel like you can do it. Also list of tools can be seen on the ifixit website for taking the Mac to bits. It’s a big job and few little connectors etc. the macOS and the device saw the new chip right away as it part of the list of ones it can take. So I upgraded the cpu, cleaned off all the old thermal paste of the GPUs and replaced it with good quality paste. The reason being the old paste would have been on from beginning so things move on and better paste comes out. I also replaced the battery for vram/bios br2032 you can get a cr2032 same size but they don’t last as long as the BR2032 which is in the device. I also gave it a good clean. It’s now running cooler. Things to watch out for are thermal pads coming off or sticking to heatsink you can put them back on not a problem, the bolts that hold the cpu can take the fixing with them not a problem they can go back in see videos on YouTube. As for the ssd I used an original ssd 1tb from an MacBook Pro it’s gives me about 1258.7mbps write and 1376.5mbps read the model: MZ-KPV1T00/0A4, 1TB SSUBX.\nI used an original because some people found you couldn’t use recover disk etc if you used a none apple one, (something like that) plus the machine see it. If you go for a non-apple you need an adapter and maybe a heatsink with the ssd, the apple one comes with heatsink on.  You can up the ram above the apple specs of 64GB to 128GB but that seems to slow the machine ram from 1866 to 1066 some people have notice that difference.\n\nAlso see links below. These should help you.\n\nhttps://blog.greggant.com/posts/2019/05/07/the-definitive-mac-pro-2013-trashcan-guide.html\n\nhttps://youtu.be/M3qeiA0MYl8?si=8pj2FFMXHEpyWkQl\n\nhttps://youtu.be/_XaZ2z7FEfA",
              "score": 2,
              "created_utc": 1734758040.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m333g3y",
      "author": "chitoatx",
      "body": "The cheese grater Mac Pro was the pinnacle of workstation design. The trash can workstation sacrificed upgradability for a gimmicky design which was a mistake Apple corrected with the latest Mac Pro.",
      "score": 2,
      "created_utc": 1734752144.0,
      "replies": []
    },
    {
      "id": "m2zhbuh",
      "author": "SureUnderstanding358",
      "body": "i still love the ID. respin it with apple silicon and modern thunderbolt and im in.",
      "score": 2,
      "created_utc": 1734704700.0,
      "replies": []
    },
    {
      "id": "m2zchkf",
      "author": "popeter45",
      "body": "I think it would have fared better if they called it similar to the Mac Studio rather than pro as the big thing with the pro was the PCIe expansion options that people were willing to shell out for",
      "score": 1,
      "created_utc": 1734702763.0,
      "replies": []
    },
    {
      "id": "m30byfg",
      "author": "grandcity",
      "body": "Mines still running strong. Mind you I updated the SSD and Ram four years ago.",
      "score": 1,
      "created_utc": 1734715303.0,
      "replies": []
    },
    {
      "id": "m30n3u1",
      "author": "derpinWhileWorkin",
      "body": "GONK!",
      "score": 1,
      "created_utc": 1734718989.0,
      "replies": []
    },
    {
      "id": "m30nofa",
      "author": "Parabolic_Ballsack",
      "body": "Still use mine! It can’t get software updates anymore but it’s still going strong.",
      "score": 1,
      "created_utc": 1734719179.0,
      "replies": []
    },
    {
      "id": "m30z0lb",
      "author": "firestar268",
      "body": "I still think it's a cool design. Terrible computer tho\n\nLol",
      "score": 1,
      "created_utc": 1734722973.0,
      "replies": []
    },
    {
      "id": "m31ljua",
      "author": "adilly",
      "body": "I used to work on these. An over engineered marvel.",
      "score": 1,
      "created_utc": 1734730678.0,
      "replies": []
    },
    {
      "id": "m31obkp",
      "author": "None",
      "body": "Can’t innovate: My ass!",
      "score": 1,
      "created_utc": 1734731643.0,
      "replies": []
    },
    {
      "id": "m32tjcp",
      "author": "fraghead5",
      "body": "Still have 3 of these in my garage, 12 core xeons",
      "score": 1,
      "created_utc": 1734747913.0,
      "replies": []
    },
    {
      "id": "m33bydf",
      "author": "dibidi",
      "body": "“can’t innovate anymore, my ass” is its legacy",
      "score": 1,
      "created_utc": 1734756035.0,
      "replies": []
    },
    {
      "id": "m33ey96",
      "author": "Fun-Hall3213",
      "body": "I used mine for 8 hours today.",
      "score": 1,
      "created_utc": 1734757536.0,
      "replies": []
    },
    {
      "id": "m33vrjf",
      "author": "julesthefirst",
      "body": "I remember that one, it came out right on my birthday. Kind of makes me want to get one just for my collection or something :P",
      "score": 1,
      "created_utc": 1734767414.0,
      "replies": []
    },
    {
      "id": "m34epcn",
      "author": "_B_Little_me",
      "body": "I still work on this machine. It’s still works great for me.",
      "score": 1,
      "created_utc": 1734779969.0,
      "replies": []
    },
    {
      "id": "m35r5gx",
      "author": "None",
      "body": "I wanted one of those. Too bad they don’t use that form factor anymore!",
      "score": 1,
      "created_utc": 1734800782.0,
      "replies": []
    },
    {
      "id": "m37gpmi",
      "author": "MamiphConcepts",
      "body": "I got to use one when I was doing my graphics art project it was a Machine loved it.",
      "score": 1,
      "created_utc": 1734822825.0,
      "replies": []
    },
    {
      "id": "m37qov1",
      "author": "mojoey",
      "body": "I still have mine it and works well, but it’s time to replace it.",
      "score": 1,
      "created_utc": 1734826842.0,
      "replies": []
    },
    {
      "id": "m37tkof",
      "author": "smashmouthftball",
      "body": "This runs my plex server now…it’s taken a licking but keeps on ticking!",
      "score": 1,
      "created_utc": 1734828000.0,
      "replies": []
    },
    {
      "id": "m38ddqf",
      "author": "chaosthunda5",
      "body": "They should really attempt to make this with apple silicon. They could even take more of our money by adding a proprietary gpu you can add to the PCIe slots 🤣",
      "score": 1,
      "created_utc": 1734836399.0,
      "replies": []
    },
    {
      "id": "m38qov7",
      "author": "ADrenalinnjunky",
      "body": "Still have one. It’s incredibly quiet. I have a very nice PC. It’s loud as hell comparatively",
      "score": 1,
      "created_utc": 1734842671.0,
      "replies": []
    },
    {
      "id": "m3a5dyo",
      "author": "rathlord",
      "body": "It was really only “controversial” according to the typical Mac hating, uneducated masses. It was a fine PC for what it was meant for and mostly was roasted by people who knew just enough to not know what they didn’t know about tech, which is kinda the sweet spot most people on reddit live in.",
      "score": 1,
      "created_utc": 1734875286.0,
      "replies": []
    },
    {
      "id": "m7m4h39",
      "author": "None",
      "body": "The \"Trashcan\" is Apple's epitome of their obsession of appearance over functionality.\n\nIts curved design over-complicated the component placement (the motherboard had to be divided in several parts) and probably made it more expensive, hotter and harder to repair/upgrade.\n\nIt worsened every aspect of a computer (key areas for **pro**fessionals) in exchange for looking arguably \"prettier\".\n\n[Phil Schiller bragged about how innovative it was...](https://www.youtube.com/watch?v=HujoDX_JZmY) but he was wrong: Things like Apple ARM CPUs are true innovations, whereas the trashcan was just an expensive meme.",
      "score": 1,
      "created_utc": 1737114848.0,
      "replies": []
    },
    {
      "id": "m2zmomp",
      "author": "MimseyUsa",
      "body": "These machines are less useful now than cheese grader towers. This was a poor design that looked really cool.",
      "score": 1,
      "created_utc": 1734706712.0,
      "replies": [
        {
          "id": "m2zx7pl",
          "author": "albanyanthem",
          "body": "Most 10 year old computers are less powerful than current models.",
          "score": 13,
          "created_utc": 1734710381.0,
          "replies": [
            {
              "id": "m2zxjga",
              "author": "MimseyUsa",
              "body": "Not even the current cheese graders. Original style from before trash cans. They had room to work inside them and were just a big box. Peak design imo.",
              "score": 0,
              "created_utc": 1734710492.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2zqwfs",
      "author": "bulyxxx",
      "body": "Apple unveiled its current Mac Pro in 2013, with a surprising external design — it’s a cute little trash can! — and an internal design that prohibited most expansion and tinkering. The company called it “the most radical Mac ever” and “our vision for the future of the pro desktop.”\n\nLongtime Apple product marketing SVP Phil Schiller, who revealed the computer, even sniped at critics that day, saying onstage, “Can’t innovate anymore, my ass!”",
      "score": 1,
      "created_utc": 1734708217.0,
      "replies": []
    },
    {
      "id": "m2z5xib",
      "author": "None",
      "body": "Why is tech journalism always the lowest of the barrel journalism? There’s so much innovation happening but all we hear is recycled garbage. When do you see an article talking about a 10 year old car’s release date?",
      "score": -4,
      "created_utc": 1734699978.0,
      "replies": [
        {
          "id": "m2z7ijj",
          "author": "SlightlyOffWhiteFire",
          "body": "Its a product aimed at artists and media professionals being written about for an audience of mostly tech workers and gamers. Theres a bit of a gap.",
          "score": 7,
          "created_utc": 1734700675.0,
          "replies": []
        },
        {
          "id": "m2zo2mn",
          "author": "Bitlovin",
          "body": "> Why is tech journalism always the lowest of the barrel journalism?\n\nI take it you don't read any sports journalism.",
          "score": 9,
          "created_utc": 1734707216.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2z4bxu",
      "author": "None",
      "body": "They launched the trashcan, and then they built their headquarters who looked like the top of a trashcan",
      "score": 0,
      "created_utc": 1734699250.0,
      "replies": []
    },
    {
      "id": "m2zczlh",
      "author": "tidycows",
      "body": "Jeez, I remember making fun of that thing like it was yesterday",
      "score": 0,
      "created_utc": 1734702968.0,
      "replies": []
    },
    {
      "id": "m2zz6g3",
      "author": "Suzzie_sunshine",
      "body": "I still have one. Runs photoshop ok. Now it's a Web browser machine",
      "score": 0,
      "created_utc": 1734711049.0,
      "replies": []
    },
    {
      "id": "m30ea1r",
      "author": "SofaSpudAthlete",
      "body": "Clearly I am behind. I didn’t realize they build their campus in this things image",
      "score": 0,
      "created_utc": 1734716074.0,
      "replies": []
    },
    {
      "id": "m3177ry",
      "author": "MattBrey",
      "body": "I was very into computers at the time and I don't remember this at all lmao. Maybe my brain is actually starting to fail me",
      "score": 0,
      "created_utc": 1734725754.0,
      "replies": []
    },
    {
      "id": "m3a5eg4",
      "author": "rathlord",
      "body": "It was really only “controversial” according to the typical Mac hating, uneducated masses. It was a fine PC for what it was meant for and mostly was roasted by people who knew just enough to not know what they didn’t know about tech, which is kinda the sweet spot most people on reddit live in.",
      "score": 0,
      "created_utc": 1734875293.0,
      "replies": []
    },
    {
      "id": "m2yzbm9",
      "author": "None",
      "body": "[deleted]",
      "score": -6,
      "created_utc": 1734696736.0,
      "replies": [
        {
          "id": "m2z0drw",
          "author": "Will2LiveFading",
          "body": "Pretty sure Apple didn't invent the PC case",
          "score": 6,
          "created_utc": 1734697297.0,
          "replies": []
        }
      ]
    }
  ]
}