{
  "post": {
    "title": "Second report corroborates iPhone’s fall from 1st to 3rd place in China | Increased competition from local brands is cited as one factor, the second being Apple’s inability to offer AI features in the country.",
    "author": "a_Ninja_b0y",
    "id": "1i6i42g",
    "score": 1930,
    "created_utc": 1737464644.0,
    "selftext": "",
    "num_comments": 209,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i6i42g/second_report_corroborates_iphones_fall_from_1st/"
  },
  "comments": [
    {
      "id": "m8cbtw8",
      "author": "cookingboy",
      "body": "It’s not AI features, it’s not like any of the Chinese brands are that great at AI either. The author of this article doesn’t know what they are talking about.\n\niPhone has always been a bit of a showy status symbol in China for the upper-middle class, after all you can easily buy a phone that does 80% the stuff for 30% the price.\n\nAnd that demographics have been moving to foldable phones, which is why the flagship model for *all* top brands in China is a folding phone.\n\nThere is a reason Huawei made a big deal about their tri-fold phone: https://youtu.be/Yv_S7KrOlfk?si=0GwgBByWzBO1fguE\n\nAll top brands are launching new foldable flagships this year: https://www.notebookcheck.net/All-of-China-s-top-five-phone-makers-to-launch-new-foldable-phones-in-2025.945894.0.html\n\nWell all top brands except Apple, and it’s hurting their sales. It doesn’t help that iPhones have been looking the same for years. \n\nIf the author just spent a single day visiting a few Apple/Xiaomi/Huawei stores in China they’d know why Apple is hurting.\n\n**Edit** Just looked up some data. China’s foldable phone sales went up 48% YoY for the first half of 2024: https://www.counterpointresearch.com/insights/chinas-foldables-sell-through-up-50-in-q1-2024-as-book-type-sales-nearly-double/\n\nAnd none of that went to Apple, obviously.",
      "score": 696,
      "created_utc": 1737464936.0,
      "replies": [
        {
          "id": "m8cihza",
          "author": "ZgBlues",
          "body": "Thanks, that makes much more sense, I have no idea why they crammed AI into the article, as if sales success of any smartphones is tied to that.\n\nAccording to the report Huawei and Xiaomi hold top two spots in whatever they chose to call “premium segment” (Huawei has the tri-foldable, and Xiaomi released a clamshell foldable).",
          "score": 164,
          "created_utc": 1737467456.0,
          "replies": [
            {
              "id": "m8cj4vs",
              "author": "cookingboy",
              "body": "> why they crammed AI into the article \n\nBecause AI gets clicks, simple as that.",
              "score": 117,
              "created_utc": 1737467685.0,
              "replies": [
                {
                  "id": "m8dk56m",
                  "author": "primaryrhyme",
                  "body": "This assertion that consumers care about AI is really annoying. Almost seems like astroturfing by tech companies but it’s likely just that AI gets clicks.\n\nWe saw these same articles about the iPhone 16’s poor sales and articles were blaming lack of AI. No, it’s just not much better than the last 3 gens so people don’t care.",
                  "score": 67,
                  "created_utc": 1737478844.0,
                  "replies": [
                    {
                      "id": "m8do4hy",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 11,
                      "created_utc": 1737479951.0,
                      "replies": [
                        {
                          "id": "m8dy93g",
                          "author": "primaryrhyme",
                          "body": "Yeah I agree with that sentiment. To push back a little, I feel that there must be some truly useful consumer applications for AI but we’re just not there yet whether that has to do with implementation or the models themselves. I definitely wouldn’t compare it to NFT’s which had literally no value to anyone.",
                          "score": 3,
                          "created_utc": 1737482714.0,
                          "replies": []
                        },
                        {
                          "id": "m8e3szv",
                          "author": "50calPeephole",
                          "body": "I'll be all in on AI the day I can go to Netflix and give it a prompt and have custom movies and series tailored to my exact specs.   \n  \nI don't need ai to skim my email and manage my calendar, I'm a functioning adult, I got that under control. You really wanna help me out? Do the fuckin dishes.",
                          "score": 4,
                          "created_utc": 1737484221.0,
                          "replies": [
                            {
                              "id": "m8hn16j",
                              "author": "code____sloth",
                              "body": "Maybe I’m reading that wrong but it sounds like you’re saying you want AI to generate movies and shows for you, which to me sounds like a fucking nightmare. The whole point of what makes movies good is that you’re being let into somebody else’s world for a while. Having a movie that is just the sum of a bunch of of your own inputs which is by extension your own beliefs and experiences will always produce dog shit lol\n\nBut yeah otherwise I agree, I don’t want AI to do the art so that I’m free to do more chores, I want to do the chores so that I’m free to do more art",
                              "score": 2,
                              "created_utc": 1737523529.0,
                              "replies": [
                                {
                                  "id": "m8ikoem",
                                  "author": "None",
                                  "body": "AI will become like cheaper film cameras did in the last century, bringing more entertainment creation options to the masses.\n\nNo one wants to have that conversation though, they just bandwagon and spit all over with nothing backing it except what they are told to hate",
                                  "score": 0,
                                  "created_utc": 1737542522.0,
                                  "replies": [
                                    {
                                      "id": "m8mpcrk",
                                      "author": "code____sloth",
                                      "body": "lol",
                                      "score": 1,
                                      "created_utc": 1737588637.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8dn3a1",
                      "author": "Safrel",
                      "body": "I refuse to buy anything AI.",
                      "score": 24,
                      "created_utc": 1737479665.0,
                      "replies": [
                        {
                          "id": "m8doqz3",
                          "author": "primaryrhyme",
                          "body": "It’s not even that for me, I work with AI a lot. If they could make Siri not suck that would be great for example (but you don’t need AI for that). I just don’t think there’s a compelling use case for phones yet or most consumer products. Summarizing articles/emails or touching up photos is frankly pretty worthless.\n\nMy point is that saying “consumers are clamoring for AI” is a fantasy since the tech companies can’t even figure out a compelling use case (for everyday consumers) themselves.",
                          "score": 25,
                          "created_utc": 1737480122.0,
                          "replies": [
                            {
                              "id": "m8fve15",
                              "author": "Simon_Bongne",
                              "body": "It's \"top down demand\" they need you to want it so they can be rich and do crime!",
                              "score": 4,
                              "created_utc": 1737501842.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8eg0rf",
                          "author": "aebulbul",
                          "body": "Love it or hate it, AI is here to stay. Those who choose to embrace it, even reluctantly will be at a much greater advantage than those who draw arbitrary lines in the sand. You’ve been using tech. You’ve shared your data, automation, machine learning and AI all existed before - maybe not as widespread. Why are you saying this now?",
                          "score": -5,
                          "created_utc": 1737487547.0,
                          "replies": [
                            {
                              "id": "m8eixyd",
                              "author": "Safrel",
                              "body": "Because AI as being used by the market right now is different from data, automation, and machine learning.\n\nThey are repackaging the same stuff I described and trying to pose it as some intelligent, adaptable product with a use case when none exists.",
                              "score": 11,
                              "created_utc": 1737488338.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8ktyql",
                      "author": "RottenPingu1",
                      "body": "I'll care about AI when it can book an appointment for me.... and it seems like it's not capable of that by a long shot.",
                      "score": 1,
                      "created_utc": 1737569938.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8gy0vh",
                  "author": "smspluzws",
                  "body": "Because AI writes about itself",
                  "score": 2,
                  "created_utc": 1737514117.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8do1ka",
              "author": "WestonP",
              "body": "> I have no idea why they crammed AI into\n\nThat's what you do with \"AI\" these days... you cram it into places where nobody asked for it, and it doesn't make sense.",
              "score": 10,
              "created_utc": 1737479928.0,
              "replies": [
                {
                  "id": "m8dpwla",
                  "author": "sblahful",
                  "body": "Reminds me of \"the Internet of things\" that was supposed to change the world ten years ago",
                  "score": 11,
                  "created_utc": 1737480437.0,
                  "replies": [
                    {
                      "id": "m8dtuie",
                      "author": "HectorJoseZapata",
                      "body": "And it just went:\n\n*-meh!*",
                      "score": 5,
                      "created_utc": 1737481520.0,
                      "replies": [
                        {
                          "id": "m8e5ng2",
                          "author": "Smartnership",
                          "body": "my toaster says this is misinformation",
                          "score": 12,
                          "created_utc": 1737484721.0,
                          "replies": [
                            {
                              "id": "m8e63g6",
                              "author": "HectorJoseZapata",
                              "body": "🤣",
                              "score": 4,
                              "created_utc": 1737484842.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8ffh2y",
                      "author": "AdmirableSelection81",
                      "body": "Well, i would argue at the industrial level, it did... not at the consumer level.",
                      "score": 3,
                      "created_utc": 1737497158.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m8dtqwu",
                  "author": "HectorJoseZapata",
                  "body": "Like putting an internet terminal into a refrigerator. Because when I want to eat something, I think of *the Internet*. \n\n\n/s",
                  "score": 6,
                  "created_utc": 1737481492.0,
                  "replies": [
                    {
                      "id": "m8e5rj6",
                      "author": "Smartnership",
                      "body": "That’s because the internet has so many cookies.",
                      "score": 8,
                      "created_utc": 1737484752.0,
                      "replies": [
                        {
                          "id": "m8eq3ab",
                          "author": "HectorJoseZapata",
                          "body": "*Touché*",
                          "score": 4,
                          "created_utc": 1737490286.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8i1h2x",
              "author": "rtb001",
              "body": "Xiaomi now has the added benefit of a massive ecosystem that goes way beyond phones, but might cover your entire home. Apple might tie your phone to iCloud, iPad, iMusic, iTunes, but Xiaomi will also give you TVs, air conditioners, robot vacuums, smart lamps, home security cameras, motorized shades, rice cookers, and now even a CAR! \n\nThe Xiaomi SU7 sports sedan has been one of the most successful EV launches in recent memory and not even a full year after its launch Xiaomi is already working their factory at 200% capacity, selling over 20,000 cars every month, and building their second factory as fast as they can.\n\nAnd all their stuff is fully connected to each other. Like you can be standing next to your Xiaomi rice cooker at home, and tell it to get your SU7 ready because you are going out soon, and by the time you go downstairs, the car is all ready to go with the air conditioning on and everything. Or you are driving the SU7 home, and you can just tell it to turn all your home appliances on. Or tell it to bring up a feed of your home security camera, and it will just pop up right on the car's center screen.\n\nApple got nothing that can compare to that.",
              "score": 7,
              "created_utc": 1737530892.0,
              "replies": []
            },
            {
              "id": "m8d2n44",
              "author": "twigboy",
              "body": "Scapegoating",
              "score": 4,
              "created_utc": 1737473921.0,
              "replies": []
            },
            {
              "id": "m8dqh8e",
              "author": "LucywiththeDiamonds",
              "body": "Two options. Because ai gets clicks or to blame the uNFaIR regulations of other markets.",
              "score": 2,
              "created_utc": 1737480594.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8cji01",
          "author": "Hottentott14",
          "body": "Even with an author who doesn't know what they're talking about, like this one, why would *AI* be the feature they choose when guessing wildly?? I've never in my life heard a real person be excited by AI features, it's just a huge, strange marketing push by manufacturers. I had no idea what the reason was, but would still be very confident AI wasn't it.",
          "score": 32,
          "created_utc": 1737467815.0,
          "replies": [
            {
              "id": "m8cjotd",
              "author": "cookingboy",
              "body": "AI in headline gets clicks.\n\nLike now we are discussing this article aren’t we? The author drove traffic to the site, mission accomplished.",
              "score": 15,
              "created_utc": 1737467881.0,
              "replies": [
                {
                  "id": "m8csc5w",
                  "author": "Hottentott14",
                  "body": "I'm discussing how bad it is without having even having read it, but perhaps you're right. I'm hoping this kind of sloppy journalism ls more negative than positive for the publication though. But I'm not very optimistic.",
                  "score": 6,
                  "created_utc": 1737470788.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8dcq2j",
              "author": "Ajreil",
              "body": "Speaking as someone who uses ChatGPT daily and is currently specking out a PC for generative AI... Putting AI in a phone is an *extremely* niche use case.\n\nLocal AI is more private, and sometimes has a faster response time (depending on if compute time or ping is the bottleneck), but most people don't care about either so it's just a slower LLM.\n\nAI is already the next big thing. Phone manufacturers want a piece of that pie and are trying to shove it into their phones so they're well positioned when something phone-worthy is invented. Users don't care.",
              "score": 1,
              "created_utc": 1737476797.0,
              "replies": [
                {
                  "id": "m8dp452",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1737480221.0,
                  "replies": [
                    {
                      "id": "m8e8v2n",
                      "author": "stellvia2016",
                      "body": "The latter thing you mentioned is basically what the indexed search is.",
                      "score": 1,
                      "created_utc": 1737485590.0,
                      "replies": []
                    },
                    {
                      "id": "m8dxcni",
                      "author": "Ajreil",
                      "body": "I've used ChatGPT to:\n\n* Suggest recipes based on what I have on hand, create copycat recipes for spice mixes based on an ingredient list, and generally bounce ideas off of while cooking. I do have to know enough about cooking to recognize terrible ideas.\n\n* Come up with proper nouns when writing. My prompt is typically something like \"List 20 proper nouns inspired by the following: Denesh, Ranuul, Myra, Kajir, Atraxi.\"\n\n* Find a word I've read before, but can't describe well enough to Google. I was trying to remember the term 'tolerance stacking' and Google was no help.\n\n* Suggesting music. If you give it a list of creators and a description of the music it can suggest similar musicians. For example \"Suggest some music with an epic beat, dark tone and haunting vocals. IE: the brothers bright, ruelle, oblivion by zayde wolf, and blues saraceno.\"\n\n* Write regex filters and autohotkey scripts. I can't be arsed to learn to code but occasionally find it useful.\n\nAI art is sort of impractical by definition. I just want to tinker with it.",
                      "score": 0,
                      "created_utc": 1737482465.0,
                      "replies": [
                        {
                          "id": "m8ea8fv",
                          "author": "stellvia2016",
                          "body": "And that's the rub: You mention a number of niche use-cases, and/or things you already need to know a decent amount about to make sure it's not giving you bad data or hallucinating.\n\nThe music suggestions are useful, but also a feature of basically any music service going back many years now.\n\nWriting the filters and scripts also requires babysitting the AI, or it may write regex that works but isn't very performant. But your specific examples I guess it helps that both of those haven't really changed much in syntax in a long time.\n\nSomething like C# or Dotnet in general is more of a nightmare due to how many revisions they've both had, and the learning set is going to have a lot of examples where they don't make it clear which version or framework it's for.",
                          "score": 2,
                          "created_utc": 1737485963.0,
                          "replies": [
                            {
                              "id": "m8eev9q",
                              "author": "Ajreil",
                              "body": "YouTube recommendations are pretty terrible but that's because they're trying to optimize watch time rather than satisfaction. ChatGPT is only better because I can give it different priorities.\n\nBut yes I agree. AI is very niche and adding it to phones is even more so. The article is flat out wrong.",
                              "score": 2,
                              "created_utc": 1737487232.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8dd4aw",
              "author": "wicodly",
              "body": "Because if Apple hadn’t implemented some form of AI it would be a whole different conversation. People are people. Reddit doesn’t reflect all people. Public perception without AI is that you’re behind, last gen, old. The next buying block of youth use ChatGPT for more things then ever. You can’t be stuck behind. Reddit swears they are logical and has their thumb on the pulse of the world. \n\nCompanies don’t want to be the next Black Berry or Nokia or Razr. \n\nEveryone already irrationally hates iPhones. If they, in 2025, still didn’t have any sort of AI. The hypocrisy would be huge but it would still kill their image. Best example the great megapixel race. Everyone knows now that more megapixels don’t mean better quality but if your android device didn’t have 12, then 24, then 30, then 48.",
              "score": 0,
              "created_utc": 1737476908.0,
              "replies": []
            },
            {
              "id": "m8dcv5c",
              "author": "youreallaibots",
              "body": "I never understood it either until I got a pixel 9. Now I ask it questions at least five times a day. I'm an entrepreneur in the process of starting businesses though so I always have some random technical questions that requires online research. ",
              "score": -3,
              "created_utc": 1737476836.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8cdkqa",
          "author": "None",
          "body": "[deleted]",
          "score": 34,
          "created_utc": 1737465628.0,
          "replies": [
            {
              "id": "m8cds8g",
              "author": "cookingboy",
              "body": "Foldable phone are great for media consumption, in some cases. I’ve seen people having it opened and watch Douyin (Chinese version of TikTok) on one side and chatting with people on WeChat on the other. Or use the whole big screen for photos or ebooks, not unlike a tablet.\n\nAnd it’s even better to show off that you have the most expensive class of gadget when you unfold it lol.\n\nSo yeah, a little bit from column A, a little bit from column B.\n\nIt’s also extremely popular among women, who carry those phones in their designer purses so the bulky size isn’t an issue.",
              "score": 94,
              "created_utc": 1737465710.0,
              "replies": [
                {
                  "id": "m8cj9zh",
                  "author": "leftiesrepresent",
                  "body": "So a Nintendo DS?",
                  "score": 15,
                  "created_utc": 1737467736.0,
                  "replies": [
                    {
                      "id": "m8cu2vk",
                      "author": "dvxvxs",
                      "body": "They are awesome for Nintendo DS emulation, that’s why I want one",
                      "score": 19,
                      "created_utc": 1737471336.0,
                      "replies": [
                        {
                          "id": "m8culno",
                          "author": "leftiesrepresent",
                          "body": "This is the first comment I've seen that makes any good arguments for them at all, that is a really good point I hadn't considered",
                          "score": 4,
                          "created_utc": 1737471498.0,
                          "replies": [
                            {
                              "id": "m8drf3w",
                              "author": "LucywiththeDiamonds",
                              "body": "Using a samsung flips for years now. I read alot of stuff on my phone but also want a smaller form factor. Also the gimmick of having an integrated \"tripod\"and the maincam as selfie cam is sometimes quite cool.\n\nDo i need a flip phone? Nah. But for my use its the most convenient option at a price segment i would be anyways.",
                              "score": 7,
                              "created_utc": 1737480855.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8hre0n",
                      "author": "Mozfel",
                      "body": "Worse: at least on a DS you don't have to deal with a creased screen",
                      "score": 1,
                      "created_utc": 1737525562.0,
                      "replies": []
                    },
                    {
                      "id": "m8cknvq",
                      "author": "cookingboy",
                      "body": "Or you know, like a foldable phone from the pre-smartphone era.",
                      "score": -10,
                      "created_utc": 1737468223.0,
                      "replies": [
                        {
                          "id": "m8cl2lp",
                          "author": "leftiesrepresent",
                          "body": "None of the stuff you listed applies to fold phones from the pre smart phone era. I think China skipped the razr phone, went straight to iPhones, and now folding is novel enough to be interesting there",
                          "score": 12,
                          "created_utc": 1737468364.0,
                          "replies": [
                            {
                              "id": "m8clzqk",
                              "author": "pattperin",
                              "body": "China and Asia had smart phones before the iPhone came out for sure. Had them before NA had smart phones. I remember a Japanese exchange student who stayed with my family had this crazy slide phone with a screen that allowed her to watch anime from back home over wifi. It had buttons to make calls and stuff but the screen slid up and turned 90 degrees to give you a wide-screen configuration. This was 2005ish I think?",
                              "score": 11,
                              "created_utc": 1737468682.0,
                              "replies": []
                            },
                            {
                              "id": "m8cw82r",
                              "author": "CringeGod101",
                              "body": "You seem to be struggling the concept, they aren’t using foldable phones like the old blackberry and razr, they’re using foldable phones like the Galaxy Z Fold. The Z fold is a smartphone with a seam in the middle that allows you to essentially double the size of your screen.",
                              "score": 3,
                              "created_utc": 1737472000.0,
                              "replies": [
                                {
                                  "id": "m8cxkqi",
                                  "author": "leftiesrepresent",
                                  "body": "I get the concept, the concept itself is just entirely silly to Americans is the part I think you are misunderstanding. They are seen in a similar fashion as 3DTVs, temporary tech with only niche uses at best, which ALSO makes the user look kind of silly in the act of using it.",
                                  "score": -4,
                                  "created_utc": 1737472412.0,
                                  "replies": [
                                    {
                                      "id": "m8d36xd",
                                      "author": "booppoopshoopdewoop",
                                      "body": "I think from what I saw on TikTok this week the truth is that Americans just don’t like it when the rest of the world doesn’t think that the way they do things is inherently better then everyone else tbh",
                                      "score": 7,
                                      "created_utc": 1737474082.0,
                                      "replies": [
                                        {
                                          "id": "m8d3k83",
                                          "author": "leftiesrepresent",
                                          "body": "Superior F O L D S",
                                          "score": 0,
                                          "created_utc": 1737474189.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m8cxrzk",
                                      "author": "CringeGod101",
                                      "body": "lol I am American and it makes total sense to me, a few of my friends even own them. I just don’t need to drop 1.2k for a new phone when I have one that functions. You are in the minority.",
                                      "score": 4,
                                      "created_utc": 1737472473.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m8cnptj",
                              "author": "cookingboy",
                              "body": "None of what I said applies to a Nintendo DS either, because a Nintendo DS isn’t a phone.\n\nI was simply pointing out that if you really want to use an analogy, you didn’t need to go outside lol.\n\nAnd I don’t think you need an analogy since these foldable phones are their own thing.\n\n> I think China skipped Razr phones \n\nNo they didn’t. China became the world’s largest cellphone market before iPhone was even invented.",
                              "score": 3,
                              "created_utc": 1737469267.0,
                              "replies": []
                            },
                            {
                              "id": "m8dp8ze",
                              "author": "Belaire",
                              "body": "I bought and used a Razr phone in China in 2005.",
                              "score": 1,
                              "created_utc": 1737480258.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8eaifw",
                  "author": "stellvia2016",
                  "body": "I suppose if they have money for that crap, they don't care that the crease is going to crack or otherwise get messed up within 12-18 months, because they'll just be buying the newest version by then...",
                  "score": 4,
                  "created_utc": 1737486037.0,
                  "replies": []
                },
                {
                  "id": "m8gecia",
                  "author": "LiGuangMing1981",
                  "body": ">It’s also extremely popular among women, who carry those phones in their designer purses so the bulky size isn’t an issue.\n\nOr in the case of one of Honor's foldables, they carry it *as* a purse, since it's got a carrying strap and a back design that makes it look like a small designer purse.",
                  "score": 1,
                  "created_utc": 1737507772.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8chsuu",
              "author": "Bennehftw",
              "body": "What’s not to like?\n\nI like smaller phones, but want a tablet sized thing to watch TV.\n\nInstead of being forced to have a giant phone to watch tv with",
              "score": 11,
              "created_utc": 1737467206.0,
              "replies": [
                {
                  "id": "m8cipfk",
                  "author": "cookingboy",
                  "body": "> What’s not to like \n\nA few things actually. First they are very expensive, and can easily hit $2000+.\n\nSecondly there are still lingering concerns with regard to durability of the screens/folding mechanism.\n\nFinally from what my friends told me, their battery life suck.",
                  "score": 31,
                  "created_utc": 1737467531.0,
                  "replies": [
                    {
                      "id": "m8d1e9u",
                      "author": "DonArgueWithMe",
                      "body": "I lived in China a while back but size wasn't a problem bacl then, bigger was better. There were people walking around talking on full-size tablets.\n\nThese are also intended to be flashy, show off pieces of tech. A high price tag (reminder it all costs a fraction as much there as it does here) is a good thing not a bad thing. \n\nThe political climate likely has an impact as well, our pres has spent most of a decade attacking them and stirring up trade wars so it makes sense they're moving to internal brands when possible.",
                      "score": 5,
                      "created_utc": 1737473555.0,
                      "replies": []
                    },
                    {
                      "id": "m8cjqh2",
                      "author": "Millennium1995",
                      "body": "And they’re thicker than a standard phone",
                      "score": 16,
                      "created_utc": 1737467897.0,
                      "replies": [
                        {
                          "id": "m8geum1",
                          "author": "LiGuangMing1981",
                          "body": "Not the newest models from Chinese manufacturers (e.g. Xiaomi, Honor, Oppo, etc), which are no thicker folded than an iPhone. \n\nJust because the US only gets the brick-like Samsung folding phone doesn't mean other manufacturers haven't advanced.",
                          "score": 3,
                          "created_utc": 1737507930.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m8d04lq",
                      "author": "Hubbardia",
                      "body": "\n>First they are very expensive, and can easily hit $2000+.\n\nUntrue. Chinese foldables are far cheaper. OnePlus Open launched at $1400 and currently retails around $1000. This is very normal.\n\n>Secondly there are still lingering concerns with regard to durability of the screens/folding mechanism.\n\nRight, concerns, sure. But so far there have been little to no complaints about the hinge breaking on any good foldable. It's not a concern anymore, but I understand the hesitation.\n\n>Finally from what my friends told me, their battery life suck.\n\nYour friends are wrong. Chinese foldables have great battery life and even better charging tech (80-100W).\n\nI'm not trying to say there aren't any issues with a foldable (heft and less protection being the primary downsides imo), just that your list isn't very accurate for Chinese foldables.",
                      "score": 12,
                      "created_utc": 1737473181.0,
                      "replies": [
                        {
                          "id": "m8d1cqo",
                          "author": "cookingboy",
                          "body": "$1000 *is* expensive for a phone in China (or anywhere), especially for a “budget” brand like OnePlus. \n\nAnd I said they *can* hit $2000+, not that they all start at $2000+.",
                          "score": -7,
                          "created_utc": 1737473543.0,
                          "replies": [
                            {
                              "id": "m8d2kzj",
                              "author": "Hubbardia",
                              "body": "But it's not expensive compared to an iPhone. That was the release price of iPhone X, a phone released *7 years ago*.",
                              "score": 11,
                              "created_utc": 1737473904.0,
                              "replies": []
                            },
                            {
                              "id": "m8drw7o",
                              "author": "LucywiththeDiamonds",
                              "body": "Iphone start at 1300$ in most countries for the most basic crap 60hz screen model. Your point?",
                              "score": 7,
                              "created_utc": 1737480984.0,
                              "replies": []
                            },
                            {
                              "id": "m8gf0bo",
                              "author": "LiGuangMing1981",
                              "body": "When compared to iPhones with similar specs, modern folding phones in China are no more expensive.",
                              "score": 1,
                              "created_utc": 1737507981.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8cnccp",
                      "author": "MisterDonutTW",
                      "body": "The Chinese phones are cheaper than Samsung/Google's and have better batteries too.",
                      "score": 2,
                      "created_utc": 1737469140.0,
                      "replies": []
                    },
                    {
                      "id": "m8ckwxb",
                      "author": "Oddity_Odyssey",
                      "body": "And the crease. They all have a crease. Who wants that?",
                      "score": -3,
                      "created_utc": 1737468309.0,
                      "replies": [
                        {
                          "id": "m8cwgwz",
                          "author": "iwanttodrink",
                          "body": "No one notices the crease unless they're specifically looking for it. It's pretty much invisible when you're using it",
                          "score": 11,
                          "created_utc": 1737472076.0,
                          "replies": [
                            {
                              "id": "m8eb7xd",
                              "author": "stellvia2016",
                              "body": "A friend had one and it was still very noticeable when I tried using it for a bit. Someone else online told me they've basically had every version of the Samsung Flip and the crease got damaged in one way or another on every single one of them. I don't know why he continues to buy them.",
                              "score": 1,
                              "created_utc": 1737486231.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8cxdht",
                          "author": "Atlas227",
                          "body": "It's not gen 1 anymore, it's gotten so so much better since then",
                          "score": 10,
                          "created_utc": 1737472351.0,
                          "replies": [
                            {
                              "id": "m93fazd",
                              "author": "Oddity_Odyssey",
                              "body": "It's still a plastic screen and you can still see and feel it. It's like carrying around a fisher price toy.",
                              "score": 1,
                              "created_utc": 1737815750.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m8d6krp",
                          "author": "GasolinePizza",
                          "body": "The crease is all but invisible if you're looking straight at the screen. People can see it really easily when looking at it from the side, but for the user it's basically not there.",
                          "score": 7,
                          "created_utc": 1737475053.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m8ckkvj",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1737468192.0,
                  "replies": [
                    {
                      "id": "m8co5uy",
                      "author": "Bennehftw",
                      "body": "I’m not a fan of the tablet mostly due to portability. I’d rather have a TV, a laptop, or a switch. \n\nI suppose if you’re into the tablet ecosystem, it has far less value.",
                      "score": 3,
                      "created_utc": 1737469418.0,
                      "replies": []
                    },
                    {
                      "id": "m8cq6m3",
                      "author": "Eruannster",
                      "body": "Yeah, same. I don't watch anything longer than like a few minutes on my phone because it's fiddly and I have to hold my arm out or awkwardly prop my phone up against something. And then the sound sucks so I have to go get my headphones and you know what, fuck it, I'll pull it up on my laptop or the TV.",
                      "score": 1,
                      "created_utc": 1737470089.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8ce2ct",
          "author": "NorysStorys",
          "body": "That and iPhones are very much a 2010s status symbol, these things fade away and change with time. Not many luxury goods stay at the pinnacle for anywhere near as long as the iPhone has but yeah, the fad is foldables now just like when phones went from bricks to flip phones in the 2000s",
          "score": 41,
          "created_utc": 1737465816.0,
          "replies": [
            {
              "id": "m8cgsez",
              "author": "KetoKilvo",
              "body": "Iphones are the new blackberries.",
              "score": 17,
              "created_utc": 1737466836.0,
              "replies": [
                {
                  "id": "m8clobu",
                  "author": "BFr0st3",
                  "body": "Woah woah woah. Idk about that one now",
                  "score": 9,
                  "created_utc": 1737468573.0,
                  "replies": [
                    {
                      "id": "m8co00g",
                      "author": "KetoKilvo",
                      "body": "Nor did people in 2012 with Blackberry",
                      "score": 18,
                      "created_utc": 1737469363.0,
                      "replies": [
                        {
                          "id": "m8d6l17",
                          "author": "bert93",
                          "body": "Come on. I was a blackberry fan and had one 2008 - 2012.\n\nTheir OS was basic, slow, missing major third party apps, required BIS for a compressed low quality internet connection.\n\nI knew and many others knew by 2012 they were doomed.",
                          "score": 7,
                          "created_utc": 1737475055.0,
                          "replies": [
                            {
                              "id": "m8e63m1",
                              "author": "Smartnership",
                              "body": "They learned the lesson the hard way… software really did eat the world.\n\nShiny clever hardware is great, but software is the real experience.\n\nJust ask carmakers with nice hardware and laggy interfaces.",
                              "score": 1,
                              "created_utc": 1737484844.0,
                              "replies": []
                            },
                            {
                              "id": "m8e97n5",
                              "author": "PlayingDoomOnAGPS",
                              "body": "Shit, by 2008, we already knew Blackberry would be cooked if they didn't adapt quickly. 2012 was just when we finally gave up hope of them adapting.",
                              "score": 1,
                              "created_utc": 1737485684.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8fimya",
          "author": "Car-face",
          "body": "Is it confidence in the product as well? A few Chinese friends (anecdotal, I know) historically had mainland family who basically wouldn't buy Chinese brands for big ticket items if they could avoid it - foreign brands were perceived as better, higher quality, etc. - you bought local for cheap stuff. \n\nI feel like that's changing as Chinese brands cement themselves as higher quality options across the market and the domestic perception around Chinese products starts to erode.",
          "score": 2,
          "created_utc": 1737498046.0,
          "replies": []
        },
        {
          "id": "m8i25ra",
          "author": "rtb001",
          "body": "Another major factor is that for Chinese consumers, it is much easier to MOVE OFF of iOS and go to Xiaomi or Huawei or Oppo or whoever. Western, and especially American consumers tend to be far more tied to the Apple ecosystem, and many American consumers seemingly will stay with iPhone purely for the blue (or is it green, I don't remember which) text bubbles on iMessage.\n\nBut the Chinese don't use iMessage. They literally spend 90% of their time on WeChat, and WeChat is gonna look and work the same whether it is on iOS, on an android based OS like Xiaomi HyperOS, or on Huawei's HarmonyOS. \n\nSo the Chinese consumer is far likely to be locked to any specific phone OS, and can more easily jump around between brands if they find a certain form factor or other hardware configuration they like better.",
          "score": 2,
          "created_utc": 1737531287.0,
          "replies": []
        },
        {
          "id": "m8cfjct",
          "author": "Deto",
          "body": "Wow, I thought the whole foldable thing was just a gimmick.  Interesting that it caught on in China, I wonder why?",
          "score": 3,
          "created_utc": 1737466372.0,
          "replies": [
            {
              "id": "m8cn1ig",
              "author": "Remic75",
              "body": "It is gimmicky, but people love flaunting it because it shows that you have money and does cool party tricks. Imagine walking down the street with an iPhone and you see someone with a $3,000 phone that can fold 3 times “just because it can”\n\nIf a phone could do backflips and cost more than an iPhone, that market would probably start to jump too",
              "score": 8,
              "created_utc": 1737469039.0,
              "replies": [
                {
                  "id": "m8cqj6h",
                  "author": "Eruannster",
                  "body": "Interesting. I was pretty much immediately turned off by foldable phones because a) holy shit that price tag b) wait, I can literally see the crease, that looks fucking stupid and c) so hold on, how many times can I fold this extremely expensive device before it breaks?",
                  "score": 2,
                  "created_utc": 1737470205.0,
                  "replies": [
                    {
                      "id": "m8d0stl",
                      "author": "Hubbardia",
                      "body": "\n>a) holy shit that price tag\n\nYou can get very good foldables around $1000, it's not that expensive.\n\n\n>b) wait, I can literally see the crease, that looks fucking stupid\n\n99% of times you can't \n\n>c) so hold on, how many times can I fold this extremely expensive device before it breaks?\n\nA million times. The rest of your phone will die before the hinge breaks",
                      "score": 7,
                      "created_utc": 1737473380.0,
                      "replies": [
                        {
                          "id": "m8d4jiq",
                          "author": "Eruannster",
                          "body": ">You can get very good foldables around $1000, it's not that expensive.\n\n\nI could also buy a much better non-foldable phone for that price. Also $1000 is \"not that expensive\" for a phone? I remember when flagships used to cost like $500-700 not that long ago...\n\n\n>99% of times you can't\n\n\n\\*Moves the phone around in the light* Yup, there it is. That's the crease. Also I can feel it while touching it.\n\n\n>A million times. The rest of your phone will die before the hinge breaks\n\n\n*Allegedly* a million times. Also if the screen/hinge breaks, that's probably going to be a very difficult and expensive part to replace.",
                          "score": -7,
                          "created_utc": 1737474474.0,
                          "replies": [
                            {
                              "id": "m8dsq6k",
                              "author": "LucywiththeDiamonds",
                              "body": "You clearly never use one for even a day. And much better at what? Most foldables use flagship hardware in all aspects. Usually the camera is slightly worse (but still a tier )which doesnt matter for many.\n\nI used 5 different foldables as my main phone in the last 5 years and youre just talking about atuff ypu dont know.",
                              "score": 9,
                              "created_utc": 1737481213.0,
                              "replies": []
                            },
                            {
                              "id": "m8giyuc",
                              "author": "awry_lynx",
                              "body": "lol like iPhone screens aren't stupid expensive to replace\n\nWe're comparing them to iPhones not sensible affordable phones remember",
                              "score": 3,
                              "created_utc": 1737509230.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m8cscav",
                      "author": "Remic75",
                      "body": "Same here. I never understood the hype behind it. My best guess as to why is that the market in china does not like each new phone every year to be the same as before but with “upgraded camera… specs… slightly different chassis.” The folding market definitely does not the rest of the world in a chokehold like that. \n\nI’m sure Apple’s going to do it eventually and try to have a ceaseless phone. It’ll be interesting to see if they’re rushing development because of declining sales.",
                      "score": 2,
                      "created_utc": 1737470789.0,
                      "replies": [
                        {
                          "id": "m8d1q79",
                          "author": "Hubbardia",
                          "body": "\n>I never understood the hype behind it.\n\nIt's one of those things that you gotta use to understand. There's so many advantages to owning a foldable that you realize when you actually start using it. Here are a few examples:\n\n* Media looks awesome, whether it be reading, watching videos, or showing someone pictures you clicked. Hard to go back once you get used to it.\n* You can prop it anywhere in different angles. You can open it halfway through to make it a small laptop for watching videos. You can use it in a tent mode when you're laying down to keep your hands free and use your phone.\n* You can turn on dual preview to show your subject what the picture will look like, which saves a ton of headache and reduces the tries you need to take to get good pictures.\n* Multitasking is amazing. Dragging and dropping files between different apps, watching videos and scrolling on reddit at the same time, etc.",
                          "score": 10,
                          "created_utc": 1737473652.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8f79d7",
              "author": "Spider-Thwip",
              "body": "I see this on reddit a lot. \n\nI live in the UK and I get no end of comments from people about my Galaxy Fold. People really love it when they see it in person. \n\nAlso refurbished folds drop in price so quickly, and still come with 2 year warranties.\n\nI paid like £799 for a Fold 4 just as the fold 5 was coming out. \n\nI love it, i'll upgrade to a fold 6 later this year when the 7 comes out.",
              "score": 3,
              "created_utc": 1737494938.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8cf2vb",
          "author": "Akrylkali",
          "body": "Also people don't have a lot of money to spend anymore from what I've heard. Not everyone is willing to afford the new iPhone.",
          "score": 2,
          "created_utc": 1737466200.0,
          "replies": [
            {
              "id": "m8ck6cc",
              "author": "cookingboy",
              "body": "You aren’t wrong. The Chinese economy is a bit soft at the moment and consumer spending is down in many areas.\n\nAlso in general the Chinese people are spending more on “experiences” and less on “stuff” now. Luxury spending is down but food/entertainment/travel spending is up.",
              "score": 14,
              "created_utc": 1737468051.0,
              "replies": [
                {
                  "id": "m8cl5s4",
                  "author": "Akrylkali",
                  "body": ">Also in general the Chinese people are spending more on “experiences” and less on “stuff” now.\n\nYes, that's also a big driving factor. \n\nWasn't there also this attempt last year to \"smear\" Apple as a company? Like, making it your patriotic duty to buy Huawei, or any of the other Chinese competitors? I know it failed massively, but I still remember these videos of people smashing their iPhone in protest.",
                  "score": -2,
                  "created_utc": 1737468395.0,
                  "replies": [
                    {
                      "id": "m8gf8qn",
                      "author": "LiGuangMing1981",
                      "body": "Not that I can remember, and I live in China.",
                      "score": 4,
                      "created_utc": 1737508055.0,
                      "replies": [
                        {
                          "id": "m8hkmsq",
                          "author": "Akrylkali",
                          "body": "My bad, the older you get, the more the concept of time becomes mixed up in your memories. It was actually five years ago, when Huawei was banned in the five eye states and other European countries.",
                          "score": 1,
                          "created_utc": 1737522481.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8g5oai",
              "author": "coludFF_h",
              "body": "The price of Huawei mobile phones is comparable to Apple. But Huawei’s market share has grown significantly",
              "score": 1,
              "created_utc": 1737505098.0,
              "replies": []
            },
            {
              "id": "m8cj6tv",
              "author": "walrusdoom",
              "body": "I reckon this is more of a driving factor than anything.",
              "score": 1,
              "created_utc": 1737467704.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8eefnq",
          "author": "mclovin_ts",
          "body": "That tri-fold looks sick",
          "score": 1,
          "created_utc": 1737487114.0,
          "replies": []
        },
        {
          "id": "m8g2h1g",
          "author": "Octabuff",
          "body": "Yeah. The lack of AI is just another problem on top of a pile already. Lack of innovation & design are two biggest things people complain about on Chinese social media. Not just foldable design, but camera, audio, screen, etc. Not to mention the rising Chauvinism fueled by the West",
          "score": 1,
          "created_utc": 1737504078.0,
          "replies": []
        },
        {
          "id": "m8g3rj7",
          "author": "Even_Reception8876",
          "body": "I do not want nor care about foldable phones. I don’t know any Americans who do. While it seems popular in China, I don’t think it would do nearly as well in the US. Not surprised Apple hasn’t invested and I doubt they will.",
          "score": 1,
          "created_utc": 1737504495.0,
          "replies": [
            {
              "id": "m8r1u4y",
              "author": "c_immortal8663",
              "body": "Don't fool yourself. It's a lie that Americans don't like Apple phones. Apple people prefer iPhones. Apple doesn't have a foldable phone, so Americans don't use foldable phones. Apple has a dominant position in the US market.",
              "score": 1,
              "created_utc": 1737651280.0,
              "replies": [
                {
                  "id": "m8sq4gt",
                  "author": "Even_Reception8876",
                  "body": "It’s a lie that Americans don’t like apple phones or did you mean foldable phones?\n\nI agree that apple is dominant in the US market. But I’m completely satisfied with my iPhone 14 max pro. I do not want a foldable phone. It’s a weird gimmick, while the technology is impressive and cool, I have zero need for it and I won’t be surprised if it disappears before the end of the decade. Just like how 3D tvs and curved tvs disappeared.",
                  "score": 1,
                  "created_utc": 1737667736.0,
                  "replies": [
                    {
                      "id": "m92f5sn",
                      "author": "c_immortal8663",
                      "body": "I bet if the Apple comes out with a foldable phone , it will be very popular",
                      "score": 1,
                      "created_utc": 1737797609.0,
                      "replies": [
                        {
                          "id": "m93keqj",
                          "author": "Even_Reception8876",
                          "body": "Maybe",
                          "score": 1,
                          "created_utc": 1737817499.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8g3wxq",
          "author": "xRyozuo",
          "body": "That’s crazy to me! I don’t think I’ve ever seen a folded phone, no one around me is interested in that (or me for that matter)",
          "score": 1,
          "created_utc": 1737504544.0,
          "replies": []
        },
        {
          "id": "m8k1bzn",
          "author": "geekwithout",
          "body": "Agree. AI means little to none. I think you nailed it with foldables AND iphones now feeling dated pretty badly.",
          "score": 1,
          "created_utc": 1737562162.0,
          "replies": []
        },
        {
          "id": "m8mwq6d",
          "author": "LestradeOfTheYard",
          "body": "Apple don’t innovate any more in a way consumers care about. I can only care about a camera so much and and their ChatGPT integration is poor.?",
          "score": 1,
          "created_utc": 1737590955.0,
          "replies": []
        },
        {
          "id": "m8f09ha",
          "author": "chesser45",
          "body": "Why do people want foldable phones? Are they the ones that are like a flip phone style or the ones that fold to make the screen bigger?",
          "score": 1,
          "created_utc": 1737493054.0,
          "replies": [
            {
              "id": "m8f7xzh",
              "author": "Spider-Thwip",
              "body": "Fold from normal phone size to tablet size.\n\nIt's great for media consumption, you can't see the crease if you look at it head on with decent brightness. \n\nI take a lot of photos and show people a lot of photos so being able to just show the larger screen is nice.\n\nWhen you go out to eat and they only have PDF menus, its nice.\n\nYou can use desktop websites, and it looks lots better than mobile sites.\n\nGreat for reading books.\n\nGreat for game emulation.\n\nA lot easier to multitask.",
              "score": 5,
              "created_utc": 1737495122.0,
              "replies": []
            },
            {
              "id": "m8gnxnl",
              "author": "HahaMin",
              "body": "Fold / book style foldable have higher average starting price, so status symbol is one of the factor. Productivity is another plus. Having two full sized apps side by side sounds like a good feature of the large screen.\n\n\n\nFlip / clamshell style foldable is more of a fashion and trendy phone for me. Its smaller size than normal phone when closed and can save space inside a pouch. The mini display is also useful when taking selfie.",
              "score": 2,
              "created_utc": 1737510811.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8czjeg",
          "author": "sibman",
          "body": "The Chinese government also made it a “patriotic” to use a Chinese branded phone.",
          "score": -10,
          "created_utc": 1737473006.0,
          "replies": [
            {
              "id": "m8d0flh",
              "author": "cookingboy",
              "body": "That’s just nonsense being spread by people.\n\nIf you have any proof of such material (actual comments, quotes, marketing etc) from the Chinese government please share, I’ve not seen any in any of the years I’ve been in China.",
              "score": 6,
              "created_utc": 1737473272.0,
              "replies": [
                {
                  "id": "m8d0qjq",
                  "author": "sibman",
                  "body": "Used to see it all the time when I would walk by phone shops in Fujian province.  It was in Chinese.\n\nWu mao much?",
                  "score": -6,
                  "created_utc": 1737473362.0,
                  "replies": [
                    {
                      "id": "m8d0wg0",
                      "author": "cookingboy",
                      "body": "I would love to see such material. I’ve never seen them in Shanghai.",
                      "score": 9,
                      "created_utc": 1737473409.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8cfped",
          "author": "correctingStupid",
          "body": "And what qualifies you to know more than the journalist?",
          "score": -12,
          "created_utc": 1737466434.0,
          "replies": [
            {
              "id": "m8cgob7",
              "author": "cookingboy",
              "body": "I’ve lived in Shanghai for over 10 years and I still go back almost once a year to visit friends and family. And a lot of them are in that exact demographic I talked about (well off upper middle class living in a tier-one city that’s traditionally Apple’s stronghold).\n\nPlus I follow this scene pretty closely due to me building my entire career in the field of mobile engineering. At one point I could tell you iPhone market share of the top markets just from memory lol. \n\nBut just in case I read the bio of the author: https://9to5mac.com/author/benlovejoy/\n\nAnd it doesn’t seem like he has any background or expertise when it comes to the Chinese consumer market. \n\nIn fact I didn’t see anything suggesting he’s more knowledgeable than I am on this topic.\n\nFinally, he provided zero source/citation for his claim that the AI feature is the reason of Apple’s sales issue in China. \n\nEdit: I provided more sources in my comment above, so don’t just take my words for it.",
              "score": 36,
              "created_utc": 1737466794.0,
              "replies": [
                {
                  "id": "m8gz2h8",
                  "author": "NineNen",
                  "body": "Ironically, his user name is correctingStupid. Blatantly believing an article without any critical thinking... Laughable.",
                  "score": 2,
                  "created_utc": 1737514464.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8cjva4",
      "author": "diacewrb",
      "body": "Their sales have been falling all over the world for a while now.\n\nhttps://www.bbc.co.uk/news/articles/c99zxzjqw2ko\n\nTheir AI ended up creating a huge headache when it started making up news stories and they had to suspend the service.\n\nhttps://www.bbc.co.uk/news/articles/cq5ggew08eyo\n\nEach new model is barely special any more, the cpu might be a bit faster, but there are hardly any new ground breaking features. Things like usb-c, they were forced to implement.",
      "score": 39,
      "created_utc": 1737467943.0,
      "replies": [
        {
          "id": "m8duiea",
          "author": "LucywiththeDiamonds",
          "body": "They also arent the best at anything (that matters) anymore. They stopped innovating long time ago. \n\nIf people want nonchinese top tier they get more for the money with samsung or pixel. If they just want hardware apple isnt leading at anything.  \nAnd the regular iphones are a joke. 900€ for a 128gb 60hz screen phone? Gtfo.   \nThe entire budget and middle market gets ignored by apple and at the premium tier they are average.",
          "score": 16,
          "created_utc": 1737481699.0,
          "replies": [
            {
              "id": "m8hzsrm",
              "author": "Mozfel",
              "body": "So in short, are Apple today's Vertu? Expensive because of brand logo & nothing else is special",
              "score": 3,
              "created_utc": 1737529956.0,
              "replies": []
            },
            {
              "id": "m8e775k",
              "author": "egguw",
              "body": "i don't know anyone who actually uses the 120hz display. personally i can go a day without charging on my 14pm if i lock 60hz, and would have to charge once if i switch to 120hz",
              "score": -6,
              "created_utc": 1737485143.0,
              "replies": [
                {
                  "id": "m8ectqc",
                  "author": "LucywiththeDiamonds",
                  "body": "Then something is wrong with your battery.my flip 6 which has a small battery due to the form factor easily last through the day.\n\nAnd the most of the apple users i know get the pro models for the display.",
                  "score": 4,
                  "created_utc": 1737486673.0,
                  "replies": [
                    {
                      "id": "m8f7b2k",
                      "author": "egguw",
                      "body": "84%. 14 pro max afaik does not have a small battery.\n\ni got the pro max model for the large screen and 3x optical zoom. my friends got the 15 and 16 for the 5x zoom.",
                      "score": 1,
                      "created_utc": 1737494951.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8ccaxd",
      "author": "randomIndividual21",
      "body": "Nobody ever  ask for or give a shit about AI on phone",
      "score": 146,
      "created_utc": 1737465126.0,
      "replies": [
        {
          "id": "m8cr1ej",
          "author": "Eruannster",
          "body": "I'm not entirely sure what this new AI push is supposed to actually *do* on my phone. \n\nSure, I get that the camera is doing some AI nonsense to my photos but that's nothing new, that's been happening for many years now. \n\n\nBut the whole \"it can write messages for you!\"-shtick just seems incredibly stupid because I still have to go read what it wrote for me (and probably change it, because it wasn't what I wanted to say) and in that time I could just write it myself from scratch. And with how absolutely stupid AI assistants like Siri or \\*shudder* Bixby are, they are nowhere near ready to perform any duties more complicated than setting a timer for five minutes or whatever.",
          "score": 35,
          "created_utc": 1737470371.0,
          "replies": [
            {
              "id": "m8gk2vx",
              "author": "GigabitISDN",
              "body": "The way it was explained to me was that someone said “I can use AI to generate music that I listen to every day.” And in response I said something like “but I already use DI.FM and Spotify to listen to music every day”. And their response was along the lines of “oh so just because something already exists, AI shouldn’t be allowed to do it? You are obviously anti-tech and anti-progress” and then a whole bunch of names.\n\nSo basically AI is mostly marketing hype and people get really, really, really angry when you point that out.\n\nIt reminds me of the 90s when you could just add an “e-“ or “.com” to your company name and people would *lose their minds* lining up to buy in. Because internet.",
              "score": 1,
              "created_utc": 1737509581.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8coibe",
          "author": "WeWereAMemory",
          "body": "I would pay good money to have a phone that explicitly *doesn’t* have AI features",
          "score": 12,
          "created_utc": 1737469533.0,
          "replies": [
            {
              "id": "m8csgsm",
              "author": "zuss33",
              "body": "Get an iPhone 12. I upgraded to iOS 18 to find that I’m not eligible for AI features lol. It’s a blessing and a curse.",
              "score": 5,
              "created_utc": 1737470829.0,
              "replies": [
                {
                  "id": "m8di6ia",
                  "author": "Knocka304",
                  "body": "Rare 12 user w",
                  "score": 4,
                  "created_utc": 1737478307.0,
                  "replies": [
                    {
                      "id": "m8e6erj",
                      "author": "Smartnership",
                      "body": "Hey.",
                      "score": 4,
                      "created_utc": 1737484928.0,
                      "replies": [
                        {
                          "id": "m8h409b",
                          "author": "Knocka304",
                          "body": "I have one too big bro i didnt mean it like that",
                          "score": 2,
                          "created_utc": 1737516132.0,
                          "replies": [
                            {
                              "id": "m8iyb91",
                              "author": "Smartnership",
                              "body": "In that case, let me rephrase.\n\nHey!",
                              "score": 2,
                              "created_utc": 1737549472.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8cdodl",
          "author": "MadOrange64",
          "body": "I would’ve killed to have the note calculator thing on my iPad back when I was in college. That’s it, iPhones don’t need this crap.",
          "score": 8,
          "created_utc": 1737465666.0,
          "replies": [
            {
              "id": "m8g4lyx",
              "author": "xRyozuo",
              "body": "For me the game changer was being able to select text in photos. I have no idea when that happened but discovered it a year or two ago",
              "score": 2,
              "created_utc": 1737504764.0,
              "replies": []
            },
            {
              "id": "m8cfzas",
              "author": "dropthemagic",
              "body": "For real. Or the audio recording transcripts?! And Chat GPT, Grammarly. Man that would have been nice. Well the 2 day laptop battery too 🤣.",
              "score": 6,
              "created_utc": 1737466537.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8ew6cp",
          "author": "rustyjus",
          "body": "I dunno Siri is pretty effing stupid",
          "score": 3,
          "created_utc": 1737491956.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8ccxtu",
      "author": "TokyoDC",
      "body": "To be fair, Apple is unable to offer AI features in any country.",
      "score": 18,
      "created_utc": 1737465378.0,
      "replies": []
    },
    {
      "id": "m8cdet7",
      "author": "whitelimousine",
      "body": "It’s not the fucking AI. No one wants it. \n\nIt’s not even as accurate as just asking Siri for something\n\nA large language model based on someone that is fucking stupid",
      "score": 49,
      "created_utc": 1737465564.0,
      "replies": [
        {
          "id": "m8e6t9e",
          "author": "Smartnership",
          "body": "I asked Siri what your comment means.\n\nShe said, \n\n*Here are the websites I found about, “large Latvian models”*",
          "score": 5,
          "created_utc": 1737485036.0,
          "replies": [
            {
              "id": "m8efii6",
              "author": "Tangled2",
              "body": "Uh, link to what she found, please.",
              "score": 7,
              "created_utc": 1737487409.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8gu9qw",
          "author": "exotener",
          "body": "“I can’t do that while you’re in the car”",
          "score": 1,
          "created_utc": 1737512881.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8fmiyo",
      "author": "Mr_Piddles",
      "body": "AI features have literally nothing to do with it. Every model of iPhone is more or less the same to the average user. Why upgrade to the newest model if your current one is still working?",
      "score": 8,
      "created_utc": 1737499168.0,
      "replies": []
    },
    {
      "id": "m8cdgxu",
      "author": "kanabalizeHS",
      "body": "AI... Seriously?\n\nProbably lack of innavation in tech or design is the cause... Why upgrade when it is just a small incremental every year",
      "score": 14,
      "created_utc": 1737465588.0,
      "replies": []
    },
    {
      "id": "m8cms53",
      "author": "air_lock",
      "body": "Nobody gives a flying fuck about AI except those who are trying to sell it.",
      "score": 9,
      "created_utc": 1737468951.0,
      "replies": []
    },
    {
      "id": "m8ctn74",
      "author": "TheCh0rt",
      "body": "gray expansion fanatical rinse exultant tie fly sharp point run\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 4,
      "created_utc": 1737471199.0,
      "replies": []
    },
    {
      "id": "m8ezoca",
      "author": "LumiereGatsby",
      "body": "Really? It’s AI?\n\nCuz it’s not what’s boosting them here.",
      "score": 4,
      "created_utc": 1737492899.0,
      "replies": []
    },
    {
      "id": "m8e5ix3",
      "author": "pittypitty",
      "body": "Recall China putting in energy to ban iphones due to spying allegations? Missed something i guess.",
      "score": 3,
      "created_utc": 1737484687.0,
      "replies": []
    },
    {
      "id": "m8e6fap",
      "author": "brookish",
      "body": "Oh so THAT’s why Cook bent the knee.",
      "score": 3,
      "created_utc": 1737484932.0,
      "replies": []
    },
    {
      "id": "m8ew3mk",
      "author": "Dio44",
      "body": "Phones in China are amazing. Where are Apple devices are powerful, but basically look exactly the same every year the release cycles there seem to be based on driving innovation and customer choice.",
      "score": 3,
      "created_utc": 1737491936.0,
      "replies": []
    },
    {
      "id": "m8eyzpe",
      "author": "OldBrokeGrouch",
      "body": "There was a time when every year I had to get the newest iPhone.  Now I’m still on the 13.  I don’t think I’ll upgrade anytime soon.",
      "score": 3,
      "created_utc": 1737492718.0,
      "replies": []
    },
    {
      "id": "m8fplnk",
      "author": "Lyin-Oh",
      "body": "Lol AI. Maybe it's because of the lack of innovation, constant proprietary nickel and diming, and the fact that they make all their phones over there, so China just went ahead and undersold them on their own cheaper copies.",
      "score": 3,
      "created_utc": 1737500073.0,
      "replies": []
    },
    {
      "id": "m8hm7fz",
      "author": "CharacterEgg2406",
      "body": "The only reason Apple is as successful as it is in US at this point isn’t innovation rather that they keep you trapped in their ecosystem. They basically an Archon at this point, trapping my soul for eternity, and reincarnating me in the same damn phone time after time.",
      "score": 3,
      "created_utc": 1737523168.0,
      "replies": []
    },
    {
      "id": "m8cerqu",
      "author": "ElderTitanic",
      "body": "I don’t understand why’d you ever want ai slop on your phone",
      "score": 11,
      "created_utc": 1737466084.0,
      "replies": [
        {
          "id": "m8dvogd",
          "author": "LucywiththeDiamonds",
          "body": "Some stuff like google lens and translation features are really cool.i identified plants in the summer just by pointing my phone at them.Some of the photo editing i can also see beeing useful for some people.\n\nText generation based on keywords is also useful for the boring work emails.\n\nThere are usecases. Nothing that is essential for my life but nice to have.",
          "score": 2,
          "created_utc": 1737482013.0,
          "replies": []
        },
        {
          "id": "m8cjj5a",
          "author": "Agitated-Ad-504",
          "body": "People said the same thing about touchscreens and yet here we are",
          "score": -7,
          "created_utc": 1737467826.0,
          "replies": [
            {
              "id": "m8cox6j",
              "author": "Remic75",
              "body": "Only thing about touchscreens is that you couldn’t download an app that gives you a great touchscreen experience. \n\nEven if the phone can’t an AI feature natively, there’s so many AI apps that do that dismisses the need for Apple to create a very good on-device ChatGPT. That’s not what’s causing the sales drop. \n\nIt’s the folding market. People just like it because they look fancy and expensive. There’s a $3,000 phone that folds 3 times.",
              "score": 1,
              "created_utc": 1737469671.0,
              "replies": [
                {
                  "id": "m8d0ww4",
                  "author": "Agitated-Ad-504",
                  "body": "While I agree with some of what you said I’m confident that in the future those apps that use AI will all collapse into a single feature eventually. It’s like when cameras, GPS, and CD players slowly morphed into a single piece of tech.",
                  "score": 2,
                  "created_utc": 1737473413.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8cg8eh",
      "author": "nuelxostara_785",
      "body": "Apple needs to become more innovative in the future, they have relied heavily on apples brand equity whilst their products stall on innovation and creativity creating room for other brands to take over.",
      "score": 6,
      "created_utc": 1737466631.0,
      "replies": [
        {
          "id": "m8eifzq",
          "author": "Ashamed-Fig-4680",
          "body": "Steve Jobs died; seemingly whatever plan they had at that 10 years out mark has played out and they’ve not found a way to determine the next 10 all that much afterwards besides the same old playbook. \n\nFailed concepts, overpriced luxury tech nobody wants for their arm and leg, abandoned flagships…Apple left cheek is plumber butt.",
          "score": -2,
          "created_utc": 1737488203.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8cde4m",
      "author": "Winnipeg_Dad",
      "body": "Apple hasn’t shown the ability to offer decent AI in any country.",
      "score": 8,
      "created_utc": 1737465556.0,
      "replies": [
        {
          "id": "m8cgajj",
          "author": "dropthemagic",
          "body": "No company is offering any ai product that’s revolutionary in anyway. Just look at windows and their ai mess. Or meta, heck even google’s ai was screamingly slow and bad at their headset demo.",
          "score": 14,
          "created_utc": 1737466653.0,
          "replies": []
        },
        {
          "id": "m8e7dix",
          "author": "Smartnership",
          "body": "They historically wait, rather than be first mover, and then acquire or develop a stable version of the thing.\n\nThey’re behind, but based on music players, phones, etc. I wouldn’t be surprised if they rapidly catch up with a top level, stable product.\n\n\nThey’re the track star who hangs back and lets the others fight it out, then sprints past.\n\nOr it will be an AI Newton, they aren’t infallible.",
          "score": 1,
          "created_utc": 1737485191.0,
          "replies": [
            {
              "id": "m8efmyb",
              "author": "Winnipeg_Dad",
              "body": "They released Siri fifteen years ago.",
              "score": 1,
              "created_utc": 1737487443.0,
              "replies": [
                {
                  "id": "m8egb76",
                  "author": "Smartnership",
                  "body": "I agree, long overdue for an upgrade.\n\nIf they execute on this, it’ll be a long-tail boost to customer retention.\n\nIf they fail, it could be a turning point, seen in retrospect, as they slowly start to bleed users.   \n\n\nBut based on how many wins they have, it’s hard to bet against them. \n\nStatistics say they’ll *probably* get there.",
                  "score": 1,
                  "created_utc": 1737487624.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8d9mku",
          "author": "None",
          "body": "Just partner with ChatGPT. That’s all they had to do. Instead they’re too cheap and want sole ownership of everything they do.",
          "score": -1,
          "created_utc": 1737475926.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8espga",
      "author": "strange-brew",
      "body": "Nobody gives a shit about AI features except for execs trying to make money off of it.",
      "score": 5,
      "created_utc": 1737491011.0,
      "replies": [
        {
          "id": "m8gjc6q",
          "author": "Neo_Techni",
          "body": "and the marketing departments",
          "score": 3,
          "created_utc": 1737509346.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8dplda",
      "author": "Jorgen_Pakieto",
      "body": "Yeah I’m still waiting for apple intelligence to make it’s existence a bit more meaningful",
      "score": 2,
      "created_utc": 1737480352.0,
      "replies": []
    },
    {
      "id": "m8dusqb",
      "author": "TheQuadBlazer",
      "body": "IDGAF ABOUT CHINA",
      "score": 2,
      "created_utc": 1737481777.0,
      "replies": []
    },
    {
      "id": "m8dzv07",
      "author": "_ii_",
      "body": "I can’t convince myself to upgrade my 3 year old iPhone. I am not surprised that the Chinese could not find a compelling reason to upgrade this cycle either. Apple sucks ass in recent years. I only wish Google offers a better hardware so there is more competition.",
      "score": 2,
      "created_utc": 1737483152.0,
      "replies": []
    },
    {
      "id": "m8e8c87",
      "author": "Gullible-Bee-3658",
      "body": "I would assume the first is the local competition stealing Apple property to make as their own",
      "score": 2,
      "created_utc": 1737485452.0,
      "replies": []
    },
    {
      "id": "m8ehpjq",
      "author": "FortyYearOldVirgin",
      "body": "It was a fun ride. Sell your stock before the 30th.",
      "score": 2,
      "created_utc": 1737488004.0,
      "replies": []
    },
    {
      "id": "m8enusg",
      "author": "PuzzleheadedPainOuch",
      "body": "I refuse to believe any consumer actually gives a shit about AI.",
      "score": 2,
      "created_utc": 1737489669.0,
      "replies": []
    },
    {
      "id": "m8gqv12",
      "author": "OG-Drake",
      "body": "surely everyone in china is dying for shitty AI \"features\" on their phone",
      "score": 2,
      "created_utc": 1737511761.0,
      "replies": []
    },
    {
      "id": "m8hr9nw",
      "author": "XuX24",
      "body": "People in the US rarely see Chinese phones except the select few that are sold there. But there are a ton of them and they do try to innovate with a lot of different tech that Apple and Samsung barely touch.",
      "score": 2,
      "created_utc": 1737525503.0,
      "replies": []
    },
    {
      "id": "m8ila18",
      "author": "r3dm0nk",
      "body": "Why do they have an oblivion gate standing just like that",
      "score": 2,
      "created_utc": 1737542874.0,
      "replies": []
    },
    {
      "id": "m8ce5gx",
      "author": "w1n5t0nM1k3y",
      "body": "Its probably nothing to do with AI and just a general lack of value. iPhones are good, but even the minimum spec is pretty expensive. $800 for the cheapest current generation iPhone isnt cheap. \n\nYou can get Android phones for much cheaper. A good portion of people don't need a high end phone and will be just fine on a $400 or less phone. My current phone is almost 4 years old Samsung A52 and it does everything I need.",
      "score": 4,
      "created_utc": 1737465849.0,
      "replies": []
    },
    {
      "id": "m8cqslo",
      "author": "SEE_RED",
      "body": "We really are seeing the other side for Apple now... I like it.",
      "score": 4,
      "created_utc": 1737470290.0,
      "replies": []
    },
    {
      "id": "m8d3jpb",
      "author": "Budget-Competition49",
      "body": "I wish Apple would make a foldable iPhone, maybe this will be something that’ll push them to do so",
      "score": 3,
      "created_utc": 1737474185.0,
      "replies": []
    },
    {
      "id": "m8e35c5",
      "author": "realribsnotmcfibs",
      "body": "But the rest of Reddit news told me China treats US companies to the same standards as Chinese companies. \n\n/tiktok",
      "score": 2,
      "created_utc": 1737484044.0,
      "replies": []
    },
    {
      "id": "m8g36p6",
      "author": "GingeraleGulper",
      "body": "Yeah Apple’s AI sucks ass",
      "score": 2,
      "created_utc": 1737504308.0,
      "replies": []
    },
    {
      "id": "m8hwals",
      "author": "therealsoggi",
      "body": "Went from Android to IPhone, went right back again",
      "score": 1,
      "created_utc": 1737528065.0,
      "replies": []
    },
    {
      "id": "m8i7pgo",
      "author": "ryholm",
      "body": "What about ongoing problems with WeChat which is merely the most important app in China? So many software issues with the last few iOS iterations in China 🇨🇳. Can’t say I’m happy with my iPhone/iPad whilst in China.",
      "score": 1,
      "created_utc": 1737534548.0,
      "replies": []
    },
    {
      "id": "m8jdclt",
      "author": "SpectacularlyAvg",
      "body": "This can’t be true. What cell phone user craves AI? Did AI write this article?",
      "score": 1,
      "created_utc": 1737555053.0,
      "replies": []
    },
    {
      "id": "m8les9d",
      "author": "markofthebeast143",
      "body": "New iPhone innovation: Brings back the headphone jack 😭\n\nSales fly through the roof",
      "score": 1,
      "created_utc": 1737575472.0,
      "replies": []
    },
    {
      "id": "m8cfftp",
      "author": "Minionherder",
      "body": "Apple products are overpriced underpowered fashion accessories, I prefer an actual phone.",
      "score": -1,
      "created_utc": 1737466336.0,
      "replies": []
    },
    {
      "id": "m8cftup",
      "author": "bawlsacz",
      "body": "iPhones are often seen as a status symbol, similar to how people might drive luxury cars or wear expensive brand-name clothing to impress others. It’s too expensive for Chinese in China.",
      "score": 1,
      "created_utc": 1737466480.0,
      "replies": [
        {
          "id": "m8r3tla",
          "author": "c_immortal8663",
          "body": "Is the $1,300 iPhone 16 pro Max expensive, or is the $3,000 Huawei Mate XT more expensive?",
          "score": 1,
          "created_utc": 1737651820.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8ckcvm",
      "author": "Giodude12",
      "body": "Do that many people really care about the AI features?",
      "score": 1,
      "created_utc": 1737468115.0,
      "replies": []
    },
    {
      "id": "m8cmicc",
      "author": "Pp09093909",
      "body": "People here are mostly right about AI in iPhone being useless. But please understand that Chinese people now are pretty proud nowadays. And if the company focus their marketing around new AI functionality and then says that it will not be supported in your country then you don’t really buy it. Apple in China have a lot of competition and why you should buy the same product every year with castrated functional?",
      "score": 1,
      "created_utc": 1737468859.0,
      "replies": []
    },
    {
      "id": "m8h45lu",
      "author": "whlthingofcandybeans",
      "body": "Great news!  Now bring it to America.",
      "score": 1,
      "created_utc": 1737516182.0,
      "replies": []
    },
    {
      "id": "m8fp0ah",
      "author": "strangway",
      "body": "The average person was fine asking Google for answers. Using ChatGPT to ask Google stuff is like going back to the AskJeeves days; nobody wants a fake butler to Google shit for them.\n\nThe only people who asked for AI features in a phone are tech bros who work in software.",
      "score": 0,
      "created_utc": 1737499897.0,
      "replies": []
    },
    {
      "id": "m8h5ey6",
      "author": "buzzzerus",
      "body": "Android phones are also more comfortable to use. I\\`ve switched to iphone after android for half a year and still cant describe how pissed off i am at terrible auto-correct, dictionary and lack of \"back\" button as sometimes i am stuck with pop-up windows.",
      "score": 0,
      "created_utc": 1737516623.0,
      "replies": []
    },
    {
      "id": "m8d7kwi",
      "author": "farmadiazepine",
      "body": "iPhone screen responsiveness denominates every other phone in the market. There is no other phone which responds even closely to the iPhone.",
      "score": -8,
      "created_utc": 1737475338.0,
      "replies": [
        {
          "id": "m8dw4kb",
          "author": "LucywiththeDiamonds",
          "body": "Thats just no true. But i guess people have to believe something when they spend 900 for a 60hz phone.",
          "score": 3,
          "created_utc": 1737482134.0,
          "replies": []
        },
        {
          "id": "m8gjgvl",
          "author": "Neo_Techni",
          "body": "> denominates \n\n*dominates",
          "score": 1,
          "created_utc": 1737509388.0,
          "replies": []
        }
      ]
    }
  ]
}