{
  "post": {
    "title": "US FDA approves first-ever smart glasses with hearing aid for mild to moderate loss | Nuance Audio Glasses represent a novel entry into the med-tech segment by merging eyewear with hearing technology.",
    "author": "chrisdh79",
    "id": "1ihgce9",
    "score": 1382,
    "created_utc": 1738671468.0,
    "selftext": "",
    "num_comments": 102,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ihgce9/us_fda_approves_firstever_smart_glasses_with/"
  },
  "comments": [
    {
      "id": "mayxe28",
      "author": "Big_Rain2543",
      "body": "Optometrist, here. I looked into all their marketing. \n\nIt seems Nuance is mainly aimed toward people who may not have hearing aids already, have issues wearing hearing aids while wearing glasses, don’t like the look of hearing aids, etc..\n\nIt isolates and increases the volume of conversation and cancels background noise. Opticals would have a demo pair for customers to play with, much like the Ray-Ban Meta displays. They would simulate background noise by having the user wear a speaker around their neck.\n\nLike Meta, I would guess this is not going to be anyone’s main pair of glasses or hearing aids and I suspect charging issues. But likewise, there will be a small influx of people asking specifically for this device. Usually, it’s those who love dabbling in wearable tech and maybe people who know they are losing hearing but in denial about needing a hearing aid.\n\nAnd like for Meta, I bet some insurances will deny coverage.",
      "score": 40,
      "created_utc": 1738695576.0,
      "replies": [
        {
          "id": "mb3dmlk",
          "author": "Xikkiwikk",
          "body": "Hearing impaired here. People treat me like shit if I wear hearing aids. As soon as normal people see the hearings aids they start acting like I am below normal levels of intelligence. It is so frustrating and insulting so I just stopped wearing hearing aids. I would rather be treated normal and not hear everything than be treated like I have massive special needs. \n\nHearing aids aren’t cool and society has a lot of work to do with accepting them. Hearing aids disguised as glasses is a great solution. But fortunately I have great eyesight so no need for glasses.",
          "score": 11,
          "created_utc": 1738757715.0,
          "replies": [
            {
              "id": "mb4poje",
              "author": "rdyoung",
              "body": "You don't deserve to be treated like that but if you wanted to try something like this you could get one without a prescription, maybe they could even add transition tech to it too so it can double as sort of sunglasses.",
              "score": 5,
              "created_utc": 1738773701.0,
              "replies": [
                {
                  "id": "mb4q1zw",
                  "author": "Xikkiwikk",
                  "body": "Sadly that is a dream. No money for anything. I have to skip eating most days to survive.",
                  "score": 4,
                  "created_utc": 1738773807.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mb2i6us",
          "author": "BookDragon3ryn",
          "body": "I got hearing aids about sux months ago. I have to forgo my reading glasses when at the computer or risk pressure sores on my ears. Something like these glasses would be really helpful.",
          "score": 5,
          "created_utc": 1738739298.0,
          "replies": []
        },
        {
          "id": "mb1vcyt",
          "author": "Freybugthedog",
          "body": "If I still needed glasses and needed hearing aids I would look into these.  One less thing to keep track of.",
          "score": 1,
          "created_utc": 1738728809.0,
          "replies": [
            {
              "id": "mdb6csm",
              "author": "Dr---Strangelove",
              "body": "I tried them today. Pretty decent.",
              "score": 1,
              "created_utc": 1739824384.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mb21thz",
          "author": "FuzzyDwarf",
          "body": "> Like Meta, I would guess this is not going to be anyone’s main pair of glasses or hearing aids and I suspect charging issues.\n\nClearly, because I have no clue what I'm supposed to do for sunglasses. Buy two?",
          "score": 1,
          "created_utc": 1738731384.0,
          "replies": [
            {
              "id": "mc4zjdg",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1739252128.0,
              "replies": [
                {
                  "id": "mc53nab",
                  "author": "FuzzyDwarf",
                  "body": "I'm in the camp that hates transition lenses (and I don't want my indoor glasses polarized), and the clip-ons would probably cover the microphones?\n\nBut it's a moot point anyway because the battery life is ~8 hours, so imo they're a complete non-starter.",
                  "score": 1,
                  "created_utc": 1739254127.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mb3cetk",
          "author": "KamalaWonNoCheating",
          "body": "That's me",
          "score": 1,
          "created_utc": 1738757140.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mawu1pr",
      "author": "superdudeman64",
      "body": "Why do a feel like these are going to be recording everything to a corporate cloud server.",
      "score": 107,
      "created_utc": 1738672297.0,
      "replies": [
        {
          "id": "mayhvam",
          "author": "Dr-Paul-Meranian",
          "body": "*\"Merging eyewear with hearing technology\"* is dog-whistling for *\"mixing a camera with a microphone.\"*",
          "score": 32,
          "created_utc": 1738691273.0,
          "replies": [
            {
              "id": "maz04ap",
              "author": "HurriedLlama",
              "body": "Where's the camera coming from?",
              "score": 12,
              "created_utc": 1738696341.0,
              "replies": [
                {
                  "id": "maz2rh1",
                  "author": "No-Builder-1038",
                  "body": "Not saying that they will do this with these new glasses but there are smart glasses with cameras in them",
                  "score": 1,
                  "created_utc": 1738697080.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mb9on8k",
              "author": "FarhadTowfiq",
              "body": "\"You have to pay dearly and waive your rights to own this fantastic piece of technology\"",
              "score": 1,
              "created_utc": 1738836142.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mb0dxm6",
          "author": "Fecal-Facts",
          "body": "Because it will be.\n\n\nI wouldn't be shocked if they gave them away or sold that at a loss because of this.",
          "score": 2,
          "created_utc": 1738710974.0,
          "replies": []
        },
        {
          "id": "mgqxhk4",
          "author": "ghulican",
          "body": "Because Nuance was purchased by Microsoft for 19 Billion in 2021. \n\nYup, straight to an Azure Data Lake.",
          "score": 1,
          "created_utc": 1741468954.0,
          "replies": []
        },
        {
          "id": "max2lnh",
          "author": "arckeid",
          "body": "It looks like this is the price we have to pay to have nice gadgets, when they implement AR+AGENTIC AI with glasses everyone PROBABLY will use. It would be really nice to have an AI calculating food intake and exercise in real time.",
          "score": -5,
          "created_utc": 1738675700.0,
          "replies": [
            {
              "id": "mb05dee",
              "author": "josh_the_misanthrope",
              "body": "Or we could just have open source alternatives that do the same thing without potential spying.",
              "score": 4,
              "created_utc": 1738708271.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "maxmbbr",
      "author": "batido6",
      "body": "Sorry US FDA is no longer an agency under King Elon.",
      "score": 50,
      "created_utc": 1738682300.0,
      "replies": [
        {
          "id": "maxqhst",
          "author": "Exciting-Type-907",
          "body": "Yeah this sounds really woke helping deaf people so we’re out",
          "score": 27,
          "created_utc": 1738683546.0,
          "replies": [
            {
              "id": "may85vm",
              "author": "batido6",
              "body": "You lost them at “help people”",
              "score": 19,
              "created_utc": 1738688561.0,
              "replies": [
                {
                  "id": "mb0x840",
                  "author": "tiger331",
                  "body": "Why do you people have hate boners for someone or do you just do that so you can get upvotes from this hellhole of echoes about how those not on your side are bad",
                  "score": -12,
                  "created_utc": 1738717393.0,
                  "replies": [
                    {
                      "id": "mb102tg",
                      "author": "batido6",
                      "body": "I’ve talked to conservatives and attempted to understand the view point. At this point y’all are either blind to fascism or actively supporting it which I have no patience for. \n\nIf you want to be a stupid idiot and get robbed by the techno kings so be it but I won’t sit by and let them rob me, or destroy my beautiful country.",
                      "score": 9,
                      "created_utc": 1738718303.0,
                      "replies": [
                        {
                          "id": "mb15tbt",
                          "author": "tiger331",
                          "body": "So you wanted to be rodded by people who shouldn't be there in the first place",
                          "score": -11,
                          "created_utc": 1738720136.0,
                          "replies": [
                            {
                              "id": "mb1bcm2",
                              "author": "batido6",
                              "body": "Yes I’d rather be rodded by career civil servants than a 20-something big ball bro with admin access to OPM",
                              "score": 5,
                              "created_utc": 1738721933.0,
                              "replies": [
                                {
                                  "id": "mb1f6ml",
                                  "author": "tiger331",
                                  "body": "> career civil servants\n\nAh yes it 100% only those who robbing people because the news told me so",
                                  "score": -6,
                                  "created_utc": 1738723191.0,
                                  "replies": [
                                    {
                                      "id": "mb2fd37",
                                      "author": "batido6",
                                      "body": "What?",
                                      "score": 4,
                                      "created_utc": 1738737753.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mawz5nm",
      "author": "VincentNacon",
      "body": "This will flop.\n\nI do have hearing impairment and I do need hearing aids and I do wear glasses.  I never wished for both hearing aids and glasses to be combined because there are times I do need to take my glasses off but want to keep the aids on... and vice versa.\n\nHaving them combined means I have to give up both, not one.  Now imagine I have to recharge them and I can't wear the glasses part? Nor could I wear the glasses in the shower without the hearing aids.\n\nBTW, this isn't the first time a glasses and hearing aids have been combined, these existed back in the 70's.  My grandfather had one and he didn't really like it that much.\n\nHaving it being a \"smart glasses\" doesn't really make it more appealing to put up with the problem it has. Unless they can bring the price under $200... which is very doubtful. Regular hearing aids without all the fancy AI and Bluetooth for mild-to-moderate loss can cost more than $900... each.\n\nWouldn't surprise me if they price them beyond $3,000. No thanks.",
      "score": 30,
      "created_utc": 1738674408.0,
      "replies": [
        {
          "id": "max3kjo",
          "author": "loztriforce",
          "body": "How many conversations are you trying to have in the shower?",
          "score": 14,
          "created_utc": 1738676054.0,
          "replies": [
            {
              "id": "maxcq12",
              "author": "khan800",
              "body": "This was my question, plus as a glasses wearer for 50 years, I've never worn them in the shower.",
              "score": 7,
              "created_utc": 1738679239.0,
              "replies": [
                {
                  "id": "maxhrdn",
                  "author": "VincentNacon",
                  "body": "Who said you can't wear glasses in shower?",
                  "score": 4,
                  "created_utc": 1738680884.0,
                  "replies": [
                    {
                      "id": "maxwd81",
                      "author": "khan800",
                      "body": "Nobody said you CAN'T wear them, just can't possibly think of a reason I would.",
                      "score": 9,
                      "created_utc": 1738685240.0,
                      "replies": [
                        {
                          "id": "mb2jhkf",
                          "author": "StormCTRH",
                          "body": "I'm actually so blind that I can't see more than like 2 inches before everything's a blurry mess.\n\n... and I still take my glasses off in the shower.",
                          "score": 2,
                          "created_utc": 1738740038.0,
                          "replies": []
                        },
                        {
                          "id": "maxwst9",
                          "author": "VincentNacon",
                          "body": "Don't you like...  read the bottle or anything out of boredom?\n\nA blurry world in the shower is no fun.",
                          "score": 1,
                          "created_utc": 1738685366.0,
                          "replies": [
                            {
                              "id": "maxzxh0",
                              "author": "khan800",
                              "body": "Really, bored in the shower? It's a shower, not an entertainment experience.",
                              "score": 9,
                              "created_utc": 1738686258.0,
                              "replies": [
                                {
                                  "id": "mayjd5s",
                                  "author": "quite_gullible",
                                  "body": "I wish I could see how this thread ends, but the water's getting cold.",
                                  "score": 7,
                                  "created_utc": 1738691684.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mb0koih",
                              "author": "MoldyWorp",
                              "body": "I write with a sharpie whether shampoo or conditioner in large letters in bottle.",
                              "score": 1,
                              "created_utc": 1738713227.0,
                              "replies": [
                                {
                                  "id": "mb2mb3f",
                                  "author": "VincentNacon",
                                  "body": "The color/shape of the bottle normally helps but... lol.",
                                  "score": 1,
                                  "created_utc": 1738741686.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "maxt6tz",
                      "author": "Kromgar",
                      "body": "You... you do? It makes me deeply uncomfortable",
                      "score": 4,
                      "created_utc": 1738684328.0,
                      "replies": [
                        {
                          "id": "maxwbwa",
                          "author": "VincentNacon",
                          "body": "Yeah?\n\nlol .....*why* does it make you uncomfortable?",
                          "score": 2,
                          "created_utc": 1738685230.0,
                          "replies": [
                            {
                              "id": "maxy2qa",
                              "author": "Kromgar",
                              "body": "The sensation of warm water over my glasses feels vile.",
                              "score": 0,
                              "created_utc": 1738685732.0,
                              "replies": [
                                {
                                  "id": "maxzhfk",
                                  "author": "VincentNacon",
                                  "body": "![gif](giphy|5t9wJjyHAOxvnxcPNk)\n\n\n\n\n\n ...are we talking about eye-glass or spectacle-glasses?",
                                  "score": 3,
                                  "created_utc": 1738686132.0,
                                  "replies": [
                                    {
                                      "id": "may16fa",
                                      "author": "Kromgar",
                                      "body": "Those are the same thing???",
                                      "score": 4,
                                      "created_utc": 1738686609.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "may1k03",
                                  "author": "PistachioNSFW",
                                  "body": "You can feel your glasses now?\nAnd we’re the strange ones…?",
                                  "score": 3,
                                  "created_utc": 1738686716.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "maz1msl",
                      "author": "polopolo05",
                      "body": "I dont want to... my eyes will be closed for most of the time in the shower anyways.... Also I have hard water that builds up and lead to things like rust.",
                      "score": 1,
                      "created_utc": 1738696765.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "maxhf1p",
              "author": "VincentNacon",
              "body": "Zero?   I don't wear hearing aids to shower.\n\nI wear glasses in shower...  how did you get confused?",
              "score": 6,
              "created_utc": 1738680775.0,
              "replies": [
                {
                  "id": "mazo9ww",
                  "author": "Penguinkeith",
                  "body": "You wear glasses to the shower?",
                  "score": 4,
                  "created_utc": 1738703275.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "maz73i6",
          "author": "spookmann",
          "body": "You have a hammer.  You have a chisel.\n\nBut now there's something new.  CHAMMER!  It's a chisel-and-hammer in one!\n\nHow many times do you find yourself wanting to chisel something, and you're left standing there with hammer in hand but you can't find your chisel?  This will never happen again.  Our specially-designed hammer has a 1/2\" chisel built *right into the head!*  It's ready for use, no preparation, no fuss.  And best of all, no clean-up!\n\nOrder now and get the complete set of six hammers, each with its own chisel.  From the 1/8\" CHAMMER for detailed work, to the massive 1\" CHAMMER for those really big jobs.  No more excuses.  Every household needs a set.  \n\nAnd for the next 30 minutes, a very special offer.  Buy two sets and get the second one half-price.  Buy one for you, and one for your dad.  He'll love you for it, like he never did when you were a child.\n\n🎵 CHAMMER!  CHAMMER!  CHAMMER!  It's new! 🎵",
          "score": 2,
          "created_utc": 1738698303.0,
          "replies": []
        },
        {
          "id": "mb40oru",
          "author": "TheArmoredKitten",
          "body": "Bluetooth connectivity on modern hearing aids makes more sense than you'd expect. It makes them far more effective for making phone calls, and it makes them user configurable in the field instead of needing them professionally tuned by someone else.",
          "score": 2,
          "created_utc": 1738766375.0,
          "replies": [
            {
              "id": "mb43wds",
              "author": "VincentNacon",
              "body": "Yeah...   except it would bleed the battery life rather quick on the normal hearing aids batteries. I've had the option to use them before, sadly, it wasn't worth it at the time. I switched back to wired audio jack.\n\nNo idea how big the battery are on these glasses.",
              "score": 1,
              "created_utc": 1738767390.0,
              "replies": [
                {
                  "id": "mb6ou1c",
                  "author": "FuzzyDwarf",
                  "body": "I think hearing aids have been trending towards rechargeable batteries. Maybe that's the higher end models though, I'm not sure. Mine have always lasted all day even with heavy bluetooth usage.\n\nThe glasses last 8 hours of average usage: https://www.nuanceaudio.com/en-us/c/support/faq/nuance-audio-glasses/battery-and-charging, *and* isn't replaceable. It's confusingly bad.",
                  "score": 2,
                  "created_utc": 1738793197.0,
                  "replies": [
                    {
                      "id": "mb97rkl",
                      "author": "VincentNacon",
                      "body": "Yeah...  yike.",
                      "score": 1,
                      "created_utc": 1738825922.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "maxi582",
          "author": "Upset-Class-3005",
          "body": "They're $1200 plus cost of lenses at my location",
          "score": 1,
          "created_utc": 1738681006.0,
          "replies": []
        },
        {
          "id": "mb1ydst",
          "author": "OhiobornCAraised",
          "body": "Well, the one good thing about combining them into one is the hearing aids won’t get lost easily. I have had that happen a couple of times over the last 9+ years.",
          "score": 1,
          "created_utc": 1738729993.0,
          "replies": []
        },
        {
          "id": "mb203i6",
          "author": "FuzzyDwarf",
          "body": "As someone also in the glasses/hearing aids (moderate) camp, the only upside I see is the directional microphones. Every once in a while my hearing aids will lock onto someone with a loud/clear voice and make it difficult to hear who I'm actually talking to. But that's infrequent, and the glasses can't stream audio like my hearing aids can. \n\nPlus even if they solve the insurance, battery, price, etc. problems this could have, and the inherent restrictions of the glasses/aids being combined, they still have to deal *with glasses being a aesthetic choice.* There are hundreds of frames at my optician. \n\nI'm also skeptical that they compete with a properly calibrated set of over-ear aids, but I guess I'd have to try them.",
          "score": 1,
          "created_utc": 1738730679.0,
          "replies": []
        },
        {
          "id": "mdb6h5m",
          "author": "Dr---Strangelove",
          "body": "Price is $1K. I seriously doubt it will flop",
          "score": 1,
          "created_utc": 1739824419.0,
          "replies": [
            {
              "id": "mdbpsro",
              "author": "VincentNacon",
              "body": "Dude... what the fuck?  I just checked their website and it only has normal speakers in it... nothing to do with \"hearing aids\" at all.  No in ear-canals or anything like that.  How the fuck mild-to-moderate hearing loss are going to hear it?\n\n[https://www.nuanceaudio.com/en-us/electronics-audio-optical/nuance-audio/aw5001-8056262233184](https://www.nuanceaudio.com/en-us/electronics-audio-optical/nuance-audio/aw5001-8056262233184)\n\nThis starting to come off as a scam at this point.",
              "score": 1,
              "created_utc": 1739829845.0,
              "replies": [
                {
                  "id": "mdcem92",
                  "author": "Dr---Strangelove",
                  "body": "That's the point, though. There is a stigma against those that wear hearing aids. So something like these will be of interest to more folks then you may think.\n\n I tried them on at the optometrist today.  They DO provide a benefit. If you have severe hearing loss, no.  But if it's low or moderate they provide a benefit. You may be surprised.\n\nAnd compare the price point against a non-costco pair of hearing aids. Quite compelling. Give them a try and you may be surprised.",
                  "score": 1,
                  "created_utc": 1739837607.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mb12hin",
          "author": "A5Wagyukeef",
          "body": "These are just a slightly modified meta ray ban, with less features actually. Could easily be $3-400 before rx lenses.",
          "score": 0,
          "created_utc": 1738719073.0,
          "replies": []
        }
      ]
    },
    {
      "id": "maxms67",
      "author": "deusirae1",
      "body": "Already invented in 1954. Eye glass/hearing aids never worked.",
      "score": 15,
      "created_utc": 1738682443.0,
      "replies": []
    },
    {
      "id": "maynk7e",
      "author": "Soakitincider",
      "body": "Imagine constantly taking hearing aids out so you can clean the lenses.",
      "score": 3,
      "created_utc": 1738692839.0,
      "replies": [
        {
          "id": "md3mauw",
          "author": "GrandSquanchRum",
          "body": "There's no in ear part of this. The audio plays by vibrating your skull where the frame's hinges touch you. It's not useful for people who have enough hearing loss to seek actual hearing aids it's fairly mild and is more for people with enough hearing loss to have audio processing issues where isolating audio will be helpful.",
          "score": 1,
          "created_utc": 1739725973.0,
          "replies": []
        }
      ]
    },
    {
      "id": "may2jf5",
      "author": "ChernobylChild",
      "body": "How do these work? Article has no details.",
      "score": 2,
      "created_utc": 1738686994.0,
      "replies": []
    },
    {
      "id": "may3l1o",
      "author": "None",
      "body": "Wonder if something like this could help me. Got a TBI while I was in the military because conservative dudes hit me in the head with a pipe cause I'm gay. Have nonstop nausea, migraines, and dyslexia like symptoms. Couldn't even go to college after I got out cause I couldn't read what the book said 🤣",
      "score": 2,
      "created_utc": 1738687288.0,
      "replies": [
        {
          "id": "mayxmuj",
          "author": "Big_Rain2543",
          "body": "Go see a binocular vision specialist. I’m surprised your neurologist hasn’t already told you to.\n\nEdit: BV specialists are eye doctors who deal with vision and perception issues sometimes arising at birth or after a stroke or TBI.\n\nSource: I went through a specific rotation during optometry school for binocular vision and vision therapy, and encountered some neuro patients after TBI.",
          "score": 2,
          "created_utc": 1738695642.0,
          "replies": [
            {
              "id": "mayzixb",
              "author": "None",
              "body": "Army medicine, I guess. I can't travel to where that kind of doctor would be, I think, but it shouldn't hurt to try.",
              "score": 1,
              "created_utc": 1738696173.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mayke4w",
      "author": "Hairyponch0",
      "body": "Great now I can say hold on i can't hear you let me get my glasses",
      "score": 2,
      "created_utc": 1738691964.0,
      "replies": []
    },
    {
      "id": "mb0ywq9",
      "author": "thephartmacist",
      "body": "We still have an FDA?",
      "score": 2,
      "created_utc": 1738717931.0,
      "replies": []
    },
    {
      "id": "maxsh5p",
      "author": "DOGA_Worldwide69",
      "body": "Something that helps with hear AND seeing? Sounds like some DEI shit to me",
      "score": 2,
      "created_utc": 1738684122.0,
      "replies": []
    },
    {
      "id": "may5ijn",
      "author": "nestcto",
      "body": "Bet you have to connect it to the Internet every month or so for it to continue working.",
      "score": 1,
      "created_utc": 1738687826.0,
      "replies": []
    },
    {
      "id": "maylb5m",
      "author": "Thesorus",
      "body": "I use both, I will never use that.\n\nI don't see the point.",
      "score": 1,
      "created_utc": 1738692217.0,
      "replies": [
        {
          "id": "mdb6w0u",
          "author": "Dr---Strangelove",
          "body": "I do. I dont like the feeling of glasses over hearing aids. PS. I tried them today.  Pretty neat.",
          "score": 1,
          "created_utc": 1739824537.0,
          "replies": []
        }
      ]
    },
    {
      "id": "maysrft",
      "author": "JustAnOrdinaryBloke",
      "body": "*”EssilorLuxottica anticipates making these glasses available in the U.S. starting in the first quarter 2024.”*\n\nOld news, and since I haven’t seen any, I guess it flopped.",
      "score": 1,
      "created_utc": 1738694301.0,
      "replies": [
        {
          "id": "md3mgw4",
          "author": "GrandSquanchRum",
          "body": "It's launching this week.",
          "score": 1,
          "created_utc": 1739726021.0,
          "replies": [
            {
              "id": "mdj4rx8",
              "author": "Dr---Strangelove",
              "body": "Tried them on Monday and I will be ordering. 30 day money back guarantee.",
              "score": 1,
              "created_utc": 1739925744.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpvdn8p",
          "author": "Apprehensive-Low-337",
          "body": "Just bought them 20 minutes ago.",
          "score": 1,
          "created_utc": 1746033011.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mazg2br",
      "author": "druscarlet",
      "body": "They had these back in the 1950s. Two older people in my church wore them.",
      "score": 1,
      "created_utc": 1738700894.0,
      "replies": []
    },
    {
      "id": "mb0di33",
      "author": "Fussy_Fucker",
      "body": "Pass",
      "score": 1,
      "created_utc": 1738710833.0,
      "replies": []
    },
    {
      "id": "mb0f45b",
      "author": "Ghozer",
      "body": "So the phrase \"Just a moment let me get my glasses, I can't hear you\" is real now, and not just a joke! \n\nwhat times we live in :D",
      "score": 1,
      "created_utc": 1738711362.0,
      "replies": []
    },
    {
      "id": "mb0m2ve",
      "author": "hardcore_love",
      "body": "Both my hearing and my vision are shit. So, in the eventuality that something needs to be worked on, I’m screwed.",
      "score": 1,
      "created_utc": 1738713692.0,
      "replies": []
    },
    {
      "id": "mb0vkky",
      "author": "schloffgor",
      "body": "This is nothing new, in the 50's my girlfriend had glasses like this for profound hearing loss.",
      "score": 1,
      "created_utc": 1738716855.0,
      "replies": []
    },
    {
      "id": "mb16996",
      "author": "slabby",
      "body": "Is this closed captioning for real life?",
      "score": 1,
      "created_utc": 1738720278.0,
      "replies": []
    },
    {
      "id": "mb2dvw2",
      "author": "Brother191",
      "body": "Great i was looking for all along. At the moment I am using Apple Airpots pro because of the issue with eyeglasses and hearing aids behind the ears. Why are they not making hearing aids like the airpots? Nowadays nearly everbody has one in his ears.",
      "score": 1,
      "created_utc": 1738736977.0,
      "replies": []
    },
    {
      "id": "mb8sgko",
      "author": "Metropolis4",
      "body": "Oh, we still have the FDA.",
      "score": 1,
      "created_utc": 1738818385.0,
      "replies": []
    },
    {
      "id": "mbp3e5g",
      "author": "Godzlittlehand",
      "body": "My $20 sunglasses can do this",
      "score": 1,
      "created_utc": 1739038290.0,
      "replies": []
    },
    {
      "id": "mbqphcq",
      "author": "spatula-tattoo",
      "body": "Now you can lose your glasses and hearing aids at the same time. Convenient!",
      "score": 1,
      "created_utc": 1739055522.0,
      "replies": []
    },
    {
      "id": "maxudba",
      "author": "None",
      "body": "You still can't hear but now they can hear you better.",
      "score": 1,
      "created_utc": 1738684665.0,
      "replies": []
    },
    {
      "id": "mawyeau",
      "author": "Crawlerado",
      "body": "Retail Price; $799\n\nFDA®️ Approved™️; $27,345.23*\n\n*we will just bill your insurance",
      "score": -1,
      "created_utc": 1738674105.0,
      "replies": [
        {
          "id": "maxe8m1",
          "author": "ScholarOfFortune",
          "body": "As someone in the market for hearing aids, I WISH I could get them covered by insurance.",
          "score": 9,
          "created_utc": 1738679742.0,
          "replies": [
            {
              "id": "maym0si",
              "author": "Striker_64",
              "body": "I thought insurance covered a portion of the cost? You have to pay 100% out of pocket?",
              "score": 2,
              "created_utc": 1738692414.0,
              "replies": [
                {
                  "id": "mayw8ot",
                  "author": "ScholarOfFortune",
                  "body": "My insurance has negotiated a ‘special deal’ with one provider for a discount. Other than that hearing aids are not covered by our insurance.",
                  "score": 5,
                  "created_utc": 1738695260.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpvdhv4",
              "author": "Apprehensive-Low-337",
              "body": "Just bought these. My insurance picked up 35% of the cost because they are eyeglasses. Might check it out with your insurance.",
              "score": 1,
              "created_utc": 1746032967.0,
              "replies": []
            }
          ]
        },
        {
          "id": "maydq6g",
          "author": "pokemonbard",
          "body": "What are you talking about",
          "score": 1,
          "created_utc": 1738690122.0,
          "replies": []
        }
      ]
    }
  ]
}