{
  "post": {
    "title": "Camera owner asks Canon, skies: Why is it 5 USD/month for webcam software?",
    "author": "a_Ninja_b0y",
    "id": "1i422l9",
    "score": 2685,
    "created_utc": 1737184018.0,
    "selftext": "",
    "num_comments": 306,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i422l9/camera_owner_asks_canon_skies_why_is_it_5/"
  },
  "comments": [
    {
      "id": "m7rn0t7",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1737184019.0,
      "replies": []
    },
    {
      "id": "m7rnyg8",
      "author": "re_carn",
      "body": "I was trying to measure noise level with my smartphone today, one of the apps offers a $15/year subscription for just measuring noise with the built-in microphone. For what?! No third-party services are used, just the built-in capabilities of the smartphone. \n\n(\\*) There are also free apps for that, of course, but the paid one was at the top of the search results,",
      "score": 1196,
      "created_utc": 1737184582.0,
      "replies": [
        {
          "id": "m7rozg4",
          "author": "SolidOshawott",
          "body": "Most people downloading this will use it once and forget. They'll do the one week or one month trial, forget to cancel, and bam $15 gone",
          "score": 411,
          "created_utc": 1737185209.0,
          "replies": [
            {
              "id": "m7sn78i",
              "author": "arlando00",
              "body": "This is why you get the free trial, then immediately go in the settings and cancel the subscription so you get the trial and it doesn't charge.  Unfortunately, people don't think to do that.",
              "score": 84,
              "created_utc": 1737205243.0,
              "replies": [
                {
                  "id": "m7tiwn4",
                  "author": "DEdwards22",
                  "body": "Use the Privacy.com app and make a temp debit card number with a limit of $1, they won’t be able to get anything off of it after the trial",
                  "score": 41,
                  "created_utc": 1737216496.0,
                  "replies": [
                    {
                      "id": "m7tqcja",
                      "author": "ItsWillJohnson",
                      "body": "Could t they come after you though? Since you never cancelled you legally owe them money.",
                      "score": 8,
                      "created_utc": 1737218728.0,
                      "replies": [
                        {
                          "id": "m7ttnpn",
                          "author": "DEdwards22",
                          "body": "There’s no litigation for $15 😂",
                          "score": 15,
                          "created_utc": 1737219698.0,
                          "replies": [
                            {
                              "id": "m7u9eg2",
                              "author": "ItsWillJohnson",
                              "body": "Right but they’ll keep charging you for ten years and then come asking for their money.",
                              "score": 8,
                              "created_utc": 1737224388.0,
                              "replies": [
                                {
                                  "id": "m7uodui",
                                  "author": "DEdwards22",
                                  "body": "Nope, every sub I’ve done this with just says they’re closing the account unless you change the payment method. Starz even offers months for $.99 to come back lol",
                                  "score": 18,
                                  "created_utc": 1737228925.0,
                                  "replies": []
                                },
                                {
                                  "id": "m7vuzjw",
                                  "author": "spicekebabbb",
                                  "body": "used privacy for this exact purpose and can confirm that they just cancel your subscription if your payment method declines. they'll revoke your access to their services if you don't pay, and they can't continue to charge you for services you can no longer access. i assume that's an appstore/playstore rule because gyms absolutely will keep charging you after revoking your access for non-payment, lol.",
                                  "score": 4,
                                  "created_utc": 1737242378.0,
                                  "replies": [
                                    {
                                      "id": "m80qqb2",
                                      "author": "DEdwards22",
                                      "body": "That gym probably got your ID when you signed up, you can tell Netflix you’re Jeff Dahmer and keep it pushing",
                                      "score": 2,
                                      "created_utc": 1737310507.0,
                                      "replies": [
                                        {
                                          "id": "m80xlrs",
                                          "author": "spicekebabbb",
                                          "body": "they did and lmao",
                                          "score": 0,
                                          "created_utc": 1737312429.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "maa3zdv",
                              "author": "None",
                              "body": "They'll fvck with your credit score.",
                              "score": 1,
                              "created_utc": 1738363966.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m7vioez",
                          "author": "NoThisIsABadIdea",
                          "body": "No, they cancel the sub if the payment doesn't go through, which it wouldn't be able to. They don't just give you the service and keep trying to charge.",
                          "score": 1,
                          "created_utc": 1737238427.0,
                          "replies": []
                        },
                        {
                          "id": "maa3u6p",
                          "author": "None",
                          "body": "I had an Adobe account a few years ago because I needed their software to prepare my architecture finals portfolio. I signed up for their monthly payment plan in the UK. After completing my work, I cancelled payments. I received aggressive emails from the US, warnings of having my credit rating damaged and an insistence I continue paying them for at least a full year.\n\nThey are out of their minds and their behaviour would not be tolerated in Europe.",
                          "score": 1,
                          "created_utc": 1738363923.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7tmwl1",
                      "author": "Jimmy_cracked_corn",
                      "body": "That’s a good idea! Thanks!",
                      "score": 1,
                      "created_utc": 1737217698.0,
                      "replies": []
                    },
                    {
                      "id": "m81edje",
                      "author": "xak47d",
                      "body": "Apple has banned users accounts for doing that",
                      "score": 0,
                      "created_utc": 1737317241.0,
                      "replies": [
                        {
                          "id": "m81epr2",
                          "author": "DEdwards22",
                          "body": "Yeah I wouldn’t use it linked with ApplePay, just sign up with the temp card outside of the app or directly.",
                          "score": 0,
                          "created_utc": 1737317337.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7t2ljq",
                  "author": "ephemeralentity",
                  "body": "Or schedule a calendar event to cancel if they take away your remaining trial if you unsubscribe.",
                  "score": 24,
                  "created_utc": 1737211191.0,
                  "replies": [
                    {
                      "id": "m7tn450",
                      "author": "chalfont_alarm",
                      "body": "Do you know any services that actually remove your free time if you cancel before the expiry? Serious question because I haven't yet but always cringe at that moment expecting to lose it all",
                      "score": 5,
                      "created_utc": 1737217761.0,
                      "replies": [
                        {
                          "id": "m7tpu0a",
                          "author": "SOUND_NERD_01",
                          "body": "Apple Music for one.",
                          "score": 5,
                          "created_utc": 1737218575.0,
                          "replies": [
                            {
                              "id": "m80mh0o",
                              "author": "Sea-Mess-250",
                              "body": "Audible. If you have any unused credits you forfeit them. You can pause membership for 90days like once a year but that’s the only grace given.",
                              "score": 1,
                              "created_utc": 1737309324.0,
                              "replies": []
                            },
                            {
                              "id": "m7tqkbp",
                              "author": "JeffCrossSF",
                              "body": "I’m 99.99% sure this is inaccurate. Canceling the trial does not end your access. It works until the trial period ends.",
                              "score": 1,
                              "created_utc": 1737218794.0,
                              "replies": [
                                {
                                  "id": "m7vs7u3",
                                  "author": "Agent_Provocateur007",
                                  "body": "So the strange thing is that for Apple's services this is not the case, you lose access immediately. Now the even stranger thing is for any other third party apps, if you have a trial and you cancel it, you can still access it until the end date of that trial. I don't actually know what the App Store guideline is on this, but it would be pretty funny if Apple is violating their own guidelines.",
                                  "score": 4,
                                  "created_utc": 1737241478.0,
                                  "replies": []
                                },
                                {
                                  "id": "m7ul8ar",
                                  "author": "Parking-Interview351",
                                  "body": "Idk about Apple Music but I know 100% that Apple Arcade does that so I wouldn’t be surprised",
                                  "score": 2,
                                  "created_utc": 1737227969.0,
                                  "replies": []
                                },
                                {
                                  "id": "m7twj0e",
                                  "author": "SOUND_NERD_01",
                                  "body": "I canceled it immediately so it wouldn’t auto bill and it stopped working. There’s even a pop up that says you’ll immediately lose access.\n\nEdit: for the sake of clarity, I subscribed and immediately cancelled Apple Music a few months ago. This could have changed by now. But I know for a fact it cancelled immediately when I tried it.",
                                  "score": 4,
                                  "created_utc": 1737220553.0,
                                  "replies": [
                                    {
                                      "id": "m7txfc4",
                                      "author": "ajs02aj",
                                      "body": "Not sure about Apple Music but Apple News for sure cancels immediately and your forfeit the remaining subscription",
                                      "score": 4,
                                      "created_utc": 1737220824.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m7vm0b6",
                                  "author": "PublicBetaVersion",
                                  "body": "It used to be like that but not anymore. Now you lose access as soon as you cancel the trial. Only paid subscriptions work till the last day.",
                                  "score": 1,
                                  "created_utc": 1737239467.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7sv9qg",
                  "author": "SolidOshawott",
                  "body": "Yep, I made that mistake once so now I immediately cancel the trial after starting it.",
                  "score": 4,
                  "created_utc": 1737208505.0,
                  "replies": []
                },
                {
                  "id": "m7u66s8",
                  "author": "Zed_or_AFK",
                  "body": "Or even know how to manage their subscriptions on their devices/accounts.",
                  "score": 1,
                  "created_utc": 1737223423.0,
                  "replies": []
                },
                {
                  "id": "m7zoecr",
                  "author": "garry4321",
                  "body": "Then you try Adobe suite and the second you cancel your charge, you lose all access to the trial. \n\nAdobe = assholes",
                  "score": 1,
                  "created_utc": 1737299566.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7smcfq",
              "author": "No-Access-2790",
              "body": "When you apply the math concept to gyms, you get a similar result. The bulk of gym revenue is from memberships that people don’t use and don’t cancel. That’s not an accident, it’s the actual business model.",
              "score": 160,
              "created_utc": 1737204870.0,
              "replies": [
                {
                  "id": "m7u106m",
                  "author": "vikingdiplomat",
                  "body": "yep.  i worked at a software company years ago that had a bunch of accounts paying monthly but never being used.  they called them their gym membership accounts and went out of their way to avoid anything that would remind them of the account's existence. scummy af",
                  "score": 73,
                  "created_utc": 1737221896.0,
                  "replies": []
                },
                {
                  "id": "m7utxda",
                  "author": "hello__monkey",
                  "body": "Exactly. There was a good planet money podcast about subscription models. There’s a reason virtually everything is moving to subscription!",
                  "score": 10,
                  "created_utc": 1737230665.0,
                  "replies": [
                    {
                      "id": "m7wyj72",
                      "author": "ghandi3737",
                      "body": "Because they can promise the world, not deliver, and then promise an entire world of new additions next month. Rinse, repeat.",
                      "score": 2,
                      "created_utc": 1737255287.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7u5ws2",
                  "author": "Zed_or_AFK",
                  "body": "Gyms are different. They are notorious for making it difficult to cancel a subscription, and you often have to pay 2-3-6 months after canceling, and it’s like that all over the world. At least in the App Store you follow proper rules with decent rights. Canceling is easier.",
                  "score": 21,
                  "created_utc": 1737223341.0,
                  "replies": [
                    {
                      "id": "m7x1b6j",
                      "author": "goodnames679",
                      "body": "This is one of the things keeping me from switching from that one big gym everyone hates. I've had to cancel with them before, it took all of thirty seconds and didn't hit me with any extra fees.\n\nMy friend wants to try out another gym, but it's inconveniently located for me and I have no idea what their cancellation process is like. I'm worried that if I decide I'm not a fan of going there, I'll get smacked with paying some ridiculous extra amount or have to jump through hoops.",
                      "score": 2,
                      "created_utc": 1737256251.0,
                      "replies": [
                        {
                          "id": "m7xz6st",
                          "author": "thisischemistry",
                          "body": "Use a disposable credit card to sign up. They have reloadable ones too but make sure they don't have some policy where you can get an overdraft and penalized for it.",
                          "score": 2,
                          "created_utc": 1737268985.0,
                          "replies": []
                        },
                        {
                          "id": "m7x36bz",
                          "author": "coolmanjack",
                          "body": "Which gym is that? There are plenty that people hate. Is it planet fitness?",
                          "score": 1,
                          "created_utc": 1737256903.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7u40gf",
                  "author": "Max-Phallus",
                  "body": "I'm not sure if it's related but I joined a new gym in 2023, and unlike any other gym I'd been with, they insisted on doing a health check and introduction to the machines & workout plan **IF** you paid for the entire year upfront.\n\nNeedless to say, after 8 years of using a gym 3 times a week, I did not want to bother this with absolute nonsense. \n\nI do wonder how many people just didn't turn up ever again.\n\nI went in and told the receptionist that I'd done all of it at a different branch and they stopped asking.\n\nReally weird, I'm paying to use equipment, not to be bothered.",
                  "score": 8,
                  "created_utc": 1737222781.0,
                  "replies": [
                    {
                      "id": "m7vlw47",
                      "author": "GaijinHenro",
                      "body": "Probably something to do with their insurance.",
                      "score": 7,
                      "created_utc": 1737239430.0,
                      "replies": [
                        {
                          "id": "m7xu980",
                          "author": "Afterbirthofjesus",
                          "body": "Trying to sell training.",
                          "score": 3,
                          "created_utc": 1737266618.0,
                          "replies": [
                            {
                              "id": "m85gejt",
                              "author": "Enough-Meaning1514",
                              "body": "Yes, this. Upsell opportunity. They want you to pay more for a guy to stop by once or twice during your workout and \"fix your posture\" or whatever.",
                              "score": 1,
                              "created_utc": 1737376712.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7xemt2",
                  "author": "the-broom-sage",
                  "body": "gyms work on same principal as the insurance system, 🤣",
                  "score": 1,
                  "created_utc": 1737260642.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7t1t1b",
              "author": "FreddieJasonizz",
              "body": "And all your data harvested by the app will be sold to the highest bidder by the company.",
              "score": 6,
              "created_utc": 1737210909.0,
              "replies": []
            },
            {
              "id": "m7t7ghc",
              "author": "Handy_Dude",
              "body": "Which is crazy cause that's inherently not honest and fair business. It's legal. But it's literally dependent on being sneaky and \"stealing.\" Think of how it would go down if money wasn't digital and a rep from the company broke into your house in the middle of the night and took that $15 out of your stash under the mattress and left you a 40 page legal document explaining terms of service and billing bullshit, because you drunkenly pushed a button somewhere 355 days ago. \n\nI never liked subscription model businesses for this very reason. It's not convenient, it always ends up being more expensive than it's worth, and it's dishonest.",
              "score": 9,
              "created_utc": 1737212862.0,
              "replies": []
            },
            {
              "id": "m7vsaly",
              "author": "Zealousideal_Meat297",
              "body": "It works great. A lot of people open a new account and forget this scam. I still have a Spotify rogue account I can't cancel because I lost access to the account and Spotify doesn't have a phone number.\n\nI literally have to call my bank to stop 120+ annually in slipping out, and that's just one company.",
              "score": 2,
              "created_utc": 1737241504.0,
              "replies": []
            },
            {
              "id": "m7tl6b6",
              "author": "ApolloXLII",
              "body": "This shit is so predatory",
              "score": 1,
              "created_utc": 1737217183.0,
              "replies": []
            },
            {
              "id": "m7t1t99",
              "author": "FreddieJasonizz",
              "body": "And all your data harvested by the app will be sold to the highest bidder by the company.",
              "score": 1,
              "created_utc": 1737210909.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7rphc1",
          "author": "rileyoneill",
          "body": "If there was anything the app store should be purging it is this nonsense.  The software sold on the shop is such dog shit that it makes me never really want to look and see what cool things they might have.",
          "score": 152,
          "created_utc": 1737185512.0,
          "replies": [
            {
              "id": "m7s2qg6",
              "author": "grafknives",
              "body": "> If there was anything the app store should be purging it is this nonsense.\n\nBut apple/google makes 30% out of tha 15$!!!",
              "score": 44,
              "created_utc": 1737193969.0,
              "replies": [
                {
                  "id": "m7tf7an",
                  "author": "JBWalker1",
                  "body": ">But apple/google makes 30% out of tha 15$!!!\n\nApple even wants to take 30% cut of things like your monthly subscription to spotify if you subscribe while using their device. Considering how it costs Apple essentially nothing other than the 2% or whatever payment processing fee then chances are if you subsribe to Spotify while using an iPhone then Apple might be making more profit from your monthly spotify payment than Spotify themselves.\n\nDigital storefronts are a rip off, especially those who know they'll never lose their specific market. Can be Apple, Google, Steam, Amazon, they're all the same and are money over everything.",
                  "score": 18,
                  "created_utc": 1737215354.0,
                  "replies": [
                    {
                      "id": "m7tlwa7",
                      "author": "grafknives",
                      "body": "It is not really a storefront.\n\n\nIt is monopolising access to customers.\n\n\nThis is why EU fight to force apple and Google to accept other storefronts.",
                      "score": 7,
                      "created_utc": 1737217399.0,
                      "replies": [
                        {
                          "id": "m7v38b3",
                          "author": "FireLucid",
                          "body": "They had to force Google? I messed around with the Amazon app store over a decade ago and have side loaded apps without ever hitting a roadblock. Where they doing something different in Europe?",
                          "score": 4,
                          "created_utc": 1737233647.0,
                          "replies": [
                            {
                              "id": "m7xvfh5",
                              "author": "grafknives",
                              "body": "The issue is that apple and Google stated(more FUD than legal statements) that phone with alternative aps is compromised. Not safe anymore.\n\n\nAnd because we use phone ls as our digital identity, it was very effective.\n\n\nBut from 2024 there are alternative store fronts for Apple and they are official. \n\n\nAnd because of that Google changed it's billing method.\n\n\nhttps://support.google.com/googleplay/android-developer/answer/12348241?hl=en\n\n\n\nThat was EU force acting on google",
                              "score": 2,
                              "created_utc": 1737267150.0,
                              "replies": [
                                {
                                  "id": "m81v5hh",
                                  "author": "FireLucid",
                                  "body": "Google changed it's billing practices because Apple allowed other storefronts? That makes no sense, I'd say it's the EU force like you said later on.\n\nDon't live in the EU so missed that.",
                                  "score": 1,
                                  "created_utc": 1737322002.0,
                                  "replies": [
                                    {
                                      "id": "m848swd",
                                      "author": "grafknives",
                                      "body": "Yeah , it is EU enforcement. Sorry, had mixed words.",
                                      "score": 1,
                                      "created_utc": 1737351506.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7tt5i8",
                      "author": "thisischemistry",
                      "body": "> Apple even wants to take 30% cut of things like your monthly subscription to spotify if you subscribe while using their device.\n\n- Someone makes an app for X dollars, sells it for Y on a service, they are charged a percent for selling it so the app store makes money.\n- Someone makes an app for X dollars, sells it for nothing on a service, the service gets nothing because a percent of nothing is nothing. However, the app sells subscriptions to pay for development. Now the app store doesn't make money unless it also collects on those subscriptions.\n\nThere are lots of ways to try to stop this kind of skirting of the rules, for example you could charge a flat amount for selling an app on the service. That would punish smaller companies that are selling simple and small apps and give larger ones a nearly-free ride. So we end up with the current solution. It's not perfect but every solution is going to cause some issue, this is large companies pointing fingers at each other and generating rage in their users to the company's benefit.",
                      "score": 4,
                      "created_utc": 1737219548.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7trmy8",
                  "author": "thisischemistry",
                  "body": "Not just them, it's an industry-wide thing. Epic, Microsoft, Sony, Nintendo, Valve, and many others charge approximately the same fees to sell on their devices/app stores. It's the price of doing business.\n\nNow, perhaps we should look at that practice but I'm not sure that it can be changed. Yes, it might be good to cut down profit margins and lower prices but that will only go so far. At some point people need to get paid for their work, it's just a matter of how much is fair.\n\nSo what's a justifiable cut for creating API, developing tools, running an online store, vetting products on it, and so on? I can't say. A lot of times the fees drop down to 15% for those stores, so it can be done, but how low can it drop before it becomes unprofitable to run them?\n\nThe old models of individuals selling software without a combined storefront had its costs too, ones that severely punished the smaller players. A Microsoft can create an online store and sell their stuff through it at a very discounted cost, an independent developer would have to spend a ton of their time and money on running one. So it can be a very good thing to have a Steam or similar, it allows smaller developers to sell their stuff without the large overhead of a store.\n\nSo, what's a fair fee for that sort of thing? I'm not just talking about a guess at the amount, I'm talking about a detailed analysis of what's fair. For all we know, 30% might be fair. After all, back in the day of physical stores they might sell a product to a retailer for $10 and the retailer would resell it for $20. That's a 100% cut! A 30% cut, when it first came out, was looked at as an incredible value by many independent developers.",
                  "score": 4,
                  "created_utc": 1737219104.0,
                  "replies": []
                },
                {
                  "id": "m7t0b6r",
                  "author": "DigidudeFx",
                  "body": "Not to mention the fact that Apple wants you to throw away a perfectly good phone to get the next big new iPhone that is skinny and shiny with a brighter flashlight and smells like feathers!",
                  "score": 4,
                  "created_utc": 1737210378.0,
                  "replies": [
                    {
                      "id": "m7w2xsn",
                      "author": "Buttersaucewac",
                      "body": "My last iPhone was kept updated to the current OS version for 7 years and is still getting security updates at 9 years, if they’re trying to make me throw away old phones they’re not doing a very good job.",
                      "score": 1,
                      "created_utc": 1737244843.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7s0x75",
              "author": "Heimerdahl",
              "body": "The dumbest thing on the Google Playstore is that it'll *always* show you a sponsored app on first place. \n\n\nIf it was results for generic searches like \"photo editing app\", fine, but it happens even when you search for a specific app by name. I just checked and it even puts other sponsored apps over apps it's already trying to push in my face! Just searched for \"Temu\" (as that one was shown before I even started the search, so clearly paying a bunch) and it pushed \"Shein-Shopping Online\" to first place over it. Wtf?!\n\n\n\nThis wasn't always the case, but has been for a while and is seriously pissing me off.",
              "score": 64,
              "created_utc": 1737192798.0,
              "replies": [
                {
                  "id": "m7s3cnp",
                  "author": "Click_To_Submit",
                  "body": "Apple App Store is the same.",
                  "score": 32,
                  "created_utc": 1737194367.0,
                  "replies": [
                    {
                      "id": "m7sp6mk",
                      "author": "None",
                      "body": "[removed]",
                      "score": 10,
                      "created_utc": 1737206094.0,
                      "replies": [
                        {
                          "id": "m7vi3u6",
                          "author": "I-seddit",
                          "body": "> developers have an incentive to recoup the price of their Mac and yearly developer fee.\n\nOr, you know, their living costs.  Or, god forbid, a profit on their work.",
                          "score": 2,
                          "created_utc": 1737238249.0,
                          "replies": []
                        },
                        {
                          "id": "m7sxuty",
                          "author": "kytrix",
                          "body": "A PlayStation or Xbox subscription costs much more. If it’s really something you want to do it’s within reach, but it does give incentive to release your app on iOS *first*",
                          "score": -4,
                          "created_utc": 1737209476.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7sd2fz",
                  "author": "_EleGiggle_",
                  "body": "It’s even worse if they push clones of the app you’re looking for that might be straight up malware.\n\nThe official Reddit app does the same with disguising ads as regular threads. At least they are still visibly different enough.",
                  "score": 8,
                  "created_utc": 1737200217.0,
                  "replies": []
                },
                {
                  "id": "m7sco0d",
                  "author": "rlnrlnrln",
                  "body": "Same with Google search, which is hilarious because the reason Google exists is that Alta Vista, the alternative at the time, allowed people to pay for top positions...",
                  "score": 28,
                  "created_utc": 1737199994.0,
                  "replies": [
                    {
                      "id": "m7sdflo",
                      "author": "_EleGiggle_",
                      "body": "If recently used Edge to install Firefox, and the top sponsored result on Bing was Opera.\n\nWhat happened to that annoying “pick your browser” popup for fresh Windows installs?",
                      "score": 12,
                      "created_utc": 1737200420.0,
                      "replies": [
                        {
                          "id": "m7sg3c1",
                          "author": "twitty80",
                          "body": "Idk, I had that popup when setting up my windows 11.",
                          "score": 4,
                          "created_utc": 1737201836.0,
                          "replies": [
                            {
                              "id": "m7sg8vg",
                              "author": "_EleGiggle_",
                              "body": "Weird, I didn’t get it. Although I used Rufus for creating the install USB drive, so I don’t have to login with my MS account, and can still use a local one.\n\nI only changed that setting for Rufus (Secure Boot & TPM work fine after I bought a 15 € TPM module for the motherboard from AsRock), and the privacy one that skips the questions if I want to sell my soul to MS.\n\nI don’t think either includes the browser dialog?",
                              "score": 0,
                              "created_utc": 1737201916.0,
                              "replies": [
                                {
                                  "id": "m7v3mtg",
                                  "author": "FireLucid",
                                  "body": "Possibly it turned off location. That browser thing is only EU isn't it?",
                                  "score": 1,
                                  "created_utc": 1737233775.0,
                                  "replies": [
                                    {
                                      "id": "m7v4iwj",
                                      "author": "_EleGiggle_",
                                      "body": "I live in the EU, and the install was in German as well. It would be kinda ironic if didn’t get my extra choices because I disabled anti privacy features. I’m not even talking about something more effective like O&O ShutUp 10++ that actually disables most of the spying with group policies.",
                                      "score": 1,
                                      "created_utc": 1737234060.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7tyvu5",
                          "author": "aDinoInTophat",
                          "body": "That was only a thing for a few years and was pretty much an plea deal from Microsoft to get EU to stop digging. EU didn't stop and now we have the DMA which resulted in any non-\"system\" applications being fully removable and replaceable, including browsers.\n\nRemember EU pretty much works on a highest impact selection with the big hammer of justice so now the focus has turned towards mobile makers which now are forced to implement similar choose screens.\n\nI thinks it's a safe bet the DMA will be extended to cover desktop browser's choice screen sooner or later. I don't think it's a high priority given that pretty much everyone knows there are different browsers today, even some of the most the most tech-illiterate people I know use a different browser.",
                          "score": 5,
                          "created_utc": 1737221263.0,
                          "replies": []
                        },
                        {
                          "id": "m7srprp",
                          "author": "alidan",
                          "body": "most likely, the moment that chrome became the most used browser world wide they no longer had the legal requirement to do that.",
                          "score": 3,
                          "created_utc": 1737207119.0,
                          "replies": [
                            {
                              "id": "m7t0us5",
                              "author": "ThisUsernameis21Char",
                              "body": "https://www.wheresyoured.at/the-men-who-killed-google/",
                              "score": 1,
                              "created_utc": 1737210572.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7t4933",
                      "author": "kurotech",
                      "body": "As with any capitalist entity they don't care that it's a thing they just want to be the ones to control it. Buy up and destroy all the competition bury their patients then wait a few years and \"release\" said product that you bought out to bury the competition.",
                      "score": 1,
                      "created_utc": 1737211765.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7sul20",
                  "author": "hyperforms9988",
                  "body": "Discipline.  If you're in there enough, you learn to treat it like it's not even there.  It's annoying sure, but it reminds me of using a search engine where that's been a thing for so long that it's like a reflex, or second nature, or it's completely subconscious that I ignore the sponsored results... even if the sponsored result is exactly what I searched for.",
                  "score": 3,
                  "created_utc": 1737208242.0,
                  "replies": []
                },
                {
                  "id": "m7u6mbz",
                  "author": "Zed_or_AFK",
                  "body": "We are thought to skip all the noise and look for what we really are looking for. All the people who haven’t learned that will have to learn that the hard way. Yikes, but that’s what brings in tax money, creates billionaires and corruption - lies and scams being legal.",
                  "score": 1,
                  "created_utc": 1737223551.0,
                  "replies": []
                },
                {
                  "id": "m7v40py",
                  "author": "FireLucid",
                  "body": "Apple and Google both do this. I have to he tell every single new person at work not to pick the first option when searching for 'Microsoft authenticator'. First option is some subscription thing with a different name.",
                  "score": 1,
                  "created_utc": 1737233899.0,
                  "replies": []
                },
                {
                  "id": "m83z87j",
                  "author": "akeean",
                  "body": "The app store gets up to 30% on any revenue on an app, plus whatever they chose to pay to get \"featured\" (aside from overall revenue) so it's in Apple/Google's interest to push you the thing that makes them the most money, no matter how irrelevant it is, not the thing that gets your job done for free.",
                  "score": 1,
                  "created_utc": 1737347160.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7ry2vb",
              "author": "UkTapes",
              "body": "the appstore gets a cut. that's why it's at the top. eat the rich.",
              "score": 14,
              "created_utc": 1737190957.0,
              "replies": [
                {
                  "id": "m7sdn6v",
                  "author": "_EleGiggle_",
                  "body": "Don’t forget the yearly 99 $ subscription fee from Apple, even if you only submit free and open source apps.\n\nI’d imagine that’s a reason why Android has more free apps. Unfortunately some of those are malware.\n\n> eat the rich\n\nFrom the perspective of the cheap workers that have to assembly your iPhone for pennies, that’s you.\n\nEdit: Given the downvotes did the change of perspective offend you? How you’re much richer than most people on the world that make the stuff you’re buying and wearing?\n\nSure, you and someone like Jeff Bezos have an even higher difference of net worth & money but to him you’re like the factory worker that Apple (or basically everyone else in manufacturing) pays pennies for assembling $ 1,500+ phones.",
                  "score": 0,
                  "created_utc": 1737200533.0,
                  "replies": [
                    {
                      "id": "m7t2856",
                      "author": "hermology",
                      "body": "The majority of Reddit claims to be the Proletariate, but they are actually the bourgeoisie. They claim to want a redistribution of wealth but the extent of their protest is memes and phrases posted online. ",
                      "score": 6,
                      "created_utc": 1737211059.0,
                      "replies": []
                    },
                    {
                      "id": "m7sp21n",
                      "author": "None",
                      "body": "[removed]",
                      "score": 2,
                      "created_utc": 1737206041.0,
                      "replies": [
                        {
                          "id": "m7sppbz",
                          "author": "_EleGiggle_",
                          "body": "Does “eat the rich” add anything to the discussion?\n\nThat’s like when millionaire streamers that work technically for Jeff Bezos (after Amazon bought Twitch) wear a shirt with that phrase.\n\nFurthermore, it’s completely delusional. If anything, the rich would eat you. They have the money to hire armed \nmercenaries that gladly let you in to “eat the rich” but you would be the meal. Well, assuming it’s something like a Zombie apocalypse where this behavior is suddenly happening.\n\nCorrect me if I’m wrong: The app is at the top because they paid for the top spot as advertising, and not because the app is making more money.\n\nEdit: Before you claim it’s not meant literally, it’s a stupid saying to garner support or upvotes. Unless that’s actually a valid argument for you?",
                          "score": 2,
                          "created_utc": 1737206308.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7tpvmc",
                      "author": "Dick_Lazer",
                      "body": "> From the perspective of the cheap workers that have to assembly your iPhone for pennies, that’s you.\n> \n> Edit: Given the downvotes did the change of perspective offend you? How you’re much richer than most people on the world that make the stuff you’re buying and wearing?\n\nDoes that mean I get to set app store policies? If not it seems you're just doing some pointless mudslinging here, and moving the goalposts to defend billionaires. Congrats, you're a simp.",
                      "score": 0,
                      "created_utc": 1737218588.0,
                      "replies": [
                        {
                          "id": "m7uk5hx",
                          "author": "_EleGiggle_",
                          "body": "Well you could download an alternative App Store (if you live in the EU) for your iPhone. I did it when it got popular, and it was still rather annoying to install, and had barely any apps, mostly emulators for multiple consoles. Funnily enough that lead to multiple emulators being added to the official App Store that probably got denied first when there were no alternative stores.\n\nI don’t think they had paid apps (at that time)? But I might be wrong.\n\nEdit: I’m also not into donating to female Twitch streamers where Bezos gets a cut. So I’m not sure if you know what that word means.",
                          "score": 0,
                          "created_utc": 1737227648.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7rtdzb",
              "author": "mamwybejane",
              "body": "Same",
              "score": 2,
              "created_utc": 1737187935.0,
              "replies": []
            },
            {
              "id": "m7shdsw",
              "author": "_EleGiggle_",
              "body": "The thing is the App Store reviews every app submitted.\n\nWell, technically they do, and often reject apps for minor reasons while this practice seems fine to Apple.\n\nI guess it’s the 30% commission.",
              "score": 1,
              "created_utc": 1737202499.0,
              "replies": []
            },
            {
              "id": "m7t3v5o",
              "author": "kurotech",
              "body": "Why would they purge free money from their stores they don't have any real costs aside from delivering and storing those apps? I agree shit like that shouldn't be a thing but app stores make money from all of their sales so why turn it down.",
              "score": 1,
              "created_utc": 1737211632.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7rvcvd",
          "author": "Superseaslug",
          "body": "Keep in mind that for noise level readings, a smartphone will only give very general ideas of volume. Many have built in dynamic gain mics that will adjust based on volume. I noticed a huge difference in readings with my phone vs a proper test instrument.",
          "score": 22,
          "created_utc": 1737189203.0,
          "replies": [
            {
              "id": "m7u7w4a",
              "author": "isademigod",
              "body": "Funny you should say that because I used to work in an audio calibration lab and was thoroughly impressed with the NIOSH SLM app. It was never more than 0.2db off the calibration tone",
              "score": 10,
              "created_utc": 1737223933.0,
              "replies": [
                {
                  "id": "m7whnnw",
                  "author": "Superseaslug",
                  "body": "I wonder if some apps/devices can disable the dynamic gain on their mics.",
                  "score": 1,
                  "created_utc": 1737249700.0,
                  "replies": []
                },
                {
                  "id": "m84016d",
                  "author": "akeean",
                  "body": "Really depends on the phone those apps are used with. If you are lucky, the devs might have tested with your hardware (or something close enough from the same brand)",
                  "score": 1,
                  "created_utc": 1737347507.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7se4bl",
              "author": "_EleGiggle_",
              "body": "You can use two smartphone’s, and compare their readings. In my opinion consistency of the readings matters more than accuracy unless you’re going for a noise complaint, and need the exact decibels.\n\nAlso I assume that’s a known fact, otherwise why would anyone buy specialized equipment?",
              "score": -8,
              "created_utc": 1737200796.0,
              "replies": [
                {
                  "id": "m7sfuxz",
                  "author": "Superseaslug",
                  "body": "Plenty of people wouldn't even know dynamic gain is a thing. It's not something they think about. Next time you're in traffic, think if the people around you have the brain cells to spare to think about how the microphone in their smartphone works",
                  "score": 3,
                  "created_utc": 1737201713.0,
                  "replies": [
                    {
                      "id": "m7siund",
                      "author": "_EleGiggle_",
                      "body": "I technically meant the accuracy of professional equipment vs. your smartphone.\n\nI don’t believe you need to know how your smartphone works exactly, just like you don’t need to know how your car functions exactly to be able to use it. Just being able to drive it, and do basic maintenance is fine. No need for in-depth knowledge about combustion engines.",
                      "score": 0,
                      "created_utc": 1737203229.0,
                      "replies": [
                        {
                          "id": "m7sl3bg",
                          "author": "Superseaslug",
                          "body": "It was a general example. And dynamic gain can throw off your reading immensely. And if you don't need a specific number why bother other than \"loud\" anyway",
                          "score": 3,
                          "created_utc": 1737204303.0,
                          "replies": [
                            {
                              "id": "m7smqau",
                              "author": "_EleGiggle_",
                              "body": "It can be helpful if you want to file a noise complaint. The logs of an app with timestamps is probably better than just saying “they were loud in the night”. Although it probably won’t be admittable as proof in court but enough for the police, or your (shared) landlord.",
                              "score": 0,
                              "created_utc": 1737205040.0,
                              "replies": [
                                {
                                  "id": "m7smw0q",
                                  "author": "Superseaslug",
                                  "body": "I suppose that would work, but looking at an audio waveform would likely be more accurate. The dynamic gain would probably read a lot higher than it actually is in that instance, although that likely would help your case.",
                                  "score": 3,
                                  "created_utc": 1737205109.0,
                                  "replies": [
                                    {
                                      "id": "m7so4ae",
                                      "author": "_EleGiggle_",
                                      "body": "I doubt that the police would actually know the difference, and you probably don’t want to record the whole week for a single waveform. They probably want an average or something like that. Or the waveform during the night where they woke you up. I guess with an added recording so they know it’s not you making the noise unless that’s included in the app.",
                                      "score": 1,
                                      "created_utc": 1737205641.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7s1x9f",
          "author": "neomage2021",
          "body": "Because people will pay for it",
          "score": 11,
          "created_utc": 1737193447.0,
          "replies": []
        },
        {
          "id": "m7t04xd",
          "author": "Djghost1133",
          "body": "This sounds like a job for sideloading",
          "score": 3,
          "created_utc": 1737210317.0,
          "replies": [
            {
              "id": "m7tccxb",
              "author": "CM6996",
              "body": "This is my answer to everything lol want to charge from App Store? Cool I’ll side load…. If that is not possible or too much work I just don’t have it \nF em and feed the fish heads is how I look at it \nI understand we all want to make money but this subscription non-sense is really getting on my nerves and their TOS crap…. No you may not have my blood type just so I can add fractions ya clowns!!!",
              "score": 3,
              "created_utc": 1737214461.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7s9i14",
          "author": "mythrowaway4DPP",
          "body": "Apple is forcing developers to add payment options even for free apps, and keeps pressuring devs to force a subscription. \nWhy? \nThey take a cut, of course.",
          "score": 11,
          "created_utc": 1737198182.0,
          "replies": [
            {
              "id": "m7t753b",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1737212756.0,
              "replies": [
                {
                  "id": "m7t89c3",
                  "author": "mythrowaway4DPP",
                  "body": "Who is defending that?",
                  "score": 1,
                  "created_utc": 1737213130.0,
                  "replies": [
                    {
                      "id": "m7t9qqv",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1737213618.0,
                      "replies": [
                        {
                          "id": "m7tihz8",
                          "author": "VertexBV",
                          "body": "Defending something takes energy, most people don't have enough left after their daily grind.\n\nBeing apathetic takes none.\n\nOur brains are wired for short term comfort, not long term planning.",
                          "score": 1,
                          "created_utc": 1737216372.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7tjehu",
                  "author": "zapho300",
                  "body": "They’re not. I’m an iOS app dev and all my apps are free. Apple has never ‘pressured’ me into adding a payment option.",
                  "score": 1,
                  "created_utc": 1737216648.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7sasxn",
              "author": "_EleGiggle_",
              "body": "This.\n\nYou have to pay 99 $ a year just to be able to submit (free) apps to the Apple App Store, while the Google Play Store is free. Although both have a commission for paid apps, and in-game purchases.\n\nBut the amount of apps with expensive subscriptions is way too high on iOS compared to Android. You’ll have to install like 10 apps if you’re looking for something basic like an alarm that plays a song or Spotify, and 9/10 apps come with an expensive subscription.\n\nOn the plus side iOS preinstalled stock apps are usually slightly better than their Android version. I mean you’ll have to pay a premium, and I hope some of that was spent on additional app development, and usability studies. So those apps might be enough for many users.\n\nI don’t mind paying 3-5 € once for a good app that I use almost daily. But something like 9.99 $ a month is ridiculous. Even MS Office charges less a month for the complete package. Although I get it that a onetime purchase might not cover a reoccurring, yearly fee for apps with a small user base.\n\nI don’t get people who rather sit through multiple ads per day, or the ones who permanently take 1/4 of the bottom screen. Especially, if it’s a onetime payment for no ads that’s less than 5 €, and they use the app daily. Just buy one less Kebab or Starbucks Coffee, and you’re good.\n\nI know there’s a rather complicated workaround to use Spotify as your alarm but that shouldn’t be necessary. Just make it part of the alarm tone selection. Even Apple Music would be sufficient.",
              "score": 4,
              "created_utc": 1737198937.0,
              "replies": []
            },
            {
              "id": "m7tjgo4",
              "author": "apocolipse",
              "body": "100% incorrect, I’m an app dev and this couldn’t be further from the truth,.  Apple isn’t “forcing” devs to ad anything.  Devs can still release free apps, the yearly dev cost has been the same $99 since the AppStore came out.\n\nWhat Apple has done is make subscription options significantly easier for devs to charge subscriptions.  Previously it was just onetime cost or free, but subscriptions you had to manage payment yourself.  Now Apple manages subscriptions for devs, so it’s just easier to add.\n\nThe REASON more apps are using a subscription model is very simple:  one time purchases don’t pay for continued support and development.  Put it this way, There’s no financial incentive to fix bugs for users who won’t give you any more money since they already paid once.  Subscriptions on the other hand incentivize devs to continuously improve in order to KEEP subscribers.  \n\nAdditionally, apps usually hit a peak user base, in order to keep generating revenue Dev’s must either get more users (which is impossible at a certain point), make new apps, or charge for usage.  Subscriptions fit the bill there.\nDevelopers need to get paid in order to justify continuing to work on something.\n\nYes the “subscribe and forget” effect does factor into that calculus, which plenty of greedy companies take advantage of, but the primary driver is just having a continuous revenue stream instead of one giant lump then nothing.",
              "score": 1,
              "created_utc": 1737216667.0,
              "replies": [
                {
                  "id": "m7tk5ae",
                  "author": "mythrowaway4DPP",
                  "body": "Dude just google it, devs are complaining all over that apple is forcing them to have payment options for free apps.",
                  "score": -1,
                  "created_utc": 1737216873.0,
                  "replies": [
                    {
                      "id": "m7tkgs3",
                      "author": "apocolipse",
                      "body": "I don’t need to Google it, I literally have 2 personal and 3 different work Apple Developer accounts, and not once has Apple ever approached any of them to “add payment options” to my or my companies’ free apps.",
                      "score": 1,
                      "created_utc": 1737216970.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7squ2y",
          "author": "Judman13",
          "body": "There is a fraction calculator app for makers, that wants 2/month, 20/year, or 99/one time for an app that does fraction math.\n\n\nIts insane the greed culture that permiating society.",
          "score": 7,
          "created_utc": 1737206766.0,
          "replies": []
        },
        {
          "id": "m7w999m",
          "author": "andrepoiy",
          "body": "when there are open source alternatives...",
          "score": 2,
          "created_utc": 1737246863.0,
          "replies": []
        },
        {
          "id": "m7spe5w",
          "author": "Frankie_T9000",
          "body": "yep, found the same issue with my google watch having to subscribe to fitbit....elected to go back to my amazfit",
          "score": 1,
          "created_utc": 1737206180.0,
          "replies": []
        },
        {
          "id": "m7sz0u8",
          "author": "scuddlebud",
          "body": "F-Droid doesn't have this issue.",
          "score": 1,
          "created_utc": 1737209910.0,
          "replies": []
        },
        {
          "id": "m7t487s",
          "author": "JohnSpikeKelly",
          "body": "The paid one has way more money to pay for the top slot. It's sad that companies are moving to subscriptions for software without any type of backend server support.",
          "score": 1,
          "created_utc": 1737211757.0,
          "replies": []
        },
        {
          "id": "m7tkt3g",
          "author": "subdep",
          "body": "What’s stupid is the Apple Watch has a built in “noise level” monitor and warning system, and logger built into the Health app.\n\nWhy don’t they have the same offering on the iPhone?",
          "score": 1,
          "created_utc": 1737217073.0,
          "replies": []
        },
        {
          "id": "m7tlp98",
          "author": "5c044",
          "body": "There are calculator apps on the play store where divide and multiply are pro features that require purchase. IDK who falls for that, I thought all mobiles had calculators built in. Obviously there is revenue to be made from these apps.",
          "score": 1,
          "created_utc": 1737217341.0,
          "replies": []
        },
        {
          "id": "m7tpeig",
          "author": "thisischemistry",
          "body": "The answer to the question in the headline is: Because they can.\n\nYes, software development has costs and needs to be paid for but that's part of the business model. You can pay those costs in several ways:\n\n- Build them into the product price.\n- Have a one-time charge, either per-use or forever.\n- Charge on a subscription basis.\n- Have advertising/partnerships.\n\nThese don't have to be exclusive, there's nothing stopping a company from allowing one person to pay per-use and another to buy a lifetime subscription. However, only allowing a continuing fee is pure greed, you're betting on getting another couple of hundred over the lifetime of the product — effectively raising the price of the item if you want to use it fully.\n\nA physical product should have all fees built-in. You should be able to use it nearly fully without needing any cloud services or continuing fees. This situation is ridiculous.",
          "score": 1,
          "created_utc": 1737218446.0,
          "replies": []
        },
        {
          "id": "m7u96bs",
          "author": "throwaway3270a",
          "body": "This is why I not only don't purchase mobile apps, I don't even bother looking at the store. The search on any of them ais absolutely terrible, plus the promotion of paid, plus the huge volume of just low-effort garbage. There's no incentive to improve any of that, either.\n\nEnshitification is real, and it will only get worse.",
          "score": 1,
          "created_utc": 1737224320.0,
          "replies": []
        },
        {
          "id": "m7ucp52",
          "author": "h0tel-rome0",
          "body": "Because capitalism duh",
          "score": 1,
          "created_utc": 1737225382.0,
          "replies": []
        },
        {
          "id": "m7ufa4g",
          "author": "rjnr",
          "body": "Maybe I'm too old to understand this rental stuff, but I utterly refuse to rent software. There are a few VST instruments I would LOVE to pay upfront for, but there are only monthly fee offerings, so alas I will never be able to use them.",
          "score": 1,
          "created_utc": 1737226163.0,
          "replies": []
        },
        {
          "id": "m7v5ung",
          "author": "ClamatoDiver",
          "body": "Get this, it replaced Google Science Journal, it's free and does all kinds of measurements using phone/tablet sensors \n\nhttps://play.google.com/store/apps/details?id=cc.arduino.sciencejournal",
          "score": 1,
          "created_utc": 1737234484.0,
          "replies": []
        },
        {
          "id": "m7vet7q",
          "author": "FuelForYourFire",
          "body": "Is there value to you in the way the software presents that inherent ability? A UI or something that they had to develop?\n\nI use one of the \"free\" (but ad supported) ones, but if something did more or gave more or looked prettier or the ads drive me crazy I could see paying 1.25 a month.",
          "score": 1,
          "created_utc": 1737237272.0,
          "replies": []
        },
        {
          "id": "m7vin98",
          "author": "CDK5",
          "body": "Alarmy charges like $8 a month to use their alarm clock.\n\nWhat's up with all these absent payments recently.",
          "score": 1,
          "created_utc": 1737238417.0,
          "replies": []
        },
        {
          "id": "m7vuxpo",
          "author": "GrynaiTaip",
          "body": "Someone made that app, released it for free, saw that it's popular, figured \"Hey, what if I become mega rich from this?\"",
          "score": 1,
          "created_utc": 1737242361.0,
          "replies": []
        },
        {
          "id": "m7wq51g",
          "author": "Masteruserfuser",
          "body": "ios?",
          "score": 1,
          "created_utc": 1737252550.0,
          "replies": []
        },
        {
          "id": "m7xujho",
          "author": "Drag0nV3n0m231",
          "body": "Who made the app my man",
          "score": 1,
          "created_utc": 1737266744.0,
          "replies": []
        },
        {
          "id": "m7y4e7c",
          "author": "banaslee",
          "body": "That extra money this developer gets that the other don’t, pays for the ads to keep their app at the top of the results. \n\nSmart but scammy. \n\nWhat’s the review rate?",
          "score": 1,
          "created_utc": 1737271786.0,
          "replies": []
        },
        {
          "id": "m7yrhlh",
          "author": "Drink15",
          "body": "Well, no one is forced to buy them. Why buy a 100k car when you can get one for 10k?",
          "score": 1,
          "created_utc": 1737285651.0,
          "replies": []
        },
        {
          "id": "m7sy1tp",
          "author": "kawag",
          "body": "It was supposed to be against the AppStore rules to charge for features of the phone. But then YouTube started charging for picture-in-picture and Apple allowed it.\n\nIt was also supposed to be against the rules to spam people with notifications. Then Facebook decided they’d do it anyway (do you know XYZ?) and Apple didn’t give a crap.\n\nAnd now the AppStore is full of shit.\n\n🤷‍♂️",
          "score": 1,
          "created_utc": 1737209549.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7s3ghd",
      "author": "s0ciety_a5under",
      "body": "It seems like every major brand is so adamant about destroying their brands. It's wild. I'd never buy myself a camera from them anyways, but even if I was, I would look at other brands.",
      "score": 434,
      "created_utc": 1737194435.0,
      "replies": [
        {
          "id": "m7skfeo",
          "author": "_EleGiggle_",
          "body": "If every brand does it, users won’t have a choice anymore. After the initial news blow over, the next company does it. That time there will be less backlash because Canon already does it, and you have even less alternatives.",
          "score": 155,
          "created_utc": 1737203994.0,
          "replies": [
            {
              "id": "m7st39y",
              "author": "Aaron_Hamm",
              "body": "Getting rid of the microphone jack on phones comes to mind",
              "score": 68,
              "created_utc": 1737207662.0,
              "replies": [
                {
                  "id": "m7t16pv",
                  "author": "ImpliedQuotient",
                  "body": "Sony and ASUS still make very good phones with 3.5mm jacks.",
                  "score": 21,
                  "created_utc": 1737210688.0,
                  "replies": [
                    {
                      "id": "m7v0tiv",
                      "author": "ClumsyRainbow",
                      "body": "Sony no longer market their devices in all of NA, and ASUS don't in Canada at least.",
                      "score": 11,
                      "created_utc": 1737232882.0,
                      "replies": []
                    },
                    {
                      "id": "m7v2hp4",
                      "author": "rome_vang",
                      "body": "For now and only in select markets.",
                      "score": 7,
                      "created_utc": 1737233411.0,
                      "replies": []
                    },
                    {
                      "id": "m7wej9e",
                      "author": "FlyingBishop",
                      "body": "And offer 2 years of security upgrades. Not looking to throw my phone away that soon.",
                      "score": 7,
                      "created_utc": 1737248638.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7xani4",
                  "author": "TheBoBiZzLe",
                  "body": "Thought it messed with the water resistance rating?",
                  "score": 1,
                  "created_utc": 1737259333.0,
                  "replies": [
                    {
                      "id": "m7xum0x",
                      "author": "Dead3y3Duck",
                      "body": "Kyocera Hydro from 2015 was IPX7, had a headphone jack, and removable battery. No tools needed to remove the back to access the battery.",
                      "score": 2,
                      "created_utc": 1737266775.0,
                      "replies": []
                    },
                    {
                      "id": "m7xhxvt",
                      "author": "Aaron_Hamm",
                      "body": "That's what they said, but your USB port would too if they didn't disable it when water is detected",
                      "score": 2,
                      "created_utc": 1737261731.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m807nmc",
                  "author": "StopVapeRockNroll",
                  "body": "Ulefones ftw!",
                  "score": 1,
                  "created_utc": 1737305171.0,
                  "replies": []
                },
                {
                  "id": "m7t3y38",
                  "author": "paco_dasota",
                  "body": "there’s still one there it’s just a different form factor than 3.5 mm",
                  "score": -15,
                  "created_utc": 1737211661.0,
                  "replies": []
                },
                {
                  "id": "m7tcpwx",
                  "author": "CM6996",
                  "body": "And Apple had one that used their own port up until the usb-c port was forced on everyone…. You still might be able to find one that works",
                  "score": -9,
                  "created_utc": 1737214576.0,
                  "replies": [
                    {
                      "id": "m7tqs8h",
                      "author": "Dick_Lazer",
                      "body": "They still make a USB-C to 3.5mm adapter, if that's what you're referring to: https://www.apple.com/shop/product/MW2Q3AM/A/usb-c-to-35-mm-headphone-jack-adapter",
                      "score": 9,
                      "created_utc": 1737218858.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7xggsu",
              "author": "SirTiddlyWink",
              "body": "Always Remember what they took from you!!! You can't buy a song on iTunes anymore. Now you subscribe to apple music. Remember!\n\n![gif](giphy|YRDu9U0ysfIoNFct4Q|downsized)",
              "score": 7,
              "created_utc": 1737261226.0,
              "replies": []
            },
            {
              "id": "m7wca5m",
              "author": "PixelAstro",
              "body": "Fujifilm would never",
              "score": 2,
              "created_utc": 1737247874.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7xmdlk",
          "author": "Sithlordandsavior",
          "body": "Ope - it seems your subscription to Reddit Keyboard has run out! For a low price of $17.99 a month, you can get up to 2,000 more letters for comments and posts! If you bundle with Plumbus - our new Reddit insurance program, you can get an additional 500 for free! (Some exclusions apply)",
          "score": 1,
          "created_utc": 1737263387.0,
          "replies": []
        },
        {
          "id": "m8408ik",
          "author": "akeean",
          "body": "The term is \"Enshittification\" and it comes naturally with platform maturity and market stability.",
          "score": 1,
          "created_utc": 1737347595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7s8fvs",
      "author": "5ergio79",
      "body": "I work at Canon and shit like this pisses me off (I don’t work in that division, though). The charge is purely for revenue and budget targets. Nothing more I can say. Sorry everyone.",
      "score": 199,
      "created_utc": 1737197545.0,
      "replies": [
        {
          "id": "m7t5nvh",
          "author": "Crunktasticzor",
          "body": "Not at all surprising. Probably only a matter of time before Sony tries something similar",
          "score": 31,
          "created_utc": 1737212252.0,
          "replies": [
            {
              "id": "m7tj5pm",
              "author": "5ergio79",
              "body": "I can give a tiny bit of insider info that inventory is an issue across the board, yet, surprisingly, there’s a lot of demand. Unfortunately, nickel and dime bullshit like this is absolutely going to happen more and more. Stay tuned…",
              "score": 26,
              "created_utc": 1737216573.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7s218g",
      "author": "MovieGuyMike",
      "body": "My coffin will require a monthly subscription the way things are going.",
      "score": 128,
      "created_utc": 1737193519.0,
      "replies": [
        {
          "id": "m7s3i3f",
          "author": "prototype__",
          "body": "Umm technically that's how how burial plots already work! Just in blocks on 12 months.",
          "score": 64,
          "created_utc": 1737194464.0,
          "replies": [
            {
              "id": "m7stbbn",
              "author": "Aaron_Hamm",
              "body": "In the US, for now, you get the plot \"forever\".",
              "score": 26,
              "created_utc": 1737207750.0,
              "replies": [
                {
                  "id": "m7vdzgy",
                  "author": "hans_l",
                  "body": "I don’t know any place that do forever at single price anymore. They do 100 years (can’t remember if it’s 100y from burial or from death of survivorship) and you can buy multiple of those for cheap today’s price. If you give enough to your congregation maybe they’ll give you forever on their plot or mausoleum.",
                  "score": 11,
                  "created_utc": 1737237023.0,
                  "replies": [
                    {
                      "id": "m7vou1e",
                      "author": "Aaron_Hamm",
                      "body": "Must be local to where you live:\n\n[https://www.npr.org/sections/money/2018/04/17/603360426/how-american-cemeteries-promise-to-keep-your-grave-forever](https://www.npr.org/sections/money/2018/04/17/603360426/how-american-cemeteries-promise-to-keep-your-grave-forever)\n\n\"If you die in America, chances are the cemetery is going to promise to maintain your grave forever.\"\n\n[https://www.reddit.com/r/AskAnAmerican/comments/14vfieu/is\\_it\\_true\\_that\\_a\\_spot\\_in\\_a\\_cemetary\\_is\\_permanent/](https://www.reddit.com/r/AskAnAmerican/comments/14vfieu/is_it_true_that_a_spot_in_a_cemetary_is_permanent/)",
                      "score": 8,
                      "created_utc": 1737240361.0,
                      "replies": []
                    },
                    {
                      "id": "m7yukf0",
                      "author": "None",
                      "body": "Just bought one unfortunately, it’s forever.",
                      "score": 1,
                      "created_utc": 1737287419.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7s71uo",
              "author": "None",
              "body": "[deleted]",
              "score": -5,
              "created_utc": 1737196704.0,
              "replies": [
                {
                  "id": "m7s9r5k",
                  "author": "mythrowaway4DPP",
                  "body": "In the UK, you don’t legally own a burial plot. Instead, these spaces are leased out for a set period of time under what is known as an Exclusive Right of Burial. These rights permit you to dictate who can be buried on a space of land for some time.\n\nSource:\nhttps://wallacestuart.co.uk/guides/a-burial-plot-guide/#:~:text=In%20the%20UK%2C%20you%20don,of%20land%20for%20some%20time.",
                  "score": 16,
                  "created_utc": 1737198328.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7sjbs7",
          "author": "IamZeus11",
          "body": "Just like that game the outer worlds were you have to pay rent on your own grave",
          "score": 6,
          "created_utc": 1737203462.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7s01r3",
      "author": "Practical-Custard-64",
      "body": "That's the same as asking BMW why you have to pay to have heated seats if the hardware is there for them to work.",
      "score": 187,
      "created_utc": 1737192223.0,
      "replies": [
        {
          "id": "m7t6fnd",
          "author": "Keilly",
          "body": "To be fair, BMW also provides indicator hardware at no extra cost knowing that their drivers will never use it.",
          "score": 125,
          "created_utc": 1737212515.0,
          "replies": [
            {
              "id": "m7tjjjx",
              "author": "PhucItAll",
              "body": "If you think your life is pointless, just remember there is a guy in Germany installing indicator lights on BMWs.",
              "score": 43,
              "created_utc": 1737216692.0,
              "replies": [
                {
                  "id": "m8410el",
                  "author": "akeean",
                  "body": "Also in Germany it is someone's job to test if those indicators are in working order every few years (along with the rest of the car) and can have the car blacklisted from public roads if the issue is not remediated.",
                  "score": 1,
                  "created_utc": 1737347935.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7tciv1",
              "author": "dinichtibs",
              "body": "Epic burn",
              "score": 6,
              "created_utc": 1737214515.0,
              "replies": []
            },
            {
              "id": "m7x7hmx",
              "author": "brucebrowde",
              "body": "Rarely, but they do [sometimes](https://www.youtube.com/shorts/hdYkhGqIMP4)",
              "score": 1,
              "created_utc": 1737258373.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7v6294",
          "author": "DoubleJumps",
          "body": "After 6 months, kia remotely disabled some features in my car unless I got a monthly subscription.\n\nI'm still mad about it.  \n\nThere's no reason I should have to pay a monthly subscription to remotely lock and unlock my car when I can already check in with my car remotely by default with the app.  \n\nJust fucking dumb.",
          "score": 14,
          "created_utc": 1737234552.0,
          "replies": []
        },
        {
          "id": "m7sutrz",
          "author": "None",
          "body": "[removed]",
          "score": -55,
          "created_utc": 1737208334.0,
          "replies": [
            {
              "id": "m7svohx",
              "author": "DrMungkee",
              "body": "Sounds like MBAs pushing enshittification because only one metric matters to them: profit.",
              "score": 51,
              "created_utc": 1737208659.0,
              "replies": [
                {
                  "id": "m844cvw",
                  "author": "Advanced-Blackberry",
                  "body": "wtf? It’s a business. Its purpose is profit.  When has ANY car manufacturer given you heated seats for free? Or anything at all for free? ",
                  "score": 1,
                  "created_utc": 1737349423.0,
                  "replies": [
                    {
                      "id": "m85geub",
                      "author": "DrMungkee",
                      "body": "The point is you're paying for the hardware and then being charged arbitrarily to utilize it don't. Don't even pretend like that's ethical. \n\nThere's a reason people made a stink about it: usually when you give a company money, there's a fair value exchange happening. A company's purpose is profit. Good companies find ways to make profit by offering good value. Tacking on an arbitrary re-occurring fee with no added benefit the user is greedy and should be punished by not doing business with them.",
                      "score": 1,
                      "created_utc": 1737376716.0,
                      "replies": [
                        {
                          "id": "m85h547",
                          "author": "Advanced-Blackberry",
                          "body": "There’s nothing arbitrary about it. And the customer knows the non-heated seat price. They have a sticker price, they have no expectation of heated seats being available to them. They pay the sticker price with no misconception they are getting heated seats. If they change their minds later, they are able to pay a fee. What’s the issue here? There’s a hundred different options to the customer if they don’t want to pay the sticker price. ",
                          "score": 1,
                          "created_utc": 1737377058.0,
                          "replies": [
                            {
                              "id": "m85ivc2",
                              "author": "DrMungkee",
                              "body": "[\"You will own nothing and be happy.\"](https://en.wikipedia.org/wiki/You%27ll_own_nothing_and_be_happy)",
                              "score": 1,
                              "created_utc": 1737377833.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7t0o7t",
                  "author": "None",
                  "body": "[removed]",
                  "score": -43,
                  "created_utc": 1737210510.0,
                  "replies": [
                    {
                      "id": "m7t29cy",
                      "author": "DrMungkee",
                      "body": "I reject the premise that the only options are accept or cry. We can even take our money to companies that aren't awful to their customers.\n\nCompanies that do transparently greedy things loose the benefit of the doubt when they say there's an underlying \"benefit\" to unnecessary subscriptions.\n\nBoth scenarios are shit and neither deserves to be defended.",
                      "score": 29,
                      "created_utc": 1737211071.0,
                      "replies": []
                    },
                    {
                      "id": "m7u6llh",
                      "author": "deSuspect",
                      "body": "Yeah, they should haha done that so the cost of installing heated seats goes directly to people that want them lol",
                      "score": 2,
                      "created_utc": 1737223545.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7t0qy7",
              "author": "Dazed4Dayzs",
              "body": "You fell for the lie. Do you **honestly** believe they would put in parts at a loss hoping to make up the cost through a subscription on the backend? They are not taking a loss. They make a profit on the parts AND they charge a subscription. They know some people are fundamentally against subscriptions, so to not lose those car sales they offer a flat fee option as your tax to get out of the subscription models. Either way they get their extra money on top of the profit from the car, including the profit on the parts like the heated seats.",
              "score": 25,
              "created_utc": 1737210536.0,
              "replies": [
                {
                  "id": "m7t5w2d",
                  "author": "None",
                  "body": "[removed]",
                  "score": -24,
                  "created_utc": 1737212329.0,
                  "replies": [
                    {
                      "id": "m7tqy03",
                      "author": "Awkward_Pangolin3254",
                      "body": "Unrealized profit is *not* loss, no matter how badly the robber barons want us to believe it is. If you try to sell something for $20 that you paid $10 for, and only end up selling it for $15, you have *not* lost $5.",
                      "score": 9,
                      "created_utc": 1737218906.0,
                      "replies": []
                    },
                    {
                      "id": "m7tgnnt",
                      "author": "Strict_Ad1246",
                      "body": "It’s kinda hilarious seeing someone shill for real. Like not even cause he’s not getting paid to defend this terrible nonpoint lol yea I’m POSITIVE these companies are adding heated seats to every car and just eating the loss as opposed to oh idk just including the cost of parts in the final cost like literally every manufacturer does",
                      "score": 14,
                      "created_utc": 1737215805.0,
                      "replies": []
                    },
                    {
                      "id": "m7t6kd7",
                      "author": "Dazed4Dayzs",
                      "body": "That’s what you’re not understanding. You ARE paying for the heating element in the seats. The cost is included in the price of the car. When you pay the upfront price for the heated seats you are actually paying for it a second time. When you pay the subscription you are paying it multiple times over. Nobody receives a car with heated seats (working or not) that they didn’t pay for. The car manufacturers always make their money, and then some.",
                      "score": 18,
                      "created_utc": 1737212560.0,
                      "replies": [
                        {
                          "id": "m7taofz",
                          "author": "None",
                          "body": "[removed]",
                          "score": -9,
                          "created_utc": 1737213923.0,
                          "replies": [
                            {
                              "id": "m7tbhbz",
                              "author": "Dazed4Dayzs",
                              "body": "There never was a discussion. It was just you falling for an industry lie and me explaining the con. If you wish to keep on the blinders, that’s your decision.",
                              "score": 16,
                              "created_utc": 1737214182.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7u5gy6",
                      "author": "Max-Phallus",
                      "body": "They are selling the car at net profit so they can't make a loss if people don't enable the features. Why on earth do you think they would sell a car at a loss in hopes of people buying heated seats at some point? They don't, as that would make a loss.\n\nYou're right that there might be some merit to the idea of designing one type of chair, and a single production line process, but I completely disagree that the saving is passed onto the buyer.",
                      "score": 4,
                      "created_utc": 1737223210.0,
                      "replies": [
                        {
                          "id": "m7ysxrz",
                          "author": "homanagent",
                          "body": "I addressed this here:\n\nhttps://www.reddit.com/r/gadgets/comments/1i422l9/camera_owner_asks_canon_skies_why_is_it_5/m7yswel/",
                          "score": 1,
                          "created_utc": 1737286494.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7ucqj5",
                      "author": "jonfitt",
                      "body": "> Now I also added a caveat: that by reducing the number of configurations of car seats that has to be manufactured, there are savings to be had.\n\nAnd that’s the massive caveat that actually makes all of your previous logic irrelevant. \n\nThey save a huge amount by not having to maintain a separate manufacturing stream, and inventory for seats without the pennies of parts that make up a heating element. \n\nThey save money on not having to move stock around to make sure they have the right models in the right places. They also don’t have to spend time/money predicting and tracking how many of each they need and probably just giving them away anyway when the numbers are wrong. \n\nIt’s savings all the way down for a piddling amount of hardware.",
                      "score": 5,
                      "created_utc": 1737225394.0,
                      "replies": [
                        {
                          "id": "m7yswel",
                          "author": "homanagent",
                          "body": "No it doesn't.\n\nIt's still more expensive than if they didn't have those features on the seats (and the control system on the car) at all.\n\nMuch more expensive.\n\nSo if nobody subscribes, and no one one-off purchases it, then it's still a big loss.\n\nA lot of people here are saying: \"they don't make a loss because they're still making a profit on the car so the cost is already paid by the customer\".\n\nThat's not how it works:\n\nIf a BMW was sold in 2020 for £50'000, costing £30'000 to manufacture and made a profit of £20'000,\nthen when they add the electric heated seats at a cost of £1000, hoping to sell it for £2000, if no one buy it, it is considered a **loss**. The fact that they are still making £19000 doesn't mean they consider the new feature a win. Every feature that is considered, is looked at as a balance of value add vs. cost.",
                          "score": -1,
                          "created_utc": 1737286472.0,
                          "replies": [
                            {
                              "id": "m806n46",
                              "author": "jonfitt",
                              "body": "There is no chance nobody will want heated seats. It’s basically a standard feature in a lot of the US like air conditioning. It also will not cost them anywhere near £1000 to add it. It’s just an electric blanket built into the seat. \n\nSo they absolutely will need to build cars with it included.",
                              "score": 3,
                              "created_utc": 1737304886.0,
                              "replies": [
                                {
                                  "id": "m81buuo",
                                  "author": "homanagent",
                                  "body": "> There is no chance nobody will want heated seats\n\nEveryone also wants a Ferrari, it's not about want vs. don't want, it's Value added vs. cost, i.e. is the extra cost worth the value added in the customers eyes.\n\n> It’s basically a standard feature in a lot of the US\n\nI don't know about the US, I don't believe it because its not at all standard here so I asked chatGPT:\n\n*Electrically heated seats are not universally a standard feature in all cars sold in the U.S., but they are commonly included in many vehicles, especially in higher trims or luxury vehicles.*\n\nFYI, higher trim is **not** standard, you're paying extra for it, it's just a package deal.\n\n> It also will not cost them anywhere near £1000 to add it\n\nIt was an example using simple round numbers to prove a concept.",
                                  "score": -1,
                                  "created_utc": 1737316502.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7tcep3",
                      "author": "InsideOfYourMind",
                      "body": "Wow, engineer refuses to understand basic manufacturing principles. Surprise surprise. \n\nOdd hill to die on.",
                      "score": 12,
                      "created_utc": 1737214477.0,
                      "replies": [
                        {
                          "id": "m7u6k1u",
                          "author": "Max-Phallus",
                          "body": "Seems a bit harsh. Guy is saying that it's cheaper to produce a single type of seat, and a single manufacturing process. Which *might* be true. The only difference is that he's saying that the saving is passed onto the buyer.",
                          "score": 1,
                          "created_utc": 1737223533.0,
                          "replies": [
                            {
                              "id": "m844s1f",
                              "author": "Advanced-Blackberry",
                              "body": "He’s not saying the savings are passed on to the buyer. He’s just saying the buyers can pay to activate it or not.  He’s never stated what you said. ",
                              "score": 1,
                              "created_utc": 1737349617.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m844vaz",
                      "author": "Advanced-Blackberry",
                      "body": "Don’t bother using logic here. Reddit loves to call anyone explaining something logically a bootlicker or shill. ",
                      "score": 1,
                      "created_utc": 1737349660.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7sb1ib",
      "author": "CMDR_omnicognate",
      "body": "Given that the Nikon equivalent is free it does seem like a ripoff",
      "score": 66,
      "created_utc": 1737199073.0,
      "replies": [
        {
          "id": "m7suy5w",
          "author": "wantsoutofthefog",
          "body": "Sony’s webcam app is free too and they don’t restrict 3rd party lens manufacturers",
          "score": 42,
          "created_utc": 1737208382.0,
          "replies": []
        },
        {
          "id": "m7sgw9q",
          "author": "_EleGiggle_",
          "body": "Can you just use it with Canon cameras/webcams?\n\nBecause the affected people already bought the hardware without knowing this. In the future people might take it into account when buying a new camera.",
          "score": 6,
          "created_utc": 1737202251.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7tyfzt",
      "author": "Adeno",
      "body": "I hate shitscription. Bullshit like this makes me just decide to pirate software. Crack it then you don't have to put up with this shitscription scheme.\n\nBring back one time payment for software!",
      "score": 34,
      "created_utc": 1737221130.0,
      "replies": []
    },
    {
      "id": "m7sov5a",
      "author": "bezerko888",
      "body": "Any company forcing monthly fees for things that should not should go extinct. Shame.on people paying and enabling this shady practice.",
      "score": 58,
      "created_utc": 1737205958.0,
      "replies": []
    },
    {
      "id": "m7u19g4",
      "author": "KrackSmellin",
      "body": "We as consumers (read as NOT enterprise customers), need to fight back on EVERY SINGLE subscription service like this.  It’s complete bullshit and on top of everything else is morally wrong.\n\nWe are not a company where needing constant support for a product can justify this, this is just greed on every level.",
      "score": 15,
      "created_utc": 1737221972.0,
      "replies": []
    },
    {
      "id": "m7t4g1a",
      "author": "aryndar",
      "body": "Manufacturers want every single thing that we purchase, or want to purchase, go get that full functionality,  only with a monthly subscription.\n\nFor example, if you want heated seats in your new car, That's a subscription...",
      "score": 8,
      "created_utc": 1737211831.0,
      "replies": []
    },
    {
      "id": "m7u98hn",
      "author": "h3rpad3rp",
      "body": "Run away screaming from subscription bullshit like this or we'll soon find that everything is a subscription.",
      "score": 8,
      "created_utc": 1737224338.0,
      "replies": [
        {
          "id": "m7uk821",
          "author": "Pirate_King_Mugiwara",
          "body": "\"Sorry you need to pay $5.99 to access this comment.\"",
          "score": 5,
          "created_utc": 1737227669.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7s51gf",
      "author": "Galileominotaurlazer",
      "body": "Time to boycut canon products",
      "score": 28,
      "created_utc": 1737195448.0,
      "replies": []
    },
    {
      "id": "m7uymw6",
      "author": "Man_of_the_Rain",
      "body": "Cheap USB capture card is $20 and HDMI cable is $3. \n\nWhy should anyone pay $5 monthly to get worse image quality and video feed framerate?",
      "score": 6,
      "created_utc": 1737232184.0,
      "replies": []
    },
    {
      "id": "m7wja4a",
      "author": "fairlyoblivious",
      "body": "Because you idiots pay it?",
      "score": 6,
      "created_utc": 1737250233.0,
      "replies": []
    },
    {
      "id": "m7yzo4o",
      "author": "jakgal04",
      "body": "How funny, I specifically bought a Nikon Z5 because of this. I figured if Canon was scamming users on a subscription service to use their camera as a webcam, then they also must be a scam company.",
      "score": 6,
      "created_utc": 1737290122.0,
      "replies": []
    },
    {
      "id": "m7roirn",
      "author": "ill0gitech",
      "body": "The older 2.x Canon webcam software has a cap on FPS and resolution, without the monthly cost. Works perfectly fine for me in video calls",
      "score": 22,
      "created_utc": 1737184927.0,
      "replies": [
        {
          "id": "m7rvh3k",
          "author": "Superseaslug",
          "body": "That's still entirely unacceptable. You bought hardware and are being limited on the thing you bought because you won't pay them monthly",
          "score": 56,
          "created_utc": 1737189279.0,
          "replies": [
            {
              "id": "m7s9tpv",
              "author": "mythrowaway4DPP",
              "body": "Especially as there is no monthly cost to them.",
              "score": 18,
              "created_utc": 1737198371.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7rqw4a",
          "author": "JoeDawson8",
          "body": "Isn’t this the point of this exchange?",
          "score": 19,
          "created_utc": 1737186391.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7s0mhr",
      "author": "TheSkyking2020",
      "body": "I’m confused. Why doesn’t this person just get a cheap 4k USB capture hard and an HDMI cable and use OBS? OBS has a virtual camera button that turns one into webcam software you can use anywhere like Skype and Teams.",
      "score": 12,
      "created_utc": 1737192601.0,
      "replies": [
        {
          "id": "m7s56k2",
          "author": "ShatterSide",
          "body": "Many if not most general consumers are initially exposed to or search for 1st party software. Whether it's because if instruction manuals or the idea that 3rd party will not function as well doesn't matter.\n\n\nI know personally, even as extremely tech literate, I prefer to try first the 1st party software.",
          "score": 18,
          "created_utc": 1737195537.0,
          "replies": [
            {
              "id": "m7vlnb6",
              "author": "JoviAMP",
              "body": "Having been a techie teen in the 00's, I would feel the opposite and avoid the 1st party software because my experience is that it's primarily used for taking low resolution still photos and applying cheap editing effects like color filters or inserting clip art.",
              "score": 2,
              "created_utc": 1737239355.0,
              "replies": [
                {
                  "id": "m7vn3pf",
                  "author": "ShatterSide",
                  "body": "My comment was geared towards hardware and software in general, not just camera or editing software ;)",
                  "score": 3,
                  "created_utc": 1737239810.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7tp52f",
          "author": "LatinGeek",
          "body": "the question isn't 'why can't I use this camera as a webcam', the question is 'why is the official software to use this camera as a webcam $50/yr'",
          "score": 4,
          "created_utc": 1737218368.0,
          "replies": []
        },
        {
          "id": "m7san5p",
          "author": "None",
          "body": "[deleted]",
          "score": 5,
          "created_utc": 1737198843.0,
          "replies": [
            {
              "id": "m7su45m",
              "author": "Aaron_Hamm",
              "body": "If you're using it for work, why do you care about your employer paying a subscription?",
              "score": 4,
              "created_utc": 1737208062.0,
              "replies": [
                {
                  "id": "m7sxy7s",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1737209510.0,
                  "replies": [
                    {
                      "id": "m7syrpz",
                      "author": "Aaron_Hamm",
                      "body": "\nI don't know what to tell you, dude; the thread was about the cost and the free alternatives, and you brought up that the alternatives were a problem for work, so I pointed out that there's no cost to you using it if it's needed for work. \n\nNow you want to talk about the red tape for the license fee.\n\nYou almost certainly don't need a prosumer camera for your zoom meetings anyways, which is probably why you'd get so much pushback...\n\nAre you just here to argue, or...?",
                      "score": 7,
                      "created_utc": 1737209817.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7serrx",
              "author": "_EleGiggle_",
              "body": "You’ll probably have to use MS Teams or Zoom anyway. You can add OBS between it but it’s a learning curve, and not as straightforward.\n\nEdit: Or can you meanwhile directly host MS Teams or Zoom meetings with OBS? Like connecting your MS account like you would add your stream key.\n\nEdit 2: Why are people downvoting legit questions? You can’t convince anyone that OBS is easy to setup correctly, and stream a meeting on MS Teams or Zoom. I mean the ease of use from Zoom was a reason why an unknown company grew so much during COVID.",
              "score": 3,
              "created_utc": 1737201140.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7su0w7",
          "author": "Aaron_Hamm",
          "body": "This is what I was doing years ago",
          "score": 1,
          "created_utc": 1737208026.0,
          "replies": []
        },
        {
          "id": "m7ue5qu",
          "author": "ronimal",
          "body": "Because he already has this camera and in theory it can already provide that same functionality",
          "score": 1,
          "created_utc": 1737225827.0,
          "replies": []
        },
        {
          "id": "m7sqnur",
          "author": "BluestreakBTHR",
          "body": "For some reason, the video doesn’t output properly, and inconsistently. The resolution and frame rate sucks, too. Ask me how I know. Canon sucks.",
          "score": 0,
          "created_utc": 1737206696.0,
          "replies": []
        },
        {
          "id": "m7sem74",
          "author": "_EleGiggle_",
          "body": "How does HDMI work with your existing webcam that probably uses USB-A or USB-C? Or do you mean a HDMI to USB cable? Not sure what that would achieves though, I’m not too familiar with OBS.",
          "score": -2,
          "created_utc": 1737201059.0,
          "replies": [
            {
              "id": "m7skbpb",
              "author": "tylerderped",
              "body": "Most decent cameras have HDMI output.",
              "score": 7,
              "created_utc": 1737203945.0,
              "replies": []
            },
            {
              "id": "m7sla6c",
              "author": "andyooo",
              "body": "They mean that the camera also has \"clean HDMI\" output, and you can output that into an HDMI to USB capture card so it behaves like a webcam. But that is is completely missing the point. There are other ways to do it, yes, but that's not the issue here, it's Canon charging a subscription for software that doesn't merit it. It's not even needed to cover development, they can just charge for updates later if they want.",
              "score": 4,
              "created_utc": 1737204389.0,
              "replies": [
                {
                  "id": "m7sn1j6",
                  "author": "_EleGiggle_",
                  "body": "I see, I kinda assumed they would all use their own proprietary output instead but that’s good news.\n\nDo they have to pay the subscription if they connect the camera with HDMI? I can’t tell what the “EOS Webcam utility” actually offers.\n\nEdit: Is it for cheaper cameras without HDMI output, or what’s the added value?",
                  "score": 1,
                  "created_utc": 1737205175.0,
                  "replies": [
                    {
                      "id": "m7snkv4",
                      "author": "andyooo",
                      "body": "No, that's just the camera's functionality. I don't think OBS needed either, any webcam compatible app should work.\n\nBut while this is still scummy by Canon, their newer cameras like my R6 Mark II have a webcam function baked into the firmware, so there's no need for the Canon app, just connect the camera via USB and it's a regular webcam so the blog post the article is based on is exaggerating a bit.",
                      "score": 5,
                      "created_utc": 1737205409.0,
                      "replies": [
                        {
                          "id": "m7snqjt",
                          "author": "_EleGiggle_",
                          "body": "I see. That sounds pretty nice to not need any software at all anymore.\n\nBut yeah the subscription seems pretty scummy.\n\nEdit: I hope that Windows and Android offer that feature as well, so that any newish Android smartphone is instantly recognized as a webcam. They could probably make it part of the dialog when you plug it into a computer if you just want to charge or file access. It being mounted as a webcam could be an additional option.",
                          "score": 1,
                          "created_utc": 1737205478.0,
                          "replies": [
                            {
                              "id": "m7tgpr5",
                              "author": "andyooo",
                              "body": "It's already been added to newer Pixels, and I think to AOSP.",
                              "score": 2,
                              "created_utc": 1737215824.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7u2cpo",
                      "author": "Dick_Lazer",
                      "body": "I think EOS Webcam Utility is the free software that allows you to use a Canon as a basic webcam (probably through USB): https://en.canon-cna.com/cameras/eos-webcam-utility/\n\nEOS Webcam Utility Pro is the paid version and looks like it can be used wirelessly: https://www.usa.canon.com/cameras/eos-webcam-utility",
                      "score": 2,
                      "created_utc": 1737222295.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7tsphz",
      "author": "Lylyluvda916",
      "body": "I am gonna buy a webcam instead of paying that subscription.",
      "score": 4,
      "created_utc": 1737219416.0,
      "replies": []
    },
    {
      "id": "m7s1p7m",
      "author": "thesneakerspy",
      "body": "Everything in the future will become a subscription base business model, “you will own nothing, and you will be happy” - klaus Schwab",
      "score": 8,
      "created_utc": 1737193302.0,
      "replies": []
    },
    {
      "id": "m7rok3e",
      "author": "_Administrator",
      "body": "Why anyone still would buy canon? Honest question. Just a personal preference, or they have some amazing one of a kind tech?",
      "score": 14,
      "created_utc": 1737184949.0,
      "replies": [
        {
          "id": "m7rqzr9",
          "author": "critical2210",
          "body": "Lenses and accessories are exclusive to each manufacturer. If you already own a canon camera, it’s very difficult to switch to a different company because you will need to repurchase most of your gear. To a more minor extent, each camera has different controls, which also makes that difficult as well. \n\n(Source: went from canon EF to Nikon Z, my wallet hates me)",
          "score": 34,
          "created_utc": 1737186453.0,
          "replies": [
            {
              "id": "m7s05pa",
              "author": "the_man_inTheShack",
              "body": "but if you have a bunch of lenses from the previous (DSLR) range you can get adapters to work with most mirrorless cameras - had a few Canon DSLRs, next camera will (probably) be Sony using my old lenses with an adapter",
              "score": 7,
              "created_utc": 1737192294.0,
              "replies": [
                {
                  "id": "m7sj8jj",
                  "author": "_EleGiggle_",
                  "body": "Can you use the adapters without any loss of quality or settings/configuration?",
                  "score": 5,
                  "created_utc": 1737203417.0,
                  "replies": [
                    {
                      "id": "m7skkcy",
                      "author": "andyooo",
                      "body": "If going from DSLR to mirrorless there is no loss of quality cause the adapters are basically just spacers without any optics, but switching brands may (probably will) result in some settings not working due to the electronic communication between lens and camera.",
                      "score": 7,
                      "created_utc": 1737204058.0,
                      "replies": [
                        {
                          "id": "m7y5xvm",
                          "author": "nice_usermeme",
                          "body": "There are adapters that allow communication, iirc in the recent year a reliable canon EF-nikon z adapter came out, seen plenty of videos filmed on nikon with ef lenses",
                          "score": 1,
                          "created_utc": 1737272670.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7srbx7",
                      "author": "dotheit",
                      "body": "For Nikon, I don't know about Canon or others, there is no loss in quality or function for that (older) lens but glass/lenses made specifically for the new mirrorless bodies are usually much better, plus you do not have the extra bulk of the adapter.",
                      "score": 4,
                      "created_utc": 1737206965.0,
                      "replies": []
                    },
                    {
                      "id": "m7sy6lv",
                      "author": "nybbleth",
                      "body": "It works fine. Less so with metadata and autofocus unless you have a more expensive adapter that happens to be properly compatible.",
                      "score": 2,
                      "created_utc": 1737209597.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7sxzuz",
              "author": "nybbleth",
              "body": "I went from Pentax to Nikon Z... spending all that money on a modern full frame mirrorless... then adapting lenses I picked up used for 3 euros on it. That's the way to go >.>\n\nIs there not an EF to Z adapter?",
              "score": 2,
              "created_utc": 1737209527.0,
              "replies": [
                {
                  "id": "m7tlxry",
                  "author": "critical2210",
                  "body": "There might be, but one of the reasons I switched to Nikon Z over Canon R was that the glass was much cheaper for older high end gear, so part of me actually wanted to buy new lenses. \n\nI still have my canon 6D it’s still an awesome camera, and I use it to teach my friends how to take photos",
                  "score": 1,
                  "created_utc": 1737217412.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7ss7z4",
              "author": "beipphine",
              "body": "I have a Cannon AE1. It's my only camera. How do I use the $5 a month app?",
              "score": 1,
              "created_utc": 1737207320.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7sn26k",
          "author": "Redeem123",
          "body": "Because outside of these dumb business decisions, they still make good cameras. ",
          "score": 8,
          "created_utc": 1737205183.0,
          "replies": []
        },
        {
          "id": "m7rpfuh",
          "author": "SpicyRice99",
          "body": "They're one of the top brands for prosumer cameras",
          "score": 29,
          "created_utc": 1737185487.0,
          "replies": [
            {
              "id": "m7stx6m",
              "author": "Aaron_Hamm",
              "body": "Sure, but their peers are just as good\n\nCitation: I've used all 3 professionally.",
              "score": 7,
              "created_utc": 1737207986.0,
              "replies": []
            },
            {
              "id": "m7rqlmt",
              "author": "laserdicks",
              "body": "Not for long",
              "score": -19,
              "created_utc": 1737186212.0,
              "replies": [
                {
                  "id": "m7rrwrp",
                  "author": "SpicyRice99",
                  "body": "Why not?",
                  "score": 3,
                  "created_utc": 1737187016.0,
                  "replies": [
                    {
                      "id": "m7rt1th",
                      "author": "laserdicks",
                      "body": "Absurd pricing. The tech is too widespread and the producer market is now wide open. They got greedy and it'll cost them their market dominance",
                      "score": -11,
                      "created_utc": 1737187724.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7sfhr7",
          "author": "_EleGiggle_",
          "body": "During COVID they were the only ones who had those shitty webcams left for 2x to 4x the price.\n\nOn macOS I use my iPhone as webcam, great feature that works wireless. Although you need to login with the same Apple account. So if you get a MacBook from your employer, you can’t use your personal iPhone as a webcam. Unless you use the same Apple account which is probably a huge data security issue because now it uses your private iCloud instead. So your boss can access your person files (technically through the IT department), and you might accidentally store company files on your own iCloud.\n\nI have one of those MagSafe accessories that you anchor to your main monitor, and attach your iPhone to it. So you usually get a great angle with multiple monitors, and not just a view of the left or right side of your head through the often shitty inbuilt webcams in laptops. It won’t even come close to the actual video camera of a smartphone although you use a lot through compression and slow Internet speeds.",
          "score": 5,
          "created_utc": 1737201519.0,
          "replies": [
            {
              "id": "m7suwy3",
              "author": "_Administrator",
              "body": "Thanks for extra info",
              "score": 3,
              "created_utc": 1737208369.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7s71jl",
          "author": "jaredearle",
          "body": "If you own Canon lenses, you’ll buy Canon bodies.",
          "score": 4,
          "created_utc": 1737196699.0,
          "replies": [
            {
              "id": "m7sv4b8",
              "author": "_Administrator",
              "body": "Good point",
              "score": 1,
              "created_utc": 1737208447.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7uy9v0",
          "author": "unculturedperl",
          "body": "Lenses. Many are expensive and replacing them with another system would not be easy or even compare. I generally don't use their software, which also helps.",
          "score": 2,
          "created_utc": 1737232068.0,
          "replies": []
        },
        {
          "id": "m7s7ehx",
          "author": "lemlurker",
          "body": "I just like their interface, TBF I've never bought new but I've gone 550d, 1200d and now 90d all cannon, I still have one if the first lenses I ever bought and it's still compatible and after 15 years on the same basic interface it just makes sense, same reason I prefer DSLR over mirrorless, I prefer seeing the light I'm shooting myself over a screen or EVF",
          "score": 4,
          "created_utc": 1737196918.0,
          "replies": [
            {
              "id": "m7sv32e",
              "author": "_Administrator",
              "body": "Imagine you will have to pay subscription for shutter speed or snap number per month",
              "score": -1,
              "created_utc": 1737208434.0,
              "replies": [
                {
                  "id": "m7tznfy",
                  "author": "Dick_Lazer",
                  "body": "If Canon did that they would definitely lose market share. I have a Canon R8 and didn't even know about this webcam situation, but I've also never had any need or desire to use it as a webcam, that seems fairly niche. If I need a webcam I have a Logitech webcam, or could use my MacBook camera, my iPad or my iPhone. If it was a professional application, I'd likely have the Canon hooked up through a capture system to OBS or something. Using the Canon as a standalone webcam is a scenario I'll likely never encounter, that's basically how they get away with this.",
                  "score": 1,
                  "created_utc": 1737221491.0,
                  "replies": []
                },
                {
                  "id": "m7t1ds4",
                  "author": "lemlurker",
                  "body": "But I don't and never will?",
                  "score": 1,
                  "created_utc": 1737210759.0,
                  "replies": [
                    {
                      "id": "m7txbzi",
                      "author": "_Administrator",
                      "body": "You will, and your kids will also. Just wait a bit",
                      "score": 1,
                      "created_utc": 1737220796.0,
                      "replies": [
                        {
                          "id": "m7txnby",
                          "author": "lemlurker",
                          "body": "I ran a 12 yr old 1200d for 8 years and only upgraded because I wanted something that could do video, no. I won't.",
                          "score": 1,
                          "created_utc": 1737220890.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7tyu1q",
          "author": "Dick_Lazer",
          "body": "The form factor and ease of use. Maybe years of using Canon have helped, but I've also tried switching to Fuji and have had to use a Sony a lot at work, but I just never gel with them the way I do with Canon cameras.",
          "score": 1,
          "created_utc": 1737221249.0,
          "replies": []
        },
        {
          "id": "m7ru95s",
          "author": "Jindujun",
          "body": "Because with Canon you can!",
          "score": 0,
          "created_utc": 1737188491.0,
          "replies": [
            {
              "id": "m7sv61w",
              "author": "_Administrator",
              "body": "I can with Nikon also :-)",
              "score": 1,
              "created_utc": 1737208465.0,
              "replies": [
                {
                  "id": "m7svbaa",
                  "author": "Jindujun",
                  "body": ":)",
                  "score": 1,
                  "created_utc": 1737208520.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7tmbiy",
      "author": "KovolKenai",
      "body": "Ahh, rent seeking, one of the many forms of enshittification.",
      "score": 3,
      "created_utc": 1737217524.0,
      "replies": []
    },
    {
      "id": "m7tg6vd",
      "author": "mark503",
      "body": "A coworker needed a replacement Roku remote. She went on iOS App Store to get the free one. The top results were remotes that didn’t work with Roku.  They charged 19.99 for the app. It was a fake one. The real one was like the 3rd one down. \n\nNeedless to say she was furious about the fake app.",
      "score": 2,
      "created_utc": 1737215658.0,
      "replies": []
    },
    {
      "id": "m7u0q0i",
      "author": "ekquizit23",
      "body": "Was teetering between going with Canon or Nikon, guess I’ll buy Nikon products moving forward",
      "score": 2,
      "created_utc": 1737221813.0,
      "replies": []
    },
    {
      "id": "m7vsbe9",
      "author": "MajorEbb1472",
      "body": "Simple: Because people pay it",
      "score": 2,
      "created_utc": 1737241511.0,
      "replies": []
    },
    {
      "id": "m7vwvms",
      "author": "pingying",
      "body": "Fuck Canon.",
      "score": 2,
      "created_utc": 1737242974.0,
      "replies": []
    },
    {
      "id": "m7vxqjz",
      "author": "S_K_Y",
      "body": "Total scammerino",
      "score": 2,
      "created_utc": 1737243233.0,
      "replies": []
    },
    {
      "id": "m7u1tr6",
      "author": "antman441",
      "body": "What if you already have the app? Or are these only for new users?",
      "score": 1,
      "created_utc": 1737222139.0,
      "replies": []
    },
    {
      "id": "m7u7s2f",
      "author": "JimboNovus",
      "body": "Thank Adobe for ushering in the age of subscription everything.  \n\nIts extortion.  Adobe, quickbooks, Microsoft, and many more have switched completely to subscription based products and now objects are becoming subscription based.  \n\nSoon it will be the only way to have a refrigerator or tv or computer.",
      "score": 1,
      "created_utc": 1737223899.0,
      "replies": [
        {
          "id": "m7uh32o",
          "author": "duck1014",
          "body": "No.\n\nIt was Salesforce that started it all.",
          "score": 1,
          "created_utc": 1737226710.0,
          "replies": [
            {
              "id": "m7uu92w",
              "author": "JimboNovus",
              "body": "Adobe products are far more mainstream than Salesforce, which is focused exclusively for businesses. I run a nonprofit theatre company and do some graphic design and photography. Spending 500 a year for design software is not at all cost effective for me. I'm still using InDesign CS5 from 14 years ago. I am paying monthly for photoshop/lightroom, but only because the old photoshop camera raw can't read raw files from my camera.",
              "score": 0,
              "created_utc": 1737230770.0,
              "replies": [
                {
                  "id": "m7xohjj",
                  "author": "duck1014",
                  "body": "Again.\n\nSalesforce started it all.  Not Adobe.  Consumer products adopted subscription services because it's more profitable.\n\nAdobe just followed suit in increasing profits.",
                  "score": 0,
                  "created_utc": 1737264220.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7uc5hl",
      "author": "None",
      "body": "It's like you're actually just renting the hardware but with a balloon payment up front.",
      "score": 1,
      "created_utc": 1737225215.0,
      "replies": []
    },
    {
      "id": "m7ufhmn",
      "author": "wilhelmstarscream",
      "body": "Photoshop going subscription drives me crazy.",
      "score": 1,
      "created_utc": 1737226225.0,
      "replies": []
    },
    {
      "id": "m7uh3cp",
      "author": "chumlySparkFire",
      "body": "Canon USA SLEEZE, again",
      "score": 1,
      "created_utc": 1737226713.0,
      "replies": []
    },
    {
      "id": "m7uh5j1",
      "author": "_The_Professor_",
      "body": "skies?",
      "score": 1,
      "created_utc": 1737226730.0,
      "replies": [
        {
          "id": "m7ux0u2",
          "author": "GenericName187",
          "body": "Copy editing ain’t what it used to be. I read the article looking for the word skies, i thought maybe it was the name of the software. Nope.",
          "score": 2,
          "created_utc": 1737231665.0,
          "replies": [
            {
              "id": "m7uxmwr",
              "author": "_The_Professor_",
              "body": "It’s in the [original headline](https://out.reddit.com/t3_1i422l9?url=https%3A%2F%2Farstechnica.com%2Fgadgets%2F2025%2F01%2Fcanon-charges-50-per-year-to-use-a-900-camera-as-a-functional-webcam%2F&token=AQAAsxuMZ3D97NCZYpbXg7TqkJvr4MN5vYCM80BgGtmIWJJM9vsV&app_name=reddit.com). I cannot figure out what that word is doing there 🤔",
              "score": 1,
              "created_utc": 1737231862.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7um5xb",
      "author": "munkijunk",
      "body": "I have been thinking about upgrading my Canon DSLR - this gives me serious pause.",
      "score": 1,
      "created_utc": 1737228254.0,
      "replies": []
    },
    {
      "id": "m7uwltl",
      "author": "Mustang46L",
      "body": "I miss the good old days of premium freeware. People wrote software they needed or wanted and then.. just gave it to the people.",
      "score": 1,
      "created_utc": 1737231528.0,
      "replies": []
    },
    {
      "id": "m7vc8s0",
      "author": "brrrchill",
      "body": "That website has auto playing video ads WITH SOUND. Please block it as a source.",
      "score": 1,
      "created_utc": 1737236484.0,
      "replies": []
    },
    {
      "id": "m7vi70e",
      "author": "papercut2008uk",
      "body": "Why? Because other companies have put in monthly charges for stuff they have either already bought or are subscribed to and keep paying.\n\nThat is why, if you don't like it you have to stop paying for these services, everyone does.",
      "score": 1,
      "created_utc": 1737238277.0,
      "replies": []
    },
    {
      "id": "m7vp4zb",
      "author": "gourmetguy2000",
      "body": "My job is packaging software for a company . There is a huge trend of software companies switching to subscription models, and our software bill has risen massively because of it. I'd say most software I package is now subscription",
      "score": 1,
      "created_utc": 1737240460.0,
      "replies": []
    },
    {
      "id": "m7wxjqx",
      "author": "Alienhaslanded",
      "body": "That's a simple question to answer. Money.",
      "score": 1,
      "created_utc": 1737254965.0,
      "replies": []
    },
    {
      "id": "m7zmf4d",
      "author": "BakaOctopus",
      "body": "Love sony for this , plug in an usb and instantly turns into a webcam , no driver required. Also 1080p 60fps with af as it works in normal video mode.",
      "score": 1,
      "created_utc": 1737298947.0,
      "replies": []
    },
    {
      "id": "m83ahfx",
      "author": "hacksawjimduggans2x4",
      "body": "At the rate we’re going, none of us will be allowed to die without subscribing to an undertaker.",
      "score": 1,
      "created_utc": 1737338040.0,
      "replies": [
        {
          "id": "m8bcrvj",
          "author": "BenefitOfTheDoubt_01",
          "body": "In other words, Life Insurance becomes mandatory. In CA health insurance is already mandatory or you get a stiff fine when filing taxes. Sadly, what you're saying probably isn't far off.",
          "score": 1,
          "created_utc": 1737445582.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7t2lib",
      "author": "toasterstove",
      "body": "I was actually kinda shocked that I could plug my Fujifilm camera into my computer and it would detect it as a webcam, no software needed. \nThe canon one is so bad, I downloaded it and it would constantly run in the background with 100% CPU utilization and kill my battery. I thought my laptop had gone to shit but no it was this damn program. I love my Canon camera and I didn't buy it to use as a webcam, but it's not that crazy of a feature to expect to work",
      "score": 1,
      "created_utc": 1737211191.0,
      "replies": []
    },
    {
      "id": "m7u2zmd",
      "author": "scarabic",
      "body": "> Canon is a hardware company, not a software company, and they should—due to the lack of standards—provide software that allows you to use their cameras as intended.\n\n“Not a software company” is just wrong by a huge stretch. The hardware doesn’t work without a ton of software under the surface. \n\nIt also seems pointless and whiny to try to dictate what kind of company something is, and nonsensical to demand that they only charge for the one thing they are best known for, while providing any attendant products or services free. Where is that law written?",
      "score": 1,
      "created_utc": 1737222482.0,
      "replies": []
    },
    {
      "id": "m7v0j2t",
      "author": "ArenPlaysGames_R",
      "body": "Probably the stock market forces companies to seek profits whenever possible or else shareholders will leave",
      "score": 0,
      "created_utc": 1737232790.0,
      "replies": []
    },
    {
      "id": "m7y6c8t",
      "author": "None",
      "body": "Just use Cascable, not free but a one of and it's not expensive.",
      "score": -1,
      "created_utc": 1737272902.0,
      "replies": []
    },
    {
      "id": "m7uqngn",
      "author": "None",
      "body": "Because there is a cost to providing stuff after you sell a product. Someone has to pay. That’s why canon exists. You can’t bake that into the cost of the camera. Folks will buy the other guys camera because it was less expensive.",
      "score": -8,
      "created_utc": 1737229630.0,
      "replies": []
    }
  ]
}