{
  "post": {
    "title": "US 7th graders build solar suitcases to power 40 Ugandan refugee schools | These solar suitcases will provide light for studying, charging phones, and powering essential devices.",
    "author": "chrisdh79",
    "id": "1i2rgrk",
    "score": 1470,
    "created_utc": 1737041439.0,
    "selftext": "",
    "num_comments": 29,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i2rgrk/us_7th_graders_build_solar_suitcases_to_power_40/"
  },
  "comments": [
    {
      "id": "m7gp55p",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1737041440.0,
      "replies": []
    },
    {
      "id": "m7hs642",
      "author": "Della__",
      "body": "Have any of you even read the article?\n\nIt reads AI shit, it's riddled with ads and basically tells nothing of value besides the title.",
      "score": 99,
      "created_utc": 1737052708.0,
      "replies": [
        {
          "id": "m7jzbox",
          "author": "nybble41",
          "body": "If you want to know more about the actual project behind the story there is more concrete information here: \n\nhttps://wesharesolar.org/solar-suitcase/",
          "score": 39,
          "created_utc": 1737076926.0,
          "replies": []
        },
        {
          "id": "m7lhh6k",
          "author": "JustCrazyIdeas",
          "body": "You could link a news article to a gif of a streaming hot pile of shit, and redditors would blindly up vote it without clicking on the link if the title makes you feel good, reinforces a preconceived notion about something, and the thumbnail backs it's up. \n\nAt least this platform still has a down voting feature that in theory is a check against BS articles like this, but m ore often than in the past they're prevalence is making it challenging to stomp out shit content like this.",
          "score": 10,
          "created_utc": 1737100421.0,
          "replies": [
            {
              "id": "m7qgulx",
              "author": "Jimmeh1337",
              "body": "I feel like this has gotten really bad lately. Headlines and post titles are often misleading, and the top comments are almost always about some preconceived idea of what the article might be about. Barely anyone actually reads the article and comments on it.",
              "score": 2,
              "created_utc": 1737165235.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7j2gxm",
      "author": "koolaidismything",
      "body": "The impact this makes on both ends is nothing to snub at.. even if the physical systems don’t do a whole lot… it’s going to do wonders for those kids motivation on both ends. \n\nGives you something positive to grab onto and go for the ride.",
      "score": 12,
      "created_utc": 1737066129.0,
      "replies": [
        {
          "id": "m7m0bxn",
          "author": "Germanofthebored",
          "body": "I think you under-estimate the impact of artificial light in the equatorial region. In Uganda it's roughly 12 hours year round. That means without a light source you have to get all your work done between 6 am and 6 pm. So you can't study after you have had dinner, and you have to have dinner done right after you get home from school. \n\nEven simple electrical lanterns (lamp oil is an ongoing expense, and not cheap) can make a massive difference under these circumstances. Plus, the batteries can also charge cell phones, which are becoming the internet for many people in the global South. \n\nWhite LEDs with their high efficiency have become a massive help for these reasons, and I am sure that this is why the guy who developed the blue LED (a 10 cent part) got the Nobel in physics the year after the Large hadron collider (multi billion $ and an army of scientists) got it for the Higgs boson.",
          "score": 2,
          "created_utc": 1737112601.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7gqofm",
      "author": "tonytrouble",
      "body": "That is so cool and so nice, I hope we get some amazing educated Ugandans, because of this. Glory to education!",
      "score": 11,
      "created_utc": 1737041906.0,
      "replies": []
    },
    {
      "id": "m7i0dj0",
      "author": "None",
      "body": "Kids cleaning up our mess. \n\n\nEvery adult is pathetic.",
      "score": 5,
      "created_utc": 1737055068.0,
      "replies": [
        {
          "id": "m7id4rs",
          "author": "dan-theman",
          "body": "Wait until capitalism beats all the altruism out of them.",
          "score": 11,
          "created_utc": 1737058783.0,
          "replies": [
            {
              "id": "m7lxdqn",
              "author": "Grift-Economy-713",
              "body": "lol ask me how I know",
              "score": 1,
              "created_utc": 1737110856.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7lbftq",
      "author": "Any_Case5051",
      "body": "Build some for the US",
      "score": 1,
      "created_utc": 1737096793.0,
      "replies": []
    },
    {
      "id": "m7mi9ex",
      "author": "Big_Glove153",
      "body": "As an educator, I think this is a cool project. I can see a high school stem club leading younger students to do this as an impact/service project too. I like that they get shipped back for QA. I now want to know more about what similar opportunities are out there!",
      "score": 1,
      "created_utc": 1737120780.0,
      "replies": []
    },
    {
      "id": "m7rpwse",
      "author": "ReddFro",
      "body": "Stuff like this is cool. There ways you can get involved if you want to.\n\nWe’ve done a yearly charity event near us where we and our kids assemble stuff for charities (catnip purses for shelter cats, care packages and dog blankets for the homeless, etc.)\n\nThere are also “Kynd Kits” that you can assemble with our kids. Some are also care packages for the homeless, but some were more like this, like a solar charging station for a phone. My wife’s work (Adobe) buy them and even “pay” for each kit we build in money she can donate to a charity or non profit.",
      "score": 1,
      "created_utc": 1737185777.0,
      "replies": []
    },
    {
      "id": "m7sf97a",
      "author": "None",
      "body": "Love the idea but...I did the Peace Corps.  They can build things like that in country and give people jobs building it for waaaaay less.  Giving stuff doesn't help people, giving them the opportunity to help themselves helps people.",
      "score": 1,
      "created_utc": 1737201395.0,
      "replies": []
    },
    {
      "id": "m7w8f20",
      "author": "Farfalla_Catmobile",
      "body": "orphan-crushing machine vibes",
      "score": 1,
      "created_utc": 1737246589.0,
      "replies": []
    },
    {
      "id": "m7loe18",
      "author": "MetaVaporeon",
      "body": "so... they invented a case for sockets, to which you just need to plug a battery and solar panels and things you want to charge?",
      "score": 0,
      "created_utc": 1737104986.0,
      "replies": []
    },
    {
      "id": "m7kb0d4",
      "author": "CalintzStrife",
      "body": "US slave laborers build products for overseas warlords.\n\nBtw It's 250 bucks per 100w suitcase,  350 for 200w.\n\nThat stuff won't be seeing any Ugandan school.\n\nhttps://en.m.wikipedia.org/wiki/Child_soldiers_in_Uganda",
      "score": -2,
      "created_utc": 1737081028.0,
      "replies": []
    },
    {
      "id": "m7gzi43",
      "author": "Dmaxjr",
      "body": "What about child labor laws? How many suitcases does it take to power a school, let alone 40? Do they get breaks? Are we at least following common labor practices,of course forgoing the child labor? \n\n\nI have so many questions",
      "score": -22,
      "created_utc": 1737044485.0,
      "replies": [
        {
          "id": "m7h0ipp",
          "author": "_do_it_myself",
          "body": "They are building it as part of a learning project. Not child labor. Hands on learning. There are legit child labor problems, this isn’t one",
          "score": 20,
          "created_utc": 1737044779.0,
          "replies": [
            {
              "id": "m7he4dt",
              "author": "Dmaxjr",
              "body": "Pretty clearly a joke. Geez.",
              "score": -21,
              "created_utc": 1737048693.0,
              "replies": [
                {
                  "id": "m7hkuau",
                  "author": "PrimmSlimShady",
                  "body": "\"I have so many questions\"\n\nGood joke!",
                  "score": 8,
                  "created_utc": 1737050615.0,
                  "replies": [
                    {
                      "id": "m7hp1gf",
                      "author": "Dmaxjr",
                      "body": "Why thank you",
                      "score": -6,
                      "created_utc": 1737051816.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7i6zuu",
      "author": "ErickB4President",
      "body": "Next news article : 7th graders mysteriously deceased after building solar suitcases.",
      "score": -7,
      "created_utc": 1737056985.0,
      "replies": []
    },
    {
      "id": "m7hokg0",
      "author": "turbowhitey",
      "body": "Frickin 7 graders solved a problem. Not billionaires or elected officials, or scientists. 7th graders!!! Just shows where there’s a will there’s a way.  Give these kids a scholarship.",
      "score": -14,
      "created_utc": 1737051681.0,
      "replies": [
        {
          "id": "m7hsnqo",
          "author": "nybble41",
          "body": "The 7th graders assembled the kits as part of their STEM studies. They didn't design them, or supply the materials. In all likelihood they didn't even choose this particular project. They were one small part of a process which also required the support of billionaires and scientists.\n\nMore info from the original source, in case anyone's interested:\nhttps://wesharesolar.org/solar-suitcase/",
          "score": 23,
          "created_utc": 1737052848.0,
          "replies": [
            {
              "id": "m7hsxib",
              "author": "turbowhitey",
              "body": "Thanks! So totally misleading title then",
              "score": 0,
              "created_utc": 1737052925.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7is16x",
          "author": "ShenAnCalhar92",
          "body": "A scholarship for assembling parts that were handed to them, according to instructions that were handed to them?\n\nThis was basically slightly-more-complicated LEGO building.",
          "score": 6,
          "created_utc": 1737063097.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7jdrn6",
      "author": "checker280",
      "body": "So… child labor?",
      "score": -4,
      "created_utc": 1737069696.0,
      "replies": []
    }
  ]
}