{
  "post": {
    "title": "The first Nvidia RTX 5090 laptop benchmarks have emerged | Around 11 percent faster than the RTX 4090, but up to 40 percent ahead of the 3080 Ti",
    "author": "chrisdh79",
    "id": "1jlzead",
    "score": 1106,
    "created_utc": 1743180075.0,
    "selftext": "",
    "num_comments": 146,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jlzead/the_first_nvidia_rtx_5090_laptop_benchmarks_have/"
  },
  "comments": [
    {
      "id": "mk7nm25",
      "author": "semibiquitous",
      "body": "Razer needs to create an innovative technology for dealing with thermals rather than just underpowering the chips. Their copper heatsink designs haven't changed even from 2019 tech.  People won't complain if their razer laptop is 2mm thicker if it means they get 10% more GPU performance.",
      "score": 383,
      "created_utc": 1743180788.0,
      "replies": [
        {
          "id": "mk7sjm0",
          "author": "cuoreesitante",
          "body": "who has the best cooling now in a slim-ish gaming laptop? My Asus G14 with a 3070 throttled all the time as well.",
          "score": 70,
          "created_utc": 1743182184.0,
          "replies": [
            {
              "id": "mk87d6s",
              "author": "Irapotato",
              "body": "Slim\n\nPowerful\n\nCool\n\nPick two at most",
              "score": 150,
              "created_utc": 1743186466.0,
              "replies": [
                {
                  "id": "mk88vhr",
                  "author": "Kuli24",
                  "body": "I wish they made laptops like they used to.  They don't need to be slim as a paper.  Give them proper cooling.  A 1\" laptop is just as easy to carry around as a 1/4\" laptop.  Room for cooling.  Room for ports.",
                  "score": 63,
                  "created_utc": 1743186918.0,
                  "replies": [
                    {
                      "id": "mk8nvxt",
                      "author": "QuickQuirk",
                      "body": "There are still 1\" laptops out there that give you what you want. Often they're cheaper than the razor too.\n\nJust like there are the .5\" laptops like the razor that shave as much weight and size off as possible.\n\nThere are different needs and different manufacturers meet them. Personally, I like the laptop as small as practically possible for transport. I have a legion 7, which is excellent for thermals, but a bit bigger than I prefer: but the price was excellent.\n\nI'd be unhappy if all the laptops were the same, and I had no choice!",
                      "score": 23,
                      "created_utc": 1743191408.0,
                      "replies": [
                        {
                          "id": "mk8w731",
                          "author": "Kuli24",
                          "body": "But isn't the laptop just placed in a laptop bag or backpack?  What's the difference between 0.5\" and 1\" laptops in a backpack?",
                          "score": 3,
                          "created_utc": 1743193866.0,
                          "replies": [
                            {
                              "id": "mkayir8",
                              "author": "NuclearLunchDectcted",
                              "body": "I work from home. My job swapped up my desktop computer with a laptop and are doing the same with everyones computer when tech refresh comes up specifically because of recent floods/hurricanes/fires. They want us to be able to evacuate at a moments notice and just grab the laptop and go. I'd just need an extra monitor or two, or have them send me a couple. \n\nIt's basically a desktop replacement, never moves around. It's a light model because I'm not doing video or massive photo processing, I just SSH into network devices and RDP into different servers, but we have people that would need way more power than me and would need the thick/heave laptops.\n\nEDIT: I have traveled with light laptops and with heavy ones. It's not a big deal when you're just carrying it around your house. It is a big deal when you have to carry around extra pounds through a massive airport or walking around multiple sites in a city.",
                              "score": 5,
                              "created_utc": 1743219690.0,
                              "replies": []
                            },
                            {
                              "id": "mk97ef7",
                              "author": "fourthcumming",
                              "body": "The weight, it doesn't sound like much but the difference for me between carrying a Legion 5 laptop all day around my shoulder which only weighs a little over a pound less than my current laptop has made a big difference. ",
                              "score": 15,
                              "created_utc": 1743197317.0,
                              "replies": [
                                {
                                  "id": "mk9av25",
                                  "author": "QuickQuirk",
                                  "body": "exactly this. Especially when, for example, flying - And you want to pack your most expensive stuff, like camera and laptop, in your backpack.\n\nEvery half inch & half lb counts.",
                                  "score": 5,
                                  "created_utc": 1743198424.0,
                                  "replies": []
                                },
                                {
                                  "id": "mk9ruwi",
                                  "author": "toofarquad",
                                  "body": "Weight matters, but I prefer a little heft. It just feels more sturdy in general. These thin laptops aren't for me.",
                                  "score": 2,
                                  "created_utc": 1743204023.0,
                                  "replies": []
                                },
                                {
                                  "id": "mkavanp",
                                  "author": "Kuli24",
                                  "body": "Isn't it a tad more exercise then?  Then there's more time to game!",
                                  "score": 1,
                                  "created_utc": 1743218314.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mka3dhm",
                              "author": "Oops_I_Cracked",
                              "body": "This applies more to women than men, but not necessarily. My thin and light fits in my regular work purse. My chonky gaming laptop requires me to carry a large, ugly bag I would not otherwise have to deal with.",
                              "score": 2,
                              "created_utc": 1743207972.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mkbnh4g",
                          "author": "formershitpeasant",
                          "body": "What can I get with better thermals that has the same build quality? Bonus points for using the extra space for more battery too.",
                          "score": 1,
                          "created_utc": 1743233441.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mk9sssq",
                      "author": "ensoniq2k",
                      "body": "Still love my 2008 ThinkPad T43p. It's slick and pretty slim yet powerful (for its time) it's still twice as thick as a modern laptop",
                      "score": 2,
                      "created_utc": 1743204339.0,
                      "replies": []
                    },
                    {
                      "id": "mka30g3",
                      "author": "Oops_I_Cracked",
                      "body": "They do still exist, they just are not marketed as premium products because people want thin and sleek when it’s a premium product. \n\nAlso, I *own* a 1” thick relatively new gaming laptop and I own a 1/4” thick laptop. They are absolutely not “just as easy” to carry around. My 1/4” laptop fits in my purse. Taking the 1” gaming laptop anywhere means either 2 bags or moving anything I need from my purse to my laptop bag. Not to mention those good cooling systems in the thicc bois do in fact way quite a bit more than the thin laptops.",
                      "score": 3,
                      "created_utc": 1743207844.0,
                      "replies": [
                        {
                          "id": "mkav4ok",
                          "author": "Kuli24",
                          "body": "Maybe it's different when guys don't regularly carry a purse and then they have to carry their typical laptop bag.",
                          "score": 3,
                          "created_utc": 1743218245.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mkblaz7",
                      "author": "CorvetteGoZoom",
                      "body": "MSI Stealth isn't too bad. Just a grey square",
                      "score": 1,
                      "created_utc": 1743232008.0,
                      "replies": []
                    },
                    {
                      "id": "mkcixz7",
                      "author": "kurotech",
                      "body": "Thank you I would be fine with a chunky laptop as long as it had a great battery and a cooling system that doesn't sound like an a380 on takeoff as soon as I put something like war thunder or Arma on. And more than two USB ports hell give us back the expansion slot even.",
                      "score": 1,
                      "created_utc": 1743252349.0,
                      "replies": [
                        {
                          "id": "mkctaow",
                          "author": "Kuli24",
                          "body": "Heck yeah.  Full size usb A ports as well.  If you buy a gaming laptop, you often want to game, so make er thick.",
                          "score": 2,
                          "created_utc": 1743256490.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mkcyoxt",
                      "author": "Hug_The_NSA",
                      "body": "They still make tons of thick and beefy gaming laptops that have room for cooling.",
                      "score": 1,
                      "created_utc": 1743258410.0,
                      "replies": []
                    },
                    {
                      "id": "mkhj55t",
                      "author": "jeepsaintchaos",
                      "body": "It's not a gaming laptop, but I use Panasonic Toughbooks for everything. If it's going to leave the house, it's gotta be a Toughbook. My favorite is a CF-33, the garage laptop is a CF-C2, although I'm looking for a good deal on an FZ-55 now with all of the modular accessories. \n\nI will admit though, I tend to be hard on my electronics. And there's something satisfying about my electronics being bricks.",
                      "score": 1,
                      "created_utc": 1743320914.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mkcjtix",
                  "author": "Untinted",
                  "body": "> ~~Pick two at most~~\n\nPick one, realistically.",
                  "score": 9,
                  "created_utc": 1743252721.0,
                  "replies": []
                },
                {
                  "id": "mkb6k37",
                  "author": "XPav",
                  "body": "I’m sorry I can’t hear you over the fans",
                  "score": 7,
                  "created_utc": 1743223387.0,
                  "replies": []
                },
                {
                  "id": "mk8ofoq",
                  "author": "NightlyWave",
                  "body": "The M-series MacBook meet all three. Definitely not as powerful in terms of gaming performance (still good) but absolutely amazing at everything else. \n\nFor the insane price the laptop in the article will likely retail at, you could probably build a PC that outperforms it significantly and still have a decent amount of money left for a fairly decent laptop.",
                  "score": 3,
                  "created_utc": 1743191568.0,
                  "replies": [
                    {
                      "id": "mk9dfja",
                      "author": "ItzWarty",
                      "body": "The MacBooks also have 4x the battery life.\n\nI'm definitely considering making the switch and running windows in parallels..",
                      "score": 12,
                      "created_utc": 1743199248.0,
                      "replies": [
                        {
                          "id": "mk9fi7z",
                          "author": "dertechie",
                          "body": "It only works with ARM Windows, but if ARM Windows has good compatibility with the programs you use then that’s not a problem.",
                          "score": 5,
                          "created_utc": 1743199933.0,
                          "replies": [
                            {
                              "id": "mk9t47p",
                              "author": "NightlyWave",
                              "body": "You can run some Intel based x86-64 virtual machines through Apple Silicon but the performance is abysmal. Development is still in early stages but emulation might be feasible in the future. You were able to with UTM years ago but performance is understandingly terrible and not worth it. \n\nhttps://www.parallels.com/blogs/parallels-desktop-20-2-0/",
                              "score": 2,
                              "created_utc": 1743204446.0,
                              "replies": []
                            },
                            {
                              "id": "mkcqacs",
                              "author": "Haniasita",
                              "body": "also don’t forget that there are other options than virtualising windows. tools like gptk, whiskey and crossover are the same as wine on linux and run a lot of games and programs just fine",
                              "score": 1,
                              "created_utc": 1743255349.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mkbnmak",
                      "author": "formershitpeasant",
                      "body": "With the drawbacks of ARM",
                      "score": 1,
                      "created_utc": 1743233539.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mk8q7xj",
                  "author": "ChrisFromIT",
                  "body": ">Cool\n\nNot sure if cool looking or cool temperature wise.",
                  "score": 0,
                  "created_utc": 1743192088.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mk8f5ap",
              "author": "ivsciguy",
              "body": "I am MSi with a 3070ti.  I purposely got the thicker model, and it sends to stay cooler than my older MSI that had a 1070 and was much thicker.",
              "score": 4,
              "created_utc": 1743188767.0,
              "replies": []
            },
            {
              "id": "mk924pr",
              "author": "ToMorrowsEnd",
              "body": "you need to get that thing serviced.  get the cooling system re pasted as Asus is known for using thermal paste that dries up and stops conducting heat.",
              "score": 4,
              "created_utc": 1743195657.0,
              "replies": [
                {
                  "id": "mk92rnq",
                  "author": "cuoreesitante",
                  "body": "I sold that thing like a year ago now; I did repaste it myself but the difference wasn't night and day.",
                  "score": 2,
                  "created_utc": 1743195854.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mk9hlzg",
              "author": "dogrio345",
              "body": "From my experience Lenovo has been pretty solid in terms of cooling. I picked up a stand for when it's at my desk, just for safety's sake, but their Legion Slims are pretty decent in terms of keeping cool when under regular use. I had mine hit 40°C while playing something really intense, but the fans just needed some cleaning and afterwards stabilized pretty effectively",
              "score": 3,
              "created_utc": 1743200632.0,
              "replies": []
            },
            {
              "id": "mkal6ht",
              "author": "Disarmer",
              "body": "Eluktronics has their Liquid Propulsion system which is pretty good. It's air cooled if not connected to their Liquid Propulsion device, but when you're at your desk and you plug it in, it's a full watercooling system for the laptop. I have their older Max15 with a 3080 in it, been looking at getting one of the newer liquid cooled ones though.",
              "score": 3,
              "created_utc": 1743214320.0,
              "replies": [
                {
                  "id": "mkcmpos",
                  "author": "rubychoco99",
                  "body": "Adding on to this, even when playing cyberpunk the air cool system is enough to keep the laptop cool. I’ve stopped using the liquid cools system all together. My previous razer would almost burn my hands when playing, never had a problem with eluktronic.",
                  "score": 1,
                  "created_utc": 1743253917.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mk8hlb9",
              "author": "flexonyou97",
              "body": "I think a mac + cloud gaming would be the way to go if you have a solid internet connection",
              "score": -4,
              "created_utc": 1743189507.0,
              "replies": [
                {
                  "id": "mk8oc0a",
                  "author": "QuickQuirk",
                  "body": "macbook max models are pretty efficient for the subset of games they do run.",
                  "score": 6,
                  "created_utc": 1743191538.0,
                  "replies": [
                    {
                      "id": "mk917ru",
                      "author": "cuoreesitante",
                      "body": "Yep! Even with my M2 Pro Mac Mini I can play a ton of my Steam games, like Civ, Football Manager, and Stellaris. I only fire up my gaming PC for things like Elden Ring and Cyperpunk.",
                      "score": 3,
                      "created_utc": 1743195379.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mk8m2bl",
                  "author": "cuoreesitante",
                  "body": "I tried with my m2 pro mini and Nvidia now or whatever it is called, even with gigabit internet there were still input lag here and there. Not terrible but I wouldn't want to play FPS games on the regular with it.",
                  "score": 3,
                  "created_utc": 1743190866.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mk8rbl5",
          "author": "h3rpad3rp",
          "body": "Yeah I don't get it, pretty much anyone buying a laptop with a 5090 in it is going to be more concerned with performance than how thick the laptop is.\n\nIMO they shouldn't even be allowed to call it a 5090 when it doesn't match the 5090 desktop performance and specs. For example, depending on resolution, the game, and clock speed, a laptop 4090 has a 20-60% lower frame rate than the desktop 4090, even with the laptop plugged in to the wall.\n\nThe laptop cards should have to have a different naming scheme if they aren't the same. At least they used to add an M to the end of the model name.",
          "score": 22,
          "created_utc": 1743192413.0,
          "replies": []
        },
        {
          "id": "mk7tg8b",
          "author": "MVPizzle_Redux",
          "body": "It gets so fucking hot if it’s on your lap lol the fans being directly exposed on the bottom is such a stupid design choice",
          "score": 14,
          "created_utc": 1743182442.0,
          "replies": [
            {
              "id": "mk7x14t",
              "author": "semibiquitous",
              "body": "Not sure where they can place them. Blowing to the sides is going to be inefficient. Blowing hot air through the keyboard is not enjoyable for the hands and probably the keyboard itself.",
              "score": 14,
              "created_utc": 1743183460.0,
              "replies": [
                {
                  "id": "mk7xqxr",
                  "author": "MVPizzle_Redux",
                  "body": "I meant the intake needs another flat piece of plastic / metal so your legs don’t clock the airflow, that’s my biggest issue",
                  "score": 4,
                  "created_utc": 1743183665.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mk8ccu5",
              "author": "Sammyofather",
              "body": "You have to use one of those laptop pads for your legs bro. I was reading a study a while ago connecting hot laptops to skin cancer on the legs. Please correct me if I’m wrong but I’ve always been scared of that",
              "score": -1,
              "created_utc": 1743187944.0,
              "replies": [
                {
                  "id": "mk918id",
                  "author": "MVPizzle_Redux",
                  "body": "I’m not sure heat leads to cancer but you do you!",
                  "score": 9,
                  "created_utc": 1743195385.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mk9ptb0",
          "author": "TotallyFakeEngineer",
          "body": "My biggest complaint from Razer gaming laptops is their power port. That thing is just a brick if that fails. The pins are super easy to be bendable specially if the charger cable has to be looped around the laptop. I’m hoping USB C power charging has advanced enough to be able to produce us the required power to use the GPU if the original port fails. iirc there was news about it a year ago but nothing ever since",
          "score": 3,
          "created_utc": 1743203347.0,
          "replies": [
            {
              "id": "mkg4gku",
              "author": "lNesk",
              "body": "USB C are even more fragile but at least that is an easy repair",
              "score": 1,
              "created_utc": 1743296490.0,
              "replies": [
                {
                  "id": "mkg61yd",
                  "author": "TotallyFakeEngineer",
                  "body": "From experience I’ve never had any issue with USB C but yes you’re definitely right on that easy repair. Laptops also have multiple C ports so it’s even better",
                  "score": 1,
                  "created_utc": 1743297079.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mker88q",
          "author": "Agouti",
          "body": "The laptop 5090 isn't just a throttled desktop 5090, it's a completely different chip - the silicon itself is half the size, it's missing most of the ROPS, etc. Best to think of the laptop 5090 as a 5080m.",
          "score": 2,
          "created_utc": 1743279424.0,
          "replies": []
        },
        {
          "id": "mkdjozw",
          "author": "Dracekidjr",
          "body": "They also desperately need to find a way to dissipate heat better in their power supplies, which are known for getting outrageously.hot and then shitting the bed.",
          "score": 1,
          "created_utc": 1743265380.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mk7nzc8",
      "author": "trucorsair",
      "body": "Considering the 3080ti is four years old, this is hardly surprising.",
      "score": 142,
      "created_utc": 1743180893.0,
      "replies": [
        {
          "id": "mkca9yn",
          "author": "Kidney05",
          "body": "I love that it’s not that impressive of a bump so they had to throw in an older card to look better",
          "score": 16,
          "created_utc": 1743248224.0,
          "replies": []
        },
        {
          "id": "mk7w2cf",
          "author": "scruffles87",
          "body": "No it isn't. It just came out last year, right? Well, I'm off to huff something not sure what yet",
          "score": 31,
          "created_utc": 1743183188.0,
          "replies": [
            {
              "id": "mk83n2a",
              "author": "OldJames47",
              "body": "Have you considered ether?",
              "score": 10,
              "created_utc": 1743185358.0,
              "replies": [
                {
                  "id": "mk92zt3",
                  "author": "PuzzleheadedList6019",
                  "body": "A little old school but I’ll do it if you insist. it’s what mama would’ve done",
                  "score": 6,
                  "created_utc": 1743195925.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mk7w7s9",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1743183230.0,
          "replies": [
            {
              "id": "mk7zqpf",
              "author": "joe0185",
              "body": ">Was 3090 not a thing?\n\nThe 3080 ti was the highest tier available for laptops for that generation.",
              "score": 2,
              "created_utc": 1743184230.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mk7td5c",
      "author": "hyrumwhite",
      "body": "800% faster than the 960m",
      "score": 38,
      "created_utc": 1743182418.0,
      "replies": [
        {
          "id": "mkc1bxu",
          "author": "gladyxxx",
          "body": "Here I am still using my 960m laptop. \nDont hurt my feelings",
          "score": 6,
          "created_utc": 1743242852.0,
          "replies": [
            {
              "id": "mkd0qdb",
              "author": "Glass_Fix7426",
              "body": "860m here",
              "score": 1,
              "created_utc": 1743259110.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mkcdn6f",
          "author": "howardhus",
          "body": "i am still on voodoo3… is it faster than that?",
          "score": 2,
          "created_utc": 1743249930.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mk7nqho",
      "author": "MoretoYearn",
      "body": "$4400 laptop",
      "score": 101,
      "created_utc": 1743180823.0,
      "replies": [
        {
          "id": "mk8a2o0",
          "author": "fmaz008",
          "body": "16 gb of soldered ram, 1tb ssd.\n\n(Kidding... hopefully)",
          "score": 37,
          "created_utc": 1743187276.0,
          "replies": [
            {
              "id": "mk9f1g4",
              "author": "Elios000",
              "body": "whats funny is i bet there will be configs like that too",
              "score": 10,
              "created_utc": 1743199779.0,
              "replies": []
            },
            {
              "id": "mk9smhv",
              "author": "UngaBunga-2",
              "body": "Stop my 4070 laptop has 32gb soldered ram and came with 1tb (I upgraded to a 4tb mp600)😭",
              "score": 0,
              "created_utc": 1743204280.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mk7szq9",
      "author": "seethruyou",
      "body": "I'll keep my 4090, thanks.",
      "score": 19,
      "created_utc": 1743182312.0,
      "replies": [
        {
          "id": "mk8p6qw",
          "author": "QuickQuirk",
          "body": "5090 has managed to make the 4090 look like great value. (The 4080 also managed to make the 4090 look like good value)",
          "score": 11,
          "created_utc": 1743191788.0,
          "replies": [
            {
              "id": "mkddm4a",
              "author": "Eteel",
              "body": "And perhaps that is their plan for 6090 🤷‍♂️",
              "score": 3,
              "created_utc": 1743263388.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mk7mtpi",
      "author": "Silentmaelstrom",
      "body": "11% faster, now with 300% price!",
      "score": 79,
      "created_utc": 1743180565.0,
      "replies": [
        {
          "id": "mk7nvk8",
          "author": "semibiquitous",
          "body": "Not really. $4,500 for 5090. 4090 was released at $4,300.",
          "score": -16,
          "created_utc": 1743180862.0,
          "replies": [
            {
              "id": "mk7o8na",
              "author": "Silentmaelstrom",
              "body": "The 4090 was $1,600 MSRP when it was released. I got mine for just over that, so you're way off.",
              "score": -18,
              "created_utc": 1743180966.0,
              "replies": [
                {
                  "id": "mk7pdhv",
                  "author": "semibiquitous",
                  "body": "[You're full of shit. ](https://i.imgur.com/RFjTrsF.png)",
                  "score": -5,
                  "created_utc": 1743181286.0,
                  "replies": [
                    {
                      "id": "mk83e9k",
                      "author": "OMGItsCheezWTF",
                      "body": "Perhaps the parent poster is thinking of their desktop 4090 rather than a laptop with a 4090.",
                      "score": 19,
                      "created_utc": 1743185286.0,
                      "replies": []
                    },
                    {
                      "id": "mk7rvi2",
                      "author": "shaunrundmc",
                      "body": "Unless it \"fell off a truck\"",
                      "score": 3,
                      "created_utc": 1743181995.0,
                      "replies": []
                    },
                    {
                      "id": "mk7rqti",
                      "author": "Silentmaelstrom",
                      "body": "You said the 4090, not the laptop. You might want to learn how to communicate before engaging on social media 😂.",
                      "score": -39,
                      "created_utc": 1743181958.0,
                      "replies": [
                        {
                          "id": "mk7sdcp",
                          "author": "cuoreesitante",
                          "body": "bruh the entire context of this thread is on gaming laptops. you might want to learn how to read before engaging on social media",
                          "score": 24,
                          "created_utc": 1743182135.0,
                          "replies": []
                        },
                        {
                          "id": "mk7xujp",
                          "author": "Thelongdong11",
                          "body": "Nope you're the dumbass here",
                          "score": 13,
                          "created_utc": 1743183694.0,
                          "replies": []
                        },
                        {
                          "id": "mk7siw1",
                          "author": "Atilim87",
                          "body": "It’s a topic about **laptops**",
                          "score": 12,
                          "created_utc": 1743182178.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mk7z7v0",
      "author": "SarahArabic2",
      "body": "11% faster @ 75% price increase. /s",
      "score": 11,
      "created_utc": 1743184082.0,
      "replies": []
    },
    {
      "id": "mk85hvs",
      "author": "HiddenoO",
      "body": "What a dumb headline. \"Mediocre uplift compared to last gen, but if you compare it to some even older gen that hasn't been in production in years, it looks good\"",
      "score": 53,
      "created_utc": 1743185907.0,
      "replies": [
        {
          "id": "mk88aye",
          "author": "ahzzyborn",
          "body": "Most people don’t upgrade every generation because they know it’s not a good bang for your buck. This is saying hey if you have a 3000 series it might be worth the investment because this is a bit big jump over that",
          "score": 17,
          "created_utc": 1743186748.0,
          "replies": [
            {
              "id": "mkaadb6",
              "author": "nonresponsive",
              "body": "But why compare the 3080 to 4090 and 5090? Wouldn't it make sense comparing the 3090? Like, the 4090 was considered a sizeable upgrade compared to the 3090. \n\nNobody was comparing the 4090 to the 3080, because they weren't even in the same league. The headline feels a bit cherrypicked to make people think it's a bigger upgrade than it is. The 4090 was simply a beast of a card when it came out, nothing was close, especially in 4k.",
              "score": 7,
              "created_utc": 1743210434.0,
              "replies": [
                {
                  "id": "mkbelwy",
                  "author": "rockstopper03",
                  "body": "There is no 3090 laptop gpu, the highest gpu for the 3000 Gen laptops was the 3080ti.\n\n\nAnd yes, they need to add an \"m\" to seperate desktop 5090s from laptop 5090(m) since they are totally different chips with 4x higher power inputs. ",
                  "score": 10,
                  "created_utc": 1743227759.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mkcdkjd",
              "author": "howardhus",
              "body": "more like „hey 3080 guys, dont bother getting the latest 5090.. the 4090 is just as good for a way better price“",
              "score": 1,
              "created_utc": 1743249894.0,
              "replies": []
            },
            {
              "id": "mk8c09m",
              "author": "HiddenoO",
              "body": "Then, the 4090 would've also been a big jump over that. This whole idea of \"well, if your card is two generations old, this marginal upgrade from last gen might be worth it\" breaks down at the point that you realize you could've just upgraded at the end of last gen for almost the same performance uplift at a lower price.\n\nIt's the same nonsense that people are using to try and justify the desktop versions of the 5000 series. For what a 5000 series card costs you now in practice, you could've gotten a super version of a higher tier model a year ago and gotten better performance while also having it for an extra year.\n\nThey're just not good products at their price points. You might have to buy them because there's nothing else available, but that shouldn't be reflected in how reviews rate these products.",
              "score": 1,
              "created_utc": 1743187841.0,
              "replies": [
                {
                  "id": "mk8oka4",
                  "author": "Pitiful-Climate8977",
                  "body": "You’re really not the target market then. It’s that simple. Pointing to performance upgrades to older models is going to get sales for people with those models.\n\nDo you also make threads about how the newest iPhones are the same thing? Wanna know how many people use iphone 6-12 still and want to see the difference between theirs and the latest?\n\nThe world doesn’t revolve around you and how you think. You’re not their target market.\n\nIf I was going to look into a gaming laptop i would be weighing out getting the newest vs each generation. This one headline tells me a lot more than you huffing and puffing about it does.\n\nYou can sit here and make comparisons like you are all day about literally anything. You’re not actually contributing anything to the conversation.",
                  "score": 4,
                  "created_utc": 1743191607.0,
                  "replies": [
                    {
                      "id": "mk90fqy",
                      "author": "HiddenoO",
                      "body": ">Pointing to performance upgrades to older models is going to get sales for people with those models.\n\nThis is a reviewer, not an advertiser.\n\n>Wanna know how many people use iphone 6-12 still and want to see the difference between theirs and the latest?\n\nSo just put all possible phones people could have in the title? Choosing arbitrary previous ones makes no sense, no matter how you slice it.\n\n>You can sit here and make comparisons like you are all day about literally anything. You’re not actually contributing anything to the conversation.\n\nSo your contribution is making up lies about me, and that's better? Thank god Reddit has you!",
                      "score": -7,
                      "created_utc": 1743195144.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mk8otnb",
                  "author": "QuickQuirk",
                  "body": "I upgraded to the 40 series from the 30 series because it was a solid upgrade. I'll be skipping the 50 series, just like I skipped the 20 series.\nJust not getting me a performance improvement for my dollar.\n\nHoping the 60 series is better. Though, honestly, I'm so fed up with nvidia this generation that I'm going to have a hard look at whatever  AMD comes out with next gen.",
                  "score": 0,
                  "created_utc": 1743191682.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mkcg4hy",
          "author": "timeshifter_",
          "body": "Older gen and not even the same class. What a shit comparison.",
          "score": 1,
          "created_utc": 1743251101.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mk8pabe",
      "author": "willpowerpt",
      "body": "11% faster for a small 100% increase in price.",
      "score": 5,
      "created_utc": 1743191817.0,
      "replies": []
    },
    {
      "id": "mkeg8vq",
      "author": "fiftyshadesofseth",
      "body": "I disagree with the efforts to make gaming laptops thin. I'd rather have a powerful laptop that has good thermals and is thicker. Its not a macbook, its supposed to be thick.",
      "score": 3,
      "created_utc": 1743275800.0,
      "replies": []
    },
    {
      "id": "mk9fknp",
      "author": "wumbologist-2",
      "body": "What about a 3070 ti laptop? \n\nTrying to find a good deal on a 4090 or 5080 that's a real performance improvement.",
      "score": 2,
      "created_utc": 1743199955.0,
      "replies": []
    },
    {
      "id": "mkb8d3o",
      "author": "Glidepath22",
      "body": "Why do people bother upgrading in cases like this?",
      "score": 2,
      "created_utc": 1743224284.0,
      "replies": [
        {
          "id": "mkbfff2",
          "author": "rockstopper03",
          "body": "If you're upgrading from a 2080 or 3090 and the 4090s are out of production anyways.... ",
          "score": 1,
          "created_utc": 1743228258.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mkehgyy",
      "author": "Maiksu619",
      "body": "Who care if it burns your house down though?",
      "score": 2,
      "created_utc": 1743276208.0,
      "replies": []
    },
    {
      "id": "mk7ts9y",
      "author": "NahCuhFkThat",
      "body": "gets smoked by the fastest 4090 laptops LMAO",
      "score": 5,
      "created_utc": 1743182536.0,
      "replies": []
    },
    {
      "id": "mk90xvh",
      "author": "rjtapinim",
      "body": "Being 40% better then a lower tier 5 year old card isn't a brag. These 5090s are dog shit.",
      "score": 5,
      "created_utc": 1743195295.0,
      "replies": [
        {
          "id": "mk9nfhl",
          "author": "inbox-disabled",
          "body": "The 3080 Ti comparable from the article isn't even 4 years old.",
          "score": 2,
          "created_utc": 1743202563.0,
          "replies": [
            {
              "id": "mk9qokv",
              "author": "rjtapinim",
              "body": "3080 ti mobile was released on the 1st of feb 2022. Still dog shit to mislead people with mobile chips.",
              "score": 4,
              "created_utc": 1743203633.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mk87krl",
      "author": "BenjiSBRK",
      "body": "These titles are so confusing because of how Nvidia names its laptop GPUs. Mobile 5090 11% faster than 4090 mobile or desktop ?",
      "score": 3,
      "created_utc": 1743186529.0,
      "replies": [
        {
          "id": "mk8bnc4",
          "author": "piotrek211",
          "body": "they for sure meant the 4090 mobile because there is no way in hell it's faster than the desktop's version",
          "score": 8,
          "created_utc": 1743187735.0,
          "replies": [
            {
              "id": "mk8l5dh",
              "author": "BenjiSBRK",
              "body": "That's what I figured but the thing is there's no telling for sure",
              "score": 3,
              "created_utc": 1743190585.0,
              "replies": []
            },
            {
              "id": "mkhdw0n",
              "author": "Beautiful_Chest7043",
              "body": "Well 4090 mobile was as fast as 3090ti desktop.",
              "score": 1,
              "created_utc": 1743317471.0,
              "replies": [
                {
                  "id": "mki2bal",
                  "author": "piotrek211",
                  "body": "yeah but this gen even the desktop 5080 can't beat the 4090",
                  "score": 1,
                  "created_utc": 1743333232.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mk7qjzz",
      "author": "bonesnaps",
      "body": "How to set your genitals aflame 101",
      "score": 2,
      "created_utc": 1743181623.0,
      "replies": []
    },
    {
      "id": "mk7zuis",
      "author": "AspiringMurse96",
      "body": "So about a desktop 4080S vs desktop 5080, as expected",
      "score": 2,
      "created_utc": 1743184261.0,
      "replies": []
    },
    {
      "id": "mk829x0",
      "author": "ticuxdvc",
      "body": "I still prefer carrying a desktop gpu in a thunderbolt enclosure and otherwise keep my small/light laptop than a bigger/heavier combo device. I don't need my GPU when I take my laptop to work. I do need my GPU when I travel.\n\nBut the laptop market is trying to transition to ARM where eGPUs are not supported, and that makes me sad.",
      "score": 2,
      "created_utc": 1743184953.0,
      "replies": [
        {
          "id": "mk8bl0q",
          "author": "thedoc90",
          "body": "Considering you could get a 7800xt for $550 ish and an aio egpu dock for about $200 which should get you within 10% of the 4090 laptop's speed on paper, probably matched in practice because of how bad laptop thermals usually are I'd be inclined to agree that its more worth it to spend about $700 on a laptop and $750 on an egpu that 2k plus on a gaming laptop.",
          "score": 3,
          "created_utc": 1743187716.0,
          "replies": []
        },
        {
          "id": "mkalkby",
          "author": "Disarmer",
          "body": "How does that actually work in practice? Does the PC just seamlessly pick up the GPU when it's plugged in and just start working without issue? I've been curious about a setup like that but scared it may be more trouble than it's worth.",
          "score": 2,
          "created_utc": 1743214468.0,
          "replies": [
            {
              "id": "mkar5w2",
              "author": "ticuxdvc",
              "body": "Theoretically it's plug and play. Mine (a 2022 Dell XPS Plus 13inch with an i7 1260P) \"likes\" having the GPU connected at boot, as sometimes the plug and play doesn't wake up the nvidia driver and it doesn't recognize the GPU. Bitlocker throws a fit when it detects it because you've changed your \"internal\" devices. But once that is done, then it treats regularly. It keeps using the laptop's internal gpu (the processor igpu) for the window manager and less demanding applications, and then it uses the eGPU for games once you launch one.\n\nYou get a bit of a performance penalty because it can't carry the full 16 PCI-E lanes, but I can still get 60 fps of 4k (FFXIV) on my display with a 4070S on high settings.\n\nYou can get a bit more performance if you connect an external display directly on the gpu, as then the gpu doesn't have to send an image signal back through the same thunderbolt cable, but I've never played anything demanding enough to notice the difference. Plus, I use it when I travel so I only carry the laptop and the egpu.\n\nI'd say that overall it's a *bit* of a trouble (and you have to carry the darn thing too), but for my use case, I vastly prefer that than being stuck with a heavier gaming laptop all the time. Plus that means I can keep an older laptop and then \"hand down\" a GPU from my desktop to the enclosure. (The 5090 won't fit in it though, so the 4070S will probably be there for a while).",
              "score": 2,
              "created_utc": 1743216634.0,
              "replies": [
                {
                  "id": "mkbf4bt",
                  "author": "rockstopper03",
                  "body": "Very true. I got a great deal on an $1,540 open box best buy Asus rog G18 with an rtx 4080.\n\n\nBut the 18\" desktop replacement was way too heavy and bulky for bringing around. \n\n\nSo I settled on a half weight G16 oled w an 4070.\n\n\nAnd when I'm home, I game on my 9800x3d/rtx 5080 desktop w an 42\" flex oled. \n\n\nGaming laptops are all about compromises. ",
                  "score": 2,
                  "created_utc": 1743228072.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mk93qu7",
      "author": "CrashnServers",
      "body": "Ignore the melting chassis and throttling chips 🤣",
      "score": 2,
      "created_utc": 1743196158.0,
      "replies": []
    },
    {
      "id": "mkbbmu2",
      "author": "Portbragger2",
      "body": "bad",
      "score": 1,
      "created_utc": 1743226036.0,
      "replies": []
    },
    {
      "id": "mkcgsow",
      "author": "MyCleverNewName",
      "body": "Yikes...",
      "score": 1,
      "created_utc": 1743251405.0,
      "replies": []
    },
    {
      "id": "mkgnm4c",
      "author": "PapaBorq",
      "body": "And a 1,000% better than the 3DFX Voodoo. \n\nDumb.",
      "score": 1,
      "created_utc": 1743303824.0,
      "replies": []
    },
    {
      "id": "mkhggid",
      "author": "Classic-Break5888",
      "body": "How far ahead of the 290? Since random comparisons are a thing apparently?",
      "score": 1,
      "created_utc": 1743319140.0,
      "replies": []
    },
    {
      "id": "mkht77v",
      "author": "nipsen",
      "body": "One day, I hope, people will realize that even if the mobile chips were clocked as high as they could go, and even if they didn't throttle - that the performance you'd get out of it would at best match a desktop setup set to about 120W max.\n\nAnd that as it is now, when you can get 3d and CPU performance above the level required for 1080p@60fps inside 30 Watt, the dgpu design is completely pointless.\n\nBecause: you could, right now, put an almost ten year old gpu in a usb4 dock, and objectively beat the performance of any of these \"gaming\" laptops, even if you plugged the dock into a 30W max sliver of a laptop. Which would, with some tweaking, put you on a 150W budget with an old 2070rtx, for example. \n\nAnd then basically beat the tdp budget of a razer, as well as get more performance out of it for games. It would be as mobile, and it would be a laptop that wouldn't weigh a ton when you're not gaming. Etc, etc.\n\nWe could have that right now. But the industry wants to sell underclocked Intel chips with new rtx chipsets for 4k dollars. So that's what we're all reviewing. And sadly, it's what people genuinely think is reasonable to expect will be where the best performance is.\n\nBasically: unless you're a shill for useless products that genuinely make no sense to own - you don't matter in the tech sphere.\n\nAnd you chose this yourselves.",
      "score": 1,
      "created_utc": 1743327598.0,
      "replies": [
        {
          "id": "mki8p65",
          "author": "gkfisher",
          "body": "You make no sense.  I read that twice.  A desktop 2070!is loads slower than a 4090 or 5090 laptop.  Especially at the same TDP… let alone the technical advantages of DLSS 4 , etc.  \n\nCPU comments also - this generation has much better lower wattage performance.  \n\nIf your argument is Desktops are better for the same $$ - then yes..: nobody is debating that.",
          "score": 1,
          "created_utc": 1743336565.0,
          "replies": [
            {
              "id": "mkie0cd",
              "author": "nipsen",
              "body": "I chose to mention the 2070rtx because it is scoring about the same 3dmark score as the 4090 mobile does in lab-tests. \n\nI.e., when lifting the restrictions of watt in a theoretical, physically unattainable, scenario where the laptop-psu can deliver more than 175W and vent the heat - while also then throttling the cpu so that it'll only ever use less than 25W, without reduction in score -- then the 4090 mobile can score somewhat close in a practically useful performance-scenario to a soon decade old graphics card, that barely draws more power.\n\nBut you know best, don't you! And surely DLASS and frame-generation is going to magically improve the visual fidelity - on a rig that still does not have enough graphics grunt to avoid frame-dips when putting on the full shader budget.\n\nSpend your money however you want - but you can take the idea that it's somehow either a) a reasonable purchase, b) a technically impressive solution, c) a practical solution for gaming, c) a reasonably tweaked solution for an attainable tdp-budget goal - and just toss it down the drain along with your 5k dollars.\n\nBecause this bullshit - that you along with every kind of technical analphabet-press going on out there - is driving an industry that doesn't just produce bad products - it drives the industry that *could* produce good products to either not produce them at all. Or to tweak the other products in a way that targets unattainable performance/watt goals.\n\nSo I'm sitting here, for example, on a small laptop that - exactly like these \"gaming\" laptops - have been tweaked to have burst-performance so high that the entire thing throttles after 2 minutes of running. Regardless of load, it just throttles. I have graphite pads and liquid metal, custom cooling fans and ribs - and it's completely useless. Because the manufacturer is mandated to put in tweaks that make the WMI-score look good, and that has a peak on the synthetic marks that make the total result skewed upwards.\n\nIt's 100% useless - in fact even worse, it's detrimental - to gaming performance. \n\nBut you guys know best, don't you! Surely bigger numbers and better! And surely having a million cores on a graphics card that aren't used for 99% of the running time - is superb, on account of how someone, some day, are going to write CUDA code that puts cpu-routines and the final peak of 9999xsuper-sampling, temporally anti-aliased buffer-copy that moves the pixel-colours back and forth till everything is a superb blur of content that you can't recognize from the frontbuffer any more -- surely will make this bullshit product better for \"gamers\".\n\nStupidity. Organised stupidity to the point of mass delusion.\n\nBut surely Forbes little nepotistic son knows best, right? Surely Richard Leadbetter at Eurogamer, who literally works for Microsoft and any other company that offers \"insider scoops, whether he gets paid for it or not, while having so little technical understanding that he's physically incapable of questioning anything his sources dump in his inbox - surely they can be trusted, right! \"Straight from the source\", as one said, about Intel's whitepapers and the blogs that parrot them. Surely they must be giving me sound purchasing advice! /s",
              "score": 1,
              "created_utc": 1743339014.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mki86hv",
      "author": "gkfisher",
      "body": "I upgraded to a 5090 laptop from a 3080. Usually a 4 year upgrade cycle for me.   To me it’s a no brainer to grab a 5090 over 4090.  I do want frame gen, more RAM and a better cpu for the extra $800.  If I wanted value I would be getting a much lower spec and Xx90 wouldn’t be a discussion.  \n\nVery few should be going 4090->5090.",
      "score": 1,
      "created_utc": 1743336310.0,
      "replies": []
    },
    {
      "id": "mk7u1ny",
      "author": "RRoDXD",
      "body": "But can it run Mirror's Edge?",
      "score": 1,
      "created_utc": 1743182610.0,
      "replies": []
    },
    {
      "id": "mk7vcga",
      "author": "entaro_tassadar",
      "body": "Isn’t the main selling point on laptop better DLSS?",
      "score": 1,
      "created_utc": 1743182981.0,
      "replies": [
        {
          "id": "mkbfcjl",
          "author": "rockstopper03",
          "body": "At this point, other than the desktop 5090, which is unobtainable for 99% of people, the other 5000 series gpu's biggest selling point is the exclusive 3x and 4x frame gen feature of dlss4.\n\n\nThe older 3000 and 4000 Gen Nvidia gpus get the rest of the new dlss 4 features. ",
          "score": 1,
          "created_utc": 1743228209.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mk8ysts",
      "author": "DarklyDreamingEva",
      "body": "Don’t buy gaming laptops. Just don’t. Buy a desktop PC.",
      "score": -7,
      "created_utc": 1743194652.0,
      "replies": [
        {
          "id": "mkb1nn9",
          "author": "capt_fantastic",
          "body": "what about those of us who travel all the time and when home, live on a boat?",
          "score": 1,
          "created_utc": 1743221061.0,
          "replies": [
            {
              "id": "mkdtrtm",
              "author": "DarklyDreamingEva",
              "body": "![gif](giphy|11uYyAmGgTWwGQ)",
              "score": 1,
              "created_utc": 1743268615.0,
              "replies": [
                {
                  "id": "mke1pe2",
                  "author": "capt_fantastic",
                  "body": "https://imgur.com/a2xTGeN",
                  "score": 1,
                  "created_utc": 1743271078.0,
                  "replies": [
                    {
                      "id": "mke2vf8",
                      "author": "DarklyDreamingEva",
                      "body": "![gif](giphy|BPJmthQ3YRwD6QqcVD|downsized)\n\nP",
                      "score": 1,
                      "created_utc": 1743271450.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mk9v4b4",
          "author": "NutSlapper69",
          "body": "Or get both if you can afford it. The laptop is actually nice in some situations where you can’t bring/set up your pc.",
          "score": 0,
          "created_utc": 1743205118.0,
          "replies": []
        }
      ]
    }
  ]
}