{
  "post": {
    "title": "8BitDo's Pro 3 wireless gamepad features swappable ABXY buttons | Buyers also get TMR joysticks and a tactile D-pad",
    "author": "chrisdh79",
    "id": "1m1crb4",
    "score": 481,
    "created_utc": 1752672910.0,
    "selftext": "",
    "num_comments": 165,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m1crb4/8bitdos_pro_3_wireless_gamepad_features_swappable/"
  },
  "comments": [
    {
      "id": "n3g062q",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752672911.0,
      "replies": []
    },
    {
      "id": "n3g1tso",
      "author": "SaiyanRajat",
      "body": "8bitdo is making a better controller than actual console manufacturers.",
      "score": 300,
      "created_utc": 1752673437.0,
      "replies": [
        {
          "id": "n3hs2zc",
          "author": "SweetTea1000",
          "body": "1st party controllers have been inferior to 3rd party controllers for like a decade. The 1st parties have too much of a built in audience and guaranteed retail space. It means they don't actually need to compete. They can sell worse products at worse prices and still win.",
          "score": 13,
          "created_utc": 1752692166.0,
          "replies": [
            {
              "id": "n3p1nrc",
              "author": "JoostinOnline",
              "body": "That's not necessarily true. I have 8bitdo controllers, but I'll still take a Series X controller over them in most cases. Now don't get me wrong, the lower price easily makes up for it, but they're less sturdy and the hall effect joysticks don't offer the same amount of precision. Stick drift isn't nearly as much of a problem with Xbox controllers as with joycons.",
              "score": 3,
              "created_utc": 1752783652.0,
              "replies": [
                {
                  "id": "n3pmfja",
                  "author": "SweetTea1000",
                  "body": "As far as 8bitdo goes, I think they are probably the most prominent third party controller manufacturer these days & likely have the greatest variety of products, but if we're just talking your daily driver dual analog controller, I generally find that they always have a strong offering, but rarely the best one. Great value though. They've also improved over time. My first 8-bit due controller had a mechanical failure that I would put down to poor build quality, but newer models show substantial thought went into the redesigns.\n\nAnd as far as y'all effect goes, we're now 2 generations of technology ahead of that (remember, we had hall effect sticks in the '90s and they've never gone out of fashion in the flight Sim market). TMR replaced Hall Effect and now If you manufacturers are trying \" capacitative\" sticks, in both cases, the most substantial improvement is exactly what you're discussing, regaining the accuracy of a friction-based device without the fragility.\n\nEven when the first parties do catch up in technology. However, they still always charge you that brand premium, so it's never going to be a decent value proposition.",
                  "score": 5,
                  "created_utc": 1752789719.0,
                  "replies": [
                    {
                      "id": "n3ptinb",
                      "author": "JoostinOnline",
                      "body": "Ah, you clearly have more knowledge about this than I do. I appreciate the info. I'm going to look more into it. I do regularly see people acting like anything with Hall effect is the savior of everything, and that the $20 8bitdo controllers are top of the line.\n\nOut of curiosity what's a controller that you would say beats the Xbox series controller in build quality and features?",
                      "score": 2,
                      "created_utc": 1752792007.0,
                      "replies": [
                        {
                          "id": "n3r0yb1",
                          "author": "SweetTea1000",
                          "body": "I've been daily driving a MobaPad chitu, but I'm getting their Huben2 as an upgrade. That's me early adopting/trying the capacitative tech, though, so I can't actually make a recommendation there. (I also got the KingKong2, the 1st modern controller that repopularized hall effect and that was not a smooth day 1 experience, though they improved it on software updates. As you say, just because it's hall effect doesn't necessarily mean it's superior).\n\nAs a more direct Xbox controller upgrade, I'd recommend looking at the GameSir [G7 Pro](https://gamesir.com/products/gamesir-g7-pro?variant=45081456869610&country=US&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&gad_source=1&gad_campaignid=22689711499&gbraid=0AAAAAqORvwtcKaFntjb8qjQoodPfq0prV&gclid=CjwKCAjwvuLDBhAOEiwAPtF0VmwSSamHp5Ai82YlNWZrr_MLArqAyspgPAXjEDI5_Vbl8r3kydhaEBoC-dMQAvD_BwE). (The reviews for that are just coming out now.)",
                          "score": 3,
                          "created_utc": 1752807353.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n45hyb2",
                  "author": "lolic_addict",
                  "body": "Same experience with ps5 here. Less precision but won't drift in 6 months, is reconfigurable with less hassle and cheaper? Pretty good deal to me",
                  "score": 1,
                  "created_utc": 1753012781.0,
                  "replies": []
                },
                {
                  "id": "n463leo",
                  "author": "funforgiven",
                  "body": "> the hall effect joysticks don't offer the same amount of precision\n\nHow so?",
                  "score": 1,
                  "created_utc": 1753020992.0,
                  "replies": [
                    {
                      "id": "n46wd11",
                      "author": "JoostinOnline",
                      "body": "Take a look at [this](https://www.reddit.com/r/Controller/s/pzfksnnwyZ) for a detailed explanation. They've got a lot of drawbacks.",
                      "score": 0,
                      "created_utc": 1753029928.0,
                      "replies": [
                        {
                          "id": "n474zjx",
                          "author": "funforgiven",
                          "body": "This is two years old. Also, it wasn’t really about hall effect itself, but rather the quality of gamepads that used hall effect joysticks. Sampling rate or recentering design have nothing to do with hall effect technology specifically.\n\nBy the way, this controller doesn’t even use hall effect but TMR for the joysticks.",
                          "score": 1,
                          "created_utc": 1753032466.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n4gyjak",
              "author": "SuddenCompetition262",
              "body": "“Inferior” is a stretch",
              "score": 1,
              "created_utc": 1753158913.0,
              "replies": [
                {
                  "id": "n4hf2gw",
                  "author": "SweetTea1000",
                  "body": "Worse value",
                  "score": 1,
                  "created_utc": 1753167317.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3g9lub",
          "author": "None",
          "body": "[deleted]",
          "score": 44,
          "created_utc": 1752675788.0,
          "replies": [
            {
              "id": "n3hhafr",
              "author": "rowrowfightthepandas",
              "body": "Huh, I've been using the same pro controller since 2018 and it's been serving me dutifully. I've gone through joy cons like crazy but the pro controller lasted.\n\nThat being said, I got two 8bitdo's after killing one too many Xbox analog sticks, and so far they're amazing. I heard some people complain about \"mushy buttons\" but that isn't my experience at all. They feel fine.",
              "score": 22,
              "created_utc": 1752689180.0,
              "replies": [
                {
                  "id": "n3hjz2w",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1752689924.0,
                  "replies": [
                    {
                      "id": "n3hvpu1",
                      "author": "raihidara",
                      "body": "My only issue with the ultimate 2C is the d-pad is very inaccurate so it's not a good choice for most retro gaming",
                      "score": 2,
                      "created_utc": 1752693174.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3kyn51",
                  "author": "CloakNStagger",
                  "body": "Personal anecdote but my Pro controller also suffered severe stick drift over time. Its sad because everything else about that controller is really nice.",
                  "score": 3,
                  "created_utc": 1752731174.0,
                  "replies": []
                },
                {
                  "id": "n3jfe28",
                  "author": "wunkdefender2",
                  "body": "Same. My switch pro controller has been trucking along just fine all these years",
                  "score": 0,
                  "created_utc": 1752709311.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3l7ppq",
              "author": "Filter55",
              "body": "No yeah, I’ve been the number 1 hater of Nintendo branded controllers every since the joycons. Those felt terrible, the pro controller felt terrible AND cheap, and it feels like nothings been addressed with the switch 2 in terms of ergonomics. All my controllers now are either Hori or 8bitdo.",
              "score": 1,
              "created_utc": 1752735811.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3gq3oj",
          "author": "definitelytheNSA",
          "body": "And the pricing is actually reasonable too",
          "score": 15,
          "created_utc": 1752680376.0,
          "replies": [
            {
              "id": "n3jgz7p",
              "author": "antpile11",
              "body": "The Pro 3 is $20-$30 more expensive than the Pro 2. That seems like a pretty steep price hike since it's almost twice as much.",
              "score": 9,
              "created_utc": 1752709863.0,
              "replies": [
                {
                  "id": "n3l2kys",
                  "author": "AbhishMuk",
                  "body": "And they’ve removed the replaceable battery bit too :(",
                  "score": 1,
                  "created_utc": 1752733150.0,
                  "replies": [
                    {
                      "id": "n3l8ey0",
                      "author": "ypeelS",
                      "body": "it comes with a dock, it should be fully charged every time you pick it up",
                      "score": 0,
                      "created_utc": 1752736189.0,
                      "replies": [
                        {
                          "id": "n3l8vvl",
                          "author": "AbhishMuk",
                          "body": "True, it’s just that often batteries are the first thing to go. It’s nice if it’s replaceable. What’s more disappointing is that the pro 2 already *had* it.",
                          "score": 3,
                          "created_utc": 1752736442.0,
                          "replies": [
                            {
                              "id": "n3l9f8l",
                              "author": "ypeelS",
                              "body": "It's replaceable batteries or a dock, can't have both, some kid might throw it on the dock with non-rechargeable batteries",
                              "score": -2,
                              "created_utc": 1752736738.0,
                              "replies": [
                                {
                                  "id": "n3lbo4o",
                                  "author": "antpile11",
                                  "body": "They could easily use a form factor of battery that only comes rechargeable, such as a 18650.",
                                  "score": 2,
                                  "created_utc": 1752738005.0,
                                  "replies": [
                                    {
                                      "id": "n3lbzzp",
                                      "author": "ypeelS",
                                      "body": "not only are 18650s way too big but no one has 18650s just laying around like they do with AA",
                                      "score": -3,
                                      "created_utc": 1752738190.0,
                                      "replies": [
                                        {
                                          "id": "n45e16j",
                                          "author": "Peter_Nincompoop",
                                          "body": "Nobody has extra smartphone batteries lying around either, but the point is, they’re rechargeable and replaceable. When you feel you need a new one, you can order one and replace it.\n\nNon-replaceable batteries are a terrible idea in every aspect",
                                          "score": 1,
                                          "created_utc": 1753010919.0,
                                          "replies": [
                                            {
                                              "id": "n46i2qz",
                                              "author": "ypeelS",
                                              "body": "what smartphone in 2025 has a replaceable battery?",
                                              "score": 1,
                                              "created_utc": 1753025599.0,
                                              "replies": [
                                                {
                                                  "id": "n46rs55",
                                                  "author": "Peter_Nincompoop",
                                                  "body": "They do still exist. They’re all running Android, and none are high end, but they do still make them.\n\nHow does that negate the fact that replaceable is infinitely better for the consumer than non-replaceable? Batteries are what wear first on electronics.",
                                                  "score": 1,
                                                  "created_utc": 1753028546.0,
                                                  "replies": [
                                                    {
                                                      "id": "n46u1gs",
                                                      "author": "ypeelS",
                                                      "body": "Not on a video game controller, that would be the sticks. To claim 3rd party controller makers are anti consumer by making the batteries internal is wild considering they did what Sony/Microsoft/Nintendo refuse to do and are going hall effect anything. \n\nI have an 8Bitdo Ultimate 2 and being able to pick up a fully charged controller every single time is \"infinitely better\" no having to swap batteries mid play, don't have to make sure my spare batteries are fully charged, don't have to worry about anything honestly. Absolute worst case I use it for 20 hours straight and run the battery down, plugging in a Type C cable is still easier than changing batteries",
                                                      "score": 1,
                                                      "created_utc": 1753029232.0,
                                                      "replies": [
                                                        {
                                                          "id": "n46vf2p",
                                                          "author": "Peter_Nincompoop",
                                                          "body": "How’s that work out for you when you play long enough that the batteries die mid-game? You gonna sit there and wait for your controllers to recharge?",
                                                          "score": 1,
                                                          "created_utc": 1753029646.0,
                                                          "replies": [
                                                            {
                                                              "id": "n46vure",
                                                              "author": "ypeelS",
                                                              "body": "if you read my previous response, While extremely unlikely given the rated battery life, I would just plug in a Type C cable which is faster than swapping batteries",
                                                              "score": 1,
                                                              "created_utc": 1753029777.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3k05de",
          "author": "signfang",
          "body": "The only thing they're missing is the taptic motor right now.",
          "score": 3,
          "created_utc": 1752716683.0,
          "replies": []
        },
        {
          "id": "n3h3pz7",
          "author": "Kevadu",
          "body": "I'm not sure about this.  I bought an Ultimate 2 and the triggers failed in just a couple of months.  And apparently that's a *really* common issue.\n\nWhat's the point of having sticks that don't drift if something else fails instead?",
          "score": 12,
          "created_utc": 1752685543.0,
          "replies": [
            {
              "id": "n3hbi0j",
              "author": "madmofo145",
              "body": "Yeah, I've been super tempted buy some of their recent releases, but I've heard a few too many horror stories. \n\nIt seems to me like the big thing they need to do is slow down. Their release pace of late has been a bit much, and it seems like they aren't working out all the kinks. More just a throw every bell and whistle at it and hope for the best.",
              "score": 2,
              "created_utc": 1752687629.0,
              "replies": []
            },
            {
              "id": "n3l6bx5",
              "author": "The_Owl_Man_1999",
              "body": "the right trigger on my ultimate failed after 3 months exactly, I ended up just getting a gamesir because you can just walk in and buy one but I do want this pro 3 so I have a playstation layout controller too",
              "score": 1,
              "created_utc": 1752735092.0,
              "replies": []
            },
            {
              "id": "n3h4uuz",
              "author": "LoBFCanti",
              "body": "Not to say that have to- but the triggers are pretty easy to replace if you dont want to wait on customer service. I've done surgery on a lot of joycons, and I'd risk an 8bitdo button fix over assured joycon drift. I have had the same controller for 2 yrs",
              "score": 0,
              "created_utc": 1752685852.0,
              "replies": [
                {
                  "id": "n3hku9s",
                  "author": "Dt2_0",
                  "body": "I bought 2 Ultimate 2 Cs, both failed completely, no power, no nothing within 2 weeks of purchasing.\n\nFirst was exchanged with the retailer, 8Bitdo offered to replace the second, but could not cover shipping, which was going to be about 60% of the cost of the controller itself.\n\nOverall, for a company so hyped, I was left disappointed, and decided not to continue purchasing from them.",
                  "score": 5,
                  "created_utc": 1752690163.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3h6xyi",
              "author": "fnv_fan",
              "body": "That's why you buy GameSir controllers instead. Much better than 8BitDo imo",
              "score": -3,
              "created_utc": 1752686411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3ihqh7",
          "author": "rebbsitor",
          "body": "Yep!  I love my 8bitdo Pro 2 controllers.  I was going to buy an extra set to have as a backup because they're great.  \n\nGuess I'll get the Pro 3.  I've always wanted to have swappable a/b and x/y buttons for use on PC.  They're mapped correctly but the text on the buttons are swapped if you're not using a Nintendo Switch.",
          "score": 2,
          "created_utc": 1752699292.0,
          "replies": []
        },
        {
          "id": "n3jn2mb",
          "author": "Wetzilla",
          "body": "I dunno, I have an Ultimate 2 and it basically gathers dust. It just feels cheaper than an xbox or playstation controller. It also for some reason doesn't use x-input in bluetooth mode so it doesn't work well with windows.",
          "score": 1,
          "created_utc": 1752711996.0,
          "replies": []
        },
        {
          "id": "n3ko9yd",
          "author": "The8Darkness",
          "body": "If only their controller names were as good as the controllers or they had some table clearly stating what is the best/newest and the features in general.\n\nLike Ultimate Bluetooth, Ultimate 2C, Ultimate Wireless, Ultimate 2C Wireless, Ultimate 2.4G, Ultimate 3-mode, Ultimate wired, Ultimate C wired, Ultimate 2C wired.\n\nAnd thats just the \"ultimate\" line.\n\nPlus it would be great if they could make a dongle that supports multiple controllers, not really a fan of having 8 dongles plugged into my pc at all times.",
          "score": 1,
          "created_utc": 1752726241.0,
          "replies": [
            {
              "id": "n3ls69z",
              "author": "alvenestthol",
              "body": "The Pro line is the one line that does it well\n\nDespite evolving out of the retro-imitation line with names like SF30, the Pro line just has the Pro, Pro 2, and Pro 3",
              "score": 1,
              "created_utc": 1752747278.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3kqpbx",
          "author": "zexton",
          "body": "the c2 ultimate wireless is a 30 euro controller, that has hal effect triggers and sticks, turbo/button change without software, 1000hz with the included dongle on for pc,  \n\nafter trying a hal effect controller, there are no way im going back, \n\n  \nfun fact, you need a xbox controller dongle for pc to get lower inputlag.. with the xbox series controller using bluetooth against the 8bitdo c2 wireless 1000hz,\n\nthere is 15ms difference in input lag,",
          "score": 1,
          "created_utc": 1752727351.0,
          "replies": []
        },
        {
          "id": "n3l22hh",
          "author": "JWayn596",
          "body": "They were, but with this release? They’re jumping on board with the shittiest release ever. \n\nNon removable batteries? No more AA support? Are you fucking kidding me? Now they’re just like the rest of them.\n\nI don’t give a damn they got extra buttons.\n\nThey turned their best product into a brick. Stock up on Pro 2’s",
          "score": 1,
          "created_utc": 1752732891.0,
          "replies": []
        },
        {
          "id": "n3okjdy",
          "author": "Oregonrider2014",
          "body": "I LOVE mine.",
          "score": 1,
          "created_utc": 1752778731.0,
          "replies": []
        },
        {
          "id": "n3gtqbx",
          "author": "BlumpFromTheDump",
          "body": "That’s exactly why we aren’t allowed to use them on PS5",
          "score": 2,
          "created_utc": 1752682661.0,
          "replies": []
        },
        {
          "id": "n3hp2xo",
          "author": "KFUP",
          "body": "Yup, both 8bitdo and GameSir have ridiculously good price to quality ratio. \n\n[GameSir's Tegenaria Lite](https://www.youtube.com/watch?v=trLhXZKmjiE) is like $20 and has hall effect sticks, Nintendo's new $85 \"Pro\" [joke of a controller](https://www.youtube.com/watch?v=awEY5OGvIXE) doesn't, it has the same old, cheap drift prone potentiometers.",
          "score": 2,
          "created_utc": 1752691345.0,
          "replies": []
        },
        {
          "id": "n3g5hzg",
          "author": "SloppityMcFloppity",
          "body": "Well, yes, they're a peripheral company. Not a console company.",
          "score": -40,
          "created_utc": 1752674566.0,
          "replies": [
            {
              "id": "n3gegci",
              "author": "hitfly",
              "body": "Please explain all the 3rd party peripherals I had as a kid.",
              "score": 15,
              "created_utc": 1752677176.0,
              "replies": [
                {
                  "id": "n3ircw3",
                  "author": "nocrashing",
                  "body": "Well son when a first party peripheral and a second party peripheral love each other very much",
                  "score": 3,
                  "created_utc": 1752701960.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3gyvzs",
              "author": "speculatrix",
              "body": "I understand your logic. If their peripherals were junk, they'd be dead in the water.",
              "score": 0,
              "created_utc": 1752684217.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3h71dv",
          "author": "None",
          "body": "[deleted]",
          "score": -16,
          "created_utc": 1752686436.0,
          "replies": [
            {
              "id": "n3ihete",
              "author": "KFUP",
              "body": "> lol...\n\nYeah, I was wondering how console makers keep selling their insanely overpriced controllers, they're practically a scam, then I see comments like this to reminds me people like this exist, even if you show them better, cheaper controllers, they still buy overpriced crap.",
              "score": 5,
              "created_utc": 1752699205.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3hzzhz",
          "author": "happy-cig",
          "body": "Ds5 is still better build quality and qc than 8bitdo doe. \n\n\nDs6 should bring in tmr so better to compare then. ",
          "score": -10,
          "created_utc": 1752694373.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3g9vll",
      "author": "77ilham77",
      "body": "I thought the Ultimate was basically the successor of Pro 2.\n\nThank god it followed the Pro 2 in terms of devices compatibility.",
      "score": 31,
      "created_utc": 1752675867.0,
      "replies": [
        {
          "id": "n3i8qyc",
          "author": "inveniam7",
          "body": "Really glad they aren’t moving away from this form factor. I have the Pro 2 and using it doesn’t aggravate my hands the way the Switch joy-cons or the Duelsense do so it’s been my go-to when any system that isn’t the PS5.",
          "score": 5,
          "created_utc": 1752696875.0,
          "replies": [
            {
              "id": "n3kv62a",
              "author": "IIlIIlIIlIlIIlIIlIIl",
              "body": "Do you know if the charger is cross compatible with the Ultimate? Doesn't look like it.\n\nI bought the Ultimate about a year ago but really wanted a PS form factor. If it isn't compatible I'm kind of \"locked\" into Ultimates as I don't wanna have to have specific chargers for specific controllers.",
              "score": 1,
              "created_utc": 1752729445.0,
              "replies": [
                {
                  "id": "n5dcp2j",
                  "author": "digitalasagna",
                  "body": "You can just charge with the usb c cable for any of them.. but, the dock definitely looks unique. Shouldn't matter, though, since it comes with the controller",
                  "score": 1,
                  "created_utc": 1753584494.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3mzbgk",
              "author": "joestradamus_one",
              "body": "How are you buttons on the pro 2, I have one as well and even though I really like it, I feel the ABXY buttons are weirdly sticky without actually being sticky, if that even makes sense.",
              "score": 1,
              "created_utc": 1752762860.0,
              "replies": [
                {
                  "id": "n3n2uxj",
                  "author": "inveniam7",
                  "body": "That makes sense. I wouldn’t describe them as sticky personally, just that they have a certain amount of travel to them.",
                  "score": 2,
                  "created_utc": 1752763852.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3hwh2y",
      "author": "ozyx7",
      "body": "What is the point of having TMR-based joysticks and Hall Effect triggers to make the gamepad last longer against wear-and-tear when they make the battery non-replaceable?",
      "score": 30,
      "created_utc": 1752693388.0,
      "replies": [
        {
          "id": "n3iqdiu",
          "author": "Pimpzard",
          "body": "Marketing",
          "score": 12,
          "created_utc": 1752701677.0,
          "replies": []
        },
        {
          "id": "n3islxb",
          "author": "MultiKoopa2",
          "body": "wait, you can't replace the battery??? They changed that from the Pro 2?",
          "score": 4,
          "created_utc": 1752702338.0,
          "replies": [
            {
              "id": "n3it6vy",
              "author": "ozyx7",
              "body": "According to the linked article:\n\n> Battery life from the 1,000 mAh non-removable pack is said to be rated at up to 20 hours on a single charge",
              "score": 14,
              "created_utc": 1752702506.0,
              "replies": [
                {
                  "id": "n3ity7t",
                  "author": "MultiKoopa2",
                  "body": "oh that's awful\n\ndoes 8bitdo do repairs? Does the thing just become worthless once the battery degrades?",
                  "score": 6,
                  "created_utc": 1752702727.0,
                  "replies": [
                    {
                      "id": "n3lo665",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 5,
                      "created_utc": 1752745152.0,
                      "replies": [
                        {
                          "id": "n3lxafi",
                          "author": "MultiKoopa2",
                          "body": "the Ultimate 2 from what I understand, requires you to remove adhesive, then re-apply new adhesive when replacing the battery\n\nthat's... very different than just being able to open the thing and put in a new battery",
                          "score": 2,
                          "created_utc": 1752749749.0,
                          "replies": [
                            {
                              "id": "n4o015a",
                              "author": "this_dudeagain",
                              "body": "That's not that unusual in a lot of devices. The battery will likely outlast the life of the controller anyhow. I'm sure iFixit will have a guide and replacement for it.",
                              "score": 1,
                              "created_utc": 1753250803.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3l2cf3",
              "author": "JWayn596",
              "body": "I was so angry I sent an email that will probably never be read",
              "score": 3,
              "created_utc": 1752733030.0,
              "replies": [
                {
                  "id": "n3lmkbo",
                  "author": "MultiKoopa2",
                  "body": ":(",
                  "score": 1,
                  "created_utc": 1752744242.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3jfrjo",
      "author": "raptir1",
      "body": "Really disappointing that the battery is not replaceable. I love being able to throw a set of rechargeable AAs in my Pro 2. ",
      "score": 9,
      "created_utc": 1752709461.0,
      "replies": [
        {
          "id": "n3l2kfy",
          "author": "JWayn596",
          "body": "Yeah don’t buy this Pro 3. Chinese companies taking notes from fucking PlayStation and Nintendo in regards to the battery",
          "score": 2,
          "created_utc": 1752733142.0,
          "replies": [
            {
              "id": "n3l8rnp",
              "author": "ypeelS",
              "body": "just throw it on the included dock when you're done with it?",
              "score": 1,
              "created_utc": 1752736378.0,
              "replies": [
                {
                  "id": "n3ou8rv",
                  "author": "bophill",
                  "body": "What about when the battery degrades?",
                  "score": 2,
                  "created_utc": 1752781535.0,
                  "replies": [
                    {
                      "id": "n3p0yz5",
                      "author": "ypeelS",
                      "body": "it's a low amp draw controller with a low capacity Li-Ion, something else will break before you notice battery degradation",
                      "score": 1,
                      "created_utc": 1752783457.0,
                      "replies": [
                        {
                          "id": "n3p1pxw",
                          "author": "bophill",
                          "body": "I see. In that case, if the pro 2 is cheaper then the 2 is a better buy?",
                          "score": 1,
                          "created_utc": 1752783670.0,
                          "replies": [
                            {
                              "id": "n3p2kva",
                              "author": "ypeelS",
                              "body": "The Pro 2 uses Bluetooth and the Pro 3 has a 2.4ghz dongle, that alone makes the Pro 3 a better buy, the dock is also a plus",
                              "score": 1,
                              "created_utc": 1752783912.0,
                              "replies": [
                                {
                                  "id": "n3p32hc",
                                  "author": "bophill",
                                  "body": "I personally only need Bluetooth, but I do like the dock. What do you think?",
                                  "score": 1,
                                  "created_utc": 1752784049.0,
                                  "replies": [
                                    {
                                      "id": "n3p3gt5",
                                      "author": "ypeelS",
                                      "body": "dongle will have 1000hz polling rate vs 125-250 over Bluetooth, Pro 3 for sure",
                                      "score": 1,
                                      "created_utc": 1752784160.0,
                                      "replies": [
                                        {
                                          "id": "n3p3ock",
                                          "author": "bophill",
                                          "body": "I’ll only be using it for emulation on iOS. That only requires Bluetooth right?",
                                          "score": 1,
                                          "created_utc": 1752784218.0,
                                          "replies": [
                                            {
                                              "id": "n3p3yju",
                                              "author": "ypeelS",
                                              "body": "In that case, the Pro 2 is fine",
                                              "score": 1,
                                              "created_utc": 1752784298.0,
                                              "replies": [
                                                {
                                                  "id": "n3p4a9v",
                                                  "author": "bophill",
                                                  "body": "Dang but I like the dock lol\n\nI mostly want a battery that lasts though and no hardware issues like drifting etc",
                                                  "score": 1,
                                                  "created_utc": 1752784391.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3rf81h",
                  "author": "JWayn596",
                  "body": "You don’t understand the point, just swapping rechargeable batteries is so much more convenient. \n\nAnd it doesn’t tie you to the company",
                  "score": 2,
                  "created_utc": 1752813314.0,
                  "replies": [
                    {
                      "id": "n3rhp5x",
                      "author": "ypeelS",
                      "body": "Swapping batteries is more convenient than placing it on the dock when you're done? You have a fully charged controller every time you pick it up",
                      "score": 1,
                      "created_utc": 1752814445.0,
                      "replies": [
                        {
                          "id": "n3ridqb",
                          "author": "JWayn596",
                          "body": "If you run out of juice mid session, you can just replace them with fully recharged AA batteries and keep going.\n\nThen just toss the old ones on the charger to recharge them whenever you want.",
                          "score": 1,
                          "created_utc": 1752814765.0,
                          "replies": [
                            {
                              "id": "n3rix0c",
                              "author": "ypeelS",
                              "body": "battery is rated for 20 hours, how are you running out of juice if its fully charged when you take it off the included dock?",
                              "score": 1,
                              "created_utc": 1752815019.0,
                              "replies": [
                                {
                                  "id": "n3rjomz",
                                  "author": "JWayn596",
                                  "body": "I have the Pro 2, that doesn’t have an included dock. \n\nBut my point still stands. Replaceable AA batteries or removable battery packs at least, are much more convenient and versatile in all aspects and extend the life of the product by decades.\n\nEven if you did as you said and used the dock properly, the occasions where you’ll run out of juice will be massively inconvenient, because you’ll have to wait for it to be charged, or use it wired, or the battery will wear down in 10 years and you’ll have to buy a whole new controller.\n\nPS4 controllers did not have replaceable batteries and they needed full replacements because they wouldn’t work anymore.",
                                  "score": 1,
                                  "created_utc": 1752815392.0,
                                  "replies": [
                                    {
                                      "id": "n3rkcyk",
                                      "author": "ypeelS",
                                      "body": "No one is gaming for 20 hours straight, how are you running out of battery mid game? And something else will break on the controller before the battery degradation becomes a problem",
                                      "score": 0,
                                      "created_utc": 1752815716.0,
                                      "replies": [
                                        {
                                          "id": "n3rn8i2",
                                          "author": "JWayn596",
                                          "body": "That’s not what happened with the PS4 controllers. And often times the advertised battery life is not the actual battery life.\n\nOr, you don’t have a dock and you just put the controller down and it runs out next time mid session. But even if you wanted to have the same kind of full battery experience, you could just replace the battery at the end of a session and leave the old ones to charge. \n\nYou would literally have 0 downtime. At all.\n\nChanging the battery is simply much more convenient. It’s literally like reloading.",
                                          "score": 1,
                                          "created_utc": 1752817145.0,
                                          "replies": [
                                            {
                                              "id": "n3rnupv",
                                              "author": "ypeelS",
                                              "body": "We aren't talking about PS4 controllers, we are talking about the 8Bitdo Pro 3\n\n>Changing the battery is simply much more convenient. It’s literally like reloading.\n\nhow is it more convenient? changing the batteries is a 3-step process, placing the controller on the dock is a 1-step process",
                                              "score": 1,
                                              "created_utc": 1752817457.0,
                                              "replies": [
                                                {
                                                  "id": "n3rofko",
                                                  "author": "JWayn596",
                                                  "body": "PS4 controller is extremely relevant because the design begot problems that will happen again with the 8bitdo Pro 3. \n\nChanging the battery is a 1 step process. Changing the battery. A battery you can use in other things, a battery you can go to the store and replace if for some reason you don’t have Eneloops.",
                                                  "score": 1,
                                                  "created_utc": 1752817748.0,
                                                  "replies": [
                                                    {
                                                      "id": "n3rpifw",
                                                      "author": "ypeelS",
                                                      "body": "> PS4 controller is extremely relevant because the design begot problems that will happen again with the 8bitdo Pro 3.\n\nPS4 controller is 12 years old\n\n>Changing the battery is a 1 step process. Changing the battery. A battery you can use in other things, a battery you can go to the store and replace if for some reason you don’t have Eneloops.\n\nOther controller\n\n* Remove old batteries\n\n* Insert new batteries\n\n* Place old batteries on charger\n\n8Bitdo Pro 3\n\n* Place controller on the Dock",
                                                      "score": 1,
                                                      "created_utc": 1752818293.0,
                                                      "replies": [
                                                        {
                                                          "id": "n3rq48q",
                                                          "author": "JWayn596",
                                                          "body": "Why are you so adamantly defending a flawed product?\n\nTraveling with the full dock is extremely inconvenient. \n\nYou can’t share batteries. \n\nYou can’t buy new batteries for it. Even official battery packs that could be Dock compatible. \n\nIt’s a dumb design, the fucking Wii motes were more advanced. You could use Double AA batteries or a Dock compatible battery. I bet some shmuck invented a USB-C battery pack for it.\n\nI have a 20 year old Wii Mote that still works because it uses AA batteries.\n\nYoull never get that with this unfixable piece of junk",
                                                          "score": 1,
                                                          "created_utc": 1752818606.0,
                                                          "replies": [
                                                            {
                                                              "id": "n3rrvci",
                                                              "author": "ypeelS",
                                                              "body": "because the hate is forced, it's the same design as every other controller released in the past 5 years.",
                                                              "score": 1,
                                                              "created_utc": 1752819524.0,
                                                              "replies": [
                                                                {
                                                                  "id": "n3rwkbq",
                                                                  "author": "JWayn596",
                                                                  "body": "Wow I had no idea the Xbox controller had non removable batteries! (They do, they also support AA’s and Dockable packs)\n\nWhy are you defending an anti-consumer practice? And what’s up with simply being flat out wrong?\n\nThe fact that other companies like Nintendo and PlayStation did away with that isn’t a W.",
                                                                  "score": 1,
                                                                  "created_utc": 1752822016.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "n3tcp00",
                                                                      "author": "ypeelS",
                                                                      "body": "how is a non removable battery anti consumer? A low capacity Li-Ion in a low amp draw controller won't degrade to the point of being noticeable before other parts on the controller fail. This is literally the headphone jack all over again, everyone shunned Apple when they removed it and until they realized it's actually not a bad idea and followed suit",
                                                                      "score": 1,
                                                                      "created_utc": 1752845972.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3gh4ru",
      "author": "Vinon",
      "body": "I literally just bought a pro 2 and now im finding out 3 is coming out",
      "score": 9,
      "created_utc": 1752677918.0,
      "replies": [
        {
          "id": "n3gmpmq",
          "author": "ExtraValu",
          "body": "It looks like the pro3 is much more expensive so at least you saved some dough.",
          "score": 10,
          "created_utc": 1752679455.0,
          "replies": []
        },
        {
          "id": "n3l2gep",
          "author": "JWayn596",
          "body": "Pro 2 is better, it has a battery pack or you can use  AA batteries. \n\nSkip the Pro 3",
          "score": 4,
          "created_utc": 1752733086.0,
          "replies": []
        },
        {
          "id": "n3gv9so",
          "author": "Eiensakura",
          "body": "eh just use it until it eventually kaputs and then get the 4 LOL",
          "score": 1,
          "created_utc": 1752683153.0,
          "replies": [
            {
              "id": "n3jjeed",
              "author": "your_evil_ex",
              "body": "I'm still rocking the 1 (SN30 Pro Plus), but no need to replace it so far!",
              "score": 2,
              "created_utc": 1752710696.0,
              "replies": [
                {
                  "id": "n3lspx0",
                  "author": "alvenestthol",
                  "body": "I've got the same controller, and the joystick rubber had degraded; meanwhile, the built-in battery pack still lasts forever\n\nIt'll probably be easier to replace the battery on the Pro 3 than it is to replace the joystick on the Pro",
                  "score": 1,
                  "created_utc": 1752747553.0,
                  "replies": [
                    {
                      "id": "n3oul1l",
                      "author": "bophill",
                      "body": "Wow how long have you had it and how often do you use it? Interesting that the battery is still like new",
                      "score": 1,
                      "created_utc": 1752781634.0,
                      "replies": [
                        {
                          "id": "n3ox85m",
                          "author": "alvenestthol",
                          "body": "Well, the battery probably isn't like new, I just never bothered to measure it because it doesn't really matter to me\n\nBut it's been probably 5 years since I bought it?",
                          "score": 1,
                          "created_utc": 1752782387.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3ougdr",
                  "author": "bophill",
                  "body": "How long have you had it and how often do you use it? Curious how the battery has lasted?",
                  "score": 1,
                  "created_utc": 1752781596.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3g7kc8",
      "author": "nashvillesecret",
      "body": "Just missing playstation style buttons",
      "score": 14,
      "created_utc": 1752675191.0,
      "replies": [
        {
          "id": "n3gzp27",
          "author": "Remy0507",
          "body": "Well...it's also missing actual PlayStation compatibility too.",
          "score": 17,
          "created_utc": 1752684444.0,
          "replies": [
            {
              "id": "n3h14p2",
              "author": "nashvillesecret",
              "body": "I'm more looking to use it with emulators or the super station fpga. But good point.",
              "score": 3,
              "created_utc": 1752684837.0,
              "replies": [
                {
                  "id": "n3i5fb9",
                  "author": "Saloncinx",
                  "body": "Same, I want a nice quality wireless controller for PS1 and 2 games on PC emulator.",
                  "score": 2,
                  "created_utc": 1752695949.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3hqjw0",
          "author": "ZellZoy",
          "body": "Still waiting for them to release one that has 6 face buttons so it can also do Sega and N64",
          "score": 1,
          "created_utc": 1752691749.0,
          "replies": [
            {
              "id": "n3kb74h",
              "author": "AlexanderTheGrave",
              "body": "https://www.8bitdo.com/64-controller/\n\nhttps://www.8bitdo.com/m30/",
              "score": 2,
              "created_utc": 1752720770.0,
              "replies": [
                {
                  "id": "n3knfa9",
                  "author": "ZellZoy",
                  "body": "I mean in combination with this swappable button feature so one controller can do it all.",
                  "score": 1,
                  "created_utc": 1752725860.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3gp3uu",
          "author": "thelionsmouth",
          "body": "You can swap them in easy",
          "score": -2,
          "created_utc": 1752680109.0,
          "replies": []
        },
        {
          "id": "n3g8j5t",
          "author": "Merciless972",
          "body": "This!",
          "score": -25,
          "created_utc": 1752675477.0,
          "replies": [
            {
              "id": "n3gi4ux",
              "author": "enfersijesais",
              "body": "That!",
              "score": -9,
              "created_utc": 1752678196.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3gq43z",
      "author": "_Ev4n_",
      "body": "Do we know if it’ll wake the switch 2?",
      "score": 5,
      "created_utc": 1752680379.0,
      "replies": [
        {
          "id": "n3h4zif",
          "author": "TxDrumsticks",
          "body": "According to the verge it sounds like it does.",
          "score": 4,
          "created_utc": 1752685886.0,
          "replies": [
            {
              "id": "n3i5tsd",
              "author": "Jaerba",
              "body": "I'm not sure if I'd believe that just yet.  Wake isn't talked about anywhere on 8bitdo's page or the Amazon listing, and 8bitdo hasn't been able to solve waking the Switch 2 on their current controllers yet.\n\nIt might just be The Verge getting information wrong.",
              "score": 7,
              "created_utc": 1752696058.0,
              "replies": [
                {
                  "id": "n3ktriq",
                  "author": "Crunktasticzor",
                  "body": "My 8Bitdo had a firmware update and is compatible with Switch 2 now.",
                  "score": 1,
                  "created_utc": 1752728773.0,
                  "replies": [
                    {
                      "id": "n3kugix",
                      "author": "Jaerba",
                      "body": "Does it wake the Switch 2 though?  That's what I mean. \n\n\nI know they've released firmware for compatibility but as far as I've seen, nothing can wake the Switch 2 besides Switch 2 Joycons, the official Pro Controller 2 and the GameCube controller.\n\n\nEven the Switch 1 Pro Controller can't wake it.",
                      "score": 4,
                      "created_utc": 1752729102.0,
                      "replies": [
                        {
                          "id": "n3kuhut",
                          "author": "Crunktasticzor",
                          "body": "Will test it when I get home",
                          "score": 3,
                          "created_utc": 1752729121.0,
                          "replies": [
                            {
                              "id": "n3kuklk",
                              "author": "Jaerba",
                              "body": "Cool, thanks!",
                              "score": 1,
                              "created_utc": 1752729157.0,
                              "replies": [
                                {
                                  "id": "n460qo7",
                                  "author": "Crunktasticzor",
                                  "body": "So I tested, Pro 2 on the current firmware can’t wake it unfortunately",
                                  "score": 2,
                                  "created_utc": 1753020026.0,
                                  "replies": []
                                },
                                {
                                  "id": "n3m3yi2",
                                  "author": "Endryu-85",
                                  "body": "This has been the 1 thing that's stopping me ordering one. I need that wake functionality!\n\nConfirmation would be awesome.",
                                  "score": 1,
                                  "created_utc": 1752752625.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3h5tff",
              "author": "_Ev4n_",
              "body": "Thanks!",
              "score": 1,
              "created_utc": 1752686110.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3hk36g",
      "author": "GoToNap",
      "body": "Finally! I've wanted to get the Pro 2 for a while now but the fact that it lacked 2.4 connectivity was an unacceptable drawback.\n\nTheir Xbox style controllers feel a bit too small and make my hands hurt almost instantly. Hopefully this one will be good",
      "score": 2,
      "created_utc": 1752689955.0,
      "replies": [
        {
          "id": "n3in97r",
          "author": "raxitron",
          "body": "I've got two that I use with 2.4 dongles. Separate purchase but they both work great. These use the same dongle from what I can tell, it's just baked in to the base price.",
          "score": 2,
          "created_utc": 1752700802.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3hmwc7",
      "author": "ScoobertD",
      "body": "I’ve had two controllers from them, the first one was an original Pro that I loved… until the right stick developed an insane drift less than two months of having it that was so bad I swore off the company… but then my friend recently bought me an Ultimate 2C that I absolutely love and has raised my opinion of the company so much I kinda wanna grab one of these now…",
      "score": 2,
      "created_utc": 1752690736.0,
      "replies": []
    },
    {
      "id": "n3i5zqx",
      "author": "goosewrinkles",
      "body": "But you still can’t sync two at a time per one pc… super annoying. RetroArch treats them both as the same unit no matter what mode you’re in.",
      "score": 2,
      "created_utc": 1752696107.0,
      "replies": []
    },
    {
      "id": "n3g6ick",
      "author": "shutternomad",
      "body": "Hopefully it has good iOS / Mac support. I have been doing game dev and I love the older 8bitdos which let you choose xinput, etc but the newer pro 2 ultimates are such a pain over Bluetooth. They have have 2 models for different devices and it’s confusing. Fingers crossed!",
      "score": 7,
      "created_utc": 1752674875.0,
      "replies": [
        {
          "id": "n3g9gv7",
          "author": "77ilham77",
          "body": "On the product page, it says it supports Windows, Android, Apple's platforms, SteamOS, and Switch. So basically just like the good 'ol SN30/Pro2. Unlike the jumble fuck that is the Ultimate.",
          "score": 5,
          "created_utc": 1752675748.0,
          "replies": [
            {
              "id": "n3jjg6h",
              "author": "your_evil_ex",
              "body": "Looks like from the pics that it has 3 modes instead of 4 now",
              "score": 2,
              "created_utc": 1752710713.0,
              "replies": [
                {
                  "id": "n3jt12f",
                  "author": "77ilham77",
                  "body": "> Looks like from the pics...\n\nOr, you know, just go [the product page](https://www.8bitdo.com/pro3/) and confirm that it indeed supports all of those platforms just like its predecessor.",
                  "score": 2,
                  "created_utc": 1752714127.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3gaqz0",
              "author": "shutternomad",
              "body": "Sweet! I bought a bunch of ultimates, and i love the ergonomics, aesthetics, etc of the ultimate. My wife and kid say it feels more like a \"normal\" controller, and the charging stand is great and helps keep things neat. Too bad about the connectivity issues lol.\n\nI just recently bought a bunch of pro 2s to replace them. And two months later, these come out? Sigh. Shut up and take my money, I suppose :)",
              "score": -1,
              "created_utc": 1752676120.0,
              "replies": [
                {
                  "id": "n3gb408",
                  "author": "shutternomad",
                  "body": "And wow, iOS / macOS 26+ and above. They probably worked with apple to get better bluetooth support in, I know how wonky apple's bluetooth can be with gaming controllers and stuff. Fingers crossed!!!",
                  "score": 1,
                  "created_utc": 1752676224.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3h1yn4",
      "author": "Marketing_Helpful",
      "body": "only problem is the polling rate which caps out at 250hz. its not a massibe problem as i would mainly use this an a emulator controller but it would be nice to atleast get 500hz",
      "score": 2,
      "created_utc": 1752685063.0,
      "replies": [
        {
          "id": "n3l2w6x",
          "author": "AbhishMuk",
          "body": "Iirc the gyro poll rates are also a bit lower, I think the play station controller is still one of the best.",
          "score": 1,
          "created_utc": 1752733311.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3hg9v2",
      "author": "Skelatuu",
      "body": "I ended up getting one from my retro gaming store and I’ve been happy with it. I told them I wanted to stream games with SteamLink to my TV and have a wireless controller since my DS4 was wired and was having issues with Bluetooth. I always preferred analog on bottom but I’ve been happy with it",
      "score": 1,
      "created_utc": 1752688897.0,
      "replies": []
    },
    {
      "id": "n3hptx0",
      "author": "Uniblab_78",
      "body": "Dang. I just got my son a new controller!",
      "score": 1,
      "created_utc": 1752691552.0,
      "replies": []
    },
    {
      "id": "n3hracp",
      "author": "TacoOfGod",
      "body": "Also important, if you're using it on PC and with Steam specifically, you can remap the extra four buttons. That makes it easier to map keyboard and mouse games to the controller.",
      "score": 1,
      "created_utc": 1752691950.0,
      "replies": []
    },
    {
      "id": "n3hti7f",
      "author": "daveypoo143",
      "body": "Are they still not shipping to the US?",
      "score": 1,
      "created_utc": 1752692556.0,
      "replies": [
        {
          "id": "n47ephj",
          "author": "OscAr2k",
          "body": "They do, since they have an American warehouse ",
          "score": 1,
          "created_utc": 1753035327.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3i3ib9",
      "author": "MrTestiggles",
      "body": "Lmao I just bought the 2 on sale now I know why ;(",
      "score": 1,
      "created_utc": 1752695393.0,
      "replies": []
    },
    {
      "id": "n3ibwsg",
      "author": "atomic1fire",
      "body": "Ah yes players can finally achieve the dream of having a BAXY controller.\n\nJoke aside it is cool that you can modify the buttons to suit switch or PC.",
      "score": 1,
      "created_utc": 1752697734.0,
      "replies": []
    },
    {
      "id": "n3it86c",
      "author": "sionarihi",
      "body": "Damn, that controller looks slick! Might finally upgrade.",
      "score": 1,
      "created_utc": 1752702514.0,
      "replies": []
    },
    {
      "id": "n3itmyj",
      "author": "CallTheGendarmes",
      "body": "I hope they also fixed the dinky mode selector switch from the pro 2. Made mine unusable as it couldn't stay set on the mode I was using and kept disconnecting.",
      "score": 1,
      "created_utc": 1752702637.0,
      "replies": []
    },
    {
      "id": "n3k4gye",
      "author": "spikesonthebrain",
      "body": "Looks inspired by the SNES.  Too bad it's not on xbox.  Any word on that wireless controller with flappy paddles for me?",
      "score": 1,
      "created_utc": 1752718242.0,
      "replies": []
    },
    {
      "id": "n3kfrmk",
      "author": "Mrbond404",
      "body": "8BitDo really nails the sweet spot between retro feel and modern features. Swappable buttons and TMR joysticks are solid upgrades, shows they're actually listening to what gamers want instead of just churning out generic controllers.",
      "score": 1,
      "created_utc": 1752722597.0,
      "replies": []
    },
    {
      "id": "n3lxsu1",
      "author": "cgaWolf",
      "body": "8BitDo stuff isn't for me (too small), but the switchable buttons are a genius idea. I took apart my EasySMX X20 yesterday because i wanted to switch the buttons to the Nintendo layout - but the buttons & the tubes they fit in have differently keyed channels (imagine one having small plastic guides on top, bottom, left and right; while the other having them top, bottom, left, and top-left).\n\nThat kinda pissed me off :x",
      "score": 1,
      "created_utc": 1752749978.0,
      "replies": []
    },
    {
      "id": "n3pw5np",
      "author": "KyStanto",
      "body": "Guli Kit has been doing this and you can get it for $40 on Amazon and is literally the best controller I have ever owned or felt.",
      "score": 1,
      "created_utc": 1752792877.0,
      "replies": []
    },
    {
      "id": "n3gfdrc",
      "author": "twigboy",
      "body": "I'd love if they went one step further and made those button faces configurable via e-ink or something like that, avoids the need to open it up",
      "score": 2,
      "created_utc": 1752677434.0,
      "replies": [
        {
          "id": "n3gp8j9",
          "author": "thelionsmouth",
          "body": "You don’t need to open it up! It’s hot swappable",
          "score": 12,
          "created_utc": 1752680144.0,
          "replies": [
            {
              "id": "n3hachp",
              "author": "hkzqgfswavvukwsw",
              "body": "Magnetic, for those who didn’t read the article.",
              "score": 7,
              "created_utc": 1752687321.0,
              "replies": [
                {
                  "id": "n3jh5l2",
                  "author": "twigboy",
                  "body": "Oh I skimmed the article but missed that bit!",
                  "score": 2,
                  "created_utc": 1752709922.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3hbo57",
          "author": "_Imposter_",
          "body": "E-Ink buttons is a really cool idea though ",
          "score": 2,
          "created_utc": 1752687674.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3gln0x",
      "author": "wiggle_fingers",
      "body": "Does this controller allow autoclicking, like the numlock trick in diablo?",
      "score": 1,
      "created_utc": 1752679163.0,
      "replies": [
        {
          "id": "n3hevqq",
          "author": "alvenestthol",
          "body": "The software let's you basically set macros for the controller, and it's good enough that I used it for part of the Tears of the Kingdom duplication glitch",
          "score": 3,
          "created_utc": 1752688522.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3h8uye",
      "author": "detailcomplex14212",
      "body": "Best purchase Ive ever made",
      "score": 1,
      "created_utc": 1752686922.0,
      "replies": []
    },
    {
      "id": "n3jim3l",
      "author": "Ghozer",
      "body": "My Gulikit KK2 has swappable ABXY buttons - had that about 2 years or so, it wasn't the first, and won't be the last :)",
      "score": 1,
      "created_utc": 1752710421.0,
      "replies": []
    },
    {
      "id": "n3hc6rs",
      "author": "Crimson_Raven",
      "body": "But does it have extra, programmable, buttons",
      "score": 0,
      "created_utc": 1752687810.0,
      "replies": [
        {
          "id": "n3hiudo",
          "author": "Docdoozer",
          "body": "Yes it does. Seems like 2 extra bumpers and 2 back-paddles.",
          "score": 4,
          "created_utc": 1752689611.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3le0ym",
      "author": "XTornado",
      "body": "Nice, but...\n\n8BitDo overlords, please I need a trackball mouse that matches the retro Keyboard style you sold (specially the C64). \n\nPLEASE. I NEED IT.\n\n(that and wristpad, those keyboards are too high, if you can make one with a trackball on it under the middle of the main row that would the next level...)",
      "score": 0,
      "created_utc": 1752739327.0,
      "replies": []
    },
    {
      "id": "n3gcbvy",
      "author": "CrapDepot",
      "body": "But do beware, it's a chinese (hong kong) company.",
      "score": -29,
      "created_utc": 1752676572.0,
      "replies": [
        {
          "id": "n3gf00t",
          "author": "Modsda3",
          "body": "At least it's not made in 'Merica",
          "score": 12,
          "created_utc": 1752677328.0,
          "replies": []
        }
      ]
    }
  ]
}