{
  "post": {
    "title": "Samsung HW-QS700F soundbar review: Sophisticated design, automatic adjustments",
    "author": "dapperlemon",
    "id": "1lysvqo",
    "score": 66,
    "created_utc": 1752413445.0,
    "selftext": "",
    "num_comments": 17,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lysvqo/samsung_hwqs700f_soundbar_review_sophisticated/"
  },
  "comments": [
    {
      "id": "n2w8fje",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752413446.0,
      "replies": []
    },
    {
      "id": "n313cib",
      "author": "Feyr",
      "body": "and probably the same Samsung quality of non-standard protocol and interop as their previous soundbars, where it wont talk properly to even samsung TVs, will randomly switch mode for no reason, randomly display either numbers OR +/- depending on its own whims and require rebooting every few days or it wont play any sounds",
      "score": 20,
      "created_utc": 1752472565.0,
      "replies": [
        {
          "id": "n35nf55",
          "author": "krum",
          "body": "Probably also connects to the internet ~~for no reason~~ so that it can send everything you say to their servers.",
          "score": 2,
          "created_utc": 1752530932.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2xwmc7",
      "author": "Riegel_Haribo",
      "body": "And best of all: the crappy tinny sound you come to expect.",
      "score": 30,
      "created_utc": 1752431825.0,
      "replies": [
        {
          "id": "n2xzpvh",
          "author": "NikolasDude",
          "body": "It doesn't sound the best without the subwoofer for sure, with the subwoofer though it's pretty good.\n\nThe bummer about this model is not being able to see and confirm that you are getting DTS, or Dolby Digital / Digital Plus.\n\nAs far as I can tell, this one only has a way to tell you if Dolby Atmos is activated.",
          "score": 8,
          "created_utc": 1752432751.0,
          "replies": [
            {
              "id": "n337s7s",
              "author": "mkvii1989",
              "body": "*Needing* a subwoofer to sound good is a deal breaker for me. I'm going to get a sub anyway, but if you need one to sound good, it means the crossover is going to be set so high the sub is filling out low-mids like male voices, which is far from ideal.",
              "score": 2,
              "created_utc": 1752506092.0,
              "replies": [
                {
                  "id": "n34l5dh",
                  "author": "NikolasDude",
                  "body": "That definitely makes sense, and I may have over exaggerated, but the subwoofer definitely comes to good use and I wouldn't ever see myself in any situation turning it off when playing games, watching movies, or listening to music.\n\nWith all the pieces in play, this soundbar provides a decently impressive sound for someone like me who used to be big on finding high quality masters and rips for my Sennheiser HD-650s back when I still had them",
                  "score": 1,
                  "created_utc": 1752519919.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n31m7uf",
              "author": "robben1234",
              "body": "I don't think worrying about whether the Atmos channels are playing with a crappy device like this is productive at all.\n\n\nThe only purpose the flawed design which are soundbars have is to make sure you can hear dialogue via distinct center channel if your content mastering was lazy enough to fail to include 2.0 track and instead only has 5.1+.\n\n\nIf you actually care about height channels and don't want to throw money at the wind you should be getting an AVR capable of at least 7 channels and mounting speakers at the ceiling level.",
              "score": 2,
              "created_utc": 1752483309.0,
              "replies": [
                {
                  "id": "n34kkx9",
                  "author": "NikolasDude",
                  "body": "Have you tested this particular model yourself and deduced it was crappy? Or did you see the Samsung name and then make the assumption?\n\nI will not come out and say Samsung soundbars are an audiophile's dream, or that Samsung is the single best possible option for this price range, but I will say they make for excellent upgrades to TV speakers especially when you don't have the space or wherewithal to set up 7 channels throughout a room. \n\nEven for those where it may fit and they don't need to worry about angering their landlord by screwing holes into the walls/ceiling, many people don't like the look of having dedicated speakers all over the place, and would prefer the one simple and clean soundbar that provides them with a sound they are more than happy with.\n\nThis isn't the audiophile subreddit, and I totally understand this soundbar isn't for people like you, but that doesn't mean it doesn't provide a good solution for others, especially if you enjoy being able to control your soundbar quickly and easily through the SmartThings ecosystem.",
                  "score": 1,
                  "created_utc": 1752519756.0,
                  "replies": [
                    {
                      "id": "n37viu1",
                      "author": "drugtrafficer",
                      "body": "I’m no expert but I am real happy with mine. Just as you say.",
                      "score": 1,
                      "created_utc": 1752561671.0,
                      "replies": [
                        {
                          "id": "n3bp3u6",
                          "author": "NikolasDude",
                          "body": "I am real happy with mine too, I really like the Spotify Cast and Tidal Connect compatibility, also the SmartThings integration",
                          "score": 1,
                          "created_utc": 1752610486.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n30o3ua",
          "author": "McBurty",
          "body": "Wonder what weird ass little glitches and failures it’ll develop  5 minutes post warranty?",
          "score": 3,
          "created_utc": 1752465303.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2zcfu8",
      "author": "SuperSaiyanTupac",
      "body": "We have had sound systems for decades now, they could easily make a theatre quality experience in one small box if they wanted. Soundbars and subwoofers are horseshit. The tech is never going to improve. Just the same overpriced bullshit",
      "score": -8,
      "created_utc": 1752447825.0,
      "replies": [
        {
          "id": "n2zkwvc",
          "author": "bonesnaps",
          "body": "Subwoofers are good in combination with studio monitors.\n\n\nSoundbars are a bit of a meme though.",
          "score": 6,
          "created_utc": 1752450703.0,
          "replies": []
        },
        {
          "id": "n30fqq2",
          "author": "Evo1889",
          "body": "Care to share some examples? I still have bookshelf speakers and a subwoofer. Would like something smaller.",
          "score": 3,
          "created_utc": 1752461844.0,
          "replies": [
            {
              "id": "n3afhkm",
              "author": "alucohunter",
              "body": "Headphones? If you're trying to fill a room with audio you kinda need larger speakers",
              "score": 1,
              "created_utc": 1752597869.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}