{
  "post": {
    "title": "DJI evades US block but has one year to prove its products aren't a national security threat | A clause in the 895bn US Defense Bill starts a one-year countdown that would automatically ban its products.",
    "author": "chrisdh79",
    "id": "1hht812",
    "score": 625,
    "created_utc": 1734615972.0,
    "selftext": "",
    "num_comments": 64,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hht812/dji_evades_us_block_but_has_one_year_to_prove_its/"
  },
  "comments": [
    {
      "id": "m2tkztl",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1734615973.0,
      "replies": []
    },
    {
      "id": "m2u3zom",
      "author": "OperatorJo_",
      "body": "BREAKING: DJI rebrands to DJT in order to flatter the president and evade ban. It works",
      "score": 332,
      "created_utc": 1734622734.0,
      "replies": [
        {
          "id": "m2x9kir",
          "author": "HahaMin",
          "body": "Da Jiang Trump",
          "score": 35,
          "created_utc": 1734661856.0,
          "replies": [
            {
              "id": "m2zq4kv",
              "author": "dodgethis_sg",
              "body": "Great General Trump, eh?",
              "score": 4,
              "created_utc": 1734707945.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2wjlyj",
          "author": "opeth10657",
          "body": "Just need to send a ~~bribe~~ donation to the inauguration fund.",
          "score": 9,
          "created_utc": 1734652049.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2ur9da",
      "author": "Rhellic",
      "body": "How do you prove that to a government that *wants* to believe you're a threat?",
      "score": 85,
      "created_utc": 1734630799.0,
      "replies": [
        {
          "id": "m307fcv",
          "author": "aitorbk",
          "body": "You can't.  That is the purpose of the legislation.",
          "score": 31,
          "created_utc": 1734713801.0,
          "replies": [
            {
              "id": "m33kwia",
              "author": "Kellic",
              "body": "Sure you can.  Its called an audit.  Happens all the time with gov contracts.  Be it software, or internal processes or whatever.  The current gov isn't the problem.  The incoming one that is about to gut everything that is functional will be.",
              "score": 18,
              "created_utc": 1734760789.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m310p9z",
          "author": "munche",
          "body": "How many more American companies will place a few campaign contributions to get their Chinese competitors labeled a national security threat? People seem fine with the government just banning Chinese companies for imagined crimes because they're Chinese. Meta is gonna win big off of a small amount of lobbying congress about the dangers of TikTok. We're going to see a lot more of this under Trump.",
          "score": 14,
          "created_utc": 1734723541.0,
          "replies": [
            {
              "id": "m35p6nj",
              "author": "Rhellic",
              "body": "Yeah. I mean, not that China is innocent of this. Or innocent of anything really. But I think the portrayal as this uniquely evil threat is mostly just about economic interests.",
              "score": 3,
              "created_utc": 1734800077.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m37wx2a",
          "author": "Qjeezy",
          "body": "What’s funny is that the govt left the investigation up to the govt to do. So if no agency picks it up and completes the investigation, dji is out of luck.",
          "score": 2,
          "created_utc": 1734829398.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2vjbnu",
      "author": "mr_biteme",
      "body": "The biggest problem with this is that there are NO AFFORDABLE alternatives to DJI that are made here. (USA). It’s fair to reason that those USA-based companies were definitely pushing for this kind of a ban. It’s all about the money.",
      "score": 60,
      "created_utc": 1734639851.0,
      "replies": [
        {
          "id": "m2yhzwm",
          "author": "shitty_mcfucklestick",
          "body": "The other factor is that none of the domestic ones are as good (according to a YT video I watched that interviewed people about it.) Research, exploration, monitoring, oil, forestry etc would all be negatively affected without access to the tech they have now.",
          "score": 18,
          "created_utc": 1734685313.0,
          "replies": [
            {
              "id": "m3208uj",
              "author": "AnotherBoojum",
              "body": "Film.\n\n\nDJIs have replaced the need for expensive helicopter shots and crane arm setups. I've even seen them replace a boom arm setup because a drone + pilot is cheaper and more accessible.\n\n\nIndividual projects are being greenlit at much lower budgets than previously. We're seeing a return tobthe mid-budget feature and appropriately funded series. Without drones, expect to see a lot fewer sweeping, dynamic shots.",
              "score": 18,
              "created_utc": 1734736051.0,
              "replies": [
                {
                  "id": "m389swm",
                  "author": "Rdubya44",
                  "body": "I would imagine the professional level drones flown by FAA approved pilots would still stay legal, no?",
                  "score": 1,
                  "created_utc": 1734834809.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2zx9cd",
              "author": "THALANDMAN",
              "body": "Yeah it’s not even close, DJI has no realistic competition in its segment, especially no US competition.",
              "score": 15,
              "created_utc": 1734710396.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2vnwqm",
          "author": "real_picklejuice",
          "body": "Especially because Stefanik introduced the bill that everyone in the industry knows Skydio wrote",
          "score": 16,
          "created_utc": 1734641312.0,
          "replies": []
        },
        {
          "id": "m35j8k4",
          "author": "ACanadianNoob",
          "body": "Fuck it. Just come to Canada, buy your drone and put it in your spare tire compartment, and then drive back across the border without declaring it. This kind of thing is unenforceable at best, and DJI will probably create a shell company and rebrand.",
          "score": 3,
          "created_utc": 1734798032.0,
          "replies": []
        },
        {
          "id": "m3416qe",
          "author": "djsizematters",
          "body": "3dr is pretty awesome…",
          "score": 1,
          "created_utc": 1734770979.0,
          "replies": []
        },
        {
          "id": "m3ld4g6",
          "author": "Accurate_Type4863",
          "body": "There is no need for there to be dirt cheap alternatives. It’s not a diaper",
          "score": 1,
          "created_utc": 1735048509.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2tpgxc",
      "author": "ArchusKanzaki",
      "body": "Ah yes. Proving a negative.",
      "score": 71,
      "created_utc": 1734617696.0,
      "replies": [
        {
          "id": "m30pty2",
          "author": "AmNoSuperSand52",
          "body": "It’s the FCC. It’d be beneficial to them to not have DJI drones flying around, spyware or not\n\nThey’re also not under any obligation to investigate it themselves. Lot easier to force a company to do it to save their own sales",
          "score": 11,
          "created_utc": 1734719893.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2tled5",
      "author": "None",
      "body": "[deleted]",
      "score": 97,
      "created_utc": 1734616133.0,
      "replies": [
        {
          "id": "m2tr67s",
          "author": "Photodan24",
          "body": "Why am I not surprised our congress passed stupid legislation?",
          "score": 41,
          "created_utc": 1734618325.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2xvmsv",
      "author": "lowbass93",
      "body": "Let's be real. If something was actually a national security threat, there wouldn't be a court case. It would be banned immediately",
      "score": 14,
      "created_utc": 1734671295.0,
      "replies": []
    },
    {
      "id": "m2ur6il",
      "author": "Godisdeadandsoami",
      "body": "Would this effect hasselblad as well?",
      "score": 10,
      "created_utc": 1734630768.0,
      "replies": [
        {
          "id": "m2vnp6e",
          "author": "technobrendo",
          "body": "They got blacklisted too?",
          "score": 3,
          "created_utc": 1734641246.0,
          "replies": [
            {
              "id": "m2wo3vd",
              "author": "Godisdeadandsoami",
              "body": "It was purchased by DJI",
              "score": 9,
              "created_utc": 1734653724.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2tphex",
      "author": "None",
      "body": "Guilty until proven innocent",
      "score": 35,
      "created_utc": 1734617701.0,
      "replies": []
    },
    {
      "id": "m2u8p17",
      "author": "climb56",
      "body": "Im lazy. Possibly a threat why? Programming or their abilities?",
      "score": 7,
      "created_utc": 1734624256.0,
      "replies": [
        {
          "id": "m2usq8y",
          "author": "ApathyKing8",
          "body": "They have video and audio recording. The Chinese government could at any time push an update to bounce all recordings into a Chinese server bank. Now you have thousands of recording devices sitting in American homes and businesses controlled by a foreign adversary. \n\nThey could also tell them to just stop working. Imagine using them as search and rescue devices after a disaster and China decides they don't want Americans rescued. What if they are part of a military operation and now we lose the ability to search and rescue our troops because China decided they don't like whatever side we're on? \n\nThis is a bit extreme, but they also require Internet connections for a lot of the functionality, so now they have access to all of your network from across the globe without needing to crack a password or anything. When's the last time the average person updated their wifi security? \n\nThe Chinese government is untrustworthy and giving them a security audit isn't such a bad idea.",
          "score": -13,
          "created_utc": 1734631302.0,
          "replies": [
            {
              "id": "m2wmt8i",
              "author": "gaiusmariusj",
              "body": "Bro do you know how bandwidth works?",
              "score": 16,
              "created_utc": 1734653240.0,
              "replies": []
            },
            {
              "id": "m2vi12z",
              "author": "qtx",
              "body": "I don't think you understand technology.\n\nDo you even know how much bandwidth is required to transfer live audio and video of hundreds of thousands of drones at the same time? And since they can't use american ISPs they need to use satellites?\n\nDrones are wireless, you can intercept and track any signal using something like wireshark, yet no one has ever found anything malicious.\n\nYou're letting your fantasies run wild, they're not based on reality.",
              "score": 17,
              "created_utc": 1734639434.0,
              "replies": [
                {
                  "id": "m2ykv9v",
                  "author": "Teftell",
                  "body": "Fun fact, politicians in general don't know how tech works, but they know how to present lobbying as muh national security concern and muh children safety very well. Source: I live in Russia and they blocked YT entirely during Putin's press conference while a high profile local bloger asked not to ban YT.",
                  "score": 9,
                  "created_utc": 1734687394.0,
                  "replies": []
                },
                {
                  "id": "m2vk0li",
                  "author": "ApathyKing8",
                  "body": "You really think that collecting video, remotely turning off drones, or accessing poorly secured wireless networks is sci-fi...? There's zero security threat from an adversarial foreign agency with one of the most advanced cyber teams on the planet owning what is essentially a flying computer that has permissions to connect to your phone and wifi?\n\nNo one said it is currently happening, but it's entirely possible with a single firmware update.",
                  "score": -7,
                  "created_utc": 1734640072.0,
                  "replies": [
                    {
                      "id": "m2wn1kw",
                      "author": "gaiusmariusj",
                      "body": "It is entirely possible Terminator can show up. I obviously cannot conclusively prove it is impossible for Terminator to show up.",
                      "score": 12,
                      "created_utc": 1734653327.0,
                      "replies": []
                    },
                    {
                      "id": "m2ze7li",
                      "author": "None",
                      "body": "[removed]",
                      "score": -2,
                      "created_utc": 1734703464.0,
                      "replies": [
                        {
                          "id": "m7ga7wd",
                          "author": "CMDR_ARAPHEL",
                          "body": "This guy is offering a even more tempered take, but still the downvotes flow because he dared tread close to \"China bad\".   I'm seeing a theme here.",
                          "score": 2,
                          "created_utc": 1737036613.0,
                          "replies": [
                            {
                              "id": "m7gblhc",
                              "author": "Owbutter",
                              "body": "Most people have limited ability to quantify risk and therefore use simple rules to filter information through. Just a part of the human condition. I appreciate the kind words.",
                              "score": 1,
                              "created_utc": 1737037087.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7g9wvv",
              "author": "CMDR_ARAPHEL",
              "body": "I agree with your last bit.  Technical hurdleals can be overcome, and  malicious gathering would get noticed, but NOT without someone looking for it. \n\n\nFeel how you want about Chinese products, their actions and overall sense of \"ethics and morality\" is lacking. Especially on a government level.\n\n\nSo no, I don't trust a country where it's both preferred (and encouraged) to finish off a pedestrian after an automobile strike.\n\n\nWith no \"standard\" of morality beyond profit,  the definition of right vs wrong can change hourly, as we already experience in the USA.   \n\n\n\n\nI don't trust the USA government to dp what's right for OUR people, nevermind the Chinese.   Vigilance matters",
              "score": 2,
              "created_utc": 1737036507.0,
              "replies": []
            },
            {
              "id": "m2uv8xy",
              "author": "climb56",
              "body": "Thanks",
              "score": -5,
              "created_utc": 1734632134.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m31o98x",
      "author": "red_vette",
      "body": "Maybe DJI drones have progressed since I got mine a few years ago, but they don't have an always on internet connection that uploads massive video files while flying.  Using a phone is optional over a tablet and many newer ones have a dedicated remote.  Users can submit content, but beyond that having millions of drones streaming 2-4k content to servers in China just isn't feasible at this time.  Even the best ones they sell aren't going to reveal anything new unless they are purposely flying over restricted areas and that's more of a user problem than a drone made by a Chinese company.  May just be unclear on what the perceived security risk is.",
      "score": 3,
      "created_utc": 1734731620.0,
      "replies": []
    },
    {
      "id": "m2tstay",
      "author": "monologue_adventure",
      "body": "Guilty, until proven innocent because you are Chinese. \n\nChinese Americans, we need to stay strapped in case we are sent to camps in the future if it comes to war. \n\nHard not to think that this would only go badly for CCP.",
      "score": 25,
      "created_utc": 1734618924.0,
      "replies": [
        {
          "id": "m2tvjgc",
          "author": "CookieKeeperN2",
          "body": "I mean, with 2 unhinged narcissists in power with nothing to curb them, what could possibly go wrong.",
          "score": 9,
          "created_utc": 1734619898.0,
          "replies": []
        },
        {
          "id": "m2ybofr",
          "author": "None",
          "body": "[removed]",
          "score": -19,
          "created_utc": 1734680860.0,
          "replies": [
            {
              "id": "m2z0et6",
              "author": "None",
              "body": "[removed]",
              "score": 11,
              "created_utc": 1734697311.0,
              "replies": [
                {
                  "id": "m2z1hb6",
                  "author": "None",
                  "body": "[removed]",
                  "score": -15,
                  "created_utc": 1734697863.0,
                  "replies": [
                    {
                      "id": "m34ftvw",
                      "author": "None",
                      "body": "Do you really believe posting this works at all? If someone was here post propaganda, why would this stop them at all? It would be part of their job.\n\nAlmost makes me think you are the propaganda bot.",
                      "score": 3,
                      "created_utc": 1734780684.0,
                      "replies": []
                    },
                    {
                      "id": "m2z1sil",
                      "author": "None",
                      "body": "[removed]",
                      "score": 8,
                      "created_utc": 1734698023.0,
                      "replies": [
                        {
                          "id": "m33p0fc",
                          "author": "None",
                          "body": "[removed]",
                          "score": -3,
                          "created_utc": 1734763176.0,
                          "replies": [
                            {
                              "id": "m34fwhb",
                              "author": "None",
                              "body": "This guy did.\n\n> [Elderly man returns to China after being attacked multiple times in San Francisco](https://nextshark.com/elderly-man-attacked-san-francisco-returns-china)",
                              "score": 2,
                              "created_utc": 1734780729.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2z21y2",
                          "author": "None",
                          "body": "[removed]",
                          "score": -16,
                          "created_utc": 1734698156.0,
                          "replies": [
                            {
                              "id": "m2z26ql",
                              "author": "monologue_adventure",
                              "body": "Tell yourselves whatever you feel like in your little echo chamber. \n\n“but I gOt ChInEsE fRiEnD”\n\nLOL who is this troll",
                              "score": 12,
                              "created_utc": 1734698222.0,
                              "replies": [
                                {
                                  "id": "m2z2dqz",
                                  "author": "apocalyptic-bear",
                                  "body": "I’m Chinese American asshat bot 🤖\n\nGo collect 5 cents",
                                  "score": 0,
                                  "created_utc": 1734698318.0,
                                  "replies": [
                                    {
                                      "id": "m2z2uou",
                                      "author": "redditining",
                                      "body": "Are you an idiot?",
                                      "score": 12,
                                      "created_utc": 1734698545.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2yyl4b",
      "author": "cozyHousecatWasTaken",
      "body": "Easy, just open source the firmware 🤣",
      "score": 2,
      "created_utc": 1734696339.0,
      "replies": []
    },
    {
      "id": "m315ycz",
      "author": "davidjschloss",
      "body": "Nothing like making a company prove it's not doing something. It's always notoriously easy to prove a negative.",
      "score": 2,
      "created_utc": 1734725324.0,
      "replies": []
    },
    {
      "id": "m31ce8l",
      "author": "santz007",
      "body": "Must have forgotten to pay 1 million to Trump inaugural fund",
      "score": 1,
      "created_utc": 1734727538.0,
      "replies": []
    },
    {
      "id": "m2xfkz7",
      "author": "Peter_Duncan",
      "body": "It’s not about affordability. It’s about cheap. Pay more, but keep the mo ey at home.  That’s the trade off.",
      "score": -1,
      "created_utc": 1734664238.0,
      "replies": []
    },
    {
      "id": "m2v5ggc",
      "author": "korodic",
      "body": "It is a legitimate concern when you consider how Chinas tech industry has incredibly close ties to their elite and how businesses are an extension of their government whereas the US has some separation through privatization; Hong Kong no longer has that luxury.",
      "score": -12,
      "created_utc": 1734635392.0,
      "replies": [
        {
          "id": "m2wc6lp",
          "author": "control-room",
          "body": "But many American companies have been shown to have close ties or have helped US law enforcement. So, would it be fair for other countries to ask American companies to prove a negative because of those actions?",
          "score": 8,
          "created_utc": 1734649310.0,
          "replies": [
            {
              "id": "m2wgxtn",
              "author": "korodic",
              "body": "They certainly have and do. It’s not about fairness, it’s politics.",
              "score": -1,
              "created_utc": 1734651046.0,
              "replies": [
                {
                  "id": "m2wlb7s",
                  "author": "control-room",
                  "body": "I'm unaware of other countries doing blanket bans on technology from the US. Can you link some articles?",
                  "score": 4,
                  "created_utc": 1734652682.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}