{
  "post": {
    "title": "Apple's first foldable iPhone tipped to feature 7.8-inch display, A20 Pro chip, and 48MP cameras | iPhone Fold expected in 2026 at a near- 2,000USD price",
    "author": "chrisdh79",
    "id": "1m24iic",
    "score": 1342,
    "created_utc": 1752749958.0,
    "selftext": "",
    "num_comments": 657,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m24iic/apples_first_foldable_iphone_tipped_to_feature/"
  },
  "comments": [
    {
      "id": "n3lxr9w",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752749959.0,
      "replies": []
    },
    {
      "id": "n3m0dor",
      "author": "Lobster_McGee",
      "body": "I’ve been around way too long to believe rumors about Apple products that aren’t even shipping this year.  If it’s 2 months to release, maybe, but this is almost 100% clickbait bullshit.",
      "score": 351,
      "created_utc": 1752751127.0,
      "replies": [
        {
          "id": "n3m352t",
          "author": "VideoGameCookie",
          "body": "Totally agree. Even Apple’s beginning to not release what they say they’re going to within the year, so how could you believe a rumor that’s even further out lmao",
          "score": 48,
          "created_utc": 1752752293.0,
          "replies": []
        },
        {
          "id": "n3nmi5x",
          "author": "AFeralTaco",
          "body": "I’ve been following this for some time, and everything here is accurate. It’s been in development for years.\n\nTo be clear: this post is following leaks from sites that have been historically reliable on what Apple releases. Where Apple is able to actually make it happen is another story, as this was supposed to be released a couple of years ago.\n\nI assume it got delayed due to trying to prevent another bendgate.",
          "score": 15,
          "created_utc": 1752769314.0,
          "replies": [
            {
              "id": "n4i9jqo",
              "author": "SilverCarbon",
              "body": "There were other problems to solve as well which are finally gone: scratch-prone screens, visible crease in the middle, a front screen with weird dimensions, very bulky and heavy device. Most manufacturers have ironed out those issues and Apple can build on it.\n\nStill there's the PR angle to position this as the next must have device or just extra in the lineup where you already have the problem of choosing between 4-5 iPhone versions with more similarities than differentiating features.",
              "score": 1,
              "created_utc": 1753183812.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3xpu5a",
          "author": "dinglebarry9",
          "body": "Shit after the Apple Intelligence, AirPower or whatever, fail I don’t believe anything Apple says until it’s out and I watch a bunch of YouTubers review it",
          "score": 1,
          "created_utc": 1752895937.0,
          "replies": []
        },
        {
          "id": "n3o3ct3",
          "author": "jeremiuhh",
          "body": "Bro what? They always have their next phones leak like a year or more before they release.",
          "score": 1,
          "created_utc": 1752773895.0,
          "replies": []
        },
        {
          "id": "n3zxqcj",
          "author": "slow_RSO",
          "body": "Did they not learn from Samsung how terrible those folding screens are?",
          "score": 1,
          "created_utc": 1752934056.0,
          "replies": [
            {
              "id": "n454x9b",
              "author": "_zurenarrh",
              "body": "You just not be following the market well to make a comment like this\n\nThe fold 6 and 7 is fantastic",
              "score": 2,
              "created_utc": 1753005975.0,
              "replies": [
                {
                  "id": "n458m06",
                  "author": "slow_RSO",
                  "body": "Great when something isn’t going wrong lol",
                  "score": 1,
                  "created_utc": 1753008097.0,
                  "replies": [
                    {
                      "id": "n4660dj",
                      "author": "_zurenarrh",
                      "body": "Ok you have yet to provide any details? Do you even have one",
                      "score": 2,
                      "created_utc": 1753021788.0,
                      "replies": [
                        {
                          "id": "n4nod7b",
                          "author": "AFeralTaco",
                          "body": "Bro, do you even FOLD?!",
                          "score": 1,
                          "created_utc": 1753245141.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3m3nhp",
      "author": "vanilla_muffin",
      "body": "For a sub called gadgets, I am left wondering why some people even follow this sub based on their comments.",
      "score": 625,
      "created_utc": 1752752501.0,
      "replies": [
        {
          "id": "n3mcemh",
          "author": "NCSUGrad2012",
          "body": "What’s even funnier is how a sub called r/technology hates technology, lol",
          "score": 168,
          "created_utc": 1752755761.0,
          "replies": [
            {
              "id": "n3mg9om",
              "author": "Mrchristopherrr",
              "body": "r/technology is basically just “r/politics but it involves a website” at this point",
              "score": 128,
              "created_utc": 1752757061.0,
              "replies": [
                {
                  "id": "n3o4fvz",
                  "author": "Cortheya",
                  "body": "/r/technews is even worse. Anything involving machine learning or apple is shut down and mocked, not to mention the nonstop sinophobia. \n\nDon’t even get me started on /r/science becoming “10 Things You Didn’t Know Narcicissts (EVIL DARK PERSONALITY PEOPLE!) Do”",
                  "score": 24,
                  "created_utc": 1752774186.0,
                  "replies": [
                    {
                      "id": "n3tq7gq",
                      "author": "anonisko",
                      "body": "Reddit is just a social tabloid at this point. \n\nDamn near unusable.",
                      "score": 4,
                      "created_utc": 1752849958.0,
                      "replies": []
                    },
                    {
                      "id": "n3oi0lu",
                      "author": "callmejenkins",
                      "body": "/r/science is like the poster child of why no one trusts science anymore.",
                      "score": 7,
                      "created_utc": 1752778022.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3nlx1u",
                  "author": "Rahyan30200",
                  "body": "Exactly. It's infuriating how it was more of a politics sub hating on any kind of tech than anything else.",
                  "score": 5,
                  "created_utc": 1752769151.0,
                  "replies": [
                    {
                      "id": "n3psee9",
                      "author": "tharkus_",
                      "body": "The trendy politics bs is a cancer. No matter what the topic is, some asshole has to bring something up about it or mention some dipshit politicians name. Even if I agree,  I don’t wanna see that shit all the time. Fuckin relentless.",
                      "score": 2,
                      "created_utc": 1752791641.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3n3equ",
              "author": "InsaneNinja",
              "body": "Nah, they’re hating that other people are willing/able to spend more money than them.",
              "score": 8,
              "created_utc": 1752764004.0,
              "replies": [
                {
                  "id": "n3nwd2c",
                  "author": "Landmine_Prime",
                  "body": "Reddit in a nutshell",
                  "score": 6,
                  "created_utc": 1752772019.0,
                  "replies": []
                },
                {
                  "id": "n3rzmz0",
                  "author": "Elephant789",
                  "body": "Nah, they're a bunch of technophobes.",
                  "score": 1,
                  "created_utc": 1752823710.0,
                  "replies": []
                },
                {
                  "id": "n3n5kse",
                  "author": "NCSUGrad2012",
                  "body": "So everyone?  Lol",
                  "score": -2,
                  "created_utc": 1752764601.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3p8lkr",
              "author": "StickFigureFan",
              "body": "The more you work with tech, the more you realize why so many programmers want to quit and live off the grid",
              "score": 1,
              "created_utc": 1752785603.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mcaz2",
          "author": "ColdCouchWall",
          "body": "Because it's Reddit, it's standard to always have a contrarian opinion",
          "score": 88,
          "created_utc": 1752755726.0,
          "replies": [
            {
              "id": "n3mkos7",
              "author": "MisterDangerly",
              "body": "Nuhuh",
              "score": 36,
              "created_utc": 1752758499.0,
              "replies": []
            },
            {
              "id": "n3ng3sf",
              "author": "TCsnowdream",
              "body": "Reddit: “No Fun Allowed” should be the sites motto",
              "score": 6,
              "created_utc": 1752767528.0,
              "replies": [
                {
                  "id": "n3nv4kq",
                  "author": "bonesnaps",
                  "body": "Reddit, where some rando has the top comment pushing their own narrative (like in this thread exactly)",
                  "score": -2,
                  "created_utc": 1752771680.0,
                  "replies": [
                    {
                      "id": "n3qne9j",
                      "author": "TCsnowdream",
                      "body": "That…. Reddit is full of cynics?? You… are cynical that that’s the truth? Lawl",
                      "score": 1,
                      "created_utc": 1752802326.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3n7l71",
          "author": "SmokeySFW",
          "body": "Suffering from success.  It shows up on r/all and lots of people not subbed to gadgets just see a headline and think \"Ugh, that's so stupid why would anyone want that?\"\n\nI personally don't want a folding screen phone, but nobody asked.",
          "score": 20,
          "created_utc": 1752765165.0,
          "replies": [
            {
              "id": "n3ng057",
              "author": "Bderken",
              "body": "I own a fold 6. The experience is awful. Never again will I buy a folding phone until ALL apps are MADE TO FIT THE SCREEN PROPERLY. Horrible. Won’t buy the Apple one either until that happens",
              "score": 5,
              "created_utc": 1752767498.0,
              "replies": [
                {
                  "id": "n3o4tcz",
                  "author": "blogg10",
                  "body": "What apps are you using that don't work with it? I have a fold5 and I love it, I worried I'd get bored of the fold and just not use it, but I read a lot on my phone and I love being able to unfold it into a mini e-reader size. Same for watching youtube videos on the train or whatever. There's a few apps that haven't caught up yet - Discord is fucking dreadful for this - but the longer foldables stick around, the more app developers will catch up.",
                  "score": 3,
                  "created_utc": 1752774287.0,
                  "replies": [
                    {
                      "id": "n3o704p",
                      "author": "Bderken",
                      "body": "My biggest gripe that made me change was Google fucking messages. They made it better the past year but I still read more messages per window in my iPhone 16 pro max (or s25 ultra) than the fucking stupid shit app on the fold. Google doesn’t optimize shit for any fold phone. \n\nReddit sucks on the fold, both screens, and yeah YouTube and some light games are insanely good on the fold phones which is why I bought it. I also love reading books on it but rather use the kindle. I will say comic books on it are not that good because the apps for the fold are not optimized and suck.\n\nOverall shit experience",
                      "score": 1,
                      "created_utc": 1752774881.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3pt0cj",
                  "author": "Tangled2",
                  "body": "Apple usually has tighter controls than Google does when it comes to their respective app SDK (largely because Apple only has to support iPhones, whereas the Android device ecosystem is the wild west).\n\nI'd bet the default for \"legacy\" apps is to maintain the original aspect ratio and allow multitasking on the side, with updated apps being able to expand to fill the whole screen (or only take up half... or only a quarter).",
                  "score": 0,
                  "created_utc": 1752791840.0,
                  "replies": []
                },
                {
                  "id": "n4551e8",
                  "author": "_zurenarrh",
                  "body": "Lmao this is nonsense .. you must not have went into the settings and turned on all apps full screen\n\nOnce you tinker with the settings it’s great\n\nIt’s NOT Apple…your phone is meant to be tinkered with",
                  "score": 0,
                  "created_utc": 1753006041.0,
                  "replies": [
                    {
                      "id": "n46h6gw",
                      "author": "Bderken",
                      "body": "I changed the aspect ratio for every app. I own more androids than anyone I know. And currently use them all for various reasons.\n\nThe folds ore objectively shit. Google messages app on every fold is shit. I see more messages on my iPhone and s25 ultra than the fold. That shouldn’t happen when the folds inner screen is bigger.\n\nNot only that, you can’t even root the American fold 6… every android I have is rooted and I can mess with ip tables. Only reason I have androids in the first place honestly. \n\nSo yeah it’s a shit experience. Samsung one ui 7 also has the worst battery performance I’ve ever seen. Only solution is to wipe the phone, and MAYBE that works. It’s dog shit.",
                      "score": 1,
                      "created_utc": 1753025329.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3nfzkj",
              "author": "Trixles",
              "body": "Yeah, I just don't get it. I've had multiple different phone nerds (not derogatory, just a description) try to explain the use cases to me and I struggle to follow.\n\n\"What if you need to look at a big spreadsheet on your phone? A normal screen is too small for that!\"\n\nUmm . . . I go to my computer like a normal person and look at it there? Lol.",
              "score": -1,
              "created_utc": 1752767494.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3nl3x3",
          "author": "alan-penrose",
          "body": "This sub is always telling me how stupid and unsuccessful new tech is going to be just for it to be wildly popular and the industry standard 3-4 years down the line.",
          "score": 11,
          "created_utc": 1752768926.0,
          "replies": []
        },
        {
          "id": "n3m80ws",
          "author": "Guy-Manuel",
          "body": "It’s for discussing gadgets, not mindlessly glazing them",
          "score": 48,
          "created_utc": 1752754185.0,
          "replies": [
            {
              "id": "n3mfwmp",
              "author": "TrippySubie",
              "body": "What about mindlessly being upset about everything?",
              "score": 64,
              "created_utc": 1752756941.0,
              "replies": []
            },
            {
              "id": "n3mfa0m",
              "author": "MisterEinc",
              "body": "For real. I love gadgets. I don't love overpaying. Let someone else take the early-adopter tax.",
              "score": 4,
              "created_utc": 1752756735.0,
              "replies": [
                {
                  "id": "n3n5te9",
                  "author": "SUPRVLLAN",
                  "body": "What would you pay for this, if you were interested in buying a foldable?",
                  "score": 4,
                  "created_utc": 1752764668.0,
                  "replies": [
                    {
                      "id": "n3nkkju",
                      "author": "AreYouOKAni",
                      "body": "About $1200? Considering all the risks I am taking with the screen technology not being there yet, inferior cooling, inferior cameras, etc., seems like a solid start.",
                      "score": 3,
                      "created_utc": 1752768776.0,
                      "replies": [
                        {
                          "id": "n3r5xk6",
                          "author": "Sk8erBoi95",
                          "body": "Funnily enough, that's almost the price of an unlocked Galaxy ZFold 6. Found one on Amazon for $1300, although it is pink and \"only\" 256 GB. The 512 GB version is ~$1900",
                          "score": 0,
                          "created_utc": 1752809335.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3ndax5",
                  "author": "SuperBackup9000",
                  "body": "Nothing wrong with pointing out how the price is absurd, but if that’s all you’re doing, you’re not really contributing much at all. Like surely there’s more to discuss instead of just making a joke or saying it costs too much. \n\nComment sections like these just remind me of when I was in high school and we had a substitute",
                  "score": 3,
                  "created_utc": 1752766751.0,
                  "replies": [
                    {
                      "id": "n3o11bq",
                      "author": "beardedcoffeed",
                      "body": "It’s like when people who could never afford a Tesla were saying they’re gonna boycott Teslas. Like… how are you going to boycott something you never were going to have?",
                      "score": 2,
                      "created_utc": 1752773272.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3niff5",
              "author": "-Badger3-",
              "body": "Bro, every other post here is an ad",
              "score": 0,
              "created_utc": 1752768175.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3n3qf5",
          "author": "UpsetKoalaBear",
          "body": "This sub and r/hardware most likely have a 90% crossover rate in terms of people subscribed to them. \n\nRealistically, these subs could be turned into one single sub and you’d probably notice no difference.\n\nIt doesn’t help that on subs like this and r/hardware, 99% of comments when someone criticises something is almost always about the software rather than judging something for what it physically is (which is the whole point). \n\nFor example:\n\n- Headline: “The new iPad Pro has a M4 chip” people respond with: “Yeah but it’s still shit because it’s held back by software”\n\n- Headline: “The Switch 2 hardware feels underwhelming for the price” people respond with “Yeah but people don’t buy the Switch for the hardware”\n\n- Headline: “The foldable iPhone is going to have a 7.8 inch display and cost $2k” people respond with “Yeah but it’s still shit because you can’t sideload and iOS is a walled garden” \n\nThose are genuine points to be made, don’t get me wrong, but probably aren’t suited to a discussion around the hardware of what they’re talking about. \n\nIf the moderators made a concerted attempt to kill conversations around software in hardware based discussion, then it would probably be better. \n\nHowever, as it stands, there is practically no difference in any discussion between this sub and r/hardware.",
          "score": 4,
          "created_utc": 1752764093.0,
          "replies": []
        },
        {
          "id": "n3nbojg",
          "author": "debbietheladie",
          "body": "Holy shit you weren’t kidding about these comments lol",
          "score": 3,
          "created_utc": 1752766304.0,
          "replies": []
        },
        {
          "id": "n3n4q3i",
          "author": "Jaerba",
          "body": "In a thread on gaming peripherals, people were questioning why gaming devices use 2.4Ghz RF adapters instead of Bluetooth or **WiFi**.\n\nThis place could basically be called /r/luddites.",
          "score": 2,
          "created_utc": 1752764364.0,
          "replies": []
        },
        {
          "id": "n3o96zc",
          "author": "dabblebudz",
          "body": "Well they could be like me and not following the sub. I like to browse down “best” on the home page of my narwhal app to get a nice random variety of things. I don’t actually follow any subs but end up in a lot of places.",
          "score": 1,
          "created_utc": 1752775496.0,
          "replies": []
        },
        {
          "id": "n3ztydf",
          "author": "jonathanrdt",
          "body": "It shows up in 'News'.",
          "score": 1,
          "created_utc": 1752932775.0,
          "replies": []
        },
        {
          "id": "n3n7ny5",
          "author": "Chr0ll0_",
          "body": "Second",
          "score": 0,
          "created_utc": 1752765186.0,
          "replies": []
        },
        {
          "id": "n3mdwel",
          "author": "Fickle_Finger2974",
          "body": "Because people really don’t want foldable phones? If the general opinion is overwhelmingly negative even in tech centered spaces maybe people just aren’t interested.",
          "score": -14,
          "created_utc": 1752756274.0,
          "replies": [
            {
              "id": "n3mfa9i",
              "author": "jayboaah",
              "body": "Reddit* doesn’t want foldable phones. There wouldn’t be new expensive foldables being developed, manufactured, and sold every year by new manufacturers, including all but one major brand at this point. The one we’re talking about. \n\nThese phones sell every year, because people want them lol",
              "score": 16,
              "created_utc": 1752756737.0,
              "replies": [
                {
                  "id": "n3mggpj",
                  "author": "Fickle_Finger2974",
                  "body": "I find similar opinions off of Reddit as well. I don’t know anyone who has one or is interested in purchasing one. If anything Reddit skews heavily towards being exited by new things such as foldable phones.\n\n I also don’t mean literally no one as in not a single person. As a share of all phones sold it’s just not that many. Most sales were in the last few years. The real question will be do people that buy one end up buying another?",
                  "score": -14,
                  "created_utc": 1752757125.0,
                  "replies": [
                    {
                      "id": "n3mhcgz",
                      "author": "jayboaah",
                      "body": "I worked in a store selling phones for a MVNO that’s not cricket level, but still not major carrier status. At first it was a LCOL area and the other store was in one of the richest suburbs in the country. Both stores regularly sold folding phones to people willing to finance a $1800 phone for 2 years. \n\nIt’s a small market, but it’s an expensive market that one player has 80% of the hold on. It’s dumb to see those phones sell, sell well, sell well while being the most expensive phones on the market, and think “why are people still making these?”",
                      "score": 3,
                      "created_utc": 1752757416.0,
                      "replies": [
                        {
                          "id": "n3mi6ac",
                          "author": "Fickle_Finger2974",
                          "body": "Okay? That really has nothing to do with what I’m saying",
                          "score": -12,
                          "created_utc": 1752757691.0,
                          "replies": [
                            {
                              "id": "n3min1l",
                              "author": "jayboaah",
                              "body": "You gave an anecdote about people off Reddit not wanting one, I gave an anecdote of people buying phones for many years \n\nThat’s how conversation works my guy. \n\nHave a good one!",
                              "score": 8,
                              "created_utc": 1752757843.0,
                              "replies": [
                                {
                                  "id": "n3misk9",
                                  "author": "Fickle_Finger2974",
                                  "body": "It’s like you read nothing I said",
                                  "score": -2,
                                  "created_utc": 1752757892.0,
                                  "replies": [
                                    {
                                      "id": "n3mjiep",
                                      "author": "jayboaah",
                                      "body": "I’d feel that way too if I were you I get it",
                                      "score": 5,
                                      "created_utc": 1752758123.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3mjkq9",
          "author": "Taki_Minase",
          "body": "Yes, more like fashiongets.",
          "score": -2,
          "created_utc": 1752758143.0,
          "replies": []
        },
        {
          "id": "n3ngj4b",
          "author": "j_cruise",
          "body": "Like what? Link one.",
          "score": -2,
          "created_utc": 1752767650.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3ly1vg",
      "author": "RomanOTCReigns",
      "body": "Is it really iPhone Fold instead of just iFold?",
      "score": 179,
      "created_utc": 1752750092.0,
      "replies": [
        {
          "id": "n3lyl0z",
          "author": "MLG-Sheep",
          "body": "iPhold",
          "score": 195,
          "created_utc": 1752750331.0,
          "replies": [
            {
              "id": "n3m2l3b",
              "author": "Edward_TH",
              "body": ">iPhold\n\nI'm personally gonna like this product even if turns out to be pure garbage if they decide to call it like this.",
              "score": 45,
              "created_utc": 1752752061.0,
              "replies": [
                {
                  "id": "n3rggsv",
                  "author": "rafark",
                  "body": "Unfortunately apple seems to have dropped all the fun & personality for generic corporate names since Tim Cook. Everything is apple + product now. No more iPhone, iPad, imac, itunes, iLife, Apple id. Everything is now Apple Watch, Apple Music, system settings, apple account, etc.",
                  "score": 3,
                  "created_utc": 1752813879.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3mgic8",
              "author": "None",
              "body": "[deleted]",
              "score": 7,
              "created_utc": 1752757140.0,
              "replies": [
                {
                  "id": "n3pb58f",
                  "author": "MyOnlyAccount_6",
                  "body": "The folio was a mysterious product the Palm tech guys had thought of back in the day that was supposed to be a bridge to the next thing but then iPhone was released and never had a chance.",
                  "score": 2,
                  "created_utc": 1752786335.0,
                  "replies": []
                },
                {
                  "id": "n3przyh",
                  "author": "Sivalon",
                  "body": "Hopefully no one ever forgets the H.",
                  "score": 1,
                  "created_utc": 1752791507.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3nm733",
              "author": "AFeralTaco",
              "body": "It logs you in using iPhold Id",
              "score": 0,
              "created_utc": 1752769229.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3m6824",
          "author": "NecessaryUnusual2059",
          "body": "They are never not gonna call it an iPhone",
          "score": 18,
          "created_utc": 1752753505.0,
          "replies": []
        },
        {
          "id": "n3lzinr",
          "author": "Mnm0602",
          "body": "iFold describes their Siri/AI team as well. ",
          "score": 28,
          "created_utc": 1752750749.0,
          "replies": [
            {
              "id": "n3m4pkb",
              "author": "thelionsmouth",
              "body": "I really wish they’d overhaul Siri to have actual ai functionality. Could you imagine the power of having Siri as an actual AI assistant that has base level access to your phone? \n\nI don’t care about writing emails or summarizing text messages. \n\nI want to organize my day with an assistant that knows my highs as lows throughout the day using heath data from my watch, notes from my journal, my calendar, my emails, and everything I give Apple. \n\nThis is aside from the obvious privacy concerns, but I feel like this is true overlooked advantage to ai functionality. I like the IDEA of Siri controlling the phone, but if it could access all areas and synthesize the info like a true llm that’d be great.\n\nPrivacy is totally a concern tho.\n\nEdit: I’m imagining this being run locally, there’s some very lightweight open source models out there that could come close to handling this, I have an llm on my raspberry pi ffs. I’m sure Apple could theoretically do it.\n\nI’m just saying it’s possible to have some semblance of privacy. Obv that’d never happen though",
              "score": 8,
              "created_utc": 1752752925.0,
              "replies": [
                {
                  "id": "n3mgh1r",
                  "author": "Even_Establishment95",
                  "body": "You just willingly hand over all of that personal information for more convenience. Opt me out of this dystopian nightmare.",
                  "score": 8,
                  "created_utc": 1752757128.0,
                  "replies": [
                    {
                      "id": "n3mjrx7",
                      "author": "thelionsmouth",
                      "body": "I wouldn’t. I’m just surprised Apple hasn’t thought to do it yet.",
                      "score": 1,
                      "created_utc": 1752758208.0,
                      "replies": [
                        {
                          "id": "n3ooyf3",
                          "author": "Mnm0602",
                          "body": "They think about it all the time I think, but realistically they have tried to appeal to people concerned about their data being socialized everywhere. If they changed course on that it would be notable and could hurt their brand/image/sales.",
                          "score": 1,
                          "created_utc": 1752779998.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3mfq3b",
                  "author": "TrippySubie",
                  "body": "Want privacy, also want intrusion. Pick one.",
                  "score": 14,
                  "created_utc": 1752756882.0,
                  "replies": [
                    {
                      "id": "n3mjoem",
                      "author": "thelionsmouth",
                      "body": "I realize it’s not realistic. In a perfect world it’d be a walled garden with encryption even Apple couldnt access but let’s be real. \n\nI’m just surprised they haven’t leaned into a better assistant integrated into the phone. People would want that, and they don’t seem to care about privacy as much as they should.",
                      "score": 4,
                      "created_utc": 1752758176.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3md4yu",
              "author": "chronicking83",
              "body": "Got ‘em!",
              "score": 1,
              "created_utc": 1752756013.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mjv72",
          "author": "dandroid126",
          "body": "iPhone fold seems like a much better than than iFold. It's an iPhone that folds. It's not a new product. It's same with iPod Touch. It wasn't called iTouch.",
          "score": 14,
          "created_utc": 1752758237.0,
          "replies": [
            {
              "id": "n3myncx",
              "author": "rudimentary-north",
              "body": "Sooooo many people called it “itouch” anyways lol\n\nSee for example: https://discussions.apple.com/thread/1562847?sortBy=rank",
              "score": 6,
              "created_utc": 1752762670.0,
              "replies": [
                {
                  "id": "n3n1yjj",
                  "author": "dandroid126",
                  "body": "...yeah, maybe that was a bad example. A shorthand name of iTouch was ubiquitous. But that's what I get for commenting right when I wake up.",
                  "score": 2,
                  "created_utc": 1752763596.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3lzifn",
          "author": "hatramroany",
          "body": "They phased out using “i” for new products years ago. Only iPhone, iPad, and iMac still have it grandfathered in",
          "score": 17,
          "created_utc": 1752750746.0,
          "replies": [
            {
              "id": "n3mftnq",
              "author": "TrippySubie",
              "body": "Gonna be hard to drop the i from their iPhone when everyone knows it as an iPhone lol",
              "score": 3,
              "created_utc": 1752756914.0,
              "replies": [
                {
                  "id": "n3nsfv8",
                  "author": "darkbreak",
                  "body": "It would be weird at first but considering how Musk changed Twitter's name to \"X\" and people really did go along with it in the end Apple could probably do it too. Now, personally, I still call it \"Twitter\". I'll never call it the other name. But \"Apple Phone\" could probably end up working in the end. I don't know about iPad and iMac renames though. Not unless Apple decides to drop them as products altogether and bring in new ones with new names. You know, like the old Powerbook laptops they used to have.",
                  "score": 0,
                  "created_utc": 1752770955.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3n285g",
              "author": "jim_deneke",
              "body": "IS it just going be Phone from here on in?",
              "score": 1,
              "created_utc": 1752763672.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mayvy",
          "author": "PM_ME_UR_SO",
          "body": "iFad",
          "score": 1,
          "created_utc": 1752755254.0,
          "replies": []
        },
        {
          "id": "n3mm35y",
          "author": "NightmareElephant",
          "body": "If they break away from the iPhone name, it’ll probably just be something along the lines of Apple Fold like they did with the Watch.",
          "score": 1,
          "created_utc": 1752758938.0,
          "replies": []
        },
        {
          "id": "n3na3je",
          "author": "egnards",
          "body": "It's a smart move, because iPhone lets consumers know what it is, and allows basically any prospective consumer understand what they're buying. iFold doesn't really tell the user anything other than the fact that the gadget folds. . .or plays poker for you.\n\nInformed consumers will certainly understand, but not every user is an informed consumer.",
          "score": 1,
          "created_utc": 1752765869.0,
          "replies": []
        },
        {
          "id": "n3mkjc5",
          "author": "MyVoiceIsElevating",
          "body": "You gotta know when iPhone them; know when iFold them.",
          "score": 1,
          "created_utc": 1752758450.0,
          "replies": []
        },
        {
          "id": "n3mab0b",
          "author": "kbthewriter",
          "body": "There'd be a lot of confusion around poker tables if it's called iFold",
          "score": 0,
          "created_utc": 1752755015.0,
          "replies": []
        },
        {
          "id": "n3njz1z",
          "author": "mgd09292007",
          "body": "iFold is something you say while playing Texas Hold'em",
          "score": 0,
          "created_utc": 1752768608.0,
          "replies": []
        },
        {
          "id": "n3mo6t6",
          "author": "M4R5W0N6",
          "body": "iFold isn't the product, it's the consumer",
          "score": -1,
          "created_utc": 1752759591.0,
          "replies": []
        },
        {
          "id": "n3n1kdw",
          "author": "hotcoolhot",
          "body": "iphooled",
          "score": -1,
          "created_utc": 1752763486.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3ly7ri",
      "author": "TheSpatulaOfLove",
      "body": "$2k?   Nah.",
      "score": 507,
      "created_utc": 1752750166.0,
      "replies": [
        {
          "id": "n3m2mwp",
          "author": "peakedtooearly",
          "body": "That's what Samsung are charging today.",
          "score": 363,
          "created_utc": 1752752083.0,
          "replies": [
            {
              "id": "n3m3byk",
              "author": "reformedmikey",
              "body": "The Samsung tri-fold phone is apparently going to be $3k. That’s ridiculous.",
              "score": 145,
              "created_utc": 1752752371.0,
              "replies": [
                {
                  "id": "n3m4f96",
                  "author": "Rizsparky",
                  "body": "1K per screen, simple math",
                  "score": 173,
                  "created_utc": 1752752812.0,
                  "replies": [
                    {
                      "id": "n3mkwrr",
                      "author": "revhuman",
                      "body": "1k per fold? I'm about to cash in.\n\n![gif](giphy|A3dD2XWfJ7tV6)",
                      "score": 34,
                      "created_utc": 1752758569.0,
                      "replies": [
                        {
                          "id": "n3mx208",
                          "author": "Tactical_Owl",
                          "body": "Not exactly right? 2 screens, 1 fold. 3 screens, 2 folds",
                          "score": 8,
                          "created_utc": 1752762218.0,
                          "replies": [
                            {
                              "id": "n3n2ulg",
                              "author": "ProfSnipe",
                              "body": "Yeah, I thought I'm crazy. But there aren't any 3 fold phones, there are the regular foldables that unfold once, and the 2 folds that unfold 2 times but everyone calls them 3 fold for some reason.",
                              "score": 1,
                              "created_utc": 1752763849.0,
                              "replies": [
                                {
                                  "id": "n3nuhps",
                                  "author": "Hugh_Jass_Clouds",
                                  "body": "A single fold wallet is called a bi-fold wallet. A wallet with 2 fold wallet is called a tri-fold wallet. I'm guessing that's where it comes from a count of the segments vs actual folds.",
                                  "score": 2,
                                  "created_utc": 1752771509.0,
                                  "replies": [
                                    {
                                      "id": "n3nutsz",
                                      "author": "ProfSnipe",
                                      "body": "Allright, I understand, but I don't accept it.",
                                      "score": 3,
                                      "created_utc": 1752771599.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n3neyij",
                          "author": "Far-Scallion7689",
                          "body": "Origami man?",
                          "score": 2,
                          "created_utc": 1752767205.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3mfkak",
                      "author": "Fluffychipmonk1",
                      "body": "Math checks out on this.",
                      "score": 3,
                      "created_utc": 1752756831.0,
                      "replies": []
                    },
                    {
                      "id": "n3nozik",
                      "author": "HeftyEggplant7759",
                      "body": "Two plus two is four, minus one, that's three, quick maffs",
                      "score": 1,
                      "created_utc": 1752770008.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3m5xa8",
                  "author": "micosoft",
                  "body": "Wait till you see the quad and octofold phones then!",
                  "score": 11,
                  "created_utc": 1752753391.0,
                  "replies": [
                    {
                      "id": "n3mg3sx",
                      "author": "El_Dud3r1n0",
                      "body": "I look forward to the day we get to witness people struggle to fold their phone up like an old road map.",
                      "score": 31,
                      "created_utc": 1752757007.0,
                      "replies": [
                        {
                          "id": "n3miayh",
                          "author": "crackednutz",
                          "body": "Origami phone",
                          "score": 11,
                          "created_utc": 1752757733.0,
                          "replies": []
                        },
                        {
                          "id": "n3mtwgw",
                          "author": "Kindness_of_cats",
                          "body": "![gif](giphy|X2xRGTElqdfry)",
                          "score": 5,
                          "created_utc": 1752761307.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3ma6b9",
                      "author": "HeftyArgument",
                      "body": "why skip sextuple fold?",
                      "score": 1,
                      "created_utc": 1752754969.0,
                      "replies": [
                        {
                          "id": "n3mau9v",
                          "author": "dclxvi616",
                          "body": "Puritanical reasons. Can’t have the children seeing that.",
                          "score": 2,
                          "created_utc": 1752755208.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3mj2x4",
                      "author": "APRobertsVII",
                      "body": "When people asked for 8K, they weren’t referring to price!",
                      "score": 1,
                      "created_utc": 1752757985.0,
                      "replies": []
                    },
                    {
                      "id": "n3no30g",
                      "author": "BiHGamer",
                      "body": "Rollophone gonna blow your mind, and your wallet",
                      "score": 1,
                      "created_utc": 1752769754.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3m8brl",
                  "author": "tayl428",
                  "body": "Using the new Las Vegas marketing model I see. 'We don't want people who want a $500 phone. We want people that can afford a $3,000 phone.' Less customers equals less support, less warranty, etc, and same or better profit. \n\nThis is just one luxe model though. They have so many others to fill in some other price gaps. \n\nTime for a phoenix to rise from the ashes.",
                  "score": 19,
                  "created_utc": 1752754297.0,
                  "replies": [
                    {
                      "id": "n3mb6gn",
                      "author": "reformedmikey",
                      "body": "The issue is less “affordable vs luxury”; there are plenty of affordable alternatives on the market. The issue is the most common phones on the market are becoming more expensive without actually innovating them. They add AI and folding screens with weak points and call that “innovation”, or bloatware, and more cameras (which admittedly is nice but besides the point). They’re now becoming more expensive than desktop/laptop computers, with far less functionality than one. Still people will buy them, because they have to have the “latest and greatest”. The cycle will continue to cycle.",
                      "score": 15,
                      "created_utc": 1752755329.0,
                      "replies": [
                        {
                          "id": "n3nfqck",
                          "author": "Dramatic_Explosion",
                          "body": "Not only that but we're reaching the feature price gating of modern vehicles.\n\nThe AI features you mentioned? At least with Samsung they note the feature is free until the end of 2025 and then will likely have an additional cost. We have yet to see if it's a one time unlock or a subscription, but this reeks of BMW and their subscription to use the cars heated seats.",
                          "score": 3,
                          "created_utc": 1752767420.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3mdi2t",
                      "author": "digiorno",
                      "body": "It’s how most mobile apps fund themselves too, whales. Something like 95% of revenue from 5% of players.\n\nSimilarly it has been said that private cooks are a sign of a crumbling empire. I guess before the fall of Rome there was a sharp increase in rich people hiring the top chefs. Basically whales buying the best food possible, one of the best commodities in the era.\n\nSo maybe this is a sign of a collapsing system, a shift from catering to the masses and to the rich for commodities that were once easily accessible for everyone.",
                      "score": 9,
                      "created_utc": 1752756138.0,
                      "replies": [
                        {
                          "id": "n3ngn6q",
                          "author": "Dramatic_Explosion",
                          "body": "I'm getting this vibe from Samsung. In a market that has Motorola still offering headphone jacks and a stylus, Samsung is taking away features.\n\nWhy get rid of micro SD card support? How much room do you save inside your device? Because they want to sell a cloud based storage subscription and if you're poor then go buy a poor person phone.",
                          "score": 1,
                          "created_utc": 1752767682.0,
                          "replies": []
                        },
                        {
                          "id": "n3owrbm",
                          "author": "patricio87",
                          "body": "Or maybe its a fucking foldable phone so it costs 2k?",
                          "score": 1,
                          "created_utc": 1752782254.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3msn8a",
                  "author": "Ruttagger",
                  "body": "HUAWEI makes a tri fold that's over $5k.",
                  "score": 3,
                  "created_utc": 1752760935.0,
                  "replies": [
                    {
                      "id": "n3nrqjh",
                      "author": "Hashabasha",
                      "body": "let's not exagerate. its 3.5k globally and around 2k USD if imported.",
                      "score": 1,
                      "created_utc": 1752770765.0,
                      "replies": [
                        {
                          "id": "n3o2nq5",
                          "author": "Ruttagger",
                          "body": "I'm looking at one as I type this that's 5k.",
                          "score": 1,
                          "created_utc": 1752773710.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3mt40b",
                  "author": "thishasntbeeneasy",
                  "body": "I'm holding out for the quad fold for $4k",
                  "score": 1,
                  "created_utc": 1752761074.0,
                  "replies": []
                },
                {
                  "id": "n3no6a5",
                  "author": "prawnk1ng",
                  "body": "HUAWEI already have their 3x fold out. \n2k.",
                  "score": 1,
                  "created_utc": 1752769779.0,
                  "replies": []
                },
                {
                  "id": "n3u0kuu",
                  "author": "Slight-Song1404",
                  "body": "How is it ridiculous? Can you personally manufacture an iPhone fold with their hardware, software, and everything included? No. I didn’t think so. It’s a steal when you think of it that way",
                  "score": 0,
                  "created_utc": 1752852867.0,
                  "replies": [
                    {
                      "id": "n3ua9ro",
                      "author": "reformedmikey",
                      "body": "Making something everyone uses prohibitively expensive every year by releasing a “new” version without innovating or drastically improving functionality or adding new features is ridiculous. Let’s use Apple as an example. Every year they “upgrade” the camera and chipset. They discontinued their true “budget” phone, the SE, in favor of the 16e. The SE 3 started at $429, was released in 2022. Now, these SE phones used some parts from older phones such as the camera and shell, but they tend to use newer chipsets so it ran similar to the numbered iPhone it release alongside. I have the 2nd generation SE (released in 2020 at $399) and it was a solid phone until it started showing its age this year. It’s a 5 year old phone, I should expect that. I can’t buy a new SE 3 (released 2022 at $429) from Apple, but I can shell out $599 for the new 16e “budget phone”. That’s not a terribly large price difference, but for people who can’t afford a new phone it can be since the difference might be one or more phone payments (about 2.5 of mine). Apple hasn’t necessarily raised their prices of their phones, at least since I bought my current phone, base models start at $799 and pro models start at $999. However, they raised the price of the SE two years after “reintroducing” it, then killed it. Granted they raised the price by $30, but raising is still raising. Except, now that they killed the SE model they opted to raise the price further by calling it the latest release number followed by an e, and raising the price to $599. What is inherently different? Is it different than the iPhone mini, another model that they killed? The mini was just a smaller sized version, so I’m not sure I’d call it a “budget offering”, considering the last mini was the 13 and the price difference between the 13 ($799) and the 13 mini ($699) was a whopping $100. Neither the mini nor the 16e are much of a savings, when you consider previous savings for budget offerings was closer to $400 difference. \n\nTo answer your stupid fucking, shitty rhetorical question: no I cannot manufacture a phone. Or I can, you don’t know me. But what I can say is creating something “new” that isn’t adding new features and charging “new” prices for them every year is ridiculous. A new camera and chipset isn’t “new” unless you add features that are innovative. Companies used to do that with phones, then the market got lazy and stopped caring about that. Myself included in this. Just because we’ve normalized it, doesn’t make it any less ridiculous. I remember a time when the Razr was released, and its biggest selling point was how thin it was compared to other cell phones at the time. Today, it seems we care about minuscule camera differences, adding AI, and foldable screens with weak points that will likely break after multiple years of use. I used two different razrs over the course of 7-8 years, only replacing them because I broke them as a reckless teenager. Phones actually lasted back then, but today they’re made to be replaced every year either through failure of the phone or vanity of the buyer. And imagine spending $800+/year just to have the “newest” phone, which works exactly like your last phone apart from differences you will never notice. Just to replace it next year over differences you’ll never actually notice.",
                      "score": 1,
                      "created_utc": 1752855603.0,
                      "replies": [
                        {
                          "id": "n3ue68g",
                          "author": "Slight-Song1404",
                          "body": "You don’t have to buy it, you dense irritating dumbass. If you’re too poor, then don’t! There are cheaper phones. Why don’t you whine about it some more. Some of us have extra money to afford stuff like this and want it. You’re just mad because I made a good point lol\n\nSome of us aren’t like you, and actually keep these phones for 5+ years. 2000/5=400 a year for a top notch phone. I wouldn’t call that prohibitively expensive. You just don’t understand finances lol",
                          "score": 0,
                          "created_utc": 1752856732.0,
                          "replies": [
                            {
                              "id": "n3uesvl",
                              "author": "reformedmikey",
                              "body": "Homie I’ve had my phone 5 years. Read my comment.",
                              "score": 1,
                              "created_utc": 1752856912.0,
                              "replies": [
                                {
                                  "id": "n3ufenl",
                                  "author": "Slight-Song1404",
                                  "body": "Ok. Your argument is their phones are getting “prohibitively” (lol?) more expensive. You know you can buy their older year models, that works JUST fine, for dirt cheap, right? Like, your brain actually can comprehend that, right? You know you don’t HAVE to buy their upcoming fold for what people are estimating to be around 2 grand, right? You get that? You sure? Idk it seems like you don’t",
                                  "score": 0,
                                  "created_utc": 1752857083.0,
                                  "replies": [
                                    {
                                      "id": "n3ugo35",
                                      "author": "reformedmikey",
                                      "body": "Oldest mode iPhone you can buy from Apple is the iPhone 15, stating at $699. $100 savings, whoopdiefuckingdoo. You still have zero comprehension of my argument. It’s not a matter of what I do or do not have to buy. It’s a matter of not innovating the phone to justify releasing a new version. I understand what you’re saying, but you’re very obviously failing to comprehend my argument. You can insult me, I can insult you, but the fact is you’re bad at reading comprehension. You can keep up with talking points all you want lil homie, but until you counter my entire argument that companies are killing budget phones in favor of more expensive versions of “budget phones” and re-releasing the same goddamn phone year after year without innovation you’re not going to get anywhere. Innovation used to happen with mobile devices, and now the market doesn’t care enough so the producers don’t make those developments.",
                                      "score": 1,
                                      "created_utc": 1752857435.0,
                                      "replies": [
                                        {
                                          "id": "n3uhqr3",
                                          "author": "Slight-Song1404",
                                          "body": "What the hell do you want from your new phone innovations each year? A portable sauna that projects from your phone using alien technology? You keep saying innovation. Although a fold phone has been done by other companies before, if Apple does one I guarantee plenty will buy it. Apple software is fantastic with their phones and if they could pull off a fold phone that is nearly crease-less it would be awesome. And you’re wrong, btw. You can still buy older versions of iPhones. Maybe not *directly* from Apple, but you still can for wayyyyyy cheaper. And (shocker) they still work great. Bye",
                                          "score": 0,
                                          "created_utc": 1752857728.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3m4ubd",
              "author": "trickman01",
              "body": "Nah to them too.",
              "score": 17,
              "created_utc": 1752752976.0,
              "replies": [
                {
                  "id": "n3mgz7w",
                  "author": "alc4pwned",
                  "body": "That's about what all folding phones of this form factor cost, +/- a little bit.",
                  "score": 1,
                  "created_utc": 1752757293.0,
                  "replies": [
                    {
                      "id": "n3o07on",
                      "author": "trickman01",
                      "body": "Nah to all of them.",
                      "score": 0,
                      "created_utc": 1752773053.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3n2yyf",
              "author": "AgencyBasic3003",
              "body": "This is just the fantasy sticker price. You could already get it for 30% discount from Samsung directly. A realistic price is somewhere around $1500.",
              "score": 7,
              "created_utc": 1752763883.0,
              "replies": []
            },
            {
              "id": "n3mt1sh",
              "author": "thishasntbeeneasy",
              "body": "I've never seen anyone using one.",
              "score": 4,
              "created_utc": 1752761056.0,
              "replies": [
                {
                  "id": "n3no29j",
                  "author": "mattcoady",
                  "body": "I've got the Google Fold 9. There's dozens of us!",
                  "score": 1,
                  "created_utc": 1752769748.0,
                  "replies": []
                },
                {
                  "id": "n4aq8dz",
                  "author": "Kcin928",
                  "body": "I had one for awhile and absolutely loved it. I'm back to a note and wish I had a fold again",
                  "score": 1,
                  "created_utc": 1753079403.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3mb5vc",
              "author": "manyeggplants",
              "body": "And they aren't worth it either",
              "score": 2,
              "created_utc": 1752755323.0,
              "replies": []
            },
            {
              "id": "n3mqftz",
              "author": "YoureGrammerIsWorsts",
              "body": "They actually have sales though",
              "score": 1,
              "created_utc": 1752760276.0,
              "replies": []
            },
            {
              "id": "n3n28ac",
              "author": "audigex",
              "body": "And nobody’s buying them either\n\nSales figure for the Flip Z are under 100k a month … vs the S25 series at about 4 million sales a month",
              "score": 1,
              "created_utc": 1752763673.0,
              "replies": []
            },
            {
              "id": "n3o00mj",
              "author": "learnedsanity",
              "body": "Dont buy that either",
              "score": 1,
              "created_utc": 1752773002.0,
              "replies": []
            },
            {
              "id": "n3r5gia",
              "author": "WolfieVonD",
              "body": "Except that's just the sticker price. You can easily get them from 1000 to 1200 depending on size/version",
              "score": 1,
              "created_utc": 1752809144.0,
              "replies": []
            },
            {
              "id": "n4gx2yv",
              "author": "WillingLake623",
              "body": "Samsung is actually selling a mobile computer rather than the Fischer price toy of a computer that is anything running iOS",
              "score": 1,
              "created_utc": 1753158259.0,
              "replies": []
            },
            {
              "id": "n3misg1",
              "author": "henryguy",
              "body": "At least it's got a 200MP camera and is thin as hell.",
              "score": 1,
              "created_utc": 1752757891.0,
              "replies": []
            },
            {
              "id": "n3mug9y",
              "author": "crudetatDeez",
              "body": "The android chuds won’t like this comment 😂",
              "score": -1,
              "created_utc": 1752761470.0,
              "replies": []
            },
            {
              "id": "n3m66n4",
              "author": "sercommander",
              "body": "The main problem may lay not in a price but what apple users are used to. I gave my fold to a bunch of people to toy with and use for prolonged periods of time. Most disliked using the foldable concept specifically. They were absolutely hellbent staying on a brick phone. \n\nThis is just like Vision Pro. The price and horrible quality did their fair share of damage but the product was simply not apple folks bread.",
              "score": -8,
              "created_utc": 1752753490.0,
              "replies": [
                {
                  "id": "n3m7t9u",
                  "author": "BootyMcStuffins",
                  "body": "Current iOS user who switched from a galaxy z fold 5. I’d love to have a fold again",
                  "score": 2,
                  "created_utc": 1752754105.0,
                  "replies": [
                    {
                      "id": "n3mjgho",
                      "author": "PierreFeuilleSage",
                      "body": "You might be mostly missing one ui",
                      "score": 1,
                      "created_utc": 1752758106.0,
                      "replies": [
                        {
                          "id": "n3mk3do",
                          "author": "BootyMcStuffins",
                          "body": "Nah, honestly I don’t mind either OS.\n\nI miss having a giant screen in my pocket for reading books, guitar tabs, watching videos, etc.\n\nHad to give a best man speech and having that big screen was great",
                          "score": 2,
                          "created_utc": 1752758309.0,
                          "replies": [
                            {
                              "id": "n3n7w4s",
                              "author": "sercommander",
                              "body": "Watching videos is not exactly Fold's strong point if it is not 1:1 or 4:3 ratio. Smaller phones have more usable 16:9 screen that a fold has. My Note 20 Ultra and subsequent Ultra series have way more screen that shows the video. Heck, smaller phones have more screen estate for 16:9. Not to mention shorts, tiktoks and reels are no good on main screens - and they are pretty much bread and butter of average modern user.\n\nI think thinner design of Fold 7 will help keep people that watch vertical videos (shorts) a lot. The issue here is how do you go from there to videos?",
                              "score": 0,
                              "created_utc": 1752765250.0,
                              "replies": [
                                {
                                  "id": "n3nnizx",
                                  "author": "BootyMcStuffins",
                                  "body": "But you get the full size of your main screen plus can scroll the comments in YouTube",
                                  "score": 1,
                                  "created_utc": 1752769597.0,
                                  "replies": []
                                },
                                {
                                  "id": "n3r5xck",
                                  "author": "WolfieVonD",
                                  "body": "The 4:3 has been amazing for emulation or watching old shows and movies",
                                  "score": 1,
                                  "created_utc": 1752809333.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3m2rkq",
          "author": "StaysAwakeAllWeek",
          "body": "That's just what it costs to manufacture something that has all the parts a high end phone does but also an 8\" flexible OLED screen and a wildly complicated hinge system\n\nAnd they don't try to down-spec them either because nobody wants to pay $1000 for budget phone specs",
          "score": 69,
          "created_utc": 1752752136.0,
          "replies": [
            {
              "id": "n3mw3iz",
              "author": "hi_im_bored13",
              "body": "yeah people here think samsung is pricing their tri-fold at $3k for fun lol, there are several players in this market and all of them price their phones similarly for a reason, crazy money to be made by even marginally undercutting the competition. \n\nLike nobody is telling you to buy it, I'll happily buy it, as will many others, there were 18 million foldables overall last year, yes that isn't much as a portion of the entire market but they are all pricey to manufacture and high margin products",
              "score": 13,
              "created_utc": 1752761945.0,
              "replies": [
                {
                  "id": "n3pjcs2",
                  "author": "electricity_is_life",
                  "body": "I have no idea what the true manufacturing cost of these things is, but I will point out that other similar phones like the OnePlus Open have been considerably cheaper (though still not cheap by any means). I do think Samsung could probably get the price down at least a little bit if they really wanted to, but as you said people are buying them as-is so clearly they see no need.",
                  "score": 1,
                  "created_utc": 1752788776.0,
                  "replies": [
                    {
                      "id": "n3pkj04",
                      "author": "hi_im_bored13",
                      "body": "BOM estimates put it at just under \\~$800, that is of course ignoring the R&D cost which is going to be amortized over multiple generations",
                      "score": 1,
                      "created_utc": 1752789130.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3m7k29",
          "author": "Markharris1989",
          "body": "Foldable? Nah",
          "score": 13,
          "created_utc": 1752754009.0,
          "replies": [
            {
              "id": "n3m81gx",
              "author": "BootyMcStuffins",
              "body": "My galaxy z fold 5 was fantastic! I’d LOVE to get a fold again",
              "score": 4,
              "created_utc": 1752754191.0,
              "replies": []
            },
            {
              "id": "n3n063j",
              "author": "trwawy05312015",
              "body": "I don’t understand why this is a trend.",
              "score": 1,
              "created_utc": 1752763098.0,
              "replies": [
                {
                  "id": "n3nn6el",
                  "author": "Gregus1032",
                  "body": "Not gonna lie, I want the Motorola Razr for nostalgia and aesthetics. \n\nI won't buy one, but if I got one for free I'd use it as a daily driver.",
                  "score": 4,
                  "created_utc": 1752769500.0,
                  "replies": []
                },
                {
                  "id": "n3n2cy9",
                  "author": "InsaneNinja",
                  "body": "More screen in your pocket. Multitasking like crazy. \n\nAlso, the general appearance of a cool factor. Real or otherwise.",
                  "score": 12,
                  "created_utc": 1752763710.0,
                  "replies": []
                },
                {
                  "id": "n3nmpt8",
                  "author": "ackermann",
                  "body": "You don’t understand why anyone would want a bigger screen, that still fits in your pocket?  \n\nI don’t personally want a foldable, but I don’t think it’s that hard to understand wanting a larger screen",
                  "score": 6,
                  "created_utc": 1752769373.0,
                  "replies": []
                },
                {
                  "id": "n3nbzye",
                  "author": "soonerfreak",
                  "body": "I think the tech is finally there, I messed with one in the Samsung store and the Fold 7 was pretty amazing in hand. I'm sure the Apple version will sell out everywhere.",
                  "score": 5,
                  "created_utc": 1752766393.0,
                  "replies": [
                    {
                      "id": "n3ndsmk",
                      "author": "Chodless",
                      "body": "i have the samsung fold and its been great for what i wanted it for, i had an s10 for like 8 years so finally an upgrade and i wanted something easier to play osrs on mobile with so it was perfect",
                      "score": 2,
                      "created_utc": 1752766886.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3mfcgw",
          "author": "chintan_joey",
          "body": "Wait till you realize people have already been paying $1.5k without taxes on a 1TB iPhone Pro Max.",
          "score": 22,
          "created_utc": 1752756758.0,
          "replies": [
            {
              "id": "n3mgsuz",
              "author": "alc4pwned",
              "body": "...which is actually less than what the 1TB S25 Ultra costs.",
              "score": 23,
              "created_utc": 1752757235.0,
              "replies": [
                {
                  "id": "n3mjwoe",
                  "author": "PierreFeuilleSage",
                  "body": "Makes sense when you see what both offer",
                  "score": -3,
                  "created_utc": 1752758250.0,
                  "replies": [
                    {
                      "id": "n3mllld",
                      "author": "alc4pwned",
                      "body": "I'd agree. Both are good phones, but the S25 Ultra offers some nice extras like the s pen and better optical zoom on the camera.",
                      "score": 0,
                      "created_utc": 1752758787.0,
                      "replies": [
                        {
                          "id": "n3mqcpo",
                          "author": "azlan194",
                          "body": "As someone who has S23 Ultra, I keep thinking, who are these people who use the S pen as like a real thing instead of just a few doodles or as a camera shutter (which what I'm using it for, but you cant use the s pen as a shutter anymore in the new one since they removed the Bluetooth on it).",
                          "score": 9,
                          "created_utc": 1752760250.0,
                          "replies": []
                        },
                        {
                          "id": "n3n2lxk",
                          "author": "InsaneNinja",
                          "body": "It’s a good thing Apple is finally updating their optical zoom with the next generation. Not nearly enough but better.",
                          "score": 0,
                          "created_utc": 1752763781.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3mb2bo",
          "author": "dontthink19",
          "body": "Im considering a zfold 7 from zfold 5 and the 1tb option is $2200. Its only considerable due to the $1k off through direct trade in. \n\nI do think im gonna wait for the s26 ultra. I had the s23 ultra and loved it and I would rather have a better camera than a fold out phablet screen",
          "score": 6,
          "created_utc": 1752755288.0,
          "replies": [
            {
              "id": "n3mc6rm",
              "author": "splinter6",
              "body": "Phablet is a word I haven’t heard in a while",
              "score": 3,
              "created_utc": 1752755685.0,
              "replies": [
                {
                  "id": "n3miheq",
                  "author": "dontthink19",
                  "body": "Yeah, its pretty fitting for this phone though. It literally runs a regular operating system on the outside and a tablet version of the operating system on the inner screen simultaneously with almost seamless transition.",
                  "score": 0,
                  "created_utc": 1752757791.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3mpoz8",
          "author": "JWGhetto",
          "body": "They sell 1599 iPhones right now that only have one screen.",
          "score": 4,
          "created_utc": 1752760051.0,
          "replies": []
        },
        {
          "id": "n3m3nqw",
          "author": "buffalosabresnbills",
          "body": "> $2k? Nah.\n\n*Rumored.*",
          "score": 4,
          "created_utc": 1752752503.0,
          "replies": [
            {
              "id": "n3m58tb",
              "author": "KD--27",
              "body": "The $2k or the Nah?",
              "score": 10,
              "created_utc": 1752753130.0,
              "replies": [
                {
                  "id": "n3m7nzy",
                  "author": "buffalosabresnbills",
                  "body": "> The $2k or the Nah?\n\n*“Whatever makes sense”*",
                  "score": 3,
                  "created_utc": 1752754051.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3man1k",
          "author": "dida2010",
          "body": "Don't care about foldable.",
          "score": 3,
          "created_utc": 1752755135.0,
          "replies": [
            {
              "id": "n3mzte3",
              "author": "theemptyqueue",
              "body": "The technology for foldables hasn’t been fully developed yet and they’re still super fragile.  Samsung still has warnings on their foldable phones that you should avoid pressing on the screen with your fingernails.",
              "score": 0,
              "created_utc": 1752762998.0,
              "replies": [
                {
                  "id": "n3ne2f3",
                  "author": "Chodless",
                  "body": "i've never had a problem with mine in terms of durability, been dropped alot and been messed with constantly and nothing.",
                  "score": 2,
                  "created_utc": 1752766960.0,
                  "replies": []
                },
                {
                  "id": "n3n2l3u",
                  "author": "dida2010",
                  "body": "Thanks, one more reason, I am not interested on foldable",
                  "score": 1,
                  "created_utc": 1752763775.0,
                  "replies": []
                },
                {
                  "id": "n3n2w93",
                  "author": "InsaneNinja",
                  "body": "Death by coke pinkynail",
                  "score": 1,
                  "created_utc": 1752763862.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3mve64",
          "author": "stevenmeyerjr",
          "body": "I mean it’s two $1k phone strapped to each other.",
          "score": 2,
          "created_utc": 1752761742.0,
          "replies": []
        },
        {
          "id": "n3n2jls",
          "author": "KingSlimp",
          "body": "I got my folding screen razer recently for less than $500 new and I frickin love this phone. And of course apple doesn't innovate anymore. Everyone else is pushing this new tech forward and apple is just getting on board now that the kinks have been worked out. Not a bad business strategy to be fair, but it doesn't feel as exciting.",
          "score": 1,
          "created_utc": 1752763763.0,
          "replies": []
        },
        {
          "id": "n3nb2fd",
          "author": "BradlyL",
          "body": "I mean, in my mind if I can trade in my iPad and my current iPhone, for a decent trade in value, it isn’t that far out of line.",
          "score": 1,
          "created_utc": 1752766138.0,
          "replies": []
        },
        {
          "id": "n3nm1hx",
          "author": "3rdor4thburner",
          "body": "I have a fold5 and pay $50 a month for my phone. I don't know anyone who buys their phone in cash outright. ",
          "score": 1,
          "created_utc": 1752769185.0,
          "replies": []
        },
        {
          "id": "n3nojdt",
          "author": "ThePandaKingdom",
          "body": "Yep, that's about what the galaxy fold and pixel fold are going for. Cant fault them on the price point. 🤷‍♀️",
          "score": 1,
          "created_utc": 1752769882.0,
          "replies": []
        },
        {
          "id": "n3pc40y",
          "author": "MyOnlyAccount_6",
          "body": "As someone that uses my iphone multiple hours of every day for at least 3 years that would only be about $2/day for something that is my communication, entertainment, scheduling, web browser, AI interface, etc. That’s worth it to me. \n\nThough I’d never buy the first gen product of something like this even if Apple has worked on improving other’s designs.",
          "score": 1,
          "created_utc": 1752786618.0,
          "replies": []
        },
        {
          "id": "n3m5w35",
          "author": "IniNew",
          "body": "Everyone replying to you justifying the price. \n\nOk, just because it cost a lot to make doesn’t mean we have to buy it lol. $2k is a big nah for sure",
          "score": -7,
          "created_utc": 1752753377.0,
          "replies": [
            {
              "id": "n3m8o7v",
              "author": "Shadow647",
              "body": "Nobody says YOU have to buy it?",
              "score": 24,
              "created_utc": 1752754423.0,
              "replies": [
                {
                  "id": "n3mj26i",
                  "author": "IniNew",
                  "body": "Correct. \n\nSome one says, \"I won't pay $2k for a phone\"\n\nAnd multiple responses say, \"Um aktually the price is justified because X-Y-Z\"\n\nOK... neat. I'm still not paying that.",
                  "score": -8,
                  "created_utc": 1752757978.0,
                  "replies": [
                    {
                      "id": "n3n6v3a",
                      "author": "Jaerba",
                      "body": "> Some one says, \"I won't pay $2k for a phone\"\n\nBut why did they feel the need to say that?  Do you go around declaring all the things you won't pay for all day?",
                      "score": 6,
                      "created_utc": 1752764962.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3mnin4",
              "author": "Loves_octopus",
              "body": "Who said you have to buy it? People said the same thing about smart phones, cell phones, PCs, color TVs, black and white TVs, cars, radios etc etc. \n\nI get complaining about the price of say, the basic iPhone, but why complain about the price of a top of the line luxury item? Im not complaining about yacht or supercar prices either.",
              "score": 4,
              "created_utc": 1752759385.0,
              "replies": [
                {
                  "id": "n3mo76d",
                  "author": "IniNew",
                  "body": "> Who said you have to buy it?\n\nNo one. Welcome to the discussion! \n\nThe OP (not me): \"That's too expensive for me.\"\n\nThe other comments: \"Well it's justified.\"\n\nSo what's *actually* happening in this thread is people are trying to say that the price is justified. Which doesn't matter. Because $2k for a phone is absurd, regardless of the cost to build the thing.",
                  "score": -1,
                  "created_utc": 1752759594.0,
                  "replies": [
                    {
                      "id": "n3n48mu",
                      "author": "AgencyBasic3003",
                      "body": "It’s absurd to you. And this is fine. But nobody cares about your assessment of prices. 2k is totally reasonable for some people and downright impossible for others.",
                      "score": 4,
                      "created_utc": 1752764231.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3n379g",
              "author": "InsaneNinja",
              "body": "You can get the 16S or a used phone. \n\nIf somebody has disposable income from proper investing, there’s no better phone than the max right now. That’s a spot to fill.",
              "score": 1,
              "created_utc": 1752763946.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mbccv",
          "author": "thisischemistry",
          "body": "It folds *and* it tips? I can't wait to see what other actions it can take!",
          "score": -1,
          "created_utc": 1752755388.0,
          "replies": []
        },
        {
          "id": "n3mkzqw",
          "author": "Bruvvimir",
          "body": "I'll pay $2k for it, no problem. Just fix iOS and make it do something smart with it.",
          "score": 0,
          "created_utc": 1752758596.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3nqc9y",
      "author": "Ed-Sanz",
      "body": "If I do get it, I’ll wait till 2027 and see if they get rid of any kinks which will definitely be present",
      "score": 10,
      "created_utc": 1752770383.0,
      "replies": []
    },
    {
      "id": "n3q9sap",
      "author": "flatteringhippo",
      "body": "And that's made in China.  Think of how expensive this would be made in USA.",
      "score": 7,
      "created_utc": 1752797472.0,
      "replies": []
    },
    {
      "id": "n3m1ibe",
      "author": "Ziakel",
      "body": "Galaxy Fold 7 is $1900 and this is projected to be $2000. \n\nIf those are too much, then don’t buy it. No one is forcing you.",
      "score": 86,
      "created_utc": 1752751609.0,
      "replies": [
        {
          "id": "n3migp2",
          "author": "ToMorrowsEnd",
          "body": "But I need to WHIIIIINE that it's more than the $100 6 year old prepaid I got at walmart!",
          "score": 41,
          "created_utc": 1752757785.0,
          "replies": []
        },
        {
          "id": "n3onnox",
          "author": "sunjay140",
          "body": "Both are too much.",
          "score": 3,
          "created_utc": 1752779623.0,
          "replies": []
        },
        {
          "id": "n3mbcz8",
          "author": "manyeggplants",
          "body": "Okay, I won't, thanks for the permission.",
          "score": 7,
          "created_utc": 1752755394.0,
          "replies": [
            {
              "id": "n3mcbqn",
              "author": "Ziakel",
              "body": "You’re welcome.",
              "score": 4,
              "created_utc": 1752755734.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3oh4vq",
          "author": "DukeGrizzly",
          "body": "Exactly this.  \n\nApple charges $1200 for their Pro Max.  What exactly did people think their first folding phone would cost?  Obviously this article is taken with the biggest grains of salt one can find, but realistically Apple will charge around $2000 for it.  They are a business, with the sole purpose of turning a profit. \n\nThe same people moaning about the $2k price tag for folding phones, are the same people who willing purchased the X at $999, which set the precedent for ALL phones moving forward, to use that as a base price.",
          "score": 1,
          "created_utc": 1752777772.0,
          "replies": [
            {
              "id": "n3p00dr",
              "author": "fraseyboo",
              "body": "If you look at the prices with inflation then the Pro models have been steadily decreasing in price. There's a huge spread in prices of phones and Apple are pretty much absent from the upper end now.\n\nA foldable makes sense to give Apple a new upper limit, and consumers will happily pay for it.",
              "score": 2,
              "created_utc": 1752783186.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3m03hi",
      "author": "redbullnweed",
      "body": "Just wait for the \"first foldable\"",
      "score": 29,
      "created_utc": 1752751004.0,
      "replies": [
        {
          "id": "n3m454o",
          "author": "dylan_1992",
          "body": "No. \n\nMore like Apple’s largest ever display in a phone.\n\nOr Apple’s most compact tablet.",
          "score": 29,
          "created_utc": 1752752699.0,
          "replies": [
            {
              "id": "n3mp6hq",
              "author": "ROARfeo",
              "body": "\"Our best iPhone yet\"\n\n\nBruh it'd be pretty shit it it weren't ",
              "score": 11,
              "created_utc": 1752759896.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3nd7x7",
          "author": "_key",
          "body": "It’s apple. They won’t call it foldable but think of their own branding, like I dunno, iPhone Flex or iPhone Infinity or something no one else associates with foldable phones.",
          "score": 5,
          "created_utc": 1752766729.0,
          "replies": []
        },
        {
          "id": "n3nbxj8",
          "author": "toddinphx",
          "body": "We think you’re going to love it",
          "score": 3,
          "created_utc": 1752766374.0,
          "replies": []
        },
        {
          "id": "n3mff6a",
          "author": "masszt3r",
          "body": "Nah, they'll probably go with the good ol' most powerful iPhone yet.",
          "score": 2,
          "created_utc": 1752756783.0,
          "replies": []
        },
        {
          "id": "n3morr1",
          "author": "hydroxy",
          "body": "My current iPhone folds, but only once",
          "score": 2,
          "created_utc": 1752759770.0,
          "replies": []
        },
        {
          "id": "n3qre7a",
          "author": "akgis",
          "body": "They will call it some other BS ever then they will say the first whatever, Real apple Innovation.\n\nSince its not software or AI and this depends on the engendering/hardware teams they might do a good job.",
          "score": 1,
          "created_utc": 1752803787.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3ly8b3",
      "author": "XPLR_NXT",
      "body": "Is this… Innovation?",
      "score": 57,
      "created_utc": 1752750173.0,
      "replies": [
        {
          "id": "n3m1owi",
          "author": "itastesok",
          "body": "I dunno, is it? Apple hasn't even said anything about it.",
          "score": 46,
          "created_utc": 1752751687.0,
          "replies": []
        },
        {
          "id": "n3mk5aa",
          "author": "Taki_Minase",
          "body": "\"Innovation, for its part, can refer to something new or to a change made to an existing product, idea, or field. One might say that the first telephone was an invention, the first cellular telephone either an invention or an innovation, and the first smartphone an innovation.\"",
          "score": 3,
          "created_utc": 1752758327.0,
          "replies": []
        },
        {
          "id": "n3m33z9",
          "author": "Son_of_Liberty88",
          "body": "💁‍♂️ 🦋?",
          "score": 12,
          "created_utc": 1752752280.0,
          "replies": []
        },
        {
          "id": "n3mfoc3",
          "author": "MisterEinc",
          "body": "Apple hasn't innovate since the iPhone. Which to their credit is still probably the most disruptive thing from that era. But now a days they're more about coming a little bit late to the game with a perfected iteration rather than be the first to it.",
          "score": 9,
          "created_utc": 1752756867.0,
          "replies": [
            {
              "id": "n3qtbp7",
              "author": "Gniphe",
              "body": "AirPods and iPad were huge innovators.\n\nPeople laughed at how stupid AirPods looked and now I see them everywhere. And they’re actually super useful.\n\niPad even more so. Whatever the reason is, most people can’t name a tablet besides the iPad. School buy them by the truckload. Grandmas have moved from the laptop to the iPad. No other tablet comes close to touching it in popularity. I wouldn’t be surprised if it was Apple’s most dominant market.\n\nApple didn’t invent these products, but innovated them into products that work extremely well.",
              "score": 8,
              "created_utc": 1752804485.0,
              "replies": [
                {
                  "id": "n3wiygv",
                  "author": "Sierra-117-",
                  "body": "I was an early adopter of AirPods, and remember that people were amazed by then. All my friends and classmates would ask to try them and were blown away. Sure, some thought they were goofy. But they changed their mind the second they tried them. I think I ended up inadvertently convincing like 3 people to buy a pair.",
                  "score": 1,
                  "created_utc": 1752879825.0,
                  "replies": [
                    {
                      "id": "n3yhpue",
                      "author": "lordreed",
                      "body": "Forgive my ignorance but what is amazing about them? I genuinely would like to know.",
                      "score": 2,
                      "created_utc": 1752909713.0,
                      "replies": [
                        {
                          "id": "n3yv152",
                          "author": "Sierra-117-",
                          "body": "Extremely lightweight, the noise passthrough, really easy to carry in your pocket, active noise cancelling if you have the pros, seamless connection (literally just take one out of the case and it’s already connected and playing), the ability to just have just one earbud in, decent sound for the size, music and volume control on the earbud itself, comfortable. \n\nBut the reason people were so amazed when they first launched is because it was most people’s first introduction to a wireless earbud. So to have something that small play music in your ear was insane. It felt truly innovative and new.\n\nThere’s decent competitors out there now, but AirPods are still consistently voted the favorite.",
                          "score": 1,
                          "created_utc": 1752917275.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3n3znn",
              "author": "None",
              "body": "[deleted]",
              "score": -4,
              "created_utc": 1752764163.0,
              "replies": [
                {
                  "id": "n3qbqog",
                  "author": "rkoy1234",
                  "body": "it's a common sentiment repeated at least a thousand times on reddit for the past decade",
                  "score": 1,
                  "created_utc": 1752798164.0,
                  "replies": []
                },
                {
                  "id": "n3n8k4r",
                  "author": "MisterEinc",
                  "body": "Nah, never got into podcasts in general. It's like talk radio to me, not my thing. Just my observation as a research and technologist and having worked with the AVP recently.",
                  "score": 1,
                  "created_utc": 1752765436.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3nd38x",
          "author": "FujiClimber2017",
          "body": "Is this just Fantasea?",
          "score": 2,
          "created_utc": 1752766693.0,
          "replies": []
        },
        {
          "id": "n3mcvvd",
          "author": "The-Oppressed",
          "body": "If they solve the crease in the middle issue then it definitely will be. No one else has been able to.",
          "score": 7,
          "created_utc": 1752755926.0,
          "replies": [
            {
              "id": "n3mj8jp",
              "author": "fathertime979",
              "body": "Because it's not an issue. In practicality when using it at least. Not really noticable unless looked at from odd angles no one uses their devices in. \n\nMaterial sciences wise it would be neat but let's face it apple is optimizers not innovators. And its been that way for years.",
              "score": 14,
              "created_utc": 1752758035.0,
              "replies": [
                {
                  "id": "n3mpm4v",
                  "author": "NuttFellas",
                  "body": "Can confirm, I have the pixel fold and I never notice the crease.\n\nAlways funny watching people hold it flat up to the sun to try and find it.",
                  "score": 6,
                  "created_utc": 1752760028.0,
                  "replies": []
                },
                {
                  "id": "n3mqf1c",
                  "author": "lasquiggle",
                  "body": "Agree. Have the Mate Xt.",
                  "score": 2,
                  "created_utc": 1752760270.0,
                  "replies": []
                },
                {
                  "id": "n3nl0fa",
                  "author": "AreYouOKAni",
                  "body": "It is an issue, just not for you, or the ridiculously small percent of people who own foldables. Everyone else cares enough not to buy them.",
                  "score": -2,
                  "created_utc": 1752768898.0,
                  "replies": [
                    {
                      "id": "n3qc2ju",
                      "author": "rkoy1234",
                      "body": "how's it an issue if you can't see it while using it?\n\nor are you saying that you can see it in normal usage angles?",
                      "score": 1,
                      "created_utc": 1752798281.0,
                      "replies": [
                        {
                          "id": "n3qd5p4",
                          "author": "AreYouOKAni",
                          "body": "I could see it on Fold 5, and I highly doubt anything changed since. Admittedly, I couldn't see it on a fully white screen or while watching videos, but on pureblack AMOLED-friendly apps I can definitely see it.",
                          "score": 1,
                          "created_utc": 1752798670.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3qkx5t",
                      "author": "fathertime979",
                      "body": "Bruh I don't even own one. Because I'm poor. But of the ones I've played with it's just not true. \n\nThere's plenty of other reasons to NOT buy one. I'm just saying the crease isn't really a worthy one to gripe over 😂",
                      "score": 1,
                      "created_utc": 1752801426.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3o9s4t",
              "author": "coltonbyu",
              "body": "nobody has fully removed it, but compare a galaxy fold to a oneplus fold and the oneplus has like 1/4 the crease of the galaxy. fully unnoticeable when in use",
              "score": 1,
              "created_utc": 1752775665.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3n7l50",
          "author": "No_Reaction8611",
          "body": "Whats a computer?",
          "score": 2,
          "created_utc": 1752765164.0,
          "replies": [
            {
              "id": "n3nbum6",
              "author": "XPLR_NXT",
              "body": "Everything’s computer!",
              "score": 1,
              "created_utc": 1752766351.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3lznr7",
          "author": "psilent",
          "body": "Apple never did innovation, they did stealing and optimizing\n\nEdit: yall chill I never said that was a bad thing.",
          "score": -23,
          "created_utc": 1752750811.0,
          "replies": [
            {
              "id": "n3m1xyr",
              "author": "itsjudemydude_",
              "body": "I mean... they *did* do innovation. Once upon a time lmao",
              "score": 25,
              "created_utc": 1752751792.0,
              "replies": [
                {
                  "id": "n3m4szf",
                  "author": "RiftHunter4",
                  "body": "It's been 20 years.",
                  "score": -1,
                  "created_utc": 1752752962.0,
                  "replies": [
                    {
                      "id": "n3mlybm",
                      "author": "itsjudemydude_",
                      "body": "Just about, yeah.",
                      "score": 1,
                      "created_utc": 1752758896.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3mg4dr",
              "author": "TrippySubie",
              "body": "Isnt that how life works? How do you think we got here with vehicle safety technology, or literally anything in life. Yall always upset about apple lol",
              "score": 2,
              "created_utc": 1752757012.0,
              "replies": []
            },
            {
              "id": "n3m13jm",
              "author": "Spidaaman",
              "body": "What a horrible take lol\n\n‘84 Mac, 1st Gen iPhone, iPod/iTunes, Apple Watch, M1 chip, iPad, App store \n\nJust to name the big ones.",
              "score": 13,
              "created_utc": 1752751436.0,
              "replies": [
                {
                  "id": "n3m1sh5",
                  "author": "Nicinus",
                  "body": "But surely you realize most of these are improvement of existing  product categories? I love Apple and I always look forward to them entering the market but I don’t think they’ve ever “invented” something? The iPod was for example a huge improvement over the Sony Walkman but we already had wearable music.",
                  "score": -4,
                  "created_utc": 1752751728.0,
                  "replies": [
                    {
                      "id": "n3m2nc9",
                      "author": "pxr555",
                      "body": "Innovating isn't the same as inventing. You an invent something that is hardly used or bought by anyone then, but to truly innovate you need to create some real impact, like in being able to sell millions of it. Two very different things.",
                      "score": 14,
                      "created_utc": 1752752088.0,
                      "replies": []
                    },
                    {
                      "id": "n3m2ggs",
                      "author": "vibratokin",
                      "body": "I don’t think they’re claiming they invented, but they did innovate",
                      "score": 13,
                      "created_utc": 1752752008.0,
                      "replies": [
                        {
                          "id": "n3m2shl",
                          "author": "Nicinus",
                          "body": "Exactly, important distinction",
                          "score": -8,
                          "created_utc": 1752752147.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3m2u9n",
                      "author": "obrapop",
                      "body": "Honestly don’t know how you manage to get dressed in the morning",
                      "score": 6,
                      "created_utc": 1752752168.0,
                      "replies": [
                        {
                          "id": "n3m840g",
                          "author": "Nicinus",
                          "body": "It’s actually easy, I just invent a new combination of clothing.  :)",
                          "score": -1,
                          "created_utc": 1752754216.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3m2f88",
                      "author": "Bristmo",
                      "body": "This is one of the dumbest things I’ve read this morning",
                      "score": 9,
                      "created_utc": 1752751994.0,
                      "replies": []
                    },
                    {
                      "id": "n3m3bnl",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 4,
                      "created_utc": 1752752368.0,
                      "replies": [
                        {
                          "id": "n3m3qjl",
                          "author": "Nicinus",
                          "body": "Well they sure didn’t invent airplanes.",
                          "score": -8,
                          "created_utc": 1752752535.0,
                          "replies": [
                            {
                              "id": "n3m52l5",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1752753065.0,
                              "replies": [
                                {
                                  "id": "n3m7gdj",
                                  "author": "Nicinus",
                                  "body": "But what was the invention? There is no doubt that there was tremendous innovation behind the combination of all these technologies and they certainly created a new product, but the Ericsson P800 already had full screen interface and the multi touch interface came from earlier work but was popularized by the iPhone. Look, I’m not in any way diminishing Apple and their contribution but from a business perspective it is perhaps important to distinguish inventors from companies that builds better mousetraps, both have an important role. Without companies like Apple many of these important steps would not happen.",
                                  "score": -2,
                                  "created_utc": 1752753971.0,
                                  "replies": [
                                    {
                                      "id": "n3m7nwv",
                                      "author": "Nicinus",
                                      "body": "Or I should say become useful in mainstream products.",
                                      "score": 1,
                                      "created_utc": 1752754050.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n3m4n4d",
                      "author": "Fake_Unicron",
                      "body": "Hilarious you’d compare it to the Walkman and not the creative labs nomad",
                      "score": 2,
                      "created_utc": 1752752898.0,
                      "replies": [
                        {
                          "id": "n3m7xli",
                          "author": "Nicinus",
                          "body": "My apologies, wasn’t even aware of it, but that it is an interesting example of how companies like Apple can innovate by using lesser successful concepts and making them available in commercially more viable products.",
                          "score": 1,
                          "created_utc": 1752754151.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3mckj1",
                      "author": "The-Oppressed",
                      "body": "I mean with that goal post you can say nothing in the world is an invention because it all just originated from a caveman’s fire.",
                      "score": 1,
                      "created_utc": 1752755818.0,
                      "replies": []
                    },
                    {
                      "id": "n3nh4es",
                      "author": "j_cruise",
                      "body": "So what's a company you think that DID invent something? Because according to your criteria it's hard to call anything an invention",
                      "score": 1,
                      "created_utc": 1752767813.0,
                      "replies": [
                        {
                          "id": "n3nmaiu",
                          "author": "Nicinus",
                          "body": "I’m just saying that many or most of Apples products are clever refinements or combinations of existing technology, and sophisticated packaging of sorts whereas an invention would be to create something completely new. The iPhone for example is a superior product compared to what was before, especially in terms of software, but there were some products like the Ericsson P800 that was similar. And if you shrink an iPhone and wrap it on your wrist, is that an invention or innovation? I agree that it becomes fuzzy. \n\nI’m probably nitpicking but I kind of look at it from a business strategy perspective, and innovative companies tend to have sizable R&D where companies that focus inventions have fellowships and collaborate with universities, etc.",
                          "score": 0,
                          "created_utc": 1752769255.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3m48am",
                      "author": "johnyeros",
                      "body": "Most of android phone ie improvement of existing iPhones. Now GTFO lol 😂",
                      "score": 0,
                      "created_utc": 1752752735.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3m2cm9",
                  "author": "CptUnderpants-",
                  "body": ">1st Gen iPhone\n\nTwo capacitive touch phones predate iPhone.\n\n>Apple Watch\n\nMany smart watches pre-dated Apple watch including Android based watches from Motorola, LG, HTC, Samsung, and Asus.\n\nThe others are good examples though.",
                  "score": 1,
                  "created_utc": 1752751963.0,
                  "replies": [
                    {
                      "id": "n3m3ico",
                      "author": "buffalosabresnbills",
                      "body": "> Two capacitive touch phones predate iPhone.\n\nOnly the LG Prada, afaik. The OS did not support gestures, and was not designed around multi-touch. The iPhone also introduced “visual voicemail” and Safari Mobile; the first useable mobile web browser.",
                      "score": 6,
                      "created_utc": 1752752443.0,
                      "replies": [
                        {
                          "id": "n3m44t8",
                          "author": "CptUnderpants-",
                          "body": "There was also a Nokia.\n\nPinch to zoom and multitouch interface pre-dates the iPhone by many years, original concepts first shown in 1983.",
                          "score": 0,
                          "created_utc": 1752752696.0,
                          "replies": [
                            {
                              "id": "n3m7d1w",
                              "author": "buffalosabresnbills",
                              "body": "> There was also a Nokia.\n\nNokia was still using resistive-touch displays when the iPhone was released. \n\n>Pinch to zoom and multitouch interface pre-dates the iPhone by many years, original concepts first shown in 1983.\n\n Apple invested in R&D, and found a way to integrate such a concept into a useable mobile OS/hardware before anyone else.",
                              "score": 5,
                              "created_utc": 1752753936.0,
                              "replies": [
                                {
                                  "id": "n3qapux",
                                  "author": "CptUnderpants-",
                                  "body": "The argument made which started this discussion was:\n\n\"Apple never did innovation, they did stealing and optimizing\"\n\nOther comments suggested that Apple invented the concepts of capacitive touch in a small device and multi-touch when neither was correct.\n\nI'd suggest that they took existing concepts and made a great product by borrowing from other existing ideas.\n\nThe implication that the iPhone was revolutionary rather than evolutionary is incorrect.\n\nAlso remember that it didn't launch with the app store. (or copy/paste for that matter)\n\nThe biggest innovation in my view was the integration of a nearly-fully-functional browser. The keynote around it IIRC was that with so many WiFi hot spots requiring a full web browser to authenticate, why not put a full web browser in the phone to allow it?\n\nAs an aside to that, the first 'apps' on iPhone were actually web apps using safari wrapped in a skin.",
                                  "score": -1,
                                  "created_utc": 1752797800.0,
                                  "replies": [
                                    {
                                      "id": "n3qbctb",
                                      "author": "buffalosabresnbills",
                                      "body": "> Other comments suggested that Apple invented the concepts of capacitive touch in a small device and multi-touch when neither was correct.\n\nNone of the comments in this thread chain made such claim. \n\nI’ll take that as a no, Nokia didn’t make a capacitive-touch phone before the iPhone’s release.\n\n—-\n\n\nEdit: lol, they blocked me.\n\n> For over nearly three decades I've kept forgetting that I should never bother arguing with Apple fanboys.\n\nYou were wrong. Own it.",
                                      "score": 2,
                                      "created_utc": 1752798027.0,
                                      "replies": [
                                        {
                                          "id": "n3ri3fg",
                                          "author": "CptUnderpants-",
                                          "body": "For over nearly three decades I've kept forgetting that I should never bother arguing with Apple fanboys.",
                                          "score": 1,
                                          "created_utc": 1752814629.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n3m2wxb",
                      "author": "jjmmll",
                      "body": "The first gen iPhone did not take anything from the previous capacitive touch phones on the market before it.",
                      "score": -1,
                      "created_utc": 1752752198.0,
                      "replies": [
                        {
                          "id": "n3m3kfh",
                          "author": "CptUnderpants-",
                          "body": "Except capacitive touch screens and pinch to zoom.",
                          "score": 1,
                          "created_utc": 1752752466.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3m3g74",
                  "author": "bizarro_kvothe",
                  "body": "AirPods is another good example\n\nEDIT: more words",
                  "score": -1,
                  "created_utc": 1752752419.0,
                  "replies": [
                    {
                      "id": "n3m562u",
                      "author": "jakreth",
                      "body": "what?",
                      "score": -1,
                      "created_utc": 1752753102.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3lzy7g",
              "author": "germane_switch",
              "body": "Bullshit",
              "score": -10,
              "created_utc": 1752750940.0,
              "replies": [
                {
                  "id": "n3m0iju",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 11,
                  "created_utc": 1752751186.0,
                  "replies": [
                    {
                      "id": "n3m1qyn",
                      "author": "A_Typicalperson",
                      "body": "Made something better is innovation",
                      "score": 4,
                      "created_utc": 1752751711.0,
                      "replies": []
                    },
                    {
                      "id": "n3m1ao7",
                      "author": "Nicinus",
                      "body": "Building a better mousetrap is the strategy of most super successful companies.",
                      "score": 1,
                      "created_utc": 1752751520.0,
                      "replies": []
                    },
                    {
                      "id": "n3m2dce",
                      "author": "muad_did",
                      "body": ">They took existing concepts, polished them and made them more accessible\n\nI had a Blackberry; a computer-savvy cousin always had the latest Sony with a keyboard and advanced OS. So I remember that time well, when many of us used those handheld devices for work (I used it to write anywhere), and suddenly... the iPhone appeared. It wasn't innovative, of course, but... it worked like magic, the fluidity, the icon opening time... then you picked up a Blackberry or a Sony and yes, you had more software freedom and could do more \"complex\" things, but in terms of use, it was completely different; it was like going from a push-button phone to a rotary phone...\n\nAnd look, I've never had a personal iPhone; I prefer Android, but you have to admit that iPhone was a total kick in the butt to the market and the \"it has to be easy to use\" factor.",
                      "score": 1,
                      "created_utc": 1752751971.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3m5v8z",
              "author": "mr_miggs",
              "body": "lol you can’t be serious with this.  Apple may not have directly invented new technology, but there are some major products that they made into something massively popular.\n\nJust take the original iPhone.  There were smartphones before then, and even capacitive touchscreen ones.  But no one really remembers them. That’s because Apple innovated with improving the touchscreen (multi finger gestures and scrolling were huge), had an intuitive UI and a music-focused ecosystem with iTunes.   They took existing technology and made a packaged product that did most everything better than whatever else was on the market.  It took years for others to catch up.  The only other real competition at the time was blackberry because of the security, messaging, and physical keyboard.",
              "score": 0,
              "created_utc": 1752753368.0,
              "replies": []
            },
            {
              "id": "n3m2rs4",
              "author": "obrapop",
              "body": "Hahah this is the comment of someone who genuinely knows about the subject",
              "score": -2,
              "created_utc": 1752752139.0,
              "replies": []
            },
            {
              "id": "n3m20w4",
              "author": "yeseecanada",
              "body": "Lmao yes because the iPhone was a rip off of the real first smart phone.",
              "score": -5,
              "created_utc": 1752751826.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mo560",
          "author": "muchosalame",
          "body": "Yeah, haven't you heard? Apple just invented a FOLDABLE iPHONE! This is the first foldable iPhone in history, a never-seen groundbreaking innovation that Apple came on totally on their own.",
          "score": -2,
          "created_utc": 1752759577.0,
          "replies": []
        },
        {
          "id": "n3mlzg2",
          "author": "Nobanob",
          "body": "Obviously, apple is about to design and release the world's very first fold touch screen phone. Just like every other android feature added to iPhone years after it came out. \n\nI worked cellular during the QWERTY keyboards- iPhone 6 time. Apple 100% knocked it out of the park. By the time the galaxy S3 came out iPhone has been trailing in the innovation department.",
          "score": -2,
          "created_utc": 1752758905.0,
          "replies": []
        },
        {
          "id": "n3m4d69",
          "author": "Away_Media",
          "body": "Exactly.  Getting in just in time for it to not matter.",
          "score": -9,
          "created_utc": 1752752788.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3tlfqk",
      "author": "Satoshi-Nakamoto1",
      "body": "we've seen flying iPhones, this ain't new bs.",
      "score": 3,
      "created_utc": 1752848603.0,
      "replies": []
    },
    {
      "id": "n3md2wv",
      "author": "CoastingUphill",
      "body": "I’d rather it be flip instead of a fold. \n\nHamburger > hotdog",
      "score": 11,
      "created_utc": 1752755994.0,
      "replies": [
        {
          "id": "n3pa17b",
          "author": "xmichann",
          "body": "This right here, give me my ihamburger",
          "score": 2,
          "created_utc": 1752786012.0,
          "replies": []
        },
        {
          "id": "n3mf3hz",
          "author": "PurringWolverine",
          "body": "Completely agree. My wife has a Flip, and I really like the size of that in my pocket compared to my iPhone.",
          "score": 3,
          "created_utc": 1752756674.0,
          "replies": [
            {
              "id": "n3onj15",
              "author": "ChaosNomad",
              "body": "There’s a reason I’m still rocking a 13 mini. Having pocket space is such a nice luxury.",
              "score": 1,
              "created_utc": 1752779585.0,
              "replies": [
                {
                  "id": "n3q372v",
                  "author": "PurringWolverine",
                  "body": "Yeah, I’m using a 15 Pro now, and plan to use it for a solid 3 more years, but I’m thinking my next one will be a flip of some sort. They’re just too big in the pocket.",
                  "score": 1,
                  "created_utc": 1752795200.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3lz3fk",
      "author": "diacewrb",
      "body": ">Apple initially considered pricing the device between $2,000 and $2,400. However, the company has since implemented aggressive cost-cutting measures that could bring the price down slightly to between $1,800 and $2,000.\n\nConsidering how much they charged for a set of wheels for the mac pro, I have my doubts if that will charge $2,000 or less for their first foldable iphone.",
      "score": 12,
      "created_utc": 1752750559.0,
      "replies": [
        {
          "id": "n3m3zf4",
          "author": "FormABruteSquad",
          "body": "Wheels were the first thing they cut from the iFold.",
          "score": 13,
          "created_utc": 1752752635.0,
          "replies": [
            {
              "id": "n3m8ucx",
              "author": "BootyMcStuffins",
              "body": "Dammit, how am I supposed to get to work on a phone without wheels?",
              "score": 1,
              "created_utc": 1752754485.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n4iab8w",
          "author": "SilverCarbon",
          "body": "I also have my doubts. Why would they even do an attempt at cost-cutting towards the consumer on a new format? There's definitely a larger audience for these kind of devices than the Vision Pro, they'll want to shell out a price with a clear premium compared to the Pro Max. \n\nI imagine something more to $2200 (and then trade in values). Almost the price of 2 Pro Maxes as justification.",
          "score": 1,
          "created_utc": 1753184138.0,
          "replies": []
        },
        {
          "id": "n3m3c0y",
          "author": "Edward_TH",
          "body": "They'll do what they always do: launch it \"starting from 1999$\", but the base price is for a model with garbage specs, no accessories and maybe even requiring a packeted service to even be purchaseable like a 12 months iCloud subscription or a top tier apple care insurance. The first price for the model they actually intend people to flat out buy will instead be something like 2400-2500, 4000 if financed.\n\n\n[EDIT] it's funny how people feel the need to somehow defend apple from my wild hypothesis of them employing the marketing strategy they always use and even pride themselves with at investors meetings.\n\n\nDon't worry guys, this time for sure apple will offer the cheapest option with specs that the majority of people actually are going to purchase. For sure!",
          "score": -9,
          "created_utc": 1752752372.0,
          "replies": [
            {
              "id": "n3m5fc7",
              "author": "NotRonaldKoeman",
              "body": "this is such a weird take, literally what iPhone can you buy today requires any of that? the base iPhone X years ago had great specs, literally only difference was storage; same goes for really any of the flagship models. None of them required any subscriptions. They’ve never cheaped out on their top of the line models, which the Fold will be.",
              "score": 14,
              "created_utc": 1752753199.0,
              "replies": [
                {
                  "id": "n3m6cg4",
                  "author": "Edward_TH",
                  "body": "It's not that weird, it's a marketing strategy well consolidated from apple: selling a product with increasing tiers of prices and specs and offering the cheapest one with ALMOST the specs most of their costumers look for, but not quite, too guide them towards more expensive and profitable options. It's called price ladder.",
                  "score": -7,
                  "created_utc": 1752753552.0,
                  "replies": [
                    {
                      "id": "n3m97v9",
                      "author": "BootyMcStuffins",
                      "body": "Way to move the goal posts.\n\nYour first comment said it would require subscriptions. When has Apple ever done that?",
                      "score": 4,
                      "created_utc": 1752754624.0,
                      "replies": [
                        {
                          "id": "n3m9ny7",
                          "author": "Edward_TH",
                          "body": "What goalposts? I said maybe, it was a random thing chosen from services Apple offers to better explain the thought process.",
                          "score": -2,
                          "created_utc": 1752754785.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3m7out",
                      "author": "NotRonaldKoeman",
                      "body": "i understand what a tier is my point is on Apple’s flagship phones (pro models, upcoming fold) the only thing you could upgrade was the storage. thats it, thats literally what every other manufacturer in the history of electronics has done. You couldn’t upgrade the processor, the RAM (yeah you could choose the non-flagship models), the screen etc. So the argument that Apples going to release a fold and force it to need upgrades pushing it to $2400+ has no basis in history. I personally have purchased the X, the 12, and the 14 Pro, all base models, and got 99.9% of the functionality of the highest end phone they sold. Edit to add: nor did I need to purchase any subscriptions at all to make the phone usable.",
                      "score": 1,
                      "created_utc": 1752754060.0,
                      "replies": [
                        {
                          "id": "n3mbvmy",
                          "author": "Edward_TH",
                          "body": "Dude. The \"Pro\" IS a step in the ladder. The last one. Apple literally has a single phone product, the iPhone, and never had anything else. Most other manufacturers have different products that each have their own options but are not comparable one to the others.\n\nApple has no \"flagship phone\" (as of now) because their ONLY phone is already in the flagship category. The price ladder works because you CAN'T upgrade specs after the purchase, so they always have the lowest tier specced just below what most people look for to guide them a step up towards more profitable configurations. Why do you think the best selling iPhone configuration is almost never the base one but the step after that?\n\nMost companies use this strategy in some way, apple is just the company that use *only* that because they offer much much less products (a single phone, a couple of tablets, a couple of laptops, a couple of desktops etc...).",
                          "score": 1,
                          "created_utc": 1752755577.0,
                          "replies": [
                            {
                              "id": "n3mdixx",
                              "author": "NotRonaldKoeman",
                              "body": "what you’re failing to realize is that if/when apple releases the fold it wont be marketed, priced, spec’d like their base non-pro models, it will be pro-model adjacent. Sure you will be able to upgrade the storage, but itll most likely just be the pro but with folding features (processor, RAM). Your original thesis which your now stepping away from is that the base fold will be ~$2,000 and you’ll be forced to upgrading it to be usable (like upgrading from base iPhone to the Pro). But history tells us that this is already a Pro-model, with most likely the Pro-chip, RAM, display technology.. so the argument kinda falls flat",
                              "score": 1,
                              "created_utc": 1752756146.0,
                              "replies": [
                                {
                                  "id": "n3mf85m",
                                  "author": "Edward_TH",
                                  "body": "Are you living in an alternate reality? Apple never offered an upgradeable phone. Like, never since the OG iPhone came out. They're actually a company with a rich history of resisting even against repairs up until they had been forced to accept them...\n\nI'm not saying apple products are shit, I've said it before that they're flagship. But you guys should stop drinking corporate kool-aid and try to show how wrong I am about their pricing strategy... *that they literally explain themselves during investors meetings*.",
                                  "score": 1,
                                  "created_utc": 1752756717.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3mdxkc",
              "author": "Spanky2k",
              "body": "But they've never done anything like that? Where have you got that idea from?",
              "score": 3,
              "created_utc": 1752756285.0,
              "replies": [
                {
                  "id": "n3mlwry",
                  "author": "green_link",
                  "body": "They literally do the cheap unuseable hardware specs all the damn time. Fuck for the longest time they kept the 8gb storage option in phones in a world where literally everyone else moved on to 32 or 64 GB default/starting storage options. Fuck their laptops had 8gb of RAM for the longest time with 128gb or storage. For the cheap starting at price of $1000. To do any real work on any of them you had to buy the more expensive models because you literally can't upgrade the storage or RAM in a MacBook",
                  "score": 2,
                  "created_utc": 1752758883.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3mnpws",
      "author": "CantonJester",
      "body": "When I dream of an Apple flip phone, I envision something that cuts the dimensions in half. I don’t want to transform my iPhone into a freakin iPad. I have an iPad.",
      "score": 6,
      "created_utc": 1752759447.0,
      "replies": [
        {
          "id": "n3n4g8r",
          "author": "InsaneNinja",
          "body": "The Samsung fold 7 looks like an Ultra until you peel it open and it doubles in size. That would be fairly convenient.",
          "score": 2,
          "created_utc": 1752764289.0,
          "replies": [
            {
              "id": "n3n9qq7",
              "author": "CantonJester",
              "body": "Not to me. Like I said, I’ve got an iPad. My iPad is morphing into my laptop’s time, actually. Maybe they’ll release a phone that mimics an iPad, but hopefully they also release one that is similar to the Samsung Flip / Motorola Razr series.",
              "score": 1,
              "created_utc": 1752765769.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3ona3j",
          "author": "ChaosNomad",
          "body": "For someone who values pocket space, something like a flip would be a huge incentive for me to upgrade from my 13 mini.",
          "score": 2,
          "created_utc": 1752779514.0,
          "replies": []
        },
        {
          "id": "n3rugn3",
          "author": "TrailsGuy",
          "body": "Yep. And what use is the square format, really? Doesn’t help with movies. Makes it harder to type. Only real benefit is split screen and I’d argue that doesn’t get used very frequently in practice for most people.",
          "score": 1,
          "created_utc": 1752820896.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3pg0wi",
      "author": "nn666",
      "body": "Fold phones are lame. Look at the Samsung and others. The screen doesn’t last.",
      "score": 3,
      "created_utc": 1752787785.0,
      "replies": [
        {
          "id": "n3pkjwz",
          "author": "ratudio",
          "body": "hence never get 1st gen by apple unless you get new phone every year and money to burn",
          "score": 3,
          "created_utc": 1752789138.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mkdn3",
      "author": "harbinger411",
      "body": "That’s a lot of money to just talk trash to your fam on instagram and watch porn.",
      "score": 3,
      "created_utc": 1752758400.0,
      "replies": []
    },
    {
      "id": "n3m2tuq",
      "author": "NotSuspicious215",
      "body": "I’m surprised they’re doing a foldable before a flip, won’t this cut into iPad sales?",
      "score": 4,
      "created_utc": 1752752163.0,
      "replies": [
        {
          "id": "n3nfomk",
          "author": "m0rogfar",
          "body": "At $1999, it’s a higher selling price than an iPhone and an iPad Mini. Assuming margins are similar (and I don’t see why they wouldn’t be), Apple is realistically happy to cannibalize the iPad Mini.",
          "score": 2,
          "created_utc": 1752767407.0,
          "replies": []
        },
        {
          "id": "n3mcre5",
          "author": "Lietenantdan",
          "body": "I don’t think so. Buying a normal iPhone and an iPad will be cheaper than an iPhone fold, plus an iPad will have a larger screen.",
          "score": 1,
          "created_utc": 1752755884.0,
          "replies": []
        },
        {
          "id": "n3o6kho",
          "author": "ticuxdvc",
          "body": "Unless the phone supports Apple Pencil, which I doubt it would, iPad still has its unique use.",
          "score": 1,
          "created_utc": 1752774762.0,
          "replies": []
        },
        {
          "id": "n3mb27i",
          "author": "BootyMcStuffins",
          "body": "I tried to use a flip. It’s horrible. It’s basically just a normal phone with an extra step to unlock. The novelty fades really fast. I get why they’re popular with women who have small pockets though\n\nA fold is like having a tablet in your pocket, which is actually useful",
          "score": -1,
          "created_utc": 1752755287.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3lyytc",
      "author": "Grand-wazoo",
      "body": "Ah yes, the thing no one asked for at a price no one wants to pay.",
      "score": 17,
      "created_utc": 1752750502.0,
      "replies": [
        {
          "id": "n3m3zj1",
          "author": "seanzy260",
          "body": "Local man claims to represent the buying opinion of everyone",
          "score": 156,
          "created_utc": 1752752636.0,
          "replies": [
            {
              "id": "n3m9kli",
              "author": "Ace2Face",
              "body": "Local man mocking opinion of local man despite agreeing with them",
              "score": -42,
              "created_utc": 1752754751.0,
              "replies": [
                {
                  "id": "n3mdl0p",
                  "author": "seanzy260",
                  "body": "I’m mocking the idea that no one want or will buy this. I can see the appeal of an iphone that can turn into a iPad mini, without wanting it myself.",
                  "score": 24,
                  "created_utc": 1752756166.0,
                  "replies": [
                    {
                      "id": "n3mdvbc",
                      "author": "Ace2Face",
                      "body": "The upvotes say otherwise. Now, proclaim that I am the superior intellect and you were wrong, and let's finish this argument.",
                      "score": -31,
                      "created_utc": 1752756263.0,
                      "replies": [
                        {
                          "id": "n3mhn6y",
                          "author": "seanzy260",
                          "body": "*falls to knees crying* NOOOOOO!!!",
                          "score": 17,
                          "created_utc": 1752757516.0,
                          "replies": [
                            {
                              "id": "n3n5fb1",
                              "author": "InsaneNinja",
                              "body": "This is a no-LARPing zone.",
                              "score": 2,
                              "created_utc": 1752764558.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n3mhnur",
                          "author": "nolan4509",
                          "body": "I like the idea of an iPhone that can turn into an iPad Mini. I’m very interested in this, but that price is rough, though 100% what I was expecting.",
                          "score": 6,
                          "created_utc": 1752757522.0,
                          "replies": [
                            {
                              "id": "n3n6bvi",
                              "author": "akyankee",
                              "body": "This is the iPhone I have been waiting to upgrade from my 12 pro max. I'm excited about this and will get it if it's true.",
                              "score": 4,
                              "created_utc": 1752764812.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n3nb1j8",
                          "author": "gadgetluva",
                          "body": "You’ve been getting downvoted like hell so maybe you should lay your mouth on u/seanzy260’s balls",
                          "score": 3,
                          "created_utc": 1752766131.0,
                          "replies": [
                            {
                              "id": "n3nfb5k",
                              "author": "seanzy260",
                              "body": "AYO No diddy !",
                              "score": 3,
                              "created_utc": 1752767303.0,
                              "replies": []
                            },
                            {
                              "id": "n3nct5z",
                              "author": "Ace2Face",
                              "body": "Absolutely not. I do not concern myself with the opinions of mere Tier 1 redditors.",
                              "score": -6,
                              "created_utc": 1752766616.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3m69re",
          "author": "xanas263",
          "body": ">at a price no one wants to pay.\n\nThere have been a bunch of people already paying these prices for years to Samsung. To say that there isn't a market for them is naive.",
          "score": 32,
          "created_utc": 1752753523.0,
          "replies": []
        },
        {
          "id": "n3m63xo",
          "author": "MelodiesOfLife6",
          "body": "‘I didn’t want this, thus nobody did’\n\nOk bud",
          "score": 20,
          "created_utc": 1752753461.0,
          "replies": []
        },
        {
          "id": "n3m2mv1",
          "author": "NeverLookBothWays",
          "body": "Wait until you see the foldable watch",
          "score": 5,
          "created_utc": 1752752082.0,
          "replies": [
            {
              "id": "n3mmp1l",
              "author": "LegacyofaMarshall",
              "body": "[Say no more](https://www.cnet.com/tech/mobile/motorolas-bendable-phone-display-concept-can-wrap-around-your-wrist/)",
              "score": 3,
              "created_utc": 1752759129.0,
              "replies": [
                {
                  "id": "n3nqodh",
                  "author": "981032061",
                  "body": "I really miss the Wild West era of smartwatches. Now they’re all just Fitbit, Apple, or Garmin lookalikes.",
                  "score": 1,
                  "created_utc": 1752770475.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3lzsbj",
          "author": "TheGreatSoup",
          "body": "I asked. I been looking at foldable phones but I don’t switch because they are android.",
          "score": 47,
          "created_utc": 1752750867.0,
          "replies": [
            {
              "id": "n3m03m2",
              "author": "Grand-wazoo",
              "body": "So what's the appeal / use case for you? I genuinely see almost nothing but hate for these designs and I'm curious why it's desirable.",
              "score": 4,
              "created_utc": 1752751005.0,
              "replies": [
                {
                  "id": "n3m0gw5",
                  "author": "Discarded_Twix_Bar",
                  "body": "I fly semi-often for work. I wouldn’t mind not having to take my iPad with me on the flight. \n\nSimilarly if I’m out and about, I’d enjoy having more screen real estate for emails, docs or spreadsheets without having to whip out my laptop.",
                  "score": 45,
                  "created_utc": 1752751166.0,
                  "replies": [
                    {
                      "id": "n3p1byu",
                      "author": "doubleohbond",
                      "body": "Dropping $2k for a mild inconvenience is pretty wild to me.",
                      "score": -2,
                      "created_utc": 1752783560.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3m0b26",
                  "author": "DamageEffective250",
                  "body": "It’s both a phone and a tablet that fits in your pocket. I’ll probably get one and ditch my iPad as it becomes a bit redundant.",
                  "score": 28,
                  "created_utc": 1752751095.0,
                  "replies": [
                    {
                      "id": "n3m6mbl",
                      "author": "YJoseph",
                      "body": "Really curious: how do phone cases work with foldables?\n\nI can’t imagine using a phone without cover",
                      "score": 3,
                      "created_utc": 1752753656.0,
                      "replies": [
                        {
                          "id": "n3m8mjj",
                          "author": "pay_student_loan",
                          "body": "Just look up galaxy fold cases and you should have a pretty good idea. They already exist",
                          "score": 4,
                          "created_utc": 1752754406.0,
                          "replies": []
                        },
                        {
                          "id": "n3mj4tn",
                          "author": "Tormidal",
                          "body": "You can literally go look at cases. There are plenty of cases that cover the whole phone.",
                          "score": 3,
                          "created_utc": 1752758001.0,
                          "replies": []
                        },
                        {
                          "id": "n3mf1x5",
                          "author": "dontthink19",
                          "body": "I have a spring loaded hinge cover attached to the solid back half, and then like a smallish frame for the front half with the screen that covers the edges of the phone. Its not bad, fun to fidget with when im bored",
                          "score": 1,
                          "created_utc": 1752756660.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n3m0sbo",
                      "author": "MShoeSlur",
                      "body": "iPhone 16 pro max is 7 inches and can be held with 1 hand. Is it really worth the bulk and extra price for the extra .8? Is that even a tablet replacement ?",
                      "score": -10,
                      "created_utc": 1752751302.0,
                      "replies": [
                        {
                          "id": "n3m4n9b",
                          "author": "flatroundworm",
                          "body": "If the 7.8” is 4:3 it would be 57% more screen. Ultrawide aspects make screens sound way bigger than they actually are since we measure the diagonal.",
                          "score": 14,
                          "created_utc": 1752752900.0,
                          "replies": []
                        },
                        {
                          "id": "n3m3389",
                          "author": "ShinyGrezz",
                          "body": "7.8” is a stone’s throw away from an iPad mini’s 8.3” display. Add to that the fact that there’s going to feel to be more real estate (as the aspect ratio of tablet mode will be different) and all that with a much lower footprint in phone mode… yeah. Worth it for those that care.",
                          "score": 6,
                          "created_utc": 1752752271.0,
                          "replies": []
                        },
                        {
                          "id": "n3m3gey",
                          "author": "Notawholelottosay",
                          "body": "It’s 0.8 extra on the diagonal, but depending on shape it could be much larger in area",
                          "score": 5,
                          "created_utc": 1752752421.0,
                          "replies": []
                        },
                        {
                          "id": "n3m34fk",
                          "author": "WFlumin8",
                          "body": "This isn’t a valid point. The market for the iPhone fold is going to be for people who want a smaller iPhone that CAN expand to be larger than even the biggest iPhone in the lineup. The size of the fold when folded will be closer to the non pro max, so the difference is not .8, it’s 1.5. \n\nNot to mention, even if we’re comparing the iPhone pro max to the fold the difference is 27%, which makes digesting content much more comfort. This is the same screen area increase from a 24 to a 27 inch monitor.",
                          "score": 3,
                          "created_utc": 1752752285.0,
                          "replies": []
                        },
                        {
                          "id": "n3m2ay1",
                          "author": "DamageEffective250",
                          "body": "For me it is. I find the Pro Max too big to use comfortably with one hand as a phone and I don’t like how bulky it is in my pocket.",
                          "score": 2,
                          "created_utc": 1752751943.0,
                          "replies": [
                            {
                              "id": "n3m93dd",
                              "author": "thelionsmouth",
                              "body": "I can see that. I guess foldable phones are the logical next step, we can’t make them bigger. \n\nI just wish they went a more affordable route, people have less disposable income and just want something with a better battery lol. \n\nBut this is Apple, they’re expected to innovate I guess.",
                              "score": 1,
                              "created_utc": 1752754578.0,
                              "replies": [
                                {
                                  "id": "n3nfh5p",
                                  "author": "xysid",
                                  "body": "Apple have the iPhone 16e that is their low end. If you want a bigger battery just get one of those battery packs that attach to the back magnetically, not only can you remove and replace it when it wears out, but you don't have to always have it on. I'm not sure I understand the people who want massive internal batteries anymore in this era of tech. They even make cases that have batteries included so you get to have the brick of your dreams if you want it that way.",
                                  "score": 1,
                                  "created_utc": 1752767348.0,
                                  "replies": [
                                    {
                                      "id": "n3q8hk9",
                                      "author": "thelionsmouth",
                                      "body": "The batteries aren’t bigger just better, they keep making the batteries more efficient so they can power a giant foldable screen and thinner layers. I just want a better battery in the same size phone. I’m not saying I want a larger phone, just the tech they use to power a thinner more hungry phone in a normal size. It’d last days.",
                                      "score": 1,
                                      "created_utc": 1752797011.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n3m25ox",
                          "author": "ConsistentAsparagus",
                          "body": "I have a 12 Pro Max, I think it’s at least similar in size if not the same.\n\nI work a lot with my phone whenever I can’t bring my tablet with me (or my desktop, obviously…). Having double the screen space would be a blessing. Not at this price, not with the inevitable (?) foldable problems, but it would be nice if done properly.",
                          "score": 0,
                          "created_utc": 1752751882.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3m3fix",
                  "author": "Nicinus",
                  "body": "It should be obvious, but it gives more screen area to a similarly sized device.  :)",
                  "score": 4,
                  "created_utc": 1752752411.0,
                  "replies": []
                },
                {
                  "id": "n3m23jw",
                  "author": "whosat___",
                  "body": "I work a lot with spreadsheets, and it would be nice to open up my phone to look at them on a larger screen. A coworker has a folding phone and he loves it for our job.",
                  "score": 4,
                  "created_utc": 1752751857.0,
                  "replies": []
                },
                {
                  "id": "n3m5umd",
                  "author": "TheGreatSoup",
                  "body": "I been trying to get an iPad mini, for some sort of notebook. \n\nI did try some foldables and is such nice to open a have that screen size.   I feel like is gonna be a good bridge. \n\nI have a pro max phone so I seen that fold phones can fit my pocket just fine.",
                  "score": 1,
                  "created_utc": 1752753361.0,
                  "replies": []
                },
                {
                  "id": "n3me7a1",
                  "author": "dontthink19",
                  "body": "I hated the zfold 5 at first, I didn't ask for it but insurance gave it to me after I busted up my s23u since those were unavailable. \n\nNow it tends to be super useful for multitasking different apps for work. I can have a chrome page open, reddit, and my diagnostic app all up at the same time and it doesn't feel cramped or tiny and pull information from all 3 at once for quicker diagnosis.\n\nI've found it super great for emulation. Is powerful enough to run even the hardest ps2 games. I can play Gran Turismo 4 on my phone with a Bluetooth controller. Upscaled to 720p and smooth frame rates with LESS battery consumption than any of the play store games I've played\n\nIts also pretty awesome if you stream a lot. The folding aspect means you can fold it into a 90° angle and play videos on half the inner screen and have all your controls and such on the bottom half, or open another app. \n\nFully open offers full, smooth, crisp 1440p or better 120fps video. Which is absolutely amazing for things like slo-mo guys videos or just streaming in general. You hardly ever notice the crease in the middle unless the light reflections around you hit the crease just right.\n\nIn the end, its a multi-tasker powerhouse with a bunch of creature comfort features. Its perfect for the office power worker who uses android over iPhone, but also the media consumer looking for content presented in an above average fashion. \n\nAs far as fragility, I've had absolutely no problems with the inner screen, even after the stock screen protector started peeling. Im not running any screen protector inside or out and im not worried despite working in a dirty ass automotive shop. I only have a case and I've dropped this phone plenty of times with no issue. \n\nI didn't mean to turn this into a mini review, but it did. Nothing will change my mind about wanting a better camera though. If it wasn't for the camera being my biggest factor, I'd probably get the z fold 7. But I take a fuck ton of random pictures and the S ultra series phones take the cake for this Samsung fanboy.",
                  "score": 1,
                  "created_utc": 1752756375.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3mb2mr",
          "author": "0000GKP",
          "body": "Many, many people are asking for this exact product. I personally prefer to keep my phone small and have an iPad for when I want a bigger screen, but this product will top the sales charts.",
          "score": 3,
          "created_utc": 1752755291.0,
          "replies": []
        },
        {
          "id": "n3m0mai",
          "author": "justthisones",
          "body": "You sure about that? Foldable phone with iOS is surely interesting to some groups. Those models are all on android now and the new Samsung Fold costs 2K already.",
          "score": 4,
          "created_utc": 1752751230.0,
          "replies": []
        },
        {
          "id": "n3m6n86",
          "author": "micosoft",
          "body": "Road warrior here. I asked and I don’t pay (the business does). I’m the same sort of person who paid €5k for a Nokia cityman cellphone in 1990 equivalent to 10k plus now. It makes my business a lot of money keeping me productive. The ability to see and edit a spreadsheet while standing at a gate is huge. Different people have different needs and this is not a mass market product.",
          "score": 4,
          "created_utc": 1752753665.0,
          "replies": []
        },
        {
          "id": "n3n7lm9",
          "author": "i__hate__stairs",
          "body": "Tons of people want a foldable iPhone.  I am not one of those people, but they certainly exist.",
          "score": 2,
          "created_utc": 1752765168.0,
          "replies": []
        },
        {
          "id": "n3miov6",
          "author": "Headbanger",
          "body": "Speak for yourself. I bet plenty of people are willing to splurge 2000$ on a foldable iphone.",
          "score": 3,
          "created_utc": 1752757859.0,
          "replies": []
        },
        {
          "id": "n3mc353",
          "author": "phero1190",
          "body": "I love foldables. I'm not an apple fan, but when they make a good product, other companies tend to follow. So an apple foldable has a chance to improve all foldables.",
          "score": 1,
          "created_utc": 1752755650.0,
          "replies": []
        },
        {
          "id": "n3mttok",
          "author": "thishasntbeeneasy",
          "body": "Quick search for stats and saw these:\n\n\\- In the last year, 55% of foldable smartphone owners switched back to conventional smartphones when upgrading.\n\n\\- Despite significant growth, foldable smartphone still only represented 1.5% of the smartphone market at the start of the year.",
          "score": 1,
          "created_utc": 1752761285.0,
          "replies": []
        },
        {
          "id": "n3lzpjk",
          "author": "Wuffkeks",
          "body": "You underestimate apple cultists. After the next keynote they will tell you that apple invented the fold phone and that it is the best ever and will stand in line to buy it at over 2k.",
          "score": -13,
          "created_utc": 1752750833.0,
          "replies": [
            {
              "id": "n3m03zv",
              "author": "aarontsuru",
              "body": "Tell that to the Vision Pro.",
              "score": 12,
              "created_utc": 1752751010.0,
              "replies": [
                {
                  "id": "n3m5jcp",
                  "author": "NeverComments",
                  "body": "Apple doesn’t seem too disappointed in it. Over half of the WWDC25 content was Vision Pro, and rumor is they’re launching an M4/M5 model later this year. ",
                  "score": 1,
                  "created_utc": 1752753242.0,
                  "replies": [
                    {
                      "id": "n3mv287",
                      "author": "Wuffkeks",
                      "body": "Wasn't they basically only bought by influencer to make videos and then returned?",
                      "score": 1,
                      "created_utc": 1752761648.0,
                      "replies": [
                        {
                          "id": "n3myruy",
                          "author": "NeverComments",
                          "body": "Obviously no. How many influencers do you think there are? They've sold ~500k units and like I said the rumor is that they are releasing an updated model later this year.",
                          "score": 1,
                          "created_utc": 1752762706.0,
                          "replies": [
                            {
                              "id": "n3nxl8s",
                              "author": "Wuffkeks",
                              "body": "To many influencer...",
                              "score": 1,
                              "created_utc": 1752772351.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n3mfkhk",
                      "author": "aarontsuru",
                      "body": "But that wasn't the argument. It wasn't about Apple's dedication, but about \"Apple cultists\" fervor.  \n\nVision Pro had its early adopters and viral youtuber moments, but that was it.",
                      "score": 0,
                      "created_utc": 1752756833.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3mv5hr",
                  "author": "Wuffkeks",
                  "body": "It's not a phone. You can't really brag in public with a vision pro.",
                  "score": 0,
                  "created_utc": 1752761674.0,
                  "replies": [
                    {
                      "id": "n3n1ydr",
                      "author": "aarontsuru",
                      "body": "It's your claim, my friend. Are they \"apple cultists\" or not?",
                      "score": -1,
                      "created_utc": 1752763595.0,
                      "replies": [
                        {
                          "id": "n3nxf31",
                          "author": "Wuffkeks",
                          "body": "Not as hardcore as they been but head over to the Apple subreddit and look for yourself ",
                          "score": 1,
                          "created_utc": 1752772304.0,
                          "replies": [
                            {
                              "id": "n3o7ipm",
                              "author": "aarontsuru",
                              "body": "I mean. Isn’t that the point of the Apple subreddit?\n\nI’m not on the JRPG subreddit because I DONT play JRPGs. \n\nAnd if you do dive into the Apple subreddit, you’ll find plenty of criticism. \n\nSo maybe turn off the 2010 mindset and just talk gadgets without the weird outdated mentality.",
                              "score": 0,
                              "created_utc": 1752775023.0,
                              "replies": [
                                {
                                  "id": "n3oic26",
                                  "author": "Wuffkeks",
                                  "body": "Ah so you are one of the cultists, should have recognized it earlier. Well good to know who to block because nothing of value will come out of this discussion.",
                                  "score": 0,
                                  "created_utc": 1752778114.0,
                                  "replies": [
                                    {
                                      "id": "n3prbau",
                                      "author": "aarontsuru",
                                      "body": "lol. WTF are you talking about? So funny man.",
                                      "score": 1,
                                      "created_utc": 1752791282.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3m01hg",
              "author": "darraghfenacin",
              "body": "Do people still stand in line for product launches? ",
              "score": 8,
              "created_utc": 1752750979.0,
              "replies": [
                {
                  "id": "n3n5zeu",
                  "author": "InsaneNinja",
                  "body": "Yeah it’s called pre-order.  \n\nBeyond that, Samsung, literally, for years, has offered a discount if you buy the next galaxy phone before they announce it.",
                  "score": 0,
                  "created_utc": 1752764715.0,
                  "replies": [
                    {
                      "id": "n3n65ok",
                      "author": "darraghfenacin",
                      "body": "Oh, so they don't stand in line. OK. ",
                      "score": 1,
                      "created_utc": 1752764764.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3mb930",
          "author": "manyeggplants",
          "body": "(Apple cultists will pay this)",
          "score": -1,
          "created_utc": 1752755355.0,
          "replies": []
        },
        {
          "id": "n3mbrmq",
          "author": "thisischemistry",
          "body": "I can't wait to see how few of these sell because wasn't that the big reason people gave for dropping the mini?",
          "score": -1,
          "created_utc": 1752755539.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3os2w2",
      "author": "copypaste_93",
      "body": "The flip trend is so stupid.",
      "score": 4,
      "created_utc": 1752780886.0,
      "replies": [
        {
          "id": "n3pcslt",
          "author": "MyOnlyAccount_6",
          "body": "I’ve liked the designs Android had on foldable a few years ago. I saw a helicopter pilot in Nepal of all places with one and it was pretty slick. No idea how long it would last but I’d love to have an optionally larger screen for multi tasking and movies.",
          "score": 4,
          "created_utc": 1752786820.0,
          "replies": [
            {
              "id": "n3q3dak",
              "author": "-Bk7",
              "body": "> I’d love to have an optionally larger screen for multi tasking and movies\n\nfor movies the aspect ratio means biiig black bars. much rather just use my s ultra.",
              "score": 2,
              "created_utc": 1752795258.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3nenot",
      "author": "Kellic",
      "body": "Don't worry.  All the Apple fans will think Apple did it first in a few years time.",
      "score": 2,
      "created_utc": 1752767122.0,
      "replies": []
    },
    {
      "id": "n3mi3xr",
      "author": "letsrockkk",
      "body": "Thats too cheap. Make it 4k",
      "score": 2,
      "created_utc": 1752757669.0,
      "replies": []
    },
    {
      "id": "n3n9ubu",
      "author": "A_Dragon",
      "body": "Why do I need it to fold?",
      "score": 2,
      "created_utc": 1752765797.0,
      "replies": []
    },
    {
      "id": "n3nm2k5",
      "author": "pacman3333",
      "body": "This is hot dog water compared to the Chinese fold phones like the Vivo",
      "score": 2,
      "created_utc": 1752769193.0,
      "replies": []
    },
    {
      "id": "n3p75z8",
      "author": "MisterFingerstyle",
      "body": "Can I fold it up any way I want or only the way Apple has predetermined for users.",
      "score": 2,
      "created_utc": 1752785200.0,
      "replies": []
    },
    {
      "id": "n3mb5yk",
      "author": "slavaMZ",
      "body": "$0 with Verizon plan",
      "score": 4,
      "created_utc": 1752755324.0,
      "replies": [
        {
          "id": "n3mu68t",
          "author": "thishasntbeeneasy",
          "body": "$0 phone!\\*\n\n\\*with 2 years of $100/mo payments",
          "score": -1,
          "created_utc": 1752761387.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3n2nuw",
      "author": "Winter-Market592",
      "body": "Will it overheat when I use it looking up cooking recipes on safari tho? All I care about",
      "score": 1,
      "created_utc": 1752763796.0,
      "replies": [
        {
          "id": "n3pkpyy",
          "author": "electricity_is_life",
          "body": "Does that happen now?",
          "score": 2,
          "created_utc": 1752789189.0,
          "replies": [
            {
              "id": "n3qx2p7",
              "author": "Winter-Market592",
              "body": "Yes. Ads popping up will fry the phone. Within 2 minutes the brightness will go down",
              "score": 1,
              "created_utc": 1752805878.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3lymqd",
      "author": "Mr_Lumbergh",
      "body": "I hope they keep models without this \"feature.\"\n\nNot once have I ever had the thought, \"I'd really like to double the thickness of this thing before putting it back in my pocket.\"",
      "score": -1,
      "created_utc": 1752750352.0,
      "replies": [
        {
          "id": "n3m9hym",
          "author": "BootyMcStuffins",
          "body": "Obviously they’ll keep their non-foldable phones 🤦‍♂️\n\nHas everyone taken stupid pills this morning? This thread is cringe as fuck for a “gadgets” subreddit",
          "score": 17,
          "created_utc": 1752754724.0,
          "replies": [
            {
              "id": "n3miy3l",
              "author": "alc4pwned",
              "body": "This sub has been like this for years. Actual tech enthusiasts who know things about \"gadgets\" are like 10% of the community lol",
              "score": 7,
              "created_utc": 1752757941.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3lz18g",
          "author": "frizbeezz",
          "body": "You do know that current foldable phones when folded are the same thickness as iPhones?",
          "score": 30,
          "created_utc": 1752750533.0,
          "replies": [
            {
              "id": "n3lzo1t",
              "author": "MattBrey",
              "body": "Emphasis on current. Apple's doesn't seem to be there yet",
              "score": 0,
              "created_utc": 1752750814.0,
              "replies": [
                {
                  "id": "n3mlf1y",
                  "author": "MCA2142",
                  "body": "> Emphasis on current. Apple's doesn't seem to be there yet\n\nApple hasn’t released a foldable.  WTF are you on about?",
                  "score": 7,
                  "created_utc": 1752758730.0,
                  "replies": [
                    {
                      "id": "n3nkn3j",
                      "author": "MattBrey",
                      "body": "The rumors have been going strong about is being creaseless but thicker than the galaxy folds (that are already not the thinnest). They could improve their design before release, but not by much considering the tipped 2025 release date. Unless they delay",
                      "score": -1,
                      "created_utc": 1752768795.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3m05uw",
                  "author": "frizbeezz",
                  "body": "Agreed. If we are talking about Apple, their foldable might be the thickest haha",
                  "score": -2,
                  "created_utc": 1752751032.0,
                  "replies": [
                    {
                      "id": "n3ma3h1",
                      "author": "BootyMcStuffins",
                      "body": "You think Apple will release a thick phone? The company so obsessed with making devices thin that their latest tablet is literally difficult to pick up off a table if you put it face down?",
                      "score": 3,
                      "created_utc": 1752754940.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3m2bap",
              "author": "kukaz00",
              "body": "Apple will be 4 years behind but claim it's revolutionary.",
              "score": -1,
              "created_utc": 1752751948.0,
              "replies": [
                {
                  "id": "n3n7gap",
                  "author": "InsaneNinja",
                  "body": "Apple was skipping the “delicate hinge” years that Samsung was public beta testing.",
                  "score": 2,
                  "created_utc": 1752765127.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3mc9ez",
              "author": "thisischemistry",
              "body": "If they can make a half thickness iPhone then do it with a single screen and double up the battery.",
              "score": 0,
              "created_utc": 1752755711.0,
              "replies": [
                {
                  "id": "n3n7nt1",
                  "author": "InsaneNinja",
                  "body": "They’ve got a Pro Max just waiting for you.",
                  "score": 2,
                  "created_utc": 1752765185.0,
                  "replies": [
                    {
                      "id": "n3n8f12",
                      "author": "thisischemistry",
                      "body": "Pass. I have a iPhone 13 mini and I'd rather switch to an old-school \"feature phone\" than something bigger.\n\nThicker is just fine, it's the height and width I don't need.",
                      "score": 0,
                      "created_utc": 1752765396.0,
                      "replies": [
                        {
                          "id": "n3n9162",
                          "author": "InsaneNinja",
                          "body": "Well, then you might as well just look at the MagSafe batteries. You can thicken up your phone whenever you want, and then go back to a slim phone whenever you want.",
                          "score": 1,
                          "created_utc": 1752765570.0,
                          "replies": [
                            {
                              "id": "n3natzm",
                              "author": "thisischemistry",
                              "body": "I agree, that can be a decent solution. \n\nOf course, it's extra cost and hassle on top of the expensive phone you just bought. I'd like to see thicker phones with more battery life as an option when I'm buying a phone. This trend towards thinner and foldable phones is leaving behind some of the other practical aspects of a phone such as ease-of-use and how long they last.",
                              "score": 1,
                              "created_utc": 1752766073.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3m0l2p",
              "author": "MLG-Sheep",
              "body": "They're 1 to 2 mm thicker than non-foldables which is noticeable. In freedom units, about the diameter of a toothpick.",
              "score": -4,
              "created_utc": 1752751216.0,
              "replies": [
                {
                  "id": "n3marr9",
                  "author": "OldTimeyWizard",
                  "body": "Wow, I never thought I’d run into the princess from The Princess and the Pea",
                  "score": 4,
                  "created_utc": 1752755182.0,
                  "replies": [
                    {
                      "id": "n3mbku4",
                      "author": "MLG-Sheep",
                      "body": "I don't get the reference, but 1-2 mm extra thickness is not as little as it may seem. The Fold 7 is 8.9 mm thick when folded, which is 24% thicker than the S25 (7.2 mm). I'm not going to compare with the S25 Edge because that would be unfair.",
                      "score": 1,
                      "created_utc": 1752755473.0,
                      "replies": [
                        {
                          "id": "n3mridi",
                          "author": "OldTimeyWizard",
                          "body": "[The Princess and the Pea is a classic fairy tale by Hans Christian Andersen.](https://en.wikipedia.org/wiki/The_Princess_and_the_Pea?wprov=sfti1) The gist of the story is there’s a princess that proves she’s a princess by feeling a single pea under a huge stack of mattresses.\n\nIf a mere 2mm is effecting you this much you might need to wear pants that aren’t so tight.",
                          "score": 1,
                          "created_utc": 1752760599.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3lzl3c",
              "author": "Mr_Lumbergh",
              "body": "What else are they skimping on then?",
              "score": -5,
              "created_utc": 1752750779.0,
              "replies": [
                {
                  "id": "n3lzzol",
                  "author": "30BlueRailroad",
                  "body": "In the newest galaxy fold 7, they took out the s pen support. Other than that, technology has gotten better. They've gotten more durable and even the refurbished fold 4 I owned briefly was solid. The crease is barely recognizable. I don't like apple much personally but I guarantee they waited to drop a foldable until the tech was capable and relative thinness was assured.",
                  "score": 14,
                  "created_utc": 1752750958.0,
                  "replies": []
                },
                {
                  "id": "n3m68eu",
                  "author": "AverageJoeJohnSmith",
                  "body": "Nothing",
                  "score": -2,
                  "created_utc": 1752753509.0,
                  "replies": [
                    {
                      "id": "n3m9mrz",
                      "author": "Mr_Lumbergh",
                      "body": "Scratch protection on the screen, for starters; they have to be plastic. More easily broken in a drop. Exposed hinge.",
                      "score": 1,
                      "created_utc": 1752754773.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3lz3fg",
          "author": "Bgndrsn",
          "body": "You think they are going to switch to only selling folding phones? Wut",
          "score": 12,
          "created_utc": 1752750559.0,
          "replies": [
            {
              "id": "n3lzde8",
              "author": "Mr_Lumbergh",
              "body": "Look at history. They consolidate form factors around a basic \"small, medium, large\" that's mostly the same.",
              "score": -4,
              "created_utc": 1752750683.0,
              "replies": [
                {
                  "id": "n3m0xmy",
                  "author": "danielv123",
                  "body": "I hope with big ass foldable phones they can finally ditch the iPad and their last excuse to not put touch on the MacBook.",
                  "score": 2,
                  "created_utc": 1752751366.0,
                  "replies": [
                    {
                      "id": "n3m1lq6",
                      "author": "Mr_Lumbergh",
                      "body": "That's another thing I don't get- touch screens on laptops. I'm supposed to reach over the keyboard and trackpad and hold my arm up to smudge the screen instead?\n\nJust because certain tech is cool doesn't make it best for all applications.",
                      "score": 6,
                      "created_utc": 1752751650.0,
                      "replies": [
                        {
                          "id": "n3mb8d7",
                          "author": "zeller99",
                          "body": "Most of my laptops have touch screens.  It's a feature that I thought I would use.  I don't... for exactly the reasons that you mentioned. \n\nMy most recent one has a screen that folds back so you can use it like a tablet... the world's thickest and most unwieldy tablet... with a keyboard on the back.",
                          "score": 3,
                          "created_utc": 1752755348.0,
                          "replies": [
                            {
                              "id": "n3mbk3n",
                              "author": "Mr_Lumbergh",
                              "body": "They're sold on the illusion of utility, not utility itself.",
                              "score": 1,
                              "created_utc": 1752755465.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n3mbq7d",
                          "author": "OldTimeyWizard",
                          "body": "I use the touchscreen on my work laptop literally every day. I find it’s more ergonomic than the trackpad for certain tasks.",
                          "score": 2,
                          "created_utc": 1752755525.0,
                          "replies": []
                        },
                        {
                          "id": "n3m2g4w",
                          "author": "danielv123",
                          "body": "It's great for testing touchscreen stuff. Drawing with a trackpad sucks when touchscreens exist. Folding the screen back and using it as a tablet is also far better for using the laptop when walking.",
                          "score": 1,
                          "created_utc": 1752752004.0,
                          "replies": [
                            {
                              "id": "n3m3t10",
                              "author": "Mr_Lumbergh",
                              "body": "If I'm doing digital art, I'll have a dedicated pad with a high-enough res and sensitivity. There's a reason those are still around. \n\nAlso, just because a laptop has a touch screen doesn't mean it works as a tablet (looking at you, Lenovo X1), which renders it utterly useless. I had to have IT at work disable the touch on my work laptop in BIOS because it would start glitching and registering false clicks when it was hot because I had the modelling software open and it was loaded. But Lenovo in their infinite wisdom decided it was less expensive to stock fewer part numbers, and just sticks them on everything now.\n\nLike I said, just because tech is cool doesn't make it appropriate for all applications. On my work laptop, it was actually a hindrance.",
                              "score": 2,
                              "created_utc": 1752752563.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n3mainc",
                      "author": "BootyMcStuffins",
                      "body": "Why do people want a touch screen MacBook? I’ve never understood this. Unless you get one of the convertible ones, like the yoga, laptops are not good touch surfaces",
                      "score": 1,
                      "created_utc": 1752755091.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3n7xz8",
                  "author": "InsaneNinja",
                  "body": "They offer an iPad Air in two sizes, an iPad Pro in two sizes.  The MacBook Air/Pro each in two sizes.  And the iPhone standard/pro in two sizes.  \n\nWhat?",
                  "score": 1,
                  "created_utc": 1752765264.0,
                  "replies": [
                    {
                      "id": "n3pfvz4",
                      "author": "Mr_Lumbergh",
                      "body": "Phones was the topic.",
                      "score": 1,
                      "created_utc": 1752787745.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3m2hr8",
          "author": "gbeezy007",
          "body": "The good news is recent foldable are not double the thickness. New Samsung folding phone actually weighs less then a iPhone pro max. They are very close to just normal phone sized ( though not if you use the smaller screen phones but you also probably don't want a fold if you picked the smaller bar sized phone)",
          "score": 3,
          "created_utc": 1752752023.0,
          "replies": []
        },
        {
          "id": "n3lzb22",
          "author": "MLG-Sheep",
          "body": "Of course they will, most people want nothing to do with foldables and this won't change in the foreseeable future.\n\nNot only because they're thicker when folded, but also because the price/performance is considerably worse, and because the inner screen must be plastic that scratches with pretty much anything.",
          "score": -1,
          "created_utc": 1752750654.0,
          "replies": []
        },
        {
          "id": "n3m1ie1",
          "author": "itastesok",
          "body": "Of course they will.",
          "score": -2,
          "created_utc": 1752751610.0,
          "replies": []
        },
        {
          "id": "n3m02ky",
          "author": "x_Carlos_Danger_x",
          "body": "Twice the thickness, twice the cost, same utility!! What an interesting device. I get why people enjoy the novelty but no thanks",
          "score": -6,
          "created_utc": 1752750993.0,
          "replies": [
            {
              "id": "n3m47ym",
              "author": "6r1n3i19",
              "body": "The 16 pro max is 8.2mm thick and they’re saying the foldable is going to be between 9 - 9.5 mm when folded",
              "score": 3,
              "created_utc": 1752752731.0,
              "replies": []
            },
            {
              "id": "n3m0grs",
              "author": "Mr_Lumbergh",
              "body": "B-b-b-but bigger screen..!\n\n...on a device that's in my pocket or sitting blank on my desk 90% of the time.",
              "score": -8,
              "created_utc": 1752751164.0,
              "replies": [
                {
                  "id": "n3n1w76",
                  "author": "SUPRVLLAN",
                  "body": "So it isn’t for you, don’t buy it. You aren’t the main character champ.",
                  "score": 1,
                  "created_utc": 1752763578.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3mbbkv",
      "author": "piranhadub",
      "body": "They will give us anything but macOS on an iPad",
      "score": 2,
      "created_utc": 1752755380.0,
      "replies": [
        {
          "id": "n3n4o07",
          "author": "InsaneNinja",
          "body": "Have you even seen iPadOS 26?  They added half the Mac features that were missing.",
          "score": 2,
          "created_utc": 1752764348.0,
          "replies": []
        },
        {
          "id": "n3mzhlg",
          "author": "crasscrackbandit",
          "body": "Why would they do that?\n\nIt will kill MB Air in an instant.",
          "score": 1,
          "created_utc": 1752762908.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3nbmtt",
      "author": "DrowningKrown",
      "body": "Guys we’re about to see, in real time, the iPhone community all of a sudden love foldables after having calling them gimmicks and stupid for years. \n\nI’m here for it. I will be reading people’s post histories all day",
      "score": 1,
      "created_utc": 1752766291.0,
      "replies": [
        {
          "id": "n3nht9w",
          "author": "MageFood",
          "body": "No thanks I don’t want foldable phone",
          "score": 1,
          "created_utc": 1752768003.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m1f6v",
      "author": "itastesok",
      "body": "Better than 7\", which is what the last rumor stated.",
      "score": 1,
      "created_utc": 1752751572.0,
      "replies": []
    },
    {
      "id": "n3m2r04",
      "author": "questionname",
      "body": "Question would be, how much would att or Verizon charge it after rebate. If it’s around $1000, I might bite",
      "score": 1,
      "created_utc": 1752752130.0,
      "replies": []
    },
    {
      "id": "n3m66zp",
      "author": "scientist99",
      "body": "I doubt this will release next year",
      "score": 1,
      "created_utc": 1752753494.0,
      "replies": []
    },
    {
      "id": "n3m9k4i",
      "author": "Supernova_Soldier",
      "body": "Anything to get me to upgrade my old piece of shit, huh",
      "score": 1,
      "created_utc": 1752754747.0,
      "replies": []
    },
    {
      "id": "n3mdjwj",
      "author": "drvenkman9",
      "body": "Powered by the ALL NEW A20 Pro, this will truly be the iPhone Pro for pros!",
      "score": 1,
      "created_utc": 1752756155.0,
      "replies": []
    },
    {
      "id": "n3mekqj",
      "author": "Free_Dimension1459",
      "body": "iFold - can’t bluff my way into pretending I can afford such a luxury lol.",
      "score": 1,
      "created_utc": 1752756500.0,
      "replies": []
    },
    {
      "id": "n3mfj15",
      "author": "billdasmacks",
      "body": "Will be interesting to see if this catches on. I have seen maybe one foldable Android phone out in the wild.",
      "score": 1,
      "created_utc": 1752756819.0,
      "replies": []
    },
    {
      "id": "n3mflsv",
      "author": "MilesTheGoodKing",
      "body": "There will definitely be promotions to bring down the price of this device. Trade ins will make it more palatable.",
      "score": 1,
      "created_utc": 1752756845.0,
      "replies": []
    },
    {
      "id": "n3mglcj",
      "author": "DrMokhtar",
      "body": "Can’t wait!",
      "score": 1,
      "created_utc": 1752757166.0,
      "replies": []
    },
    {
      "id": "n3mhs3r",
      "author": "ToMorrowsEnd",
      "body": "Samsung's phone will be 3 grand so thats on par",
      "score": 1,
      "created_utc": 1752757560.0,
      "replies": []
    },
    {
      "id": "n3mihk8",
      "author": "pqratusa",
      "body": "I was hoping the foldable model would fold down vertically (like a flip phone) to make it smaller and easier to carry in my pocket.",
      "score": 1,
      "created_utc": 1752757792.0,
      "replies": []
    },
    {
      "id": "n3mlbe5",
      "author": "desertcoyote77",
      "body": "I hope the pencil works with this foldable.  I would buy an Apple Pencil that looks like a regular pen for this phone.",
      "score": 1,
      "created_utc": 1752758697.0,
      "replies": []
    },
    {
      "id": "n3mle2i",
      "author": "Worldly-Corgi-1624",
      "body": "How about just bringing back the iPhone mini form factor so I can upgrade from my 13?",
      "score": 1,
      "created_utc": 1752758721.0,
      "replies": []
    },
    {
      "id": "n3mptsj",
      "author": "barefacedstorm",
      "body": "Bummer to see it’s not a Razr vertical style folding device…ain’t nobody got pockets like that.",
      "score": 1,
      "created_utc": 1752760092.0,
      "replies": []
    },
    {
      "id": "n3mr0e5",
      "author": "itsaride",
      "body": "I'll wait for the iFold SE.",
      "score": 1,
      "created_utc": 1752760449.0,
      "replies": []
    },
    {
      "id": "n3mvyqa",
      "author": "Explosev",
      "body": "They should have waited like they do normally until a triple fold with no creases was possible.",
      "score": 1,
      "created_utc": 1752761907.0,
      "replies": []
    },
    {
      "id": "n3mx24w",
      "author": "ohyeahbonertime",
      "body": "It’s folding the wrong way",
      "score": 1,
      "created_utc": 1752762219.0,
      "replies": []
    },
    {
      "id": "n3mzyog",
      "author": "Sweethoneyx1",
      "body": "aren't phones already 7 inches doesn't seem like much of an upgrade",
      "score": 1,
      "created_utc": 1752763040.0,
      "replies": []
    },
    {
      "id": "n3n0n40",
      "author": "Tommy__want__wingy",
      "body": "Nah I’m good with my iPhone 12.",
      "score": 1,
      "created_utc": 1752763231.0,
      "replies": []
    },
    {
      "id": "n3n1cgo",
      "author": "In2_The_Blue",
      "body": "Meanwhile I just want an iPhone without a camera cutout and an edge to edge screen like the redmagic. Also not having a massive camera bump would be nice.",
      "score": 1,
      "created_utc": 1752763425.0,
      "replies": []
    },
    {
      "id": "n3n2hq8",
      "author": "Gallop67",
      "body": "And watch there still be some visible crease in it. One reason I’ve never been attracted to foldables",
      "score": 1,
      "created_utc": 1752763748.0,
      "replies": []
    },
    {
      "id": "n3n3iuc",
      "author": "NotAnotherBlingBlop",
      "body": "Foldable phones are so fucking stupid",
      "score": 1,
      "created_utc": 1752764035.0,
      "replies": []
    },
    {
      "id": "n3n4sml",
      "author": "kshiau",
      "body": "Apple joining the fold game 10 years late",
      "score": 1,
      "created_utc": 1752764384.0,
      "replies": []
    },
    {
      "id": "n3n4yus",
      "author": "Master_Grape5931",
      "body": "Did anyone ask for a foldable phone?!!  wtf, man",
      "score": 1,
      "created_utc": 1752764431.0,
      "replies": []
    },
    {
      "id": "n3n5srj",
      "author": "goronmask",
      "body": "Fuck off with those prices. Back to cheap phones it is",
      "score": 1,
      "created_utc": 1752764663.0,
      "replies": []
    },
    {
      "id": "n3n855f",
      "author": "cheknauss",
      "body": "Lol, wow... They total invented this never before seen think of a foldable phone...!\n\n/s",
      "score": 1,
      "created_utc": 1752765319.0,
      "replies": []
    },
    {
      "id": "n3n8947",
      "author": "FUThead2016",
      "body": "Foldable phones are stupid and difficult to market",
      "score": 1,
      "created_utc": 1752765349.0,
      "replies": []
    },
    {
      "id": "n3nhygy",
      "author": "ripndipp",
      "body": "I want less phone",
      "score": 1,
      "created_utc": 1752768042.0,
      "replies": []
    },
    {
      "id": "n3nj6i0",
      "author": "CrapoCrapo25",
      "body": "Nope",
      "score": 1,
      "created_utc": 1752768386.0,
      "replies": []
    },
    {
      "id": "n3njzzk",
      "author": "vurto",
      "body": "But is it made in America? /s",
      "score": 1,
      "created_utc": 1752768616.0,
      "replies": []
    },
    {
      "id": "n3ntuz4",
      "author": "P1mongoose",
      "body": "Didn’t think they would go single screen since the company is all about aesthetics and the crease had been the hold up, to my understanding. I fully expected them to go the Surface Duo route.",
      "score": 1,
      "created_utc": 1752771340.0,
      "replies": []
    },
    {
      "id": "n3o9dz4",
      "author": "xxearvinxx",
      "body": "My question is, will the first foldable run iOS or iPad OS?             \nIt would be weird to basically have an iPad that is missing a bunch of features software wise.",
      "score": 1,
      "created_utc": 1752775551.0,
      "replies": []
    },
    {
      "id": "n3qqjny",
      "author": "akgis",
      "body": "Foldables are expensive already, Apple going on with this price will just prompt Samsung/Motorolla to go the same route with same price on their foldables.\n\nAnd basicaly will be the same shit from the apple playbook let others beta test this stuff and fix all kinks for us to swipe in and say its really ground breaking innovation.",
      "score": 1,
      "created_utc": 1752803478.0,
      "replies": []
    },
    {
      "id": "n3quvf9",
      "author": "CroatianSensation79",
      "body": "No thanks.",
      "score": 1,
      "created_utc": 1752805055.0,
      "replies": []
    },
    {
      "id": "n3qwpwk",
      "author": "Butterl0rdz",
      "body": "NOOOO ITS A FOLD NOT A FLIP. tragic for me and like 12 other people",
      "score": 1,
      "created_utc": 1752805744.0,
      "replies": []
    },
    {
      "id": "n3r7vp8",
      "author": "IanHSC",
      "body": "I would love a comparable fold phone from Apple to other brands, since I’m engrained in the ecosystem. My issue is that specs-wise, the Apple foldable seems to be a paired down version of what you can get from other players in the space. Especially as mobile applications become more demanding, those missing GB of RAM is going to hurt the long term prospects.",
      "score": 1,
      "created_utc": 1752810135.0,
      "replies": []
    },
    {
      "id": "n3s0zqk",
      "author": "WaffleStomperGirl",
      "body": "I’m a large Apple user. Prefer it in almost every capacity. \n\nHOWEVER. \n\nThis? This is stupid. The hell is the attraction to foldable phones?",
      "score": 1,
      "created_utc": 1752824484.0,
      "replies": []
    },
    {
      "id": "n3tb761",
      "author": "Chigibu",
      "body": "Knowing Apple, this will not be remotely affordable.",
      "score": 1,
      "created_utc": 1752845502.0,
      "replies": []
    },
    {
      "id": "n3whmtq",
      "author": "Recent_Opportunity78",
      "body": "For 2k if this can be a replacement for my MacBook with a wireless keyboard stand, I’m all in. Been waiting for a device like this from Apple for ages",
      "score": 1,
      "created_utc": 1752879371.0,
      "replies": [
        {
          "id": "n45ypxh",
          "author": "Gaff1515",
          "body": "You’ve been begging for an iPad mini for ages?",
          "score": 1,
          "created_utc": 1753019320.0,
          "replies": [
            {
              "id": "n45z13k",
              "author": "Recent_Opportunity78",
              "body": "I’ve been begging for a foldable device that turns into an iPad mini. Hey, you don’t think it’s a cool idea and it’s not your thing that’s fine. Don’t try to twist my words though.",
              "score": 1,
              "created_utc": 1753019429.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3yts48",
      "author": "mathiustus",
      "body": "Is there really a market for this? I don’t know anyone who gives a shit about a foldable phone. Genuine question. Why is this the target they are pushing?",
      "score": 1,
      "created_utc": 1752916553.0,
      "replies": [
        {
          "id": "n443wn0",
          "author": "Odd-Stock-3927",
          "body": "I’m gonna buy 2",
          "score": 1,
          "created_utc": 1752985772.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3zqpgi",
      "author": "Fourth_place_again",
      "body": "iPhold.",
      "score": 1,
      "created_utc": 1752931626.0,
      "replies": []
    },
    {
      "id": "n40cun1",
      "author": "NaThanos__",
      "body": "It must be rotten apples they’re eating over in silicon valley",
      "score": 1,
      "created_utc": 1752938822.0,
      "replies": []
    },
    {
      "id": "n481dkk",
      "author": "bumbasaur",
      "body": "manufactored with 200$ sold for 2000$. No ty",
      "score": 1,
      "created_utc": 1753042401.0,
      "replies": []
    },
    {
      "id": "n4ajpep",
      "author": "LucasNYC9",
      "body": "Just make a flip iPhone like the Razr",
      "score": 1,
      "created_utc": 1753075949.0,
      "replies": []
    },
    {
      "id": "n4gq2a8",
      "author": "G8M8N8",
      "body": "I will never buy a phone with a plastic screen, let alone at 2K",
      "score": 1,
      "created_utc": 1753155268.0,
      "replies": []
    },
    {
      "id": "n3mlitc",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1752758763.0,
      "replies": [
        {
          "id": "n3mthd8",
          "author": "joeymonreddit",
          "body": "I would get a foldable phone if the price were more reasonable. Having grown up with more than brick phones available, there’s something immensely satisfying about having a folding or sliding mechanism that we just don’t get anymore.",
          "score": 1,
          "created_utc": 1752761185.0,
          "replies": []
        },
        {
          "id": "n3msxzr",
          "author": "nottu77",
          "body": "I truly don’t understand the use cases for them.",
          "score": 1,
          "created_utc": 1752761025.0,
          "replies": [
            {
              "id": "n3n250p",
              "author": "SUPRVLLAN",
              "body": "It’s a phone that turns into a tablet.",
              "score": 1,
              "created_utc": 1752763647.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3mtdzj",
          "author": "thishasntbeeneasy",
          "body": "I'd like a folding phone if it wasn't >2x as thick. I see no point to adding a joint if it just takes up more volume.",
          "score": 0,
          "created_utc": 1752761157.0,
          "replies": [
            {
              "id": "n3n63jd",
              "author": "LaFoliaRihavein",
              "body": "Take a look at the z fold 7 thickness...",
              "score": 3,
              "created_utc": 1752764747.0,
              "replies": []
            },
            {
              "id": "n3n75wg",
              "author": "InsaneNinja",
              "body": "Check out the thickness of the fold 7",
              "score": 2,
              "created_utc": 1752765047.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3mopah",
      "author": "Tupperwarfare",
      "body": "Folding phones are garbage and until they can get rid of the crease they will continue to be so.",
      "score": 1,
      "created_utc": 1752759749.0,
      "replies": []
    },
    {
      "id": "n3m3fbu",
      "author": "irishfro",
      "body": "Damn gaming computers are the same price lmao",
      "score": 1,
      "created_utc": 1752752409.0,
      "replies": [
        {
          "id": "n3n4r0s",
          "author": "InsaneNinja",
          "body": "They don’t fit in your pocket.",
          "score": 5,
          "created_utc": 1752764372.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3njtf8",
      "author": "eminembdg",
      "body": "No way it'll be $2k. It's apple. The new Samsung fold is nearly $2k. Apple will definitely be higher",
      "score": 1,
      "created_utc": 1752768565.0,
      "replies": []
    },
    {
      "id": "n3m4jrs",
      "author": "N1LEredd",
      "body": "Just gimme the apple version of the galaxy flip for around 1k and im in.",
      "score": 1,
      "created_utc": 1752752862.0,
      "replies": []
    },
    {
      "id": "n3qf57v",
      "author": "ZebraComplex4353",
      "body": "They can keep it",
      "score": 1,
      "created_utc": 1752799377.0,
      "replies": []
    },
    {
      "id": "n3qg5vy",
      "author": "Sushmoyscott",
      "body": "Will be buying idc how bad it is",
      "score": 1,
      "created_utc": 1752799735.0,
      "replies": [
        {
          "id": "n3qpgdx",
          "author": "pet3rrulez",
          "body": "That’s crazy lol",
          "score": 1,
          "created_utc": 1752803080.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3lz2of",
      "author": "MLG-Sheep",
      "body": "I don't expect this to have significant penetration outside of the US, but I suppose it was finally time to copy what everyone else was doing.",
      "score": 0,
      "created_utc": 1752750550.0,
      "replies": []
    },
    {
      "id": "n3mgv8m",
      "author": "Aemort",
      "body": "2k is hilarious",
      "score": -1,
      "created_utc": 1752757256.0,
      "replies": [
        {
          "id": "n3mqart",
          "author": "Niquill",
          "body": "A sucker is born every minute. They'll prolly say thanks too.",
          "score": -2,
          "created_utc": 1752760234.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mb7wn",
      "author": "ng263",
      "body": "What I hate about this is how long this technology has been out now and being perfected over the years by companies like Huwawei Samsung OnePlus Google and I know without a doubt once this is released people praise it like it’s some unprecedented incredible milestone",
      "score": -1,
      "created_utc": 1752755343.0,
      "replies": [
        {
          "id": "n3mfd2g",
          "author": "Spanky2k",
          "body": "Because it will be a milestone. When Apple enters a market, it changes everything. If you're an Android user then you should *want* Apple to enter the folding phones market because it will force a significant improvement of both hardware and software design for fold devices.",
          "score": 6,
          "created_utc": 1752756764.0,
          "replies": []
        },
        {
          "id": "n3mfe1r",
          "author": "WumboChumbo-",
          "body": "Have you ever thought that foldable screens are garbage in their current form and Apple has been working on it behind the scenes to make it a more premium experience vs the cheap ass huaweis and Samsungs that we got early on that have busted screens now because the foldable tech isn’t good?",
          "score": 5,
          "created_utc": 1752756773.0,
          "replies": [
            {
              "id": "n3msmmz",
              "author": "iDarkville",
              "body": "Don’t you dare. They hate this sentiment around these here parts, pardnurr.",
              "score": 2,
              "created_utc": 1752760930.0,
              "replies": []
            },
            {
              "id": "n3nbp93",
              "author": "ng263",
              "body": "It’s going to be as good if not worse than Samsungs newest foldable. It’s already starting lower saying it’s a more premium experience the phone doesn’t even exist yet bro",
              "score": 1,
              "created_utc": 1752766310.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3mlze3",
      "author": "Kinto_il",
      "body": "it'd be nice if Apple was innovative again. Apple Silicon is nice, but they haven't made any compelling new products in a long time.",
      "score": 0,
      "created_utc": 1752758905.0,
      "replies": []
    },
    {
      "id": "n3n8zwk",
      "author": "thecoastertoaster",
      "body": "Oh good, another overpriced product no one asked for. \n\nMaybe they should focus on their terrible UI regression, bloated software, etc. They can’t even get Siri right, and it’s been how long?\n\nWell done, Apple.",
      "score": 0,
      "created_utc": 1752765560.0,
      "replies": []
    },
    {
      "id": "n3nl41c",
      "author": "warlock415",
      "body": "And when it comes out, iFanboys will all say \"Look how innovative Apple is!\"",
      "score": 0,
      "created_utc": 1752768927.0,
      "replies": []
    },
    {
      "id": "n3ovqpr",
      "author": "patricio87",
      "body": "Ill be interested if it has a similiar design to a nintendo ds",
      "score": 0,
      "created_utc": 1752781963.0,
      "replies": [
        {
          "id": "n3pi4z5",
          "author": "Neo_Techni",
          "body": "it will not.",
          "score": 3,
          "created_utc": 1752788413.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m5kzz",
      "author": "lisaluvr",
      "body": "looks cool but that price is wild. apple really said fold and empty your wallet lol",
      "score": 0,
      "created_utc": 1752753259.0,
      "replies": [
        {
          "id": "n3m6ycj",
          "author": "Basickc",
          "body": "They want you to finance it through Apple Card 😂",
          "score": 0,
          "created_utc": 1752753782.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m3gbo",
      "author": "notedrive",
      "body": "Haven’t seen a foldable screen not have issues with breaking yet, hoping Apple gets it right.",
      "score": -4,
      "created_utc": 1752752420.0,
      "replies": [
        {
          "id": "n3m7anz",
          "author": "AverageJoeJohnSmith",
          "body": "This is nonsense. Samsung is on their 7th gen of the Flip and Fold and while I'm sure some people have had issues they are generally solid. I've had my Flip 5 since release and am rough on it and never had a single issue. Flipped open and closed tens of thousands of times probably and the screen is still like new",
          "score": 4,
          "created_utc": 1752753910.0,
          "replies": [
            {
              "id": "n3mabae",
              "author": "LolPandaMan",
              "body": "I work in tech repair and let me tell you..... The things I've seen",
              "score": -3,
              "created_utc": 1752755018.0,
              "replies": [
                {
                  "id": "n3olej2",
                  "author": "AverageJoeJohnSmith",
                  "body": "No one is saying it doesn't happen. I'm just saying it's not the majority of phones",
                  "score": 2,
                  "created_utc": 1752778977.0,
                  "replies": [
                    {
                      "id": "n3oqpdl",
                      "author": "LolPandaMan",
                      "body": "That's fine. Not sure why I'm getting down voted but anyways. You won't believe this but I'm at work right now and quoted someone for a repair on a flip. I'd say I'm averaging one bi weekly during my slow summer",
                      "score": 1,
                      "created_utc": 1752780503.0,
                      "replies": [
                        {
                          "id": "n3otkgx",
                          "author": "AverageJoeJohnSmith",
                          "body": "Why wouldn't I believe you? I'm sure they come in. I'm saying overall they are still not a bad or \"problem\" phone",
                          "score": 1,
                          "created_utc": 1752781340.0,
                          "replies": [
                            {
                              "id": "n3ounqj",
                              "author": "LolPandaMan",
                              "body": "I'm just conversing with you. I just thought it was ironic",
                              "score": 1,
                              "created_utc": 1752781655.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3maf2z",
              "author": "notedrive",
              "body": "All I can go off of is what I have seen. Searched on google for cracked foldable screens and it’s still an issue.",
              "score": -5,
              "created_utc": 1752755056.0,
              "replies": [
                {
                  "id": "n3mkf1l",
                  "author": "green_link",
                  "body": "Searched online for complaints and broken devices, found complaints and broken devices. Wow who would have thought /s\n\nI searched for \"iPhone broken screen\" and found multiple iPhones with broken screens. I can't believe it. I just don't think iPhones are worth it if all their displays just up and break like that. I'm hoping Samsung can get it right.",
                  "score": 4,
                  "created_utc": 1752758412.0,
                  "replies": []
                },
                {
                  "id": "n3ol814",
                  "author": "AverageJoeJohnSmith",
                  "body": "Sure if you are specifically looking for it you will find it, lol. but those complaints compared to the units sold is a small amount",
                  "score": 0,
                  "created_utc": 1752778925.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3mefub",
      "author": "kiss_my_what",
      "body": "Is that the before or after tarrif price?",
      "score": -1,
      "created_utc": 1752756455.0,
      "replies": [
        {
          "id": "n3mifvc",
          "author": "green_link",
          "body": "You know it will be before",
          "score": 1,
          "created_utc": 1752757777.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3odtns",
      "author": "ChillAMinute",
      "body": "The sheer hubris of Apple to believe people will buy a foldable device and for $2k.  I’d like to see marketing data that suggested the people are begging for this. Must be the same group that sold the R&D team the idea the Apple Vision would be a huge hit.  Guess they’re getting all of their new mobile device ideas from Samsung and Microsoft now.",
      "score": -1,
      "created_utc": 1752776822.0,
      "replies": [
        {
          "id": "n3ogol9",
          "author": "malman21",
          "body": "Foldables seem to be huge in Asia. While not as popular (yet?) in EU and NA, perhaps this product helps prevent folks from leaving the ecosystem, or attracts folks in the Asian market to jump back on board with Apple? \n\nThey haven’t given up on their stupid VR headset, and I think a foldable phone would be a much more well received product than that headset. \n\nHowever, the tech with foldable phones increases so fast in Asia that, I doubt Apple would want to keep up, considering they’re so slow.",
          "score": 5,
          "created_utc": 1752777645.0,
          "replies": [
            {
              "id": "n3pp7do",
              "author": "ChillAMinute",
              "body": "I mean there must be a reason right?  I know Apple believes they are market makers but they lost that spark around the iPhone X.  The entire mobile device industry has basically been homogenized by two players, with other niche manufacturers hanging on like Sony, Xiaomi, Oppo, Google, and Huawei. All feeling like the same handsets in different packaging. \n\nMaybe the time is ripe for a legitimate BlackBerry relaunch.  Something to shake up the industry.",
              "score": 2,
              "created_utc": 1752790601.0,
              "replies": [
                {
                  "id": "n3xei9y",
                  "author": "fundiedundie",
                  "body": "I think you’re underestimating Xiaomi’s global reach. \n\nhttps://www.counterpointresearch.com/insights/global-smartphone-share/",
                  "score": 2,
                  "created_utc": 1752891316.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3mew82",
      "author": "WumboChumbo-",
      "body": "Trash. Foldable phones are trash",
      "score": -6,
      "created_utc": 1752756607.0,
      "replies": [
        {
          "id": "n3mjhg6",
          "author": "None",
          "body": "[deleted]",
          "score": 1,
          "created_utc": 1752758114.0,
          "replies": [
            {
              "id": "n3mjrgp",
              "author": "WumboChumbo-",
              "body": "Do you like creases on your screens, lol?",
              "score": -1,
              "created_utc": 1752758204.0,
              "replies": [
                {
                  "id": "n3mk1cg",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1752758291.0,
                  "replies": [
                    {
                      "id": "n3mk539",
                      "author": "WumboChumbo-",
                      "body": "Buddy I’ve seen the new folds in bestbuy. Trust me. the crease is still there full force.",
                      "score": -1,
                      "created_utc": 1752758325.0,
                      "replies": [
                        {
                          "id": "n3mkvvr",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1752758561.0,
                          "replies": [
                            {
                              "id": "n3mkzn9",
                              "author": "WumboChumbo-",
                              "body": "Buddy foldable phones crease and break. This is known. Go simp for huawei somewhere else",
                              "score": 1,
                              "created_utc": 1752758595.0,
                              "replies": [
                                {
                                  "id": "n3mlets",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 1,
                                  "created_utc": 1752758728.0,
                                  "replies": [
                                    {
                                      "id": "n3mlk7a",
                                      "author": "WumboChumbo-",
                                      "body": "Pot meet kettle",
                                      "score": 1,
                                      "created_utc": 1752758774.0,
                                      "replies": [
                                        {
                                          "id": "n3mlrr4",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 1,
                                          "created_utc": 1752758840.0,
                                          "replies": [
                                            {
                                              "id": "n3mm7py",
                                              "author": "WumboChumbo-",
                                              "body": "Hilarious considering I’ve only seen poors use foldable phones 😂",
                                              "score": 1,
                                              "created_utc": 1752758978.0,
                                              "replies": [
                                                {
                                                  "id": "n3mmckr",
                                                  "author": "None",
                                                  "body": "[deleted]",
                                                  "score": 1,
                                                  "created_utc": 1752759020.0,
                                                  "replies": [
                                                    {
                                                      "id": "n3mmlpr",
                                                      "author": "WumboChumbo-",
                                                      "body": "I just told you foldables are garbage. Regardless of how much they cost, why would I get one? You should put that creased screen to good use and brush up on your reading comprehension",
                                                      "score": 1,
                                                      "created_utc": 1752759100.0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "n3mmuus",
                                                      "author": "WumboChumbo-",
                                                      "body": "You’re boring. Hold this block.",
                                                      "score": 1,
                                                      "created_utc": 1752759178.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n3nke59",
                  "author": "Sunlightn1ng",
                  "body": "Honestly to me the crease on the fold7 demos aren't horrible - I don't see it interfering with my use of the phone\n\nThen again I also don't tend to notice when my glasses need cleaning until they're really dirty so I might just be blind and not representative",
                  "score": 1,
                  "created_utc": 1752768726.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3m35j6",
      "author": "None",
      "body": "[deleted]",
      "score": -3,
      "created_utc": 1752752298.0,
      "replies": [
        {
          "id": "n3mfql8",
          "author": "WumboChumbo-",
          "body": "And it’s been a steaming turd for 7 years too. I wouldn’t call them late to this considering this tech has been garbage",
          "score": -1,
          "created_utc": 1752756887.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m91xz",
      "author": "mchief101",
      "body": "2000 dollars? No wonder people are sticking to their current iphone for as long as possible….",
      "score": -3,
      "created_utc": 1752754563.0,
      "replies": [
        {
          "id": "n3mc3rs",
          "author": "thisischemistry",
          "body": "I'm sticking with my iPhone 13 mini until they come out with another mini or the phone dies. If there isn't another mini by the time it dies then I'm probably switching to *any* small form-factor phone, regardless of ecosystem.",
          "score": 4,
          "created_utc": 1752755656.0,
          "replies": []
        },
        {
          "id": "n3mhq4e",
          "author": "alc4pwned",
          "body": "That is just standard pricing for this style of foldable.",
          "score": 2,
          "created_utc": 1752757542.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mua9m",
      "author": "TheRacooning18",
      "body": "Aint even released and already DOA.\nI dunno why people still buy from that clown company.",
      "score": 0,
      "created_utc": 1752761420.0,
      "replies": []
    },
    {
      "id": "n3n1gvh",
      "author": "GivMHellVetica",
      "body": "So Apple is incapable of innovation any longer. They are no longer dreamers, they wait to see what other companies are doing, then “Apple it up a bit” and put a premium price tag on it.  \n\nHope that works for them.",
      "score": 0,
      "created_utc": 1752763458.0,
      "replies": []
    },
    {
      "id": "n3ncp9h",
      "author": "RegJohn2",
      "body": "Getting this on launch and no one can stop me. I’m an adult",
      "score": 0,
      "created_utc": 1752766587.0,
      "replies": []
    },
    {
      "id": "n3nmmd6",
      "author": "hjeff51",
      "body": "Annnnd people will but it. And theeeeeennnnnn, expect all phones to priced at 2k.",
      "score": 0,
      "created_utc": 1752769347.0,
      "replies": []
    },
    {
      "id": "n3tx4zj",
      "author": "Zachy_Boi",
      "body": "I can’t wait until they make a version that folds in half but is the same size as the iPhone when open so it’s just a little square in your pocket",
      "score": 0,
      "created_utc": 1752851903.0,
      "replies": []
    },
    {
      "id": "n3xv5ls",
      "author": "ArchonTheta",
      "body": "Ugh. Folding shit is dumb. So gimmicky",
      "score": 0,
      "created_utc": 1752898254.0,
      "replies": []
    },
    {
      "id": "n3m27z6",
      "author": "stdoubtloud",
      "body": "I struggle to find the real use case for \"fold\" phones. \"Flip\" phones, however, are awesome and I'll never buy a boring phone again.",
      "score": -4,
      "created_utc": 1752751909.0,
      "replies": [
        {
          "id": "n3m8yne",
          "author": "a_little_stupid",
          "body": "Exact opposite for me. I can not find a use for flip phones, but fold phones are awesome.",
          "score": 3,
          "created_utc": 1752754529.0,
          "replies": []
        },
        {
          "id": "n3m6tsm",
          "author": "AverageJoeJohnSmith",
          "body": "I'll never go back from a Flip. i bought it purely because I was sick of the big phones. Went from a S21 Ultra to the Flip 5 and just ordered the Flip 7 because by battery life is starting to noticeably decline. otherwise I would have kept rockin the 5. \n\n\nIf I had a \"professional\" or corporate job maybe the fold would benefit me, I could see uses for it. but I just want a smaller phone",
          "score": 1,
          "created_utc": 1752753734.0,
          "replies": [
            {
              "id": "n3onzlt",
              "author": "ChaosNomad",
              "body": "I’m rocking an iPhone 13 mini for that reason. TBH, I’m not as stoked about the thickness of flip phones, but I can live with it as long as the phone doesn’t take up my entire pocket.",
              "score": 0,
              "created_utc": 1752779719.0,
              "replies": [
                {
                  "id": "n3otwnk",
                  "author": "AverageJoeJohnSmith",
                  "body": "The new fold is thinner than the iPhone when folded. and the zflip I'm not exactly sure but would assume not much of a difference. Samsung is getting these phones pretty thin, even when folded",
                  "score": 1,
                  "created_utc": 1752781439.0,
                  "replies": [
                    {
                      "id": "n3oww4x",
                      "author": "ChaosNomad",
                      "body": "Except it’s still not thinner than my current iPhone when folded. \n\nThe new Fold 7 is about 9mm when folded and my current iPhone is approximately 7.5mm thickness. \n\nI’m fine with taking a slight bump in thickness, but it’s also not truly thinner. This also gets more noticeable as I’m someone who likes to use cases/screen protectors which adds additional thickness.",
                      "score": 0,
                      "created_utc": 1752782293.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3m8p3y",
          "author": "KaladonHush",
          "body": "As someone who works IT a fold would work great for cases where I need more screen than a regular phone but less than a laptop (like a quick remote connection for a simple fix)",
          "score": 1,
          "created_utc": 1752754431.0,
          "replies": []
        },
        {
          "id": "n3ml3x5",
          "author": "green_link",
          "body": "What I like about the fold is the option of using the bigger display for when I need it, like watching videos of showing pictures. And I can use the smaller/regular size outside display like a normal phone for most of the time. Flip style the outer displays are too cramped to do anything really and you're constantly opening the phone to do just about anything on the phone. Yes Motorola has done great things with their outer display and yes Samsung is now catching up, I just don't think it's as productive or as useful as a full/regular display",
          "score": 1,
          "created_utc": 1752758632.0,
          "replies": [
            {
              "id": "n3p9jqs",
              "author": "stdoubtloud",
              "body": "It is personal opinion, but I find the Razr external display to be great. My phone sits on my desk all day, closed. It is perfect for my RSA app, perfect for music and audible, and adequate for email, messages and, believe it or not, Reddit. Anything else I open it up but while I'm at work, that is all I need. I only tend to open up my phone about 10 times a day.",
              "score": 1,
              "created_utc": 1752785873.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3mhn0u",
      "author": "Craig1974",
      "body": "LOL. There are better things to spend $2,000 on than an iPhone. \nA nice laptop, a mini vacation...",
      "score": -4,
      "created_utc": 1752757514.0,
      "replies": []
    },
    {
      "id": "n3lyxlg",
      "author": "ive_got_the_narc",
      "body": "Neat!",
      "score": -3,
      "created_utc": 1752750487.0,
      "replies": []
    },
    {
      "id": "n3me376",
      "author": "BacktotheTruther",
      "body": "Who wants this? The same people that bought Appolus Rift?",
      "score": -2,
      "created_utc": 1752756337.0,
      "replies": [
        {
          "id": "n3nezle",
          "author": "Kharax82",
          "body": "Well ~17million foldable phone units were sold in 2024, so there’s a market for them. It’s just a more niche product",
          "score": 2,
          "created_utc": 1752767214.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mir0c",
      "author": "jordanscollected",
      "body": "No one wants this cumbersome phone.",
      "score": -2,
      "created_utc": 1752757878.0,
      "replies": []
    },
    {
      "id": "n3mkqkl",
      "author": "Haunting_Lobster_888",
      "body": "I really don't get the appeal of foldable phones. Sure it's a bigger screen but it just becomes a smaller tablet that's annoying to hold for extended periods of time.",
      "score": -3,
      "created_utc": 1752758514.0,
      "replies": []
    },
    {
      "id": "n3mm0gg",
      "author": "Alternative-Juice-15",
      "body": "I don’t get why people want a phone that folds?  Can anyone explain?",
      "score": -2,
      "created_utc": 1752758914.0,
      "replies": [
        {
          "id": "n3mr9rr",
          "author": "iDarkville",
          "body": "Customers are stupid and companies want that stupid money.",
          "score": -1,
          "created_utc": 1752760527.0,
          "replies": []
        },
        {
          "id": "n3mu5nv",
          "author": "showmethebooty1",
          "body": "It’s simple, bigger screen. That’s like asking why do people want 85 inch TV’s. \n\nIt’s not really about the fact the phone can “fold” it’s about having a tablet size screen that can fit in your pocket.",
          "score": 0,
          "created_utc": 1752761382.0,
          "replies": [
            {
              "id": "n3njejg",
              "author": "Alternative-Juice-15",
              "body": "It isn’t like that at all but ok",
              "score": 2,
              "created_utc": 1752768448.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3mo6ud",
      "author": "ColinKennethMills",
      "body": "Did I miss companies managing to make a folding screen that isn’t a gimmick? \n\nOr is this just for people who only expect a year of durability from their devices?",
      "score": -2,
      "created_utc": 1752759591.0,
      "replies": [
        {
          "id": "n3n6617",
          "author": "InsaneNinja",
          "body": "I’ve never broken my phone. I can’t imagine that this will be much different. I’m at minimum assuming that Apple was avoiding the “delicate hinge“ years that Samsung was beta testing.\n\nThis also doesn’t seem like the price range of people who keep their devices for seven years.",
          "score": 1,
          "created_utc": 1752764766.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mt9ar",
      "author": "SleepyCorgiPuppy",
      "body": "My family uses a lot of Apple products but how will someone use this.  Still too small for work, sucks to watch a movie with a divider in between, too big to fit in pocket.",
      "score": -2,
      "created_utc": 1752761118.0,
      "replies": [
        {
          "id": "n3n6rh8",
          "author": "InsaneNinja",
          "body": "Divider? Why would it have a divider? \nAnd it’s going to be the same size as a max when in a pocket. \n\nYou should really look at what the fold 7 looks like.",
          "score": 2,
          "created_utc": 1752764934.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m29ba",
      "author": "misterhansen",
      "body": "Sooo just a worse Fold 7 for a higher price?\n\nAs expected.\n\nEdit: Cope and seeth!",
      "score": -6,
      "created_utc": 1752751924.0,
      "replies": [
        {
          "id": "n3mrm4m",
          "author": "itsaride",
          "body": "It'll run iOS (or foldOS™) so will already be better than ANY Android phone.\n\n< Downvotes go here",
          "score": 0,
          "created_utc": 1752760629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m4nyc",
      "author": "Cavalier1706",
      "body": "Yeah.. have fun with that..",
      "score": -3,
      "created_utc": 1752752907.0,
      "replies": []
    },
    {
      "id": "n3m5a1f",
      "author": "imcalledgpk",
      "body": "Apple will say that they pioneered the foldable phone.",
      "score": -3,
      "created_utc": 1752753143.0,
      "replies": []
    },
    {
      "id": "n3lzwp4",
      "author": "x_Carlos_Danger_x",
      "body": "lol fuck that. I’m at the point where I just want a bare bones phone and I’ll buy an actual camera. No reason to spend so much money on a phone when both my laptop and PC run circles around it and a proper camera will smoke it in photography. $2k is lest than I spent on my first gaming PC lol",
      "score": -6,
      "created_utc": 1752750922.0,
      "replies": [
        {
          "id": "n3m0qyb",
          "author": "Ziakel",
          "body": "Then don’t spend money and use a bare bone phone. No one is forcing you to buy a $2k phone",
          "score": 12,
          "created_utc": 1752751285.0,
          "replies": []
        },
        {
          "id": "n3mg770",
          "author": "Skika",
          "body": "So do it. Bare bones phones still exist, so do cameras.",
          "score": 2,
          "created_utc": 1752757038.0,
          "replies": []
        },
        {
          "id": "n3m5swp",
          "author": "NotRonaldKoeman",
          "body": "are redditors the only group of people who get angry over hearing about something nobody’s forcing them to get? oh right.. toddlers, they also act like that too. everyone here NEEDS to have an opinion on something, the most obnoxious group of people",
          "score": 2,
          "created_utc": 1752753343.0,
          "replies": []
        },
        {
          "id": "n3m17mg",
          "author": "danielv123",
          "body": "Since we are talking apple, there are serious doubts on whether your laptop runs rings around it. I have no idea why they put such fast CPUs in their phones.",
          "score": -1,
          "created_utc": 1752751483.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m49td",
      "author": "probhittingonu",
      "body": "Horrible",
      "score": -4,
      "created_utc": 1752752752.0,
      "replies": []
    },
    {
      "id": "n3mbnn5",
      "author": "madmanx33",
      "body": "Doesnt even compete with the fold 7 screen size",
      "score": -1,
      "created_utc": 1752755500.0,
      "replies": []
    },
    {
      "id": "n3mcbzf",
      "author": "No_Rent7598",
      "body": "Yeah 2k is better spent on bills than this",
      "score": -1,
      "created_utc": 1752755736.0,
      "replies": []
    },
    {
      "id": "n3meqch",
      "author": "PurringWolverine",
      "body": "lol 😂",
      "score": -1,
      "created_utc": 1752756552.0,
      "replies": []
    },
    {
      "id": "n3mjqlq",
      "author": "ElsewhereExodus",
      "body": "They missed an opportunity by not calling it the iFold.",
      "score": -1,
      "created_utc": 1752758196.0,
      "replies": []
    },
    {
      "id": "n3mp1zj",
      "author": "Typical80sKid",
      "body": "I had an iPhone 6 Plus that could fold and it was only like $500!",
      "score": -1,
      "created_utc": 1752759858.0,
      "replies": []
    },
    {
      "id": "n3ms9rw",
      "author": "joeymonreddit",
      "body": "Wasn’t the iPhone 6 already a folding iPhone?",
      "score": -1,
      "created_utc": 1752760823.0,
      "replies": []
    },
    {
      "id": "n3mssze",
      "author": "Ruttagger",
      "body": "Classic Apple, 5 years late to the party.",
      "score": -1,
      "created_utc": 1752760983.0,
      "replies": []
    },
    {
      "id": "n3my4tb",
      "author": "CapaAbsurda",
      "body": "I read: “Apple’s first affordable iPhone…”",
      "score": -1,
      "created_utc": 1752762525.0,
      "replies": []
    },
    {
      "id": "n3myyp4",
      "author": "Traghorn",
      "body": "Now that Steve’s gone, it can move on from being “just a phone”, hopefully - please grant users more tools for making the gadget useful, and less engineer-defined gadgetry - I am soo tired of techie paradigms since the ‘80’s.  Let these tools sing!",
      "score": -1,
      "created_utc": 1752762759.0,
      "replies": []
    },
    {
      "id": "n3nzyor",
      "author": "MichaelAuBelanger",
      "body": "My 10 works just fine.",
      "score": -1,
      "created_utc": 1752772987.0,
      "replies": []
    },
    {
      "id": "n3s9wp3",
      "author": "Jason4fl",
      "body": "Wheres all the Eskimos boycotting US products at.. Better not see 1 in your hand",
      "score": -1,
      "created_utc": 1752829552.0,
      "replies": [
        {
          "id": "n48cbic",
          "author": "fake-name-here1",
          "body": "Ah yes, all these US made iPhone can stay down there",
          "score": 1,
          "created_utc": 1753045768.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m4g0r",
      "author": "RedneckChEf88",
      "body": "First fold model and already charging more than a galaxy z fold..... typical crapple.....",
      "score": -8,
      "created_utc": 1752752820.0,
      "replies": [
        {
          "id": "n3m9plb",
          "author": "cmasontaylor",
          "body": "No, they’re charging the same as the Z Fold. The Flip is cheaper, but it’s half the size.",
          "score": 4,
          "created_utc": 1752754801.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m0z9d",
      "author": "zarafff69",
      "body": "Looks great!! Can’t wait!!",
      "score": -2,
      "created_utc": 1752751386.0,
      "replies": []
    },
    {
      "id": "n3m75d9",
      "author": "No-Ambition7750",
      "body": "Nope, nope and nope.",
      "score": -2,
      "created_utc": 1752753855.0,
      "replies": []
    },
    {
      "id": "n3m7vf4",
      "author": "arqulane",
      "body": "Wow, that's a lot of money for a phone! 😅",
      "score": -2,
      "created_utc": 1752754128.0,
      "replies": [
        {
          "id": "n3miog4",
          "author": "ToMorrowsEnd",
          "body": "I see someone hasnt looked at what Android phones go for.  Samsung folding phone flagship will be even more.",
          "score": 3,
          "created_utc": 1752757855.0,
          "replies": [
            {
              "id": "n3mx8a6",
              "author": "chronoswing",
              "body": "It's $1800.",
              "score": 1,
              "created_utc": 1752762268.0,
              "replies": [
                {
                  "id": "n3nzycu",
                  "author": "arqulane",
                  "body": "🩷",
                  "score": 1,
                  "created_utc": 1752772985.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3m95n0",
      "author": "richcournoyer",
      "body": "It's just a glorified flip phone… Think about that…",
      "score": -2,
      "created_utc": 1752754601.0,
      "replies": []
    },
    {
      "id": "n3m97ro",
      "author": "SlowFootJo",
      "body": "Apple has jumped the shark",
      "score": -2,
      "created_utc": 1752754623.0,
      "replies": []
    },
    {
      "id": "n3ma5h7",
      "author": "AtTheGates",
      "body": "![gif](giphy|GpyS1lJXJYupG)",
      "score": -2,
      "created_utc": 1752754961.0,
      "replies": []
    },
    {
      "id": "n3maywb",
      "author": "Punch_Your_Facehole",
      "body": "I would bet that if Jobs were still around, he'd hate this.",
      "score": -2,
      "created_utc": 1752755254.0,
      "replies": [
        {
          "id": "n3miqxp",
          "author": "green_link",
          "body": "He would hate everything that apple is today",
          "score": -2,
          "created_utc": 1752757877.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mb4hu",
      "author": "manyeggplants",
      "body": "I'm so glad they will all have invented the foldable phone and all the credit for the \"new\" features coming will go to Apple!",
      "score": -2,
      "created_utc": 1752755310.0,
      "replies": []
    },
    {
      "id": "n3md63w",
      "author": "Good_Intention_9232",
      "body": "Another lawsuit coming from Samsung, what is going on at Apple is there R&D research there, increase the dividend then.",
      "score": -2,
      "created_utc": 1752756024.0,
      "replies": [
        {
          "id": "n3msecp",
          "author": "iDarkville",
          "body": "Samsung stole their ideas from the iPhone so what’s this revisionism?",
          "score": 1,
          "created_utc": 1752760861.0,
          "replies": []
        },
        {
          "id": "n3n359h",
          "author": "SUPRVLLAN",
          "body": "You know Apple buys Samsung displays right? As in, they’re partners that work together daily on screens.",
          "score": 1,
          "created_utc": 1752763931.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3mf1gm",
      "author": "Narrow_Ad_1494",
      "body": "Why is everyone surprised. This has been apples mo from day one steal and increase profit margins. I’m not singling them out, then Microsoft usually follows with a crappier yet cheaper version.",
      "score": -2,
      "created_utc": 1752756655.0,
      "replies": [
        {
          "id": "n3midyh",
          "author": "green_link",
          "body": "Microsoft already came out with 2 foldable phones years ago, surface duo and duo 2. Samsung has had almost 14 in the past 7 years, Motorola has  5, and Google has at 1 currently and a new one coming soon.\nIf anything it's apple that will have  the crappier copy at the most expensive price with the shittiest OS",
          "score": -2,
          "created_utc": 1752757760.0,
          "replies": [
            {
              "id": "n3ms5lb",
              "author": "iDarkville",
              "body": "I have yet to see an android not have multiple hiccups during daily use where an iPhone just breezes by it. \n\nI say this as someone looking for a good device that will replace my iPhone. I want the damned thing to work without fiddling or AI faking my pictures or . . . Know what?  I’ll stop the list there. \n\nI get frustrated at this incessant talking about Android like it’s so much better when it’s just a fidget spinner for “tech” people. Note the quotations. I’m not insulting actual people in tech.",
              "score": 3,
              "created_utc": 1752760789.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3mjsqj",
      "author": "Tackit286",
      "body": "I can guaranfuckingtee you Apple doesn’t make a fold phone ever.",
      "score": -2,
      "created_utc": 1752758215.0,
      "replies": []
    },
    {
      "id": "n3ml62b",
      "author": "Illustrious-Bee4402",
      "body": "This is what happens when there’s no vision left in the Company",
      "score": -2,
      "created_utc": 1752758651.0,
      "replies": []
    },
    {
      "id": "n3mqcx9",
      "author": "PositiveUse",
      "body": "But why? Who’s asking for this ?",
      "score": -1,
      "created_utc": 1752760252.0,
      "replies": []
    },
    {
      "id": "n3mr4vc",
      "author": "iDarkville",
      "body": "Ugh. A folding phone is like a grandpa refusing to move away from his early flip-phone. \n\nThis is hopefully an option and not a mainline feature on any new version.",
      "score": -2,
      "created_utc": 1752760486.0,
      "replies": []
    },
    {
      "id": "n3muuui",
      "author": "bezerko888",
      "body": "Gimmick",
      "score": -2,
      "created_utc": 1752761588.0,
      "replies": []
    },
    {
      "id": "n3mvckp",
      "author": "link_shady",
      "body": "2k?……. Man shit expensive as hell….. if I have the money at launch I probably will…. But still ouch",
      "score": -2,
      "created_utc": 1752761729.0,
      "replies": []
    },
    {
      "id": "n3mvw02",
      "author": "IdontneedtoBonreddit",
      "body": "Great!  More space for cluttered mid-2000's design! It'll look great in 3 monthes when the middle fold starts to fail!",
      "score": -2,
      "created_utc": 1752761885.0,
      "replies": []
    },
    {
      "id": "n3mxgv5",
      "author": "Drekdyr",
      "body": "No telephoto lens lol... $2k usd",
      "score": -2,
      "created_utc": 1752762335.0,
      "replies": []
    },
    {
      "id": "n3mxvw0",
      "author": "Virel_360",
      "body": "It’s not even about the price, I’m gonna pass on this as I don’t think foldable phones are for me. It’s just a gimmick.",
      "score": -2,
      "created_utc": 1752762454.0,
      "replies": []
    },
    {
      "id": "n3m0qjm",
      "author": "Browncat374",
      "body": "I don’t think I’m on board for this one Apple. I would really rather see a IPhone that protects my security and is not constantly looking into everything I do “for my convenience”. \n\nThat’s a no from me dawg…",
      "score": -3,
      "created_utc": 1752751280.0,
      "replies": [
        {
          "id": "n3n3jlw",
          "author": "SUPRVLLAN",
          "body": "Good thing Apple is known for privacy and has specifically made it one of their core selling features as their business model isn’t reliant on data harvesting for advertisements. Did you mean Google?",
          "score": 1,
          "created_utc": 1752764041.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3m1l0b",
      "author": "PrinceCastanzaCapone",
      "body": "No thank you",
      "score": -3,
      "created_utc": 1752751641.0,
      "replies": []
    },
    {
      "id": "n3m90qm",
      "author": "Fancyness",
      "body": "As expensive as a high end PC...no thanks",
      "score": -3,
      "created_utc": 1752754550.0,
      "replies": [
        {
          "id": "n3miutm",
          "author": "ToMorrowsEnd",
          "body": "LOL.  Maybe a base level Gaming pc and certianly not even close to high end.\n\nShit my video card alone was close to $2K.",
          "score": 3,
          "created_utc": 1752757912.0,
          "replies": [
            {
              "id": "n3mswke",
              "author": "iDarkville",
              "body": "Hilarious. Yet on gaming subs the PC guys will lie their asses off about how PC gaming is cost-comparable to consoles.",
              "score": 1,
              "created_utc": 1752761013.0,
              "replies": [
                {
                  "id": "n3n777o",
                  "author": "ToMorrowsEnd",
                  "body": "Whats even more hilarious is my work PC has a $6000 video card.  The pro level stuff makes gamer cards look like toys for poors.",
                  "score": 1,
                  "created_utc": 1752765057.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3mbmv8",
      "author": "airjordanballa20",
      "body": "I have a hard time understanding the logic of a 5.5 inch front display. Most larger phones are in the 6.5 to 6.9 inch front display range. The phone isn’t going to even be usable for most people unless you fold it out.\n\nI’d much prefer a smaller clamshell design that folds out to a standard iPhone Pro Max screen size - similar to the Z Fold 4.\n\nRegardless, 5.5 inch front screen makes zero sense.",
      "score": -3,
      "created_utc": 1752755493.0,
      "replies": []
    }
  ]
}