{
  "post": {
    "title": "Fairphone 6 is switching to a new design that's even more sustainable",
    "author": "a_Ninja_b0y",
    "id": "1lj53uy",
    "score": 539,
    "created_utc": 1750751424.0,
    "selftext": "",
    "num_comments": 31,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lj53uy/fairphone_6_is_switching_to_a_new_design_thats/"
  },
  "comments": [
    {
      "id": "mzhey4t",
      "author": "_Techno_",
      "body": "I like that they coincidentally started selling overpriced wireless headphones after they removed the headphone jack.",
      "score": 222,
      "created_utc": 1750757422.0,
      "replies": [
        {
          "id": "mzhnflb",
          "author": "Galwadan",
          "body": "There are only signs no coincidence.",
          "score": 60,
          "created_utc": 1750762032.0,
          "replies": []
        },
        {
          "id": "mzihw0q",
          "author": "HRudy94",
          "body": "Yep no jack no buy for me neither.\nYou can't call yourself a \"fair\" and \"ecological\" phone yet advocate for more e-waste and removal of consumer features.",
          "score": 61,
          "created_utc": 1750773480.0,
          "replies": [
            {
              "id": "mzke33g",
              "author": "vortexmak",
              "body": "Exactly.  lost interest in them completely after that stunt",
              "score": 7,
              "created_utc": 1750792695.0,
              "replies": [
                {
                  "id": "mzqmbnw",
                  "author": "Sea_Cycle_909",
                  "body": "fr",
                  "score": 1,
                  "created_utc": 1750874677.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mznrbb4",
          "author": "Elephant789",
          "body": "How come?",
          "score": -1,
          "created_utc": 1750837057.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzhjm65",
      "author": "gbzcngb",
      "body": "I'm still salty over the Fairphone 4 that had constant software related issues with basic phone functions like calls randomly muting and microphone quality and despite multiple bug reports nothing was ever fixed. \n\n\nIt's the same issues facing Framework now, they focus a lot on the hardware and design but the BIOS support is not good.\n\n\nThese companies need to realise that software support is just as important as hardware.",
      "score": 102,
      "created_utc": 1750760062.0,
      "replies": [
        {
          "id": "mzk5c69",
          "author": "G8M8N8",
          "body": "I have a Framework Laptop 13 and am not familiar with the BIOS issues you mention",
          "score": 17,
          "created_utc": 1750790188.0,
          "replies": [
            {
              "id": "mzklzam",
              "author": "gbzcngb",
              "body": "Look in the Framework forums, lots of issues with the FW13 BIOS for the AMD boards. Constant back and forth over several releases trying to just get their battery saver feature working. \n\n\nNot to mention people with FW16 feeling abandoned without a BIOS update in like a year.",
              "score": 2,
              "created_utc": 1750795100.0,
              "replies": [
                {
                  "id": "mzlgmun",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 3,
                  "created_utc": 1750804215.0,
                  "replies": [
                    {
                      "id": "mzlkve7",
                      "author": "gbzcngb",
                      "body": "Hopefully it improves as the business expands, at the moment I assume it's a very small team taking care of that stuff.",
                      "score": 0,
                      "created_utc": 1750805622.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzhmkpy",
          "author": "zwiftys",
          "body": "For what it's worth I'm on the Fairphone 5 and I'm not really having any bugs. \n\nIs it the fastest phone? No. Is the camera amazing? Fuck No. \n\nBut it's a good enough phone for my use cases with no real software issues (yet)",
          "score": 8,
          "created_utc": 1750761603.0,
          "replies": [
            {
              "id": "mzhnuqr",
              "author": "gbzcngb",
              "body": "I would have been happy to stick with mine of it functioned as a phone but it always had issues and they kept saying it would be fixed in future updates but it never was. \n\n\nAnd then the only solution was to buy a new one because the part that might have been a fault, the microphones, couldn't be replaced separately because they're built into the frame (there's like 3 of them or something) and their solution to that was to replace the whole phone, which I feel goes a bit against the whole e-waste premise.",
              "score": 10,
              "created_utc": 1750762236.0,
              "replies": [
                {
                  "id": "mzhobbp",
                  "author": "zwiftys",
                  "body": "Yeah. That sucks and undermines the entire purpose really.",
                  "score": 6,
                  "created_utc": 1750762451.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzmqf5r",
          "author": "sproctor",
          "body": "The bios on framework is fine. It's not perfect, but it works. I've had some charging issues with earlier versions, but they've worked most of the bugs out now. The buggy thing was bios limited charging and adaptive charging. I haven't seen that on another laptop.",
          "score": 2,
          "created_utc": 1750819748.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzh6s2s",
      "author": "Forsaken-I-Await",
      "body": "Interesting concept when it first was debuted. I’m glad it’s actually getting the attention it deserves and I really hope it takes off!",
      "score": 18,
      "created_utc": 1750752520.0,
      "replies": [
        {
          "id": "mzhf61d",
          "author": "tomtv90",
          "body": "I also hope it takes off and parts or even future upgrades (hopium?) will be readily available. Really tempted to make the switch once my samsung finally gives out. It looks good and specs seem decent enough.",
          "score": 4,
          "created_utc": 1750757551.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzhiyu7",
      "author": "dominjaniec",
      "body": "still no jack? thus, no mony from me. at least, there is a SD slot...",
      "score": 33,
      "created_utc": 1750759703.0,
      "replies": [
        {
          "id": "mzke8cx",
          "author": "vortexmak",
          "body": "No idea when they will get rid of the micro SD too.\nMight be better to go with the S10 instead",
          "score": 3,
          "created_utc": 1750792737.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzi01ct",
      "author": "51dux",
      "body": "It would be cool if they also switched to selling it in Canada as well xD just saying.",
      "score": 7,
      "created_utc": 1750767395.0,
      "replies": []
    },
    {
      "id": "mzhxvu5",
      "author": "LittleTXBigAZ",
      "body": "I really want to support this, but Fairphone's lack of US support AND the constant call issues I had when I tried the FP5 have me turned off of this project. It's a damn shame because the concept is amazing.",
      "score": 8,
      "created_utc": 1750766560.0,
      "replies": []
    },
    {
      "id": "mzheo40",
      "author": "Annales-NF",
      "body": "Do we know what is the water protect level?",
      "score": 3,
      "created_utc": 1750757261.0,
      "replies": [
        {
          "id": "mzo2e5m",
          "author": "RDGamerITA",
          "body": "its IP55",
          "score": 3,
          "created_utc": 1750843684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzhd13z",
      "author": "BrotherRoga",
      "body": "Hm, might know what phone I get next to replace this OnePlus...",
      "score": 5,
      "created_utc": 1750756294.0,
      "replies": []
    },
    {
      "id": "mzj1p05",
      "author": "geeeman5510",
      "body": "The biggest problem for this phone is just like every phone not on the att Verizon and not on T-Mobile I can't go to my carrier store and pick up this phone knowing it's going to work with my carrier same problem One plus has same problem than nothing phone has \n\nHere in America we need more phones from other companies that are not Motorola Samsung Apple or Google in the store for us to pick from \n\n\nHard for people to shout out seven eight $900 Right off the bat not really knowing if these phones are going to work on their carrier or not how to set them up on their carrier if it was with the carrier at the cell phone store you pick up the phone they activated the phone 100% works",
      "score": 3,
      "created_utc": 1750779155.0,
      "replies": []
    },
    {
      "id": "mzh7z3z",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1750753234.0,
      "replies": [
        {
          "id": "mzh84gj",
          "author": "a_Ninja_b0y",
          "body": "There is no other post regarding the topic in the sub.",
          "score": 8,
          "created_utc": 1750753323.0,
          "replies": [
            {
              "id": "mzh9tmi",
              "author": "None",
              "body": "[deleted]",
              "score": 4,
              "created_utc": 1750754360.0,
              "replies": [
                {
                  "id": "mzha77j",
                  "author": "a_Ninja_b0y",
                  "body": "No issue mate, it's all good",
                  "score": 7,
                  "created_utc": 1750754589.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mziwqo3",
      "author": "Trang0ul",
      "body": "Seems like resurrected [Ara](https://en.wikipedia.org/wiki/Project_Ara), the older concept of a modular phone killed by Google.",
      "score": 1,
      "created_utc": 1750777761.0,
      "replies": []
    },
    {
      "id": "mzk1ko3",
      "author": "unematti",
      "body": "I'd really like to see them making a chassis and later the new model would just be the motherboard switched out. Yeah, battery change is nice... But with a little bit of hassle, you can do that in a galaxy phone with a hairdryer. And since it's once every couple years, it's not really a problem in my opinion.",
      "score": 1,
      "created_utc": 1750789122.0,
      "replies": []
    },
    {
      "id": "mzlspge",
      "author": "mauricioszabo",
      "body": "I have a Fairphone 4. It's simply not worth it.\n\nBattery life is atrocious and the lack of headphone jack is complicated. Camera is not that good, either. But the \"fair\" part shows, somehow: camera API have RAW support, the OS is not bloated, and I feel the OS is less buggy somehow.\n\nBut still, way too expensive for the hardware, and I feel the screen scratches just by looking at it wrong.",
      "score": 1,
      "created_utc": 1750808149.0,
      "replies": []
    },
    {
      "id": "mzh5su6",
      "author": "Fancy-Pair",
      "body": "I thought this project had died",
      "score": -10,
      "created_utc": 1750751942.0,
      "replies": []
    }
  ]
}