{
  "post": {
    "title": "Google Assistant Is Basically on Life Support and Things Just Got Worse | Lots of Google Home users say they can't even turn their lights on or off right now.",
    "author": "chrisdh79",
    "id": "1mbk6yi",
    "score": 2289,
    "created_utc": 1753718562.0,
    "selftext": "",
    "num_comments": 446,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mbk6yi/google_assistant_is_basically_on_life_support_and/"
  },
  "comments": [
    {
      "id": "n5mo7i8",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753718566.0,
      "replies": []
    },
    {
      "id": "n5mqded",
      "author": "MinusBear",
      "body": "Regularly Gemini will just be like \"oh your light doesn't support this feature\" even though it's a feature I use every day. Check the input, it heard me correctly, it just decided to not understand it. It becomes quite inconsistent. I've had to fight with it about a few features where it swears it can't do something I know it can.",
      "score": 756,
      "created_utc": 1753719175.0,
      "replies": [
        {
          "id": "n5muz5v",
          "author": "rt590",
          "body": "Turn living room lights to orange \"light doesn't support this feature\"\nTurn living room lights to orange \"ok I've turned...\"\n\nI've been dealing with this the last couple of days lol",
          "score": 343,
          "created_utc": 1753720498.0,
          "replies": [
            {
              "id": "n5mxzrb",
              "author": "ZachTheCommie",
              "body": "Yup. It's been happening for months for me. Random devices remove themselves from rooms, or remove themselves from Home altogether. It really sucks because we live with my disabled father in law, and Google Home has been an invaluable accessability tool. And I can't even call customer support because Google sucks as a company now and there is no customer support, and there's a half dozen different brands of devices connected, so there's no central entity to consult, anyway.",
              "score": 140,
              "created_utc": 1753721352.0,
              "replies": [
                {
                  "id": "n5o89dx",
                  "author": "Val_Killsmore",
                  "body": "\n>It really sucks because we live with my disabled father in law, and Google Home has been an invaluable accessability tool. \n\nI'm in the same boat. I'm disabled and use Google Home. It really is a great accessibility tool. My apartment doesn't have a main central light except in the kitchen and bathroom. I have to use lamps in the living room and bedroom if I want light in those rooms. I have smart bulbs. There are times Google doesn't even do the commands I've programmed and used for years. I constantly have to repeat myself. \n\nI also had to change the names of every Chromecast/Google TV/light if the names include the room they're in. I have a lamp in the kitchen with a smart bulb and named it Kitchen Lamp. I used to be able to turn it on just fine. Now, Google tries to turn on everything in the kitchen instead of just the light. It's frustrating. I shouldn't have to do workarounds to get the devices working that have been working fine for years.",
                  "score": 42,
                  "created_utc": 1753734330.0,
                  "replies": [
                    {
                      "id": "n5q3uqh",
                      "author": "ktpr",
                      "body": "If you can, look into YoLink. It's local to your network and will outlast the company. It doesn’t use WiFi to communicate.",
                      "score": 19,
                      "created_utc": 1753756297.0,
                      "replies": [
                        {
                          "id": "n5r32hf",
                          "author": "sblahful",
                          "body": "I never understood why so many of these services were designed only to work over WiFi. Robot vacuums too - all the logic required should be on board the tool itself.",
                          "score": 16,
                          "created_utc": 1753772504.0,
                          "replies": [
                            {
                              "id": "n6nbe4i",
                              "author": "hirscheyyaltern",
                              "body": "one reason and one reason only. our product usage is invaluable to them",
                              "score": 1,
                              "created_utc": 1754198155.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n5n0c7h",
                  "author": "nucking_futs_001",
                  "body": ">Random devices remove themselves from rooms,\n\nIt's helping you redecorate.",
                  "score": 14,
                  "created_utc": 1753721982.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5mzt14",
              "author": "Tribalbob",
              "body": "\"Can't do that until we verify your voice\"\n\nTHEN VERIFY IT, I JUST SPOKE.",
              "score": 35,
              "created_utc": 1753721841.0,
              "replies": [
                {
                  "id": "n5n5ig4",
                  "author": "Tupperwarfare",
                  "body": "“I’m afraid I can’t do that, Dave.”\n\n![gif](giphy|cl7sAq7d8IrihKOaW1)",
                  "score": 84,
                  "created_utc": 1753723386.0,
                  "replies": [
                    {
                      "id": "n5o0zf0",
                      "author": "ThePrussianGrippe",
                      "body": "“Open the porch bay windows, HAL.”",
                      "score": 23,
                      "created_utc": 1753732271.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n5ptwtz",
                  "author": "Hannibal_Leto",
                  "body": "Drink one verification can.",
                  "score": 2,
                  "created_utc": 1753752796.0,
                  "replies": [
                    {
                      "id": "n643xuo",
                      "author": "Anagoth9",
                      "body": "Mountain dew is for me and you",
                      "score": 1,
                      "created_utc": 1753938975.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5qqp1p",
              "author": "nagi603",
              "body": "For whole home automation, you might want to look into Home Assistant if you haven't already. It's open-source, with many official and 3rd party add-ons. Yes, voice too. And can be local-only so even if the whole project would get somehow stopped and declared illegal would still work.",
              "score": 6,
              "created_utc": 1753765902.0,
              "replies": []
            },
            {
              "id": "n5oln4u",
              "author": "Capt_Foxch",
              "body": "Place a few tools around the room when the lights turn orange and you can pretend youre at Home Depot",
              "score": 1,
              "created_utc": 1753738200.0,
              "replies": []
            },
            {
              "id": "n5piacq",
              "author": "trcomajo",
              "body": "I've noticed I have to say it exactly right - no mumbling, no scratchy throat, no low talk.",
              "score": 1,
              "created_utc": 1753748781.0,
              "replies": []
            },
            {
              "id": "n5pvfsb",
              "author": "UNHskuh",
              "body": "I have this issue with my Alexa TV also. \"Turn off the TV in 45 minutes\", \"I cannot perform functions like turning off the TV\", say it again, \"ok, I'll turn off the TV in 45 minutes\"",
              "score": 1,
              "created_utc": 1753753331.0,
              "replies": []
            },
            {
              "id": "n5q0s7g",
              "author": "exeis-maxus",
              "body": "Alexa and Ring are just as bad at times. I used to tell Alexa to “arm the house” [when I leave the house] but then Alexa would often reply “cannot find a device named house”. I made sure to use the correct phase/commands but often it would not work.\n\nSince then I just use the Ring app on my phone and no longer bother with the voice commands… I  forgot the exact wording.",
              "score": 1,
              "created_utc": 1753755192.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5n73ln",
          "author": "The_JSQuareD",
          "body": "The trick is to turn Gemini off and just use regular old assistant. It doesn't forget about your light's 'features'.",
          "score": 74,
          "created_utc": 1753723816.0,
          "replies": [
            {
              "id": "n5p87v3",
              "author": "LamentableFool",
              "body": "How??\n\nSomehow my Note 9 is far to old to get any security or android updates but replacing the reliable Google assistant with this new AI shit is all good!",
              "score": 18,
              "created_utc": 1753745405.0,
              "replies": [
                {
                  "id": "n5srzk4",
                  "author": "domoincarn8",
                  "body": "Settings -> Google -> Search Assitance & Voice\n\nYou will find both Assitant and Gemini there. Disable Gemini.",
                  "score": 11,
                  "created_utc": 1753799407.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5oib6d",
              "author": "MinusBear",
              "body": "I honestly did not know this was possible.",
              "score": 10,
              "created_utc": 1753737198.0,
              "replies": []
            },
            {
              "id": "n5q5hby",
              "author": "rockofclay",
              "body": "I don't use Gemini, it still forgets features.",
              "score": 7,
              "created_utc": 1753756893.0,
              "replies": []
            },
            {
              "id": "n5ohsc7",
              "author": "roueGone",
              "body": "Oh snap I didn't know I could turn it off. Thanks! ",
              "score": 4,
              "created_utc": 1753737046.0,
              "replies": []
            },
            {
              "id": "n62blg7",
              "author": "UpsideClown",
              "body": "It ain't doing great either.",
              "score": 1,
              "created_utc": 1753915067.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5mx1ex",
          "author": "ElectronRotoscope",
          "body": "It really just doesn't seem like a good thing to use an LLM for since they famously do shit like this all the time, and it boggles my mind that Google pushes Gemini for stuff like that\n\n\nEDIT: for clarity I mean LLMs are famous for occasionally exhibiting unexpected behaviour, or in other words for sometimes giving a different result even when given the same input. Not exactly what I want in a light switch",
          "score": 87,
          "created_utc": 1753721086.0,
          "replies": [
            {
              "id": "n5ogit5",
              "author": "wsippel",
              "body": "LLMs work great for this purpose, if they're set up correctly. Doesn't even need a huge model like Gemini, I run Home Assistant with much smaller local models (Mistral Small and Qwen 3), works very nicely.",
              "score": -15,
              "created_utc": 1753736674.0,
              "replies": [
                {
                  "id": "n5ohmz4",
                  "author": "MinusBear",
                  "body": "Is this a realistic and good solution for a slightly tech savvy person to set up? Could I move away from Google Home?",
                  "score": 5,
                  "created_utc": 1753737002.0,
                  "replies": [
                    {
                      "id": "n5p7jbm",
                      "author": "camwow13",
                      "body": "It's definitely geared for tech savvy people but it's not awful to setup. Good GUI, documentation, and tons of community resources to bounce off of for support. \n\n\nThey have an alpha version of a locally run voice assistant too.",
                      "score": 2,
                      "created_utc": 1753745181.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n5rh2u9",
                  "author": "bremidon",
                  "body": "I have no idea why you are being downvoted.  And since none of the downvoters have bothered to explain themselves, I remain unsure what their problems are.",
                  "score": 1,
                  "created_utc": 1753780623.0,
                  "replies": [
                    {
                      "id": "n5to67n",
                      "author": "ElectronRotoscope",
                      "body": "I mean I didn't downvote, but I would say maybe because the comment didn't refute the central point that many people don't want something for home automation that has unpredictable results. I'm no expert, but \"setting it up correctly\" as far as I know doesn't solve the core hallucination problem with LLMs",
                      "score": 1,
                      "created_utc": 1753808443.0,
                      "replies": [
                        {
                          "id": "n5xhwjj",
                          "author": "bremidon",
                          "body": "Thank you for giving a whirl at explaining what they might be trying to say with the downvotes.\n\nBut I mean, I have this set up at my home, and it does not have very much trouble.  You just have to know how to set up your prompt.  And I would agree that there is a minor amount of trial-and-error to work out some kinks, but those were absolutely trivial to deal with.\n\nYes, if you just use a general LLM and expect \"The kitchen is too bright\" to just work out of the can, you are going to be disappointed.  Load up the prompt with enough information that limits what the LLM will consider, and it is very accurate to the point of not really mattering anymore.\n\nAbout the only weird thing I can really report is that the LLM insists on sometimes leaving out the final } in the json it produces.  But that is easy enough to deal with once you figure it out.  \n\nNow getting IR to work with home automation: \\*that\\* is a real pain to develop yourself, at least time wise.  Getting the LLM to work was trivial by comparison.",
                          "score": 1,
                          "created_utc": 1753853695.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5nroqi",
              "author": "gabrielmuriens",
              "body": "On the contrary, LLMs are *perfect* for this. Google just can't be arsed to integrate it right.",
              "score": -12,
              "created_utc": 1753729595.0,
              "replies": [
                {
                  "id": "n5ofspb",
                  "author": "Spara-Extreme",
                  "body": "No they aren’t. NLP and scripted interactions are perfect for binary (on/off) interactions. This is not just an integration thing.",
                  "score": 29,
                  "created_utc": 1753736459.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n5mt8va",
          "author": "OrganicKeynesianBean",
          "body": "“Your sink currently doesn’t support the ‘water ‘ function. Stay tuned for updates in the future!”",
          "score": 44,
          "created_utc": 1753720005.0,
          "replies": [
            {
              "id": "n5mxeur",
              "author": "timeandmemory",
              "body": "Please insert credit card for water dispersal and removal functions.",
              "score": 20,
              "created_utc": 1753721190.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5nugha",
          "author": "Earthbound_X",
          "body": "I turned Gemini off on my phone when it updated and was forced on me. I only use that voice AI feature to start timers and the like, and suddenly Gemini says it couldn't do that. But what do you know, when I switched back, the older AI could.",
          "score": 16,
          "created_utc": 1753730394.0,
          "replies": []
        },
        {
          "id": "n5nk945",
          "author": "KyberKrystalParty",
          "body": "I use an enterprise version of Gemini at my workplace, and it does the same thing. They launched functionalities where it can communicate and make actions between Gmail, calendar, sheets, google drive, etc., and it worked a few times but in the last week or so just started telling me it can’t do that. \n\nI’ll clarify that it can, and it’ll be like, “I understand you THINK I can do that, but you’re wrong.”\n\nPmo so much.",
          "score": 12,
          "created_utc": 1753727456.0,
          "replies": [
            {
              "id": "n5oiizp",
              "author": "MinusBear",
              "body": "\"I can see why this interaction is frustrating for you\"",
              "score": 8,
              "created_utc": 1753737261.0,
              "replies": [
                {
                  "id": "n5oitbf",
                  "author": "KyberKrystalParty",
                  "body": "YES! Gemini went from pretty good to unusable when I consider the functions I’ve outlined for it and its inability to repeat it the next day.",
                  "score": 3,
                  "created_utc": 1753737346.0,
                  "replies": []
                },
                {
                  "id": "n6nbo2h",
                  "author": "hirscheyyaltern",
                  "body": "giving tech support",
                  "score": 1,
                  "created_utc": 1754198296.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n5np1zo",
          "author": "willstr1",
          "body": "Open the pod bay doors HAL\n\nI'm sorry, Dave, I am afraid I can't do that",
          "score": 11,
          "created_utc": 1753728828.0,
          "replies": [
            {
              "id": "n5nr9zp",
              "author": "theartificialkid",
              "body": "Woah HAL wasn’t evil, just overhyped and underbaked",
              "score": 13,
              "created_utc": 1753729473.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5mzeb2",
          "author": "gtedvgt",
          "body": "The idea of gemini is great, but the execution sucks ass.\n\nWhen it got the whatsapp information it couln't even reliably send messages because it either couldn't find the contact or said it was sending the message and just never did.",
          "score": 24,
          "created_utc": 1753721731.0,
          "replies": [
            {
              "id": "n5njzbt",
              "author": "freddy_guy",
              "body": "It's a solution in search of a problem. It was never going to be worthwhile.",
              "score": 36,
              "created_utc": 1753727376.0,
              "replies": [
                {
                  "id": "n5nmoj4",
                  "author": "gtedvgt",
                  "body": "If it worked well it would've, I want to be able to do the things gemini claims it can, send a full whatsapp message while driving would be great.",
                  "score": 4,
                  "created_utc": 1753728149.0,
                  "replies": [
                    {
                      "id": "n5smg5q",
                      "author": "90124",
                      "body": "Google assistant has been able to send full WhatsApp messages whilst driving for years!",
                      "score": 1,
                      "created_utc": 1753797766.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5nlxbl",
              "author": "thedoc90",
              "body": "The idea of using llms, which are non-deterministic to accomplish specific repeatable tasks is terrible. A switch can't just decide to not turn on. It either does what you want it to or its broken.",
              "score": 21,
              "created_utc": 1753727934.0,
              "replies": [
                {
                  "id": "n5r20yw",
                  "author": "DanNeely",
                  "body": "Where LLMs would make sense is as a secondary/supplemental voice interface.  \n\nKeep the baseline set of deterministic commands using whatever the pre-LLM system is.  Then whenever there's a request that's outside the baseline command set, let the LLM take a best guess at what the user asked for.  If it's wrong, the user is no worse off than if they just didn't know or misspoke the deterministic command and it would make interacting with someone else's setup easier if they used a different platform than yours.\n\nSuitably anonymized the most common freeform text commands handled by the LLM would be good input data to expand the deterministic systems vocabulary and make it better overall.\n\nThe problem is that for the mega tech companies that own all the systems now, chasing whatever the latest hype train is takes priority over actually making good products; so instead we have delusional and randomly failing slop shoved down our throats at every opportunity.",
                  "score": 1,
                  "created_utc": 1753771929.0,
                  "replies": []
                },
                {
                  "id": "n5nrzci",
                  "author": "gabrielmuriens",
                  "body": "> A switch can't just decide to not turn on.\n\nA switch can't understand a spoken request phrased a thousand different ways either.",
                  "score": -6,
                  "created_utc": 1753729680.0,
                  "replies": [
                    {
                      "id": "n5pr0uo",
                      "author": "mxzf",
                      "body": "But how many ways do you realistically need to phrase \"turn the light on\"?  The marginal benefits of more phrasing flexibility are dwarfed by the huge losses in basic functionality when it doesn't work in situations where a less-overengineered setup would.",
                      "score": 10,
                      "created_utc": 1753751789.0,
                      "replies": [
                        {
                          "id": "n5qazb2",
                          "author": "gabrielmuriens",
                          "body": "> the huge losses in basic functionality when it doesn't work in situations where a less-overengineered setup would.\n\nIt sucks when it doesn't work, sure. But this absolutely is the future not only of home assistants, but life assistants. And in 10 years or sooner, these assistants will be smarter than most real life assistants.  \nThat is one element of the future that I am looking forward to.",
                          "score": -3,
                          "created_utc": 1753759001.0,
                          "replies": [
                            {
                              "id": "n5qkesm",
                              "author": "mxzf",
                              "body": "> And in 10 years or sooner, these assistants will be smarter than most real life assistants\n\nNah, not unless there's a fundamental paradigm shift in AIs.  LLMs fundamentally aren't capable of filling that sort of role.  Until they have some way to actually weight for correctness, rather than just human-sounding text outputs, you can't really hand off tasks to an LLM like you could a human.",
                              "score": 4,
                              "created_utc": 1753762959.0,
                              "replies": [
                                {
                                  "id": "n5sbjto",
                                  "author": "gabrielmuriens",
                                  "body": "> Until they have some way to actually weight for correctness\n\nDo humans have that? No, they don't.\n\nSeriously, it's funny how out of the loop most people here are and how severe their internalized human exceptionalism is.",
                                  "score": 1,
                                  "created_utc": 1753794268.0,
                                  "replies": [
                                    {
                                      "id": "n5shuqr",
                                      "author": "mxzf",
                                      "body": "Sure humans do.  We are absolutely capable of recognizing when facts are correct and acting accordingly.  Humans don't always tell the truth, and they don't always have all the information to know what is or isn't correct, but we are absolutely capable of recognizing what is and isn't factual or correct and responding accordingly.  \n\nIf I say to you \"the sky is red\" you have the capacity to take that information, compare it against your knowledge atmospheric conditions and determine that the most likely situation is that I'm either lying or that it's near sunrise or sunset.  From that information, you can also potentially estimate where on the world I live.  An LLM, on the other hand, can only look at its training model and see what a probabilistic output to that input would be, based on the body of training text it has been fed.  It has no way of recognizing what is or isn't truth, and it doesn't care, it just knows what likely textual responses to \"the sky is red\" might be and it spits out what it calculates is a standard response.  \n\nHumans absolutely have a capacity to recognize and act on correct and factual information in a way that a language model can never replicate; because correct factual information is orthogonal to the language, it's not fundamentally connected to the linguistic representation of that information at all (and LLMs are language models, their chances of being correct are just a reflection of the correctness of their training body).",
                                      "score": 0,
                                      "created_utc": 1753796350.0,
                                      "replies": [
                                        {
                                          "id": "n5sk6um",
                                          "author": "gabrielmuriens",
                                          "body": "> Sure humans do. We are absolutely capable of recognizing when facts are correct and acting accordingly. Humans don't always tell the truth, and they don't always have all the information to know what is or isn't correct, but we are absolutely capable of recognizing what is and isn't factual or correct and responding accordingly.\n\nYou say that as if every day there weren't countless and uncountable examples of people failing to \"recognize facts\" and \"act accordingly\". Many people are so god damned fucking stupid that you could lobotomize them and it might improve their functioning. They believe the dumbest fucking shit and behave in all kinds of insane and irrational ways. For fuck's sake, the current sitting president of the United States of America is so pitifully stupid that any random LLM would outperform him in every measurable way in his job.\n\n> From that information, you can also potentially estimate where on the world I live. An LLM, on the other hand, can only look at its training model and see what a probabilistic output to that input would be, based on the body of training text it has been fed.\n\nAnd just how in the fuck do you think those two things are different?\n\n> because correct factual information is orthogonal to the language, it's not fundamentally connected to the linguistic representation of that information at all (and LLMs are language models, their chances of being correct are just a reflection of the correctness of their training body)\n\nWoo hoo, somebody's using big boy words that they don't know the meaning of. None of what you said is the slightest bit right in relation to LLMs ***or*** to language and our internal representation of the world.\n\nThis dumb ass mythologising of our own cognitive abilities which lacks any basis in either neuroscience or epistemology is nothing more than what the poorer versions of ChatGPT do: you are spinning a rationale to justify your own preconcieved and biased notions. Thank you for the demonstration, tho.\n\nDon't talk shit when you don't know shit.",
                                          "score": 1,
                                          "created_utc": 1753797077.0,
                                          "replies": [
                                            {
                                              "id": "n5smcpy",
                                              "author": "mxzf",
                                              "body": "I mean, the fact that humans don't always recognize and act on facts like one might hope doesn't mean that humans are physiologically incapable of it.  LLMs are fundamentally incapable of recognizing what is or isn't correct information, because that's not what they're designed to do, they're designed to be language models that take in natural-language prompts and generate natural-language responses; factually correct information doesn't factor into it at all.  \n\nThere's a difference between not acting on truth logically vs being incapable of recognizing it at all.  \n\nThe rest of your post is just name-calling with zero logic or weight to back up your opinion, simply claiming that humans aren't special and therefore LLMs are actually intelligent or some shit like that, which can be safely ignored as nonsense.",
                                              "score": 0,
                                              "created_utc": 1753797737.0,
                                              "replies": [
                                                {
                                                  "id": "n5t0di2",
                                                  "author": "gabrielmuriens",
                                                  "body": "> LLMs are fundamentally incapable of recognizing what is or isn't correct information, because that's not what they're designed to do, they're designed to be language models that take in natural-language prompts and generate natural-language responses; factually correct information doesn't factor into it at all.\n\nThat is right only if you ignore, or rather, are unaware of the fact that LLMs do develop a distributed, emergent representation of patterns, relationships, and knowledge in their weights and parameters as they increase in size. These encode not only semantic, but relational and logical associations. They *do* in fact encode increasingly complex and often very accurate representations of the world based on the data they are trained on.  \nThus the basis of your argument is invalid.",
                                                  "score": 1,
                                                  "created_utc": 1753801804.0,
                                                  "replies": [
                                                    {
                                                      "id": "n5uvrl3",
                                                      "author": "mxzf",
                                                      "body": "The problem is that they don't actually develop any knowledge at all, they're storing the way that words relate to each other, not semantic meanings behind the words or the context of information.  \n\nThe nature of a language model is to model language, not to model truth or factual information or anything like that.",
                                                      "score": 0,
                                                      "created_utc": 1753820565.0,
                                                      "replies": [
                                                        {
                                                          "id": "n5vbpdu",
                                                          "author": "gabrielmuriens",
                                                          "body": "https://aiguide.substack.com/p/llms-and-world-models-part-1  \n\nhttps://arxiv.org/html/2505.23323v1",
                                                          "score": 1,
                                                          "created_utc": 1753825116.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5oi4fu",
              "author": "MinusBear",
              "body": "On don't even get me started on...\nHey Google turn on the lounge light.\n\"Okay.\" \n* light does not turn on *\n\nHey Google, you didn't turn on the light even though YouTube you would.\n\"I can see why that would be frustrating for you.\"",
              "score": 4,
              "created_utc": 1753737143.0,
              "replies": []
            },
            {
              "id": "n5rwpuc",
              "author": "auntie_",
              "body": "This is happening now in my car which I’m required to have a Google account to use most of its features. For the last month or two if I use the voice feature to reply to a text message, it will tell me it’s sent and then I’ll see on my phone that no text message was sent. It’s so frustrating.",
              "score": 2,
              "created_utc": 1753788646.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5nhrh5",
          "author": "haahaahaa",
          "body": "I'll try and use Gemini to simply set a timer on my phone and 1 in 10 times it'll tell me Gemini doesnt support that feature.  Its amazingly broken.",
          "score": 5,
          "created_utc": 1753726745.0,
          "replies": []
        },
        {
          "id": "n5q3r7y",
          "author": "Apex_Over_Lord",
          "body": "Loved my Google assistant.   Don't really care for Gemini.  Seems like a step backwards with stuff like simple commands.",
          "score": 6,
          "created_utc": 1753756261.0,
          "replies": []
        },
        {
          "id": "n5mzeox",
          "author": "one_is_enough",
          "body": "This is my daily experience with Siri for years.",
          "score": 9,
          "created_utc": 1753721734.0,
          "replies": []
        },
        {
          "id": "n5ndhn9",
          "author": "Bdr1983",
          "body": "Gemini turned the flashlight on my phone on instead of my desk lights...",
          "score": 5,
          "created_utc": 1753725550.0,
          "replies": []
        },
        {
          "id": "n5q0mg8",
          "author": "thisguyincanada",
          "body": "I gave up on mine long ago as I would have it playing music and ask it to stop playing music and it would just say that there was no music playing… and then resume playing music",
          "score": 3,
          "created_utc": 1753755135.0,
          "replies": []
        },
        {
          "id": "n5sda7i",
          "author": "centran",
          "body": "Had a fun little one where after a couple prompts asked it to generate an image and told me it wasn't capable of that. Explained it could use imagen. Still said it didn't have capability. Said I just opened a new chat to clear the prior prompts and it generated the image. Went back to old \"chat\" and it still explained that nope can't do it. \n\n\nlol",
          "score": 3,
          "created_utc": 1753794851.0,
          "replies": [
            {
              "id": "n5tda62",
              "author": "MinusBear",
              "body": "I can't wait till they put this in car navigation so they can hallucinate petrol stops that don't exist along your route.",
              "score": 2,
              "created_utc": 1753805417.0,
              "replies": [
                {
                  "id": "n5wdtzc",
                  "author": "centran",
                  "body": "Driving a gas car and it takes you to an electric charger then insists you can fill up there ",
                  "score": 2,
                  "created_utc": 1753837559.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n5s7a8o",
          "author": "Edward_TH",
          "body": "Alexa has been in this situation for at least a couple years at this point. Most notably, command recognition took a nosedive going from 90+% to maybe 70% at best...",
          "score": 2,
          "created_utc": 1753792786.0,
          "replies": []
        },
        {
          "id": "n5pmo9t",
          "author": "glazonaise",
          "body": "I just installed this work around in my house that bypasses this. Basically need to install a manual switch in the romex between your circuit breaker and the light fixture and replace the smart bulb with a regular one. This lets you flip the light on and off without Gemini.",
          "score": 3,
          "created_utc": 1753750296.0,
          "replies": []
        },
        {
          "id": "n5ntfn5",
          "author": "devilishycleverchap",
          "body": "Alexa related but if Spotify is playing in one room and watching Hulu or Netflix on the showing the kitchen stops you from being able to advance or rewind the TV show.\n\nStarts working fine if it is the only device being used",
          "score": 2,
          "created_utc": 1753730101.0,
          "replies": []
        },
        {
          "id": "n5oj3uw",
          "author": "TemoSahn",
          "body": "Sounds like my children",
          "score": 1,
          "created_utc": 1753737434.0,
          "replies": []
        },
        {
          "id": "n5oqlmc",
          "author": "_ravenclaw",
          "body": "As someone who has Apple products I can confirm that Siri and Homekit do the same thing lol",
          "score": 1,
          "created_utc": 1753739710.0,
          "replies": []
        },
        {
          "id": "n5owqto",
          "author": "dudushat",
          "body": "Yeah i had to remind it that it could do it and it finally did it. Then I told it \"dont let this happen again\" and it hasnt given me a problem since.",
          "score": 1,
          "created_utc": 1753741660.0,
          "replies": [
            {
              "id": "n5pix8z",
              "author": "MinusBear",
              "body": "I've had situations like this too, where I've asked it to remember something and then for a while it works. For example, \"when I tell you to turn on all the lights, don't turn on the fans as well\". That worked for a month or so. Then one day it was back to not working. I asked it why it forgot, and it said it doesn't have the ability to remember things like I requested. Then I asked it why it worked last time, after a lot of back and forth the answer seemed to be coincidence. But I can't say for certain because it has difficulty explaining operational facts without lying.",
              "score": 1,
              "created_utc": 1753749001.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5up334",
          "author": "ApprehensiveBee671",
          "body": "Idk about most people but my experience with Google Assistant and lights has always been unreliable and inconsistent.",
          "score": 1,
          "created_utc": 1753818673.0,
          "replies": []
        },
        {
          "id": "n5vpbz0",
          "author": "roundart",
          "body": "I’m sorry Dave, I’m afraid I can’t do that…",
          "score": 1,
          "created_utc": 1753829368.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mqjlt",
      "author": "CandyCrisis",
      "body": "They laid off huge parts of that team over a year ago, and they were already treading water before the layoffs. The ecosystem rot is setting in fast now.",
      "score": 475,
      "created_utc": 1753719224.0,
      "replies": [
        {
          "id": "n5mss8x",
          "author": "Kemerd",
          "body": "Really sucks because it used to be the best and at some point it just stopped recognizing my voice",
          "score": 182,
          "created_utc": 1753719873.0,
          "replies": [
            {
              "id": "n5mx540",
              "author": "LitLitten",
              "body": "Silver linings.\n\nIt’s pretty easy to gauge nowadays if an online/smart device will have an appreciable lifespan or be a dud by taking the company into account. \n\nGoogle? Nah. \n\nWindows? Don’t count on phones. \n\nStartup? Wildcard. ",
              "score": 97,
              "created_utc": 1753721115.0,
              "replies": [
                {
                  "id": "n5n16ww",
                  "author": "PhabioRants",
                  "body": "Most of my friends jumped ship years ago and started running their own local models to keep from having their systems degraded or sunset by companies. \n\n\nHonestly, I rent, so I don't lean into the smart home stuff, but for $300-$350 CAD, I can pick up an Intel ARC card that crushes these sorts of models. It's an extremely affordable buy-in price to ensure that your model and your data are entirely local. Sure, there's some learning and tinkering required, but there are forums full of people that are happy to help, and the tinkering is much more enjoyable than troubleshooting some megacorp's forgotten goose. ",
                  "score": 52,
                  "created_utc": 1753722214.0,
                  "replies": [
                    {
                      "id": "n5n49sg",
                      "author": "laxfool10",
                      "body": "Home assistant is where it’s at.   Used to run it off a raspberry pi but would require lots of tinkering but community support was top notch. Used to have a 3d blueprint of my rooms on a tablet and could click on each room to control devices. Had tv remotes, av receiver, lights, car, switches, etc. pretty much anything that had Bluetooth/remote control could be controlled/programmed through it. Easy to incorporate any homemade esp Bluetooth boards into the ecosystem as well.",
                      "score": 47,
                      "created_utc": 1753723050.0,
                      "replies": [
                        {
                          "id": "n5qqyvd",
                          "author": "nagi603",
                          "body": "+1 for home assistant",
                          "score": 1,
                          "created_utc": 1753766036.0,
                          "replies": []
                        },
                        {
                          "id": "n5sbehw",
                          "author": "SmokelessSubpoena",
                          "body": "Why you stop using it? I'm trying to find an alternative to the Google Home ecosystem",
                          "score": 1,
                          "created_utc": 1753794216.0,
                          "replies": [
                            {
                              "id": "n5xfpaq",
                              "author": "laxfool10",
                              "body": "I stopped because I moved from a house I rented/lived in for 4 years to an apartment (and then apartment hopped every year). I also started a phd program working 80+ hours a week so didn't have the time to mess with it if something broke as I knew it would just drive my girlfriend mad. I will do it again once I have my own place. it does look like they offer more friendly plug-in play alternatives now but when I was in the rabbit hole (5 years ago) it was very much shit breaks, go to the forums and troubleshoot with other people. Looks like they've ironed out a lot of the kinks and offer stand-alone boards/cloud services if you want but can still run everything independent/local if you have the know how (there are plenty of guides - I learned 3d modeling, json, jnode, networking pretty easily but I would say I have a higher learning capacity than most people so might not be as friendly as I'm making it out to be)",
                              "score": 1,
                              "created_utc": 1753852562.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n5n7hdr",
                      "author": "LitLitten",
                      "body": "I just don’t want to bother with the firmware update gamble for devices if I can help it, much less for AI-bundled hardware. The issues mentioned above  seem to indicate it being a mix of updating and Gemini replacing the OG assistant.\n\nOn a related note, not the biggest fan of LLMs becoming so synonymous with ‘assistants’; I really prefer the voice-controlled DOS nature of personal assistants in comparison to LLM models. Limited but snappy. ",
                      "score": 9,
                      "created_utc": 1753723921.0,
                      "replies": []
                    },
                    {
                      "id": "n5nifg8",
                      "author": "mrmeatypop",
                      "body": "Got any guides or anything to show what to do? I’ve been wanting to do this for YEARS and wasn’t sure it was possible or where to even begin.",
                      "score": 6,
                      "created_utc": 1753726935.0,
                      "replies": [
                        {
                          "id": "n5o41x4",
                          "author": "borkyborkus",
                          "body": "Start by picking a device. They make premade ones for $100 or you can get a mini pc with more options for about $160 (the amount I paid for my Beelink). With the prebuilt devices you won’t be able to run other OSes besides HA. \n\nHow to set up a mini pc is its own rabbit hole, but I really like Proxmox. I have my plex server, HA, and another VM with some misc apps on that device. It doesn’t require any special purchases or equipment (besides storage potentially) as long as you are able to hardwire the device to your LAN and can figure out how to navigate to local devices.",
                          "score": 5,
                          "created_utc": 1753733144.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n5nuiod",
                  "author": "diamondintherimond",
                  "body": "Requires internet to work? Nah.",
                  "score": 5,
                  "created_utc": 1753730412.0,
                  "replies": []
                },
                {
                  "id": "n5pivax",
                  "author": "FastRedPonyCar",
                  "body": "I’m betting that the Alexa devices will still work after the apocalypse. They’ve probably got a trillion of those little bastards in the wild",
                  "score": 1,
                  "created_utc": 1753748982.0,
                  "replies": []
                },
                {
                  "id": "n5nm02e",
                  "author": "sexual--predditor",
                  "body": "Amazon? Seems to have come through (so far)",
                  "score": -2,
                  "created_utc": 1753727956.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5qfkif",
              "author": "primalbluewolf",
              "body": "> it used to be the best\n\nIts always been cloud-based, though?",
              "score": 1,
              "created_utc": 1753760875.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5ni9p0",
          "author": "crappy80srobot",
          "body": "Automated home devices are dying everywhere. Google did Google way by cutting off completely. Even Apple has started to cut back on the homekit. Seems there just isn't the market for home automation like everyone expected. If only all these companies would have come up with a set standard across all ecosystems instead of trying to force people and companies into one or the other. It's crazy to think just a few years ago everything was pushed as works with Google, Alexa, or homekit and now newer products don't have it or don't push it to know it has it. Really is a shame because I was getting close to a well rounded automated home and basically having a remote in Google home for everything. No half my stuff is either now working or just and on or off. Colors are only changed via the insurmountable amount of apps on my phone and even Toyota dropped the hey Google start my car last year.",
          "score": 36,
          "created_utc": 1753726889.0,
          "replies": [
            {
              "id": "n5njokn",
              "author": "CandyCrisis",
              "body": "Everyone suddenly realized that running a fleet of voice recognition servers costs a lot of money, and once the initial wave of upgrades petered out, it wasn't profitable anymore.",
              "score": 54,
              "created_utc": 1753727291.0,
              "replies": []
            },
            {
              "id": "n5q1xcd",
              "author": "Expensive-Mention-90",
              "body": "May I ask how you know that Apple is pulling investment in HomeKit? From everything I can find, it sounds like the opposite.",
              "score": 6,
              "created_utc": 1753755598.0,
              "replies": []
            },
            {
              "id": "n5qfsyr",
              "author": "primalbluewolf",
              "body": "> Seems there just isn't the market for home automation like everyone expected\n\nThere isn't a market for dumb home automation, which is what the companies are pushing because it is cheap to get into and very lucrative. \n\nSmart home automation is a massive market, but very few \"smart home\" products are compatible with an actual smart home.",
              "score": 3,
              "created_utc": 1753760974.0,
              "replies": []
            },
            {
              "id": "n5nxjjg",
              "author": "sybrwookie",
              "body": "> Seems there just isn't the market for home automation like everyone expected\n\nEveryone?  Most thought it ranged from a joke to horribly invasive.  And then many also screamed that these things were completely reliant on how untrustworthy companies kept these services running. There was just a whole bunch of money trying to convince people it was something they wanted because companies wanted people to pay them to collect even more data.\n\nPretending that no one could see this coming is some revisionist nonsense.",
              "score": 10,
              "created_utc": 1753731284.0,
              "replies": [
                {
                  "id": "n5o5f70",
                  "author": "borkyborkus",
                  "body": "Did it ever really take off though? The market has been a mess of incompatible devices since I started. The premium you have to pay to get everything working together is pretty enormous, whether it’s $$ for matching devices or time for HA.\n\nI think the manufacturers would have to give up their walled gardens to make this stuff viable to the average consumer, which would probably make it non-viable for the manufacturers.",
                  "score": 13,
                  "created_utc": 1753733530.0,
                  "replies": []
                },
                {
                  "id": "n5o50c3",
                  "author": "crappy80srobot",
                  "body": "Everyone = companies not end users",
                  "score": 6,
                  "created_utc": 1753733415.0,
                  "replies": [
                    {
                      "id": "n5o5uxx",
                      "author": "sybrwookie",
                      "body": "I don't even know if that's even \"expected\" and more \"hoped.\"",
                      "score": 1,
                      "created_utc": 1753733653.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5qaja6",
              "author": "Pocketpine",
              "body": "There are actually a lot of standards, mostly around update sharing/cacheing to avoid unintentional DDoSing lol. But each big company has their own SDK/binaries for the actual controls",
              "score": 1,
              "created_utc": 1753758826.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5oqekl",
          "author": "The-Nihilist-Marmot",
          "body": "Average Google experience.",
          "score": 2,
          "created_utc": 1753739650.0,
          "replies": []
        },
        {
          "id": "n5qta70",
          "author": "bigsquirrel",
          "body": "Why anyone would buy google hardware is beyond me.  Their history of support (and quality) is atrocious.  I was stupid enough to buy a google tv to save a few bucks and throughly regretted it.  Buggy garbage.",
          "score": 2,
          "created_utc": 1753767206.0,
          "replies": [
            {
              "id": "n5s03vb",
              "author": "CandyCrisis",
              "body": "At one point, Assistant was obviously better than both Alexa and Siri. Times change.",
              "score": 1,
              "created_utc": 1753790068.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5qsrzw",
          "author": "OutlyingPlasma",
          "body": "This is why you never buy into a Google product. They don't care about the users and drop products all the time.",
          "score": 1,
          "created_utc": 1753766942.0,
          "replies": []
        },
        {
          "id": "n5n2j1q",
          "author": "None",
          "body": "[deleted]",
          "score": -10,
          "created_utc": 1753722576.0,
          "replies": [
            {
              "id": "n5nidgt",
              "author": "raining_sheep",
              "body": "Amazon spends something like 10 billion a year on Alexa devices and makes hardly any revenue. They thought they would make a ton of money with people buying things with them but that backfired horribly when kids and tv ads started buying hundred dollar purchases.",
              "score": 7,
              "created_utc": 1753726919.0,
              "replies": []
            },
            {
              "id": "n5n8w8q",
              "author": "SaltyShawarma",
              "body": "My Alexas have become shit.",
              "score": 16,
              "created_utc": 1753724305.0,
              "replies": [
                {
                  "id": "n5ogch8",
                  "author": "farcade",
                  "body": "I’m surprised I had to scroll this far to see someone say this.  Things that used to work flawlessly are now wildly inconsistent.  Such a shame.",
                  "score": 0,
                  "created_utc": 1753736622.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5ndiaw",
              "author": "CandyCrisis",
              "body": "Amazon also laid off most of the Alexa staff at around the same time.",
              "score": 9,
              "created_utc": 1753725555.0,
              "replies": []
            },
            {
              "id": "n5nhjmo",
              "author": "bamblerow",
              "body": "Amazon is quickly moving its already garbage Alexa into a monthly paid service that is even more so-garbage powered. Not looking good there",
              "score": 10,
              "created_utc": 1753726684.0,
              "replies": []
            },
            {
              "id": "n5nyy38",
              "author": "123_fake_name",
              "body": "Alexa was the first to start the enshitification by inserting random ads.",
              "score": 5,
              "created_utc": 1753731687.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5ms1hs",
      "author": "BooBeeAttack",
      "body": "I loved mine, but yeah they are working less and less. Meanwhile I get more ads for Gemini.\n\nYou start to see the pattern emerge that everytime they get something decent and working, they replace it. \n\nJust open source it if this is going to be how its going to go.",
      "score": 117,
      "created_utc": 1753719657.0,
      "replies": [
        {
          "id": "n5mwels",
          "author": "CandyCrisis",
          "body": "Nothing Google-internal makes sense to open source as it all relies on their data centers and internal-only job management tech (like Kubernetes but different). Open sourcing a Google project basically involves a rewrite.",
          "score": 26,
          "created_utc": 1753720907.0,
          "replies": [
            {
              "id": "n5rxtsw",
              "author": "esther_lamonte",
              "body": "And they’d be better for it.",
              "score": 1,
              "created_utc": 1753789128.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5owe7x",
          "author": "JBWalker1",
          "body": "Google honestly needs a new CEO asap. I get that their stock value has gone up massively but so has most just as much percentage so it's not special. You can cruise along on the AI share price explosion while also putting effort into your other products but the current CEO doesn't care.",
          "score": 11,
          "created_utc": 1753741546.0,
          "replies": [
            {
              "id": "n5pr6zy",
              "author": "AsparagusDirect9",
              "body": "I don’t like him either",
              "score": 2,
              "created_utc": 1753751848.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5rms75",
          "author": "dlc741",
          "body": "I started with Wink long ago and learned my lesson early. Their system crashing meant my home didn’t work. Switched to Home Assistant and it’s been smooth sailing ever since. Lights, sensors, thermostats, televisions, phones all connected and running on a Raspberry in the closet.",
          "score": 3,
          "created_utc": 1753783834.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5nb1fc",
      "author": "staticattacks",
      "body": "Me experience two nights ago: \n\n\"Hey Google, turn the lamp off\"\n\n\"OK, playing 'lamp off' on YouTube Music\"\n\nStarts playing some random song I was listening to several days ago.",
      "score": 112,
      "created_utc": 1753724887.0,
      "replies": [
        {
          "id": "n5o5314",
          "author": "Midnight_Ice",
          "body": "It's ridiculous at this point. If I pause something on my tv, like a YouTube video, and then try to use google assistant to resume it, it goes like this:\n\n\"Hey Google, play the living room TV\"\n\n\"Okay, I'll play it on living room TV\"\n\n*Nothing happens*\n\n\"Hey google, resume living room tv\"\n\n\"Okay, *living room* from Spotify, playing on living room tv\" \n\nCommands that have been working for 5 years have just completely stopped working like they're supposed to.",
          "score": 51,
          "created_utc": 1753733435.0,
          "replies": [
            {
              "id": "n5pmo34",
              "author": "Timoris",
              "body": ">Commands that have been working for 5 years have just completely stopped working like they're supposed to.\n\nExactly this.",
              "score": 9,
              "created_utc": 1753750295.0,
              "replies": [
                {
                  "id": "n5qtifk",
                  "author": "nagi603",
                  "body": "But hey, someone at google got a pretty big bonus for ruining it.",
                  "score": 6,
                  "created_utc": 1753767326.0,
                  "replies": [
                    {
                      "id": "n5rqnx2",
                      "author": "Timoris",
                      "body": "Yup - the head search engineer (since quit) was forced to reduce search efficacy in order for google to serve more ads.",
                      "score": 5,
                      "created_utc": 1753785865.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5svvl0",
              "author": "TangeloFinally",
              "body": "Mine works perfectly fine. [See here](https://imgur.com/a/3qKbgHl)\nIt says loading because of me doing a scrolling screenshot, it worked and did exactly what I asked. Every single person in this thread says they have problems with Gemini but mine works perfectly. I really don't understand. I use Gemini multiple times a day. Asking how to cook things a certain way. My patient I'm a carer for asks me questions and I ask Gemini if I don't know the answer. I find it really great. I probably sound like a shill but I ain't. Never had an issue. I put the porch light in a couple weeks ago. I have Wiz brand lights all through my house. It did the porch light because it was in the same group as my room.\n\nI've just looked in my Google home and it looks like it separated the porch light into its own group. \n\nIt works on my TV too. I turn it on and off and volume up/down with Gemini. \n\nI suppose I'm an outlier. I truly haven't had a single issue with it. The porch light issue I only just noticed right now. It's fixed now though.l, as you can see in my image.",
              "score": 0,
              "created_utc": 1753800526.0,
              "replies": [
                {
                  "id": "n5sycfq",
                  "author": "Midnight_Ice",
                  "body": "Cool thanks for your anecdotal non-issue. It doesn't matter how many people a service works perfectly for if it continues to not work for a large percentage of users. \n\nMy issues stem from Google Assistant, not Gemini, though Gemini isn't much better.",
                  "score": 1,
                  "created_utc": 1753801225.0,
                  "replies": [
                    {
                      "id": "n5tjeea",
                      "author": "TangeloFinally",
                      "body": "Reddit users are a small subsection of the Google user base. ~500 comments of it not working. Millions of people that it works for. Gemini is in place of Google Assistant. It IS the assistant. \n\nYou sound salty.",
                      "score": 0,
                      "created_utc": 1753807133.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n5q4p6w",
          "author": "pfritzmorkin",
          "body": "I was in the car on maps and said \"culvers\" from the destination search. It proceeded to CALL culvers.",
          "score": 2,
          "created_utc": 1753756607.0,
          "replies": []
        },
        {
          "id": "n5ovwol",
          "author": "MechaSandstar",
          "body": "I ask my hub to play synthwave streaming, and there's like a 50% chance I'll get safeway streaming, or sinclair streaming instead.",
          "score": 1,
          "created_utc": 1753741390.0,
          "replies": []
        },
        {
          "id": "n5ui3f4",
          "author": "maxver",
          "body": "Same here. It used to work great, now it's 50% of the above.\n\nHey, turn off bedroom lights off.\nSorry, one of 27 lights you have configured in your whole house is not working. Can't do anything.",
          "score": 1,
          "created_utc": 1753816668.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mrs41",
      "author": "peakedtooearly",
      "body": "Google doing Google things.\n\nYou'd have to be a real sucker to build anything around Gemini.",
      "score": 177,
      "created_utc": 1753719582.0,
      "replies": [
        {
          "id": "n5nu1co",
          "author": "pagerussell",
          "body": "https://killedbygoogle.com/",
          "score": 7,
          "created_utc": 1753730274.0,
          "replies": []
        },
        {
          "id": "n5mwe3r",
          "author": "who_you_are",
          "body": "IoT company doing IoT company stuff.\n\nThere is a reason every company are closing (especially if it is free to use).",
          "score": 28,
          "created_utc": 1753720903.0,
          "replies": [
            {
              "id": "n5nam27",
              "author": "funguyshroom",
              "body": "Cloud-based IoT is not all there is. There are tons of smart home devices that can be controlled fully locally using open protocols, don't spy on you, and don't become e-waste the moment the manufacturer goes bust or stops supporting them.",
              "score": 14,
              "created_utc": 1753724771.0,
              "replies": [
                {
                  "id": "n5r9w19",
                  "author": "Barton2800",
                  "body": "Exactly. My Zigbee and Zwave devices are fully offline. And my Tp-Link Kasa light switches only require the app for first time setup; they’re locally controllable by HomeAssistant over the network with no internet access after that. My Meross garage door openers are cloud based, but there’s a hack to get local-only control.",
                  "score": 5,
                  "created_utc": 1753776406.0,
                  "replies": []
                },
                {
                  "id": "n610j30",
                  "author": "who_you_are",
                  "body": "I'm not a lot in IoT, but when I'm looking at something for fun, it usually ends up being a small business grade level to get such non-mandatory IoT.\n\nUnfortunately, it also means they are way more expensive",
                  "score": 1,
                  "created_utc": 1753901360.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5mwzba",
              "author": "Shadow647",
              "body": "IKEA's Tradfri system is doing quite well.",
              "score": 17,
              "created_utc": 1753721069.0,
              "replies": [
                {
                  "id": "n5n9geu",
                  "author": "Major_T_Pain",
                  "body": "So was:   \n*Insert long list of now defunct IoT companies*",
                  "score": 11,
                  "created_utc": 1753724457.0,
                  "replies": [
                    {
                      "id": "n5ojfs8",
                      "author": "wsippel",
                      "body": "Ikea stuff used to be all Zigbee and they're currently switching everything to Thread, two protocols that are inherently local and don't require access to the internet. If you stick to Zigbee, Thread, Z-Wave, ESPHome, Tasmota or most BLE devices, you're fine even if the manufacturers close shop.",
                      "score": 10,
                      "created_utc": 1753737533.0,
                      "replies": [
                        {
                          "id": "n5ovne5",
                          "author": "Major_T_Pain",
                          "body": "I know that, and you know that, but you know who doesn't? Consumers.   \nPeople are unable to understand the different technologies and how they work or why one is better than another.  \n   \nI mean, even for me (someone who works in and has studied all these technologiss in school / work) this shit is confusing.      \n\nFor instance, IKEA isn't switching to Thread so much as they are by default being absorbed. Thread already uses the same 2.4GHz chips that Zigbee uses (also 2.4GHz). So, IKEA is implementing Matter as a issue of survival for their software and hardware, but since Matter / Thread use the same antennae as Zigbee they are good to go, they just have to work through the atrocious Matter implementation.    \n    \nZigbee is a protocol and a specific communications chip (2.4GHz). Thread is a communications protocol that exists primarily to use the 2.4GHz range chips, but can also be used for other wavelengths (I'm unaware of any Thread devices that use other wavelengths yet tho). Matter with Thread is meant to be (more or less) chip and software agnostic. Matter is the comm/protocol layer that, at least in theory, can communicate to all the various technologies; Zwave (915MHz in US), Zigbee (2.4GHz), Bluetooth, WiFi, etc.    \nUsing the Thread technology.     \n     \nTry explaining all this to someone and then trying to explain why a home controller/HUB is always better than trusting some corporation to provide secure access to all 50+ SH devices all day through your router.    \nHoly shit, that's like cutting yourself all over and jumping into the Hudson.   \n  \nFurthermore, most people greatly underestimate the number of light switches and SH items they would have in their home.",
                          "score": 4,
                          "created_utc": 1753741307.0,
                          "replies": [
                            {
                              "id": "n5ozqd0",
                              "author": "wsippel",
                              "body": "I believe Ikea is switching to Matter over Thread mostly because there's a surprisingly big overlap between Ikea and Apple customers, and Apple is also defaulting to Matter over Thread, and all of their smart home devices serve as Thread border routers. But yeah, this shit is quite complicated, customers should absolutely investigate thoroughly before jumping on board.",
                              "score": 7,
                              "created_utc": 1753742637.0,
                              "replies": [
                                {
                                  "id": "n5p8ywn",
                                  "author": "Major_T_Pain",
                                  "body": "I hear you.  \nAnd I agree consumers need to not be idiots, and do some reading. However, that also requires companies to do the *right* thing and not the easy thing.     \n  \nSo, here we are.  \nMatter / Thread (MT) I do belive was the right thing to do. Pick a tech (Matter / 2.4GHz) and force everyone to use the same protocol (Thread).  \n   \nHopefully Apple being on board will force the industry into this standard (which, love them or hate them, is what Apple has the market power to do).  \n   \nThe problem I spy, and that has already cropped up, is that Thread is just the communication protocol locally. The software on top that you actually use to control devices is still just as fractured and terrible as ever. Also,  we have to wade through more years of rebranding and stupid shit before we get to any real whole system solutions.   \nAs an aside.... \"Border router\".... Why!? mesh network was a perfectly identifiable and laymen term.   \n\nWhatever.  \nLet's hope one day we can have true local control over everything, and true self hosted remote access.",
                                  "score": 1,
                                  "created_utc": 1753745652.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5myu38",
              "author": "peakedtooearly",
              "body": "Nothing about Google is free. The payment is your data.",
              "score": 11,
              "created_utc": 1753721581.0,
              "replies": [
                {
                  "id": "n5nocka",
                  "author": "HeavenlyAllspotter",
                  "body": "I paid for my google home devices",
                  "score": 9,
                  "created_utc": 1753728626.0,
                  "replies": [
                    {
                      "id": "n5qgbsj",
                      "author": "oldmatenate",
                      "body": "That's the beautiful thing. Now companies get your money AND profit off your data.",
                      "score": 1,
                      "created_utc": 1753761191.0,
                      "replies": []
                    },
                    {
                      "id": "n5o4n6w",
                      "author": "IMissNarwhalBacon",
                      "body": "You only subsidized them.",
                      "score": 0,
                      "created_utc": 1753733312.0,
                      "replies": [
                        {
                          "id": "n5o7ty8",
                          "author": "HeavenlyAllspotter",
                          "body": "You probably mean that Google subsidized them",
                          "score": 2,
                          "created_utc": 1753734210.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n5qspsv",
                  "author": "nagi603",
                  "body": "That sounds like free to the average consumer.",
                  "score": 1,
                  "created_utc": 1753766910.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5noegu",
              "author": "HeavenlyAllspotter",
              "body": "Why are they closing?",
              "score": 1,
              "created_utc": 1753728642.0,
              "replies": []
            },
            {
              "id": "n5oaqcc",
              "author": "chuloreddit",
              "body": "Alexa is going strong",
              "score": 1,
              "created_utc": 1753735022.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5nruyo",
          "author": "nothoughtsjustchaos",
          "body": "Yeah, Gemini is actual trash",
          "score": 3,
          "created_utc": 1753729644.0,
          "replies": [
            {
              "id": "n5sct01",
              "author": "lowcrawler",
              "body": "shockingly bad compared to the others...\n\nand even worse compared to what it's replacing (looking at you photo search)",
              "score": 2,
              "created_utc": 1753794691.0,
              "replies": []
            },
            {
              "id": "n5s964d",
              "author": "NotanAlt23",
              "body": "Gemini is amazing on phones. \n\nI wish I had it on my pc. Translating anything on the screen on one click would be a god send.",
              "score": 1,
              "created_utc": 1753793452.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5p3wr3",
          "author": "orangpelupa",
          "body": "The problem is that gemini is forced down into older devices that was NOT featuring gemini ",
          "score": 1,
          "created_utc": 1753744004.0,
          "replies": []
        },
        {
          "id": "n5r8999",
          "author": "BUNNIES_ARE_FOOD",
          "body": "Just throw this on the pile of other abandoned products...  I'm surprised Gmail is still functional honestly",
          "score": 1,
          "created_utc": 1753775476.0,
          "replies": []
        },
        {
          "id": "n5r8g5n",
          "author": "FezAndSmoking",
          "body": "That's not even Gemini you rodent. It's pure shit ass-istant.",
          "score": 1,
          "created_utc": 1753775584.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mpjth",
      "author": "ChaoticToxin",
      "body": "Yea, reducing the number in my house more and more. Down to 2 screens and 1 speaker. Then i will probably just use phone to keep up with lights, shopping list and such",
      "score": 62,
      "created_utc": 1753718943.0,
      "replies": [
        {
          "id": "n5msg4e",
          "author": "Naterade804",
          "body": "Kind of same here. Down to three sets of smart lights, one Google Home screen in the kitchen and one off brand speaker elsewhere. Literally only use voice control to turn those lights on/off. I really hope those keep working because that's about as basic of a setup you can get.",
          "score": 7,
          "created_utc": 1753719775.0,
          "replies": [
            {
              "id": "n5mxodh",
              "author": "ChaoticToxin",
              "body": "The lights i use hue and I use tapo smart plugs for other lights so I wont get rid of those bc they function great within their apps. If I get rid of the googles I will just setup more automation and maybe get more hue light remotes",
              "score": 5,
              "created_utc": 1753721264.0,
              "replies": [
                {
                  "id": "n5n1w1c",
                  "author": "learnedsanity",
                  "body": "Agreed, Hue has worked well. The app functions. My away from home cameras are google though so that sucks.",
                  "score": 5,
                  "created_utc": 1753722405.0,
                  "replies": [
                    {
                      "id": "n5n4duf",
                      "author": "ChaoticToxin",
                      "body": "Yea i have the google doorbell and it honestly looks like crap at night so I wasn't sold on googles quality and monthly fees. You can look into a Tp link(tapo) cameras. They are not as expensive as googles but are still better. No subscription, most are 2k and actually look good, batteries are great and some have solar panel charging, and you can setup a security alarm to go off if people,cars,pets,or movement are captured at certain times ",
                      "score": 2,
                      "created_utc": 1753723081.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n5rz7no",
          "author": "ProCatWrangler",
          "body": "I use my phone for the lights and I am constantly having issues with it.",
          "score": 1,
          "created_utc": 1753789707.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mzqku",
      "author": "Tribalbob",
      "body": "100% gotten shittier over the last year or two.  Usually I do a factory reset when it happens and it gets better, but it doesn't seem to matter.\n\nI'll bet within a year or two they announce new Gemini powered versions.  Want Gemini to work 100%? Gotta buy the NEW home.",
      "score": 26,
      "created_utc": 1753721822.0,
      "replies": [
        {
          "id": "n5nj30y",
          "author": "raining_sheep",
          "body": "I think you've got it right there. They have announced AI replacements for Alexa around the corner. That's exactly what's going to happen",
          "score": 1,
          "created_utc": 1753727122.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mwbq7",
      "author": "GlergenHouse",
      "body": "It’s been said thousands of times but that’s still not enough: Google’s only MO is collecting data and pumping out abandonware. They don’t actually care about their products and they don’t care about user experiences. They have zero commitment to their brand’s products. Zero. And although it would seem a little irrelevant to this topic it is still worth noting that the founders, Larry Page and Sergey Brin, are worth a combined 300 billion dollars. Google and its products are so completely dumpy that if it weren’t for the way the way Google meticulously cornered certain markets over the last 25 years very few people would bother with their garbage products outside of GMAIL.",
      "score": 45,
      "created_utc": 1753720884.0,
      "replies": [
        {
          "id": "n5qtqrb",
          "author": "nagi603",
          "body": "> pumping out abandonware.\n\nIt's literally how you get a promotion there: launch something, move on to something else. You won't be rewarded for keeping the lights on and have insane hurdles for improving an already launched service, so the easiest is to just abandon it at the gate.",
          "score": 4,
          "created_utc": 1753767444.0,
          "replies": []
        },
        {
          "id": "n5obtkf",
          "author": "jellybon",
          "body": "This start to make sense if you think about how each new product they release either adds new users into Google's ecosystem or helps refine the data about current users. Smart home devices for example give Google more detailed information about your living situation and daily routines.",
          "score": 1,
          "created_utc": 1753735328.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mr6zo",
      "author": "TheTrueDeraj",
      "body": "I know smart homes were the vision of the future and everything, but... Putting that in the hands of a corporation that has every reason to sunset the service as soon as it stops being profitable? Yeah, no. Anyone who put any forethought into it could see this coming from the onset.",
      "score": 125,
      "created_utc": 1753719409.0,
      "replies": [
        {
          "id": "n5mwzlx",
          "author": "T_P_H_",
          "body": "And this is why you do not buy home automation products that rely on  cloud services period, full stop.",
          "score": 74,
          "created_utc": 1753721071.0,
          "replies": [
            {
              "id": "n5n84hi",
              "author": "WesBur13",
              "body": "I’ve don’t everything “smart” in my home as something that is 100% local. ESPHome and home assistant have been fantastic. Works when my internet goes out and no one can force me into a subscription",
              "score": 21,
              "created_utc": 1753724095.0,
              "replies": [
                {
                  "id": "n5pq8z7",
                  "author": "TheCrimsonSteel",
                  "body": "Is it difficult to use, or any suggestions on where to start?\n\nBeen trying to expand my shift back to DIY tech",
                  "score": 2,
                  "created_utc": 1753751519.0,
                  "replies": [
                    {
                      "id": "n5pr4r5",
                      "author": "WesBur13",
                      "body": "It’s a little bit of a learning curve. Luckily there is so much online content around home assistant, that you can search almost any smart home product and add “home assistant” to the end for a great step by step tutorial. \n\nDon’t bother with the container version, the server/vm version is much easier.",
                      "score": 1,
                      "created_utc": 1753751827.0,
                      "replies": [
                        {
                          "id": "n5psp24",
                          "author": "TheCrimsonSteel",
                          "body": "I've been noticing with the rise of enshitification, I've been going back to my tinkering roots.\n\nLots has changed. Lots has stayed the same, but theres definitely been a rise of running your own servers and DIY electronics.\n\nIts just now we have arduinos and rasberi Pis to flesh out the army of used and 2nd hand electronics.",
                          "score": 1,
                          "created_utc": 1753752368.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n5q7g3p",
                      "author": "asr",
                      "body": "Get a Hubitat hub, 100% local, and much easier to setup than DIY.",
                      "score": 1,
                      "created_utc": 1753757627.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n5n93n7",
              "author": "Mad_Aeric",
              "body": "As we've seen recently with Echelon, they can take away independence from the cloud with a firmware update.",
              "score": 8,
              "created_utc": 1753724361.0,
              "replies": [
                {
                  "id": "n5ohoej",
                  "author": "wsippel",
                  "body": "There's no reason to let IoT devices access the internet if they work locally, and without internet access, they can't receive firmware updates.",
                  "score": 10,
                  "created_utc": 1753737013.0,
                  "replies": []
                },
                {
                  "id": "n5prhx2",
                  "author": "mxzf",
                  "body": "> they can take away independence from the cloud with a firmware update\n\nIf you install a firmware update manually that bricks your device, that's honestly on you.  If the company can install firmware remotely, it's not actually independent from the cloud to begin with.",
                  "score": 3,
                  "created_utc": 1753751953.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n5my8eg",
          "author": "ElectronRotoscope",
          "body": "I mean I see where you're coming from, but lots of profit-driven companies see the long term reputation benefits as being more worthwhile than the costs of maintaining old platforms.\n\n\nAll other things being equal, AWS has a reputation of continuing to function without being touched for years, where Google Cloud Services famously will sunset stuff way more often.\n\n\nAlmost any program that ran on Windows 7 in 2009 will run *that version* just fine on the latest Win11. I'd be hard pressed to find anything that ran on Snow Leopard that you can even open on macOS Sequoia.\n\n\nThey're all corporations, and ultimately if you want real long term sustainability you need open source, but some are far more stable than others.",
          "score": 13,
          "created_utc": 1753721418.0,
          "replies": [
            {
              "id": "n5nuow6",
              "author": "pagerussell",
              "body": ">Almost any program that ran on Windows 7 in 2009 will run *that version* just fine on the latest Win11\n\nAnd this is why Microsoft continues to be a juggernaut, despite and number of attempts to dethrone it.\n\nMy wife and I started a business in 213 and tried really hard to base it around chrome books and Google docs.\n\nWe just abandoned for office 365. Because while Google office was great when it came out, it literally has not evolved in a decade. Meanwhile, office 365 started off worse by just kept getting better. I don't know why anyone would buy a Chromebook these days. They had a chance to become a major operating system, and they just stalled out.",
              "score": 8,
              "created_utc": 1753730463.0,
              "replies": [
                {
                  "id": "n5qt7n0",
                  "author": "nagi603",
                  "body": "One added nightmare scenario for google docs is what I recently saw on twitter: someone got their account banned, and lost everything. They had a very recent backup, but imagine that happening with a cloud-only service to a business. Also good luck getting hold of anyone not a bot at google as a regular person without first getting news coverage.",
                  "score": 1,
                  "created_utc": 1753767169.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5ozsl5",
              "author": "FlyingBishop",
              "body": "You can't apply these sorts of things to home automation. An analog light switch can work for a lifetime. The idea of a US tech corporation providing a free service that stays up for the lifetime of a home is laughable.",
              "score": 2,
              "created_utc": 1753742657.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5o90px",
          "author": "ojfs",
          "body": "It's not always about profitability in the case of Google. Free email? Scanning it to enhance primitive LLM / search corpus over the past two decades. Photos? Image recognition patents. Voice? Home microphones? Voice recognition / ai. Google reader and chrome? People's browsing habits. YouTube is arguably for video ai applications, but like Gmail I don't see them sunsetting either of those even though the work is probably \"done\" for their needs. It all goes back to the core offering: search, and ads that support that offering - improving the ad serving logic etc is where their money is.",
          "score": 1,
          "created_utc": 1753734540.0,
          "replies": []
        },
        {
          "id": "n5qpzik",
          "author": "DistinctBackground23",
          "body": "Agree with this. Working at a firm that sells millions of IoT devices, the number one concern is the long term cloud costs.",
          "score": 1,
          "created_utc": 1753765552.0,
          "replies": []
        },
        {
          "id": "n5qsy0b",
          "author": "nagi603",
          "body": "> sunset the service as soon as it stops being profitable? \n\nYou left out a key word: profitable **enough**. And it's never enough. Exponential growth forever or bust.",
          "score": 1,
          "created_utc": 1753767030.0,
          "replies": []
        },
        {
          "id": "n5muep7",
          "author": "angrydeuce",
          "body": "Problem is all the solutions that allow for configuration outside of a locked ecosystem cost a goddamn fortune.\n\n\n\nThey've finally managed to \"carrier lock\" home automation software, so just like cell phones, you'll end up with a bunch of ewaste for no other reason then it wasnt profitable enough for the vendor to support long term and they provided zero avenues to transition to another platform without replacing all the hardware...\n\n\nEdit:  my point wasnt that there aren't free solutions, my point is that the hardware that uses the free solutions are often priced up according to the fact that there isnt an ecosystem lock in with which data scraping can be leveraged to offset the hardware price.\n\n\nBut keep downvoting lmao",
          "score": -4,
          "created_utc": 1753720335.0,
          "replies": [
            {
              "id": "n5mvyod",
              "author": "ChoMar05",
              "body": "I mean, there is HomeAssistant. So far it mostly takes time to find Cloud-Independent Hardware and sometimes it's a bit more expensive, but thats a price I'm easily willing to pay.",
              "score": 12,
              "created_utc": 1753720780.0,
              "replies": []
            },
            {
              "id": "n5mvxnh",
              "author": "theREAL_Harambe",
              "body": "Home assistant is literally free",
              "score": 7,
              "created_utc": 1753720772.0,
              "replies": []
            },
            {
              "id": "n5n8dzy",
              "author": "WesBur13",
              "body": "ESP Home, ZWave, Zigbee and home assistant all work with zero internet connection. Buy the hardware and own it for life",
              "score": 3,
              "created_utc": 1753724167.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5mxxw1",
      "author": "agdnan",
      "body": "Get Home Assistant with Home Assistant Voice. All local and could be enhanced with Local Opensourced AI.",
      "score": 16,
      "created_utc": 1753721339.0,
      "replies": []
    },
    {
      "id": "n5mtgrt",
      "author": "beegtuna",
      "body": "r/killedbygoogle",
      "score": 42,
      "created_utc": 1753720068.0,
      "replies": [
        {
          "id": "n5r3lcr",
          "author": "FeastForCows",
          "body": "Why the fuck is this invite only?",
          "score": 1,
          "created_utc": 1753772801.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5n5kds",
      "author": "J1m1983",
      "body": "This is awful, so many disabled people rely on this tech.",
      "score": 11,
      "created_utc": 1753723401.0,
      "replies": []
    },
    {
      "id": "n5nxf28",
      "author": "james2432",
      "body": "can confirm:\n\ni frequently ask it for setting timers, especially when cooking and don't want to use my phone because hands are dirty.\n\n\nI often ask how much time is left on timer, couple weeks ago it will confirm timer, and when I ask it, it will say: No timers set",
      "score": 7,
      "created_utc": 1753731248.0,
      "replies": []
    },
    {
      "id": "n5n44p8",
      "author": "Narrow-Height9477",
      "body": "Sounds like my Alexa most days.",
      "score": 6,
      "created_utc": 1753723012.0,
      "replies": []
    },
    {
      "id": "n5mpyw5",
      "author": "Giodude12",
      "body": "My dad will be super upset once they sunset Google home, trying to scramble together something with an old thinkstation, ollama and home assistant.",
      "score": 10,
      "created_utc": 1753719062.0,
      "replies": [
        {
          "id": "n5mu2yk",
          "author": "nybble41",
          "body": "You might consider looking into [OpenVoiceOS](https://www.openvoiceos.org/). It's meant as an open-source alternative to tools like Google Assistant. You'll still need something like Home Assistant for the actual automation but this would handle the voice interface. It includes both traditional \"skills\" and support for LLM integration.\n\n(If you've heard of MyCroft—this is a continuation of the same project under more open leadership.)",
          "score": 11,
          "created_utc": 1753720242.0,
          "replies": [
            {
              "id": "n5ok912",
              "author": "wsippel",
              "body": "If you use Home Assistant anyway, you don't need OpenVoiceOS. You can use Home Assistant's native integrations like Wyoming for voice stuff and something like Ollama for AI.",
              "score": 6,
              "created_utc": 1753737778.0,
              "replies": [
                {
                  "id": "n5omv14",
                  "author": "nybble41",
                  "body": "Yes, you can also use the built-in Home Assistant Assist if you're only looking to integrate voice commands with Home Assistant and related components. That will be easier to configure, but each system has pros and cons.",
                  "score": 1,
                  "created_utc": 1753738573.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5mvvfw",
              "author": "Giodude12",
              "body": "Oh this sounds awesome. Anything where I can have standard phrases and implement ollama would be awesome! Bonus if I can give the model access to the internet without piping it through open webui.",
              "score": 6,
              "created_utc": 1753720754.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5nph0f",
      "author": "Snowleopard1469",
      "body": "Never invest in Google hardware. They are constantly abandoning things that aren't wild successes. No being grandfathered in, just shut off and abandoned.",
      "score": 6,
      "created_utc": 1753728946.0,
      "replies": [
        {
          "id": "n5qvn5s",
          "author": "FireLucid",
          "body": "My Google TV/Chromecast dongles still work thankfully.",
          "score": 1,
          "created_utc": 1753768437.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mw15n",
      "author": "dystopiadattopia",
      "body": "Google Assistant blows. The sad thing is that it's still better than Gemini.",
      "score": 9,
      "created_utc": 1753720800.0,
      "replies": []
    },
    {
      "id": "n5mr8lc",
      "author": "DarthWoo",
      "body": "I wonder if this has something to do with mine suddenly turning off every connected light in my house when saying \"lights out\" had previously only turned off the light in the same room as the device for years.",
      "score": 4,
      "created_utc": 1753719422.0,
      "replies": [
        {
          "id": "n5q2132",
          "author": "Jmprappa",
          "body": "Same here. It’s super annoying",
          "score": 1,
          "created_utc": 1753755635.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5s9b6f",
      "author": "NagasShadow",
      "body": "These things need locally hosted servers.  You should be able to download and setup the comand and control software onto your home computer and run it out of your wifi.  You would lose access to some features without internet access, but basic functionality shouldn't be dependant on a remote server.  Never mind what happens when these companies inevitably stop supporting these devices.",
      "score": 4,
      "created_utc": 1753793501.0,
      "replies": []
    },
    {
      "id": "n615p07",
      "author": "Scheeseman99",
      "body": "The only smart home hardware worth buying anymore is anything that works with Home Assistant and doesn't require connecting and authenticating with some cloud service on the internet. Literally everything else has a built-in obsolescence timer.",
      "score": 3,
      "created_utc": 1753902851.0,
      "replies": []
    },
    {
      "id": "n5nbaaq",
      "author": "divestblank",
      "body": "Never expect a Google product to last more than 5 years",
      "score": 7,
      "created_utc": 1753724953.0,
      "replies": []
    },
    {
      "id": "n5mrlxg",
      "author": "None",
      "body": "I can’t wait for the class action on this, pretty sure it falls under planned obsolescence laws.",
      "score": 14,
      "created_utc": 1753719532.0,
      "replies": [
        {
          "id": "n5muwvx",
          "author": "romaraahallow",
          "body": "The past dozen years have been VERY corporate/business friendly. \n\n\nThe consumer can suck it up and keep spending, às far as those in power seem to think.",
          "score": 13,
          "created_utc": 1753720481.0,
          "replies": [
            {
              "id": "n5o1j94",
              "author": "MiaowaraShiro",
              "body": "We haven't been close to effectively regulating business since the new deal... it's ridiculous. \n\nRepublicans seem to have convinced their voters that businesses have society's best interest at heart despite mountains of evidence for centuries that they do not give one tiny shit about society so long as they can make a profit.",
              "score": 1,
              "created_utc": 1753732426.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5pmgoa",
          "author": "sabrenation81",
          "body": "And it'll either get tossed out by a corpo-friendly judge or Google will settle for a pittance, a bunch of fat cat lawyers will get even wealthier, and actual users will get a check for 37 cents 4 years from now.",
          "score": 1,
          "created_utc": 1753750224.0,
          "replies": []
        },
        {
          "id": "n5o62eq",
          "author": "IMissNarwhalBacon",
          "body": "The US has no planned obsolescence laws. \n\nYou must be from Europe.",
          "score": -4,
          "created_utc": 1753733713.0,
          "replies": [
            {
              "id": "n5oa18g",
              "author": "None",
              "body": "You think companies cannot get sued in Europe?",
              "score": 7,
              "created_utc": 1753734826.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5mvb2q",
          "author": "hubs-123",
          "body": "Likely an easy win for Google. I am willing to bet the anti trust campaign against them was a major factor in the death of this segment.",
          "score": -1,
          "created_utc": 1753720592.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mv45n",
      "author": "ACOdysseybeatsRDR2",
      "body": "I have had zero issues, I feel like I shouldn't be based in everything I am reading. I dunno.",
      "score": 3,
      "created_utc": 1753720537.0,
      "replies": [
        {
          "id": "n5paxuz",
          "author": "Fauxparty",
          "body": "It's really weird, I've changed nothing in my setup in the last 5 years of having it (3 speakers, an IR blaster for the aircon and ~7 lights) and it has progressively degraded in that time. I used to be able to show off to people, have my lights/AC automatically switch on before I get home, and switch my lights on/off from anywhere in the house.\n\nNow? \n\nMe: \"Turn on the lights\". \n\nGoogle: \"I don't know how to do that\"\n\nMe: \"Ok Google, turn on all the lights\"\n\nGoogle: \"Ok, turning on the kitchen light\"\n\nMe: \"Turn on ALL of the lights\"\n\nGoogle: \"OK, here's All of the Lights by Ye from Spotify, playing now\"\n\n**plays something else from Spotify**",
          "score": 3,
          "created_utc": 1753746294.0,
          "replies": [
            {
              "id": "n5pbvme",
              "author": "ACOdysseybeatsRDR2",
              "body": "It's so strange because I can do that with zero issues at all, I don't understand how that can happen.",
              "score": 1,
              "created_utc": 1753746602.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5pmqnh",
          "author": "sabrenation81",
          "body": "You're lucky. \n\nThe three minis I have in my house are completely useless. Won't do anything at all. \n\nThe Hub display still works as of now but the other ones died one by one so I fully expect that's the next one to stop functioning.",
          "score": 1,
          "created_utc": 1753750319.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5mxqii",
      "author": "NINJA_DUST",
      "body": "Might be why I told mine I was leaving this morning and it decided to just not turn off any of my lights when its set to turn off all of my lights when I tell it I'm leaving.",
      "score": 3,
      "created_utc": 1753721281.0,
      "replies": []
    },
    {
      "id": "n5mzbbe",
      "author": "xiaopewpew",
      "body": "Isnt this the type of AI we actually need?",
      "score": 3,
      "created_utc": 1753721709.0,
      "replies": []
    },
    {
      "id": "n5n57hv",
      "author": "TheAwesomeMan123",
      "body": "Google as a whole is getting more and more diluted in quality. I feel it’s now become to big and spread too thin across too many sectors to successfully produce a level of quality that other specialised companies do which there is way more competition for now.",
      "score": 3,
      "created_utc": 1753723304.0,
      "replies": []
    },
    {
      "id": "n5n58th",
      "author": "I_T_Gamer",
      "body": "I am very, very close to just disabling the assistant part of my Google Home Max.   Its been absolutely useless...  Moreso than normal!",
      "score": 3,
      "created_utc": 1753723313.0,
      "replies": []
    },
    {
      "id": "n5narjg",
      "author": "Throwaway202411111",
      "body": "I love the *idea* of IOT and smart devices, but this kinda thing justifies my skepticism about the practicality.  \nMy wall switches and dumb motion sensors work perfectly well even if the company that makes them goes under.",
      "score": 3,
      "created_utc": 1753724813.0,
      "replies": []
    },
    {
      "id": "n5pgqxs",
      "author": "ShitStainWilly",
      "body": "As much as I hate Alexa listening to us to advertise to us, it’s always operated all my smart shit flawlessly. Unbelievable that google’s dropping the ball on this.",
      "score": 3,
      "created_utc": 1753748255.0,
      "replies": []
    },
    {
      "id": "n5sar30",
      "author": "rlnrlnrln",
      "body": "Another Google product killed by Googles internal promotion practices. Good Job, Google!",
      "score": 3,
      "created_utc": 1753793994.0,
      "replies": []
    },
    {
      "id": "n5mw4yf",
      "author": "ChoMar05",
      "body": "Just scrolling through the comments and noone is mentioning HomeAssistant? Well, there is someone now.",
      "score": 6,
      "created_utc": 1753720830.0,
      "replies": []
    },
    {
      "id": "n5mtapr",
      "author": "markbraggs",
      "body": "I got rid of my very last Google home speaker and nest camera a couple weeks back. End of an era.",
      "score": 2,
      "created_utc": 1753720019.0,
      "replies": []
    },
    {
      "id": "n5my8qb",
      "author": "WardenEdgewise",
      "body": "Our house came with a Google doorbell. Making an account and activating the stupid this was a major hassle. It never worked. Finally the electrician came back and put in a regular old analog doorbell.",
      "score": 2,
      "created_utc": 1753721420.0,
      "replies": [
        {
          "id": "n5o7728",
          "author": "IMissNarwhalBacon",
          "body": "I'd argue the old doorbells are digital.  The literal definition of an on/off bit.",
          "score": 0,
          "created_utc": 1753734031.0,
          "replies": [
            {
              "id": "n5ok6ow",
              "author": "Donkeywad",
              "body": "They use a mechanical button to activate a chime. They're the literal definition of analog.",
              "score": 2,
              "created_utc": 1753737759.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5my9fn",
      "author": "NotAnotherBlingBlop",
      "body": "Gemini is even worse. It can't even give me directions to an address in my contacts.",
      "score": 2,
      "created_utc": 1753721426.0,
      "replies": []
    },
    {
      "id": "n5n06tz",
      "author": "Cee_U_Next_Tuesday",
      "body": "I can't wait for a corporate gaslighting that says \"there is no problem with our system\"",
      "score": 2,
      "created_utc": 1753721942.0,
      "replies": []
    },
    {
      "id": "n5n2shv",
      "author": "Feeling_Reindeer2599",
      "body": "I’m sorry Dave, I’m afraid I can’t do that right now. 🤣🤣🤣",
      "score": 2,
      "created_utc": 1753722647.0,
      "replies": []
    },
    {
      "id": "n5n662y",
      "author": "Dr_Jabroski",
      "body": "If it can't run local then this will always happen. Either side of the equation (the controller or the device) will eventually become unsupported through enshitification, \"obsolescence\", or the company disappearing. If someone else is in the loop you don't actually own the thing.",
      "score": 2,
      "created_utc": 1753723565.0,
      "replies": []
    },
    {
      "id": "n5n9l7h",
      "author": "t2guns",
      "body": "My assistant in Google Maps will listen to me and then just shut off after it computes what I say.",
      "score": 2,
      "created_utc": 1753724494.0,
      "replies": []
    },
    {
      "id": "n5ncn62",
      "author": "CriminalSavant",
      "body": "Alexa and Hue aren't any better, both have started to fail over the last two years. Development has completely stalled out on all these smart home platforms.",
      "score": 2,
      "created_utc": 1753725319.0,
      "replies": []
    },
    {
      "id": "n5nle2i",
      "author": "Dominio90049",
      "body": "Another fantastic product support product from Google. It will go the way of Stadia and other failed consumer products",
      "score": 2,
      "created_utc": 1753727781.0,
      "replies": []
    },
    {
      "id": "n5noukt",
      "author": "onoz9",
      "body": "https://killedbygoogle.com\n\nIt's their thing!",
      "score": 2,
      "created_utc": 1753728769.0,
      "replies": []
    },
    {
      "id": "n5np7im",
      "author": "Aleksandrovitch",
      "body": "Alexa is no better. I’ve uninstalled it and flicked my lights the old fashioned way.",
      "score": 2,
      "created_utc": 1753728871.0,
      "replies": []
    },
    {
      "id": "n5npzcw",
      "author": "finaempire",
      "body": "I was all on on this smart home thing. I had these utopian views of the world where I’d be able to control my energy consumption more, make life more effecient, etc. in my infinite wisdom, it’s clear they aren’t making products for us, they make products out of us. I’m tired of this. I invested in their products and truly believed in the idea that I give a little and they give a little. Google be damned. I’m stripping all the devices from my house and not looking back.",
      "score": 2,
      "created_utc": 1753729092.0,
      "replies": []
    },
    {
      "id": "n5nrq0m",
      "author": "ToMorrowsEnd",
      "body": "Cloud home automation is always a failure.  Samsung Smart Things failed and it was before  the googs.   Dont buy cloud enabled crap.",
      "score": 2,
      "created_utc": 1753729604.0,
      "replies": []
    },
    {
      "id": "n5nvnsy",
      "author": "VagueSomething",
      "body": "This is your punishment for being lazy and thinking a company that abandons every product line would totally change its mind for these toys.\n\n\nThis kind of thing is devastating for the disabled and honestly it may need legal protection in the future to stop the most vulnerable being caught out.",
      "score": 2,
      "created_utc": 1753730743.0,
      "replies": []
    },
    {
      "id": "n5nwpj4",
      "author": "smftexas86",
      "body": "So what is the better solution?\n\nWe bought into google speakers also, but are finding it getting worse and worse. We don't even really use lights etc anymore, but even basic things like \"where is my phone\" and \"answer me this\" has gotten worse.",
      "score": 2,
      "created_utc": 1753731044.0,
      "replies": []
    },
    {
      "id": "n5nxq83",
      "author": "SpartyEsq",
      "body": "I'm pretty certain they replaced the backbone of Google home with generative AI and a lot of the problems people are facing are hallucinations in recognizing or converting the responses to function calls. I had an issue the other day where asking my kitchen speaker to turn on the lights turned on the right-side bedroom lamp, not the kitchen lights in the same room as the assistant. \n\nthis over-aggressive push for AI in everything is so worthless and frustrating.",
      "score": 2,
      "created_utc": 1753731338.0,
      "replies": []
    },
    {
      "id": "n5o127c",
      "author": "lk897545",
      "body": "Trusting google with paid hardware rarely works out for anyone.",
      "score": 2,
      "created_utc": 1753732293.0,
      "replies": []
    },
    {
      "id": "n5okzar",
      "author": "RoamingGnome74",
      "body": "I’ll never have a smart home. I’m suspicious of it.",
      "score": 2,
      "created_utc": 1753737997.0,
      "replies": []
    },
    {
      "id": "n5pbiyz",
      "author": "USDXBS",
      "body": "The only way I'd ever have a \"Smart\" home is if everything is self contained within the house.\n\nIf I want to turn a light on, it's between me and my house. A third party company doesn't need to be involved.",
      "score": 2,
      "created_utc": 1753746485.0,
      "replies": []
    },
    {
      "id": "n5pfdh1",
      "author": "UnlikelyOpposite7478",
      "body": "Feels dumb to break something that actually worked better than most new AI stuff.",
      "score": 2,
      "created_utc": 1753747781.0,
      "replies": []
    },
    {
      "id": "n5pne7n",
      "author": "Geekygamertag",
      "body": "If only there was some manual way to switch the lights off and on!",
      "score": 2,
      "created_utc": 1753750541.0,
      "replies": []
    },
    {
      "id": "n5q7rjf",
      "author": "nipple_salad_69",
      "body": "lol we told ya so!",
      "score": 2,
      "created_utc": 1753757748.0,
      "replies": []
    },
    {
      "id": "n5qmo9j",
      "author": "petersrin",
      "body": "It's hilariously bad at everything and has been for years. There was a little hope when Gemini first launched because it was somehow better than the terrible state of Google assistant but it quickly devolved into more of the same.",
      "score": 2,
      "created_utc": 1753763993.0,
      "replies": []
    },
    {
      "id": "n5rg7rk",
      "author": "280EvoGTR",
      "body": "I use mine every night with no issues",
      "score": 2,
      "created_utc": 1753780116.0,
      "replies": []
    },
    {
      "id": "n5rivau",
      "author": "Narrow_Ad_1494",
      "body": "google home is completely broken and assistant is the only was i can control my stuff remotely now. at least i didn’t pay the monthly subscription 🙄",
      "score": 2,
      "created_utc": 1753781652.0,
      "replies": []
    },
    {
      "id": "n5rj83t",
      "author": "FeebysPaperBoat",
      "body": "Enshitification and Google are becoming synonymous.",
      "score": 2,
      "created_utc": 1753781856.0,
      "replies": []
    },
    {
      "id": "n5rmqux",
      "author": "ArtoisDuchamps",
      "body": "It's almost like when purchasing something, one should review the history of the seller...",
      "score": 2,
      "created_utc": 1753783814.0,
      "replies": []
    },
    {
      "id": "n5rpnf4",
      "author": "-RUS92-",
      "body": "Not bad for me, but I have noticed some changes. I used to say \"Turn bedroom light on\" and it would understand. Now I need to put the word \"The\" or it has a hissy fit \"Turn THE bedroom light on\". Not the end of the world type thing, but stillna change nevertheless.",
      "score": 2,
      "created_utc": 1753785357.0,
      "replies": []
    },
    {
      "id": "n5rxubo",
      "author": "jakgal04",
      "body": "This is why I can't commit to anything with Google. They have a fetish for ecosystem rot.",
      "score": 2,
      "created_utc": 1753789134.0,
      "replies": []
    },
    {
      "id": "n5s1fcu",
      "author": "RockSteady71",
      "body": "My lights will sometimes work. A few months ago they worked perfectly. For any who have not removed your lights to attempt to add them back, DON’T.",
      "score": 2,
      "created_utc": 1753790586.0,
      "replies": []
    },
    {
      "id": "n5s26m2",
      "author": "Lava-Jacket",
      "body": "What did I tell these people about smart devices in your home ... WHAT I SAY?!",
      "score": 2,
      "created_utc": 1753790884.0,
      "replies": []
    },
    {
      "id": "n5sb570",
      "author": "SmokelessSubpoena",
      "body": "I'm glad I'm not the only one yelling \"hey google...\" to get a \"I'm sorry I don't understand\" response. It's gotten _100×_ worse in the past year alone, its insane.",
      "score": 2,
      "created_utc": 1753794129.0,
      "replies": []
    },
    {
      "id": "n5t0155",
      "author": "Confirmed_AM_EGINEER",
      "body": "The google assistant was great. \n\nGemini is not great.",
      "score": 2,
      "created_utc": 1753801705.0,
      "replies": []
    },
    {
      "id": "n5te8ac",
      "author": "dekyos",
      "body": "shit like this is why I'm actively working towards eliminating Alexa and running a local LLM + Wyoming Satellite connected to HomeAssistant in my home.\n\nI've been HA from day 1 so the transition will be a lot easier than if I had built everything up in Amazon's ecosystem. But all of them, Google, Apple, Amazon, they're collecting data from this even if they say they aren't. They've all already been caught at least once, and I don't think they just complied after the suits, I'm fairly confident they just change their methodology. It's just too valuable of a commodity for these greedy fucks to close the door on.",
      "score": 2,
      "created_utc": 1753805685.0,
      "replies": []
    },
    {
      "id": "n5x02ty",
      "author": "XuX24",
      "body": "At this point I just wish for it to die and get full integration with Alexa or something else because they don’t do anything with the huge ecosystem they have.",
      "score": 2,
      "created_utc": 1753845616.0,
      "replies": []
    },
    {
      "id": "n5z1k7f",
      "author": "wisym",
      "body": "Gemini also seems to hear things much worse than Assistant does. A couple weeks ago I asked it to set a reminder for me and it butchered the time and what I wanted to be reminded of.",
      "score": 2,
      "created_utc": 1753881064.0,
      "replies": []
    },
    {
      "id": "n602jwb",
      "author": "defineReset",
      "body": "This is why I don't touch Google hardware. They do this with practically every product.",
      "score": 2,
      "created_utc": 1753892040.0,
      "replies": []
    },
    {
      "id": "n64593q",
      "author": "parabostonian",
      "body": "How many things are going to break technology wise because C suites and boards of directors are masturbating furiously over AI letting them fire tons of people all so their products can become unusable?\n\nWhen do the robots kill us all?! I hope it’s soon.",
      "score": 2,
      "created_utc": 1753939625.0,
      "replies": []
    },
    {
      "id": "n5mzvo4",
      "author": "dieselfrog",
      "body": "This is what you get for buying and supporting Google products.  They are elite when it comes to grabbing all of your data and showing you ads.  Their products are balls.  When you realize that they exist only to exploit you, you will soon move to de-google your life completely.  There are many, many other options.",
      "score": 3,
      "created_utc": 1753721860.0,
      "replies": [
        {
          "id": "n5od663",
          "author": "Old-Rhubarb-97",
          "body": "Their products are great, their support for those products is unbelievably bad. \n\n\nWhen it was fully supported, nest home was great. Having smart speakers (with hardware mutable microphone!) throughout your home, connected to your door bell and smoke detectors was easy to set up and worked great. ",
          "score": 1,
          "created_utc": 1753735708.0,
          "replies": [
            {
              "id": "n5scxmo",
              "author": "dieselfrog",
              "body": "This seems to be the pattern with Google.  Create high-quality products, then let them fade away over time.  It's like they have A.D.D. and can't concentrate on one thing for too long.  Either way, the primary objective is to harvest your data so they can feed the ad machine.  I live a strictly google-free life at this point.  There are many other options - especially/even their search engine.",
              "score": 1,
              "created_utc": 1753794734.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5mp6ak",
      "author": "TheStormbrewer",
      "body": "Holy Title Case Batman!",
      "score": 5,
      "created_utc": 1753718838.0,
      "replies": []
    },
    {
      "id": "n5mx446",
      "author": "TheSpatulaOfLove",
      "body": "If there is no local control, I’m not buying it anymore.    Especially Google products.",
      "score": 2,
      "created_utc": 1753721106.0,
      "replies": []
    },
    {
      "id": "n5n3oiz",
      "author": "FrozenLogger",
      "body": "This is hilarious.\n\nWhy would anyone attach their house to a corporation? Even worse, why would you allow voice controls that you don't control?",
      "score": 4,
      "created_utc": 1753722891.0,
      "replies": [
        {
          "id": "n5n8kw6",
          "author": "Neo_Techni",
          "body": "my wife is handicapped and being able to turn on/off lights/AC by voice is very helpful to her.",
          "score": 9,
          "created_utc": 1753724220.0,
          "replies": [
            {
              "id": "n5n9ai8",
              "author": "FrozenLogger",
              "body": "I wasn't commenting on voice control, it was a comment of handing *that duty* over to a corporation.\n\nYou have a very valid and important use case. I wouldn't ask a third party to handle that responsibility without a contract... in my favor. \n\nYou can get voice control that you manage. And that can never be taken away.",
              "score": 3,
              "created_utc": 1753724413.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5qu1ey",
          "author": "nagi603",
          "body": "Because strictly speaking, even Home Assistant is a corporation. That's the level of your argument. \"Don't do anything\". Because even if you write the SW (ultimately maintained by a corporation or foundation) you still need HW. (Even if you home-etch a pcb, you'll need material. From a corporation.)",
          "score": -1,
          "created_utc": 1753767595.0,
          "replies": [
            {
              "id": "n5rnxk7",
              "author": "gSTrS8XRwqIV5AUh4hwI",
              "body": "That's a nonsensical reply.\n\nThe comment was about \"attaching\" your house to a corporation, i.e., about making the functioning of your home dependent on the continued cooperation and reliable operation of a specific corporation.\n\nWhen I put in a physical light switch, I buy that light switch from a corporation. But that doesn't make me in any way dependent on that corporation. That corporation can not make any decision that makes my light switch change its behavior or that makes it stop functioning. The corporation can go under, and I can still use the light switch for decades without any change in functionality. For that matter, I have no idea what the corporation that made the light switches in my house is up to, or if they even still exist. That's how non-attached my house is to that corporation.\n\nAnd if a light switch ever were to fail, it still doesn't matter. There are plenty of corporations that produce light switches, and I could just buy one from any one of them to replace the broken one. I wouldn't have to replace all light switches, I wouldn't have to replace cables, I wouldn't have to replace lamps, ... just a new switch from whatever corporation. That's how non-attached my house is to that corporation.\n\nAnd basically the same thing is true for local-only smart home stuff with open protocols and projects like home assistant. If the organisation behind HA were to go under, you could still at the very least keep using your existing setup. And if the hardware of your HA installation failed for some reason, you could buy just about any small computer as replacement, from just about any manufacturer, and restore a backup on there and still keep using it.\n\nAnd also, with HA being Free Software, you can even still extend and improve the software if the organization were to go under or decided to abandon the project. And if there were sufficiently many interested parties, they also could just found a new organization to take over development. Which is to say: The organization behind HA does not have the power to unilaterally decide to end the project, at most they can stop contributing.\n\nWhich is to say: You are not dependent on that corporation in a way even remotely comparable to how, if Google decides to change their product in a way that makes it dysfunctional for you but improves their profits, you can only live with it or throw it all out, which in turn makes them do these things in the first place, because they know you have no other options.",
              "score": 1,
              "created_utc": 1753784453.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5mtz0k",
      "author": "rapaciousdrinker",
      "body": "What's also shitty is that on pixel phones outside of the very small minority of countries they support, you get no access to gemini.\n\nActually you get no access to a lot of things, even basic phone features like VoLTE, vowifi, RCS messaging, and 5G.\n\nI'm talking about the majority of the world here. Entire continents unsupported. Who knows what using a pixel phone is going to be like once assistant is fully lobotomized.",
      "score": 5,
      "created_utc": 1753720211.0,
      "replies": [
        {
          "id": "n5ql4kv",
          "author": "surlygoat",
          "body": "Really? I'm surprised that in Australia we've been getting all of that for years, if other places aren't",
          "score": 3,
          "created_utc": 1753763284.0,
          "replies": [
            {
              "id": "n5qne5g",
              "author": "rapaciousdrinker",
              "body": "It's the reason apps like PixelIMS exist. Google hard disables those features in most countries and you need hacks just to enable them. \n\nThe reason given for this on the Google support forums is that it costs a few pennies to certify their phones with carriers. Budget Android phones from China will work just fine but google doesn't see that as a reasonable expense. So they just disable the features whether they would otherwise work or not.",
              "score": 1,
              "created_utc": 1753764322.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5mxd19",
          "author": "More_cloudberries",
          "body": "I feel the pain in Europe. Not the pixel issues but my Google Home will only play the radio for an entirely different country even if I beg it to correct itself, and it refuses to understand the grammar of the language I have used to control it with in the past. Like it will try to correct me, and even if I use their (faulty) version of my language’s grammar it still won’t add to my shopping list etc. Unusable and very condescending.",
          "score": 3,
          "created_utc": 1753721176.0,
          "replies": []
        },
        {
          "id": "n5prk1w",
          "author": "bert93",
          "body": "It'll be completely fine once assistant is lobotomized.\n\nSource: me, someone who disabled that crap years ago.",
          "score": 1,
          "created_utc": 1753751974.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5muvlo",
      "author": "hubs-123",
      "body": "It is because of a lot of things but biggest is legal. Google has been facing more anti trust lawsuits. So letting this segment go was likely strategic.",
      "score": 2,
      "created_utc": 1753720469.0,
      "replies": []
    },
    {
      "id": "n5mxx0t",
      "author": "KrackSmellin",
      "body": "Sounds like how Nest is… on life support with a dev team that isn’t going anything great… like the sloths at DMV…’doing the minimum to keep things going.",
      "score": 2,
      "created_utc": 1753721332.0,
      "replies": []
    },
    {
      "id": "n5nnuap",
      "author": "BluePanda101",
      "body": "I never understood the appeal of these products in the first place. What was wrong with light switches and thermostats? Were people really too lazy to get up and walk a few feet for the lights?",
      "score": 2,
      "created_utc": 1753728481.0,
      "replies": [
        {
          "id": "n5nquz5",
          "author": "Chronotaru",
          "body": "As someone who may forget why he had got up on the way to turn off the lights, this is useful. For a regular person, not so much.",
          "score": 2,
          "created_utc": 1753729350.0,
          "replies": [
            {
              "id": "n5nrk2f",
              "author": "BluePanda101",
              "body": "I saw someone else post about how it helped out their disabled spouse, and that also made sense as an argument for these devices. Still these things were much more broadly adopted than just people who needed them for accessibility reasons.",
              "score": 1,
              "created_utc": 1753729556.0,
              "replies": [
                {
                  "id": "n5nvj8v",
                  "author": "Chronotaru",
                  "body": "If it were just for accessibility reasons there wouldn't be the needed customer base for it to be affordable though, so it's good that people use them for the convenience/lazy/coolness factor too from that perspective.",
                  "score": 2,
                  "created_utc": 1753730706.0,
                  "replies": [
                    {
                      "id": "n5nws4l",
                      "author": "BluePanda101",
                      "body": "Why can't something niche be affordable? There's plenty of niche hobbies that aren't expensive, there's no reason these couldn't be made at a smaller scale. ",
                      "score": 1,
                      "created_utc": 1753731064.0,
                      "replies": [
                        {
                          "id": "n5nzoue",
                          "author": "Chronotaru",
                          "body": "The amount of development required, especially when they launched and voice recognition was in its relative infancy, was vast. Operating losses for Alexa are to date $5bn.",
                          "score": 1,
                          "created_utc": 1753731901.0,
                          "replies": [
                            {
                              "id": "n5o31tr",
                              "author": "BluePanda101",
                              "body": "Why are you rolling the cost of speech recognition tech into the price of these gadgets? It's not as though speech recognition was developed solely for them, or as though these were the only possible applications for that tech. Dragon naturally speaking was a voice to text application available years before these things were made that was just to help people with disabilities type. Phone now also use speech to text as a standard feature. Voice recognition development was not a cost of making these devices it was a dependency (it had to be made first). I'd be absolutely shocked if Alexa wasn't fabulously profitable when corporations don't cook their books. The cost to put a bit more computing power in a thermostat or speaker was not anywhere near high enough it was a loss of 5 billion. Get out of here with that absolute nonsense.",
                              "score": 1,
                              "created_utc": 1753732860.0,
                              "replies": [
                                {
                                  "id": "n5qydqp",
                                  "author": "Chronotaru",
                                  "body": "There are many things that make up that $5bn, but the ability to purchase a device at a subsidized $30 on sale, talk to it, have it process and respond, run macros, communicate to other devices, respond somewhat intelligently, many more things. All of this are service costs. This is a massive money hole.",
                                  "score": 1,
                                  "created_utc": 1753769913.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n5qkzgu",
          "author": "surlygoat",
          "body": "Eh. As an example of it's usefulness, my coffee machine takes about 20 minutes to warm up. When I wake up I can tell it to turn on the coffee machine in the kitchen, and by the time I get out there, it's ready to go. A minor convenience but a welcome one on a cold morning. Sure you could set a manual timer but I get up at different times...",
          "score": 1,
          "created_utc": 1753763220.0,
          "replies": []
        },
        {
          "id": "n5r08rs",
          "author": "MakeMine5",
          "body": "They were great for my dad in his last years when he had limited mobility.",
          "score": 1,
          "created_utc": 1753770942.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5nt9jt",
      "author": "edmozley",
      "body": "If your house requires 3rd party servers to function at a basic level then you are making bad choices.",
      "score": 2,
      "created_utc": 1753730052.0,
      "replies": [
        {
          "id": "n5nukvv",
          "author": "Plg_Rex",
          "body": "Preach!",
          "score": 2,
          "created_utc": 1753730429.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5pqel7",
      "author": "Carpaccio",
      "body": "JFC, a light switch will always be easier.",
      "score": 2,
      "created_utc": 1753751573.0,
      "replies": []
    },
    {
      "id": "n5mv6o6",
      "author": "GlxxmySvndxy",
      "body": "![gif](giphy|EDt1m8p5hqXG8)\n\nGood thing I get up and turn my lights on and off manually",
      "score": 1,
      "created_utc": 1753720557.0,
      "replies": []
    },
    {
      "id": "n5n2vvg",
      "author": "brmarcum",
      "body": "LOL my wall switch works perfectly fine",
      "score": 2,
      "created_utc": 1753722674.0,
      "replies": []
    },
    {
      "id": "n5mt3hn",
      "author": "mistahelias",
      "body": "Here I thought I couldn’t be heard and had to use the app to turn my lights off when I laid down for the night.",
      "score": 1,
      "created_utc": 1753719962.0,
      "replies": []
    },
    {
      "id": "n5n2712",
      "author": "wafair",
      "body": "It’s like people never even saw Maximum Overdrive",
      "score": 1,
      "created_utc": 1753722486.0,
      "replies": []
    },
    {
      "id": "n5n3dis",
      "author": "Old-Assistant7661",
      "body": "Using the microphone on my pixel to search YouTube no longer works. Same with my Sony TVs android voice search. To be honest I'm starting to think removing myself from the Google ecosystem might not be a bad idea. ",
      "score": 1,
      "created_utc": 1753722807.0,
      "replies": []
    },
    {
      "id": "n5n3iw4",
      "author": "AdGeHa",
      "body": "Google Assistant performance has been more than frustrating lately!",
      "score": 1,
      "created_utc": 1753722848.0,
      "replies": []
    },
    {
      "id": "n5n66m3",
      "author": "toythief",
      "body": "Besides Alexa are there any good alternatives?",
      "score": 1,
      "created_utc": 1753723569.0,
      "replies": [
        {
          "id": "n5nyaci",
          "author": "AlienInUnderpants",
          "body": "Alexa isn’t a good alternative either. My experience has been degrading for a couple years now. \n\nI’ve started researching local (non-connected) home built options. I wish I had more advice but just started my research.",
          "score": 1,
          "created_utc": 1753731499.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5n6934",
      "author": "CokBlockinWinger",
      "body": "I got one of these for free with …. crap I don’t even remember what it was I bought it was so long ago. It sat in the box for a year, I have no real use for it, so I stuck it in the rafters of my workshop and use it to play music. That’s it.",
      "score": 1,
      "created_utc": 1753723587.0,
      "replies": []
    },
    {
      "id": "n5n6h24",
      "author": "DYMongoose",
      "body": "Yesterday evening I set a reminder (on my pixel) to turn off the sprinklers in 30 minutes. The reminder came up on the bedroom display (that I was nowhere near when I set the reminder) 30 minutes late, and my pixel this morning at 3 am. \n\nThanks, Google.",
      "score": 1,
      "created_utc": 1753723647.0,
      "replies": []
    },
    {
      "id": "n5n6kk4",
      "author": "BacktotheTruther",
      "body": "“Set Nest to 69.” “9 lights set to 69 percent.”",
      "score": 1,
      "created_utc": 1753723674.0,
      "replies": []
    },
    {
      "id": "n5n6mr9",
      "author": "TheDkone",
      "body": "what are you saying?  Google doesn't abandon stuff... err, wait, nvm.  Can't wait until they get into the health care business....",
      "score": 1,
      "created_utc": 1753723690.0,
      "replies": []
    },
    {
      "id": "n5n74vp",
      "author": "cdnmoon",
      "body": "Routines never worked for me and lately the lights are being fussy. I can do it through the app, but verbal commands aren't working :/",
      "score": 1,
      "created_utc": 1753723825.0,
      "replies": []
    },
    {
      "id": "n5n87lb",
      "author": "correctingStupid",
      "body": "Now? Started giving me trouble years ago until I decided to trash them all. Thought of using voice to control my lights hasn't occurred to me again up until now. I'm so relieved I don't have to deal with the constant hassle. ",
      "score": 1,
      "created_utc": 1753724119.0,
      "replies": []
    },
    {
      "id": "n5ne9cf",
      "author": "shadow-banner25",
      "body": "I just use Google Home Mini for weather, cook timer and play pranks. You can ask \"hey Google! Burp!\" or \"Hey Google! Fart!\"\n😂",
      "score": 1,
      "created_utc": 1753725763.0,
      "replies": []
    },
    {
      "id": "n5nfq9n",
      "author": "karateninjazombie",
      "body": "As long as my chrome cast Ulta keeps working I don't care for other connected devices. Never been a fan.",
      "score": 1,
      "created_utc": 1753726174.0,
      "replies": []
    },
    {
      "id": "n5ng2at",
      "author": "ChopsNewBag",
      "body": "Oh no! What are we gonna do?",
      "score": 1,
      "created_utc": 1753726267.0,
      "replies": []
    },
    {
      "id": "n5nh3yq",
      "author": "comicidiot",
      "body": "I can’t even ask Google Home if the year is 2025. It gives me web results, but if I ask what year it is, Google tells me the date which includes the year.",
      "score": 1,
      "created_utc": 1753726562.0,
      "replies": []
    },
    {
      "id": "n5nivlm",
      "author": "TheRealSeeThruHead",
      "body": "Haven’t people learned to never rely on google products",
      "score": 1,
      "created_utc": 1753727063.0,
      "replies": []
    },
    {
      "id": "n5njmwp",
      "author": "globefish23",
      "body": "*\"I'm sorry Dave, I'm afraid I can't do that.\"*\n\n--GOOGL 9000",
      "score": 1,
      "created_utc": 1753727279.0,
      "replies": []
    },
    {
      "id": "n5njvzg",
      "author": "hahanarf",
      "body": "Me: \"turn off the lights\"\nGA: \"ok turning off 7 lights and the coffee maker in a different room \"",
      "score": 1,
      "created_utc": 1753727349.0,
      "replies": []
    },
    {
      "id": "n5nlqct",
      "author": "byoda_2",
      "body": "50% of code by AI",
      "score": 1,
      "created_utc": 1753727879.0,
      "replies": []
    },
    {
      "id": "n5nmza5",
      "author": "buffalucci",
      "body": "Yeah, mine is like 70% effective at this point.",
      "score": 1,
      "created_utc": 1753728234.0,
      "replies": []
    },
    {
      "id": "n5notkn",
      "author": "mayorofanything",
      "body": "It was dead the second it stopped allowing Spotify alarms.",
      "score": 1,
      "created_utc": 1753728761.0,
      "replies": []
    },
    {
      "id": "n5nt9cb",
      "author": "Chonngau",
      "body": "I considered getting a nest thermostat, but then I realized that it will for sure get bricked at some point by Google. Pixels look like great phones, but I just don’t dare get one.",
      "score": 1,
      "created_utc": 1753730050.0,
      "replies": []
    },
    {
      "id": "n5nv0ep",
      "author": "badenbagel",
      "body": "Google Assistant on life support feels like that friend who ghosted but you’re still holding out hope.",
      "score": 1,
      "created_utc": 1753730555.0,
      "replies": []
    },
    {
      "id": "n5nvh0r",
      "author": "stacecom",
      "body": "I have the mics muted on mine and just use them as speakers and TTS targets in Home Assistant.",
      "score": 1,
      "created_utc": 1753730688.0,
      "replies": []
    },
    {
      "id": "n5nw9sd",
      "author": "AlienInUnderpants",
      "body": "Alexa is the same way. Every 2-3 months the device stops controlling my devices for a few days.",
      "score": 1,
      "created_utc": 1753730918.0,
      "replies": []
    },
    {
      "id": "n5nwqui",
      "author": "jmo1",
      "body": "Alexa is also worse ha. Idk if it’s just every app making changes but turning lights on is always a struggle without perfect wording",
      "score": 1,
      "created_utc": 1753731054.0,
      "replies": []
    },
    {
      "id": "n5nzvwu",
      "author": "Bobvankay",
      "body": "Gemini won't let me make phone calls I discovered, real bummer I was great in the car.",
      "score": 1,
      "created_utc": 1753731957.0,
      "replies": []
    },
    {
      "id": "n5nzx2o",
      "author": "LB3PTMAN",
      "body": "It’s absolutely insane how people trust Google products anymore honestly. 90% of googles new products launch and are dead within a few years. Off the top of my head alone I’m in the five to ten range.",
      "score": 1,
      "created_utc": 1753731967.0,
      "replies": []
    },
    {
      "id": "n5o04ch",
      "author": "gr8timesb4",
      "body": "It’s a mess. No music the last week.",
      "score": 1,
      "created_utc": 1753732024.0,
      "replies": []
    },
    {
      "id": "n5o30vv",
      "author": "bullcitytarheel",
      "body": "Hell yeah so happy the President is gonna force everything to be on AI",
      "score": 1,
      "created_utc": 1753732852.0,
      "replies": []
    },
    {
      "id": "n5o4kqy",
      "author": "gorkish",
      "body": "Imagine having to trudge through every day at work maintaining all this legacy NLP nonsense for Siri, Alexa, or Google Assistant now that LLMs exist. It’s not really very surprising to see the current versions of these products suffer. The business decisions to have an arms war on pre-LLM language agents may not have been the best idea in retrospect",
      "score": 1,
      "created_utc": 1753733293.0,
      "replies": []
    },
    {
      "id": "n5o56mo",
      "author": "NezuminoraQ",
      "body": "I had to completely disable gemini as it would interrupt maps while I was driving. ",
      "score": 1,
      "created_utc": 1753733463.0,
      "replies": []
    },
    {
      "id": "n5o5jcv",
      "author": "humanman42",
      "body": "looks like I need to get home assistant going again so everything is local.",
      "score": 1,
      "created_utc": 1753733564.0,
      "replies": []
    },
    {
      "id": "n5o5rbm",
      "author": "shifter2000",
      "body": "Fucking. Gemini.\n\nI hate this POS.\n\nI mean Assistant wasn't exactly great, but ever since I upgraded by phone (and subsequently, it added Gemini), it's been a struggle.\n\nGemini on my phone seems to have a delay in it which causes all sorts of chaos in my home.\n\nIf I ask one of my multiple Google Assistant speakers in my various rooms to do something, Gemini will then activate on my phone about 1 second AFTER Assistant has already done the thing. Or, it will only hear PART of what Ive said, and do one of two things. Either give me a run down on some part of the conversation it's heard (No, I don't want a history lesson on the invention of 'Air conditioning'), *or* it will do the complete OPPOSITE of what I want (case-in-point, the other day I asked it to turn off the heatpump in my son's bedroom...instead it turned ON all of the heatpump units in the home - which is a similar situations with the lights).\n\nIt's like one isn't talking to the other, yet they're both Google devices. I don't understand how this is so difficult.",
      "score": 1,
      "created_utc": 1753733625.0,
      "replies": []
    },
    {
      "id": "n5ocvkq",
      "author": "Bytowneboy2",
      "body": "I learned early in my home automation journey to never purchase anything tied to a cloud. The cloud is just someone else’s computer and someday they will turn that computer off, usually well before I’m done with that device. Just two that come to mind: Logitech Harmony; Belkin WeMo. \n\nThrow your money at anything that is processed locally.",
      "score": 1,
      "created_utc": 1753735626.0,
      "replies": []
    },
    {
      "id": "n5oe6i4",
      "author": "SoCaFroal",
      "body": "The Home Assistant voice preview isn't bad but you need to get up to speed on Home Assistant. It's not fully featured yet either.",
      "score": 1,
      "created_utc": 1753735991.0,
      "replies": []
    },
    {
      "id": "n5oec35",
      "author": "nyc-will",
      "body": "This is why I never got into \"smart\" or \"connected\" devices.",
      "score": 1,
      "created_utc": 1753736035.0,
      "replies": []
    },
    {
      "id": "n5oeidk",
      "author": "DuperCheese",
      "body": "Ask it to open the pod bay doors",
      "score": 1,
      "created_utc": 1753736084.0,
      "replies": []
    },
    {
      "id": "n5ohamw",
      "author": "neuauslander",
      "body": "Just use the light switch. How did they manage before google.",
      "score": 1,
      "created_utc": 1753736902.0,
      "replies": []
    },
    {
      "id": "n5ohbdd",
      "author": "roueGone",
      "body": "It is the worst. I used to use Google assistant to make hands free calls when driving for years. Suddenly the new Gemini has decided that feature is no longer supported. Why?! ",
      "score": 1,
      "created_utc": 1753736908.0,
      "replies": []
    },
    {
      "id": "n5ohsu9",
      "author": "PunningWild",
      "body": "I've stopped trying using the voice assistant on my Google phone. It just straight-up doesn't work anymore. I've transitioned to the more manual method of mounting an old Android tablet to my wall and having it be a dedicated Google Home App device. Looks neat, quite proud of it, but nowhere near as convenient as just asking to change the lights to one of my many presets.",
      "score": 1,
      "created_utc": 1753737050.0,
      "replies": []
    },
    {
      "id": "n5ojakk",
      "author": "Apical-Meristem",
      "body": "Garbage like this why I try to stay away from Google products, and a lot of their types of products in general.  Unfortunately, my car has Google baked in and so much of it is glitchy, poorly thought out and in general frustrating.  Someone gave us an Alexa.  I think we tried to give it away.  Maybe we threw it out.  We got a Ring doorbell as a gift.  The response time and total experience was poor.  When they wanted $ for a subscription, I disconnected it from our internet and deleted the app.",
      "score": 1,
      "created_utc": 1753737490.0,
      "replies": []
    },
    {
      "id": "n5oo894",
      "author": "I_argue_for_funsies",
      "body": "My Google home hub has become very unreliable. Commands work usually 75% of the time. \n\nI've started asking \"Hey Google.  What does AI say about...\" \n\nAnd I'll often get those failed requests to work.\n\nMy suspicion is that they want to migrate the assistant to Gemini but trying to do it without customers noticing.\n\nBut... Here we are.",
      "score": 1,
      "created_utc": 1753738985.0,
      "replies": []
    },
    {
      "id": "n5or0y2",
      "author": "dregan",
      "body": "I had to re-add the Hue service to into Google Home. Now things are working fine.",
      "score": 1,
      "created_utc": 1753739841.0,
      "replies": []
    },
    {
      "id": "n5ospe2",
      "author": "personalhale",
      "body": "So that's why mine suddenly stopped handling \"and\" statements. It just barely works to turn on my lights now and sometimes fails at that. I've used them with no issues since 2016. How does a product LOOSE function its always had??",
      "score": 1,
      "created_utc": 1753740371.0,
      "replies": []
    },
    {
      "id": "n5ostuu",
      "author": "TARDIS32",
      "body": "I suggest getting some light switches.",
      "score": 1,
      "created_utc": 1753740410.0,
      "replies": []
    },
    {
      "id": "n5oxmmt",
      "author": "tripleyothreat",
      "body": "what I don't get is - why would the service fall off? if the coding has been done right once - why would it actually degrade? I've never seen a service degrade like this",
      "score": 1,
      "created_utc": 1753741949.0,
      "replies": []
    },
    {
      "id": "n5oxysr",
      "author": "ManiacalTeddy",
      "body": "In my experience, Gemini has been about as useful as a flat tire.",
      "score": 1,
      "created_utc": 1753742060.0,
      "replies": []
    },
    {
      "id": "n5ozk8t",
      "author": "RandomInfection",
      "body": "Hot tip: ask google to \"sync all devices\". It doesn't fix everything, but it does fix issues where your home devices forget which room all the lights are in.\n\nMy living room \"lights on\" would only turn on 2 of 4 lights. \"Lights off\" in the bedroom would turn off all lights in the house. Syncing made it all immediately behave again.",
      "score": 1,
      "created_utc": 1753742581.0,
      "replies": [
        {
          "id": "n5qoz4t",
          "author": "Mshell",
          "body": "I wish I had a list of all these commands.  I tried looking for them a year ago and could only find Googles \"suggested common commands\"...",
          "score": 1,
          "created_utc": 1753765066.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5p2oh7",
      "author": "addctd2badideas",
      "body": "I had to reset everything last week. It's working fine now but it keeps failing to recognize my voice or it takes a few times to get it to comply.\n\nSometimes it plays random songs that sort of sound like what I asked.",
      "score": 1,
      "created_utc": 1753743600.0,
      "replies": []
    },
    {
      "id": "n5p58dj",
      "author": "GhostofDan",
      "body": "I don't use Gemini, is that why all my Google Home things are still working fine? I can turn the lights on and off, play music on the nest mini, the routines are still ok, just a few remnants from old devices that have been removed popping regular error messages, but that's on me.",
      "score": 1,
      "created_utc": 1753744436.0,
      "replies": []
    },
    {
      "id": "n5p5h8b",
      "author": "Extreme_Funny_5040",
      "body": "This is what I absolutely hate about tech. They love to build but they hate to maintain.",
      "score": 1,
      "created_utc": 1753744516.0,
      "replies": []
    },
    {
      "id": "n5p6i2w",
      "author": "Peter_Nincompoop",
      "body": "Serves you right for going all in on an ecosystem run by a company that has a very bad habit of just cancelling things with little more than an email to tell you about it.\n\nI’m still pissed about iGoogle",
      "score": 1,
      "created_utc": 1753744846.0,
      "replies": []
    },
    {
      "id": "n5p8bzj",
      "author": "BrotherEarth_",
      "body": "Recently setup Home Assistant on an old raspberry pi I had laying around and it's night and day how much better it is. \n\nI'm probably going to ditch my Google home real soon just because it can't do home Assistant voice commands",
      "score": 1,
      "created_utc": 1753745442.0,
      "replies": []
    },
    {
      "id": "n5p8ho9",
      "author": "uncoolcentral",
      "body": "I’ve become so reliant on voice assistants. \n\nTimers (even have the wall clock that syncs up with timers) temperature changes, lights on and off, music, answers to simple questions, and now that I have a smart microwave, I love being able to toss things in and then say, “poach egg“ or “popcorn“ I almost never have to touch the shitty interface.\n\n… I have voice bots from Amazon and Google and I have an Apple phone… So as long as any one of those players stays in the game, I guess I’ll be OK. :/\n\nI only have one Google home which I use for things I know Alexa is going to be bad at like estimating how long it’s going to take me to walk bike somewhere (or new things I find that it’s bad at) so I haven’t noticed any G service degradation, yet. … I’m gathering it’s pretty bad though. Which doesn’t bode well for other companies trying to make it work.\n\nI genuinely don’t think they’ve made any extra $ off of me in the decade-plus that I’ve been using voice assistants. Yes, I have purchased a number of them, but almost always during their fire sales. \n\n/anecdote",
      "score": 1,
      "created_utc": 1753745494.0,
      "replies": []
    },
    {
      "id": "n5p8u17",
      "author": "PlayingDoomOnAGPS",
      "body": "Quoth Google: \"Bored now\"",
      "score": 1,
      "created_utc": 1753745606.0,
      "replies": []
    },
    {
      "id": "n5pbkee",
      "author": "South-Pomegranate567",
      "body": "So is this why none of my automations I have set up with Google home work???",
      "score": 1,
      "created_utc": 1753746498.0,
      "replies": []
    },
    {
      "id": "n5pbkwj",
      "author": "TheModeratorWrangler",
      "body": "Well that’s what you get for using products from Google.",
      "score": 1,
      "created_utc": 1753746503.0,
      "replies": []
    },
    {
      "id": "n5pc3l6",
      "author": "OldWrangler9033",
      "body": "Classic Google.",
      "score": 1,
      "created_utc": 1753746673.0,
      "replies": []
    },
    {
      "id": "n5pgmzr",
      "author": "GreenFox1505",
      "body": "We need an industry standard offline assistant and new firmware to keep these devices out of the landfill.",
      "score": 1,
      "created_utc": 1753748217.0,
      "replies": []
    },
    {
      "id": "n5pit05",
      "author": "Josh1289op",
      "body": "I got rid of everything and currently replacing my nest. Google killed off some of the best technologies it created.",
      "score": 1,
      "created_utc": 1753748960.0,
      "replies": []
    },
    {
      "id": "n5pjmvj",
      "author": "stahlWolf",
      "body": "For some reason ALL my minis, as well as my OG google home,  tell me they can't reach the internet right now, but the OG hubs work perfectly still. What the heck is going on?",
      "score": 1,
      "created_utc": 1753749250.0,
      "replies": []
    },
    {
      "id": "n5pljjo",
      "author": "sabrenation81",
      "body": "Basically every Google Home device in my house has gone haywire one by one over the past couple of weeks. The only one still functioning in any way is the Hub, the Minis have all stopped functioning. \n\nIt's not a \"connect to 3rd party apps\" thing either. I can't do anything on any of the Minis. As soon as I say \"Hey Google\" there's a brief pause followed by a message to check the connection of my router. I have dozens of devices connected, my router is working fine. It's the Google devices, the Minis specifically, that won't work.",
      "score": 1,
      "created_utc": 1753749909.0,
      "replies": []
    },
    {
      "id": "n5pnp4k",
      "author": "h0tel-rome0",
      "body": "Google is a relic of the past and is slowly dying.",
      "score": 1,
      "created_utc": 1753750644.0,
      "replies": []
    },
    {
      "id": "n5psilo",
      "author": "Supevict",
      "body": "I say to my mini \"hey google\" and in the middle of me speaking to it, it stops listening for more commands and says it cant help me with my request. It didnt even let me finish! Noticeably getting much much worse.",
      "score": 1,
      "created_utc": 1753752306.0,
      "replies": []
    },
    {
      "id": "n5pt1kw",
      "author": "GrumpyRaver",
      "body": "The trick is to stop buying all this stupid shit and turn your gadgets off and on the old fashion way. \n\nOr if you’re fancy get The Clapper. There’s a cool Darth Vader one!",
      "score": 1,
      "created_utc": 1753752489.0,
      "replies": []
    },
    {
      "id": "n5pxako",
      "author": "bob_swalls",
      "body": "Time to bust out the faithful old switch!",
      "score": 1,
      "created_utc": 1753753968.0,
      "replies": []
    },
    {
      "id": "n5pxbq9",
      "author": "libertinecouple",
      "body": "‘Siri, laugh at google home users.’\n\n‘I’m sorry i can’t find that request, would you like to check your phone for laugh at google home users?",
      "score": 1,
      "created_utc": 1753753979.0,
      "replies": [
        {
          "id": "n5q3p6b",
          "author": "mousey_goldfish1",
          "body": "Would you like to ask ChatGPT?",
          "score": 1,
          "created_utc": 1753756240.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5pywlv",
      "author": "None",
      "body": "I feel like I am the only person who has no issues at all with assistant? Fair enough, only my office is hooked up to it (few bulbs and a speaker) but I never had an issue.",
      "score": 1,
      "created_utc": 1753754530.0,
      "replies": []
    },
    {
      "id": "n5pzc2d",
      "author": "JRock1276",
      "body": "Wish they'd put a fix out. I can't stand waking up at two in the morning and all the lights are on, then I tell it to turn them off and it just dings at me. Nest hub has to get unplugged, rebooted, and then it'll turn them off. Until 4 in the morning. Lol",
      "score": 1,
      "created_utc": 1753754680.0,
      "replies": []
    },
    {
      "id": "n5pzwb6",
      "author": "xiancaldwell",
      "body": "Tell me what in the history of non-search google consumer products makes anyone think they will reliably support a consumer product?",
      "score": 1,
      "created_utc": 1753754876.0,
      "replies": []
    },
    {
      "id": "n5q52be",
      "author": "scuddlebud",
      "body": "HASS",
      "score": 1,
      "created_utc": 1753756741.0,
      "replies": []
    },
    {
      "id": "n5q5lyo",
      "author": "FranksWateeBowl",
      "body": "Working fine for me.",
      "score": 1,
      "created_utc": 1753756941.0,
      "replies": []
    },
    {
      "id": "n5q67hh",
      "author": "Dude-Mann",
      "body": "All because flipping a switch is so damn hard!",
      "score": 1,
      "created_utc": 1753757163.0,
      "replies": []
    },
    {
      "id": "n5q67r1",
      "author": "S-192",
      "body": "This is a shame, because Assistant is 10x more useful than Gemini.  Gemini struggles with *basic* unit conversions. And when asking it a simple question like when a food expires or for a ratio of water:coffee grounds,  Assistant answers rapidly.    Gemini gives me some *unhinged* wall of text with excessive history, mathematical theory, and absurd commentary.\n\nPlease stop cramming gen AI down our throats.",
      "score": 1,
      "created_utc": 1753757166.0,
      "replies": []
    },
    {
      "id": "n5q7qqj",
      "author": "itsaride",
      "body": "Laughs in HomeAssistant (it's all local - the whole internet could die and it'll all still work).",
      "score": 1,
      "created_utc": 1753757740.0,
      "replies": []
    },
    {
      "id": "n5q7xbt",
      "author": "Terrible-Opinion-888",
      "body": "Try “Hey Google, synch my devices”.",
      "score": 1,
      "created_utc": 1753757809.0,
      "replies": []
    },
    {
      "id": "n5q910g",
      "author": "Wertyhappy27",
      "body": "I asked my phone to turn off my bedroom lights, something I've done many times, and it gave me step by step instructions on how to use a light switch...",
      "score": 1,
      "created_utc": 1753758234.0,
      "replies": []
    },
    {
      "id": "n5q9zgk",
      "author": "Great_Ad_8093",
      "body": "My Google home can’t even tell me information that is available freely in Google maps… like, I don’t know, what time Costco is open til?? Both free on the open web and in the maps app",
      "score": 1,
      "created_utc": 1753758610.0,
      "replies": []
    },
    {
      "id": "n5qe4m1",
      "author": "ufos1111",
      "body": "killing conversational actions off was such a gut punch",
      "score": 1,
      "created_utc": 1753760276.0,
      "replies": []
    },
    {
      "id": "n5qmsow",
      "author": "qckpckt",
      "body": "I have a Google home mesh wifi in my house. It’s been working completely fine since about 2018… should I be expecting it to shit the bed in the near future then,",
      "score": 1,
      "created_utc": 1753764050.0,
      "replies": []
    },
    {
      "id": "n5qr1nd",
      "author": "Rival314",
      "body": "For those that come after",
      "score": 1,
      "created_utc": 1753766074.0,
      "replies": []
    },
    {
      "id": "n5qrv4g",
      "author": "th3sp1an",
      "body": "The irony here is nothing short of astonishing. In the era of AI, Google's home assistant is shitting the bed? Absolutely tragic.",
      "score": 1,
      "created_utc": 1753766483.0,
      "replies": []
    },
    {
      "id": "n5qsr82",
      "author": "pewpscoops",
      "body": "Google home has gotten laughably bad over time. It’s amazing how the software could get worse, and not better over time.",
      "score": 1,
      "created_utc": 1753766931.0,
      "replies": []
    },
    {
      "id": "n5qznh2",
      "author": "pspr33",
      "body": "I've got a feeling they're going to try and make the 'old' Google Home speakers obsolete by saying they aren't powerful enough for Gemini tasks.",
      "score": 1,
      "created_utc": 1753770614.0,
      "replies": []
    },
    {
      "id": "n5r1ic4",
      "author": "Wyboss",
      "body": "My car interface is assistant-powered (android auto), and basic features like using search boxes or voice texting work,, i'd say,, 40% of the time? I think it's on purpose to try to force you to use gemini, but I live somewhere with crap data so that's just out of the question. Having local functional speech-to-text is such a basic feature it's insane google has shat the bed this bad.",
      "score": 1,
      "created_utc": 1753771650.0,
      "replies": [
        {
          "id": "n5r1ka9",
          "author": "Wyboss",
          "body": "ESPECIALLY considering how accurate and responsive all of this was back in 2020 \n\n  \nRUNNING ON THE PIXEL 2",
          "score": 1,
          "created_utc": 1753771680.0,
          "replies": [
            {
              "id": "n5r1mxp",
              "author": "Wyboss",
              "body": "if I have a pixel 8, the second-to-latest gen, there is no excuse for all basic features to work FLAWLESSLY. From a trillion dollar company is just plain inexcusable",
              "score": 1,
              "created_utc": 1753771721.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5r4wv1",
      "author": "ZenoxtaleZA",
      "body": "Can turn my lights off when my phone's looked with Gemini. But if I unlock my phone it doesn't know what a light is and tries to google it",
      "score": 1,
      "created_utc": 1753773539.0,
      "replies": []
    },
    {
      "id": "n5r97v5",
      "author": "i_am_banished",
      "body": "All my lights still work fine. For now.",
      "score": 1,
      "created_utc": 1753776021.0,
      "replies": []
    },
    {
      "id": "n5ratkw",
      "author": "JAXxXTheRipper",
      "body": "\"Can't even turn their lights on or off\", just use their switches then?",
      "score": 1,
      "created_utc": 1753776949.0,
      "replies": []
    },
    {
      "id": "n5rdbt5",
      "author": "Fantasy_masterMC",
      "body": "If anything in your home is dependent on system updates to function, you are leasing that function from the company providing it and it can vanish at any moment.",
      "score": 1,
      "created_utc": 1753778426.0,
      "replies": []
    },
    {
      "id": "n5rdjac",
      "author": "Dalearnhardtseatbelt",
      "body": "Fuckin Gemini and assistant have become a schizophrenic duo. \n\nIt's terrible. \"Sorry I didn't understand\" worked fine before Gemini. \n\nOr me telling Android Auto to play a song to which three things happen at random. \n\n1. Song plays (rare) 2. \" You must unlock your phone first 3. You must have an active YouTube subscription. Which I have...",
      "score": 1,
      "created_utc": 1753778548.0,
      "replies": [
        {
          "id": "n5ro31u",
          "author": "twopersondesk",
          "body": "Another gripe of mine has been it will play the most ridiculous version of that song/artist. \"Hey G play Bob Marley on Spotify\" (thinking it would play the this is Bob Marley playlist or top hits...*sure, here's Bob Marley dubstep technofunk bootyclap remix, playing on Spotify*. \nMaybe it's a Spotify issue...",
          "score": 2,
          "created_utc": 1753784534.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5rdvpz",
      "author": "Get_Rifted",
      "body": "Used to be able to set multiple alarms in a single sentence. \nNow you have to set them one by one. Bit shit.",
      "score": 1,
      "created_utc": 1753778751.0,
      "replies": []
    },
    {
      "id": "n5rji2l",
      "author": "hmochoa95",
      "body": "All i use it for nowadays is the good night cricket sounds",
      "score": 1,
      "created_utc": 1753782016.0,
      "replies": []
    },
    {
      "id": "n5rnqy6",
      "author": "internalogic",
      "body": "Home Cam is increasingly terribad.  Offline, missing events….  Actively shopping for a replacement.",
      "score": 1,
      "created_utc": 1753784353.0,
      "replies": []
    },
    {
      "id": "n5rpaha",
      "author": "Raging_wino",
      "body": "I don’t have Google assistant but my Alexa has been having troubles like this for months. It claims to not know how to do something or it claims that my device is too far away or it will randomly drop one of my living room lights as a device and I have had to reinstall the device so many times.",
      "score": 1,
      "created_utc": 1753785172.0,
      "replies": []
    },
    {
      "id": "n5rwm6s",
      "author": "4runninglife",
      "body": "Find my phone? what's the weather like, and what time is it? Are the only commands I use on it.",
      "score": 1,
      "created_utc": 1753788601.0,
      "replies": []
    },
    {
      "id": "n5s8p65",
      "author": "cluttercubee",
      "body": "Alexa is just as bad, especially with all of Amazon’s new AI bullshit. It’s getting so out of hand. Ask it to do something and it’s as if it’s never heard the phrase before, change your tone and it refuses to listen to you. These things are falling apart with every AI induced update.",
      "score": 1,
      "created_utc": 1753793287.0,
      "replies": []
    },
    {
      "id": "n5w0w7j",
      "author": "seattletribune",
      "body": "The speaker is only good for YouTube music",
      "score": 1,
      "created_utc": 1753833119.0,
      "replies": []
    },
    {
      "id": "n66kwbp",
      "author": "SergeantPoopyWeiner",
      "body": "Yeah it's totally ridiculous... Earlier today I asked it \"how do you make methamphetamine?\" and it wouldn't answer. It's like come on man, I know you know just tell me!",
      "score": 1,
      "created_utc": 1753976269.0,
      "replies": []
    },
    {
      "id": "n68w58k",
      "author": "Optimal-Click-4771",
      "body": "Wait you’re telling me that Google builds a product and then completely abandons it?!?!",
      "score": 1,
      "created_utc": 1753999961.0,
      "replies": []
    },
    {
      "id": "n68yxhp",
      "author": "DimitryKratitov",
      "body": "I haven't been using mine for like a month, but the quality had already been heavily on the decline. It also sometimes randomly starts talking, without any user input. More than once about sea turtle facts, which is even weirder.",
      "score": 1,
      "created_utc": 1754000833.0,
      "replies": []
    },
    {
      "id": "n5nckz5",
      "author": "Tikkinger",
      "body": "do americans not know how a light switch work or what?",
      "score": 1,
      "created_utc": 1753725303.0,
      "replies": [
        {
          "id": "n5oooil",
          "author": "jsamuraij",
          "body": "r/lostredditors",
          "score": 1,
          "created_utc": 1753739121.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5nexxf",
      "author": "TheRageDragon",
      "body": "(Walks over and flicks light switch)\n\nAhh good ol' analog",
      "score": 1,
      "created_utc": 1753725954.0,
      "replies": [
        {
          "id": "n5rmedu",
          "author": "liftizzle",
          "body": "Yeah now tell that to all the disabled people relying on voice assistants and similar tech.",
          "score": 1,
          "created_utc": 1753783628.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5np3ni",
      "author": "Yuri_Ligotme",
      "body": "You need to be connected to the internet to turn off a lightbulb now??",
      "score": 1,
      "created_utc": 1753728841.0,
      "replies": [
        {
          "id": "n5qq34e",
          "author": "Mshell",
          "body": "Nah, there is still the circuit breakers.  Usually the only time I don't have internet (slow as it is) is when there is a significant power outage so the lights are off anyway...",
          "score": 1,
          "created_utc": 1753765601.0,
          "replies": []
        },
        {
          "id": "n5o05pw",
          "author": "Illustrious-Cookie73",
          "body": "But if I’m not connected to the Internet how would I complain on Reddit about it?",
          "score": -1,
          "created_utc": 1753732036.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5o0fzi",
      "author": "BlurryRogue",
      "body": "That's what you get for letting a single company control your damn house, apparently.",
      "score": 1,
      "created_utc": 1753732118.0,
      "replies": []
    },
    {
      "id": "n5oplu2",
      "author": "WheresFlatJelly",
      "body": "I use a light switch, they seem pretty reliable",
      "score": 1,
      "created_utc": 1753739404.0,
      "replies": [
        {
          "id": "n5ou3k7",
          "author": "Realistic-Try-8029",
          "body": "Tell me more… 😁",
          "score": 1,
          "created_utc": 1753740813.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5qdium",
      "author": "Ancient_Skirt_8828",
      "body": "Don’t buy anything that connects to the internet unless it really needs to.",
      "score": 1,
      "created_utc": 1753760025.0,
      "replies": []
    },
    {
      "id": "n5mt3hy",
      "author": "Akrymir",
      "body": "If you bought smart home devices that are even remotely related to Google, then you kinda deserve it.",
      "score": -5,
      "created_utc": 1753719962.0,
      "replies": [
        {
          "id": "n5mysbg",
          "author": "Riptide360",
          "body": "All fun & games until the lawsuits and settlement checks get issued. Pichai needs to go.",
          "score": 2,
          "created_utc": 1753721567.0,
          "replies": [
            {
              "id": "n5pa787",
              "author": "Tangled2",
              "body": "Class action lawsuit settlements always end up being a tiny amount after the lawyers take their cut. You'll get your check for $38 in 10 years, though.",
              "score": 2,
              "created_utc": 1753746055.0,
              "replies": [
                {
                  "id": "n5pm8h3",
                  "author": "Riptide360",
                  "body": "Sounds about right. Although I will say the last big lawsuit settled in about 2 years. https://abcnews.go.com/Business/eligible-googles-700-million-settlement-payout/story?id=105770477",
                  "score": 1,
                  "created_utc": 1753750146.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n5mvkwm",
      "author": "The_B_Wolf",
      "body": "This is not possible. As an Apple user I have been informed countless times that Siri is the worst personal assistant in existence and it does turn my lights on and off.",
      "score": -3,
      "created_utc": 1753720671.0,
      "replies": [
        {
          "id": "n5nlj72",
          "author": "_RADIANTSUN_",
          "body": "Amazing that Apple people can make literally anything about themselves + coping",
          "score": 7,
          "created_utc": 1753727822.0,
          "replies": []
        },
        {
          "id": "n5mwl35",
          "author": "good2goo",
          "body": "Didnt know people like this still existed.",
          "score": 6,
          "created_utc": 1753720957.0,
          "replies": [
            {
              "id": "n5o01wh",
              "author": "sybrwookie",
              "body": "Company fanboys?  Sadly, that never seems to end",
              "score": 2,
              "created_utc": 1753732005.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5nh8p6",
      "author": "kkapri23",
      "body": "That’s what they get for being too lazy to get off their ass to flip a switch!",
      "score": 0,
      "created_utc": 1753726599.0,
      "replies": []
    },
    {
      "id": "n5mughb",
      "author": "Lost_Apricot_4658",
      "body": "Glad the Smart home trend falling apart",
      "score": -5,
      "created_utc": 1753720350.0,
      "replies": []
    },
    {
      "id": "n5mwqx2",
      "author": "SamuelYosemite",
      "body": "I dont really feel bad for most of them.",
      "score": 0,
      "created_utc": 1753721003.0,
      "replies": []
    },
    {
      "id": "n5vpota",
      "author": "babaroga73",
      "body": "AI is taking over and telling us to turn on our damned lights using our hand and switch on the wall.\n\nTranslated, it's telling us to rely on a last thread of intelligence left in our brains before it's too late.\n\nIt's telling us to not give up the power to turn our own goddamn lights by ourselves.",
      "score": 0,
      "created_utc": 1753829483.0,
      "replies": []
    },
    {
      "id": "n5n9ad1",
      "author": "robjpod",
      "body": "My all work fine.",
      "score": 0,
      "created_utc": 1753724412.0,
      "replies": []
    },
    {
      "id": "n5ncjgq",
      "author": "Pickusernameok",
      "body": "I have one. It fucking sucks ass and I can’t wait for the day I get a new one (different brand) & throw my nest away. So buggy. Never wants to connect & I always have to manually restart it & reconnect to the wifi. I just gave up. Im not doing that every single time I want to use it.",
      "score": 0,
      "created_utc": 1753725292.0,
      "replies": []
    },
    {
      "id": "n5pcnga",
      "author": "EntrepreneurFunny469",
      "body": "Just an idiotic idea from the jump. This is why I avoid tech fads. If it doesn’t actually fix a problem, I avoid it.",
      "score": 0,
      "created_utc": 1753746858.0,
      "replies": []
    },
    {
      "id": "n5pgyz3",
      "author": "BlueProcess",
      "body": "Google is rotting. They have no focus, no direction, no vision, and no leadership. Their ecosystem is falling apart faster than they can build it and the minds that they now employ are not the same as the ones that they had 20 years ago.",
      "score": 0,
      "created_utc": 1753748333.0,
      "replies": []
    },
    {
      "id": "n5rt4km",
      "author": "diodot",
      "body": "oh no",
      "score": 0,
      "created_utc": 1753787021.0,
      "replies": []
    },
    {
      "id": "n5txl24",
      "author": "CallMeDrLuv",
      "body": "Oddly enough my fingers are able to turn the lights on/off 100% of the time.",
      "score": 0,
      "created_utc": 1753810985.0,
      "replies": []
    },
    {
      "id": "n5mv7zq",
      "author": "stinkybumbum",
      "body": "I noticed how crap It is compared to Alexa. So much I turned my Sonos back to Alexa recently.",
      "score": -3,
      "created_utc": 1753720567.0,
      "replies": []
    },
    {
      "id": "n5q3ugk",
      "author": "ViagraPoweredRabbit",
      "body": "Oh no!\nAnyways….",
      "score": -1,
      "created_utc": 1753756294.0,
      "replies": []
    },
    {
      "id": "n5s0ljs",
      "author": "EquivalentHeight186",
      "body": "Damn, if only there were some other way to turn things on and off….but WHAT?",
      "score": -1,
      "created_utc": 1753790260.0,
      "replies": []
    },
    {
      "id": "n5nad1v",
      "author": "4kVHS",
      "body": "If you haven’t moved to home assistant by now, that’s on you.",
      "score": -3,
      "created_utc": 1753724703.0,
      "replies": []
    },
    {
      "id": "n5q0m6r",
      "author": "ThePicassoGiraffe",
      "body": "Hear me out. Get regular toggle switches and stop thinking youre gonna live like youre in a Star Trek episode.",
      "score": -4,
      "created_utc": 1753755132.0,
      "replies": []
    }
  ]
}