{
  "post": {
    "title": "Apple’s first smart glasses could arrive next year",
    "author": "adriano26",
    "id": "1ktjym5",
    "score": 0,
    "created_utc": 1748007950.0,
    "selftext": "",
    "num_comments": 14,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ktjym5/apples_first_smart_glasses_could_arrive_next_year/"
  },
  "comments": [
    {
      "id": "mtu2449",
      "author": "UnsorryCanadian",
      "body": "How sure is this \"could\" because I've heard a lot of tech that \"could\" release \"next year\"",
      "score": 7,
      "created_utc": 1748008026.0,
      "replies": [
        {
          "id": "mtvs5bh",
          "author": "GlossyGecko",
          "body": "Ain’t any of us gonna be able to afford ‘em even if they do.",
          "score": 2,
          "created_utc": 1748025854.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtu56v9",
      "author": "ThePheebs",
      "body": "Is anyone asking for this?",
      "score": 4,
      "created_utc": 1748008981.0,
      "replies": []
    },
    {
      "id": "mtu8afq",
      "author": "MysteryRadish",
      "body": "Every other attempt at this has flopped.  Hard.  Very hard.  I don't think it's a case of needing better design or better tech, there are some things that people just simply don't want.\n\nhttps://slate.com/technology/2024/09/meta-facebook-orion-smart-glasses.html",
      "score": 2,
      "created_utc": 1748009913.0,
      "replies": [
        {
          "id": "mu72kc6",
          "author": "elton_john_lennon",
          "body": "> Every other attempt at this has flopped. \n\nHow many attempts have there been actually? I don't think even google smart glasses went to stores for everyone to buy. Where are you getting that \"flopped hard from\"? \n\n^^^^^^.\n\n> there are some things that people just simply don't want.\n\nI'd love me some AR glasses, not by meta or google, but the concept itself seems useful and full of potential.",
          "score": 2,
          "created_utc": 1748191099.0,
          "replies": [
            {
              "id": "mu83a7y",
              "author": "MysteryRadish",
              "body": "> How many attempts have there been actually? I don't think even google smart glasses went to stores for everyone to buy. Where are you getting that \"flopped hard from\"? \n\nThe ones I'm familiar with were:\n\n1. Google Glass - Never made it to market, despite the backing of one of the world's biggest tech companies.  People who beta tested them earned the pejoritive \"glassholes\".  Not a strong start.\n\n2. DAQRI Smart Glasses - Suffered from a very silly design, somewhere between ski goggles and a VR headset.  Barely lasted 2 years, company shut down shortly after.\n\n3. Snapchat Spectacles - Introduced in 2016, and in 2017 *\"Snapchat wrote off $40m worth of unsold Spectacles inventory and unused parts\".*  That isn't good.  Design described as \"truly horrid\" by Slate.  To be fair they do seem to be still trying and releasing a new version every couple years.\n\n4. Meta Ray-Bans - Introduced in 2021, These are the best-looking attempt so far.  Don't seem to have exactly taken off in the market though, and have some pretty significant privacy concerns.  A lot of people these days want nothing to do with Meta/Facebook, and for good reasons.",
              "score": 2,
              "created_utc": 1748202285.0,
              "replies": [
                {
                  "id": "mu8d5kv",
                  "author": "elton_john_lennon",
                  "body": "I wouldn't consider it a flop if device was never introduced to open market to begin with, you have be able to jump to be able to flop, google pulled out in warm-up phase. \n\nSnapchat spectacles and Meta ray-bans aren't actually AR glasses, those are shades with smart camera in them, they don't augment the reality. \n\nDAQRI afair, were aimed at industry and I don't even remember if they actually started to sell them openly. \n\n\n^^^^^.\n\nThere is a huge difference between what you mentioned and something like Meta Orion. High tech makes a huge difference. That is like a difference between (in terms of VR) oculus Rift DK1, that was available to only a handful of people, was expensive and limited in functionality, served as a tech demo, and something like Quest2 that had massive success as a headset, was cheap, and had tons of usages apps and games. They are both VR headsets, and just because you might consider the first one a flop by your standards, doesn't mean people don't want the tech if it was cheaper and more functional. I feel like the same applies to AR glasses. \n\n^^^^^.\n\nWe are glued to our phones, one of the advantages of AR glasses (for better or worse arguably) is having that screen constantly available to you right in your field of vision, so there is already huge appeal for a lot of people. \n\n^^^^^.\n\n> A lot of people these days want nothing to do with Meta/Facebook, and for good reasons.\n\nAnd I hope none of their AR product ever succeeds really. I hope they invest bilions, develop tech and forma factor that others will copy and will make better/open/nonspy products.",
                  "score": 1,
                  "created_utc": 1748205425.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mtuaaph",
      "author": "GreyScope",
      "body": "To me, they look like a product only sex offenders would use. Watching someone else’s viewpoint or even rewatching mine in a boring version of an fps doesn’t appeal to me and a way to get into fights with ppl who don’t want to be filmed by perceived perverts. My own views.",
      "score": 0,
      "created_utc": 1748010499.0,
      "replies": [
        {
          "id": "mtufzn8",
          "author": "rockerscott",
          "body": "Gotta market to the right audience. Should be easy to reach out to them their names and address are on a public list.",
          "score": 3,
          "created_utc": 1748012134.0,
          "replies": [
            {
              "id": "mtuglav",
              "author": "GreyScope",
              "body": "lol",
              "score": 1,
              "created_utc": 1748012305.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mucm3om",
          "author": "GreyScope",
          "body": "Downvoted by perverts",
          "score": 1,
          "created_utc": 1748270843.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mtv2j4v",
      "author": "nobackup42",
      "body": "Only in ROW due to Trumps 7000% tariff how dare apple say they can’t produce in America",
      "score": 0,
      "created_utc": 1748018518.0,
      "replies": []
    }
  ]
}