{
  "post": {
    "title": "Bike-mounted sensor could boost the mapping of safe cycling routes | Studies have shown that many people don't commute by bike due mainly to a fear of being hit by cars.",
    "author": "chrisdh79",
    "id": "1kkyrtt",
    "score": 1187,
    "created_utc": 1747071635.0,
    "selftext": "",
    "num_comments": 78,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kkyrtt/bikemounted_sensor_could_boost_the_mapping_of/"
  },
  "comments": [
    {
      "id": "mrykfb3",
      "author": "AlexHimself",
      "body": "Neat idea, but mostly useless without mass adoption.\n\n**TL;DR**: They have a custom sensor that plugs into the end of your handlebar while you ride and it collects data, like how close/fast cars are to you when they pass you and then give bike paths a \"safety rating\".\n\nCurrent safety ratings are based on number of reported crashes...so you have to have a bunch of people get smoked by cars to learn something isn't safe 😆.",
      "score": 111,
      "created_utc": 1747075911.0,
      "replies": [
        {
          "id": "mrz3waz",
          "author": "jaymemaurice",
          "body": "This is just a bad idea from the onset. The distance cars pass you is not what is killing cyclists. Cyclists are getting killed by vehicles turning. So many dedicated bidirectional bike lanes are getting their white bike after millions spent on dedicated infrastructure - yet we still do things based on feeling rather than data and practicality.",
          "score": 27,
          "created_utc": 1747081763.0,
          "replies": [
            {
              "id": "mrz4qgw",
              "author": "jaymemaurice",
              "body": "Cars typically operate on a gentleman’s agreement to not veer 1M over lest there be 160km/hr heads on collision. Paint and basic faith in people is all that makes the automobiles from smashing into each other.",
              "score": 13,
              "created_utc": 1747082017.0,
              "replies": []
            },
            {
              "id": "ms1t9gn",
              "author": "Isotheis",
              "body": "Oh no, cars passing close is definitely the more major factor for me. Cars turning, I can give attention to. The hundreds of cars passing, not at all.",
              "score": 5,
              "created_utc": 1747118292.0,
              "replies": []
            },
            {
              "id": "mrzcqfs",
              "author": "AlexHimself",
              "body": "Remember I did a TL;DR, it may do more than distance from cars, so don't let my comment be all encompassing of your opinion...but I don't think it's the best idea overall just because there's not a good way to get adoption.",
              "score": 2,
              "created_utc": 1747084450.0,
              "replies": [
                {
                  "id": "ms0jskl",
                  "author": "jaymemaurice",
                  "body": "Oh yeah sorry. I'm in agreement. Your TLDR was about as far as I would read in to this today :). \n\nThank you for doing the good service.",
                  "score": 2,
                  "created_utc": 1747098878.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms6nqeo",
              "author": "Anustart15",
              "body": "Id imagine it would be able to detect near miss right hooks, which I have had plenty of in some intersections and very few in others. Those would be a pretty good predictor of unsafe intersections",
              "score": 1,
              "created_utc": 1747180834.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms1t1gx",
          "author": "nagi603",
          "body": ">  like how close/fast cars are to you\n\nCan it distinguish between cars, people, other (cargo)bikes? Crowded bikepaths? The article did not say...",
          "score": 1,
          "created_utc": 1747118161.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrz1s61",
      "author": "33zig",
      "body": "Segregated Bike Lanes",
      "score": 28,
      "created_utc": 1747081132.0,
      "replies": [
        {
          "id": "ms1v8ip",
          "author": "Isotheis",
          "body": "Please, only if done right. Here are some bad examples from my experience.\n\n[NO border or drain separation](https://www.google.com/maps/@50.6242398,3.7299863,3a,75y,261.86h,76.51t/data=!3m7!1e1!3m5!1s7CaiogPQTuROFcpundkiOg!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D13.48983799724789%26panoid%3D7CaiogPQTuROFcpundkiOg%26yaw%3D261.8634073821183!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). I need to be able to go on and off the road if there are obstacles.\n\n[NO barrier or plant separation](https://www.google.com/maps/@50.4536224,3.9631644,3a,75y,76.99h,76.53t/data=!3m7!1e1!3m5!1stJAuBJXvIOqPhoAZ497xSw!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D13.469378344907355%26panoid%3DtJAuBJXvIOqPhoAZ497xSw%26yaw%3D76.994179253979!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). I need to be able to see, and to be seen. Unless you're making it a proper separate road even for crossings, of course.\n\n[YES continuity](https://www.google.com/maps/@50.4631365,3.9404153,3a,75y,151.33h,76.04t/data=!3m7!1e1!3m5!1s4JX7q34I45tYl4ww0pqtDg!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D13.958631282201551%26panoid%3D4JX7q34I45tYl4ww0pqtDg%26yaw%3D151.32724784672072!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). It's completely useless, or outright dangerous, if you just drop me off at the next crossing.\n\n[YES markings](https://www.google.com/maps/@50.5659771,3.6653947,3a,75y,129.65h,78.4t/data=!3m7!1e1!3m5!1sF_1Lzwb9htlNBWuMt2SkMQ!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D11.603508316019031%26panoid%3DF_1Lzwb9htlNBWuMt2SkMQ%26yaw%3D129.64670683360626!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). No one can tell it's a bike lane if you don't make it the whole way. Putting a sign at the entrance is useless. It's in fact detrimental, stresses me out having to hunt for the tiny signs far off the road.\n\n[NO mixing with pedestrians](https://www.google.com/maps/@50.4668156,3.9270932,3a,75y,144.89h,76.92t/data=!3m7!1e1!3m5!1soRwxf8Bxj2gNpqUZzuglew!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D13.076194003075358%26panoid%3DoRwxf8Bxj2gNpqUZzuglew%26yaw%3D144.88619763024457!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). You're just adding pedestrians to the death counter, while not even protecting cyclists - cars don't expect cyclists on the sidewalk.\n\n[NO tiled cycle path](https://www.google.com/maps/@50.4404561,3.9421635,3a,75y,81.53h,73.62t/data=!3m7!1e1!3m5!1sQlH8RauychYgk_Vwkh1aiA!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fcb_client%3Dmaps_sv.tactile%26w%3D900%26h%3D600%26pitch%3D16.37537975409812%26panoid%3DQlH8RauychYgk_Vwkh1aiA%26yaw%3D81.53369784498064!7i16384!8i8192?entry=ttu&g_ep=EgoyMDI1MDUwNy4wIKXMDSoASAFQAw%3D%3D). In a few years the tiles get uneven, and dangerous. Especially with nature around.\n\nBad infrastructure is worse than no infrastructure. It gives a feeling of safety while things are in fact more dangerous. 100% of my accidents occurred while on cycle paths (or trying to get on/off).",
          "score": 8,
          "created_utc": 1747119437.0,
          "replies": [
            {
              "id": "ms491l8",
              "author": "toaster404",
              "body": "I was on a committee evaluating bike infrastructure.  Most of these points came up and were dismissed.  The resulting infrastructure caused crashes (I actually hit a pedestrian darting between parked cars).  \n\nWide outer lanes looked to be more effective than mere paint and hope.  \n\nThat was in 1973, and we're still making the same mistakes because they're cheap.  \n\nI'm pulling for elevated 4 lane cycle highways with clear on and off ramps.  With cover hosting solar cells.  Ideally, enclosed with wind driven system to ventilate with a tail wind.  Imagine how many would commute then!\n\nInstead we have the painted lane and marks where we don't need them, which dump us into kill boxes with no directions on how to proceed.  \n\nMotonormativity.  \n\nMeanwhile, there are so many places I can't get to safely, even as a highly experienced rider with pretty good urban skills.  \n\nNow we have the e-vehicle issue, so my typical weekend ride contains autos, fast ebikes, slower ebikes weaving, fast sporty cyclists, slow non-sporty cyclists, runners, joggers, random people wandering across, escooters moving and abandoned, people rolling their luggage to the airport, tourists blocking both directions, potholes, gravel, mud sections, sometimes crank-deep water from the high spring tides, drunks, muggers, double parkers, moving trucks, police cars parked in my lane, garbage cans, drainage grates, caltrops (you think I'm kidding!), broken glass.   I still have a good time. Imagine what it would be like without these entertaining hazards!",
              "score": 3,
              "created_utc": 1747154489.0,
              "replies": [
                {
                  "id": "ms57nda",
                  "author": "Isotheis",
                  "body": "I'm also part of a cycling advocacy association. I am a bit special compared to the others, due to my extremely long commuting distances. No one else would take the cycle to go to the hardware store 20km over, nevermind volunteering/working 40km over. They just use the car. But I want to believe living without a car is possible.\n\nUnfortunately, my city is essentially bankrupt. There are many projects on the table, and no money to actually pay for anything. There's a bridge re-construction project coming soon, but that's only because it's paid for by the train company, as they fear it'll collapse on their rails... Still, our job to chime in, and ensure the new bridge is better adapted to cycles (and pedestrians! I got hit by cars twice while walking!!) than the old one.\n\nWithin my town, it's mostly chill. The main issue is people walking dogs without a leash, or trash bags left onto the cycle path. Delivery people, too, but rarely parked cars. Close passes are rare too, people frequently go all the way onto the opposite lane (and I give a big thumbs up in return every time!).\n\nSo it's mostly intercity travel I want to focus on, places where cars can be found going 90km/h. And connecting our stores to our cycling infrastructure a bit better. But to be fair, there's not even a sidewalk there either ; construction guys cheated on the plans, and nobody went to check before it was finished...",
                  "score": 1,
                  "created_utc": 1747164434.0,
                  "replies": [
                    {
                      "id": "ms5crqx",
                      "author": "toaster404",
                      "body": "I look at the US Interstate Highway system and can't help but contemplate a median trail system connecting cities.  All that wasted space.  Would cost nothing compared to adding an extra car lane!  \n\nHere in the metro Washington DC, USA area we have lots of fragments of excellent infrastructure connected by wishful thinking.",
                      "score": 2,
                      "created_utc": 1747165946.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mrzmqr2",
          "author": "Thats_a_YikerZ",
          "body": "yep. nice idea, but in the end it comes down to trading out a car lane for bike lane, which simply adds to more congestion.",
          "score": -16,
          "created_utc": 1747087609.0,
          "replies": [
            {
              "id": "ms01fsw",
              "author": "8days_a_week",
              "body": "Cba to look it up but generally adding more lanes generally leads to more traffic while fewer lanes (single lane) actually keeps traffic moving better. \n\n\nCould be wrong. Happy to ready studies to contrary if you want to post.\n\nDiscuss if you want, or dont. I just want dedicated bike lanes.",
              "score": 11,
              "created_utc": 1747092578.0,
              "replies": [
                {
                  "id": "ms0krxq",
                  "author": "alidan",
                  "body": "depends on where you are and how good traffic follows the rules.\n\nif you have a forward and left lane and then a right only, traffic should be smoother, and flow more. \n\nbut then if you have more than 1 lane, it was a road that already heavily used, removing one of the lanes makes that road less trafficked sure, but if every road now has 1 lane and the traffic isn't dealt with, you now have half the space for the same volume of cars. \n\npoorly implemented bike lanes, I believe one in san francisco, caused what use to be a heavily used by somewhat fast traffic road to become a 15 minute wait to get down and the bike lane went unused because it was a make work project to feel good about what they were doing with the area, to hell with who lives there. people had to move because if they required an ambulance, they were dead.\n\nyou then either have to cannibalize side of road parking which if its a residential area is likely free for residence who now have to pay a parking pass and inconvenience themselves by walking to where they can park. or cannibalize a lane for traffic, which honestly just breeds resentment. \n\nbike lanes are good when the city is planned around them, not when they are retrofitted into existing cities. personally I think bike lands should eat into side walk space and not road traffic.",
                  "score": -1,
                  "created_utc": 1747099223.0,
                  "replies": [
                    {
                      "id": "ms0qg30",
                      "author": "8days_a_week",
                      "body": "Mostly fair points. I dont particularly feel bad for the residential street parkers as I dont think the public roadways should be for your free car storage.\n\nInclined to agree with bike lands eating into sidewalks , especially in my city where sidewalks are legitimately like 15-20 ft wide .",
                      "score": 3,
                      "created_utc": 1747101204.0,
                      "replies": [
                        {
                          "id": "ms0v5cq",
                          "author": "alidan",
                          "body": "for the most part, parking on the side of the road is the expected norm in a residential area, especially in cities where they may not have a garage attached to where they live. I don't think taking that away from people for bike lanes is a good thing. \n\nin all honesty, I think ebikes and traditional bikes should be treated different, I think ebikes should be driven with cars in city traffic, they shouldn't require a driver's license, but maybe a minimum age, in a city ebikes make the most sense to use outside of bad weather. I think actual bikes should be eat sidewalks, i'll put it this way, the worst I have ever seen in america a sidewalk get is still able to have a bike drive down it, and in a city where they may need scaffolding, either detour to the outer left perimeter, or walk the bike and stay on the right if it ends up eating into the bike area. \n\nI think city planning going forward should make bike lanes either eat sidewalk space, or if its new, plan for bikes from the outset, and not a painted line, an actual car cant cross with out potentially fucking the car up barrier. \n\nthe only time a bike lane should eat into actual traffic lanes is if the route is the only one a bike can realistically travel lets say a bridge where sure, there is a more open route, but its 2~ miles out of the way, on a car that would suck but doable, on a bike that a massive amount of effort and you should be incentivising bikes over cars ideally in a city",
                          "score": -1,
                          "created_utc": 1747102790.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mrztuif",
              "author": "SuperZapp",
              "body": "We have them, but cars constantly park or drive in them.",
              "score": 8,
              "created_utc": 1747090009.0,
              "replies": [
                {
                  "id": "mrzysrh",
                  "author": "TorrenceMightingale",
                  "body": "In austin, they have these little white car slappy things that backhand the cars back into their lane if they veer into the bike lane.   Same shits you see segregating the HOA lanes in Houston.",
                  "score": 2,
                  "created_utc": 1747091733.0,
                  "replies": [
                    {
                      "id": "ms0adj4",
                      "author": "SuperZapp",
                      "body": "They actually have these, but not the full length on this part of the road unfortunately.",
                      "score": 1,
                      "created_utc": 1747095551.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms2p3js",
              "author": "CliplessWingtips",
              "body": "Go ride a bike fatty.",
              "score": 1,
              "created_utc": 1747136380.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mryayf0",
      "author": "Mmmwafflerunoff",
      "body": "Safe cycling routes? Until Cell phones become inoperable while in a moving vehicle, things will not change.",
      "score": 44,
      "created_utc": 1747073121.0,
      "replies": [
        {
          "id": "ms0ejtn",
          "author": "ntyperteasy",
          "body": "I was hit by a car that turned left directly into my path. Her explanation to the police was that she expected me to stop for her (trust me, I tried).  And before cell phones were common.  Just shitty driving and a shitty attitude.",
          "score": 3,
          "created_utc": 1747097011.0,
          "replies": []
        },
        {
          "id": "mrzieed",
          "author": "blue-mooner",
          "body": "Not going to happen\n\nBut replace the human drivers with Lidar based self drivers and we’ll see a [82% decrease in collisions with cyclists](https://waymo.com/blog/2025/05/waymo-making-streets-safer-for-vru)\n\nToyota have [gotten the ball rolling](https://www.caranddriver.com/news/a64644557/toyota-waymo-autonomous-vehicle-partnership/)",
          "score": 5,
          "created_utc": 1747086213.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrz2xte",
      "author": "fannysnakes",
      "body": "If this is in USA then yes you should be worried about cars. The bike sensor can not fix bad drivers.",
      "score": 7,
      "created_utc": 1747081477.0,
      "replies": [
        {
          "id": "mrzo1hx",
          "author": "P1mongoose",
          "body": "On the flip, it’s not gonna stop bikers that completely ignore the law while on the streets. For example, in Texas, you can ride a bike on a street but have to stop at lights and stop signs and all the other yielding. Nine times out of ten when I see bicyclists, they are blowing right through these traffic control measures.",
          "score": -6,
          "created_utc": 1747088039.0,
          "replies": [
            {
              "id": "ms01vna",
              "author": "Soakitincider",
              "body": "And drivers obey all traffic laws because not one single person has ever passed me while cycling where it’s a double yellow and oncoming traffic.",
              "score": 5,
              "created_utc": 1747092719.0,
              "replies": [
                {
                  "id": "ms055ib",
                  "author": "P1mongoose",
                  "body": "Couldn’t agree more with that too. Basically people suck and only care about themselves on the road.",
                  "score": 2,
                  "created_utc": 1747093793.0,
                  "replies": [
                    {
                      "id": "ms093np",
                      "author": "Soakitincider",
                      "body": "There is this one mile stretch I call The Gauntlet where I bike to a spot that has a couple of mile loop. When I'm on the loop it's basically me and walkers and runners with the occasional car. Getting to that spot we have double lane with no shoulder and for some reason it's everyone's way to get somewhere. Some days it's a little quiet but most days I get passed a bunch on that road.",
                      "score": 2,
                      "created_utc": 1747095114.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms99oox",
              "author": "arwinda",
              "body": "Nine times out of ten you only see what you want to see.\n\n> Distracted driving is dangerous, claiming 3,275 lives in 2023.\n\n[Source](https://www.nhtsa.gov/risky-driving/distracted-driving)\n\nShow me 3000 dead bikers caused by stop sign violations and other causes, where the cause is the biker and not a car. I wait.",
              "score": 1,
              "created_utc": 1747224764.0,
              "replies": [
                {
                  "id": "ms9wbil",
                  "author": "P1mongoose",
                  "body": "I can’t. I’m just saying that the entitlement is prevalent both ways in the small sample size I witness daily.",
                  "score": 2,
                  "created_utc": 1747232507.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mrz4xkv",
      "author": "Logicmeme",
      "body": "Until there are elevated or dedicated bike paths completely separate from streets used by cars, not talking bollards or sharows or painted white lines, I think I will pass.",
      "score": 5,
      "created_utc": 1747082076.0,
      "replies": []
    },
    {
      "id": "ms059g4",
      "author": "wererat2000",
      "body": "You can't gadget your way out of bad infrastructure.",
      "score": 7,
      "created_utc": 1747093827.0,
      "replies": []
    },
    {
      "id": "mryjbys",
      "author": "The8Darkness",
      "body": "Well where I live every road would be unsafe except dedicated bike roads. And even on those I see cars squeezing through at times for whatever reason, forcing bike riders to go deep on the grass and wait.",
      "score": 4,
      "created_utc": 1747075587.0,
      "replies": [
        {
          "id": "mryuit1",
          "author": "WillAdams",
          "body": "I wish that it would become a tradition that on the first day of school, police officers would ride along all reasonable bicycle routes to local schools.",
          "score": 3,
          "created_utc": 1747078962.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms03olh",
      "author": "Ld862",
      "body": "Doesn’t really address the root cause of people being afraid for their lives while trying to commute on a bike. Sincerely a former daily bike commuter who gave it up after getting doored and losing my hearing in one ear for life.",
      "score": 4,
      "created_utc": 1747093312.0,
      "replies": []
    },
    {
      "id": "mrz310k",
      "author": "dave8814",
      "body": "I live in the boonies. I got an ebike that could get me into town without burning me out since its roughly 15 miles before I get to anything unless I go up through some mountain biking trails. Less than 6 months after I got it my county banned ebikes from all trails and voted down a proposal to extend the bike path out to my area. So now I can either put my bike in my car, drive to a paid parking lot, then ride my bike, or drive down a 55 mph highway with no reasonable shoulder.",
      "score": 3,
      "created_utc": 1747081503.0,
      "replies": []
    },
    {
      "id": "mryvrmi",
      "author": "cryingproductguy",
      "body": "What's so frustrating about this is that we don't need more sensors to pick up this data.  We already have it based on the phone in nearly everyone's pocket or bag.  The carriers can effectively process the device movement data to show traffic patterns, methods (bike, rail, walking, vehicle etc) as well as speeds and whatnot.  That combined with reported accident data would give you the same thing without needing new sensor adoption.  The problem for many is, and I say this with a great sadness, there's no money in it.",
      "score": 5,
      "created_utc": 1747079336.0,
      "replies": []
    },
    {
      "id": "mryyp9a",
      "author": "blackfocal",
      "body": "What if we had a giant app that we could record our rides on and then label those rides we use as commutes, then we could take all that data and create safe riding routes based on which routes are popular. Maybe we can make the colors of that app orange and white?",
      "score": 2,
      "created_utc": 1747080213.0,
      "replies": [
        {
          "id": "ms01kze",
          "author": "Soakitincider",
          "body": "And never update it with anything useful",
          "score": 1,
          "created_utc": 1747092624.0,
          "replies": []
        },
        {
          "id": "ms0exj8",
          "author": "MedicalRow3899",
          "body": "Right. And the app would have an orange label and would be called Strava.",
          "score": 1,
          "created_utc": 1747097145.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrz2hdn",
      "author": "BitemarksLeft",
      "body": "I’d love to see a service that records bike journeys and uploads footage for AI analysis and reports bad/unsafe driving by vehicles to the police!  The service could pay for itself if part of fines was recovered to pay for it. It could make roads safer for everyone!",
      "score": 2,
      "created_utc": 1747081342.0,
      "replies": []
    },
    {
      "id": "mrzane9",
      "author": "Common-Ad6470",
      "body": "I’ve cycle-camped all over Europe as a teenager and literally the only place I’ve ever been hit or knocked off my bike was in the UK.\n\nDuring Covid while the roads were empty I decided to go out for a ride, got a mile from home and got clipped by some bimbo in a BMW sending me sprawling.\n\nShe stopped a hundred yards down the road, got out, gave me a load of verbal abuse, went round and popped her near side wing mirror back, gave me a load more verbal abuse and was gone doing at least 70 in a 30.\n\nSince then, I’ve totally lost my nerve to go out on the road because of fuck-wit drivers like this.",
      "score": 2,
      "created_utc": 1747083807.0,
      "replies": []
    },
    {
      "id": "mrzego7",
      "author": "FoolOnDaHill365",
      "body": "A lot of people don’t commute by bike because they have been hit by car while commuting. The number is too fucking high.",
      "score": 2,
      "created_utc": 1747084982.0,
      "replies": []
    },
    {
      "id": "mrzp2vc",
      "author": "Adorable-Woman",
      "body": "Close down unecessary streets, make mandatory segregated bike lanes, and actually prosecute drivers who hit or kill bikers",
      "score": 2,
      "created_utc": 1747088385.0,
      "replies": []
    },
    {
      "id": "mrzwrqu",
      "author": "CalmInteraction884",
      "body": "Wished my bestie had this info to use…😑",
      "score": 2,
      "created_utc": 1747091018.0,
      "replies": []
    },
    {
      "id": "mrzkz7s",
      "author": "distelfink33",
      "body": "How about we just stop using cars as much and switch to mass transit?",
      "score": 2,
      "created_utc": 1747087032.0,
      "replies": []
    },
    {
      "id": "ms0yrqh",
      "author": "PantsHeavily",
      "body": "Less afraid of cars as I am of criddlers stealing my bike from wherever and however I lock it.",
      "score": 2,
      "created_utc": 1747104101.0,
      "replies": []
    },
    {
      "id": "mrzeml9",
      "author": "iMogal",
      "body": "Oh boy! Another tracker!!",
      "score": 1,
      "created_utc": 1747085034.0,
      "replies": []
    },
    {
      "id": "mrzg7y4",
      "author": "rudyattitudedee",
      "body": "Uh yes. Me. Even on a motorcycle keeping up with the speed people in cars are not too bright at times.",
      "score": 1,
      "created_utc": 1747085531.0,
      "replies": []
    },
    {
      "id": "ms0939q",
      "author": "Worldly_Ad_2267",
      "body": "That’s a correct assumption. I’d bike to work if it were safe but unfortunately it’s not.",
      "score": 1,
      "created_utc": 1747095110.0,
      "replies": []
    },
    {
      "id": "ms0h0j5",
      "author": "Fartville23",
      "body": "I don’t cycle to work cos Auckland is so hilly.",
      "score": 1,
      "created_utc": 1747097882.0,
      "replies": []
    },
    {
      "id": "ms1nezv",
      "author": "Strawbuddy",
      "body": "Very few spaces across all of America have actual bike lanes of any sort. There’s a single digit number of cities what have proper bike paths here; separated from the road, planned, and curbed or at least enforced bike lanes intended for folks to get around town, and the few others what have bike lanes at all are most often a single kerb width  but no curb, just a yellow line on the road and touching distance to 40mph traffic. That’s most every single town and city",
      "score": 1,
      "created_utc": 1747115029.0,
      "replies": []
    },
    {
      "id": "ms1yi5g",
      "author": "chococaliber",
      "body": "If you don’t know how neighborhood blocks work and how to create a “off the main road” shortcut maybe you shouldn’t be using a bike on the road either lol",
      "score": 1,
      "created_utc": 1747121408.0,
      "replies": []
    },
    {
      "id": "ms1yxd8",
      "author": "Addictd2Justice",
      "body": "Studies show that people in India prefer to run from tigers due mainly to a fear of being eaten by tigers but no one’s giving them a fricken sensor",
      "score": 1,
      "created_utc": 1747121669.0,
      "replies": []
    },
    {
      "id": "ms2sugg",
      "author": "BarTrue9028",
      "body": "This is why I mountain bike. No cArs on trails",
      "score": 1,
      "created_utc": 1747137929.0,
      "replies": []
    },
    {
      "id": "ms86zlw",
      "author": "Monvi",
      "body": "I stopped biking due to a mix of tendinitis, and being hit by cars who blow through lights, stop signs, and fling open doors",
      "score": 1,
      "created_utc": 1747203364.0,
      "replies": []
    },
    {
      "id": "mslwqps",
      "author": "NeuroXc",
      "body": "Ticketing the hell out of drivers who think the bike lane is their personal passing lane would be a much better way to improve bike safety, but what do I know?",
      "score": 1,
      "created_utc": 1747395333.0,
      "replies": []
    },
    {
      "id": "mrzw0xv",
      "author": "Otherwise_Front_315",
      "body": "Yeah the main reason for me is WEATHER.",
      "score": 1,
      "created_utc": 1747090758.0,
      "replies": []
    },
    {
      "id": "ms0bg09",
      "author": "miuyao",
      "body": "I love bicycling but every day I see people driving in the bike lane. Then posting about how much they want to run them over on the local FB page. So I bike on the sidewalk. I am courteous to others though, I’ve noticed a lot of sidewalk bikers don’t seem to realize that other people exist.",
      "score": 1,
      "created_utc": 1747095921.0,
      "replies": []
    },
    {
      "id": "mrydmje",
      "author": "ReactionSevere3129",
      "body": "Given up on cycling. Buying an indoor trainer is one of the best things I’ve ever done. No more tradies trying to see how close they can get to me in their utes everyone morning. No more people blasting their horns because they don’t believe I should be on the road. No more magpies.  No more heat, no more rain. No need for lights to let blind drivers see me.  Oh the safety of the house. ❤️",
      "score": -2,
      "created_utc": 1747073907.0,
      "replies": [
        {
          "id": "mryj6g4",
          "author": "drishaj",
          "body": "You must work from home if you use the indoor for your commute",
          "score": 9,
          "created_utc": 1747075542.0,
          "replies": [
            {
              "id": "mrywquq",
              "author": "ReactionSevere3129",
              "body": "Those days are gone. Retired.",
              "score": -1,
              "created_utc": 1747079627.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrysuoh",
      "author": "Oniknight",
      "body": "Tbh I bike everywhere and it’s great. The main thing is to have a bell, mirror, and a big ass crate on the back so you’re more visible.",
      "score": 0,
      "created_utc": 1747078455.0,
      "replies": [
        {
          "id": "mrz83s7",
          "author": "kottabaz",
          "body": "The difference in treatment I get from drivers when I'm wearing a high vis shirt versus if I have a jacket over it is enormous.\n\nStill scary as shit to be in the same lane with traffic that wants to go forty mph (in a twenty-five zone obvs) on my left and with parked cars that might door me at any moment on my right.\n\nThis autumn I'm going to get a high-vis parka.",
          "score": 3,
          "created_utc": 1747083034.0,
          "replies": []
        },
        {
          "id": "mrzp9gq",
          "author": "Plane_Discipline_198",
          "body": "I bike a fair amount in a major city that's definitely more bike-friendly than most, and most of the time its totally fine. You do have to plan ahead a bit though because some roads definitely are NOT safe.\n\n\n\nThankfully I'm also a massive person on a massive ebike so I definitely stand out!",
          "score": 1,
          "created_utc": 1747088447.0,
          "replies": [
            {
              "id": "ms0f5cc",
              "author": "MedicalRow3899",
              "body": "The F-250 under the cyclists? 😁",
              "score": 0,
              "created_utc": 1747097221.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mrzdczp",
      "author": "oleslewfoot15",
      "body": "Just use Strava heat maps like most cyclists already do.",
      "score": 0,
      "created_utc": 1747084644.0,
      "replies": []
    },
    {
      "id": "mrzdgi6",
      "author": "Successful_Ad_7062",
      "body": "Most people — don’t commute by bike because their commute is too long, or they can’t physically ride a bike.",
      "score": 0,
      "created_utc": 1747084674.0,
      "replies": []
    },
    {
      "id": "mrzehn5",
      "author": "Personal-Banana-9491",
      "body": "My commute is 38 miles. In no way am I ever biking that.",
      "score": 0,
      "created_utc": 1747084991.0,
      "replies": []
    },
    {
      "id": "mrzn30e",
      "author": "Deflorma",
      "body": "Getting t-boned by a red light runner was the reason I stopped riding bikes forever",
      "score": 0,
      "created_utc": 1747087721.0,
      "replies": [
        {
          "id": "ms0c6n5",
          "author": "Sweet_Inevitable_933",
          "body": "😣 So sorry to hear that.  I hope that you're okay...",
          "score": 1,
          "created_utc": 1747096177.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms0lmbx",
      "author": "scuddlebud",
      "body": "Heatmap on strava pretty much does this already.",
      "score": 0,
      "created_utc": 1747099522.0,
      "replies": []
    }
  ]
}