{
  "post": {
    "title": "Why Apple can't easily move iPhone production to the US: 2,700+ parts, 187 suppliers, 28 countries | Just 30 Apple suppliers operate entirely outside of China",
    "author": "chrisdh79",
    "id": "1kaltcj",
    "score": 1812,
    "created_utc": 1745926877.0,
    "selftext": "",
    "num_comments": 147,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kaltcj/why_apple_cant_easily_move_iphone_production_to/"
  },
  "comments": [
    {
      "id": "mpn6bqg",
      "author": "NuPNua",
      "body": "I mean, this should have been obvious to anyone already right?",
      "score": 484,
      "created_utc": 1745927187.0,
      "replies": [
        {
          "id": "mpncj4g",
          "author": "BassGaming",
          "body": "A lot of people in power either do not understand globalization or act like they don't. So, it was clear to most people but not the relevant ones and their followers/voters who take each sentence spewed out by those fascists as gospel.",
          "score": 199,
          "created_utc": 1745929687.0,
          "replies": [
            {
              "id": "mpnohak",
              "author": "CookieKeeperN2",
              "body": "They don't like to accept hard facts. And it's nothing to do with whether they are in power or just the followers. They all have the same logic. \n\nBack in 2010 I talked to a farmer in Ohio, who insisted that all the manufacturing should come back to the US. I asked him how much he was willing to pay for his cheap stuff, and he was silent. Then I said, even if manufacturing were to leave china, it would go to an even cheaper country like Vietnam or Bangladesh. Silence. I'm sure deep down he understood all of it. Otherwise he'd have a come back.\n\nThey knew even back then it wasn't gonna happen. But it's harder to admit they were wrong. Especially now that we got a liar in chief with a loudspeaker.",
              "score": 82,
              "created_utc": 1745933899.0,
              "replies": [
                {
                  "id": "mpp2pgp",
                  "author": "saposapot",
                  "body": "What I can’t understand is why those people don’t think: maybe we can have the better paying jobs here and actually increase wages instead of manufacturing jobs the Americans don’t want to do….",
                  "score": 16,
                  "created_utc": 1745948642.0,
                  "replies": [
                    {
                      "id": "mproew7",
                      "author": "jamesbong0024",
                      "body": "Those people aren’t getting the better paying jobs.",
                      "score": 6,
                      "created_utc": 1745977699.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpows3w",
              "author": "Nerdenator",
              "body": "They act like they don’t. \n\nThat’s how the current shareholder class made its money: laying off people in the Midwest and shifting production to a geopolitical rival while pocketing the labor cost difference.",
              "score": 15,
              "created_utc": 1745946996.0,
              "replies": []
            },
            {
              "id": "mpo0cb2",
              "author": "ryapeter",
              "body": "My dad force us to learn english and do his best to send us abroad for uni. Because globalisation was all the hype. \n\nNow everyone and everything tangled (global thing didnt start yesterday) the loser want to roll back.\n\nI know the “leader” who make decision is ancient but are they that stupid?",
              "score": 14,
              "created_utc": 1745937571.0,
              "replies": [
                {
                  "id": "mpuy3to",
                  "author": "wzm0216",
                  "body": "Leaders are far more foolish than we ever imagined.",
                  "score": 3,
                  "created_utc": 1746028475.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpqlws4",
              "author": "Palora",
              "body": "You are assuming this hurts them or even apple at all.\n\nApple will just use this as an excuse to raise prices even more, far above what the tariffs will force, and the vast majority of their consumers base will still buy their products.\n\nThey, personally, are making piles of money out of the trade wars already.\n\nAnd that's before you realize that the poorer americans get the more power per dollar the 1% get. And when the dollar starts getting devalued they'll just switch currency.",
              "score": 4,
              "created_utc": 1745964778.0,
              "replies": [
                {
                  "id": "mptwaej",
                  "author": "pierreyann1",
                  "body": "Considering that the new common currency is going to be the Yuan, USA and all it's citizens are being sold to the Chinese Communist Party for a few trillions.\n\nSomeone take the coffins of the founding fathers, the world just got an infinite source of energy out of this.",
                  "score": 2,
                  "created_utc": 1746016702.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpsn5g3",
              "author": "Space_Lux",
              "body": "A lot of people ~~in power~~",
              "score": 1,
              "created_utc": 1745992178.0,
              "replies": []
            },
            {
              "id": "mpoxniv",
              "author": "Gunfreak2217",
              "body": "The problem is that we let this shit go on so long that all manufacturing sites have been developed outside the US. Even if labor is more expensive there than the US now, it’s still pointless to move manufacturing to the US cause of the billions of dollars required for equipment and buildings.\n\nThe only way to fix this is to suffer for like 10 years and force companies to build here. It’s hard to swallow that pill. There is no other solution. This could be easily fixed for the consumer if we had more strong arm tactics to reel in companies but instead we let these guys run rampant and ruined consumer and worker protection laws.",
              "score": -6,
              "created_utc": 1745947241.0,
              "replies": [
                {
                  "id": "mpp64et",
                  "author": "swolfington",
                  "body": ">The only way to fix this is to suffer for like 10 years\n\ni mean the government could just tax wealth more appropriately and that would solve a lot of issues in and of itself. you could then take some of that tax money and subsidize/incentivize manufacturing that concerns national-security matters. \n\ntanking the economy so hard that it no longer \"costs too much\" to manufacture locally is like taking chemo therapy because going to the barber is too expensive.",
                  "score": 16,
                  "created_utc": 1745949589.0,
                  "replies": [
                    {
                      "id": "mpp8k8v",
                      "author": "Gunfreak2217",
                      "body": "Oh you’re right about the manufacturing thing. It’s a thing that’s just like impossible to fix without a significant regression.\n\nI’ve always said fuck the taxes nonsense. Rich people always find a way to avoid that shit and what not. \n\n\nI’ve always thought forcing a law in place that “a companies lowest paid worker must at a minimum be 5% that of the highest paid worker” so that fixes the minimum wage nonsense while wealth is distributed properly amongst employeees even those of the lowest pay. \n\n\n\nAnd “ for companies in the sp500 wages of an employee must equate the growth of stock while not ever decreasing below their base pay” so if an employee is paid 100k and the stock goes up 1% they now make 101k, if the stock drops 5% they still make their base pay of 100k.\n\n\n\nSo if companies want to grow their stock at all cost with ever increasing value, the people\nWho actually make that happen get a slice. Not the excess getting their stock packages of millions for “good performance”\n\n\n\nAnd before anyone even says what I said is impossible, yes it is. We went to the fucking moon, we can figure out the math logistics of proper wages.",
                      "score": 2,
                      "created_utc": 1745950293.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpp2aza",
                  "author": "Melichorak",
                  "body": "This is a problem of the US being too successful. Your wages are insanely high on global the standard and they don't realize all the implications coming out of it.",
                  "score": 1,
                  "created_utc": 1745948530.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mprtg3v",
              "author": "Low-Rollers",
              "body": "People adapt. They they will build new factories outside of China.",
              "score": -1,
              "created_utc": 1745979435.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpnnbxb",
          "author": "ArchusKanzaki",
          "body": "Alot of people thought that iphone-producing factory is one giant factory, where everything is produced under the same factory. That's why they thought \"well, just move that factory to US. Problem solved\". They do not know or never thought of how many specialization happening in the industry to produce each individual components efficiently, and how all those specialized factory popping-up close to each other that enable efficient production of an iphone. The screw factory is located near to the metal stamping factory which is also clustered near the assembly plant. You need to relocate ALL of that thing to produce it fully domestically.\n\nAnd another factor of \"why China\" is that because China is the producing not just for US but also the entire world, the individual cost of each things got driven way down across the entire industry purely because of economy of scale. Given the rest of the world still want Chinese products, US manufacturer will produce literally only for US which will drove the cost so much up, that maybe even chinese products + tariff is STILL cheaper than US-made product, essentially making entire tariff purely about taxing US citizens, without moving the production to US at all.",
          "score": 30,
          "created_utc": 1745933515.0,
          "replies": [
            {
              "id": "mpntyfx",
              "author": "IchBinMalade",
              "body": "You'll explain this to people and say that it'll make everything way more expensive, and someone will say \"well I'd buy it if it's made here\", and no, no you wouldn't you liar. Nobody would.\n\nOr \"doesn't matter. Too much consumerism anyway, people need to buy less stuff.\" And yeah. Agreed. But the fun part is, big companies are getting exemptions, but small businesses aren't, so next time something you own like a phone needs repair, have fun finding out the repair costs as much as a new phone because the repair shop has to import the parts, but Apple is exempt. Sure fixed consumerism.",
              "score": 21,
              "created_utc": 1745935643.0,
              "replies": [
                {
                  "id": "mpnx7dw",
                  "author": "ArchusKanzaki",
                  "body": "Alot of people just do not have any imagination of how much things may raise, and it may even surpass their imagination even if they do. Some people be like \"well, I will buy an Iphone if its 2000$ but made in America\".... But what if its 2500$? or 3000$? Or even if 4000$? People just do not have much imagination of how much something will cost. A soldering system that only cost 200$ if imported from china? Now its 1600$. Not to mention the potential lack of competition in short term that will make price stays up. There are so much plethora of potential problems that the administration literally have not address before doing this stupid tariff that even people who may want it, ends up against it.\n\nAnd if people are just not buying stuffs because the price set by the producers are too high? Then that's what economist called recession.",
                  "score": 10,
                  "created_utc": 1745936633.0,
                  "replies": [
                    {
                      "id": "mpt7ovb",
                      "author": "Nathaniel_Erata",
                      "body": "A lot*",
                      "score": 2,
                      "created_utc": 1746004783.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpskt0w",
                  "author": "ConstipatedSmile",
                  "body": "Your own take or are you parroting Rossmann? He is 100% right though. One can only laugh.",
                  "score": 1,
                  "created_utc": 1745990934.0,
                  "replies": []
                },
                {
                  "id": "mqm8wzt",
                  "author": "FinishImmediate6684",
                  "body": "These are the same people who elected an insurrectionist because eggs went up 2 bucks.",
                  "score": 1,
                  "created_utc": 1746400295.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpp2uax",
              "author": "saposapot",
              "body": "A lot of people are dumb. \n\nIt won’t get better without the department of education",
              "score": 1,
              "created_utc": 1745948679.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpoujkh",
          "author": "Twodogsonecouch",
          "body": "Obvious to anyone not out of touch with reality. Apple is literally the prototype for moving production out of the US and globalization of markets. They were failing and about to go out of business till they did that and became super successful with a good product produce using global markets and outside of the US production. Then nearly everyone and their mother followed suit and guess what it was under republican administrations who lauded it and promoted it because it was and continues to be about short term corporate profits over long term benefits for citizens",
          "score": 4,
          "created_utc": 1745946363.0,
          "replies": []
        },
        {
          "id": "mpncqis",
          "author": "Scrapple_Joe",
          "body": "I mean remember when they tried to put a plant in Argentina bc of Argentine tariffs?\n\nI doubt they'll make that mistake again in an even more expensive country",
          "score": 5,
          "created_utc": 1745929765.0,
          "replies": [
            {
              "id": "mprdwmw",
              "author": "Programmdude",
              "body": "Even if that was a success story, it wouldn't work now in the US because the tariffs aren't targeted. Sure, the iphone may no longer have tariffs, but all the raw components sourced from those 26 (or whatever) other countries will be. Moving the factory to the US would only be feasible if the tariffs were targeted to say, finished phones, or finished electronics.",
              "score": 1,
              "created_utc": 1745974123.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpo0xl0",
          "author": "Unlikely_Ad6219",
          "body": "Of course it is. Including potus. \n\nSolution? A simple bribe. Far cheaper than trying to move your production! \n\nThe art of the deal.",
          "score": 2,
          "created_utc": 1745937747.0,
          "replies": []
        },
        {
          "id": "mpoeaiq",
          "author": "jianh1989",
          "body": "Not to trump",
          "score": 1,
          "created_utc": 1745941615.0,
          "replies": []
        },
        {
          "id": "mpon57a",
          "author": "mr_herz",
          "body": "Not to the magas out there apparently.",
          "score": 1,
          "created_utc": 1745944241.0,
          "replies": []
        },
        {
          "id": "mpq6008",
          "author": "CamiloArturo",
          "body": "70m people aren’t really aware of that issue and were sure it was going to happen",
          "score": 1,
          "created_utc": 1745959901.0,
          "replies": []
        },
        {
          "id": "mpqlshn",
          "author": "blightsteel101",
          "body": "You'd be amazed how dumb some people can be",
          "score": 1,
          "created_utc": 1745964738.0,
          "replies": []
        },
        {
          "id": "mpr2g3k",
          "author": "swordofra",
          "body": "It is basically two plastic bits and a bunch of little screws, how hard can it be? /s",
          "score": 1,
          "created_utc": 1745970257.0,
          "replies": []
        },
        {
          "id": "mprs13c",
          "author": "LookAlderaanPlaces",
          "body": "Define “anyone” lol",
          "score": 1,
          "created_utc": 1745978940.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpn8gfm",
      "author": "RottenPingu1",
      "body": "Watch the Gamers Nexus 3 hour video on tariffs and the PC industry. Cell phones aren't that much different.",
      "score": 116,
      "created_utc": 1745928080.0,
      "replies": [
        {
          "id": "mpnb9hh",
          "author": "Sweaty_Commercial229",
          "body": "The fact that all the specialist manufacturers are within walking distance of eachother and supply eachother is something that could probably not be replicated easily anywhere else but most people think that manufacturers  magic everything into existence by themselves. \"Magic dust in, iPhone out\" mentality",
          "score": 68,
          "created_utc": 1745929201.0,
          "replies": [
            {
              "id": "mpnus8u",
              "author": "IchBinMalade",
              "body": "Situations like this make me realize how many people live in blissful ignorance as to how the world works. I don't claim to know everything there is to know, but the information is available, being  loudly ignorant in an age where the sum of human knowledge is in your pocket is just embarrassing.",
              "score": 33,
              "created_utc": 1745935900.0,
              "replies": [
                {
                  "id": "mps74lf",
                  "author": "NarutoRunner",
                  "body": "This is the age we live in where ignorance is treated as some form of virtue, and people who know that things are complicated are routinely ignored.",
                  "score": 10,
                  "created_utc": 1745984613.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mpr02d8",
          "author": "medoy",
          "body": "Pencils aren't that different.",
          "score": 3,
          "created_utc": 1745969456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mppzhky",
      "author": "PeaAndHamSoup269",
      "body": "Imagine Apple in the states. An iPhone would be $10k",
      "score": 13,
      "created_utc": 1745958057.0,
      "replies": [
        {
          "id": "mps853t",
          "author": "NarutoRunner",
          "body": "It’s not only costs, but quality as well.\n\nApple learned that earlier devices made in India had higher defects because a mindset of good enough was prevalent, whereas in China the suppliers obsessed on keeping defects as low as possible. Imagine what will happen if the phones are manufactured in Arkansas or Mississippi.",
          "score": 9,
          "created_utc": 1745985041.0,
          "replies": [
            {
              "id": "mpsl4h6",
              "author": "PeaAndHamSoup269",
              "body": "They’d be back at the first iPhone with shotty chips and even worse cameras hahahaha.",
              "score": 4,
              "created_utc": 1745991101.0,
              "replies": []
            },
            {
              "id": "mqazm4e",
              "author": "KrackSmellin",
              "body": "I’d expect to find chewing tobacco in those phones… and them just kind of thrown into the box.",
              "score": 2,
              "created_utc": 1746237595.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mpnxb38",
      "author": "Newwavecybertiger",
      "body": "The real problem is the people who should have known this readily apparent and easily understood concept can't read",
      "score": 27,
      "created_utc": 1745936664.0,
      "replies": []
    },
    {
      "id": "mpq8s3o",
      "author": "Ruttagger",
      "body": "Everyone knows this, except the president of the United States.",
      "score": 9,
      "created_utc": 1745960704.0,
      "replies": []
    },
    {
      "id": "mppbn21",
      "author": "jakgal04",
      "body": "Anybody that thinks moving globalized supply and manufacturing is \"easy\" should probably be mentally evaluated. That is one complex beast and there's absolutely nothing easy about it.\n\nAlso, just because something is \"Made in USA\" doesn't mean every single part of the system from mineral extraction to production occurs in the USA. I bet you my left cheek most \"Made in USA\" products are using materials sourced from other countries.\n\nFurther, bringing manufacturing back to the US isn't going to be this high paying and beneficial line of work like it was in the 1950's. Think Amazon warehouse work but for manufacturing.",
      "score": 8,
      "created_utc": 1745951185.0,
      "replies": []
    },
    {
      "id": "mpn8r92",
      "author": "brokenmessiah",
      "body": "Even if they could easily, they wouldnt want to because who tf going is work here for the dogshit they pay?",
      "score": 26,
      "created_utc": 1745928204.0,
      "replies": [
        {
          "id": "mpnhae7",
          "author": "rosen380",
          "body": "Not exactly.  They can pay a tiny fraction of US minimum wage in other places because of CoL and the laws in those places.  If they opened factories here, it wouldn't be at the \\~$1.50/hr Foxxconn starts folks at in China, it'd be whatever it takes to get employees in the building.\n\nIf similar work in Yazoo City, MS pays $15/hr, they'll probably not get enough people at $7.25 to run a factory.  Maybe at $11-13/hr they get applicants, but perhaps not who they'd need to do intricate work.  And even at $15... well supply and demand curves might say that such a thing is pushing up wages for them and others doing similar work, so maybe it ends up being $17/hr.\n\nAnd then figure in the costs of benefits they'd have to offer and the difference probably ends up being $20-25/hr.\n\nIt'd be that they say, \"there are 7 man-hours of manual labor in every device, which adds $160 to our costs,\" and then the cost of the device would go up to compensate.  And it'd probably be even more once you figure in the extra costs involved since now their part suppliers and such are on the other side of the world, rather than the other side of the street, and that'll go to +$200.\n\nAnd then, when Samsung and others don't build US factories, incurring similar cost increases, they'll either keep their prices the same and take away market share from Apple, or they'll also raise their prices by a similar amount and just be more profitable than they were before.",
          "score": 10,
          "created_utc": 1745931438.0,
          "replies": []
        },
        {
          "id": "mqa2yaq",
          "author": "goldaxis",
          "body": "If you think US minimum wage is low, wait till you find out what they're paying over at FOXCONN",
          "score": 1,
          "created_utc": 1746225871.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpn7530",
      "author": "I_will_take_that",
      "body": "Cause Americans won't work for peanuts and Apple is not going to eat into their profits?",
      "score": 49,
      "created_utc": 1745927530.0,
      "replies": [
        {
          "id": "mpneei3",
          "author": "MultiFazed",
          "body": "It's not even (just) that. The manufacturing pipeline needed for the majority of the components *doesn't exist in the US*, and would take **decades** to ramp up. We're talking about building hundreds of specialized manufacturing facilities from scratch.",
          "score": 74,
          "created_utc": 1745930394.0,
          "replies": [
            {
              "id": "mpnp6ax",
              "author": "Punman_5",
              "body": "There’s also a lack of technical know-how in the US regarding manufacturing. We have very talented design engineers, but have lost a lot of engineering knowledge regarding serial production. Such engineers are an abundance in China",
              "score": 23,
              "created_utc": 1745934125.0,
              "replies": []
            },
            {
              "id": "mpnfbcg",
              "author": "ledow",
              "body": "Meanwhile, enjoy iPhones at twice their already stupendously-inflated prices.\n\nI could honestly see them just moving production outside the US rather than deal with that junk.\n\nThe rest of the world wouldn't be affected, the US phones would double their markup (but people would still buy them), and their operations would be barely affected compared to complete upheaval and waiting decades for suitable suppliers to appear.",
              "score": 12,
              "created_utc": 1745930731.0,
              "replies": [
                {
                  "id": "mpp8qci",
                  "author": "dirtydeedsyeah",
                  "body": "More people would buy Samsung/Androids if the difference is double since Samsung products aren't assembled in USA or China, they have a competitive advantage here. Apple is also a USA branded company so the brand gets tarnished globally since it's part of the brand that is America. People internationally get Apple partially out of pedigree rather than cheaper alternatives.",
                  "score": 5,
                  "created_utc": 1745950342.0,
                  "replies": [
                    {
                      "id": "mpqzjso",
                      "author": "Deathsroke",
                      "body": "Don't be so sure. People are fucking stupid and they'll continue buying Apple for prestige until Apple goes under. If that doesn't happen? They'll buy iPhones at 3k usd.",
                      "score": 4,
                      "created_utc": 1745969285.0,
                      "replies": [
                        {
                          "id": "mpr6s1l",
                          "author": "dirtydeedsyeah",
                          "body": "I fully agree with you on this under most other circumstances tbh. However, under the threat of recession and inflation, I'm a little less inclined to for the mainline models. I do agree, people would still eat it up if all things remain the same. Now that I think about it, I believe the iPhone SE are made in India. The pivot could mean the more affordable models are pushed harder here.",
                          "score": 1,
                          "created_utc": 1745971702.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpo1uhl",
              "author": "Flussschlauch",
              "body": "Years. Not decades. But there is no intent to do it anyway.",
              "score": 1,
              "created_utc": 1745938017.0,
              "replies": [
                {
                  "id": "mpol0i8",
                  "author": "MultiFazed",
                  "body": "Years for a single fab. Decades for the hundreds that would be needed to onshore the entire production pipeline.\n\nBut you're right, there's no intent to do it considering that they can wait out the next 4 years of Trump and hope that whoever gets elected next will roll back the tariffs.\n\nOr just hope that Trump himself will cave to market pressure.",
                  "score": 4,
                  "created_utc": 1745943620.0,
                  "replies": [
                    {
                      "id": "mpqol3j",
                      "author": "alidan",
                      "body": "it takes years for a single top end fab, most components in phones don't use top end fabs. \n\nit would still take a while to get all the components manufactured state side though,",
                      "score": 2,
                      "created_utc": 1745965660.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mpni1cz",
              "author": "Ja_Rule_Here_",
              "body": "I don’t believe it. With enough money you can set all that up in a year imo. You need 1000 new factories? Hire 1000 separate teams to build 1 each in a year. It’s truly just a money problem. I refuse to believe America is so helpless that there’s any given part we can’t start manufacturing in a year if we put our minds to it.",
              "score": -24,
              "created_utc": 1745931703.0,
              "replies": [
                {
                  "id": "mpnjjuc",
                  "author": "EldritchQuasar",
                  "body": "But what about the increase in product cost to pay for all those new supply chains?  A lot of specialized manufacturing machines have crazy long lead times due to the low quantity and highly specialized nature.  Not to mention getting the right talent to operate the new facilities.  There's already a talent shortage of specialized workers in the US, now you're talking about 1000 new factories that have to be staffed.\n\nCan't always just solve a problem by throwing more money at it.  Like you said it's a money problem. Why would apple go through all that trouble when the American consumer shells out money anyway?  If iPhones truly become more expensive, and the US market share starts tumbling, then I bet apple would look into it more seriously.",
                  "score": 15,
                  "created_utc": 1745932231.0,
                  "replies": [
                    {
                      "id": "mpo6m3j",
                      "author": "Ja_Rule_Here_",
                      "body": "Fine. All those jobs will drive up wages and we can pay people. Shortage of people? We have a long line of qualified immigrants that would love to move here. We’re a country built on immigrants.",
                      "score": -4,
                      "created_utc": 1745939410.0,
                      "replies": [
                        {
                          "id": "mpouu78",
                          "author": "EldritchQuasar",
                          "body": "I think the main issue (and other people have brought it up) is that these highly specialized factories require highly specialized and unique skillsets in order to operate them.  It isn't a matter of putting a warm body on a machine and pressing go.  It's a matter of having a qualified workforce, immigrant or native doesn't matter.  The qualified workforce is another part of that supply chain that more money doesn't solve quickly.",
                          "score": 3,
                          "created_utc": 1745946446.0,
                          "replies": [
                            {
                              "id": "mpp7ipx",
                              "author": "Ja_Rule_Here_",
                              "body": "You know those people exist and will move here and work here for the right amount of money right?",
                              "score": -3,
                              "created_utc": 1745949989.0,
                              "replies": [
                                {
                                  "id": "mppi1ci",
                                  "author": "MorelikeBestvirginia",
                                  "body": "Canadians won't even come here for tourism this year but you think you can get Chinese engineers that we called peasants.less than a month ago to uproot their whole lives and move here in under a year?",
                                  "score": 3,
                                  "created_utc": 1745953036.0,
                                  "replies": [
                                    {
                                      "id": "mppjm9b",
                                      "author": "Ja_Rule_Here_",
                                      "body": "Yeah lol what world are you from people all over want to move here, there’s more class mobility in the US than anywhere else in the world, a few years of Trump haven’t changed that. You are all high on TDS.",
                                      "score": -2,
                                      "created_utc": 1745953498.0,
                                      "replies": [
                                        {
                                          "id": "mppju3j",
                                          "author": "MorelikeBestvirginia",
                                          "body": "How does it not concern you at all that literally everyone else with knowledge of the topic disagrees with you? It's an impressive amount of Dunning-Kruger to say the least.",
                                          "score": 3,
                                          "created_utc": 1745953562.0,
                                          "replies": [
                                            {
                                              "id": "mppleai",
                                              "author": "Ja_Rule_Here_",
                                              "body": "Wrong things don’t become right just because they’re popular. \n\nThe arguments here have devolved to “nobody wants to immigrate here anymore because Trump” \n\nIf you can’t recognize how ridiculous that argument is, well you fit right in. If you think that’s an argument that comes from people with knowledge on the topic, then I’m worried about your ability to discern credible sources. Show me a credible source that shows the waiting list for immigration to the US becoming smaller due to recent Trump antics.\n\nExplain to me why someone in China wouldn’t move to the US if we offered them a bag of money? Because boo Trump stinks? Yeah right.",
                                              "score": 1,
                                              "created_utc": 1745954015.0,
                                              "replies": [
                                                {
                                                  "id": "mprmwp2",
                                                  "author": "Malodoror",
                                                  "body": "Almost self aware there for a second but this delusional thread is actually really informative on how the uninformed try to reason through an alternate reality. 🍿",
                                                  "score": 1,
                                                  "created_utc": 1745977189.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mpnl3of",
                  "author": "SG_wormsblink",
                  "body": "Money can’t speed up everything. There are physical bottlenecks that you can’t keep throwing resources into and get more results.\n\nLet’s say you do electronics manufacturing. You want a clean room? Sure you can pay the company more to expedite the construction or find a more expensive company to build it if the cheaper company is unavailable.\n\nBut there are a fixed number of companies that build clean rooms, and a fixed number of qualified engineers to handle that job. Even if you offer a million dollars per day, the demand won’t create a new qualified engineer out of thin air. They need to study for the qualification and complete the necessary tests.\n\nSo you can try to stretch the existing talent further by paying for additional work overtime, hiring multiple assistants, etc. But even that has its limits.",
                  "score": 13,
                  "created_utc": 1745932764.0,
                  "replies": [
                    {
                      "id": "mporuxs",
                      "author": "TehCheapshot",
                      "body": "The example we use all the time is “9 mothers can’t make 1 baby in 1 month, no matter what you feed them.”  Great reply.",
                      "score": 3,
                      "created_utc": 1745945602.0,
                      "replies": []
                    },
                    {
                      "id": "mpo746h",
                      "author": "Ja_Rule_Here_",
                      "body": "Why would any of those numbers be fixed? You’re saying we can’t create another company to build clean rooms? Or an existing company can’t scale out their operations? \n\nThere are long lines of qualified engineers that would immigrate here in a second to join this new hyper competitive job market.\n\nWhy is it that everyone in this thread has forgotten that we are a country built on immigrants? Our labor force is not fixed.",
                      "score": 0,
                      "created_utc": 1745939557.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpnn5bt",
                  "author": "Dminik",
                  "body": "A lot of these would be highly specialized factories with complex manufacturing processes. You don't really have enough people with the right knowledge to start a 1000 projects at once.\n\n\nEven if you did, you don't have all of the tech you need. For example, unless you're able to buy out the country of Netherlands, you won't be able to get domestically produced lithography machines. And even if you did, my understanding is that there's a long waiting queue for them.\n\n\nAnd after all of that's who is going to work in all of the new factories? The US unemployment rate is ~5%. Basically everyone who can have a job already does so. It's utter nonsense.",
                  "score": 11,
                  "created_utc": 1745933454.0,
                  "replies": [
                    {
                      "id": "mpo7hye",
                      "author": "Ja_Rule_Here_",
                      "body": "Import people, no tariffs on people. Produce the machines by importing the people that know how.\n\nDid you forget we are a country built on immigrants and there is a long line of people waiting?",
                      "score": -6,
                      "created_utc": 1745939669.0,
                      "replies": [
                        {
                          "id": "mpohh88",
                          "author": "None",
                          "body": "[removed]",
                          "score": 4,
                          "created_utc": 1745942533.0,
                          "replies": [
                            {
                              "id": "mpohvaj",
                              "author": "Ja_Rule_Here_",
                              "body": "Illegal immigrants. There’s a difference. The ones we bring over will be legal and have no problems",
                              "score": -3,
                              "created_utc": 1745942655.0,
                              "replies": [
                                {
                                  "id": "mpoirl7",
                                  "author": "dunno0019",
                                  "body": "He's sending legal immigrants to El Salvador too. \n\nAnd even the legal immigrants that were looking to move there: they are watching your govt go full Gestapo and changing their minds. \n\nMeanwhile, have you ever heard of a \"brain drain\"? Because your top minds are leaving your country en masse. Because they too can see the mess that is coming.",
                                  "score": 6,
                                  "created_utc": 1745942944.0,
                                  "replies": [
                                    {
                                      "id": "mpojp1f",
                                      "author": "Ja_Rule_Here_",
                                      "body": "lol nobody is leaving the country. This it TDS. And the list of people wanting to come is still as large as ever. Nobody gives a shit about Trump. No we aren’t sending legal immigrants anywhere. He sent some criminal immigrants… and yeah that’s the deal you commit crimes or represent gangs your immigration status gets revoked.",
                                      "score": 1,
                                      "created_utc": 1745943228.0,
                                      "replies": [
                                        {
                                          "id": "mpojvsb",
                                          "author": "dunno0019",
                                          "body": "Good luck with all those delusions, friend.",
                                          "score": 1,
                                          "created_utc": 1745943285.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "mprn5z2",
                                          "author": "Malodoror",
                                          "body": "I can’t help but think whatever you’re on is about to be banned and turned into felony possession.",
                                          "score": 1,
                                          "created_utc": 1745977276.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mpzeom9",
                          "author": "Dminik",
                          "body": "The kinds of people you want to immigrate (not import, we don't do that anymore) are also the ones who are able to look at the situation happening in the US and decide that it's not good for them.\n\n\nTrump messing with visas (both student and work visas) tells them that even if they arrive legally, their life could still be uprooted. There's no stability.\n\n\nTrump pulling scientific (and educational) funding tells them that the US isn't really interested in this kind of high-tech work.\n\n\nIronically the people still willing to move to the US are the people this administration explicitly doesn't want: people escaping bad living condition, or people who still haven't realized or don't care about anything happening in the US. Nothing against them, but these aren't the kinds of people who will bring back high-tech manufacturing into the US.",
                          "score": 1,
                          "created_utc": 1746085285.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mpnn1s0",
                  "author": "MultiFazed",
                  "body": ">Hire 1000 separate teams to build 1 each in a year\n\nAnd what happens when there aren't that many teams in existence capable of setting up specialized factories like that? Because there aren't. \n\nAlso, you can't set up a semiconductor factory in a year. It takes 3-4 years and costs about $10 billion ([source](https://download.intel.com/newsroom/2022/manufacturing/fab-final-static.pdf)).  The financial outlay alone makes it prohibitive to build enough to meet demand in anything approaching a reasonable timeframe.",
                  "score": 9,
                  "created_utc": 1745933420.0,
                  "replies": [
                    {
                      "id": "mpo7f6w",
                      "author": "Ja_Rule_Here_",
                      "body": "You create more teams by importing people aka immigration. There are a long list of qualified people waiting who would jump at the chance to join this hypothetical hyper competitive job market.",
                      "score": -1,
                      "created_utc": 1745939647.0,
                      "replies": [
                        {
                          "id": "mpokdet",
                          "author": "MultiFazed",
                          "body": ">There are a long list of qualified people waiting\n\nNo, there aren't. Silicon fab construction is **super** specialized, and teams that can do the work are **exceedingly** rare. You can't just hire people off the street for this kind of work.\n\nThere are currently only 18 new fab construction projects starting this year. That's worldwide. Because that's as many as there are qualified teams to work on  Each one will take 2-4 years to construct at a cost of $10 - $20 billion dollars a piece.\n\nIt's literally impossible to just throw together a new silicon fab in a year. These things take years of planning before the work even starts, years of construction by highly-technical teams, and billions and billions of dollars of investment in just the construction alone, before even getting to the cost to man and run the facility.",
                          "score": 8,
                          "created_utc": 1745943430.0,
                          "replies": [
                            {
                              "id": "mpop2ow",
                              "author": "Ja_Rule_Here_",
                              "body": "If we cared enough and had enough money we’d poach those exact people. Are they slaves that can’t choose to work somewhere else for a pile of cash? Guessing no.",
                              "score": 1,
                              "created_utc": 1745944803.0,
                              "replies": [
                                {
                                  "id": "mpozavd",
                                  "author": "jorshhh",
                                  "body": "Well, if you just throw piles of cash to solve the problem you might find out that tariffs are cheaper than building everything from scratch.",
                                  "score": 4,
                                  "created_utc": 1745947696.0,
                                  "replies": [
                                    {
                                      "id": "mpp7la3",
                                      "author": "Ja_Rule_Here_",
                                      "body": "Cool, we can increase the tariffs until that’s not true.\n\nRealistically though, the cost of labor to build the factory is relatively small vs the long term production output of that increased capacity. It’s money well spent to pay a guys $400k a year when China pays them maybe $100k.",
                                      "score": -1,
                                      "created_utc": 1745950011.0,
                                      "replies": [
                                        {
                                          "id": "mpvyd1j",
                                          "author": "PotatEXTomatEX",
                                          "body": "Are you stupid?",
                                          "score": 1,
                                          "created_utc": 1746038973.0,
                                          "replies": [
                                            {
                                              "id": "mpvypgb",
                                              "author": "Ja_Rule_Here_",
                                              "body": "Are you?",
                                              "score": 1,
                                              "created_utc": 1746039076.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpno5ap",
          "author": "ArchusKanzaki",
          "body": "Apple's iphone factory workers are not really working for peanuts. Definitely not relative to the average living cost anyway. China is no longer the 'cheap country' but Apple still sticks with China because they have so much institutional knowledge and they have deep relationships with the people working there. Its easier to work with someone that you have been partner for more than a decade compared to a brand new country.",
          "score": 15,
          "created_utc": 1745933789.0,
          "replies": []
        },
        {
          "id": "mpo0h5q",
          "author": "piratep2r",
          "body": "Don't know if it's exactly a correction, but Americans *can't* work for peanuts. \n\nHousing keeps going up in price, food inflation is crazy when compared to 5 years ago, no universal Healthcare means extra cost to consumers, requiring extra income. There's a reason the middle class has been shrinking for a while.\n\nIf cost of living doesn't go down, pay can't go down.",
          "score": 4,
          "created_utc": 1745937612.0,
          "replies": []
        },
        {
          "id": "mpnfci4",
          "author": "Creoda",
          "body": "Would a US manufactured iPhone selling at current normal iPhone prices even make Apple a profit?",
          "score": 3,
          "created_utc": 1745930744.0,
          "replies": [
            {
              "id": "mpnh3b6",
              "author": "diacewrb",
              "body": ">And even if Apple were somehow able to do it, the move would take years and would likely result in a much more expensive iPhone price tag – some predict as much as $3,500.\n\nNo, so moving to India may be their best bet, unless trump also tariffs them as well.\n\nBut trump has also floated the idea of tariffing specific companies, not just countries.",
              "score": 6,
              "created_utc": 1745931369.0,
              "replies": [
                {
                  "id": "mpo12f0",
                  "author": "ArchusKanzaki",
                  "body": "Not sure how much \"reciprocal tariff\" Trump levied on India, but the reason why he's also tariffing Thailand, Vietnam, etc is because he's (probably) trying to close the loophole of producing on other country except US. Under his logic of trade deficit, if India starts producing more iphone to be shipped to US, it will increase the deficit and therefore the tariff will rise.",
                  "score": 4,
                  "created_utc": 1745937786.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mpqpcjq",
              "author": "alidan",
              "body": "apple puts 200$ of parts and shits out a 1000$ phone, margins would be affected, or they increase the prices and people go to android. \n\nmost likely apple would invest heavily in robotics so the human element is removed in manufacturing, and the price stays about the same once everything is set up.",
              "score": 1,
              "created_utc": 1745965913.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpneqhs",
          "author": "rinderblock",
          "body": "Labor rates and shipping costs make China not that much cheaper than the west at this point. What China has is an extremely experienced and growing manufacturing workforce. The US doesn’t and it would take us decades to catch up.",
          "score": 2,
          "created_utc": 1745930517.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mppi123",
      "author": "Kevin_Jim",
      "body": "People don’t seem to understand how supply chain works. \n\nChina has spend decades building its supply chain, manufacturing, etc.\n\nIn Shenzhen, you can go a few kilometers and you’ll meet enough manufacturers and suppliers to build a smart phone.\n\nTaiwan is very similar. The US is not.",
      "score": 4,
      "created_utc": 1745953034.0,
      "replies": []
    },
    {
      "id": "mpnqdno",
      "author": "jeRQ420",
      "body": "I heard they’re moving it to India to avoid the tariffs.",
      "score": 7,
      "created_utc": 1745934513.0,
      "replies": [
        {
          "id": "mpo5sue",
          "author": "The_Frostweaver",
          "body": "187 parts made mostly in china.\n\nIf you put the main assembly factory in the USA you would pay tariffs on each of those parts.\n\nIt's not clear if the US will allow people to have all their parts built in China, assemble the phone or whatever it is in india and avoid the tariff.\n\nYou could do the same with clothing, make 95% of the shirt in china then attach the sleeves in india to avoid the tariff.\n\nVietnam has been doing this for years to to help china avoid US tariffs.\n\nIf the USA allows China to bypass their tariffs selectively then it's clear this was all market manipulation and corruption. Also makes the USA look weak and the tariffs would accomplish none of their stated goals (most were not going to happen anyways but still).",
          "score": 7,
          "created_utc": 1745939174.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpo176l",
      "author": "Flussschlauch",
      "body": "Apple started producing in India and bribed/lobbied local politicians to change their laws regarding work hours since Chinas worker laws made it harder to exploit the workers.",
      "score": 6,
      "created_utc": 1745937826.0,
      "replies": []
    },
    {
      "id": "mpoh0lh",
      "author": "rukioish",
      "body": "People really underestimate how much damage compartmentalization has done to our ability to adapt. The fact is that another global war could completed nuke our ability to produce high technology items.",
      "score": 5,
      "created_utc": 1745942396.0,
      "replies": []
    },
    {
      "id": "mpql5g2",
      "author": "Rogaar",
      "body": "Everyone knows this except for Agent Orange.",
      "score": 4,
      "created_utc": 1745964529.0,
      "replies": []
    },
    {
      "id": "mpoo6ac",
      "author": "KE55",
      "body": "One would think a \"top businessman\" would grasp this.",
      "score": 2,
      "created_utc": 1745944540.0,
      "replies": []
    },
    {
      "id": "mpq1qoz",
      "author": "EddySpaghetti4109",
      "body": "But the factories!!!!",
      "score": 2,
      "created_utc": 1745958694.0,
      "replies": []
    },
    {
      "id": "mpqzv7i",
      "author": "Youremadfornoreason",
      "body": "I thought it was “America first” for all of these companies",
      "score": 2,
      "created_utc": 1745969390.0,
      "replies": []
    },
    {
      "id": "mproqhy",
      "author": "ddawson100",
      "body": "They’ve had 100 days and Apple still hasn’t brought production back to the United States? Trump said “jobs and factories would come roaring back into our country.” It can’t be this hard, Tim Apple.",
      "score": 2,
      "created_utc": 1745977807.0,
      "replies": []
    },
    {
      "id": "mptwlxs",
      "author": "Mean_Peen",
      "body": "Maybe Apple isn’t the answer?",
      "score": 2,
      "created_utc": 1746016819.0,
      "replies": []
    },
    {
      "id": "mpoinrt",
      "author": "Died_Of_Dysentery1",
      "body": "It's funny because I tell people at work repeatedly, that it's infeasible to move manufacturing of virtually anythkng back to the US. The people that make iPhones get paid the equivalent of say $2-3 a day.. if Americans made it, they'd demand at least $15 an hour and benefits.... simple math.... $3 a day vs $15 an hour? Wanna pay $48000 for an iPhone? Me either...",
      "score": 4,
      "created_utc": 1745942911.0,
      "replies": [
        {
          "id": "mps2rjn",
          "author": "IntrepidIcicle",
          "body": "I feel like both sides are messed up. Why are people okay with exploiting oversea workers? And if they cannot the companies exploit us by price gouging.",
          "score": 1,
          "created_utc": 1745982859.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpnzst0",
      "author": "Skoteleven",
      "body": "The 30 suppliers that operate outside of China probably make the box it comes in.",
      "score": 2,
      "created_utc": 1745937410.0,
      "replies": [
        {
          "id": "mpo24b4",
          "author": "ArchusKanzaki",
          "body": "Nah, I am fairly sure the Iphone's box is made in China. Its pretty much custom-made so it probably will need to be produced in one of China's factory. Ability to make fancy packaging is one of the reason why tabletop game are produced in China. \n\nMy thinking is that its probably the super auxiliary stuffs like screws or heat pipe, and probably its also related to Apple's attempt to produce iphone in India. Apple need to start teaching companies outside China on how to produce in \"Apple's quality\", and trialing them by making them ship stuffs to be used in current China's production is probably one way to do it.",
          "score": 4,
          "created_utc": 1745938097.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpoji5h",
      "author": "againandagain22",
      "body": "It’s long been established that Labor practises are why Jobs hated American manufacturing. \n\nThe story at the time was that if Apple wanted to change the thickness of the glass by 0.1mm that would take months in California (because of collective bargaining agreements) whereas in China they just stop production, retool and start again. \n\nThat was the story. Whether it was camouflaging a more important reason such as the cost of labor; I don’t know.",
      "score": 2,
      "created_utc": 1745943170.0,
      "replies": []
    },
    {
      "id": "mpox205",
      "author": "SRM_Thornfoot",
      "body": "Easy here is just being used as a synonym for expensive. It will be expensive to move iPhone production, and companies don't want to spend money if they don't have to.",
      "score": 1,
      "created_utc": 1745947072.0,
      "replies": []
    },
    {
      "id": "mpqftgk",
      "author": "boobio",
      "body": "Child labour",
      "score": 1,
      "created_utc": 1745962830.0,
      "replies": []
    },
    {
      "id": "mprphrl",
      "author": "kbgc",
      "body": "The other 10% are comatose?",
      "score": 1,
      "created_utc": 1745978066.0,
      "replies": []
    },
    {
      "id": "mpsq20z",
      "author": "TheCrimsonMustache",
      "body": "Are you telling me that these tariffs have NOTHING to do with making devices in the United States?!\n\nBut we were told…",
      "score": 1,
      "created_utc": 1745993784.0,
      "replies": []
    },
    {
      "id": "mpsvkfa",
      "author": "ZampanoGuy",
      "body": "You can’t tell a red this,  it goes over their head.",
      "score": 1,
      "created_utc": 1745996999.0,
      "replies": []
    },
    {
      "id": "mpuquau",
      "author": "lupuscapabilis",
      "body": "Oh no whatever will we do without a new iPhone",
      "score": 1,
      "created_utc": 1746026379.0,
      "replies": []
    },
    {
      "id": "mqa2pm3",
      "author": "goldaxis",
      "body": "Why am I supposed to care if it's easy?\n\nThey are the richest corporation in the world. THREE TRILLION DOLLARS. That's a 3 followed by twelve zeroes. If you had that amount in dollar bills and stacked them flat it would literally reach the moon. \n\nI think they can handle it.",
      "score": 1,
      "created_utc": 1746225788.0,
      "replies": []
    },
    {
      "id": "mpnrr7t",
      "author": "Normal_Pace7374",
      "body": "Child labour",
      "score": 1,
      "created_utc": 1745934952.0,
      "replies": []
    },
    {
      "id": "mpnils5",
      "author": "edwardsnowden8494",
      "body": "187 suppliers for an iPhone seems extremely low. If that figure is true they have an AMAZING supply chain",
      "score": 0,
      "created_utc": 1745931903.0,
      "replies": [
        {
          "id": "mpo0wv7",
          "author": "crasscrackbandit",
          "body": "It's not a \"one supplier supplies one single component\" situation for everything.",
          "score": 3,
          "created_utc": 1745937741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpnmazl",
      "author": "strangerzero",
      "body": "Maybe they need to redesign them to make it easier for machines to assemble and manufacture. I know it’s not going to be easy. Probably easier to remove the problem called Trump.",
      "score": -5,
      "created_utc": 1745933172.0,
      "replies": []
    },
    {
      "id": "mpp3l34",
      "author": "gw2master",
      "body": "Apple can't move iPhone production to the US because Americans aren't willing to work as hard, on as labor intensive a job, for as low a wage.  And on the flip side, if wages were brought up, no one would be willing to buy, nor could they afford to by an iPhone made in the US.",
      "score": 0,
      "created_utc": 1745948885.0,
      "replies": [
        {
          "id": "mppgjwn",
          "author": "ChodaRagu",
          "body": "I also saw an interview with Jobs before he died, asked why iPhones can’t be made in U.S.  Besides supply chains and such, we simply don’t have enough educated engineers to build iPhones in the volume needed to meet demand. It’s that simple….",
          "score": 3,
          "created_utc": 1745952605.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpu3046",
      "author": "jvin248",
      "body": "Apple is dragging their feet for political beliefs.\n\nStamping dies and plastic injection molds and such tooling, if they cannot physically pull them from existing Asian factories, can be made new in six months. Many machines are sourced from Germany and shipped to Asia today or could be shipped to the US. Some machines can be made in the US or find used equipment to install while they are waiting on tooling.\n\nA local high-end audio company I know of, and have witnessed their facility production, can do all the electronic pick and place surface mount boards used in the typical phones. And they are not the highest tech that could be found around say Texas cities.\n\nRetooling is a big expense, certainly (but a phone is smaller than retooling car parts).  Apple has more cash reserves than any company (nearly to the extreme of being an old 1980s Leveraged Buyout target). They may need to downgrade a few things \"it's thicker, so you don't lose it!\" that can use a marketing solution, or a price reduction. Or programming efficiency improvements so battery life is extended (fewer ads or spyware). But they can also quickly make the next version better once the Made In America-1 version has launched.\n\nStarlink has discussed building a phone. This would be perfect timing to produce a Made In America Starlink phone, cheaper than Apple, with better nationwide satellite coverage. Then Apple would be in quite a dire situation, trying to sell $3k imported phones against $500 MIA phones that have better signal performance and faster internet speed.   \n\nApple could make the move if they really wanted to, but they are too busy playing politics and throwing around excuses, instead of bringing jobs to the US.\n\n.",
      "score": 0,
      "created_utc": 1746019050.0,
      "replies": [
        {
          "id": "mpu4ul0",
          "author": "jvin248",
          "body": "Apple develops new phones every year with major technology changes every 2-3 years (or 5 years interrupted by c\\*vid). Having \"just\" launched their latest they will need design work and tooling for the next phone anyway .. they can divert that effort now and not lose much if any tooling/machinery expense because they are in early design and supplier sourcing work right now. Their product planning looks like a perfect break point to shift resources into a US focused build.\n\nPer AI \"key launch dates for various iPhone models:\n\n* **iPhone**: Launched on June 29, 2007.24\n* **iPhone 3G**: Launched on July 11, 2008.24\n* **iPhone 3GS**: Launched on June 19, 2009.24\n* **iPhone 4**: Launched on June 24, 2010.24\n* **iPhone 4s**: Launched on October 14, 2011.24\n* **iPhone 5**: Launched on September 21, 2012.24\n* **iPhone 5c**: Launched on September 20, 2013.24\n* **iPhone 5s**: Launched on September 20, 2013.24\n* **iPhone 6 and 6 Plus**: Launched on September 19, 2014.23\n* **iPhone 6S and 6S Plus**: Launched on September 25, 2015.23\n* **iPhone 7 and 7 Plus**: Launched on September 16, 2016.23\n* **iPhone 8 and 8 Plus**: Launched on September 22, 2017.23\n* **iPhone X**: Launched on November 3, 2017.24\n* **iPhone 15 and 15 Plus**: Announced on September 12, 2023, and launched on September 22, 2023.4\n* **iPhone 16 and 16 Plus**: Announced on September 9, 2024, and launched on September 20, 2024.4\n* **iPhone 16 Pro and 16 Pro Max**: Announced on September 9, 2024, and launched on September 20, 2024.4\n* **iPhone 16e**: Announced on February 19, 2025, and launched on February 28, 2025.4\n\n\"",
          "score": 1,
          "created_utc": 1746019668.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mpo3ygr",
      "author": "LukkyStrike1",
      "body": "The issue is that Apple is framing this due to some \"external\" issue like \"labor costs\"....Apple wants it to be this way because its just cheaper....thats it.\n\nApple is owned by share holders, the drive for profits so they can earn returns on their investments led Apple to seek and create lower cost supply chains. Since the early 2000s Apple has stategically taken US profits and invested them into China/elsewhere to lower costs of manufacturing. Once those suppliers that were (maybe at one time) in the USA follow due to ensureing they can compete and retain apple contracts: the money is gone and the companies just fail to exist here in the USA. Years of this has created a situation where Apple CANT build any hardware here.\n\nDO NOT let people imply this was somone elses fault than Apple. Apples shareholders pushed the company to lower costs...that means moving production elsewhere....\n\nLastly, this is the EXACT reason valves for our current figher jets cost 25k or something each....when a similar valve could have been had for a few hundred just 30 years ago. There is only one remaining supplier that can manufactuer this part in the USA. You are paying for the company to exist here, and thats expensive.",
      "score": -6,
      "created_utc": 1745938634.0,
      "replies": [
        {
          "id": "mpo8frc",
          "author": "hey_listen_hey_listn",
          "body": "The valves costing 25k or something is entirely because it is very specialized and most likely classified design. When something is niche and not produced in mass quantities price tends to skyrocket. I am not defending that price tag and believe that there is nice profit margin there but just wanted to say.",
          "score": 3,
          "created_utc": 1745939941.0,
          "replies": [
            {
              "id": "mpo9d95",
              "author": "LukkyStrike1",
              "body": "You are missing the point: at one time we used to have 15 or so seperate companies that could manufacture a valve of that type and specialization. There was not only public sector demand, but also private sector demand. Once the private sector moved most/all manufacturing elsewhere: the other 14 companies close or move to where the work is. Now we have 1. That 1 does not do enough buisness in the private sector to use economy of scale. That means we pay extreme prices to keep the company afloat so we can source all of our parts from the USA.",
              "score": -4,
              "created_utc": 1745940210.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpo8mjz",
          "author": "MyRealUser",
          "body": "All of this is true, but:\n\n1. This is true for any corporation. Their goal is to maximize shareholder profits and if it means moving production somewhere where it's cheaper  (because of labor, taxes, materials, or whatever other reason), they would do that.\n\n2. Keep in mind that customers also want cheap iPhones, toasters, and whatnot. This is not just corporate greed or maximizing shareholder value. We got used to buying cheap crap and we don't care where it's made. We don't want to pay $3000 for iPhones or $300 for toasters.",
          "score": 3,
          "created_utc": 1745939996.0,
          "replies": [
            {
              "id": "mpo8vnx",
              "author": "LukkyStrike1",
              "body": "there is no but.\n\nYou either accept globalization, or you do not. You cannot have both. Right now the Administration wants both, or at least pretend.\n\nAnd people do not understand this fact.",
              "score": -4,
              "created_utc": 1745940069.0,
              "replies": [
                {
                  "id": "mpocn0n",
                  "author": "MyRealUser",
                  "body": "Right, but you're putting the blame entirely on Apple for something that is both: a) true for all corporations AND b) demanded by consumers (cheap goods).",
                  "score": 5,
                  "created_utc": 1745941146.0,
                  "replies": [
                    {
                      "id": "mposemk",
                      "author": "LukkyStrike1",
                      "body": "Apple cannot bring work back because of globalization.\n\nIt was their choice to move the manufacturing and take the higher profits, and thats called globalization.",
                      "score": -1,
                      "created_utc": 1745945755.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mprqsia",
          "author": "ddawson100",
          "body": "All speculation. Please cite where Apple is framing this as issues like “labor costs.”\n\nExecutives going back to Jobs and Jeff Williams in 2025 have said China's unmatched manufacturing ecosystem, which has developed over decades, is a primary reason for not moving production to the US. \n\nIt’s not just a factory, it’s everything that supports it from workforce to components. Moving production to the US isn’t as simple as replacing the location something is assembled.",
          "score": 1,
          "created_utc": 1745978510.0,
          "replies": [
            {
              "id": "mps60qx",
              "author": "LukkyStrike1",
              "body": "I am not saying that TODAY Apple is saying \"we cant because we have to save money\". I am saying: Apple helped destroy the supply chains and manufacturing industry by moving away from the USA. It was about saving money.\n\nChina has an unmatched manufacturing ecosystem because USA companys spent billions accessing their cheap labor starting as early as the 70s. China required them to train their citizens and include them in the development of the products manufactured and sold there. \n\nOf course there is no manufacturing support in the United States, it was all offshored, this was to save money: and Apple is no exception.",
              "score": 3,
              "created_utc": 1745984159.0,
              "replies": [
                {
                  "id": "mpsttyz",
                  "author": "ddawson100",
                  "body": "Still waiting for you to cite your claim but I know it’s pointless projection, not based on claims from Apple. \n\nWhy didn’t the US build a 21st century manufacturing powerhouse? Look, we’ve been de-industrializing since the steel era. Blame democracy and short policy lifetime. Is this good? Depends where you sit, maybe.\n\nI’d challenge you to describe how Apple could have taken that touch screen, those chips, and found an assembly plant in the US. Which company in the US could have manufactured the original iPhone other than someone like Foxconn? Or iPods? Or Macs? When did Apple destroy manufacturing in the US? Who is the domestic Foxconn they snubbed?\n\nI bet we can agree on some things. Consumers wouldn’t pay $3000 for a phone. Not in large numbers, anyway. The revolution in smart phones may not have happened if it had to be built at scale domestically. Maybe. But we didn’t pay that much and the smartphone era happened and what happened is due to countless materials advances, innovative hardware, Apple software, and Chinese manufacturing.",
                  "score": 1,
                  "created_utc": 1745995971.0,
                  "replies": [
                    {
                      "id": "mpv5ghb",
                      "author": "LukkyStrike1",
                      "body": "https://www.bbc.com/news/articles/czx17361pw1o\n\nThe BBC talks about the early days, and how Apple partnered with Chinese companies to create the tools and processes they needed to make the products. Even went as far as saying: \"Back then, China was not primed to make the iPhone. But Apple chose its own crop of suppliers and helped them grow into \"manufacturing superstars,\" according to supply chain expert Lin Xueping.\"\n\nThe idea that Apple moved soly because there was no one to manufacture: i think is a short sighed POV because it releases the decisions made by boards all over the country. Not to mention that the iMac was being assembled here, probably for a higher cost than Foxconn could do it...investement went to China.\n\nUltimately, I dont trust apples 500bil \"investement\", I dont think that Tarrifs bring back anything because the cost differential is too high labor wise and the total investement needed is huge. Therefore we will all have less because everything automatically gets more expensive.",
                      "score": 2,
                      "created_utc": 1746030625.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mppc57p",
      "author": "VanillaSad1220",
      "body": "That many parts seems idiotic",
      "score": -2,
      "created_utc": 1745951330.0,
      "replies": []
    },
    {
      "id": "mpqpv3v",
      "author": "Hakaisha89",
      "body": "If more of the iPhone production process got automated, such as the low-skill labor such as screw assembly, then the additional costs of manufacturing would mostly come from increased labor wages, energy costs, and shipping the components from overseas. Even accounting for that, my estimates show that the increased production cost would be around 100 on the low end, and 200 at the high hand, that sounds significant, but the average phone costs a 1000 bux, and has a manufacturing cost of like 400-500 bux in China per today. While that sounds significant, Apple could easily absorb those fcosts without it dramatically hurting their bottom line.  \nApple sells what, 220 million iPhones last year. So even if moving manufacturing to the US required a 5 billion dollar investment in automation and factory setup. Apple would earn that back in half a year, a year tops, even if it absorbed all the additional costs perunit, rather then passing it on the consumer. The idea that a US assembled iPhone would cost 3.5k is absurdly inflated.  \nSure, the global iPhone supply chain is somewhat complex, with 700 component sites in 28 countries, and China remains central due to the manufacturing being local to many of them, as well as their shipping being incredible low. But automation reduces reliance on cheap labor, and apple already uses US made components such as the Face ID lasers, and the display glass. And wiith some stratetgic investment, apple could Easily do a final assembly in the US, using robots for the bulk of the labor, and ship in components, cause that is basically what tesla does, like sure, iphone got 700+ components, but a tesla got 10000+ components, with 400 suppliers in china alone, and imports from over 20 different countries, and like half is US/Canada/Mexico produced components.",
      "score": -2,
      "created_utc": 1745966087.0,
      "replies": []
    },
    {
      "id": "mpo65ss",
      "author": "Sooowasthinking",
      "body": "Globalization is a creation of those in power.This is what they wanted and now it’s not great.",
      "score": -6,
      "created_utc": 1745939279.0,
      "replies": []
    }
  ]
}