{
  "post": {
    "title": "PS5 Pro owners complain that some Pro-enhanced games look worse / Silent Hill 2 and Star Wars Jedi: Survivor reportedly have issues due to the PS5 Pro’s upscaling tech",
    "author": "a_Ninja_b0y",
    "id": "1gu507a",
    "score": 2275,
    "created_utc": 1731937464.0,
    "selftext": "",
    "num_comments": 286,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gu507a/ps5_pro_owners_complain_that_some_proenhanced/"
  },
  "comments": [
    {
      "id": "lxr7sjf",
      "author": "Earthpig_Johnson",
      "body": "Looks worse and costs more?\n\nSounds about right for the modern era.",
      "score": 901,
      "created_utc": 1731938104.0,
      "replies": [
        {
          "id": "lxrd8jm",
          "author": "BusinessBear53",
          "body": "Yeah it's a common misconception. The enhanced part is Sony's bank account, not the games quality.",
          "score": 238,
          "created_utc": 1731940162.0,
          "replies": [
            {
              "id": "lykaorj",
              "author": "lloydsmith28",
              "body": "Lol true that",
              "score": 1,
              "created_utc": 1732360892.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxreght",
          "author": "CrazyDaimondDaze",
          "body": "*me not willing to upgrade from PS4 until I see more reasons (cheaper and more unique catalgue) to get a PS5*\n\n\n\"Oh, well... time to fire the good ol' video games or fire up the family's PS2 to get some real action\".",
          "score": 36,
          "created_utc": 1731940610.0,
          "replies": [
            {
              "id": "lxrkg0c",
              "author": "None",
              "body": "[deleted]",
              "score": 48,
              "created_utc": 1731942703.0,
              "replies": [
                {
                  "id": "lxrtrn7",
                  "author": "CrazyDaimondDaze",
                  "body": "\"Ancient games\"... welp, I feel like a fossil now, remembering some of the original games and enjoying playing those.",
                  "score": 21,
                  "created_utc": 1731945737.0,
                  "replies": [
                    {
                      "id": "lxsco93",
                      "author": "axw3555",
                      "body": "We were there when the ancient magic was written. The days of sega and NES and cartridge games that were the size of a DS and had about an hours worth of content.",
                      "score": 12,
                      "created_utc": 1731951536.0,
                      "replies": [
                        {
                          "id": "lxvsnzp",
                          "author": "Terrible-Bell5170",
                          "body": "Sega..  NES.... ancient???\n\n\nPfffft....\n\n\nthey may be the withered parents of the new gaming gods\n\n\nBut there was only one real old god...\n\n\nIts name was atari.\n\n\nGames were on an 8 track size cartridge, and there was only one stick and 1 button per player\n\n\nEVERYTHING was couch co-op or couch comp.\n\n\nAnd holidays were the best cause you got to take it over to grandmas and grandpas, who had a massive inset TV countertop console... IN COLOR.\n\n\n....now gimme back my beer",
                          "score": 7,
                          "created_utc": 1731993407.0,
                          "replies": [
                            {
                              "id": "lxxat0f",
                              "author": "ritchie70",
                              "body": "I actually had a home pong console.",
                              "score": 1,
                              "created_utc": 1732023630.0,
                              "replies": [
                                {
                                  "id": "lxxgkrc",
                                  "author": "Terrible-Bell5170",
                                  "body": "Grandpa and grandma had that.\n\n\nMom was still in her \"i dont want an excuse for the kids to be inside more\" phase then, lol.",
                                  "score": 1,
                                  "created_utc": 1732025748.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxtschn",
                      "author": "rolfraikou",
                      "body": "I remember getting my NES, then my Genesis, and later while I was owning a psone thinking atari 5200 games were \"ancient.\"\n\nIt was obvious, they looked awful. Then, even thinking back to my first system, the NES, and comparing it to Final Fantasy 7. \n\nThe jump was huge, and it made it so obvious. The tech was so advanced that the genres changed, new genres were suddenly popping up left and right because of 3D.\n\n I was thinking about this around 98 (I was a little late to the psone, but also, that's when the tech of the psone was really seeming to get pushed more. Companies were figuring out what they could really do with it)\n\nThat's just 14 years. It's insane to me. Clearly games today look leagues better than from 14 years ago. But it doesn't feel like as big of a jump only because when I was a kid it was such a *huge* jump, that just by virtue of the tech it opened the doors for tons of new genres, that are core genres to this day. There are games today where you see someone make a fake psone demake video, and you see how it could work, but when someone does a 2D demake, it's great, but something feels lost from the modern game then in my opinion. \n\nIt must kinda be how people felt who saw the rise of radio, to TV, to color TV. It changed the way things were done and the genres people consumed for entertainment.",
                      "score": 5,
                      "created_utc": 1731967154.0,
                      "replies": [
                        {
                          "id": "ly2m97d",
                          "author": "Klaphood",
                          "body": ">Clearly games today look leagues better than from 14 years ago.\n\nI don't even think *that's* always true either. Especially if you bring that down to 10 or 8 years.\n\nOk, on the extreme ends of the spectrum, sure. But on average? Apart from maybe things like Ray Tracing, there have barely been any major leaps in the last decade compared to all the 4(?) decades before that.",
                          "score": 2,
                          "created_utc": 1732092771.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxsn15h",
                  "author": "Bacon44444",
                  "body": "The two big games that really showed of the system for me were Demon Souls and Returnal. Returnal was really something special, but it's not a gameplay loop I want to go back to. So, yeah. My ps5 has been collecting dust lately.",
                  "score": 3,
                  "created_utc": 1731954649.0,
                  "replies": []
                },
                {
                  "id": "lxwtyao",
                  "author": "allofdarknessin1",
                  "body": "The remakes at least look and perform better. I just never want to hear about 30fps games again. I don’t care if is 8k or whatever. Developers need to optimize their games or build around hardware limitations to make their titles at least 60fps.",
                  "score": 2,
                  "created_utc": 1732016118.0,
                  "replies": []
                },
                {
                  "id": "lxstwbr",
                  "author": "None",
                  "body": "I have an Xbox One Series X I use mostly for EA Skate 1 & 2, Saints Row 2, the Arkham trilogy, and, most contemporary, the last few Forzas. I think it’s funny that’s what I use hardware like that for, but wow, it’s nice instantly switching between games lol.",
                  "score": 3,
                  "created_utc": 1731956711.0,
                  "replies": []
                },
                {
                  "id": "lxslvgl",
                  "author": "complete_your_task",
                  "body": "I upgraded for Elden Ring. Don't regret it at all, either. I first played through Limgrave and Liurnia on my last gen console and the difference is night and day. Visually and performance wise.",
                  "score": 1,
                  "created_utc": 1731954303.0,
                  "replies": []
                },
                {
                  "id": "lxssuv1",
                  "author": "EvilNinjaX24",
                  "body": "Finally got mine in early July. Only legit PS5 game I've played is Spider-Man 2 - everything else has been games available on the PS4 (remastered for the PS5, in the case of a couple of them). I *have* PS5-exclusives, but I haven't gotten to them yet.",
                  "score": 1,
                  "created_utc": 1731956395.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxrmlu0",
              "author": "BoJackPoliceman",
              "body": "QOL change from PS4 to Ps5 is more than enough to want to upgrade. \nInstant loads, snappy ui, fans not constantly spinning etc make a huge difference in the actual playing experience. \n\nStop being dense for internet points.",
              "score": 21,
              "created_utc": 1731943430.0,
              "replies": [
                {
                  "id": "lxrn18a",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 17,
                  "created_utc": 1731943569.0,
                  "replies": [
                    {
                      "id": "lxwets5",
                      "author": "retro604",
                      "body": "I have a PS5 and I do like it but those instant load times only apply to specific made for PS5 games.  \n\nDoesn't work with any PS4 game nor most of the upgraded games.  Even if it did work a lot of load times last gen are live loads while you shimmy through a crack or something.  Can't do anything about those.",
                      "score": 1,
                      "created_utc": 1732006484.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxsemil",
                  "author": "FelopianTubinator",
                  "body": "Just a personal preference but the new UI is ugly, unorganized and majorly limits customization. They should have just improved on the ps4 ui not redesign it completely.",
                  "score": 3,
                  "created_utc": 1731952117.0,
                  "replies": [
                    {
                      "id": "ly3co2u",
                      "author": "RamboMcMutNutts",
                      "body": "Or just go back to the PS3 menu, that was a breeze and so easy to use.",
                      "score": 2,
                      "created_utc": 1732107891.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lxrq8vl",
                  "author": "None",
                  "body": "These QoL aren't enough to justify spending $500 for a console where you'll play literally the exact same games you already play on your old reliable PS4.\n\n\nPeople buy consoles for games. If they wanted QoL improvements, they'd buy a PC.",
                  "score": 26,
                  "created_utc": 1731944616.0,
                  "replies": [
                    {
                      "id": "lxru2hj",
                      "author": "sesor33",
                      "body": "Wait until you hear PS5 is selling at the same rate as PS4 in the same period of time.",
                      "score": 11,
                      "created_utc": 1731945834.0,
                      "replies": [
                        {
                          "id": "lxrv8vv",
                          "author": "None",
                          "body": "It does help that unlike last gen. Xbox gave up entirely so you either get a PC or a PS5. The results would’ve been different if Xbox didn’t give up. Hell in that timeline, Sony would’ve made PS5 pro cheaper and include disc drive. The only reason why PS5 pro is so terribly priced is because Sony can do that. It’s like PS3 launch days but this time we don’t have xbox 360 to make Sony rethink their strategy.",
                          "score": 1,
                          "created_utc": 1731946209.0,
                          "replies": [
                            {
                              "id": "lxs9g9c",
                              "author": "Usernametaken1121",
                              "body": "Why did this narrative that \"Xbox gave up\" become so popular? They didn't \"give up\" on making games or being a gaming industry leader. They \"gave up\" on forcing you to buy their box and only their box to play a game. I just don't understand how that's a bad thing for gamers. The only thing it's bad for, is fanboys and console war enthusiasts. Console wars are obsolete.\n\nLook what console war narrative have gotten us. Sony who puts out a $700 mid gen upgrade that's like 30% better than base console. A digital store that charges customers more because they can. A refund policy that if you open the game for 1 second, you're ineligible for a refund.\n\nWhy would gamers want that? Fanboyism has really destroyed gamers ability to objectively view the industry and what's really going on.",
                              "score": 4,
                              "created_utc": 1731950569.0,
                              "replies": [
                                {
                                  "id": "lxsci92",
                                  "author": "None",
                                  "body": "Exclusives sell console. If your console has no exclusive games. People won't buy it. Xbox giving up on xbox is bad because it means you only have one console \"Playstation\" that is basically monopoly. \n\n\nWe need competition. PS5 pro for $700 wouldn't happen if Phil Spencer spent the acquisition of third party companies funds into developing better killer apps games. \n\n\nLike why buy xbox when PS5 gets all the Xbox games plus Sony exclusive games? Sure xbox has backwards compatibility with Xbox 360 but not everyone cares about that. People want to play new games, not old games from 20 years ago.",
                                  "score": 0,
                                  "created_utc": 1731951487.0,
                                  "replies": [
                                    {
                                      "id": "lxsea3d",
                                      "author": "Usernametaken1121",
                                      "body": ">Exclusives sell console. If your console has no exclusive games. People won't buy it\n\nThat's what I mean by \"obsolete\". That was 100% true in the days of 360/PS3 all the way back to NES/Genesis, but Xbox thinks that's not true anymore. Everything Xbox makes is on gamepass so PC players can play it there, and Xbox players can play it on Xbox, eventually phones will be able to play most of everything too. COD will sell xboxs solely on the fact you don't have to purchase it.\n\nIt really comes down to, do you want to play on PC or console, all the games are there regardless, but it matters what your tastes are. I wouldn't be surprised if next gen, Xbox comes out with a console thats significantly cheaper than the PS6 and the whole selling point will be as a gamepass box. Who knows if that will work but I'd much rather prefer being able to play any game anywhere and find whatever deal or situation suits me, than being locked into whatever Sony or Nintendo thinks is best ($$$$). PC is the place to be right now and that's specifically because everything is on there, there is no walled garden.\n\nI don't think walled gardens are going to last much longer, Goolge might be anti trusted to hell, Apple is being forced to tear down their wall on the app store, I don't think gaming is far behind, if on player sentiment, rather than regulation.\n\nI mean, look at streaming. People HATE that they have to have 5 subscriptions to watch the content they want, the walled gardens is a losing proposition.",
                                      "score": 2,
                                      "created_utc": 1731952015.0,
                                      "replies": [
                                        {
                                          "id": "lxsfd08",
                                          "author": "None",
                                          "body": "This is not obsolete. I for example became team xbox this gen solely because these fucks bought Bethesda and made Starfield exclusive meanwhile Sony's games were boring at the time. Fast forward to now, Xbox gave up, Sony's game line up is still shit but atleast we got Stellarblade and Spider man 2. I have motivations to buy the console because why not?\n\n\nI'd never buy Xbox if I knew that its games will be released on PS5. \n\n\nSame with Switch. People buy switch because its a unique console with unique games. It wouldn't sell as well without Mario and Zelda.\n\n\nExclusivity breeds competition and that makes gaming evolve. If we only have one console. Gaming would stagnate.",
                                          "score": -1,
                                          "created_utc": 1731952337.0,
                                          "replies": [
                                            {
                                              "id": "lxsoemu",
                                              "author": "Usernametaken1121",
                                              "body": "I see you have no interest in entertaining the strategies presented and just want to regurgitate the same talking points and narratives everyone says when this conversation comes up. Have a good day",
                                              "score": 0,
                                              "created_utc": 1731955064.0,
                                              "replies": [
                                                {
                                                  "id": "lxv3as5",
                                                  "author": "FerrickAsur4",
                                                  "body": "let's put it this way, if the game you want is available in the console/platform you already own, what is the point of buying the newer console?",
                                                  "score": 1,
                                                  "created_utc": 1731983218.0,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "lxsow0v",
                                                  "author": "None",
                                                  "body": "And I see you don't understand why people buy consoles in the first place and why there are multiple consoles. Have a good day indeed.",
                                                  "score": 1,
                                                  "created_utc": 1731955211.0,
                                                  "replies": [
                                                    {
                                                      "id": "lxtoh0h",
                                                      "author": "Eastern_Interest_908",
                                                      "body": "If you buy console only because of exclusive then you might as well just get PC. There are lots of games that aren't on consoles. 🤷",
                                                      "score": 3,
                                                      "created_utc": 1731965978.0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "lxsqr6h",
                                                      "author": "Usernametaken1121",
                                                      "body": "Idk why you have to insult me. I'm trying to have a convo and you just ignore everything I said and say the exact same thing you just said, then insult me when I tell you the convo is one sided? Pretty rude of you",
                                                      "score": 1,
                                                      "created_utc": 1731955772.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lxtntrb",
                                      "author": "fanatic26",
                                      "body": "Or like anyone that wants to enjoy games properly, you buy an actual PC.\n\nConsoles are relics of the past....they have been dying for a long time.",
                                      "score": 1,
                                      "created_utc": 1731965782.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "lxvy8jc",
                                      "author": "throwawayreddit585",
                                      "body": "You have no clue what you’re talking about. Microsoft owns the devs and has license agreements that release the blockbuster games. They don’t care about console sales. They’ll get paid either way. \n\nThey care about game pass subs where people can play day ones without having to drop $70 for each title.",
                                      "score": 1,
                                      "created_utc": 1731996228.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxrtjrz",
                      "author": "CrazyDaimondDaze",
                      "body": "Thanks for actually being sensible about the answer unlike the others.\n\n\nIf I wanted to have a \"better gaming experience\", I'd just buy a PC and upgrade it over time. I got no time or the desire for that. I just wanna unwind with a good selection of my favorite games and the PS4 already fills the bill on that one. But I guess I said something offensive to these people all of a sudden...",
                      "score": 11,
                      "created_utc": 1731945668.0,
                      "replies": [
                        {
                          "id": "lxru8pm",
                          "author": "None",
                          "body": "Yeah idk why. I personally don’t care about 4k/60 fps (I play on switch most of the time) and my primary motivation to play on consoles is games and comfort of playing them. There is very little reasons to buy new consoles if old ones do fine. I’ll buy ps5 once it gets more games I am interested in (Stellar blade isn’t enough) or I find it for a very good price (With a disc drive).",
                          "score": 1,
                          "created_utc": 1731945890.0,
                          "replies": [
                            {
                              "id": "lxrvisu",
                              "author": "CrazyDaimondDaze",
                              "body": "Maybe I'm just used to enjoying a good game over the graphics and growing up with old games when I was a kid when everyone were playing with their brand new PS1s or N64s and whatnot... but I guess I don't see the appeal on \"better graphics\" or hyper realistic stuff; same with loading times as long as the game is fine and that's it.\n\n\nLike, if the gameplay is fun; if it has story, it's good; or the music (and this is my favorite aspect) is a banger, I'm totally fine with it.\n\n\nNot saying new games aren't great either, since they can be. When my cousin got me into Elden Ring when it came out, it's what motivated me to get a PS4. But I'm not going to buy a PS5 for \"better graphics\" or Stellar Blade (even if that game looks damn good). If I wanted to play something from Stellar Blade's developer company, Shift Up, I'm already a Nikke player and I'm fine as it is.",
                              "score": 4,
                              "created_utc": 1731946297.0,
                              "replies": [
                                {
                                  "id": "lxrwkko",
                                  "author": "None",
                                  "body": "Same. Graphics are nice but they don’t sell the consoles to me. I play on consoles because playing on PC sucks since you have to always tinker with stuff and you also have to suffer with always online drms. You don’t have this on consoles. \n\n\nNintendo Switch has outsold both PS4 and Xbox One despite being a 2015 spec tablet. Plus unlike Sony and Xbox, Nitendo’s exclusives are actually amazing games that you cannot play anywhere else. Sony and Xbox’ games are good but not my cup of tea. Stellar blade is nice but buying a $500 is too much for just one stellar blade game. \n\n\nI’ll do a r/patientgamers and wait for the price drop.",
                                  "score": 3,
                                  "created_utc": 1731946626.0,
                                  "replies": []
                                },
                                {
                                  "id": "lxrwv39",
                                  "author": "DriftMantis",
                                  "body": "I used to think like this, but now I'm spoiled with my pc. Now I'm salty about anything less than like 144 fps and 2k resolution. \n\nBack in the day, I was perfectly content with 25 fps Nintendo 64 games, but once you start the high-end stuff, your standards change and it's hard to go back.",
                                  "score": 0,
                                  "created_utc": 1731946719.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lxsexf3",
                              "author": "FelopianTubinator",
                              "body": "I’d prefer 60fps over rtx and increased graphical fidelity. I’ll always choose performance over quality mode.",
                              "score": 1,
                              "created_utc": 1731952208.0,
                              "replies": [
                                {
                                  "id": "lxsfp1r",
                                  "author": "None",
                                  "body": "I wish we had RT/60fps and 1080p modes. I hate the 4k forcing. I am playing on a 1080p monitor and I don't care for 4k but it sucks that I have no inbetween option for fancy reflections at a stable framerate but without the resolution.",
                                  "score": 3,
                                  "created_utc": 1731952438.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxsakay",
                      "author": "Skitz-Scarekrow",
                      "body": "Yeah. I got a PS5 because my PS4 was on the way out and, at the time, PS4 Pros were being resold for just about the same as a new PS5. My PS5 mostly plays PS4 games. Almost all of my PS5 games are also on PS4.\n\nI remember people being disappointed that the PS4 and XBone weren't that great of a technical improvement over the last gen, but at least they got new games.",
                      "score": 2,
                      "created_utc": 1731950903.0,
                      "replies": [
                        {
                          "id": "lxscvdr",
                          "author": "None",
                          "body": "Yeah. This gen is truly pathetic. I hope Nintendo Switch 2 is going to be good. It better be. All hope is on Nintendo making actually fun next gen games.",
                          "score": 4,
                          "created_utc": 1731951595.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxrxw63",
                      "author": "Wetzilla",
                      "body": "You can't play literally the exact same games on your ps4 as ps5. Most games don't come out on the Ps4 any haven't for a few years now.",
                      "score": -3,
                      "created_utc": 1731947042.0,
                      "replies": [
                        {
                          "id": "lxrynw8",
                          "author": "None",
                          "body": "They still do. Like Metaphor refantazio, Hogwarts Legacy, Sonic Frontiers. The rest of the games are either games I don’t care about or remakes and I don’t see remakes as new games.",
                          "score": 1,
                          "created_utc": 1731947281.0,
                          "replies": [
                            {
                              "id": "lxs6hjr",
                              "author": "CrazyDaimondDaze",
                              "body": "It's also important to note Japan usually keeps releasing games on the older Play Station console for a longer period of time than other countries, so that's why they still release new games on PS4 still. They did the same with the PS Vita when elsewhere it was already dead; same with the PSP.\n\n\nAnd yeah, while remakes are cool too (loved Resident Evil 2 Remake the most)... they still aren't new games because they took an already existing concept.",
                              "score": 2,
                              "created_utc": 1731949671.0,
                              "replies": [
                                {
                                  "id": "lxs7ikq",
                                  "author": "None",
                                  "body": "Yeah but since I mostly care about Japanese games. I listed them. But afaik some western games also get released on last gen like latest cod games. \n\n\nAs for PS vita. It was dead everywhere except Japan where it was selling well. They stopped producing PS vita only in 2019 because of that.",
                                  "score": 2,
                                  "created_utc": 1731949985.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxscoqk",
                      "author": "David_Norris_M",
                      "body": "I mean at some point they'll just stop making games for ps4 all together. Realistically people who buy consoles just wanna plug and play on the couch with no extra bs pcs do.",
                      "score": -2,
                      "created_utc": 1731951540.0,
                      "replies": [
                        {
                          "id": "lxsd3ff",
                          "author": "None",
                          "body": "Yes but this time hasn't come yet. So no point in updating unless your PS4 bit the dust.",
                          "score": 2,
                          "created_utc": 1731951662.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxxbkkc",
                  "author": "Gahera",
                  "body": "Since the last update, my ui isn’t snappy anymore. Is my ps5 broken?",
                  "score": 1,
                  "created_utc": 1732023918.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxs7caf",
              "author": "Joelony",
              "body": "Honestly? If they made the Dual Sense PS5 controller backward compatible like they did with the DS4, it would be the chef's kiss even if it doesn't support every feature.\n\nI buy my single player games on PS5 for good haptics unless it's on Game Pass.",
              "score": 1,
              "created_utc": 1731949932.0,
              "replies": []
            },
            {
              "id": "lxwmsap",
              "author": "IVIisery",
              "body": "60 fps was a good enough reason for me, no regrets",
              "score": 1,
              "created_utc": 1732011801.0,
              "replies": []
            },
            {
              "id": "ly2k9vd",
              "author": "Klaphood",
              "body": "I sold my PS4 Pro and got a PS5 that way for an \"upgrade cost\" of like ~200 last year.\n\nFull backwards compatibility, a lot of extra power and games, and the fan is finally always silent. That's totally worth it!\n\nNow, 600-800++ to go from 5 to 5 Pro? For what?? Just stupid.",
              "score": 1,
              "created_utc": 1732091432.0,
              "replies": []
            },
            {
              "id": "lxrsrrt",
              "author": "ShiningPr1sm",
              "body": "Ah, so you’re yet another one of those people that hold development back by refusing to move forward… the console’s been out for four years, get with the program already. Also how tf are you expecting a cheaper catalogue?",
              "score": -7,
              "created_utc": 1731945420.0,
              "replies": [
                {
                  "id": "lxrt419",
                  "author": "CrazyDaimondDaze",
                  "body": "Old is good enough for me and got more important things on my plate. I'll buy a PS5 when there's a new PS6 or whatever they'll call it and it has like 4 years in the market.",
                  "score": 2,
                  "created_utc": 1731945529.0,
                  "replies": [
                    {
                      "id": "lxrujns",
                      "author": "ShiningPr1sm",
                      "body": "Uh huh. Sure you will. You’ll just keep making the same argument and then whining about how Sony isn’t thinking about the PS4 players and making games for them several years after PS6 releases.",
                      "score": -5,
                      "created_utc": 1731945986.0,
                      "replies": [
                        {
                          "id": "lxrvcwy",
                          "author": "_RADIANTSUN_",
                          "body": "Why tf do you think it's their responsibility to buy first rather than Sony's to make it good in the first place so they decide it's worth it to buy?",
                          "score": 9,
                          "created_utc": 1731946245.0,
                          "replies": []
                        },
                        {
                          "id": "lxrw7vz",
                          "author": "CrazyDaimondDaze",
                          "body": "... brother, I got a life and shit to do. I love gaming but I ain't got time to complain about \"SoNy IsN'T ThInkINg aBoUt mUh Ps4 fEeLinZ\" because I don't care.\n\n\nReason enough why I didn't even bother to renew the PSN susbscription this year or only play with the PS4 on the weekends and rarely on the week nowadays.\n\n\nYou go enjoy your PS5 and what comes next in peace. Let me enjoy my own gaming.",
                          "score": 3,
                          "created_utc": 1731946515.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxs3yn9",
                  "author": "FerrickAsur4",
                  "body": "how is it the consumer's responsibility when they can't even bring a good enough repertoire to warrant a switch?",
                  "score": 2,
                  "created_utc": 1731948898.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxseecm",
          "author": "Raztax",
          "body": "Well at least it's not Apple, they would just say that customers are looking at the screen wrong.",
          "score": 5,
          "created_utc": 1731952050.0,
          "replies": [
            {
              "id": "lxzmgve",
              "author": "Sobotoc4311",
              "body": "If it were apple, the regular ps5 would suddenly take 20 minutes to load every 15 seconds",
              "score": 3,
              "created_utc": 1732049539.0,
              "replies": [
                {
                  "id": "ly0j34t",
                  "author": "Raztax",
                  "body": "But you would have an option for a 'fast load dongle' aka iDongle for an extra $199.99",
                  "score": 1,
                  "created_utc": 1732059860.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxsmizw",
          "author": "None",
          "body": "lol two games out of 50+. Got em.",
          "score": 2,
          "created_utc": 1731954497.0,
          "replies": []
        },
        {
          "id": "lxvnsjo",
          "author": "Jedibug",
          "body": "Used to test for Back Compat on one of the major systems years ago. Specifically for a new console title upscale. It was a long and tedious process that involved playing a game end to end multiple times while the screen flashes every few seconds taking screenshots.\n\nWithout getting too much into it. There were a lot of problems from a testing perspective. I can only hope the process has been improved.",
          "score": 1,
          "created_utc": 1731991168.0,
          "replies": []
        },
        {
          "id": "lxtqf1o",
          "author": "rolfraikou",
          "body": "I was skeptical as soon as upscaling came into play. Nvidia did it very well. I still don't use it because I don't like the way it looks. So imagining it done by a company that has put less time and research into it, I could only imagine it looking worse.",
          "score": 0,
          "created_utc": 1731966568.0,
          "replies": []
        },
        {
          "id": "lxwstab",
          "author": "Fredasa",
          "body": "It was always such a misbegotten idea.  If a game is forcing you to choose between 4K and 60fps, that means it was designed to run at 4K30 and/or 1440p60—and the modest GPU boost of the Pro is not going to make up the difference for 4K60 in either case, full stop.\n\nThere is a _tiny, tiny_ market for people who have _n_ dollars to spend on a gaming platform, but don't have the _n_ × ~1.1 dollars it would take to get an equivalent PC and finally be free of the shackles of console gaming.  So what is the incentive?  The 2 or 3 noteworthy console exclusives that Sony managed to eke out this year?  Sony must be hoping that consumers haven't noticed that even Japanese devs are starting to give up on the dream of console exclusivity, starting with the likes of Square Enix.",
          "score": 0,
          "created_utc": 1732015485.0,
          "replies": []
        },
        {
          "id": "lxr83xp",
          "author": "SQUIDWARD360",
          "body": "How so?",
          "score": -33,
          "created_utc": 1731938225.0,
          "replies": [
            {
              "id": "lxrc9ex",
              "author": "Lushkush69",
              "body": "***Gestures broadly at EVERYTHING in 2024.***",
              "score": 20,
              "created_utc": 1731939802.0,
              "replies": [
                {
                  "id": "lxrp25j",
                  "author": "SQUIDWARD360",
                  "body": "This reply is typical reddit.",
                  "score": -8,
                  "created_utc": 1731944233.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lxr8z6h",
              "author": "Nacho_Dan677",
              "body": "Everything is performing worse while costing more and it's getting harder each time to justify the price of any given game. Star Wars Jedi survivor on release is a big example. I had to upgrade to a 3060 to run the game in any capacity.",
              "score": 5,
              "created_utc": 1731938560.0,
              "replies": [
                {
                  "id": "lxroyym",
                  "author": "SQUIDWARD360",
                  "body": "So many downvotes and all I got was \"everything\". Typical reddit with complaints but nothing to back it up.",
                  "score": -6,
                  "created_utc": 1731944204.0,
                  "replies": [
                    {
                      "id": "lxrrj8f",
                      "author": "Nacho_Dan677",
                      "body": "What more do you want? I gave you a game example. Do you not play games in 2024 to know this? Poor optimization that requires a 4090 to play some AAA games at barely 60fps. DLC and micro transactions plague this generation of gaming. Call of Duty has to optimize shaders ever once in a while, better on BO6 so far, but my experience in Cold War was horrendous, needing to boot the game 30 minutes before I play just in case shaders decide to compile.\n\n\nAnd don't forget no mans sky, horrible release turned beautiful game and is a passion project at this point.\n\n\nDragonball Sparking Zero, the over priced mess that is right now and constant complaints about it being unbalanced. Mechanics aren't polished, it was half baked and missing a bunch of features from previous titles all in favor of online toxic gameplay.\n\n\nGaming is no longer casual or fun for the most part. It feels like a chore at times.",
                      "score": 5,
                      "created_utc": 1731945027.0,
                      "replies": [
                        {
                          "id": "lxsb3nt",
                          "author": "SQUIDWARD360",
                          "body": "Then find a new hobby and stop coming here to be miserable. It's pathetic.",
                          "score": -2,
                          "created_utc": 1731951064.0,
                          "replies": [
                            {
                              "id": "lxsdfk0",
                              "author": "Skitz-Scarekrow",
                              "body": "Isn't that what you're doing? Being offended that people don't like what you like.",
                              "score": 3,
                              "created_utc": 1731951762.0,
                              "replies": [
                                {
                                  "id": "lxsg8pj",
                                  "author": "SQUIDWARD360",
                                  "body": "What was I offended by? What is it that I liked? You are lost.",
                                  "score": 0,
                                  "created_utc": 1731952599.0,
                                  "replies": [
                                    {
                                      "id": "lxskwcr",
                                      "author": "Skitz-Scarekrow",
                                      "body": "You are offended by \"typical reddit\" despite being given a specific game. You \"like\" the current gen because you keep pissing and moaning that other people are disappointed. Does not feel like I'm lost.",
                                      "score": 2,
                                      "created_utc": 1731954011.0,
                                      "replies": [
                                        {
                                          "id": "lxsok6x",
                                          "author": "SQUIDWARD360",
                                          "body": "You are lost. Yes, I said typical reddit. But you are using your imagination about everything else. Weirdo.",
                                          "score": 0,
                                          "created_utc": 1731955111.0,
                                          "replies": [
                                            {
                                              "id": "lxsprxj",
                                              "author": "Skitz-Scarekrow",
                                              "body": "Okay. Not doing this. Just pointing out that you're being miserable. Feel better.\n\nEdit: yeah, I know. I did it anyway.",
                                              "score": 1,
                                              "created_utc": 1731955479.0,
                                              "replies": [
                                                {
                                                  "id": "lxt06fv",
                                                  "author": "SQUIDWARD360",
                                                  "body": "Look in the mirror lil bro. You're in this sub being miserable about life",
                                                  "score": 0,
                                                  "created_utc": 1731958601.0,
                                                  "replies": [
                                                    {
                                                      "id": "lxt0pml",
                                                      "author": "Skitz-Scarekrow",
                                                      "body": "I haven't complained about anything. You, however, seem to have a chapped ass still. Go outside and relax.",
                                                      "score": 2,
                                                      "created_utc": 1731958762.0,
                                                      "replies": [
                                                        {
                                                          "id": "lxt1kd2",
                                                          "author": "SQUIDWARD360",
                                                          "body": "If I went through your comments I'm sure it's all complaining and detailing your miserable life. I'm going to block you so it doesn't rub off on me.",
                                                          "score": 1,
                                                          "created_utc": 1731959021.0,
                                                          "replies": [
                                                            {
                                                              "id": "lxt1nc1",
                                                              "author": "Skitz-Scarekrow",
                                                              "body": "That's both weird and pathetic.",
                                                              "score": 2,
                                                              "created_utc": 1731959046.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxwutg1",
                  "author": "allofdarknessin1",
                  "body": "3060 was an upgrade?",
                  "score": 0,
                  "created_utc": 1732016584.0,
                  "replies": [
                    {
                      "id": "lxwx5ez",
                      "author": "Nacho_Dan677",
                      "body": "From a 2070 strix.",
                      "score": 1,
                      "created_utc": 1732017780.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxrn0jz",
      "author": "Scruffy_Nerfhearder",
      "body": "Jedi Survivor has been a technical shit show since release. This isn’t surprising at all.\n\nI dropped that game at the midway point because I was tired of the awful buggy visuals and mess of a frame rate. That game needed a year plus extra dev time, but tbh it sounds like that wouldn’t be even enough.",
      "score": 137,
      "created_utc": 1731943563.0,
      "replies": [
        {
          "id": "lxsy43j",
          "author": "Not_My_Emperor",
          "body": "I finished the story then never went back to it. It wants you to spend a bunch of time on whatever the home base/open world-ish planet is, but that planet runs like HOT garbage. It's insane how badly optimized the game is. Reminds me of launch AC Unity, but this one just got way more of a pass because it's Star Wars",
          "score": 32,
          "created_utc": 1731957977.0,
          "replies": []
        },
        {
          "id": "lxtqdkd",
          "author": "Chickachic-aaaaahhh",
          "body": "It's very polished now compared to launch on base ps5. Expected them to keep that version on ps5 pro but no they had to remove the version that got fixed to replace it with a broken mess.",
          "score": 7,
          "created_utc": 1731966555.0,
          "replies": []
        },
        {
          "id": "lxt512a",
          "author": "None",
          "body": "I feel like I’m the only person who never encountered any problems with either Jedi games",
          "score": 10,
          "created_utc": 1731960069.0,
          "replies": [
            {
              "id": "lxul3w2",
              "author": "Weird_Cantaloupe2757",
              "body": "You encountered all of the issues, you are just lucky enough to not be sensitive to them",
              "score": 19,
              "created_utc": 1731976861.0,
              "replies": []
            },
            {
              "id": "lxtnz0k",
              "author": "Scruffy_Nerfhearder",
              "body": "Had no issues with the first. Second one was fucked for me.",
              "score": 7,
              "created_utc": 1731965826.0,
              "replies": []
            },
            {
              "id": "lxug4dj",
              "author": "JailhouseMamaJackson",
              "body": "I didn’t either. I actually don’t know anyone who *did* have problems besides people online. \n\nI’ve played through 5 or 6 times now and had no issues on PS5.",
              "score": 2,
              "created_utc": 1731975125.0,
              "replies": [
                {
                  "id": "lxx15mi",
                  "author": "None",
                  "body": "Played through twice and never had so much as a stutter",
                  "score": 5,
                  "created_utc": 1732019689.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxt4tbx",
          "author": "I_Was_Fox",
          "body": "What platform did you play it on? I played it through on opening week on the Series X and didn't have a single visual or frame rate issue",
          "score": 2,
          "created_utc": 1731960005.0,
          "replies": [
            {
              "id": "lxtu3ju",
              "author": "dalehitchy",
              "body": "Was about to say the same... Never had issues on series x",
              "score": 4,
              "created_utc": 1731967701.0,
              "replies": [
                {
                  "id": "lxtylhw",
                  "author": "I_Was_Fox",
                  "body": "Yeah I'm wondering if all this complaining is all from PS5 people. So far it sounds like it",
                  "score": 0,
                  "created_utc": 1731969146.0,
                  "replies": [
                    {
                      "id": "lxu7sv5",
                      "author": "Genghis_Tr0n187",
                      "body": "It's a shitshow on PC with a 4090 as well. I average about 120 FPS (from what I remember) then it periodically tanks to literally 1 frame then starts ramping back up to average. If it happens in anywhere but the hub world it's a guaranteed death.",
                      "score": 1,
                      "created_utc": 1731972231.0,
                      "replies": [
                        {
                          "id": "lxu98p2",
                          "author": "I_Was_Fox",
                          "body": "Interesting. Was this a primarily Xbox dev'd game that was ported to PS5 and PC or something? Thats super rare these days",
                          "score": 1,
                          "created_utc": 1731972730.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxtnw3w",
              "author": "Scruffy_Nerfhearder",
              "body": "Ps5. Ran like shit. Looked like shit. Even in performance mode. Especially the hub town.",
              "score": 2,
              "created_utc": 1731965801.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxu1e4u",
          "author": "None",
          "body": "on pc gamepass couldn't get a single sesh without a crash. After  3x I Uninstalled",
          "score": 1,
          "created_utc": 1731970051.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrbx9h",
      "author": "zarafff69",
      "body": "Yeah I looked at that Digital Foundry video of Jedi Survivor, and it’s baaaad. The entire foliage just flickers constantly or whatever? It’s not that it looks imperfect, it just looks broken. I would rather play that game on the base PS5, that’s how broken it looks. \n\nIt’s insane how bad this game is on a technical level. And they even bragged about putting the game out earlier lol…..\n\nBut yeah that PSSR up scaling doesn’t look as great as we’d hoped… Not even close to DLSS, and even worse than FSR in some scenarios???",
      "score": 193,
      "created_utc": 1731939676.0,
      "replies": [
        {
          "id": "lxri1cw",
          "author": "JustsomeOKCguy",
          "body": "Outlaws looks really bad too. At least with jedi survivor not all planets are pure foliage and sometimes looks good. Survivor looks bad even in cities with all of the flickering. \n\n\nReally hoping at this point they either fix it or just let us go back to what the base versions look like with the extra cpu.",
          "score": 40,
          "created_utc": 1731941875.0,
          "replies": [
            {
              "id": "lxs6w0m",
              "author": "None",
              "body": "[deleted]",
              "score": -3,
              "created_utc": 1731949794.0,
              "replies": [
                {
                  "id": "lxsvl12",
                  "author": "None",
                  "body": "Maybe on console lol.",
                  "score": 2,
                  "created_utc": 1731957217.0,
                  "replies": []
                },
                {
                  "id": "lxsmq6n",
                  "author": "None",
                  "body": "[removed]",
                  "score": -1,
                  "created_utc": 1731954557.0,
                  "replies": [
                    {
                      "id": "lxwah93",
                      "author": "Johnprogamer",
                      "body": "Lol rage bait comments at least used to be believable",
                      "score": 2,
                      "created_utc": 1732003554.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lxrhzuu",
          "author": "triffy",
          "body": "The problem here is the implementation from the developer. PSSR can be better than FSR, if done right.",
          "score": 19,
          "created_utc": 1731941861.0,
          "replies": [
            {
              "id": "lxrp6b9",
              "author": "zarafff69",
              "body": "Who knows? Maybe it’s actually worse when up scaling from a lower resolution?\n\nHonestly up scaling from 1440p->4k wasn’t really the big issue. FSR is already kinda ok with that. It’s just that everything lower than that just makes FSR fall apart. And loooots of games on the PS5 run at like 720p to 1080p internally. So if PSSR doesn’t fix that…. that’s kinda bad. \n\nEspecially because DLSS 1080p->4k still looks rather perfect imo",
              "score": 2,
              "created_utc": 1731944270.0,
              "replies": [
                {
                  "id": "lxrteax",
                  "author": "PotatEXTomatEX",
                  "body": "We have Rebirth right there telling us bro",
                  "score": 14,
                  "created_utc": 1731945619.0,
                  "replies": [
                    {
                      "id": "lxs4az6",
                      "author": "Battlecookie",
                      "body": "Rebirth has decent base resolutions. At least 1080p I think. The upscaling they use on normal PS5 is just complete ass, that’s why it looks so bad.",
                      "score": 5,
                      "created_utc": 1731949002.0,
                      "replies": []
                    },
                    {
                      "id": "lxv8e08",
                      "author": "Demonchaser27",
                      "body": "I feel like, based on everything I've seen, that Rebirth's problem wasn't that it needed PSSR... but that it needed to handle it's original scaling/rendering better in the first place?  I've never seen another game so blurry and horrible looking on PS5 as that game.  It's an outlier, honestly.",
                      "score": 2,
                      "created_utc": 1731985040.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxv86wq",
              "author": "Demonchaser27",
              "body": "This makes sense and all... but I feel like these upscaling technologies are gonna be really hit or miss until it's literally just \"plug n' play\" for devs.  Because I've literally seen some bad implementations of DLSS (UI smearing sometimes, blurry ghosting where another game has little to none on similar things, etc.).  Upscaling tech is just a shit show right now, honestly.  This is kind of why I said in the past that, to the malais of some hardcore tech redditors in another sub, this shit isn't going to be sustainable/workable unless there's a solid, non-hardware locked (non-specific) implementation that's easy to use and pretty much universal.\n\nEven DLSS cannot claim this.  It often requires help by Nvidia to do well/right and requires their specific hardware to work.  AMD is closer, in that it's universal and apparently easier to implement, but doesn't take advantage of AI hardware to help it when it could (it should honestly have two modes for better compatibility AND explicit use of hardware).  And as such it often looks god awful in some way or another.  And XeSS... I mean, it's cool and looks good in the few times I've seen it.  But apparently not really performant enough and still requires AI hardware only.  I suppose in future, it could replace AMD's solution when every single GPU has enough AI powered components to make good use of it and no one is on pre-AI compatible GPUs?  Maybe?\n\nBut regardless, it's a fucking mess right now, for devs and for everyone else who has to play games with this crap required.  I think we're past the \"devs need to do better\" thing.  At a certain point, if it's a large enough problem you just gotta accept facts that people aren't going to \"get better at it\" and instead we probably just have to improve the tech to be easier to use.  If it's this bad, we can call people lazy and get upset all day... but at a certain point, we might just need to make the shit simpler to use while still getting most/all of the benefits.  Otherwise this is just going to keep being a problem.",
              "score": 1,
              "created_utc": 1731984969.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxre438",
          "author": "pinkynarftroz",
          "body": "I think this just proves how insane trying to game at 4K. You literally have to render 4x as many pixels for barely any benefit, and in this case a huge drawback since the AI upscalers ruin the image.\n\nWe really should doing 1080p with good anti aliasing and better effects. Way better way to utilize the GPU and games can actually look better.",
          "score": 48,
          "created_utc": 1731940482.0,
          "replies": [
            {
              "id": "lxri2l5",
              "author": "Eruannster",
              "body": "The issue here is also that Jedi Survivor is an incredibly messy game, tech-wise. And Respawn just does not give that many shits about fixing issues. \n\n\nThe performance mode was pretty much just completely broken for *months* after release because they tried slapping on a bunch of raytracing features and it completely tanked both performance and resolution (and in turn, image quality).",
              "score": 30,
              "created_utc": 1731941887.0,
              "replies": [
                {
                  "id": "lxrj3rl",
                  "author": "pinkynarftroz",
                  "body": "Honest question: Is it just nitpicking, or does it ruin the game? \n\nI ask because Digital Foundry completely shit on FF7 Rebirth’s performance mode, and yet when I played it in 1080p it didn’t look bad at all. All I noticed were some lower res textures in places if you actually stopped to look.\n\nIt feels like they over blow lots of things that are small and don’t really matter in motion during the heat of the game.",
                  "score": -3,
                  "created_utc": 1731942245.0,
                  "replies": [
                    {
                      "id": "lxrjy6d",
                      "author": "Eruannster",
                      "body": "It looks like absolute ass. All foliage (trees, grass, vegetation) strobes and flickers at all times. The first planet is fine because there's no foliage on it (Coruscant) but the second planet (Koboh) is the planet where you spend the most time on and it's literally a lush, vegetated planet with plants everywhere. It is literally headache-inducingly awful. QA *cannot* have missed this and marked it as okay unless they just literally never loaded up Koboh at all.\n\n\nPersonally I don't think they overblow things at all - they point out the issues that exist because that's what they set out to do. (They also praise the good stuff. Unfortunately a lot of studios have been doing a lot of bad stuff lately...)",
                      "score": 17,
                      "created_utc": 1731942534.0,
                      "replies": []
                    },
                    {
                      "id": "lxrtb80",
                      "author": "raccoonbrigade",
                      "body": "7 Rebirth s performance mode looked truly horrid",
                      "score": 10,
                      "created_utc": 1731945592.0,
                      "replies": []
                    },
                    {
                      "id": "lxrysyb",
                      "author": "FlyingStarShip",
                      "body": "Performance mode’s image quality was terrible compared to quality mode. Loved the game though!",
                      "score": 2,
                      "created_utc": 1731947324.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxrf3d8",
              "author": "zarafff69",
              "body": "I mean DLSS from 1080p -> 4K looks muuuuuuchhh better than native 1080p on a 4K screen. Even FSR will look better. That’s just a weird conclusion to make lol",
              "score": 48,
              "created_utc": 1731940838.0,
              "replies": [
                {
                  "id": "lxrg1if",
                  "author": "None",
                  "body": "How do you mean it’s better? Upscaling always creates artefacts",
                  "score": -29,
                  "created_utc": 1731941177.0,
                  "replies": [
                    {
                      "id": "lxri44b",
                      "author": "Thedrunkenchild",
                      "body": "It does but in the case of dlss they’re quite minor, and it’s not like normally upscaled 1080p doesn’t have artifacts either, hell even native resolution can have odd looking pixels on specific patterns, but I would ultimately choose 4k dlss over 1080p with normal upscaling any day",
                      "score": 20,
                      "created_utc": 1731941902.0,
                      "replies": []
                    },
                    {
                      "id": "lxs07l1",
                      "author": "DriftMantis",
                      "body": "When dlss first game out like forever ago at this point, Gen 1 had some artifacting. However, at this point, generally, the image is more stable than native using modern dlss. Upscaling to 4k from 1080p looks far superior to native 1080p like the other commenter stated. \n\nI think you just got to play around with it to get the best image quality. Generally, I set the base resolution to something I can run close to 60fps maxed out, and then use dlss quality to boost the game to 90-100fps. \n\nYou can also use dlaa in some games, which is using the technology to add anti-aliasing over the native image, so dlss can be used even when you're not upscaling to boost frame rates.",
                      "score": 6,
                      "created_utc": 1731947758.0,
                      "replies": []
                    },
                    {
                      "id": "lxrswrj",
                      "author": "PotatEXTomatEX",
                      "body": "To be young and naive.",
                      "score": 6,
                      "created_utc": 1731945464.0,
                      "replies": []
                    },
                    {
                      "id": "lxs51hk",
                      "author": "3600CCH6WRX",
                      "body": "DLSS 3 is really good. You can’t really notice artifact and looks much sharper than lower res. Sometime DLSS might looks better than native 4k because the game implementation of AA is subpar.",
                      "score": 2,
                      "created_utc": 1731949226.0,
                      "replies": []
                    },
                    {
                      "id": "lxv0oc4",
                      "author": "_I_AM_A_STRANGE_LOOP",
                      "body": "DLSS from 1080p to 4K looks muuuuuch better than 'native' (even assuming good TAA) 1080p on a 1080p screen, too! DSR/DLDSR make that easy to try for yourself if you have an RTX card and don't believe me. Or just look up 'dldsr + dlss' for many, many examples",
                      "score": 1,
                      "created_utc": 1731982278.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxrt35l",
              "author": "raccoonbrigade",
              "body": "No way. A good upscale looks way better than 1080p with AA. These implementations are just extremely scuffed. 7 Rebirth is a much better indicator of what it can do",
              "score": 20,
              "created_utc": 1731945521.0,
              "replies": []
            },
            {
              "id": "lxrgg11",
              "author": "TheKwak",
              "body": "Eh, after switching from 1080p to 1440p I don’t think I’d ever want to go back. No matter how good the anti aliasing may be, HUD elements like text will always look blurry, and if your monitor is any bigger than 25inches it’s definitely noticeable.\n\nBut I agree that 4K is overkill. I’m very happy with 1440p as the sweet spot between the two",
              "score": 13,
              "created_utc": 1731941321.0,
              "replies": [
                {
                  "id": "lxrh6po",
                  "author": "pinkynarftroz",
                  "body": "If you are gaming on a PC and sitting close, then sure. Go for 1440p. Or get a 16:10 monitor and go 1600p.\n\nBut for consoles televisions only come in 1080 and UHD so it’s one of the other.",
                  "score": -5,
                  "created_utc": 1731941581.0,
                  "replies": [
                    {
                      "id": "lxsal4g",
                      "author": "Usernametaken1121",
                      "body": ">But for consoles televisions only come in 1080 and UHD\n\nNever heard of LG C series  huh?\n\nIt's not 2010 anymore lol",
                      "score": 6,
                      "created_utc": 1731950910.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxrg78j",
              "author": "someguy50",
              "body": "> You literally have to render 4x as many pixels for barely any benefit, and in this case a huge drawback since the AI upscalers ruin the image.\n\nI'm going to disagree strongly here. 1080P->2160P is a clear, strong difference in clarity. DLSS does a great job, but dogshit scalers do ruin the image.",
              "score": 21,
              "created_utc": 1731941233.0,
              "replies": [
                {
                  "id": "lxrifo4",
                  "author": "pinkynarftroz",
                  "body": "Time and time again, it’s been shown the jump to 4K from 1080 is not noticeable in and of itself. Go watch the resolution demos by Steve Yedlin to see for yourself. \n\nToy Story 4 will look the same to you at 2K and 4K, because they spend a massive amount of time rendering each frame with “perfect” effects settings. In fact, that film was mastered in 2K since rendering it in 4K would have taken massively longer for no benefit. 4K Blu-rays of it are upscaled.  \n\nHaving better effects starting from 1080p will get you to a better image much faster than making sacrifices to get it to 4K.",
                  "score": -29,
                  "created_utc": 1731942013.0,
                  "replies": [
                    {
                      "id": "lxruz48",
                      "author": "someguy50",
                      "body": "> Time and time again, it’s been shown the jump to 4K from 1080 is not noticeable in and of itself. Go watch the resolution demos by Steve Yedlin to see for yourself. \n\nI can load up 50 games on my PC and play at 1080p and 2160p and see the difference immediately. What exactly are you arguing? Whether 4x the resolution is noticeable or the resolution movies are mastered in?",
                      "score": 16,
                      "created_utc": 1731946122.0,
                      "replies": [
                        {
                          "id": "lxrxytn",
                          "author": "locofspades",
                          "body": "Yeah this person is insane.  Its night and day between 1080p and 4k.  Also, movies and games are like comparing apples to lawn mowers.",
                          "score": 13,
                          "created_utc": 1731947064.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lxs868d",
                      "author": "FUTURE10S",
                      "body": "Thing is, when you've got something like Toy Story, rendering it at 2K or 4K doesn't matter as much because it's got a bunch of samples per pixel, making basically flawless antialiasing. Even then, the resolution bump would be noticeable to those trying to find a difference. By contrash, video games are usually 1 sample per pixel, and they benefit way more from going from 2K to 4K as a result, since you're literally quadrupling the amount of samples you have on the screen. Now 2K with 4xSSAA vs 4K, that's when it's going to be a bit less clear which is which, as the line gets a little harder to spot each time with every additional set of samples, but a difference is still there.\n\nAlso, their effects take minutes to render per frame. We can't really do that in video games.",
                      "score": 3,
                      "created_utc": 1731950183.0,
                      "replies": []
                    },
                    {
                      "id": "lxrpjdg",
                      "author": "Moscato359",
                      "body": "Thank you for using 2k correctly ",
                      "score": 1,
                      "created_utc": 1731944387.0,
                      "replies": []
                    },
                    {
                      "id": "lxs5mvb",
                      "author": "letsgoiowa",
                      "body": "I would agree for movies at a substantial distance but absolutely not for games that need antialiasing and absolute clarity. 1080p looks plain BAD at monitor distance and is simply blurry at TV distance. DLSS and FSR upscaling from 1080p and above to 4K is actually great though. Doesn't cost much more than 1080p native and it's a massive image quality gain.",
                      "score": 1,
                      "created_utc": 1731949409.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lxseq1o",
              "author": "FranzFerdinand51",
              "body": "Spoken like a true console gamer lol. 2/4K is superior to 1080 in so many clearly visible and important ways. Just because a console can't handle it doesn't mean it's not worthy.",
              "score": 1,
              "created_utc": 1731952146.0,
              "replies": []
            },
            {
              "id": "lxrowkc",
              "author": "kbn_",
              "body": "Technically speaking, most people playing in 4K with DLSS are doing exactly that: 1080p with excellent anti aliasing.",
              "score": 0,
              "created_utc": 1731944182.0,
              "replies": []
            },
            {
              "id": "lxrev28",
              "author": "None",
              "body": "Screen refresh rate makes such a huge difference compared to resolution. 1080p at 240hz looks much better than 4k 60hz",
              "score": -6,
              "created_utc": 1731940755.0,
              "replies": [
                {
                  "id": "lxri5jv",
                  "author": "Roger-Just-Laughed",
                  "body": "I think this is a bit overblown. I definitely appreciate the higher framerate and think 60fps should be the minimum, but I'd pick 4K60 over 1080p120 any day. Once the framerate is \"good enough,\" the visual artifacts from the lower resolution bother me *way* more.",
                  "score": 16,
                  "created_utc": 1731941915.0,
                  "replies": [
                    {
                      "id": "lxrirkl",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -3,
                      "created_utc": 1731942127.0,
                      "replies": [
                        {
                          "id": "lxrkv1i",
                          "author": "Roger-Just-Laughed",
                          "body": "I mean... You are literally correct, but in practice people often use them interchangeably because the only reason anyone cares about refresh rate is so they can see a higher frame rate. So I'm not sure what your point is here. A 60fps game isn't going to look better on a 240hz monitor compared to a 60hz monitor.",
                          "score": 6,
                          "created_utc": 1731942844.0,
                          "replies": [
                            {
                              "id": "lxrm55b",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -10,
                              "created_utc": 1731943275.0,
                              "replies": [
                                {
                                  "id": "lxrt6wa",
                                  "author": "Roger-Just-Laughed",
                                  "body": "That's just not correct. Assuming even frame-pacing, there is no perceivable difference between a 60fps game on a 60hz monitor or a 120hz monitor. The monitor itself is refreshing 2x as often but the number of frames remains the same. It's just showing each frame twice. Your eye will still perceive that as a single frame. Any suggestion otherwise is snake oil.\n\nWhere you *do* see benefits is when the frame-time does *not* line up evenly. For example, if your game is locked to *40fps* instead of 60. As 40 doesn't divide evenly into 60, you have a monitor refreshing every 16 milliseconds but the game only providing new frames every 25 milliseconds. Anytime those don't line up, you end up with frames lingering a little too long, and then suddenly changing too quickly. This gets perceived as stutter.\n\nIn that situation, a 120hz monitor *would* make the game feel smoother as it's evenly divisible by 40, so each frame can be delivered on time with no skipped frames. This is also the case for a 240hz monitor, which would appear smoother than 60hz but provide no perceivable benefit over a 120hz monitor. And if somehow you had a 40hz monitor, it would also look identical.\n\nBut as we were talking about 60fps earlier, no, there would be no perceivable difference between a 60hz monitor and a 120 or even 240 hz monitor, assuming a locked frame rate with even pacing.",
                                  "score": 6,
                                  "created_utc": 1731945554.0,
                                  "replies": [
                                    {
                                      "id": "lxrutgr",
                                      "author": "NergNogShneeg",
                                      "body": "Now you are just being silly. No perceivable difference? Bye.",
                                      "score": -10,
                                      "created_utc": 1731946073.0,
                                      "replies": [
                                        {
                                          "id": "lxrvqqd",
                                          "author": "Roger-Just-Laughed",
                                          "body": "What difference would you perceive? Regardless of the refresh rate difference, whether it's 60hz, 120hz, or 240hz, you're still just seeing a new frame every 16 milliseconds at 60fps.",
                                          "score": 8,
                                          "created_utc": 1731946366.0,
                                          "replies": [
                                            {
                                              "id": "lxrwywh",
                                              "author": "NergNogShneeg",
                                              "body": "The entire screen looks sharper and better. Motion looks better. I absolutely can tell if a screen is running 60hz or 120hz. It’s night and day to me. I’ll agree once you go past 120hz it all starts to look the same but to say you cannot perceive the difference between 60 and 120hz is just plain wrong. I absolutely guarantee I can tell if a game is running 60hz or 120hz.\n\nEdit to add- high refresh rate applies to more than just gaming. My desktop is also sharper and mouse movement is smoother. I can’t stand 60hz for work or gaming.",
                                              "score": -1,
                                              "created_utc": 1731946752.0,
                                              "replies": [
                                                {
                                                  "id": "lxs50es",
                                                  "author": "Roger-Just-Laughed",
                                                  "body": "Games don't run at 60hz. Your monitor does. The FPS count is the number of frames in a second the game is rendering. The hz is a measurement of how often the screen itself is able to display a new frame.\n\nIf there is no new frame to display when the monitor checks for a new frame, it will not display a new frame. The pixels on the screen remain exactly the same.\n\nYour statements on clarity of motion are absolutely true at higher FPS. At its core, motion on a screen is an illusion that occurs when you see hundreds of still images in succession. The more frames, the smoother and clearer the motion appears.\n\nThe monitor's job is just to display those frames without getting in the way. If your game is only sending a new frame every 16 milliseconds, that's all your monitor is going to be able to display. A low-end monitor can act as bottleneck by *not* displaying those frames as I described above with a 40fps game example, or more simply, if your game is sending a new frame every 8 milliseconds (120fps) but your monitor can only *display* a new frame every 16 milliseconds (60hz) you will literally not see half the frames you're supposed to. You're losing half your frame data and it'll look significantly less smooth by comparison.\n\nBut a 120hz monitor running a 60fps game is still just displaying a new frame every 16 milliseconds because that's all the game is sending to it. Your 120hz monitor is not generating new frames. It's not adding new pixels. It's not adding new information at all. It's displaying the exact same frames at the exact same time as a 60hz or 240hz monitor would with a 60fps game, because those are the only frames the game is sending. The images on the screen are identical and being displayed at the same intervals. There is quite literally no difference with what you would see on the screen.\n\nEdit: This is also true of your Desktop at work. The reason a 120hz monitor looks smoother is because your operating system is ALSO rendering at 120fps. If it wasn't, you wouldn't see a difference.",
                                                  "score": 5,
                                                  "created_utc": 1731949217.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lxtceha",
                                  "author": "buckX",
                                  "body": "There's a pretty quickly reached limit to that. 60Hz was selected as being close to the limit for human eyes. 120Hz is absolutely past it, so you won't notice a difference between 60fps on a 120Hz display vs. a 240Hz display.\n\nThe main reason for the massive uptick in refresh is divisibility. If your rig can render a game at 80fps, a 120Hz display will have a staggered 1 2 1 2 number of refreshes with each frame, and would look better simply capping the fps to 60. A 240Hz display can simply display 3 refreshes per frame, which is why all the new refresh rates are multiplies of the 24Hz movie standard.",
                                  "score": 1,
                                  "created_utc": 1731962336.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lxrixyo",
                      "author": "None",
                      "body": "Oh contrare por favor, look I get 4k is nice but 60hz should no longer be minimum. Live above 120, even 144hz for a while. Then go look at 60 and see how janky it looks. \n\nOnce you see the smoothness of the future you can’t really go back.",
                      "score": -5,
                      "created_utc": 1731942189.0,
                      "replies": [
                        {
                          "id": "lxrl6nn",
                          "author": "StevenSmithen",
                          "body": "I have 144 and 165.hz gaming monitors and if a game runs at 60 fps ony 55inch TV it looks totally fine. 4k 60 is superior IMHO. Especially on a big TV. Now if it was on my monitors I would care more but the bigger the screen and further away you sit, the less you notice certain things.\n\n60 fps without frame hitching is my preference... If you could go up to 120 then I'd be happier but for some reason on the big screen TV I barely even noticed as long as it's 60",
                          "score": 4,
                          "created_utc": 1731942952.0,
                          "replies": [
                            {
                              "id": "lxrt8v9",
                              "author": "None",
                              "body": "You’re arguing for a big screen tv where resolution matters more due to size. But again, there’s a limit for resolution at different sizes. It’s why smaller screens like the switch and the steam deck can run lower resolution and look great. \n\nRefresh rate is still the king in my mind. If you’re buying a tv at 60hz then you’re not getting a good deal, you’re getting a bad tv. And monitors should start at 144hz. The fluidity of fast-paced movement is a game changer in visual suspension of disbelief. If you’re playing an fps or even a sports game it makes the character movement seem so much more realistic.",
                              "score": 0,
                              "created_utc": 1731945571.0,
                              "replies": [
                                {
                                  "id": "lxrvi3x",
                                  "author": "StevenSmithen",
                                  "body": "I'm well aware of these things. I'm a super nerd and have five gaming computers and every console known to mankind, I just thought we were in the PlayStation subreddit and everyone has those attached to their tvs, maybe I'm just out of date and more people have them attached to super OLED gaming monitors now?\n\nMy TV is a 144hz vrr model but 4k is king on that thing. 60 fps first of course.\n\nI agree that 144 Hertz is like going from 30 to 60 FPS but for some reason on the big TV when it runs at a smooth 60 I can barely tell and I can definitely tell when it's on my gaming monitor.",
                                  "score": 1,
                                  "created_utc": 1731946290.0,
                                  "replies": [
                                    {
                                      "id": "lxrw4po",
                                      "author": "None",
                                      "body": "This is r/gadgets",
                                      "score": 0,
                                      "created_utc": 1731946487.0,
                                      "replies": [
                                        {
                                          "id": "lxxi3n8",
                                          "author": "StevenSmithen",
                                          "body": "The post is about PlayStation 5.",
                                          "score": 1,
                                          "created_utc": 1732026296.0,
                                          "replies": [
                                            {
                                              "id": "lxxn72w",
                                              "author": "None",
                                              "body": "You’ll figure it out",
                                              "score": 1,
                                              "created_utc": 1732028037.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lxrfvnf",
                  "author": "pinkynarftroz",
                  "body": "There is that too. Much easier to hit 1080p60 than 2160p60, and you can still use more advanced graphical effects.",
                  "score": 2,
                  "created_utc": 1731941120.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxrp49c",
          "author": "Skeleflex871",
          "body": "If the ratchet and clank comparison is anything to go by, PSSR is probably sitting besides XMX XeSS as of now but it depends entirely on how good of an implementation the devs do. I’d like to point out that in that same video even DLSS is showing the foliage flicker while FSR doesn’t. \n\nIt’s the implementation, not the tech.",
          "score": 5,
          "created_utc": 1731944252.0,
          "replies": []
        },
        {
          "id": "lxri3kv",
          "author": "None",
          "body": ">But yeah that PSSR up scaling doesn’t look as great as we’d hoped… Not even close to DLSS, and even worse than FSR in some scenarios???\n\nYes, in some scenarios it definitely does. But that's probably just evidence that the implementation is broken/needs work. \n\nIt's brand new at this point. I think Sony needs to still iron out some details.",
          "score": 4,
          "created_utc": 1731941897.0,
          "replies": []
        },
        {
          "id": "lxsjsbw",
          "author": "None",
          "body": "How could anyone expect it to look like DLSS? Sony doesn’t have the institutional knowledge or expertise to get anywhere near that",
          "score": 1,
          "created_utc": 1731953675.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxs45mi",
      "author": "kc0181",
      "body": "Ps5 pro is pretty much beta testing for PSSR for Sony",
      "score": 13,
      "created_utc": 1731948956.0,
      "replies": []
    },
    {
      "id": "lxr9w8p",
      "author": "None",
      "body": "The whole advantage to consoles (for devs) is that they have a standardized piece of hardware to target and optimize for. So yeah, changing that standard even a little is going to cause some unforeseen problems in some games at least. \n\nAnd Jedi Survivor was sort of a mess on the tech side of things for a long time anyway. I’m really not surprised it’s got issues with a tech change. \n\nThese things will probably get patched out eventually. And newer games releasing mid 2025 and beyond will probably have fewer issues like this because they will have likely tested it more than games that came out before or at the same time as the Pro.\n\nIt’s not awesome that a new toy doesn’t immediately make everything better instantly. But this isn’t that surprising nor that big a deal.",
      "score": 75,
      "created_utc": 1731938913.0,
      "replies": [
        {
          "id": "lxrv6me",
          "author": "wakeytom",
          "body": "Not surprising but it's a pretty big deal. Upgrading from a console that worked to one that doesn't and is as expensive as it is, is a pretty big deal when you have to play so many games on ps5 og. At the moment you can't even really trade up as you need both",
          "score": 19,
          "created_utc": 1731946189.0,
          "replies": []
        },
        {
          "id": "lxrgj5z",
          "author": "PageOthePaige",
          "body": "The issue is that there's not much value in the PS5Pro to begin with. The majority of games that already played great on a PS5, nevermind a PS4/Pro, are unaffected. The Pro is 200 more expensive than its contemporary which has seen no direct discount, only discounts for used models. \n\nSo, the hope is that a pro model would be able to handle the few struggling games better. Jedi Survivors is a high profile, pretty solid game with a long history of hardware issues. \"This plays solidly now\" would have been a great pitch. It doesn't. \n\nA lot of people are hoping to preempt GTA 6 issues with the pro. Assuming that game will be worth playing, the showing from the pro is very minimal. \n\nThis is after years of hype for a pro as a replacement model. Yes, the raw difficulties with hardware are there and yes, after patching there will be improvements, but this is a worse value proposition than the launch PS3 was, by a couple miles.",
          "score": 16,
          "created_utc": 1731941351.0,
          "replies": [
            {
              "id": "lxrpsrx",
              "author": "None",
              "body": "For sure, it's not great for Sony who is trying to sell this thing. But also they can't perfectly control the quality of third party games anymore now than they could before. It never looks great if games don't run well on the thing you're selling, but it is what it is when you can't do much about it. \n\nThey would obviously prefer Jedi Survivor to run better, but no matter what type of new hardware they ended up rolling out, it was likely never going to be a one size fits all fix to every game. \n\nMy point was not so much that this isn't a harm to the value proposition of the Pro, which I totally agree has a weaker value proposition, but more that anyone with realistic expectations shouldn't be surprised by bumps in the road like this, especially in third party titles (especially especially from games like JS which had a bevy of tech problems on seemingly every platform).\n\nI would actually be more concerned if Sony's first party games had significant or notable issues with the Pro (and maybe there's some of that out there that I haven't seen yet).",
              "score": 1,
              "created_utc": 1731944472.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxt4oer",
      "author": "gouldybobs",
      "body": "Jedi Survivor was a shit show on PC. Not sure if latest patch has fixed it but it was a shite",
      "score": 5,
      "created_utc": 1731959964.0,
      "replies": []
    },
    {
      "id": "lxrtwli",
      "author": "malman21",
      "body": "Jedi didn’t even work right on the base ps5. Color me shocked that it’s still a mess.",
      "score": 10,
      "created_utc": 1731945782.0,
      "replies": []
    },
    {
      "id": "lxrmb1x",
      "author": "c000weee",
      "body": "Software issue not hardware. Come on get it right.",
      "score": 22,
      "created_utc": 1731943331.0,
      "replies": [
        {
          "id": "lxrpr8b",
          "author": "Lets_Kick_Some_Ice",
          "body": "Yeah, this crap isn't a Pro problem, it's a developer problem.",
          "score": 18,
          "created_utc": 1731944458.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxtbcvf",
      "author": "SpliTTMark",
      "body": "The jedi game was just a super poorly made game from the start",
      "score": 3,
      "created_utc": 1731962019.0,
      "replies": []
    },
    {
      "id": "lxsv3oy",
      "author": "trowayit",
      "body": "Upscaling is a bandaid for shitty optimization.",
      "score": 25,
      "created_utc": 1731957072.0,
      "replies": [
        {
          "id": "lxuk7h0",
          "author": "Steve_Cage",
          "body": "I knew this would happen. Instead of optimizing the game the devs will use FSR/PSSR as a crutch.",
          "score": 6,
          "created_utc": 1731976549.0,
          "replies": []
        },
        {
          "id": "lxuklut",
          "author": "ironicallynotironic",
          "body": "This is just markedly untrue and bad faith. DLSS is a dream come true and PSSR is very promising.",
          "score": 1,
          "created_utc": 1731976686.0,
          "replies": [
            {
              "id": "lxukttd",
              "author": "trowayit",
              "body": "Do you touch yourself to digital foundry videos",
              "score": -4,
              "created_utc": 1731976763.0,
              "replies": [
                {
                  "id": "ly0f9ra",
                  "author": "ironicallynotironic",
                  "body": "Every night 😎",
                  "score": 0,
                  "created_utc": 1732058544.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxrhq7f",
      "author": "pulsarbrox",
      "body": "This is totally on developers, not the system. It is developers choice to use PSSR or FSR, or whatever method looks and performs better. Horizon Forbidden West is a good example for this. When It was released performance mode looked terrible. They've fixed the upscale algorithm they were using within 3 or 4 patches and it looked great afterwards.\n\nJedi Survivor is Respawn's problem, they need to spend a little bit more time on the engine.",
      "score": 24,
      "created_utc": 1731941769.0,
      "replies": [
        {
          "id": "lxs8wnm",
          "author": "ConcreteSnake",
          "body": "100% agree, I don’t understand why people seem to base the merit and potential of the PS5 Pro on 1 or 2 games that happen to look worse while there are a dozen other games that look better. We don’t do that with PC hardware, we look at multiple games and the performance increase averaged across those games. Hell, even DLSS when it first launched 6 years ago was hot garbage. It’s on the develops to make good use of the additional hardware and features. If the game ends up looking worse, it’s on them, not Sony the hardware manufacturer.",
          "score": 5,
          "created_utc": 1731950405.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxr9g4j",
      "author": "SkrullandCrossbones",
      "body": "Lazy coding and cheap cash grabs. Current future of gaming ladies and gentlemen.",
      "score": 27,
      "created_utc": 1731938739.0,
      "replies": [
        {
          "id": "ly7062x",
          "author": "RUB_MY_RHUBARB",
          "body": "And why I shamelessly pirate",
          "score": 2,
          "created_utc": 1732158941.0,
          "replies": []
        },
        {
          "id": "lxrbg7z",
          "author": "GodzillaUK",
          "body": "Current?",
          "score": 4,
          "created_utc": 1731939500.0,
          "replies": []
        },
        {
          "id": "lxrbgsf",
          "author": "_Face",
          "body": "Shut up and take my money!!!!",
          "score": 1,
          "created_utc": 1731939506.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrn1ii",
      "author": "Butgut_Maximus",
      "body": "You know what the current console era needs? \n\nGames! And good ganes! \n\nNot more resolution or a better upsampler. \n\nGraphics are fine. Graphics were fine on the PS4. \n\nYou have to use a microscope to notice any difference between the PS5 and PS5 Pro. \n\nWe're halfway through PS5's cycle and the only thing it's taught us is that the PS4 is a solid machine.",
      "score": 13,
      "created_utc": 1731943572.0,
      "replies": [
        {
          "id": "lxsksf7",
          "author": "VagueSomething",
          "body": "Last gen people rightly mocked Xbox for having no games but PS5 era Sony is almost neck and neck for the amount of games released as Xbox is now. Neither are fully utilising the current consoles and we're barely out of the phase where Xbox One and PS4 are getting the same damn games as PS5 and XSX.\n\n\nIt was too early to release the Pro model when even Sony has dropped the ball and struggled to release games. Sony already cancelled half of their upcoming Live Service games after forcing half their studios to work on them. Concord bombed harder than Redfall for fuck sake and that's one of the games they felt confident keeping when cancelling others. They planned for these Live Service games being over half of all games released so now they just have a void.",
          "score": 5,
          "created_utc": 1731953978.0,
          "replies": []
        },
        {
          "id": "lxrwlog",
          "author": "gravityVT",
          "body": "More original IPs and less remakes, remasters and sequels.",
          "score": 5,
          "created_utc": 1731946635.0,
          "replies": [
            {
              "id": "lxt0sl5",
              "author": "ZaDu25",
              "body": "Yeah but whenever they do that, people whine about how old IPs have been \"abandoned\". And so many people want more of the same it becomes a pain in the ass just trying to sell a new IP without a ridiculous marketing budget to hype it up. Consumers just tend to lean toward familiarity.",
              "score": 2,
              "created_utc": 1731958787.0,
              "replies": []
            },
            {
              "id": "lxsy0yk",
              "author": "Butgut_Maximus",
              "body": "Exactly!\n\nWhy should I pay to play the game again when I can play the game again without paying ?\n\nBoggling!",
              "score": 1,
              "created_utc": 1731957950.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lxrwwh0",
          "author": "Xendrus",
          "body": "Wasn't the point that you could get 60 fps at the same quality the regular got 30 at? Doesn't look any different frame to frame but the difference between 30 and 60 FPS\n is like going from shitting in your pants to having a magic bag of holding for a digestive system in terms of quality of experience.",
          "score": 1,
          "created_utc": 1731946731.0,
          "replies": []
        },
        {
          "id": "lxvmzam",
          "author": "HarpooonGun",
          "body": "Yeah honestly I agree we need more games. Aside from Astro Bot and TLOU 1 remake, there is nothing I played on PS5 that is not available on PS4. I honestly spend more time on my PS Vita playing exclusives, PSP, PS1, and homebrew games over my PS5 at this point.",
          "score": 0,
          "created_utc": 1731990813.0,
          "replies": [
            {
              "id": "lxw5jy9",
              "author": "Butgut_Maximus",
              "body": "TLOU 1 is available on both  PS3 and PS4 :D",
              "score": 2,
              "created_utc": 1732000445.0,
              "replies": [
                {
                  "id": "lxwj2gp",
                  "author": "HarpooonGun",
                  "body": "i meant the ps5 exclusive remake but true, which makes ps5 even more bad :)",
                  "score": 1,
                  "created_utc": 1732009364.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxsmlk8",
      "author": "NickCharlesYT",
      "body": "That doesn't surprise me, if you know what you're looking for these upscaling tech's *always* look worse even on PC in my eyes. I've tried DLSS 3.0 for the first time recently and it was jarring how bad it looked compared to the native resolution, and the ghosting was horrific in some games. Luckily my GPU can run games at native most of the time, can't imagine trying to make DLSS work properly with a lesser card. Like, it does anti-aliasing better but that's about it, actual details get lost so frequently...",
      "score": 4,
      "created_utc": 1731954519.0,
      "replies": [
        {
          "id": "lxtkgrl",
          "author": "Jiopaba",
          "body": "Yeah, DLSS and similar techs aren't expected to look equally as good as or better than the native resolution.  They're just supposed to look worse by as little as possible while still giving performance benefits.\n\nIn that regard, a game that's DLSS upscaled from 1080p to 4K doesn't look as good as would at native 4K, but depending on your specific tolerances for the kinds of artifacts it makes it can look a *lot* better than native 1080p while still retaining much of the performance benefit.\n\nIt's just weird because so much of the other technology that was developed around it was more about making things look *better*, whereas this was just about making them look less worse.",
          "score": 1,
          "created_utc": 1731964762.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrlsf9",
      "author": "Sicparvismagneto",
      "body": "Tried to play jedi survivor yesterday and its baaaad. Fps is absolutely awful. I started playing days gone instead and it runs like a dream. I cant believe i slept on this game, and it just makes it all the more disappointing there wont be a sequel…",
      "score": 5,
      "created_utc": 1731943157.0,
      "replies": []
    },
    {
      "id": "lxrrbmn",
      "author": "snowdn",
      "body": "My $500 PS5 works great and looks great.",
      "score": 6,
      "created_utc": 1731944960.0,
      "replies": []
    },
    {
      "id": "lxsf42l",
      "author": "SenpaiSwanky",
      "body": "People ask me what I want for my birthday this year, I told them funds to put towards a stupidly powerful PC. Sold my XBX and I’m REAL picky with what I get for my PS5 now. \n\nExclusives that I like, sure. Anything else that is also on PC? Fuck that. I’m more or less done with consoles, they are getting more expensive and not really much better. The whole reason I was fine with their quality for so long was due to the much cheaper cost relative to even low end PCs. \n\nThat gap is being bridged more and more by the year. I’m just gonna get a PC and either a laptop or Steam Deck and call it a day. Obviously this isn’t financially feasible for everyone but I can’t deal anymore lol.",
      "score": 3,
      "created_utc": 1731952263.0,
      "replies": []
    },
    {
      "id": "lxstxhn",
      "author": "MalmerDK",
      "body": "Oh no. Anyway",
      "score": 4,
      "created_utc": 1731956721.0,
      "replies": []
    },
    {
      "id": "lxrqmtl",
      "author": "JonAnikis-shit",
      "body": "The amount of FOMO that consumes the gaming community has always been hilarious to me. Like, the there is absolutely nothing wrong with the current system but you’re going to waste the money on a something that still has bugs and overall does nothing better? Okay…",
      "score": 5,
      "created_utc": 1731944740.0,
      "replies": [
        {
          "id": "lxs4as2",
          "author": "Otherwise-Remove4681",
          "body": "Tbf Sony kind of advertised it’s good already on launch. Except it wasn’t…",
          "score": 1,
          "created_utc": 1731949000.0,
          "replies": []
        },
        {
          "id": "lxrrqwx",
          "author": "Infamous_Process5558",
          "body": "It's just like the gpu trend. Has a 4099, but needs a 5090. This is why we can't have nice things.",
          "score": 1,
          "created_utc": 1731945095.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrlgze",
      "author": "SchittyDroid",
      "body": "I was holding out on a PS5 Pro since I loved my PS4 Pro... but the lack of a disc drive, plus all these others issues and everything porting to PC anyways, I can't justify it.",
      "score": 4,
      "created_utc": 1731943049.0,
      "replies": []
    },
    {
      "id": "lxrun76",
      "author": "Sam_L_Bronkowitz",
      "body": "\"Sometimes, things that are expensive...are worse.\"",
      "score": 4,
      "created_utc": 1731946017.0,
      "replies": []
    },
    {
      "id": "lxs0s4u",
      "author": "pirate135246",
      "body": "Upscaling is killing gaming",
      "score": 2,
      "created_utc": 1731947935.0,
      "replies": []
    },
    {
      "id": "lxrep2o",
      "author": "DoubleShot027",
      "body": "Well Fsr is hot garbage and always blurry with artifacts.",
      "score": 2,
      "created_utc": 1731940695.0,
      "replies": [
        {
          "id": "lxsiwt8",
          "author": "Dependent-Zebra-4357",
          "body": "It can be, sure, but now we see PSSR can unfortunately be worse.",
          "score": 2,
          "created_utc": 1731953409.0,
          "replies": [
            {
              "id": "lxspclg",
              "author": "DoubleShot027",
              "body": "I have yet to play a game without Fsr looking bad :/",
              "score": 1,
              "created_utc": 1731955350.0,
              "replies": [
                {
                  "id": "lxthlco",
                  "author": "Dependent-Zebra-4357",
                  "body": "And yet PSSR can still be worse. Shows how bad a state it is in atm for certain games. See recent DF’s video about Jedi Survivor for example.",
                  "score": 2,
                  "created_utc": 1731963897.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lxsdnez",
          "author": "Chris3013",
          "body": "Yeah but people conveniently forgot PSSR was just FSR with a Sony coat of paint",
          "score": 5,
          "created_utc": 1731951827.0,
          "replies": [
            {
              "id": "lxxc47z",
              "author": "pholan",
              "body": "Not really. Sony has told us that PSSR is using an AI-based upscaler that is similar to DLSS, albeit trained by Sony rather than NVIDIA. FSR is an algorithmic upscaler with manually tweaked and designed heuristics to minimize artifacting. In the games where it works well, PSSR is generating a somewhat less stable rendition of fine details than FSR but massively reduces the artifacts around moving objects and seems to do substantially better with translucent objects.",
              "score": 1,
              "created_utc": 1732024124.0,
              "replies": []
            },
            {
              "id": "lxsp8hr",
              "author": "DoubleShot027",
              "body": "I thought they already announced it was a amd gpu lol",
              "score": 1,
              "created_utc": 1731955315.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxr9dox",
      "author": "MrRoboto12345",
      "body": "Sony: \"But... look! Look at the racing stripe! You don't own your games! \\**jingles keys\\** Oooo!\"",
      "score": 4,
      "created_utc": 1731938713.0,
      "replies": []
    },
    {
      "id": "lxry3qr",
      "author": "Pliskin47x",
      "body": "This is why i disconnected my ps5 to the internet for Silent Hill 2 Remake, still kept the old 1.003 update for the better visuals in the late half of the game in sacrifice for performance. It aint smooth but im used to 25-30 fps games that it doesn’t bother me. Seeing the PS5 Pro footage is a major downgrade on Sony’s part, they need to be called out more for their shitty practices.",
      "score": 2,
      "created_utc": 1731947107.0,
      "replies": [
        {
          "id": "lxsbxr7",
          "author": "ConcreteSnake",
          "body": "Wouldn’t Bloober team need to be called out and not Sony? There are plenty of games that take advantage of the Pros additional features/horsepower and look better than the standard PS5",
          "score": 1,
          "created_utc": 1731951316.0,
          "replies": [
            {
              "id": "lxt30sz",
              "author": "Pliskin47x",
              "body": "No disc drive on a $600+ console is a crime against humanity",
              "score": 2,
              "created_utc": 1731959463.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxs2s97",
      "author": "PastaVeggies",
      "body": "It’s part of that Pro Enhanced that they’ve been barking about the last few weeks. It’s a feature!",
      "score": 2,
      "created_utc": 1731948541.0,
      "replies": []
    },
    {
      "id": "lxtn80d",
      "author": "fanatic26",
      "body": "If you were dumb enough to fall for the PS5 Pro you are getting exactly what you paid for.\n\nIt sure seems like a console designed to separate dumb people from their money and not much else.",
      "score": 2,
      "created_utc": 1731965597.0,
      "replies": []
    },
    {
      "id": "lxrgvxg",
      "author": "DrivingForFun",
      "body": "Didn't they have a big show about how the main upgrade was the improved graphics?",
      "score": 1,
      "created_utc": 1731941476.0,
      "replies": [
        {
          "id": "lxv4r8k",
          "author": "BlastMyLoad",
          "body": "The big thing was “you don’t have to choose between 60fps performance or 30fps fidelity modes” yet… it seems of the small amount of games patched for the Pro still have the same options…",
          "score": 1,
          "created_utc": 1731983744.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxs7ps8",
      "author": "sovereign666",
      "body": "I love everyones conspiracy theories about why this is happening, that its on the devs or something.\n\nSony did not pay up the money to have nvidia gpu's with actual DLSS and are instead using FSR for upscaling, which always looks like shit.",
      "score": 1,
      "created_utc": 1731950045.0,
      "replies": []
    },
    {
      "id": "lxslwex",
      "author": "LibrarianNo6865",
      "body": "At this point? Deserved. Basically everyone was calling this a scam useless console. And you still purchased it? Leopards ate my face.",
      "score": 2,
      "created_utc": 1731954311.0,
      "replies": []
    },
    {
      "id": "lxri67f",
      "author": "triffy",
      "body": "I would say play it on PC, but isn’t that game broken there too? 😵‍💫",
      "score": 1,
      "created_utc": 1731941922.0,
      "replies": []
    },
    {
      "id": "lxsankz",
      "author": "Foshizzle-63",
      "body": "I love that reddit just sent me to an article that immediately sent me back to reddit.",
      "score": 1,
      "created_utc": 1731950931.0,
      "replies": []
    },
    {
      "id": "lxsbhby",
      "author": "JollyJoeGingerbeard",
      "body": "Well, yeah, upscaling isn't going to do shit if the software it's running isn't compatible.\n\nThe terrible downside of \"Pro\" editions of consoles is games still need to be optimized for them. And those which aren't, yet, must be patched to get there.",
      "score": 1,
      "created_utc": 1731951179.0,
      "replies": []
    },
    {
      "id": "lxseh99",
      "author": "TenorHorn",
      "body": "People seem to not understand that it wasn’t just the resolution of all devices that was bad. The entire art of these games were built around a less capable system, simply ripping that into a higher system doesn’t suddenly make the environment, more detailed, or there be more polygons in a shape.Or match the level of detail of the game design to the detail of the graphics.",
      "score": 1,
      "created_utc": 1731952074.0,
      "replies": []
    },
    {
      "id": "lxsh2o7",
      "author": "MaxRD",
      "body": "PSSR is not magic. It’s not a checkbox devs can tick and make things look better.\nYou actually need devs to know what they are doing. There’s a reason why first party enhanced games look great, while these are crap",
      "score": 1,
      "created_utc": 1731952849.0,
      "replies": []
    },
    {
      "id": "lxssltb",
      "author": "Dalearnhardtseatbelt",
      "body": "Jensen: puts on leather jacket and nods to DLSS.",
      "score": 1,
      "created_utc": 1731956320.0,
      "replies": []
    },
    {
      "id": "lxsz0b8",
      "author": "None",
      "body": "Lmao rEAspawn gonna rEAspawn. That team has fallen into complete dismay. rEAspawn traded everything that made them a quality company for more money and it shows in their products.",
      "score": 1,
      "created_utc": 1731958246.0,
      "replies": [
        {
          "id": "lxt1ewk",
          "author": "ZaDu25",
          "body": "It's moreso that they've become the go-to at EA so they're bogged down with a ton of projects. They got Apex, the Jedi games, and their studio head is leading the new Battlefield. Respawn is the last good studio standing under EA so they're getting dogpiled with projects.",
          "score": 1,
          "created_utc": 1731958976.0,
          "replies": [
            {
              "id": "lxt5lai",
              "author": "None",
              "body": "They’ve been cratering Apex and did a horrible job with Survivor prior to leading the new battlefield. Their incompetence is their own, and that’s what they signed up for when they sold to EA. Most of the og Apex people have been long gone.",
              "score": 1,
              "created_utc": 1731960243.0,
              "replies": [
                {
                  "id": "lxtanef",
                  "author": "ZaDu25",
                  "body": "Is it because they're actually incompetent or is it because they have far too much on their plate? They're literally trying to manage 3 different projects simultaneously and IIRC they have yet another Star Wars project in development. \n\nJedi Survivor isn't even a bad game. It's just optimized poorly. Apex was always doomed to fall apart because it's a live service hero shooter. I haven't seen any evidence that suggests they aren't actually capable of making good games, they just seem to be carrying EAs entire brand by themselves.",
                  "score": 1,
                  "created_utc": 1731961802.0,
                  "replies": [
                    {
                      "id": "lxtccsl",
                      "author": "None",
                      "body": "Part of it is actual incompetence. The other part comes from being lazy and wanting profit over performance. \n\nJedi survivor was not as good as the first one. And on top of that had loads and loads of issues. \n\nApex’s competitors are thriving when compared to Apex. And a lot of that has to do with how they’ve been focusing more and more on selling skins, rather than a working game or more actual content. \n\nYes they’re 100% carrying EA’s brand of releasing and managing bad games that are only about extracting money from its users. \n\nNo, EA’s sports games are the ones actually carrying the company.",
                      "score": 1,
                      "created_utc": 1731962322.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lxtfj5z",
      "author": "brokenmessiah",
      "body": "Upscaling is primary effective in very minute ways. \n\nThe PS5 Pro is not going to and shouldnt be intended to cover up unoptimized design.",
      "score": 1,
      "created_utc": 1731963276.0,
      "replies": []
    },
    {
      "id": "lxtq3gc",
      "author": "rolfraikou",
      "body": "Welp. I'm buying a new PC. (I already was, but my decision feels more justified.)",
      "score": 1,
      "created_utc": 1731966470.0,
      "replies": []
    },
    {
      "id": "lxtzx8i",
      "author": "Callmebobbyorbooby",
      "body": "The silent hill 2 one is really frustrating. They won’t even acknowledge it’s broken or give an update on a patch. Really wanna do another play through of it but not if it’s broken.",
      "score": 1,
      "created_utc": 1731969573.0,
      "replies": []
    },
    {
      "id": "lxucnkf",
      "author": "JesusWTFop",
      "body": "LMAO 🤣 🤣",
      "score": 1,
      "created_utc": 1731973919.0,
      "replies": []
    },
    {
      "id": "lxuie3w",
      "author": "HurleysBadLuck",
      "body": "Lmfaooooooo",
      "score": 1,
      "created_utc": 1731975913.0,
      "replies": []
    },
    {
      "id": "lxvvc1u",
      "author": "KyuubiWindscar",
      "body": "Heavy on the confirmation bias here (as a PS5 Pro hater. No stand is offensive, idfc) I see lol",
      "score": 1,
      "created_utc": 1731994718.0,
      "replies": []
    },
    {
      "id": "lxvwwcj",
      "author": "CareApart504",
      "body": "HAHAHAHAHA",
      "score": 1,
      "created_utc": 1731995521.0,
      "replies": []
    },
    {
      "id": "lxwtpag",
      "author": "allofdarknessin1",
      "body": "Just so people have an understanding, most games will look better and/or perform better but some PS5 Pro patches have poor choices made for image quality. Nothing a future patch can’t fix imo. I’m still debating if it’s worth buying one, no disc drive or vertical stand feel insulting.  maybe when it goes on sale and the disc drive is in stock.",
      "score": 1,
      "created_utc": 1732015980.0,
      "replies": []
    },
    {
      "id": "lxwx6sv",
      "author": "Akito_900",
      "body": "![gif](giphy|2QmplCHPNGTVS)",
      "score": 1,
      "created_utc": 1732017799.0,
      "replies": []
    },
    {
      "id": "lxx5sl8",
      "author": "LayneCobain95",
      "body": "I’m just worried a Trump term is really gonna increase price of gaming stuff by 40% like I saw",
      "score": 1,
      "created_utc": 1732021672.0,
      "replies": []
    },
    {
      "id": "lxx6npn",
      "author": "niagara-nature",
      "body": "I don’t understand the appeal of upscaling. I tried it in Starfield and there was negligible improvement in frame rate and noticeable decrease in quality, particularly soft shadows, gradients, etc.  Is it the sort of thing better on certain GPUs? I have a 3090.\n\n(And sorry if I appear lost, I know this is in relation to a console, not pc… I was just wondering about the whole process)",
      "score": 1,
      "created_utc": 1732022022.0,
      "replies": []
    },
    {
      "id": "lxzvo8j",
      "author": "w1nt3rh3art3d",
      "body": "PS5 Pro is just a Concord Tax, Sony somehow needs to cover the losses in the end.",
      "score": 1,
      "created_utc": 1732052302.0,
      "replies": [
        {
          "id": "lyyq8zs",
          "author": "gman5852",
          "body": "The ps5 pro was announced almost at the same time as Concord, and consoles are always sold at a loss, not profit.\n\nThere's zero reason to make an assumption that they're related.",
          "score": 1,
          "created_utc": 1732567280.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ly1iu9n",
      "author": "EatsOverTheSink",
      "body": "Gonna be some growing pains. Hope the early adopters get the beta testing out of the way sooner rather than later.",
      "score": 1,
      "created_utc": 1732072465.0,
      "replies": []
    },
    {
      "id": "ly4np4q",
      "author": "Griffdude13",
      "body": "Just sounds like bad optimization.",
      "score": 1,
      "created_utc": 1732123669.0,
      "replies": []
    },
    {
      "id": "lyiqvvn",
      "author": "MaterialLeader3441",
      "body": "I predicted this would happen due to the Ai upscale feature before the Pro's launch, can't say I'm shocked, idk why people always put there faith in AI",
      "score": 1,
      "created_utc": 1732330029.0,
      "replies": []
    },
    {
      "id": "lykanin",
      "author": "lloydsmith28",
      "body": "Sucks to be them, I'll stick with my better and more reliable one that i already own lol",
      "score": 1,
      "created_utc": 1732360871.0,
      "replies": []
    },
    {
      "id": "lzax26n",
      "author": "None",
      "body": "For the amount of money Sony is charging this is seriously not okay. ",
      "score": 1,
      "created_utc": 1732741018.0,
      "replies": []
    },
    {
      "id": "lxs3e5m",
      "author": "gman5852",
      "body": "Welcome to raytracing. Comedically inefficient lighting engine that's less effective than handmade.",
      "score": 2,
      "created_utc": 1731948725.0,
      "replies": [
        {
          "id": "lxsccgu",
          "author": "Wander715",
          "body": "RT is not worth it currently on anything besides high end Nvidia cards. It does look pretty amazing in some games though. Currently playing Cyberpunk with pathtracing on and I'm blown away by the photorealistic lighting at times.",
          "score": 2,
          "created_utc": 1731951439.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrglzh",
      "author": "Triforceoffarts",
      "body": "I have one and it’s been great with HZD and Silent Hill 2.",
      "score": 2,
      "created_utc": 1731941379.0,
      "replies": []
    },
    {
      "id": "lxruyka",
      "author": "the_raven12",
      "body": "sounds like the ps5pro is a bit of a hefty price tag for early entry ps6 beta testing. im sure it is still awesome for the most part.",
      "score": 1,
      "created_utc": 1731946117.0,
      "replies": []
    },
    {
      "id": "lxro1l1",
      "author": "32768Colours",
      "body": "Damn, what a *PSSR*",
      "score": 1,
      "created_utc": 1731943900.0,
      "replies": []
    },
    {
      "id": "lxs0jpf",
      "author": "pukem0n",
      "body": "I especially love the people in Twitter that show an image of a game running on base PS5 and on the Pro. And they look the exact fucking same.",
      "score": 1,
      "created_utc": 1731947863.0,
      "replies": [
        {
          "id": "lxs5124",
          "author": "Otherwise-Remove4681",
          "body": "Except Pro runs/looks worse.",
          "score": 1,
          "created_utc": 1731949222.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxtt8hg",
      "author": "Vazhox",
      "body": "![gif](giphy|cO39srN2EUIRaVqaVq)",
      "score": 1,
      "created_utc": 1731967431.0,
      "replies": []
    },
    {
      "id": "lxuzcbv",
      "author": "Lardzor",
      "body": "Sony's up-scaling algorithm is brand-new, so it could be improved in a future firmware update.",
      "score": 1,
      "created_utc": 1731981801.0,
      "replies": [
        {
          "id": "lyyqh6i",
          "author": "gman5852",
          "body": "Not paying $700 for \"could be improved\"",
          "score": 1,
          "created_utc": 1732567349.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxreoih",
      "author": "FugaziFlexer",
      "body": "It’s always amazing how people have ate the crock of shit of companies releasing shit that doesn’t work as intended while being sold at a crazy price. Sure stuff has bugs but turning around and trying to gaslight people saying they’re overreacting is crazy especially with the context of the console it’s self",
      "score": 1,
      "created_utc": 1731940690.0,
      "replies": [
        {
          "id": "lxs4mkd",
          "author": "Otherwise-Remove4681",
          "body": "Denial is helluva drug. Specially when there was the whole price ”controversy” at initial annoucement. It’s hard to admit you got peddled shit.",
          "score": 1,
          "created_utc": 1731949099.0,
          "replies": []
        },
        {
          "id": "lxsamdr",
          "author": "ConcreteSnake",
          "body": "The thing is, I have one and it’s been great. I don’t own this trash Jedi game that has basically been plagued with issues since launch on all platforms, so I can’t speak to that. However, I have played Horizon Zero Dawn remaster, FF7 Rebirth, Stellar Blade, Spider-Man 2, Ratchet & Clank Rift Apart, and God of War Ragnarok and they all look and play significantly better on the Pro. I play on a 65” OLED sitting roughly 8 feet away so I know not everyone will see it the same as I do, but the bump is horsepower already feels worth it to me.",
          "score": 1,
          "created_utc": 1731950920.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lxrwd7f",
      "author": "DriftMantis",
      "body": "Welcome to pc gaming in a nutshell. Sorry, I mean modern console gaming. They are easy to mix up.",
      "score": -1,
      "created_utc": 1731946561.0,
      "replies": [
        {
          "id": "lxsb8nn",
          "author": "ConcreteSnake",
          "body": "Right? I mean, who overpays for something that doesn’t make that big of a difference in the games you play? Definitely not PC gamers 🤣",
          "score": 0,
          "created_utc": 1731951106.0,
          "replies": [
            {
              "id": "lxt7nyy",
              "author": "DriftMantis",
              "body": "Hey now, you need that water cooled cpu to hit 350fps instead of 335fps in call of duty, don't you! It looks great on my 4k 60fps monitor. \n\nAlso, you need 64 gb of dual channel ram or your basically an amateur. /s\n\nAlso, throw out your ps5 it's outdated garbage, ps5 pro can run games at a higher fidelity at the same inconsistent 60fps you know and love!\n\nTo be serious, I think the ps5 pro is a good refresh for people who don't already have a current Gen system, but not great value as an upgrade if you already own a ps5.",
              "score": 3,
              "created_utc": 1731960885.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxrumfo",
      "author": "Va1crist",
      "body": "Using the wrong settings?  Stellarblade , FF7 and Spider-Man look freaking amazing and the extra frame rate boost while maintaining higher fidelity is so nice , something doesn’t add up here digital foundry showed amazing improvements to star wars lol",
      "score": -1,
      "created_utc": 1731946011.0,
      "replies": []
    },
    {
      "id": "lxs8u8m",
      "author": "LlorchDurden",
      "body": "PS5 Pro owners, welcome to PC 🔥",
      "score": 0,
      "created_utc": 1731950385.0,
      "replies": []
    },
    {
      "id": "lxsnbad",
      "author": "None",
      "body": "Sony: Ruh-roh\n\n![gif](giphy|26DN5mTjpKEsumZqg|downsized)",
      "score": 0,
      "created_utc": 1731954734.0,
      "replies": []
    },
    {
      "id": "lxw7ytv",
      "author": "BennieOkill360",
      "body": "Lol... Glad I went full on PC a couple years ago",
      "score": 0,
      "created_utc": 1732001953.0,
      "replies": []
    },
    {
      "id": "lxrceus",
      "author": "deathbunnyy",
      "body": "Oh no, hardware less than a week old has software compatibility problems!? Unheard of.\n\nBetter move to PC guys, you will be much better off. Dumbasses.",
      "score": -9,
      "created_utc": 1731939859.0,
      "replies": [
        {
          "id": "lxrdjbw",
          "author": "zeonon",
          "body": "At least in PC you would have the option to specifically disable the problem causing effect.",
          "score": 6,
          "created_utc": 1731940272.0,
          "replies": [
            {
              "id": "lxs4sxg",
              "author": "Otherwise-Remove4681",
              "body": "Many times some modders even fixes the issues.",
              "score": 1,
              "created_utc": 1731949154.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lxrp87u",
      "author": "Bobisnotmybrother",
      "body": "They tried this with cyberpunk 2050 or whatever.",
      "score": -1,
      "created_utc": 1731944287.0,
      "replies": []
    },
    {
      "id": "lxrvvlo",
      "author": "the_honest_asshole",
      "body": "Camping as a kid a bear got into our cooler, drank all the beer, bit into one of the dr peppers and left it behind full.",
      "score": -1,
      "created_utc": 1731946408.0,
      "replies": []
    },
    {
      "id": "lxrlrxt",
      "author": "Simple_Character6737",
      "body": "Xbox never gives me issues on games upscale for series s/x",
      "score": -2,
      "created_utc": 1731943152.0,
      "replies": []
    },
    {
      "id": "lxrqocq",
      "author": "Wpgjetsfan19",
      "body": "But keep telling me how a PS5 is better than my series X 🤣",
      "score": -3,
      "created_utc": 1731944753.0,
      "replies": []
    },
    {
      "id": "lxr8yz6",
      "author": "ChanceTheGardenerrr",
      "body": "😭",
      "score": -5,
      "created_utc": 1731938558.0,
      "replies": []
    },
    {
      "id": "lxr9rje",
      "author": "Civil_Practice_7172",
      "body": "Yeah Lots of Complains",
      "score": -6,
      "created_utc": 1731938862.0,
      "replies": []
    }
  ]
}