{
  "post": {
    "title": "Switch 2 will be backwards compatible with Switch, Nintendo confirms ",
    "author": "a_Ninja_b0y",
    "id": "1gkt43k",
    "score": 5524,
    "created_utc": 1730878636.0,
    "selftext": "",
    "num_comments": 381,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gkt43k/switch_2_will_be_backwards_compatible_with_switch/"
  },
  "comments": [
    {
      "id": "lvoibgk",
      "author": "prime5119",
      "body": "Mario Kart 8 series gonna live for another 5 years since you can continue to experience the game using backward compatible with Switch",
      "score": 728,
      "created_utc": 1730885241.0,
      "replies": [
        {
          "id": "lvoqy8l",
          "author": "Fartfart357",
          "body": "Nintendo to MK8:\n\n![gif](giphy|ko8HPo4iQxcZi|downsized)",
          "score": 346,
          "created_utc": 1730890463.0,
          "replies": [
            {
              "id": "lvpr87t",
              "author": "Fafnir13",
              "body": "To be fair, it’s a near perfect Mariokart experience.  Graphics could be updated slightly, polish added to some of the DLC courses, and there’s still a significant roster of courses that could be added. Anything new would be expected to have fewer courses at the outset though.",
              "score": 84,
              "created_utc": 1730903197.0,
              "replies": [
                {
                  "id": "lvpv89c",
                  "author": "Fartfart357",
                  "body": "Oh, definitely.  Hell, the graphics are so good I can see them not really needing to be better.  But it's still a WII U game, and that's really funny.",
                  "score": 55,
                  "created_utc": 1730904352.0,
                  "replies": [
                    {
                      "id": "lvpwjj3",
                      "author": "Fafnir13",
                      "body": "I bought a Wii U primarily because of the Mariokart trailer.  That Rainbow Road music kicked me hard in my gamer nostalgia.  Helps the game remains a ton of fun.  I still play it weekly with my siblings.",
                      "score": 15,
                      "created_utc": 1730904725.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvr7861",
                  "author": "alexanderpas",
                  "body": "> Anything new would be expected to have fewer courses at the outset though.\n\nUnless they give it the Smash Treatment.\n\nAll the courses. All the riders. Everyone is here for the Ultimate Mario Kart Experience!",
                  "score": 7,
                  "created_utc": 1730917282.0,
                  "replies": [
                    {
                      "id": "lvvr39t",
                      "author": "Smyles9",
                      "body": "What other karts/characters/tracks are left? I feel like if they were going to do that it should’ve just been with the other waves to bring absolutely everything over. Wii karts like bullet bill/star shooter/baby kart, can’t think of any remaining characters, and tracks maybe a few from Wii/tour?",
                      "score": 1,
                      "created_utc": 1730979856.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvqb2g5",
                  "author": "kandoras",
                  "body": "I just wish it had a single player career mode where new races and speeds would get unlocked as you win the older ones.",
                  "score": 5,
                  "created_utc": 1730908668.0,
                  "replies": [
                    {
                      "id": "lvr860z",
                      "author": "alexanderpas",
                      "body": "> I just wish it had a single player career mode where new races and speeds would get unlocked as you win the older ones.\n\nThe Deluxe version for the Switch was the only version that did not have this, the original version for the Wii U still had this feature.",
                      "score": 5,
                      "created_utc": 1730917539.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvvquhd",
                  "author": "Smyles9",
                  "body": "I thought pretty much all of the courses got ported? I thought there were maybe 4-8 remaining that would be worth it (unique enough and not too similar to already ported tracks), was there significantly more tracks available in tour? I feel like the time to do that though is either at the end of wave 6 which the time has passed to do that, or when they reveal the next Mario kart to get people hyped and still have something for switch 1 owners too. The mk team might be too focused on the new game to do something like that though unfortunately.",
                  "score": 2,
                  "created_utc": 1730979732.0,
                  "replies": [
                    {
                      "id": "lvw1t2d",
                      "author": "Fafnir13",
                      "body": "There are loads of them.  SNES Kart still has a couple unrepresented styles of courses.  Kart64 has a slew of fairly unique ones that would be fun to see given a modern update.  Koopa Beach, the jungle one, and Bowser’s Castle are the ones that spring most readily to mind.  DoubleDash has a bunch too like Mushroom City, Mushroom Bridge, and Wario Stadium which would bring some unique elements still.  Peach Beach is another standout with the fun of a rising tide and the flipping guys wandering around.  I played 7 only a little bit because I disliked the motion controls and graphics (felt kind of dull), so any courses from that one would feel new to me.  Same goes for the DS game.  I’m just not into handheld gaming so never played them.\n\nI feel like the team has a pretty good track record (heh) of finding ways to deliver new twists to even the oldest styles of tracks.  I don’t mind having even simple figure 8’s redone as there’s always a little something that’s slightly different from the others.  It’s nice to have the largest possible playground of options.",
                      "score": 1,
                      "created_utc": 1730984592.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvsu2t0",
                  "author": "kinslowdian",
                  "body": "Noooo it’s the most unbalanced one ever",
                  "score": 1,
                  "created_utc": 1730933573.0,
                  "replies": [
                    {
                      "id": "lvtsu99",
                      "author": "Sadistic_Carpet_Tack",
                      "body": "Yeah maybe for the few nerds that are doing competitive mario kart. but 99% of players are just families who just pick what character and kart looks cool and don’t cry when they get blueshelled.",
                      "score": 1,
                      "created_utc": 1730944820.0,
                      "replies": []
                    },
                    {
                      "id": "lvt2iwd",
                      "author": "Fafnir13",
                      "body": "If the aim is to be super competitive, probably.  I couldn’t really comment on that.  I’m just playing for fun with my siblings and nieces on a weekly basis.  No one in the group is an ultimate min max snaker with mastery of every hidden shortcut so it never really fees unbalanced.",
                      "score": 0,
                      "created_utc": 1730936257.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvx6zo4",
                  "author": "zzang23",
                  "body": "To be honest its the only MK i hate. There are way too much configurations going on. My favourite was the MK on Wii. Just pick a driver and a bike and go.",
                  "score": 1,
                  "created_utc": 1730997811.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvqnds2",
              "author": "peterosity",
              "body": "mortal kombat 8 is immortal",
              "score": 6,
              "created_utc": 1730911937.0,
              "replies": [
                {
                  "id": "lvqsu0v",
                  "author": "some_user_2021",
                  "body": "No, it's mortal, as in, Mortal Kombat",
                  "score": 4,
                  "created_utc": 1730913382.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvuhxe8",
              "author": "xur_ntte",
              "body": "Man an more un cultured person such as myself would say mk8: whats mortal Kombat has to do with this",
              "score": 1,
              "created_utc": 1730954039.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvpau0y",
          "author": "Leeiteee",
          "body": "Mario Kart 8.1, just like Windows",
          "score": 13,
          "created_utc": 1730898219.0,
          "replies": [
            {
              "id": "lvpwzc4",
              "author": "Specialist-Rope-9760",
              "body": "Mario Kart 10",
              "score": 4,
              "created_utc": 1730904849.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvomioz",
          "author": "Pentax25",
          "body": "Mario Kart 9 had better release with Switch 2 with all the 8 tracks included if you had that game too",
          "score": 38,
          "created_utc": 1730887796.0,
          "replies": [
            {
              "id": "lvp005v",
              "author": "Un111KnoWn",
              "body": "mario kart wii style would be cool imo",
              "score": 9,
              "created_utc": 1730894532.0,
              "replies": [
                {
                  "id": "lvrfhd8",
                  "author": "zipykido",
                  "body": "I wish they'd add a doubledash mode too.",
                  "score": 10,
                  "created_utc": 1730919511.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvpbyu4",
              "author": "Immolation_E",
              "body": "Mario Kart 8-2",
              "score": 7,
              "created_utc": 1730898584.0,
              "replies": [
                {
                  "id": "lvpyqbi",
                  "author": "None",
                  "body": "Man 8-2 was a tough level in OG Super Mario iirc",
                  "score": 5,
                  "created_utc": 1730905336.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvpincf",
              "author": "TheLostLuminary",
              "body": "I’ll take an ultimate style game with at least every known racer so far and new ones. Expecting every track ever made would be unrealistic but give me as many as possible.",
              "score": 3,
              "created_utc": 1730900639.0,
              "replies": []
            },
            {
              "id": "lvqwolg",
              "author": "Elastichedgehog",
              "body": "Mario Kart Ultimate",
              "score": 2,
              "created_utc": 1730914417.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvqw9b6",
          "author": "modestmii",
          "body": "Mario Kart 9 is the Half Life 3 of Nintendo",
          "score": 8,
          "created_utc": 1730914302.0,
          "replies": [
            {
              "id": "lvr9xbi",
              "author": "ItsColorNotColour",
              "body": "I'd be down for a VR entry for the Mario Kart series like how HL got",
              "score": 1,
              "created_utc": 1730918014.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvq7sa8",
          "author": "ThaNorth",
          "body": "I fully expect a Mario Kart 9 next year.",
          "score": 3,
          "created_utc": 1730907801.0,
          "replies": []
        },
        {
          "id": "lvqr40a",
          "author": "jaymef",
          "body": "My kids got happy meals the other day and it came with Mario Kart 8 toys. I was like how the hell is this game still going so strong. It's 10 years old",
          "score": 3,
          "created_utc": 1730912922.0,
          "replies": []
        },
        {
          "id": "lvt1jyu",
          "author": "Fredasa",
          "body": "And it will still be only 30fps in 4-player split screen, forever leaving _Mario Kart Double Dash_ (***2003***) as the last Mario Kart to manage 60fps in said mode.  Nintendo had all the opportunity they needed to fix that when they ported the game to Switch, but they said \"we know our audience, and our audience doesn't really even notice if a game is 30 or 60fps\" and they were right.",
          "score": 3,
          "created_utc": 1730935941.0,
          "replies": []
        },
        {
          "id": "lvpqy07",
          "author": "hanzoplsswitch",
          "body": "recognise soup slap ghost different flag bag squalid middle work\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 3,
          "created_utc": 1730903114.0,
          "replies": []
        },
        {
          "id": "lvtsc7b",
          "author": "Georgeorgiorgio",
          "body": "Does it even need an update? It’s just pure perfection *chefs kiss*",
          "score": 1,
          "created_utc": 1730944654.0,
          "replies": []
        },
        {
          "id": "lvvqbm2",
          "author": "Smyles9",
          "body": "Heavily considering getting a personal copy of Mk8d+BP if I end up getting a switch 2. The game has so much content I never ended up getting through it all when I played on Wii U or when I played on switch with family (not my copy).",
          "score": 1,
          "created_utc": 1730979463.0,
          "replies": []
        },
        {
          "id": "lvs21tn",
          "author": "titations",
          "body": "I love me some Mario Kart 8.  But I do want something new in the Mario Kart world. Maybe include a 1st person view option. New weapons, maybe boss battles like Diddy Kong racing, or more sim-like components for a more pro racer.",
          "score": 0,
          "created_utc": 1730925674.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvoh6fu",
      "author": "fullload93",
      "body": "Would be asinine to NOT make it backwards compatible. That’s was pretty much a given but glad they confirmed it.",
      "score": 144,
      "created_utc": 1730884569.0,
      "replies": [
        {
          "id": "lwavxvc",
          "author": "ManuPlays05",
          "body": "Hoping the hardware specs get better to run totk better",
          "score": 1,
          "created_utc": 1731183686.0,
          "replies": []
        },
        {
          "id": "lvu5vcu",
          "author": "None",
          "body": "[deleted]",
          "score": -8,
          "created_utc": 1730949297.0,
          "replies": [
            {
              "id": "lvubtr4",
              "author": "CorpusVile32",
              "body": "I don't know, trying to charge me $60 for a 20 year old game with slightly revamped graphics doesn't exactly feel pro-consumer.  I love a couple Nintendo IPs, but I'm not going to pretend that they don't see dollar signs.",
              "score": 8,
              "created_utc": 1730951542.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvoeciv",
      "author": "NVSuave",
      "body": "Maybe now we can play Age of Calamity without gruesome frame drops.",
      "score": 148,
      "created_utc": 1730882954.0,
      "replies": [
        {
          "id": "lvp14hx",
          "author": "basti329",
          "body": "Would love to play a pokemon with actually good animations and performance. \n\nBut its GameFreak so they will find a way to fumble it",
          "score": 62,
          "created_utc": 1730894927.0,
          "replies": [
            {
              "id": "lvpkhrw",
              "author": "_Burro",
              "body": "As someone who actually loved playing through Scarlet, it bothers me that the performance was never addressed properly. I can't say I'm too hopeful for their first game on a new system, those tend to fumble a bit in comparison to the games that come after them.",
              "score": 23,
              "created_utc": 1730901193.0,
              "replies": [
                {
                  "id": "lvqz1hp",
                  "author": "EnjoyerOfBeans",
                  "body": "Nah, Sword and Shield is literally the only instance where that was true. Ruby&Sapphire for the GBA is absolutely beloved, so is Diamond&Pearl. Their first game on the 3ds, X&Y, looked stunning for the time as well.\n\nGamefreak as a company is completely incompetent with actual 3d environments is all.",
                  "score": 16,
                  "created_utc": 1730915053.0,
                  "replies": [
                    {
                      "id": "lvrmg85",
                      "author": "_Burro",
                      "body": "Keep in mind I said **\"in comparison the to the games that come after them\"**. XY looked good but were extremely barebones and Sun and Moon looked way better. Diamond and Pearl struggled with loading so bad that the original Japanese release had the void glitches. And compared to HGSS/B2W2 they do lag behind.\n\nRuby and Sapphire didn't really lose anything to FRLG and are very similar to Emerald, so that one doesn't fit what I said.",
                      "score": 1,
                      "created_utc": 1730921421.0,
                      "replies": [
                        {
                          "id": "lvrqa12",
                          "author": "EnjoyerOfBeans",
                          "body": "I do agree they make improvement in future releases for any console, but that's somewhat expected (especially since they are working with a brand new console every time that no one in the world has experience with), but I wouldn't say any of these titles \"fumbled\" on graphics or performance. The improvements in future titles are relatively minor, to the point where the average consumer probably couldn't tell you which games came out in what order. S&M and US&UM had performance issues as well, I played both gens quite a bit and I wouldn't say X&Y was worse in this regard, the game was just relatively poor in terms of content.\n\nThe issues Japanese releases of some of these titles faced were the kind of issues that could be fixed with a patch nowadays too. Compared to Sw&Sh or S&V it's just a completely different world.",
                          "score": 0,
                          "created_utc": 1730922462.0,
                          "replies": [
                            {
                              "id": "lvrvkt6",
                              "author": "_Burro",
                              "body": "Back to the original comment, though. I believe SV and PLA could have been improved (probably not \"fixed\" per se) through updates. \n\nFor Legends, some smaller stuff like floating trees, some models going [low poly](https://youtu.be/RM-zzeWd_9U?si=ktMp6q808AZeZkjA) at extremely short distance, and being able to see into the skybox in several maps.\n\nFor SV, stuff like pokemon clipping into walls, specific areas with low framerates, and QoL changes for shinies.\n\nAlas, it didn't happen. I don't believe these changes were too much to ask, I was there when people believed the Battle Frontier was going to be added to ORAS.",
                              "score": 2,
                              "created_utc": 1730923905.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lvtlr1w",
                      "author": "NeoTechni",
                      "body": "> Sword and Shield is literally the only instance where that was true. Ruby&Sapphire for the GBA is absolutely beloved, so is Diamond&Pearl. Their first game on the 3ds, X&Y, looked stunning for the time as well.\n\nNo. R&S looked terrible compared to GoldenSun   \nthe 3DS games looked terrible compared to Resident Evil: Revelations, which ran completely in 3D too   \n\nEvery since the GBA games, the Pokemon games have looked inferior to what was on the system",
                      "score": 0,
                      "created_utc": 1730942495.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvs82rt",
              "author": "edvek",
              "body": "They could be told \"we're not making it for the switch anymore but for PC so go nuts!\" And they will still shit out the bare minimum unoptimized garbage because people will buy it day 1. Obviously if they abandon the switch, which they won't, sales will plummet.\n\nPoint being even given unlimited potential they will take the fastest and easiest route because why cut into your profits if you don't have to?",
              "score": 4,
              "created_utc": 1730927293.0,
              "replies": []
            },
            {
              "id": "lvs7f3l",
              "author": "darkbreak",
              "body": "You know, before the massive leaks recently I would have agreed 100%. But considering what we know now it seems like the real villains for Pokemon are the higher ups in The Pokemon Company that enforce strict release dates. I can't say for sure that Game Freak would have made the newer games absolutely flawless but they undoubtedly would have ended better than what we got.",
              "score": 3,
              "created_utc": 1730927115.0,
              "replies": [
                {
                  "id": "lvx4ejq",
                  "author": "MrHedgehogMan",
                  "body": "It's because of the merchandising behemoth that is Pokemon. They need new Pokemon to move more merch and this typically comes from the games.",
                  "score": 1,
                  "created_utc": 1730997071.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvpqlly",
              "author": "sunkenrocks",
              "body": "I actually like the animations in SV. There could be a lot more but at least the Pokemon themselves I think are quite charming.",
              "score": 3,
              "created_utc": 1730903014.0,
              "replies": [
                {
                  "id": "lvtp9h0",
                  "author": "LionIV",
                  "body": "Voice acting would elevate the games to such high levels, people would easily dismiss other flaws. Literally, the Persona games have been doing it for decades on a fraction of the budget and people (like me) still eat that shit up.",
                  "score": 1,
                  "created_utc": 1730943642.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvvtjq5",
              "author": "Naud1993",
              "body": "They'll use the Switch 2 as an excuse to optimize the next game even less so it'll still lag.",
              "score": 1,
              "created_utc": 1730981065.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvquojg",
          "author": "insufficient_nvram",
          "body": "Maybe I can play No Man’s Sky without clipping. I somehow got a badge for “deepest dive” when I clipped out of my freighter and fell.",
          "score": 2,
          "created_utc": 1730913879.0,
          "replies": []
        },
        {
          "id": "lvomnhk",
          "author": "codefocus",
          "body": "And we’ll be able to beat the wither",
          "score": 2,
          "created_utc": 1730887878.0,
          "replies": []
        },
        {
          "id": "lvtsfan",
          "author": "zorkzamboni",
          "body": "No, instead you'll get it at higher resolution but with the same frame drops",
          "score": 1,
          "created_utc": 1730944682.0,
          "replies": []
        },
        {
          "id": "lvv3ec6",
          "author": "TammyShehole",
          "body": "Same with Echoes of Wisdom. It’s a smooth, stable framerate for like 5% of the time when on the outside map lol.",
          "score": 1,
          "created_utc": 1730965130.0,
          "replies": []
        },
        {
          "id": "lyi7t4h",
          "author": "Haunting_Set9114",
          "body": "It's on PC just play it there",
          "score": 1,
          "created_utc": 1732322503.0,
          "replies": []
        },
        {
          "id": "lvoexxt",
          "author": "maxl3t",
          "body": "💀",
          "score": 1,
          "created_utc": 1730883290.0,
          "replies": []
        },
        {
          "id": "lvtjk1j",
          "author": "yogopig",
          "body": "I doubt the performance will be any better",
          "score": 0,
          "created_utc": 1730941776.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvo6ek3",
      "author": "TheMountainLife",
      "body": "The fact that this even news shows how Nintendo's got us by the balls.",
      "score": 662,
      "created_utc": 1730879195.0,
      "replies": [
        {
          "id": "lvpqin3",
          "author": "logicom",
          "body": "If they had us by the balls they wouldn't need to make it backwards compatible.",
          "score": 90,
          "created_utc": 1730902990.0,
          "replies": [
            {
              "id": "lvqwm93",
              "author": "AintNobody-",
              "body": "And they'd make it digital-only.",
              "score": 15,
              "created_utc": 1730914399.0,
              "replies": [
                {
                  "id": "lvt4s08",
                  "author": "ernster96",
                  "body": "Sony has entered the chat",
                  "score": 5,
                  "created_utc": 1730936982.0,
                  "replies": [
                    {
                      "id": "lvtm9mo",
                      "author": "NeoTechni",
                      "body": "and then bought the site that hosts the chat",
                      "score": 2,
                      "created_utc": 1730942662.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvtk47d",
              "author": "niveksng",
              "body": "Tbf they have us by the balls but also they like caressing it rather than squeezing it.",
              "score": 1,
              "created_utc": 1730941961.0,
              "replies": []
            },
            {
              "id": "lvwq45q",
              "author": "mr_sweetandawful",
              "body": "Dude…. They got us by the balls",
              "score": 1,
              "created_utc": 1730992833.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvpwl6h",
          "author": "Dick_Lazer",
          "body": "They probably do to a certain extent. Switch 2 still would’ve been a tough sale for me without backward compatibility though.",
          "score": 4,
          "created_utc": 1730904738.0,
          "replies": []
        },
        {
          "id": "lvpb5ir",
          "author": "LowCarbDad",
          "body": "If they had me by the balls I wouldn’t have bought a steam deck. Stop paying Nintendo.",
          "score": 39,
          "created_utc": 1730898323.0,
          "replies": [
            {
              "id": "lvppbsl",
              "author": "Wise_Mongoose_3930",
              "body": "I’ve got like 600 games in my Steam library so…. Valve already has me by the balls.",
              "score": 30,
              "created_utc": 1730902640.0,
              "replies": [
                {
                  "id": "lvpqrrv",
                  "author": "hanzoplsswitch",
                  "body": "deranged tie steer instinctive wise axiomatic repeat wistful gullible bedroom\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                  "score": 18,
                  "created_utc": 1730903064.0,
                  "replies": [
                    {
                      "id": "lvq3jt0",
                      "author": "2g4r_tofu",
                      "body": "Gaben's soft velvety hands 🤤",
                      "score": 12,
                      "created_utc": 1730906658.0,
                      "replies": [
                        {
                          "id": "lvqi5mp",
                          "author": "New-Connection-9088",
                          "body": "Too far.",
                          "score": 1,
                          "created_utc": 1730910558.0,
                          "replies": [
                            {
                              "id": "lvs3s8n",
                              "author": "Randy_Muffbuster",
                              "body": "Let the man talk about his soft, eggy, yeasty yet slightly sour, balls in peace",
                              "score": 5,
                              "created_utc": 1730926142.0,
                              "replies": [
                                {
                                  "id": "lvtmp7o",
                                  "author": "SirLocke13",
                                  "body": "That's extremely specific",
                                  "score": 1,
                                  "created_utc": 1730942805.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvpphgl",
                  "author": "LowCarbDad",
                  "body": "Haha that’s honestly a better what to put it. The hours I put into $2 games is incredible.",
                  "score": 7,
                  "created_utc": 1730902687.0,
                  "replies": []
                },
                {
                  "id": "lvt2qcy",
                  "author": "BlKKK_SKKKN_HEAD2",
                  "body": "Valve treat my balls nicely and gently massage them.",
                  "score": 3,
                  "created_utc": 1730936322.0,
                  "replies": []
                },
                {
                  "id": "lvv8lix",
                  "author": "jaaval",
                  "body": "The problem with these platform services is that monopoly is actually in many ways better for consumer. Nobody wants to have multiple game platforms running at the same time. Same goes with streaming services. More competition has meant fragmentation and higher prices. I want to just open the app and have everything there. And if music is not in Spotify it just might not exist. \n\nI don’t mind valve controlling the world, even if I have to pay 10% more for the games. I am pissed when good games are launched exclusively to epic or something.\n\nI’m sorry Tim Sweeney but I don’t understand how it’s better for me that I have to share my data with your corporation too.",
                  "score": 1,
                  "created_utc": 1730968417.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvprc4n",
              "author": "None",
              "body": "[removed]",
              "score": 15,
              "created_utc": 1730903229.0,
              "replies": [
                {
                  "id": "lvroplb",
                  "author": "AmNoSuperSand52",
                  "body": "So I take it you don’t use Switch emulators?\n\nAlthough Splatoon is multiplayer so I guess that doesn’t help much",
                  "score": -3,
                  "created_utc": 1730922037.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvtrcy1",
              "author": "None",
              "body": "I’ve got both. I buy from both.",
              "score": 3,
              "created_utc": 1730944326.0,
              "replies": []
            },
            {
              "id": "lvpppz4",
              "author": "None",
              "body": "Dumbass comment",
              "score": 9,
              "created_utc": 1730902756.0,
              "replies": [
                {
                  "id": "lvqv09w",
                  "author": "ExtremeCreamTeam",
                  "body": "Oh the sheer irony of you saying that.",
                  "score": -3,
                  "created_utc": 1730913966.0,
                  "replies": [
                    {
                      "id": "lvs7adb",
                      "author": "FlowerBoyScumFuck",
                      "body": "What's the irony? It is dumb to expect nobody to play/buy Nintendo games, Nintendo games kick ass. Criticizing Nintendo is totally fair, but they make great games and have extremely popular consoles.. I think it's weird how subs like this and r/gaming try to police what people buy with their own money.",
                      "score": 3,
                      "created_utc": 1730927079.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvpchy9",
              "author": "KillMeNowFFS",
              "body": "r/iamverybadass vibes",
              "score": -23,
              "created_utc": 1730898751.0,
              "replies": [
                {
                  "id": "lvpcrbh",
                  "author": "LowCarbDad",
                  "body": "lol I am not very bad ass I just despise Nintendo. I couldn’t even play games with my child and partner at the same time cause we could only share the game we own to one of the three switches. It’s archaic.",
                  "score": -7,
                  "created_utc": 1730898831.0,
                  "replies": [
                    {
                      "id": "lvppzhh",
                      "author": "Hallc",
                      "body": "I don't think any digital platform let's you play a single purchase of one game across three devices at once though?\n\nYou can usually get around it via doing various account things like going offline etc.\n\nSteam also won't let you play a shared game if someone else is already playing it.\n\nI'm not here to defend Nintendo, I don't really feel strongly either way just confused that this is your core complaint honestly since nowhere else would let you do that either.",
                      "score": 9,
                      "created_utc": 1730902834.0,
                      "replies": []
                    },
                    {
                      "id": "lvpgke3",
                      "author": "mandude15555",
                      "body": "\"I just despise Nintendo\"\n\"..one of the three switches.\"",
                      "score": 27,
                      "created_utc": 1730900010.0,
                      "replies": [
                        {
                          "id": "lvphj5f",
                          "author": "LowCarbDad",
                          "body": "I got one cause I didn’t think it would be as difficult as it was. My partner had a lite and got one for our daughter then I got a normal switch so I could hook it up yo the tv but once we tried to share anything to play Mario kart on the tv it took 3 days just to figure it out with Nintendo.",
                          "score": -7,
                          "created_utc": 1730900303.0,
                          "replies": [
                            {
                              "id": "lvqg4ua",
                              "author": "IAmPerpetuallyTired",
                              "body": "Doesn’t the game have split screen?",
                              "score": 3,
                              "created_utc": 1730910022.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lvpifs8",
                          "author": "ireallylikedolphins",
                          "body": "To be fair, if they didn't own any switches they would feel less reason to despise Nintendo. \n\nUsed to be such a great company... What a waste",
                          "score": -7,
                          "created_utc": 1730900576.0,
                          "replies": [
                            {
                              "id": "lvpsofh",
                              "author": "None",
                              "body": "damn bro did they kill your family or something",
                              "score": 7,
                              "created_utc": 1730903622.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lvpjif2",
                      "author": "None",
                      "body": "“I despise Nintendo”. Lmfao and yet you still own 3 switches",
                      "score": 5,
                      "created_utc": 1730900899.0,
                      "replies": []
                    },
                    {
                      "id": "lvppm0g",
                      "author": "None",
                      "body": "Yup sounds really tough buddy",
                      "score": 3,
                      "created_utc": 1730902724.0,
                      "replies": []
                    },
                    {
                      "id": "lvpebm8",
                      "author": "FlyAnt",
                      "body": "In what way, shape, or form is trying to game share to three different switches a Nintendo problem??",
                      "score": 13,
                      "created_utc": 1730899319.0,
                      "replies": [
                        {
                          "id": "lvpfhj7",
                          "author": "KungP0wchicken",
                          "body": "Found the Nintendo stan",
                          "score": -6,
                          "created_utc": 1730899679.0,
                          "replies": [
                            {
                              "id": "lvpkuv7",
                              "author": "FlyAnt",
                              "body": "Lmfao I guess so but on any other console you can barely game share to one extra console let alone play the same game at the same time on different devices it’s like y'all don’t even play consoles and yet speak with smug authority on a topic you’re clueless about. Complain about actual issues like the roms they took down that aren’t even for sale anywhere",
                              "score": 12,
                              "created_utc": 1730901301.0,
                              "replies": []
                            },
                            {
                              "id": "lvpfn8v",
                              "author": "Brawlers9901",
                              "body": "You can't even use the same steam account simultaneously though?",
                              "score": 12,
                              "created_utc": 1730899727.0,
                              "replies": [
                                {
                                  "id": "lvphq8b",
                                  "author": "LowCarbDad",
                                  "body": "I’m sharing my games with my partner and you can log in to multiple accounts. I can switch from playing on my pc to playing on my deck to playing on her pc alll while maintaining the same progress…",
                                  "score": -2,
                                  "created_utc": 1730900363.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lvqd2u6",
                              "author": "Babys_For_Breakfast",
                              "body": "I not a fan of Nintendo either, but we at least have to be rational with our complaints against them.",
                              "score": 2,
                              "created_utc": 1730909203.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lvqfzzg",
                      "author": "IAmPerpetuallyTired",
                      "body": "What a confusing sentence.",
                      "score": 1,
                      "created_utc": 1730909986.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvr6ihk",
          "author": "blacksoxing",
          "body": "I hate that I am excited about this news as I went almost all-digital with the Switch in the same fashion I did w/Xbox about a decade ago and frankly it's been wonderful not having to worry about cartridges and the like.\n\nTo know that the Switch 2 is backwards compatible means that I'm not a dam fool who possibly would have lost about $500-700 in games to an aged console. Great frame of reference: I bought Left 4 Dead 2 in 2008 and I can still play it today. LFD2 is damn near an adult! That is what I want for Nintendo where the games I bought in say 2020 can still be played in 2032.",
          "score": 2,
          "created_utc": 1730917090.0,
          "replies": []
        },
        {
          "id": "lvuluh3",
          "author": "Stupidiocy",
          "body": "Wouldn't they be doing the opposite if they had us by the balls? Not make it backwards compatible and resell all the old games on the new platform?",
          "score": 1,
          "created_utc": 1730955749.0,
          "replies": []
        },
        {
          "id": "lvocoq5",
          "author": "zeelbeno",
          "body": "But when sony or microsoft announce this it's ok?",
          "score": -52,
          "created_utc": 1730882035.0,
          "replies": [
            {
              "id": "lvow7mf",
              "author": "MISFU88",
              "body": "Well you can literally play the majority of titles from the past 4 generation on your newest Xbox.",
              "score": 25,
              "created_utc": 1730893132.0,
              "replies": [
                {
                  "id": "lvp8ikg",
                  "author": "Campsters2803",
                  "body": "Do yourself a favor and just buy an entry level pc. Play games across all platforms and all ages.",
                  "score": 1,
                  "created_utc": 1730897461.0,
                  "replies": [
                    {
                      "id": "lvpcvwg",
                      "author": "GNIHTYUGNOSREP",
                      "body": "Find me a price/performance competitor to the Series X and I’ll think about “just buy a PC lol”",
                      "score": 9,
                      "created_utc": 1730898872.0,
                      "replies": []
                    },
                    {
                      "id": "lvpggm5",
                      "author": "MISFU88",
                      "body": "No, I’m a console gamer, I have disc games, I want to turn shit on and sit on a couch. I want to insert a disc into one of my consoles and play a videogame. I simply can’t understand how PC gamers refuse to realize that some people game on their consoles and don’t want to game on a PC.",
                      "score": 4,
                      "created_utc": 1730899977.0,
                      "replies": [
                        {
                          "id": "lvqqaza",
                          "author": "None",
                          "body": "Same.  I know some people really love how much flexibility there is with graphics settings on PC, but I really like that I can just pick an option or two and be done with it.  I also keep hearing that a lot of PC ports have bugs and performance issues, which I’ve encountered very little of on PS5.",
                          "score": 1,
                          "created_utc": 1730912708.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvpae05",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -4,
                      "created_utc": 1730898075.0,
                      "replies": [
                        {
                          "id": "lvpm9f6",
                          "author": "PancAshAsh",
                          "body": "You don't need or particularly want Windows 11 for gaming. I have a 5+ year old PC and can still play most new titles fine, just not on maximum settings.",
                          "score": 2,
                          "created_utc": 1730901720.0,
                          "replies": [
                            {
                              "id": "lvpo8jk",
                              "author": "None",
                              "body": "As a FPS fan, it sets me behind pretty far",
                              "score": 1,
                              "created_utc": 1730902317.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvokunq",
              "author": "Dave-James",
              "body": "When they announce it they have to build in an middle layer or emulation layer to do so (see PS3), **when Nintendo does it it’s because it means they’re going to use the same off-the-shelf chipset as a base for their system and therefor it ALREADY can play those games** (and likely limited at 1080p and 30fps… anyone who wants respectable modern specs will just end up emulating the chipset via software so they can actually have 4K 60.)",
              "score": 9,
              "created_utc": 1730886770.0,
              "replies": [
                {
                  "id": "lvorruh",
                  "author": "Regular_mills",
                  "body": "Yet the ps4 and ps5 are based off the same architecture and doesn’t need emulation for the ps5 to run ps4 games and they are made by off the shelf chipsets (both consoles use AMD chipsets with same instruction set). So what’s your point?",
                  "score": 20,
                  "created_utc": 1730890911.0,
                  "replies": [
                    {
                      "id": "lvp2h8s",
                      "author": "zeelbeno",
                      "body": "That Nintendo = bad?",
                      "score": 5,
                      "created_utc": 1730895403.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvoutjs",
                  "author": "Myrang3r",
                  "body": "But the PS4 and PS5 or XBOX one and XBOX series also don't require emulation because they're technically all just x86 PCs.",
                  "score": 6,
                  "created_utc": 1730892464.0,
                  "replies": []
                },
                {
                  "id": "lvox0x9",
                  "author": "kwiksi1ver",
                  "body": "Remember when the Wii was backwards compatible with the GameCube? And then later generations weren’t?",
                  "score": 6,
                  "created_utc": 1730893467.0,
                  "replies": [
                    {
                      "id": "lvoxxk9",
                      "author": "AgencyBasic3003",
                      "body": "The Wii was actually just a beefed GameCube. It has a newer ATI GPU, an overclocked CPU and more RAM. Nintendo even had a mode for their developers to natively run Gamecube games exactly like they would run on a GameCube.",
                      "score": 6,
                      "created_utc": 1730893809.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvonej5",
                  "author": "nullstring",
                  "body": "I guess it's yet to be seen but I fully expect higher res on older titles.",
                  "score": 2,
                  "created_utc": 1730888337.0,
                  "replies": [
                    {
                      "id": "lvu4bcm",
                      "author": "Dave-James",
                      "body": "Anything that is rendered in real-time will be 1080p. Nintendo won’t be able to make it to 4K. Maybe they’ll render at 1080 and then upscale and antialias the edges to 4K, but not native.",
                      "score": 1,
                      "created_utc": 1730948746.0,
                      "replies": [
                        {
                          "id": "lvub4ol",
                          "author": "nullstring",
                          "body": "... Why not? What makes you say that.\n\nI mean 4k sounds too demanding and to me but 1440p with upscaling may be possible on *some* games. 4k probably also available on very light weight games.",
                          "score": 1,
                          "created_utc": 1730951271.0,
                          "replies": [
                            {
                              "id": "lw11y1v",
                              "author": "Dave-James",
                              "body": "They are not going to use an output resolution that almost nobody even has a TV with the native resolution of. That’s even LESS LIKELY than 4K. \n\nNot to mention the obvious: both 720p AND 1080p Will upscale perfectly to 4K by an interval of 3 and 2 respectively (1080 doubled fits into 2160/4K and 720p tripled also fits into 4K), but **1440p will NEVER correctly scale to 4K… so imagine releasing a console that can’t even scale to the current industry standard 4K.**\n\nIt will either be pseudo-fake 4K (see tech like DLSS), really-fake 4K (most likely, rendered at 1080p and then pixel doubled and antialiased by a hardware processor) or it will be 1080p and your TV will have to automatically upscale it (also likely).\n\nIt’s Nintendo…",
                              "score": 0,
                              "created_utc": 1731040965.0,
                              "replies": [
                                {
                                  "id": "lw14m6s",
                                  "author": "nullstring",
                                  "body": "> **1440p will NEVER correctly scale to 4K… so imagine releasing a console that can’t even scale to the current industry standard 4K.**\n\nThis part is completely wrong. I use 1440p scaling to 4k with DLSS on essentially every game on my PC. It looks fantastic.",
                                  "score": 1,
                                  "created_utc": 1731042083.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvokbe5",
              "author": "Bigpappa36",
              "body": "That’s different when talking next generation of gaming, not an upgraded switch lol",
              "score": 0,
              "created_utc": 1730886443.0,
              "replies": [
                {
                  "id": "lvoodci",
                  "author": "WhiteBlackBlueGreen",
                  "body": "I mean the ps5 is just an upgraded ps4 if you think about it",
                  "score": 15,
                  "created_utc": 1730888928.0,
                  "replies": []
                },
                {
                  "id": "lvotzuk",
                  "author": "None",
                  "body": "I mean has Nintendo ever not done backwards compatibility for a second iteration? The GBA and DS were, the DS, DSi, 3ds, etc all were, Wii/WiiU, GameCube/Wii.",
                  "score": 2,
                  "created_utc": 1730892059.0,
                  "replies": []
                },
                {
                  "id": "lvu4itu",
                  "author": "Dave-James",
                  "body": "GameCube and Wii were different generations and still the same hardware. Same thing here, they’ve given up competing and have accepted their status as an “in addition to PS/Xbox” type of console. Sad company, they didn’t even try and just decided to double down on gimmicks with every generation.\n\nIf Nintendo is promoting near 100% backwards compatibility, this WILL either be the same chipset or a variant with the same processor and overall architecture.",
                  "score": 2,
                  "created_utc": 1730948818.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvpa7sh",
              "author": "FlarblesGarbles",
              "body": "You responded to something they never said.",
              "score": 1,
              "created_utc": 1730898018.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvo8tdb",
      "author": "Britz10",
      "body": "Which explains the take down of switch emulators",
      "score": 181,
      "created_utc": 1730880229.0,
      "replies": [
        {
          "id": "lvps0bs",
          "author": "rearisen",
          "body": "What take down? There are plenty.",
          "score": 2,
          "created_utc": 1730903425.0,
          "replies": [
            {
              "id": "lvptm0s",
              "author": "Britz10",
              "body": "Yuzu and Ryujinx",
              "score": 26,
              "created_utc": 1730903893.0,
              "replies": []
            },
            {
              "id": "lvq0mb3",
              "author": "dandroid126",
              "body": "The top two (Yuzu and Ryujinx) are now owned by Nintendo. Yuzu from a legal battle from their greed around the TotK release date. And Ryujinx they just straight up bought so they could take it down. \n\nLuckily Ryujinx was open source and has been forked. Not sure if it is in active development, though.",
              "score": 26,
              "created_utc": 1730905859.0,
              "replies": [
                {
                  "id": "lvqjhof",
                  "author": "rearisen",
                  "body": "For future nintendo releases, I'd agree with you but I think saying nintendo owns the emulators isn't really correct. Totk still plays flawlessly in Yuzu, too.",
                  "score": 11,
                  "created_utc": 1730910915.0,
                  "replies": [
                    {
                      "id": "lvqlh1u",
                      "author": "dandroid126",
                      "body": "Nintendo owns the intellectual property. If you have an old build, that's obviously safe. But the old developers can no longer legally develop the software.",
                      "score": 6,
                      "created_utc": 1730911439.0,
                      "replies": [
                        {
                          "id": "lvr8lhy",
                          "author": "nullstring",
                          "body": "Nintendo can only own the sections that were written by the main ryujinx developer.\n\nThey cannot own anything that was pushed by other developers unless Ryujinx developer was making them sign the code over to him (which I haven't looked into but I sincerely doubt.)\n\nIt's more accurate to say they bought out the developer. The code is MIT licensed so they could use it in commerical products but that was always the case. So what did they really buy? What do they really own? Basically nothing.\n\nThey just \"own\" the dev now.",
                          "score": 0,
                          "created_utc": 1730917656.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvrar6l",
                  "author": "kingstonbeer",
                  "body": "Apologies is that actually true? I only read that he was given an offer and assumed it was legal demands.",
                  "score": 1,
                  "created_utc": 1730918239.0,
                  "replies": [
                    {
                      "id": "lvrbdft",
                      "author": "dandroid126",
                      "body": "I read \"offer they can't refuse\" and inferred that it meant they were bought out. Upon further research, that's really all the info we have.",
                      "score": 7,
                      "created_utc": 1730918408.0,
                      "replies": [
                        {
                          "id": "lvs1o8u",
                          "author": "Adorable_Stay_725",
                          "body": "Generally an \"offer they can’t refuse\" is more a threat that they will [insert Gus Fringe quote] and burn them to the ground if they don’t comply, not that they were bought",
                          "score": 5,
                          "created_utc": 1730925572.0,
                          "replies": [
                            {
                              "id": "lvsdyav",
                              "author": "justaboxinacage",
                              "body": "I'll have to correct you a bit \"an offer he couldn't refuse\" is a quote from the Godfather, and originally it was meant to imply a threat of violence is used to coerce someone into selling something they would not have otherwise sold.\n\nThe original meaning would seem to match pretty well here, if you replace the threat of violence with the threat of legal action.",
                              "score": 1,
                              "created_utc": 1730928905.0,
                              "replies": [
                                {
                                  "id": "lvsufar",
                                  "author": "Adorable_Stay_725",
                                  "body": "Yeah I meant to quote \"I will kill your wife. I will kill you son, I. Will. Kill. Your infant daughter.\" But found it not very appropriate and I thought I was on a nintendo sub. By the way I would think \"an offer they couldn’t refuse\" simply precedes that Godfather quote since coercing into accepting forced terms is as old as the world as we know it",
                                  "score": 1,
                                  "created_utc": 1730933679.0,
                                  "replies": [
                                    {
                                      "id": "lvt39bm",
                                      "author": "justaboxinacage",
                                      "body": "As a normal english sentence, yes it's been around since the words could be strung together, I'm sure. As a phrase in popular culture with implied subtext, it's from The Godfather. And it used to be practically obligatory that if you uttered it, you had to pair it with your Brando impression hah",
                                      "score": 2,
                                      "created_utc": 1730936493.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvp21ce",
          "author": "Parking-Historian360",
          "body": "I'm willing to bet they do it in an effort to curve emulation.",
          "score": -3,
          "created_utc": 1730895247.0,
          "replies": [
            {
              "id": "lvp7vrc",
              "author": "ibite-books",
              "body": "curb?",
              "score": 16,
              "created_utc": 1730897255.0,
              "replies": [
                {
                  "id": "lvpw1pb",
                  "author": "Buckwheat469",
                  "body": "Kick it to the curve.",
                  "score": 3,
                  "created_utc": 1730904585.0,
                  "replies": [
                    {
                      "id": "lvpw72v",
                      "author": "ibite-books",
                      "body": "curve your enthusiasm",
                      "score": 4,
                      "created_utc": 1730904628.0,
                      "replies": [
                        {
                          "id": "lvqva5j",
                          "author": "TotoCocoAndBeaks",
                          "body": "Curveys Dream World",
                          "score": 3,
                          "created_utc": 1730914040.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvp2or5",
              "author": "Britz10",
              "body": "There are hundreds of emulators that emulate Nintendo systems, none of them have been touched, the only system that wasn't switch that went offline was Citra for the 3DS, and that was only down to Yuzu being taken down, not Nintendo going after them.\n\nThere are Gameboy and DS emulators on iOS now.",
              "score": 16,
              "created_utc": 1730895476.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvo5uo3",
      "author": "Travelingman9229",
      "body": "Hope it releases before the tariffs kick in…",
      "score": 165,
      "created_utc": 1730878959.0,
      "replies": [
        {
          "id": "lvon4rl",
          "author": "Timlugia",
          "body": "Switch2 probably will cost $500 like Brazilian pays due to tariff..",
          "score": 37,
          "created_utc": 1730888169.0,
          "replies": [
            {
              "id": "m04prd5",
              "author": "LlamaDrama_lol",
              "body": "we gonna have to pay double tariff lmao ( :((( )",
              "score": 1,
              "created_utc": 1733188880.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvqbiym",
          "author": "LeCrushinator",
          "body": "Are we going to be applying tariffs to Japanese goods as well?",
          "score": 15,
          "created_utc": 1730908789.0,
          "replies": [
            {
              "id": "lvr7sho",
              "author": "None",
              "body": "Trump campaigned on putting tariffs on all imports from all countries.  Everything.\n\nGame consoles are also manufactured in China so depending on how that works out they would be under the heavier 60% tariff and would see about a 40% price increase for American consumers.",
              "score": 38,
              "created_utc": 1730917436.0,
              "replies": [
                {
                  "id": "lvr8f8h",
                  "author": "LeCrushinator",
                  "body": "So just a tax increase on poor and middle class. I'm sure that will go over well. /s",
                  "score": 29,
                  "created_utc": 1730917608.0,
                  "replies": [
                    {
                      "id": "lvr8vnr",
                      "author": "None",
                      "body": "Essentially yeah.  A massive tax increase on everybody who isn't massively wealthy.  \n\nThe retaliatory tariffs would also destroy entire sectors of our economy, like the soybean farmers from the smaller trade war he had.",
                      "score": 23,
                      "created_utc": 1730917731.0,
                      "replies": []
                    },
                    {
                      "id": "lvrhfis",
                      "author": "theblackxranger",
                      "body": "Gotta keep you poor so the rich stay rich",
                      "score": 13,
                      "created_utc": 1730920049.0,
                      "replies": [
                        {
                          "id": "lvsxs23",
                          "author": "TheRealLRonHoyabembe",
                          "body": "The poorer we are the more exhausted we become as basic living expenses become closer to being out of reach. An exhausted population is less likely to revolt.",
                          "score": 7,
                          "created_utc": 1730934729.0,
                          "replies": [
                            {
                              "id": "lvsy4me",
                              "author": "theblackxranger",
                              "body": "I'm so exhausted tbh. Can we opt out of life?",
                              "score": 5,
                              "created_utc": 1730934840.0,
                              "replies": [
                                {
                                  "id": "lvszvs1",
                                  "author": "TheRealLRonHoyabembe",
                                  "body": "Like, I’m not suicidal, but there’s a lot of fucking days.",
                                  "score": 5,
                                  "created_utc": 1730935401.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvt05bk",
                  "author": "aaahhhhhhfine",
                  "body": "Something makes me smile a bit more today to think of some stupid gen-z gamer kid pissed off when he goes to buy the Switch 2 because it's so expensive. Unfortunately he'll probably end up on reddit blaming Nintendo and not realize the degree to which it's a leopards ate my face moment.",
                  "score": 4,
                  "created_utc": 1730935487.0,
                  "replies": [
                    {
                      "id": "lvt0g8r",
                      "author": "None",
                      "body": "I tried to explain what tariffs would do to gaming hardware prices on some gaming forums and the heat I got was ridiculous.  \n\nI'm not going to bother explaining things to people like this anymore.  If they want to shoot themselves in the foot, I'm not going to be able to stop them.",
                      "score": 4,
                      "created_utc": 1730935585.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvrhctd",
              "author": "theblackxranger",
              "body": "Everything",
              "score": 6,
              "created_utc": 1730920029.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvu1z9q",
          "author": "nastyLake",
          "body": "Facts. We are doomed.",
          "score": 1,
          "created_utc": 1730947939.0,
          "replies": []
        },
        {
          "id": "lvo8ztv",
          "author": "None",
          "body": "[deleted]",
          "score": -5,
          "created_utc": 1730880308.0,
          "replies": [
            {
              "id": "lvogb26",
              "author": "Onebadmuthajama",
              "body": "It’s not just china… tariffs affect geopolitical trade for everyone. Get ready to really take a pounding as an American consumer. It’s coming from both ends\n\nPlus Trump has said 20% *global* tariffs on top of that.\n\nOur domestic wealth is about to plummet",
              "score": 36,
              "created_utc": 1730884069.0,
              "replies": [
                {
                  "id": "lvoqkzl",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 15,
                  "created_utc": 1730890255.0,
                  "replies": [
                    {
                      "id": "lvp9m6n",
                      "author": "flummyheartslinger",
                      "body": "All of which will be blamed on China, the EU, the gays, women, and immigrants.",
                      "score": 9,
                      "created_utc": 1730897823.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvpkd0y",
                  "author": "Bdr1983",
                  "body": "I can smell the new wave of inflation from the other side of the atlantic.",
                  "score": 2,
                  "created_utc": 1730901154.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvoemti",
              "author": "Shkkzikxkaj",
              "body": "Trump has promised a global 20% tariff.",
              "score": 53,
              "created_utc": 1730883116.0,
              "replies": [
                {
                  "id": "lvof2e0",
                  "author": "Lied-",
                  "body": "Fuck yeah. Raised prices and more dollars following into his US oligarchs pockets, hurray",
                  "score": 39,
                  "created_utc": 1730883359.0,
                  "replies": [
                    {
                      "id": "lvops38",
                      "author": "Ser_Danksalot",
                      "body": "Not sure it works that way.  Tariffs are paid directly to the US government by the American companies that do the importing.  It's a plan that would jack up prices for consumers and fuck with the economy for sure, but I fail to see how the oligarchs and plutocrats could benefit from that if someone could explain?\n\nEdit: -  Why the downvotes?  I'm not on the side of tangerine palpatine, and was a genuine question.",
                      "score": -12,
                      "created_utc": 1730889788.0,
                      "replies": [
                        {
                          "id": "lvorj75",
                          "author": "pqueiro1",
                          "body": "Tariff is 20%. Prices go up 30%. Corporations blame tariffs, pocket the 10% difference.",
                          "score": 29,
                          "created_utc": 1730890782.0,
                          "replies": [
                            {
                              "id": "lvp6mlw",
                              "author": "Ser_Danksalot",
                              "body": "Maybe, but prices go too high and demand can drop it wipe out that 10% difference.  Essential food and clothing items may not be vulnerable though?",
                              "score": 0,
                              "created_utc": 1730896837.0,
                              "replies": []
                            },
                            {
                              "id": "lvowgil",
                              "author": "MisterDonutTW",
                              "body": "Supply and demand doesn't work this way.",
                              "score": -20,
                              "created_utc": 1730893244.0,
                              "replies": [
                                {
                                  "id": "lvox1x1",
                                  "author": "say592",
                                  "body": "I'm sure the other companies importing Nintendo Switches will keep Nintendo in check.",
                                  "score": 15,
                                  "created_utc": 1730893477.0,
                                  "replies": []
                                },
                                {
                                  "id": "lvp1bvt",
                                  "author": "GrayEidolon",
                                  "body": "The cost of tariffs are passed into consumers. That’s just a fact. But if we’re discussing tariffs, then we’re discussing market distortions more complex than just supply and demand.",
                                  "score": 10,
                                  "created_utc": 1730895000.0,
                                  "replies": []
                                },
                                {
                                  "id": "lvr8hoy",
                                  "author": "None",
                                  "body": "If a company has to a 20 to 60% tax on a good. They are importing to sell here, they will 100% Factor that into the price. \n\nThey aren't just going to eat that.",
                                  "score": 4,
                                  "created_utc": 1730917627.0,
                                  "replies": [
                                    {
                                      "id": "lvr93pe",
                                      "author": "MisterDonutTW",
                                      "body": "I'm not saying they are.  The above poster said they add the tax plus even more just to scam/trick the customer, as if they can just get away with that when they have competition.",
                                      "score": 0,
                                      "created_utc": 1730917791.0,
                                      "replies": [
                                        {
                                          "id": "lvr9g5n",
                                          "author": "None",
                                          "body": "Who else is manufacturing Nintendo Switch 2 consoles to compete with nintendo?",
                                          "score": 5,
                                          "created_utc": 1730917885.0,
                                          "replies": [
                                            {
                                              "id": "lvrjcfd",
                                              "author": "None",
                                              "body": "[removed]",
                                              "score": 0,
                                              "created_utc": 1730920574.0,
                                              "replies": [
                                                {
                                                  "id": "lvrjqcm",
                                                  "author": "None",
                                                  "body": "> It's not who manufacturers it's who imports and sells. Lots of stores sell game consoles.\n\n\nStores receive their stock from Nintendo.  Nintendo imports their systems and pays the tariff.  They then set the unit cost that stores will have to pay to receive stock, and they set the MSRP.  \n\n>I am talking to a bunch of idiots here.\n\nBuddy, you're getting upset at people for recognizing that there isn't real competition on a product only one company produces and distributes and sets the MSRP for.",
                                                  "score": 3,
                                                  "created_utc": 1730920680.0,
                                                  "replies": [
                                                    {
                                                      "id": "lvromge",
                                                      "author": "MisterDonutTW",
                                                      "body": "You're missing the whole point anyway, it's not about tariffs being added on or not, it's about if companies can use that as an excuse to charge whatever they want.",
                                                      "score": -1,
                                                      "created_utc": 1730922013.0,
                                                      "replies": [
                                                        {
                                                          "id": "lvs1z6l",
                                                          "author": "None",
                                                          "body": "They can, and companies have in the past with tariffs when they thought they could get away with it.",
                                                          "score": 2,
                                                          "created_utc": 1730925654.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lvozbal",
                                  "author": "teodorfon",
                                  "body": "Bro believes in Adam Smith.",
                                  "score": -1,
                                  "created_utc": 1730894292.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvobv5g",
              "author": "mehemynx",
              "body": "You don't, but I doubt Trump can honestly tell the difference",
              "score": 28,
              "created_utc": 1730881610.0,
              "replies": []
            },
            {
              "id": "lvohfds",
              "author": "Microtic",
              "body": "It's made in China likely. So there will be tariffs. ",
              "score": 5,
              "created_utc": 1730884713.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvrhbm5",
          "author": "theblackxranger",
          "body": "$2000 for your new gaming machine please",
          "score": 1,
          "created_utc": 1730920019.0,
          "replies": []
        },
        {
          "id": "lvo6i36",
          "author": "None",
          "body": "🤡",
          "score": -94,
          "created_utc": 1730879236.0,
          "replies": [
            {
              "id": "lvoim8n",
              "author": "Uncircumcised_Cheese",
              "body": "🤡",
              "score": 18,
              "created_utc": 1730885419.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvpr1rz",
          "author": "kevin379721",
          "body": "Hahahaha you’re in a blender",
          "score": -26,
          "created_utc": 1730903144.0,
          "replies": [
            {
              "id": "lvpr8wn",
              "author": "Travelingman9229",
              "body": "https://amp.cnn.com/cnn/2024/11/04/business/tariffs-donald-trump-prices",
              "score": 13,
              "created_utc": 1730903202.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvot70o",
      "author": "DoctorWaluigiTime",
      "body": "Love how this objectively good news is met with doomerism:\n\n- \"No duh it's obvious\"\n- \"The fact this is news is telling\"\n\netc.",
      "score": 58,
      "created_utc": 1730891655.0,
      "replies": [
        {
          "id": "lvppgi7",
          "author": "Halcyon520",
          "body": "Yeah I am not getting it either, this is fine news and in line with the backwards compatibility of the PS5\\4 And Xbox Series \\ One \n\nIf you don’t like Nintendo that’s cool, if you don’t like Nintendo games also cool. But to not want a feature in a new system because it is Nintendo doesn’t make much sense to me. \n\nHoping this means it will be easier to get a Switch 2 near launch if so many people don’t want it because it plays switch one games",
          "score": 13,
          "created_utc": 1730902678.0,
          "replies": []
        },
        {
          "id": "lvptnn8",
          "author": "The_Stupidest_Idiot",
          "body": "Objectively good news to consumers would be confirmation that all of our purchases on the Switch will be transferable to the new console, but I don't think they've said anything like that. \n\nNintendo announcing backwards compatibility without confirming we can keep our existing libraries basically translates to: \"We're going to allow you to pay again to have the exact same games on the new console and you should be happy about this\"\n\nAgain, if I missed the part where we get to keep our Switch games and not pay again on the new console, I'll be happily wrong here and please tell me if that is the case",
          "score": 3,
          "created_utc": 1730903907.0,
          "replies": [
            {
              "id": "lvs98kd",
              "author": "Erdago",
              "body": "While it wasn’t officially confirmed (mainly because the console wasn’t confirmed in any detail), the language used to explain the situation makes it clear that’s what they’re looking into. The presentation explained that until the Switch, they couldn’t easily carry over software history over generations, but with the Switch accounts, this has became viable for them. Then they brought back the prior Switch 2 pseudo announcement, and said that Switch 2 will have NSO and will be “able to play Nintendo Switch software they currently own”, I feel it would be hard to assume that in general, all Switch purchases will carry over to Switch 2.",
              "score": 0,
              "created_utc": 1730927608.0,
              "replies": [
                {
                  "id": "lvsej2s",
                  "author": "The_Stupidest_Idiot",
                  "body": "I appreciate the optimism, really I do, but I don't want to get my hopes up until they actually say your Switch library carries over without needing to buy them again. Maybe they're saving that news for later with the full reveal (obviously want to know about Switch cart port or not).\n\nIf that is the case, that my digital library carries over without paying, it would be my strongest reason to buy it right away.\n\nNintendo made plenty of money porting WiiU games to Switch, it's just hard for me to dismiss that they would want to keep making money that way. I hope I'm wrong.",
                  "score": 1,
                  "created_utc": 1730929064.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvpw0m4",
              "author": "DoctorWaluigiTime",
              "body": "> Objectively ~~good~~ better news to consumers would be confirmation that all of our purchases on the Switch will be transferable to the new console\n\nftfy",
              "score": -1,
              "created_utc": 1730904577.0,
              "replies": [
                {
                  "id": "lvpz90o",
                  "author": "The_Stupidest_Idiot",
                  "body": "There's no reason a consumer should be happy about paying twice for the exact same product, especially when compared to Xbox and Steam that let you keep the games you already bought\n\nI have a library of almost 500 games on Switch, there's no way I'm paying for all that again",
                  "score": 2,
                  "created_utc": 1730905482.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvtq6w4",
          "author": "LionIV",
          "body": "It’s more indicative of the environment gaming is in right now. Especially coming from a company that has all but abandoned any efforts in making their catalogues easy to buy and play in favor of charging monthly premiums for access.",
          "score": 1,
          "created_utc": 1730943944.0,
          "replies": []
        },
        {
          "id": "lvp2frp",
          "author": "ilyearer",
          "body": "Might have something to do with how aggressive Nintendo has been lately.",
          "score": -2,
          "created_utc": 1730895388.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvp2zaa",
      "author": "Odd_Sweet_880",
      "body": "Not releasing before christmas is insane",
      "score": 7,
      "created_utc": 1730895580.0,
      "replies": []
    },
    {
      "id": "lvphhkt",
      "author": "KlingoftheCastle",
      "body": "Hallelujah!  I’m pumped about this.  I still use my Wii to play Gamecube games, so I’m always down for backwards compatibility",
      "score": 5,
      "created_utc": 1730900291.0,
      "replies": []
    },
    {
      "id": "lvocq9v",
      "author": "None",
      "body": "[deleted]",
      "score": 11,
      "created_utc": 1730882058.0,
      "replies": [
        {
          "id": "lvp1sdq",
          "author": "basti329",
          "body": "I hope they can make those games perform better with the switch2. \n\nI just cant deal with the bad performance in games. I don't mind 30 fps but at least make it consistent :S",
          "score": 2,
          "created_utc": 1730895161.0,
          "replies": [
            {
              "id": "lvrui91",
              "author": "daou0782",
              "body": "Would love to see totk in all its potential glory, like some pc mods show.",
              "score": 0,
              "created_utc": 1730923608.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvqdo8y",
          "author": "abitlikemaple",
          "body": "Smash bros 6 sure to follow",
          "score": 1,
          "created_utc": 1730909361.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvobnyk",
      "author": "willie3204",
      "body": "Says software… not carts… do we assume he means both? 🤔",
      "score": 24,
      "created_utc": 1730881514.0,
      "replies": [
        {
          "id": "lvoj5yj",
          "author": "None",
          "body": "[removed]",
          "score": 27,
          "created_utc": 1730885750.0,
          "replies": [
            {
              "id": "lvol63z",
              "author": "iTwango",
              "body": "It stands for games as a whole? I feel like it's as ambiguous as English but I guess I haven't done a whole lot of non-digital gaming in a while",
              "score": -1,
              "created_utc": 1730886964.0,
              "replies": [
                {
                  "id": "lvq0srt",
                  "author": "PotatEXTomatEX",
                  "body": "Bro, he'd get sued to hell if it was digital only back compat.",
                  "score": 0,
                  "created_utc": 1730905909.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvp5d0s",
          "author": "djwillis1121",
          "body": "My assumption would be that it also means cartridges. DS games were called software as well and there were no digital games back then, only cartridges",
          "score": 11,
          "created_utc": 1730896408.0,
          "replies": [
            {
              "id": "lvq2l68",
              "author": "arnaud_blanc",
              "body": "First DS had a GBA port. Next one didn’t had it.",
              "score": -1,
              "created_utc": 1730906398.0,
              "replies": [
                {
                  "id": "lvq2vi5",
                  "author": "djwillis1121",
                  "body": "That doesn't have anything to do with what I said. My point was that a DS game on a DS cartridge was called \"software\" so Nintendo saying \"software\" in this context doesn't mean anything about whether they're talking about physical or digital.",
                  "score": 3,
                  "created_utc": 1730906476.0,
                  "replies": []
                },
                {
                  "id": "lvraem1",
                  "author": "ItsColorNotColour",
                  "body": "the hell are you on about",
                  "score": 1,
                  "created_utc": 1730918144.0,
                  "replies": [
                    {
                      "id": "lxymsr8",
                      "author": "arnaud_blanc",
                      "body": "I mean the DS was backwards compatible with the previous generation",
                      "score": 1,
                      "created_utc": 1732038858.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvtndnb",
                  "author": "NeoTechni",
                  "body": "DSi wasn't advertised as compatible with GBA software, and couldn't play downloads as they didn't exist (for Nintendo) till the 3DS",
                  "score": 1,
                  "created_utc": 1730943027.0,
                  "replies": [
                    {
                      "id": "lxymg6q",
                      "author": "arnaud_blanc",
                      "body": "Of course they did exist at that time ! Don’t you know about DSiWare and the Nintendo DSi shop ?\nBu you’re still partially right, there was no GBA digital games yet.",
                      "score": 1,
                      "created_utc": 1732038756.0,
                      "replies": [
                        {
                          "id": "lxypcaj",
                          "author": "NeoTechni",
                          "body": "> Of course they did exist at that time ! \n\nThey did not. Nintendo did not have a way to download GBA games as it was physical-only. I specified (for Nintendo)",
                          "score": 1,
                          "created_utc": 1732039600.0,
                          "replies": [
                            {
                              "id": "ly9sm5k",
                              "author": "arnaud_blanc",
                              "body": "You didn’t read what I wrote.",
                              "score": 1,
                              "created_utc": 1732208851.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvok959",
      "author": "Jiangcool9",
      "body": "Is it digital library only or physical works too?\nI might start preparing my physical library",
      "score": 3,
      "created_utc": 1730886406.0,
      "replies": [
        {
          "id": "lvpufwg",
          "author": "Fafnir13",
          "body": "I’m less a fan of digital these days.  Unless it’s something seemingly immortal like Steam I’d rather get a cartridge/disc that can physically fit on my shelf.  Storefronts getting sunset and also potential account access issues have me feeling cautious again.",
          "score": 7,
          "created_utc": 1730904130.0,
          "replies": [
            {
              "id": "lvr8tij",
              "author": "digicow",
              "body": "My household shares 2 Switches among 2 adults and 3 children. Nintendo goes out of their way to make digital games practically worthless for that scenario, so I'll only buy digitals if theres no other option or if they're under $5. And even then, DLCs are digital only so there's still tons of problems",
              "score": 4,
              "created_utc": 1730917715.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvpqvrf",
      "author": "tauriwoman",
      "body": "Twilight Princess remake PLEEEEEEEEASE!!!",
      "score": 3,
      "created_utc": 1730903096.0,
      "replies": [
        {
          "id": "lvprqsg",
          "author": "UnsorryCanadian",
          "body": "They did that for the Wii U, they're not going to remake it *again*",
          "score": 5,
          "created_utc": 1730903349.0,
          "replies": [
            {
              "id": "lvtp1hh",
              "author": "SirLocke13",
              "body": "Yeah just like how they remade Xenoblade 1 ported to 3DS, they aren't going to remake it again for Swit- oh wait.\n\nThey are a business.\n\nThey will do literally anything to make money.\n\nEspecially to an objectively wider audience.",
              "score": 1,
              "created_utc": 1730943570.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvq00zm",
      "author": "Dyyrin",
      "body": "Because it's just a switch 1 with a better screen and battery bet.",
      "score": 3,
      "created_utc": 1730905697.0,
      "replies": []
    },
    {
      "id": "lvsbibb",
      "author": "42Fazers",
      "body": "With online subscription*",
      "score": 3,
      "created_utc": 1730928226.0,
      "replies": []
    },
    {
      "id": "lvtzugu",
      "author": "Losreyes-of-Lost",
      "body": "Mario Kart 8 will now be known as Mario Kart Infinity ",
      "score": 3,
      "created_utc": 1730947206.0,
      "replies": []
    },
    {
      "id": "lvp62mi",
      "author": "-Memnarch-",
      "body": "Monkeys paw: But cartridges don't fit and you have to Rebuy them digitally",
      "score": 5,
      "created_utc": 1730896650.0,
      "replies": []
    },
    {
      "id": "lvoaqgg",
      "author": "tignasse",
      "body": "No kidding!",
      "score": 3,
      "created_utc": 1730881086.0,
      "replies": []
    },
    {
      "id": "lvonwh1",
      "author": "ilrosewood",
      "body": "Best news I’ve had all day",
      "score": 2,
      "created_utc": 1730888643.0,
      "replies": []
    },
    {
      "id": "lvoqkfb",
      "author": "CtrlAltEvil",
      "body": "Considering the amount of people on the current gen, they’d be fools not to have compatibility between generations.",
      "score": 2,
      "created_utc": 1730890247.0,
      "replies": []
    },
    {
      "id": "lvp48ka",
      "author": "dramafan1",
      "body": "I’m guessing it’s like a 3DS type of upgrade from the DS where there’s a redesign with backwards compatibility.",
      "score": 2,
      "created_utc": 1730896018.0,
      "replies": []
    },
    {
      "id": "lvpbpcz",
      "author": "FlarblesGarbles",
      "body": "They'd be absolutely insane to not have backwards compatibility.",
      "score": 2,
      "created_utc": 1730898500.0,
      "replies": []
    },
    {
      "id": "lvpc53d",
      "author": "Tovar42",
      "body": "available only with nintendo online premium",
      "score": 2,
      "created_utc": 1730898639.0,
      "replies": []
    },
    {
      "id": "lvqjux6",
      "author": "Eagledriver88",
      "body": "Hopefully that goes for hardware as well. Love my Zelda  controller.",
      "score": 2,
      "created_utc": 1730911013.0,
      "replies": []
    },
    {
      "id": "lvqx52l",
      "author": "frenzyFerret",
      "body": "So I can play all my pirated games on it 😲?",
      "score": 2,
      "created_utc": 1730914540.0,
      "replies": [
        {
          "id": "lvto3jn",
          "author": "SirLocke13",
          "body": "Yep you can system transfer all of your pirated games from your Switch to the new console.",
          "score": 1,
          "created_utc": 1730943260.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvowo2p",
      "author": "xeroxcomplex",
      "body": "Not like any of us will be able to afford it with all the tariffs going in place under trump.",
      "score": 5,
      "created_utc": 1730893330.0,
      "replies": [
        {
          "id": "lvrmh51",
          "author": "momjeanseverywhere",
          "body": "Canadians for the win!",
          "score": 3,
          "created_utc": 1730921428.0,
          "replies": [
            {
              "id": "lvtnnoy",
              "author": "NeoTechni",
              "body": "Trudeau tanking our economy has already put tariffs on our games/food/etc.",
              "score": -1,
              "created_utc": 1730943117.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvpbo9e",
      "author": "None",
      "body": "You know I thought Reddit would be wall to wall Trump coverage today. Then Nintendo swoops in outta nowhere, shouts \"Reddit hold my beer\", and dominates my entire feed with post after post of the most obvious announcement in all gaming history.",
      "score": 3,
      "created_utc": 1730898490.0,
      "replies": [
        {
          "id": "lvpr2q4",
          "author": "hanzoplsswitch",
          "body": "somber imminent payment domineering slimy weather shy pause whistle scarce\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 5,
          "created_utc": 1730903152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvo5vby",
      "author": "HeftyArgument",
      "body": "big fucking win, I’m here for it!",
      "score": 4,
      "created_utc": 1730878967.0,
      "replies": []
    },
    {
      "id": "lvos4w4",
      "author": "JagsAbroad",
      "body": "But will my online library transfer over…?",
      "score": 1,
      "created_utc": 1730891107.0,
      "replies": [
        {
          "id": "lvp97mo",
          "author": "LSDemon",
          "body": "It's possible that ONLY your online library will transfer over. Nintendo said software is compatible, not that cartridges are compatible.",
          "score": 2,
          "created_utc": 1730897689.0,
          "replies": [
            {
              "id": "lvpwxxr",
              "author": "JagsAbroad",
              "body": "As a nearly solely digital owner safe for literally 5 cartridges… phew.",
              "score": 1,
              "created_utc": 1730904838.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvou4zw",
      "author": "jbdi6984",
      "body": "How much?",
      "score": 1,
      "created_utc": 1730892129.0,
      "replies": []
    },
    {
      "id": "lvouz6s",
      "author": "ThenIcouldsee",
      "body": "Not now Nintendo, not mucking right now.",
      "score": 1,
      "created_utc": 1730892540.0,
      "replies": []
    },
    {
      "id": "lvoxkp4",
      "author": "SHADOWSTRIKE1",
      "body": "They would get so much hate otherwise",
      "score": 1,
      "created_utc": 1730893676.0,
      "replies": []
    },
    {
      "id": "lvoxzgc",
      "author": "Jack123610",
      "body": "I thought this was already pretty well known because they were purposefully taking down emulators to save switch 2",
      "score": 1,
      "created_utc": 1730893828.0,
      "replies": []
    },
    {
      "id": "lvoyklz",
      "author": "jdfroo",
      "body": "I just came",
      "score": 1,
      "created_utc": 1730894036.0,
      "replies": []
    },
    {
      "id": "lvp05ar",
      "author": "ReviewRude5413",
      "body": "Good news if true. Better if we’re still sticking with cartridges as well.",
      "score": 1,
      "created_utc": 1730894582.0,
      "replies": []
    },
    {
      "id": "lvp3x18",
      "author": "counterhit121",
      "body": "I would've been real salty if my entire switch library went down the shitter, so good on Nintendo for doing the right thing",
      "score": 1,
      "created_utc": 1730895907.0,
      "replies": []
    },
    {
      "id": "lvpasgm",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1730898205.0,
      "replies": [
        {
          "id": "lvtofls",
          "author": "NeoTechni",
          "body": "> Emulation or natively?   \n\nnatively. On portables, BC has always been native. For 2 reasons, it uses less power than emulation. And it ensures higher compatibility. This is how I called Vita using PSP hardware long before it was known. And I remember one forum getting mad at me for claiming so. To emphasize, even PSP for the most part natively runs PS1 games as it uses a more advanced version of the CPU. PS1 games on Vita even use the PSP hardware      \n\n> Is the Switch 2 a more powerful version of the Switch 1? \n\nYes. Just like Wii U was for Wii and Wii was for GCN",
          "score": 1,
          "created_utc": 1730943369.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpmm63",
      "author": "watchOS",
      "body": "This is great to hear.",
      "score": 1,
      "created_utc": 1730901828.0,
      "replies": []
    },
    {
      "id": "lvpn05p",
      "author": "JackieTree89",
      "body": "As a very novice gamer, what does that mean?",
      "score": 1,
      "created_utc": 1730901945.0,
      "replies": [
        {
          "id": "lvpvfrg",
          "author": "aplundell",
          "body": "Buy a switch game now,  you can play it on Switch2 later.",
          "score": 4,
          "created_utc": 1730904412.0,
          "replies": []
        },
        {
          "id": "lvto28h",
          "author": "Snoo54601",
          "body": "You will be able to play All your switch 1 games on switch 2 either digital or physical",
          "score": 2,
          "created_utc": 1730943248.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpo2e6",
      "author": "thisusernameisgonna",
      "body": "like i predicted/hoped for",
      "score": 1,
      "created_utc": 1730902266.0,
      "replies": []
    },
    {
      "id": "lvpqer8",
      "author": "Jamie00003",
      "body": "Why are Nintendo talking about the switch 2 before they’ve even announced it? Do they want to destroy the holiday quarter of switch 1 sales?",
      "score": 1,
      "created_utc": 1730902959.0,
      "replies": [
        {
          "id": "lvpyqb1",
          "author": "gman5852",
          "body": "Investor's meeting. This was to say that regardless of the new console, that the very profitable switch 1 library is sticking around.",
          "score": 2,
          "created_utc": 1730905336.0,
          "replies": [
            {
              "id": "lvq03p6",
              "author": "Jamie00003",
              "body": "They mentioned it back in may tho. And switch sales have slowed down",
              "score": 1,
              "created_utc": 1730905718.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvtnw0x",
          "author": "Snoo54601",
          "body": "They literally don't care \n\nFurukawa himself said so",
          "score": 1,
          "created_utc": 1730943192.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpw1lt",
      "author": "KOCA_XD",
      "body": "This should not be news",
      "score": 1,
      "created_utc": 1730904584.0,
      "replies": []
    },
    {
      "id": "lvpwl7v",
      "author": "NizarNoor",
      "body": "Fantastic news",
      "score": 1,
      "created_utc": 1730904739.0,
      "replies": []
    },
    {
      "id": "lvq0b5r",
      "author": "PotatEXTomatEX",
      "body": "They probably saw a drop in game sales from people afraid they wouldnt be compatible.",
      "score": 1,
      "created_utc": 1730905774.0,
      "replies": []
    },
    {
      "id": "lvq2ctn",
      "author": "anirban_dev",
      "body": "I expect this to be the least surprising news about the console.",
      "score": 1,
      "created_utc": 1730906335.0,
      "replies": []
    },
    {
      "id": "lvqbu96",
      "author": "SolidCat1117",
      "body": "Wonder if that means the cartridges will remain the same, or if there will be 2 cartridge slots possibly.",
      "score": 1,
      "created_utc": 1730908871.0,
      "replies": [
        {
          "id": "lvqqcqk",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1730912721.0,
          "replies": [
            {
              "id": "lvqw4v7",
              "author": "SolidCat1117",
              "body": "Certainly one possibility!",
              "score": 1,
              "created_utc": 1730914269.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvr14q9",
      "author": "poutineismygod",
      "body": "The best news",
      "score": 1,
      "created_utc": 1730915611.0,
      "replies": []
    },
    {
      "id": "lvr2g03",
      "author": "None",
      "body": "Compatible only with downloaded games or also cartridge’s?",
      "score": 1,
      "created_utc": 1730915971.0,
      "replies": []
    },
    {
      "id": "lvr8p3z",
      "author": "fromYYZtoSEA",
      "body": "Yuzu was released as open source software with the GPL3 license. Once an app is made available using a license like that, it’s irrevocable, at least for code that was published before it was taken down (the license literally said that). Also Nintendo can’t legally acquire the IP unless it deals with every single person who contributed to the project.\n\nWhat Nintendo did was shutting down the company that developed Yuzu. But the code that was written is still available and anyone can fork it and continue developing it.\n\n(IANAL but I have lots of experience with OSS licenses)",
      "score": 1,
      "created_utc": 1730917682.0,
      "replies": []
    },
    {
      "id": "lvrlqnd",
      "author": "buzzkillington0",
      "body": "A bigger bombshell of a news than the other one.",
      "score": 1,
      "created_utc": 1730921229.0,
      "replies": []
    },
    {
      "id": "lvrotmi",
      "author": "SmokelessSubpoena",
      "body": "I thought they weren't doing a new Switch?",
      "score": 1,
      "created_utc": 1730922067.0,
      "replies": [
        {
          "id": "lvtndzl",
          "author": "Snoo54601",
          "body": "Why lol",
          "score": 1,
          "created_utc": 1730943031.0,
          "replies": [
            {
              "id": "lvwhroo",
              "author": "SmokelessSubpoena",
              "body": "Maybe I'm recalling incorrectly but I saw a post on reddit a few months back where Nintendo was stating there wasn't a new switch on the horizon. \n\n\n\n\n\n\nBut now there is, so I'm just confused lol",
              "score": 1,
              "created_utc": 1730990221.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvrua3s",
      "author": "iwantmyduchovny",
      "body": "I would hope so.",
      "score": 1,
      "created_utc": 1730923546.0,
      "replies": []
    },
    {
      "id": "lvs2n39",
      "author": "santasbong",
      "body": "Lmao IT FUCKING BETTER BE!",
      "score": 1,
      "created_utc": 1730925835.0,
      "replies": []
    },
    {
      "id": "lvs6o9g",
      "author": "WhyAreOldPeopleEvil",
      "body": "Neat! (Continues playing Steamdeck.)",
      "score": 1,
      "created_utc": 1730926911.0,
      "replies": []
    },
    {
      "id": "lvsb7zz",
      "author": "TheOneWhoReadsStuff",
      "body": "What about my digital games?",
      "score": 1,
      "created_utc": 1730928148.0,
      "replies": []
    },
    {
      "id": "lvsmokc",
      "author": "None",
      "body": "Do we think it will be digital only for backwards or will it accept the cartridges too?",
      "score": 1,
      "created_utc": 1730931364.0,
      "replies": [
        {
          "id": "lvtn9gt",
          "author": "Snoo54601",
          "body": "It's both\n\nThey'll probably have a cartridge system like between the DS and 3ds \n\nSwitch 1 cards can fit in switch 2 but switch 2 cards can't get in switch 1",
          "score": 1,
          "created_utc": 1730942990.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvsypa8",
      "author": "aprivatedetective",
      "body": "MK8 gameplay is perfect. All they need is to polish the visuals and add more tracks forever!",
      "score": 1,
      "created_utc": 1730935021.0,
      "replies": []
    },
    {
      "id": "lvt16j6",
      "author": "Fredasa",
      "body": "At this point, Nintendo could hardly manage to release a Switch 2 that isn't inherently powerful enough to _emulate_ its predecessor.",
      "score": 1,
      "created_utc": 1730935821.0,
      "replies": []
    },
    {
      "id": "lvt7lfe",
      "author": "Myrkur21",
      "body": "That was a given though. If it didn't have backwards compatibility, then there would be a riot on their hands.",
      "score": 1,
      "created_utc": 1730937897.0,
      "replies": []
    },
    {
      "id": "lvtf1um",
      "author": "None",
      "body": "Ok thanks for the bare minimum 👍🏾",
      "score": 1,
      "created_utc": 1730940315.0,
      "replies": []
    },
    {
      "id": "lvu0cnl",
      "author": "CurveOfTheUniverse",
      "body": "Haven’t we known this for ages?",
      "score": 1,
      "created_utc": 1730947381.0,
      "replies": []
    },
    {
      "id": "lvu1uao",
      "author": "nastyLake",
      "body": "Duh",
      "score": 1,
      "created_utc": 1730947893.0,
      "replies": []
    },
    {
      "id": "lvucmmy",
      "author": "MarinatedPickachu",
      "body": "Hopefully it will be able to upscale them",
      "score": 1,
      "created_utc": 1730951856.0,
      "replies": []
    },
    {
      "id": "lvuhs4y",
      "author": "xur_ntte",
      "body": "Man this is also opening up an game pass style transition if needed",
      "score": 1,
      "created_utc": 1730953977.0,
      "replies": []
    },
    {
      "id": "lvutbg7",
      "author": "None",
      "body": "Cool",
      "score": 1,
      "created_utc": 1730959403.0,
      "replies": []
    },
    {
      "id": "lvv2kih",
      "author": "Crimson_Scare_Crow",
      "body": "The switch is now backwards compatible with… the switch! How incredible!",
      "score": 1,
      "created_utc": 1730964625.0,
      "replies": []
    },
    {
      "id": "lvw6azu",
      "author": "Particular-Jeweler41",
      "body": "I might get it in that case. Since the GBA I'd usually buy a portable console, but since there was no true portable this generation I only went with a PS5. So if I can buy a Switch 2 and play all the Switch 1 games as well, it works out better than buying both.",
      "score": 1,
      "created_utc": 1730986283.0,
      "replies": []
    },
    {
      "id": "lvy6qxo",
      "author": "BrewKazma",
      "body": "But is it physically, or digitally only?",
      "score": 1,
      "created_utc": 1731007809.0,
      "replies": []
    },
    {
      "id": "lwbeiog",
      "author": "shrlytmpl",
      "body": "Digital purchases carrying over?",
      "score": 1,
      "created_utc": 1731189788.0,
      "replies": []
    },
    {
      "id": "lwfirop",
      "author": "None",
      "body": "Nintendo sucks I haven't invested in their products in 23 years",
      "score": 1,
      "created_utc": 1731256020.0,
      "replies": [
        {
          "id": "m9v3wdh",
          "author": "RAPTURES_BOUNTY",
          "body": "Bro the Wii was good",
          "score": 1,
          "created_utc": 1738174754.0,
          "replies": [
            {
              "id": "m9v54mj",
              "author": "None",
              "body": "I committed crimes on the wii",
              "score": 1,
              "created_utc": 1738175086.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvok2e7",
      "author": "None",
      "body": "Is Nintendo confirming it will be called Switch 2? I'm not calling it that until Nintendo confirms it. Until then it's Nintendo's next device.",
      "score": 1,
      "created_utc": 1730886291.0,
      "replies": [
        {
          "id": "lvokpsd",
          "author": "Mercurial_Synthesis",
          "body": "Then you must have been talking about the Nintendo alarm clock an awful lot then as that was, until recently, Nintendo's next device.",
          "score": 4,
          "created_utc": 1730886687.0,
          "replies": [
            {
              "id": "lvqcnz5",
              "author": "None",
              "body": "No. Gaming device, fool. Their next gaming device. The successor to the Switch.",
              "score": 1,
              "created_utc": 1730909092.0,
              "replies": [
                {
                  "id": "lvqe3yi",
                  "author": "Mercurial_Synthesis",
                  "body": "That's not what you said. This is what happens when you try to be pedantic.",
                  "score": 1,
                  "created_utc": 1730909479.0,
                  "replies": [
                    {
                      "id": "lvqfdgv",
                      "author": "None",
                      "body": "It's called implying and that which you claim I'm being is an erroneous extrapolation.",
                      "score": 1,
                      "created_utc": 1730909819.0,
                      "replies": [
                        {
                          "id": "lvrac63",
                          "author": "Mercurial_Synthesis",
                          "body": "I'd say it's more a result of taking a weird, unnecessary, and entirely pedantic standing of refusing to use a common, recognisable parlance, with the term \"Switch 2.\"",
                          "score": 1,
                          "created_utc": 1730918127.0,
                          "replies": [
                            {
                              "id": "lvramkm",
                              "author": "None",
                              "body": "Well what you say is irrelevant to my life.",
                              "score": 1,
                              "created_utc": 1730918204.0,
                              "replies": [
                                {
                                  "id": "lvrb7tn",
                                  "author": "Mercurial_Synthesis",
                                  "body": "Well I'm taking up your time, so thanks for involving me in your life. I'm sure your announcement to Reddit of your refusal to use the term Switch 2 will be useful to passers by.",
                                  "score": 1,
                                  "created_utc": 1730918365.0,
                                  "replies": [
                                    {
                                      "id": "lvrblob",
                                      "author": "None",
                                      "body": "I have time to spare. You elected to involve yourself.",
                                      "score": 1,
                                      "created_utc": 1730918469.0,
                                      "replies": [
                                        {
                                          "id": "lvrbw83",
                                          "author": "Mercurial_Synthesis",
                                          "body": "Just tell me you love me and get it over with.",
                                          "score": 1,
                                          "created_utc": 1730918548.0,
                                          "replies": [
                                            {
                                              "id": "lvrc9qd",
                                              "author": "None",
                                              "body": "Goodbye fool.",
                                              "score": 1,
                                              "created_utc": 1730918651.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lvprfaw",
          "author": "UnsorryCanadian",
          "body": "I'm betting on it being called the Nintendo Switcheroo",
          "score": 1,
          "created_utc": 1730903255.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvogejh",
      "author": "good-prince",
      "body": "Good news for emulators!",
      "score": 1,
      "created_utc": 1730884124.0,
      "replies": []
    },
    {
      "id": "lvofvjq",
      "author": "TheRealDeoan",
      "body": " Nintendo just needs this….",
      "score": 1,
      "created_utc": 1730883820.0,
      "replies": []
    },
    {
      "id": "lvou6t2",
      "author": "Bfedorov91",
      "body": "What are they gonna sell with it now?!? Gonna have to actually make new games...",
      "score": 1,
      "created_utc": 1730892153.0,
      "replies": []
    },
    {
      "id": "lvpjpw8",
      "author": "Crowdfunder101",
      "body": "*technically* it says information about compatibility will be announced. So they *could* say “it’s incompatible”",
      "score": 1,
      "created_utc": 1730900961.0,
      "replies": [
        {
          "id": "lvpyz3w",
          "author": "gman5852",
          "body": "Exact words are it's compatible and more details are later, so no.",
          "score": 3,
          "created_utc": 1730905404.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpwv5o",
      "author": "EJR9090",
      "body": "Will my games transfer?!",
      "score": 1,
      "created_utc": 1730904816.0,
      "replies": [
        {
          "id": "lvpyhxt",
          "author": "gman5852",
          "body": "Like digitally? Extremely safe assumption. Nintendo announced this at an investors meeting effectively to tell them that any consumer can safely upgrade and keep their massive library that's still selling well. They don't want consumers refusing to upgrade because of fear on losing something.",
          "score": 3,
          "created_utc": 1730905270.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvq2zoj",
      "author": "Shady_Yoga_Instructr",
      "body": "If that means the Zelda games at 60fps then Day 1 buy babyyyyyyyyyyyyyyyyyy",
      "score": 1,
      "created_utc": 1730906507.0,
      "replies": []
    },
    {
      "id": "lvqcwo1",
      "author": "phenolic72",
      "body": "Please give it a better name.",
      "score": 1,
      "created_utc": 1730909157.0,
      "replies": [
        {
          "id": "lvqd42i",
          "author": "SmtyWrbnJagrManJensn",
          "body": "Super Switch could work",
          "score": 1,
          "created_utc": 1730909212.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvqnskb",
      "author": "BUNNIES_ARE_FOOD",
      "body": "Hopefully this comes out before the tariffs hit",
      "score": 1,
      "created_utc": 1730912046.0,
      "replies": []
    },
    {
      "id": "lvogf2u",
      "author": "None",
      "body": "[deleted]",
      "score": -12,
      "created_utc": 1730884132.0,
      "replies": [
        {
          "id": "lvpb0ow",
          "author": "Burgergold",
          "body": "Trump was president when Switch got released so make sense that Switch 2 get released in Trump second term /s",
          "score": 3,
          "created_utc": 1730898280.0,
          "replies": []
        },
        {
          "id": "lvoijhj",
          "author": "Strong_Mushroom_6593",
          "body": "Get a grip mate.",
          "score": -4,
          "created_utc": 1730885373.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvoqak4",
      "author": "pirate135246",
      "body": "If the switch 2 is weaker than the steam deck they are not getting my money. This company is on a slow decline.",
      "score": -8,
      "created_utc": 1730890088.0,
      "replies": [
        {
          "id": "lvot2os",
          "author": "wojar",
          "body": "you're comparing two different systems.",
          "score": 4,
          "created_utc": 1730891595.0,
          "replies": [
            {
              "id": "lvow7gt",
              "author": "diddlinderek",
              "body": "But they can both play Nintendo games …",
              "score": -6,
              "created_utc": 1730893130.0,
              "replies": [
                {
                  "id": "lvpb36w",
                  "author": "Burgergold",
                  "body": "Not legally",
                  "score": 2,
                  "created_utc": 1730898302.0,
                  "replies": []
                },
                {
                  "id": "lvpbcml",
                  "author": "Leeiteee",
                  "body": "I don't think SD will be able to play all Switch 2 games",
                  "score": 1,
                  "created_utc": 1730898386.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvor0sd",
          "author": "linuxhanja",
          "body": "Why so negative? Why are you here? The OG switch is a garbage mobile chipset thats only advatage is air circulation. We all loved the games. Enjoy things. Life is amazing. Do you like nintendo games? If yes buy the switch 2. If you've had enough mario and zelda, then dont buy it. I bought an xbox one x for 4k r3d dead 2, and let me tell you, i couldnt get into it. And i couldnt drive myself to play any of the other xbox games i bought. Theyre all loot box stuff now or dlc a thons. I entered this gen upset with nintendo but nintendo showed us its about the game, not the system.",
          "score": 2,
          "created_utc": 1730890503.0,
          "replies": [
            {
              "id": "lvovyu2",
              "author": "1997PRO",
              "body": "Buy a Dreamcast and play unreleased Half Life port.",
              "score": 2,
              "created_utc": 1730893017.0,
              "replies": [
                {
                  "id": "lvq1u2t",
                  "author": "linuxhanja",
                  "body": "I had a dc, great system. Saw a vid on that port awhile ago. I will have to look it up. Unfortunately, lost all my disc based systems to a hurricane + flood 20 years ago. Only things that survived were my house & my cartridges + cart systems. Any electronic with moving part was gone.",
                  "score": 1,
                  "created_utc": 1730906193.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvojggy",
      "author": "LocalOk136",
      "body": "Łaski nie robi.",
      "score": 0,
      "created_utc": 1730885925.0,
      "replies": []
    },
    {
      "id": "lvoqkkp",
      "author": "VirtuaFighter6",
      "body": "Smart",
      "score": 0,
      "created_utc": 1730890249.0,
      "replies": []
    },
    {
      "id": "lvp6du6",
      "author": "None",
      "body": "It's good Nintendo confirmed it, but there was no doubt the successor would support the Switch.\n\nMy concern is if the Switch 2 will be using a new cartridge design, as the Nintendo DS did at launch with GB games. Until the new format took over in sales was when Nintendo quietly removed the feature.\n\nI do not want this history to repeat itself. I am not repurchasing the 120+ Switch games I have just because Nintendo changed the design of its physical media.\n\nThis is exactly the reason I walked away from the DS years ago. Once my backward compat DS finally kicked the bucket, I had no console to play my library of GB games.\n\nIt was easier to just sell everything and leave Nintendo.\n\nGranted, the Switch brought me back because of its flexibility between portability and home use, but we're all screwed if Switch 2 uses a new cart format.",
      "score": 0,
      "created_utc": 1730896755.0,
      "replies": [
        {
          "id": "lvpgzr2",
          "author": "efffffff_u",
          "body": "That’s pretty weird given that you are an obvious PlayStation fan and they have the worst backwards compatibility of them all 🤷‍♂️",
          "score": 1,
          "created_utc": 1730900139.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvqvuk4",
      "author": "ForQ2",
      "body": "I hope they *don't* end up calling it the \"Switch 2\". They assumed that people would realize that the Wii U was a successor to the Wii, but vast numbers of people assumed that it was some sort of accessory rather than a next-gen console.",
      "score": 0,
      "created_utc": 1730914192.0,
      "replies": [
        {
          "id": "lvtnl93",
          "author": "Snoo54601",
          "body": "Nah switch 2 is easier to understand \n\nIt's the same naming convention Sony been using forever and it works just fine",
          "score": 1,
          "created_utc": 1730943095.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvr3a43",
      "author": "ThatDudeJuicebox",
      "body": "Ok now give us 4k and real graphics and not from the GameCube era",
      "score": 0,
      "created_utc": 1730916203.0,
      "replies": []
    },
    {
      "id": "lvugkne",
      "author": "None",
      "body": "backwards compatibility isn't enough. What I actually want are performance upgrades for switch games, like what sony and microsoft has done. Playing switch games with the same ass performance would be incredibly underwhelming for shiny new hardware. No mention of that is concerning, but fingers crossed.",
      "score": 0,
      "created_utc": 1730953473.0,
      "replies": []
    },
    {
      "id": "lvuk6fr",
      "author": "Vulpes_macrotis",
      "body": "Every device should be compatible with every predecessor ever made and I'm tired of pretending it shouldn't. Every single game on PSX, PS2, PS3 and PS4 should be playable without issues on PS5. Same with any Nintendo game on any newer console. What? That's impossible? Well, somehow I can do that on PC. I want to play a game from '00s, I can. No need for pretending that it's not doable. It is, it's just that companies earn billions for not doing this. And people buy that bullshit.",
      "score": 0,
      "created_utc": 1730955008.0,
      "replies": [
        {
          "id": "lvuv68i",
          "author": "EpicRive",
          "body": "The only reasonable omission for Sony is the PS3, and to a lesser extent, PS2, both of these consoles have very bizarre architectures which make them hard to emulate to this day, so they can't really promise blanket compatibility with the library across the board. That being said, the vast majority of PS2 games now can be emulated mostly with minor to no issues, and near perfect PS3 emulation should be possible in the near future once PS consoles have enough threads and power to brute force the emulation of the Cell",
          "score": 2,
          "created_utc": 1730960397.0,
          "replies": [
            {
              "id": "lvvtlkz",
              "author": "Meckles94",
              "body": "Just from your comment, in a dumb person capacity. Nintendo and the likes are easier to emulate compared to Sony.",
              "score": 0,
              "created_utc": 1730981089.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvo9f8l",
      "author": "Shakes-Fear",
      "body": "Always the way with Nintendo, support for the previous generation.",
      "score": -15,
      "created_utc": 1730880494.0,
      "replies": [
        {
          "id": "lvoa7uk",
          "author": "Bobbler23",
          "body": "That is not true at all. Your Wii U discs aren't fitting in any Switch are they?\nWhere's the N64 cart slot on a Gamecube?",
          "score": 12,
          "created_utc": 1730880849.0,
          "replies": [
            {
              "id": "lvoarug",
              "author": "safer_than_ever",
              "body": "They really dropped the ball when I found out NES cartridges dont fit on the Switch. #WorstConsoleIEverOwned",
              "score": 16,
              "created_utc": 1730881103.0,
              "replies": []
            },
            {
              "id": "lvokod0",
              "author": "fatmustardcheese",
              "body": "Tbf, N64 to Gamecube was a complete format change in a time when back compat wasn't as big, and the Switch felt like Nintendo trying to forget the previous 6 years and reset.",
              "score": 4,
              "created_utc": 1730886663.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvokmct",
      "author": "_stinkys",
      "body": "The mad lads actually did it! They’ll have emulators to run their emulators.",
      "score": -1,
      "created_utc": 1730886628.0,
      "replies": []
    },
    {
      "id": "lvor199",
      "author": "65Terbium",
      "body": "If this is true I will buy it immediatly.",
      "score": -1,
      "created_utc": 1730890510.0,
      "replies": []
    },
    {
      "id": "lvpuva9",
      "author": "robocopsdick",
      "body": "Hilarious how everyone always wanted this but now it’s fucking newer gen games from ever getting created. Can’t wait to buy this and play games that are optimized for Switch 1 the entire lifecycle.",
      "score": -1,
      "created_utc": 1730904250.0,
      "replies": []
    },
    {
      "id": "lvqlyx9",
      "author": "AUkion1000",
      "body": "And it will probably be slightly more powerful for 2x the cost\nWhat a bargain",
      "score": -1,
      "created_utc": 1730911568.0,
      "replies": []
    },
    {
      "id": "lvoqgoo",
      "author": "False-Leg-5752",
      "body": "Which basically means this is a cash play and not many new games will be coming out. Just new hardware",
      "score": -4,
      "created_utc": 1730890186.0,
      "replies": []
    },
    {
      "id": "lvoo7h1",
      "author": "Swallagoon",
      "body": "No shit.",
      "score": -2,
      "created_utc": 1730888829.0,
      "replies": []
    },
    {
      "id": "lvoyhql",
      "author": "D0nCoyote",
      "body": "My Steam Deck is backwards compatible with Switch games as well if I want it to be",
      "score": -2,
      "created_utc": 1730894008.0,
      "replies": [
        {
          "id": "lvpsanj",
          "author": "rea1l1",
          "body": "Now the question is... are switch 2 games effectively switch 1 games with more hardware requirements or software locks.",
          "score": 1,
          "created_utc": 1730903510.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvpftov",
      "author": "delinais",
      "body": "And they'll still probably have performance issues. Unless Nintendo ups their hardware game I'm still out.\n\nPokemon on switch was terrible recently. Convinced me I'm not paying for another experience like that again.",
      "score": -2,
      "created_utc": 1730899782.0,
      "replies": []
    },
    {
      "id": "lvppj22",
      "author": "Remarkable-Dig-1241",
      "body": "Why are they acting like they are releasing a new console? It's legitimately just an upgrade. Literally everyone expected Backwards compatibility...",
      "score": -2,
      "created_utc": 1730902699.0,
      "replies": [
        {
          "id": "lvpyuwa",
          "author": "gman5852",
          "body": "An upgrade is a new console? \n\nThis is an investors meeting so of course they'll mention it?",
          "score": 1,
          "created_utc": 1730905372.0,
          "replies": [
            {
              "id": "lvq3rnp",
              "author": "Remarkable-Dig-1241",
              "body": "Do you do Groceries when you reheat your leftovers? Because this is like saying \"Don't worry people, you will not need to go buy groceries when you reheat your food\" and acting like this is some PSA or something. Does the PS5 pro have to tell you that it can also play PS5 games?  Consoles used to radically change from generation to generation, this is for all intents and purposes a hardware bump. Last time i checked i didn't need to rebuy new games after i upgraded my graphics card...",
              "score": -1,
              "created_utc": 1730906717.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvoetd5",
      "author": "FeedbackBoth6035",
      "body": "Did they confirm the backwards compatibility to say that it is still ok to buy the old console before they announce the new, because switch sales are falling?🤔",
      "score": -3,
      "created_utc": 1730883218.0,
      "replies": []
    },
    {
      "id": "lvozquk",
      "author": "jamster126",
      "body": "Thank God!! Was genuinely worried about this. Nintendo don't usually allow this.",
      "score": -4,
      "created_utc": 1730894443.0,
      "replies": [
        {
          "id": "lvtob7k",
          "author": "Snoo54601",
          "body": "They literally almost always do",
          "score": 1,
          "created_utc": 1730943329.0,
          "replies": [
            {
              "id": "lvvc2fz",
              "author": "jamster126",
              "body": "No they don't. GameCube was not. And the switch was not backwards compatible more importantly.",
              "score": 1,
              "created_utc": 1730970736.0,
              "replies": [
                {
                  "id": "lvvcc1e",
                  "author": "Snoo54601",
                  "body": "\"almost\" \n\nNo shit GameCube and switch weren't dawg \n\nThey use a whole entire different support than their predecessor 😭 \n\nGood luck jamming a wii u disc in your switch",
                  "score": 1,
                  "created_utc": 1730970914.0,
                  "replies": [
                    {
                      "id": "lvvez35",
                      "author": "jamster126",
                      "body": "Wii-U had a digital store also \"dawg\". They could have easily let you have kept your digital games. And they could have built an external disc drive for physical games that people could buy if they wish.\n\nBut instead of opting in for backwards compatibility they said no and they would just re-sell you all the Wii u games for full price again. \n\nSo they didn't set a good precedent this generation for what they might do for switch 2. I am glad they have decided to keep backwards compatibility.",
                      "score": 1,
                      "created_utc": 1730972676.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvokhtk",
      "author": "Dave-James",
      "body": "Of course it will. This is going to be GameCube-Wii level of advancement… aka “none except for some stupid gimmick” with an identical off the shelf chipset that someone can easily download a schematic of any/all changes and build out the chipset in software emulation for the rest of us to have (since “real Nintendo consoles” won’t support native 4K until 8K is standard…)\n\nTheir fate as an “also console” was sealed by these stupid tiny-disc/forced motion/giant touchscreen tablet/another tablet gimmicks instead of just making a proper console capable of displaying at the native resolution of the most common television sold in 2024… (they didn’t even have an HD console til almost a decade after HD standardization…)\n\nCongrats MS and Sony. They’re continuing to shoot themselves in the foot for you as an “afterthought” that people MIGHT GET after their “real console”, just to play those little Mario and newly woke Zelda games (and then they remake “Zelda’s Adventure” from the 90’s and call it “Echoes of Wizdum” and people think they’re “so creative” for making a game Philips already did…\n\nNinten? Don’t.",
      "score": -14,
      "created_utc": 1730886552.0,
      "replies": [
        {
          "id": "lvongy6",
          "author": "Timlugia",
          "body": "Why would you care? If you don’t like its spec just move on. It’s like attacking Honda doesn’t make hyper luxury cars.",
          "score": 2,
          "created_utc": 1730888377.0,
          "replies": [
            {
              "id": "lvr0l8v",
              "author": "Rekadra",
              "body": "More like Honda is making a new car, but you find out it's only a new revision.\n\nThe person could be upset because they like Honda and were interested in their new line of cars",
              "score": 1,
              "created_utc": 1730915467.0,
              "replies": [
                {
                  "id": "lvr18in",
                  "author": "Timlugia",
                  "body": "And that's not far off from actual Honda, hence the comparison.\n\nI owned multiple gen of CRV, they were really incremental improvements from the previous gen.\n\nPlus op doesn't seem to like Nintendo to begin with, considering they were using the derogatory terms on popular Nintendo titles.",
                  "score": 1,
                  "created_utc": 1730915639.0,
                  "replies": [
                    {
                      "id": "lvrenre",
                      "author": "Rekadra",
                      "body": "Unless you're saying Honda never release new generations, then I don't see how you're using this explanation to dismiss my point\n\nEither way, Nintendo does release new generations and this person is simply expressing their disappointment that it is simply an incremental improvement. What's wrong with that?",
                      "score": 1,
                      "created_utc": 1730919291.0,
                      "replies": [
                        {
                          "id": "lvrgj0d",
                          "author": "Timlugia",
                          "body": "You clearly missed their second half comments\n\n>just to play those little Mario and newly woke Zelda games (and then they remake “Zelda’s Adventure” from the 90’s and call it “Echoes of Wizdum”\n\nI think OP just didn't like Nintendo to begin with, just using Switch2 as an excuse to rant. That's why they got so many downvoted rather than about still unknown spec on Switch2. \n\nThey were also factually wrong, how is recent Zelda even considered as woke? And how is EoW any related to Zelda's Adventure?\n\nAgain, if they hate Nintendo titles so much, why even bother? Their past video game comments were all critical at Nintendo consoles specs. Just go get the console or PC they want. They are just not Nintendo/Switch's targeting audience. That's why I said why look for luxury car in a Honda?",
                          "score": 1,
                          "created_utc": 1730919798.0,
                          "replies": [
                            {
                              "id": "lw51iq6",
                              "author": "Rekadra",
                              "body": "They aren't looking for a luxury car from Honda. They're looking for the new generation of car. That's the point I just made.\n\nI don't think that you can say they are factually wrong about such a subjective opinion, and even so I don't really have much interest in discussing that. We were more having a discussion about the Nintendo's direction particularly relating to hardware and implementation of software\n\nFor example, would you be just as offended at a person asking more than the Wii? They aren't the target audience. They might hate all the Wii iterations of Nintendo properties but believe they still have potential with better hardware and  leadership, etc.",
                              "score": 1,
                              "created_utc": 1731097987.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}