{
  "post": {
    "title": "Atari releases Asteroids watches for game's 45th anniversary – they're already sold out | They have a unique way of showing the time",
    "author": "chrisdh79",
    "id": "1id2ic1",
    "score": 1154,
    "created_utc": 1738179490.0,
    "selftext": "",
    "num_comments": 95,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1id2ic1/atari_releases_asteroids_watches_for_games_45th/"
  },
  "comments": [
    {
      "id": "m9vmxbb",
      "author": "rostoffario",
      "body": "Oh man, I'd love to have one of these, but not even for $499. I'd pay maybe $125 for it.",
      "score": 202,
      "created_utc": 1738179929.0,
      "replies": [
        {
          "id": "m9vpmbg",
          "author": "i_need_a_moment",
          "body": "It could literally just be an app or watch face on already existing smart watches.",
          "score": 139,
          "created_utc": 1738180665.0,
          "replies": [
            {
              "id": "m9vsofh",
              "author": "rostoffario",
              "body": "I'd rather have it as a mechanical watch, rather than a smart watch.",
              "score": 51,
              "created_utc": 1738181512.0,
              "replies": [
                {
                  "id": "m9vxz3r",
                  "author": "throw69420awy",
                  "body": "They may have assumed, like I did, that these could actually run a playable game rather than just having the aesthetic \n\nI agree",
                  "score": 31,
                  "created_utc": 1738182959.0,
                  "replies": []
                },
                {
                  "id": "m9x6lrj",
                  "author": "Uhdoyle",
                  "body": "Fuck yeah Mechanical Asteroids",
                  "score": 14,
                  "created_utc": 1738195668.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9zftp9",
              "author": "bunkSauce",
              "body": "It's not digital",
              "score": 5,
              "created_utc": 1738229487.0,
              "replies": []
            },
            {
              "id": "ma0dsu1",
              "author": "SonicDethmonkey",
              "body": "And literally dead in 10 of years. No thanks, mechanical all the way.",
              "score": 2,
              "created_utc": 1738245733.0,
              "replies": []
            },
            {
              "id": "ma9sgvu",
              "author": "None",
              "body": "Just wait a couple of months and you can buy a knockoff on Alibaba for $80. I have several nearly undetectable luxury watches from them.",
              "score": 0,
              "created_utc": 1738360535.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9vz5vw",
          "author": "pdxgod",
          "body": "I was sold… then saw the price… no app for the iwatch?",
          "score": 10,
          "created_utc": 1738183277.0,
          "replies": []
        },
        {
          "id": "ma08mzv",
          "author": "skothu",
          "body": "Well what if I discount it from its original price of…. One MILLION DOLLARS!\n\n![gif](giphy|PPi5c8l8WDY7if1L8z|downsized)",
          "score": 9,
          "created_utc": 1738243912.0,
          "replies": [
            {
              "id": "ma0jry6",
              "author": "rostoffario",
              "body": "LOL!",
              "score": 2,
              "created_utc": 1738247708.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9x1hxd",
          "author": "ThinkExtension2328",
          "body": "I mean you get a sapphire lens within a stainless-steel case. \n\nThe sapphire is worth some money the steel not so much but the price seems to actually be fair. Electronics + sapphire screen on a watch does equate to about 380$ add the branding tax and 499$ seems like a fair price to acquire. \n\n\nNot that I’d want one.",
          "score": 8,
          "created_utc": 1738194060.0,
          "replies": [
            {
              "id": "m9ym68s",
              "author": "HoovyBear",
              "body": "Its automatic, so all mechanical.",
              "score": 6,
              "created_utc": 1738213310.0,
              "replies": [
                {
                  "id": "m9yo3j7",
                  "author": "ThinkExtension2328",
                  "body": "Even better , definitely worth the cost",
                  "score": 2,
                  "created_utc": 1738214137.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9z8wdo",
              "author": "Abigail716",
              "body": "My husband restores watches as a hobby, the sapphire crystals are only about $5 each when buying them in sets of 20. You can get them individually for about $8.\n\nThe strap is going to run you another $5. Not sure about the movement cost but individually those are going to run about $30 including free shipping, so presumably the price will plummet fast if you're buying them in bulk.\n\nThe case itself is going to very significantly depending on quality, what you're looking at anywhere between $10 and $40 depending on the quality for an individual case including shipping. These look like a pretty basic design so I'm going to guess they're on the lower end of that scale. \n\nI would say approximately $60 to $70 to make each watch. Depending on how they got the movement to work that could add significant costs, so another $20 to play it safe and you have a watch that costs no more than $90 to make on the high end. You could achieve this price as long as you're making at least five since custom dials often have a minimum quantity order of around that much. \n\nThey made hundreds between all of the colorways, so I would be shocked If this thing is over $60 plus the cost of the Watch box.",
              "score": 11,
              "created_utc": 1738225093.0,
              "replies": [
                {
                  "id": "ma0ghul",
                  "author": "dws7447887",
                  "body": "Does your husband sell his restored watches?",
                  "score": 1,
                  "created_utc": 1738246646.0,
                  "replies": [
                    {
                      "id": "ma0ozmw",
                      "author": "Abigail716",
                      "body": "Only when he decides he doesn't like them. They're usually restored to be added to his own personal collection. Most of what he actually sells is stuff that he didn't do very well, and he would rather just get rid of it and try again. He will also sell watches that he restored just to practice his technique. \n\nThe only time he ever does really paying work is for servicing or repairing Patek watches. He attended their watchmaking school and in order to stay in their good graces he'll do work for them on occasion.",
                      "score": 2,
                      "created_utc": 1738249352.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9z9409",
                  "author": "ThinkExtension2328",
                  "body": "Yea that’s perfectly awesome if your a watch maker , most people don’t want to mess with that stuff. As your well aware your husband has allot of specialised equipment to build watches. For most people that means something that won’t scratch by simple daily use.",
                  "score": -3,
                  "created_utc": 1738225222.0,
                  "replies": [
                    {
                      "id": "ma13bux",
                      "author": "None",
                      "body": "I don’t think that was the point they were making?",
                      "score": 7,
                      "created_utc": 1738253555.0,
                      "replies": [
                        {
                          "id": "ma2mwpf",
                          "author": "ThinkExtension2328",
                          "body": "It misses the point that for the end user it’s still a huge value add, if you seriously think you can do what a watch maker does and they are “scamming you” power to you. But you’re significantly undervaluing their work skills and equipment.",
                          "score": -3,
                          "created_utc": 1738268888.0,
                          "replies": [
                            {
                              "id": "mayg0ga",
                              "author": "thehatteryone",
                              "body": "No one's saying \\*we\\* can make an equivalent watch for $50.  But they are showing a watch manufacturer absolutely can, and all the tools easily amortise over the thousands/millions of items made with them.  I can't make a smartphone with a $50 BOM, it'd cost me untold fortunes - that doesn't mean that phone should be more then $150 retail.",
                              "score": 1,
                              "created_utc": 1738690760.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9zmj1u",
                      "author": "lickmylog",
                      "body": "What a great point. The price point must be much higher for a business manufacturing these in larger volumes. It's not fair to compare it with the expertise of a hobbyist and the price points available to them.",
                      "score": 1,
                      "created_utc": 1738233596.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9zb6o6",
          "author": "godlessLlama",
          "body": "I’d prob pay 200 if I was a huge fanboy, loved the Atari and the game so yeah I’d pay 90 for myself and accept it as a gift for 125",
          "score": 1,
          "created_utc": 1738226529.0,
          "replies": []
        },
        {
          "id": "m9yr8ar",
          "author": "None",
          "body": "These aren’t intended for you :/",
          "score": -1,
          "created_utc": 1738215549.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9vm5jx",
      "author": "None",
      "body": "1100 euros? Lmao",
      "score": 60,
      "created_utc": 1738179718.0,
      "replies": [
        {
          "id": "ma5dgkp",
          "author": "Alucard661",
          "body": "It’s an automatic movement. Not that crazy",
          "score": 1,
          "created_utc": 1738300968.0,
          "replies": [
            {
              "id": "ma73wrc",
              "author": "Ab47203",
              "body": "I can get an automatic self winding watch for under $100 you're just entirely wrong on this point",
              "score": 2,
              "created_utc": 1738332774.0,
              "replies": [
                {
                  "id": "ma78ir3",
                  "author": "Alucard661",
                  "body": "Just because you can get one at that price doesn’t mean that’s what it should cost I can also get a automatic for 150,000 doesn’t mean I expect it to be 150,000\n\nI just paid $250 for an automatic bottom of the barrel seiko, and I was thinking of upping it to a $500 Hamilton khaki those are bottom tier entry level automatic watches.",
                  "score": 2,
                  "created_utc": 1738334304.0,
                  "replies": [
                    {
                      "id": "ma80mdx",
                      "author": "Ab47203",
                      "body": "$1100 for a watch made of materials grown in a lab is a ripoff. Sapphire is no more difficult to manufacture than quartz. Why is that a price hike then? Marketing. Automatic movements are no longer expensive to manufacture. Why is there a second price hike? Again. Marketing. Humans have a demonstrable effect of seeing expensive things as higher quality whether they actually are or not. \n\n£1100 is just asinine for a watch of this caliber. Other expensive watches are adorned with natural gems and precious metals. What is the ACTUAL justification for this high price other than \"We wanted money.\"",
                      "score": 2,
                      "created_utc": 1738342530.0,
                      "replies": [
                        {
                          "id": "ma871ir",
                          "author": "Alucard661",
                          "body": "This is the stupidest reply I’ve seen in a while I’m done arguing with you.",
                          "score": 0,
                          "created_utc": 1738344311.0,
                          "replies": [
                            {
                              "id": "ma87j3s",
                              "author": "Ab47203",
                              "body": "\"I have no way to argue against anything you said so I'm just gonna insult you and leave.\" K. Bye.",
                              "score": 2,
                              "created_utc": 1738344446.0,
                              "replies": [
                                {
                                  "id": "ma88oy5",
                                  "author": "Alucard661",
                                  "body": "Why do things people want cost money? I can make this in 5 minutes! Bro just say it’s too expensive for you and move on. This watch is priced correctly based on the materials and movement of you don’t think so that’s on you dont buy it. The fact that it sold out proves it was marketed right and priced correctly or maybe even too low.",
                                  "score": 1,
                                  "created_utc": 1738344767.0,
                                  "replies": [
                                    {
                                      "id": "ma8a6en",
                                      "author": "Ab47203",
                                      "body": "$60 in materials being marked up to £1100 for no reason other than marketing. If me calling that out is enough to make you start calling people stupid then you seem like an incredibly petty person. Why does it bother you I don't like seeing people getting ripped off? This watch doesn't have features watches at the £1100 price range should have. If the original price wasn't asinine then why did they discount it to less than HALF immediately? It's the same shit that the polystone statues were. They marketed so hard people didn't realize they're essentially just epoxy resin marked up hundreds of dollars because of marketing. \n\nIf it bothers you that I call a rip off a rip off then move on. If not then explain why this watch has so many markers of a scam stuck onto it.",
                                      "score": 2,
                                      "created_utc": 1738345180.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9x7rf8",
      "author": "RChamy",
      "body": "> It's not immediately obvious how wearers are supposed to read the time displayed on the watches.\n\nInner UFO is hours\n\nOuter UFO minutes\n\nIts just very cluttered",
      "score": 17,
      "created_utc": 1738196034.0,
      "replies": []
    },
    {
      "id": "m9wkfbi",
      "author": "CoffeeTeaPeonies",
      "body": "I would totally buy this but at Swatch Watch prices.\n\n$500?! SWEETBABYCHEEZITS!",
      "score": 26,
      "created_utc": 1738188994.0,
      "replies": [
        {
          "id": "m9xg0vf",
          "author": "Known_Turn_8737",
          "body": "They’ll probably resell for $2-3k. \n\nBelieve it or not that’s relatively entry level for manual watches, but agree these are closer to Swatch levels in terms of their internals.",
          "score": 15,
          "created_utc": 1738198647.0,
          "replies": [
            {
              "id": "ma1d8de",
              "author": "TheBoBiZzLe",
              "body": "And the people that buy them have probably never even played Asteroids.  The “look at me and subscribe” gamers",
              "score": 0,
              "created_utc": 1738256319.0,
              "replies": []
            },
            {
              "id": "m9y0k8d",
              "author": "clorox2",
              "body": "Resell for $2-$3k. Snort. Chortle. \n\nWait a few months and get one off eBay for $50.",
              "score": -8,
              "created_utc": 1738205306.0,
              "replies": [
                {
                  "id": "m9y967o",
                  "author": "Future-Turtle",
                  "body": "As someone who collects both wristwatches and videogames, that has close to a 0% chance of happening. Listing for $2-3k is not unreasonable, thought i think most of them will move aftermarket for somewhere between $750-$1500",
                  "score": 12,
                  "created_utc": 1738208262.0,
                  "replies": [
                    {
                      "id": "m9yln28",
                      "author": "RezLifeGaming",
                      "body": "It was discounted from $1650 sold out after that",
                      "score": 2,
                      "created_utc": 1738213082.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9vwsx7",
      "author": "None",
      "body": "[deleted]",
      "score": 34,
      "created_utc": 1738182640.0,
      "replies": [
        {
          "id": "m9wev21",
          "author": "badguy84",
          "body": "I thought it was ridiculous initially, because it kind of looks like it's just a screen. But given that it's an actual watch with proper watch mechanisms it seems really reasonable given the craftsmanship and the limited run.",
          "score": 9,
          "created_utc": 1738187470.0,
          "replies": [
            {
              "id": "m9x1p0p",
              "author": "ThinkExtension2328",
              "body": "Add to that it’s got a sapphire screen which is awesome the price seems fair.",
              "score": 1,
              "created_utc": 1738194122.0,
              "replies": [
                {
                  "id": "ma746zq",
                  "author": "Ab47203",
                  "body": "So do most iPhones. It's lab grown ridiculously easily.",
                  "score": 1,
                  "created_utc": 1738332872.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ma00gww",
          "author": "hyperforms9988",
          "body": "People who are into watches are getting a very hard dose of reality right now.  And I say that as somebody with 8 watches.  The general public is never, EVER, going to give a shit about this stuff.  They see an expensive watch and they laugh.  Nobody, **nobody**, outside of watch snobs gives a shit about \"the caliber of the movement\", or \"oh it's more expensive because it's mechanical instead of quartz\".  Does it tell the time, yes or no?  That's what most people care about, and that's what makes most people laugh at most watches when they look at their prices.  That's all that's going on here.\n\nLike anything else outside of watches, this is a limited run of something and it's going to come at a higher cost than normal because of it and/or the brand.  It's going to either have to mean something to you as a watch collector, or as somebody that really likes Atari/Asteroids.  That's about it... I can't see it having any appeal whatsoever to any other person.  People will spend the money if they think it's worth it.  You can call it a cash grab and I don't know that I would disagree with that, but on some level, most watches period are a cash grab as it's a fashion item/jewelry.",
          "score": 7,
          "created_utc": 1738240706.0,
          "replies": [
            {
              "id": "ma0duol",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1738245751.0,
              "replies": [
                {
                  "id": "ma0rkvy",
                  "author": "hyperforms9988",
                  "body": "I don't claim to know how watches get made or what the markups are, but most mechanical watches practically start at $500 if you're looking at the big brands.  I know there are exceptions, but they're probably extreme exceptions (and I wouldn't count sales as that's \"cheating\").  I don't know *why* that is... either there's some cost that nobody is factoring in, or everybody that makes a watch has just agreed that this is the way pricing should be.\n\nMechanical watches are typically for enthusiasts.  There's no real function of value to them for the average consumer.  Quartz is way cheaper, and ironically enough is more accurate at telling time too if you get one with a good movement.  Watch enthusiasts just like the idea of the machinery inside of a mechanical watch.  The \"craftsmanship\", the history, blah blah blah.  It's kind of like people who pay a lot of money for art.  Quartz is mass-produced shit and mechanical watches are for people that really love the smell of their own farts (I kid, but I sometimes wonder about the attitude around the two).  Maybe the only real advantage of mechanical on a technical level is that there's no battery involved, so one watch could last and function for generations.\n\nIf I go on the Tissot website for instance, a Tissot PRX goes for $525 Canadian.  A Tissot PRX Powermatic 80 goes for $975.  The difference?  One's quartz and one's mechanical.  Explain that difference to me because it doesn't make any sense, and it will never make sense to the average person.  I think technically the Powermatic has an anti-reflective coating on the glass/crystal... but besides that, I think it's literally the same watch beyond the movement difference between mechanical and quartz.  Is that really a $450 difference in parts?  Bullshit, but that's typically the way that goes for quartz vs mechanical and that's typically what you're going to find on the market.  Not *every* case, but somehow, it's the case most of the time for any reputable brand or microbrand.\n\nIt might be because nobody is mass-producing mechanical watches on such a level that the savings in cost for hyper-bulk manufacturing just isn't there for them so they're inherently expensive for that reason?  I'm not sure.  I'd like to believe it's not just an entire class of watch that exists to price-gouge people who care about craftsmanship, history, the idea of what a mechnical watch is, etc... but maybe the answer really is that simple.",
                  "score": 1,
                  "created_utc": 1738250145.0,
                  "replies": [
                    {
                      "id": "ma16w0p",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1738254557.0,
                      "replies": [
                        {
                          "id": "ma1arqs",
                          "author": "hyperforms9988",
                          "body": "I said most, not all.  Mechanical watches tend to be priced higher than quartz watches.  I suspect, movement and everything that goes into it aside, that's because there's no inherent value to a mechanical watch to most people versus a quartz watch.  If you really care about a mechanical watch, chances are you're caring about it for artistic reasons and/or for longevity reasons.  Those types of folks probably aren't buying $120 mechanicals... yeah, you can probably find them, but that's not where most of that market is.  Thus again, I question whether that whole thing is largely based around price-gouging people who care about what a mechanical represents versus the actual cost of making one because the pricing and pricing differences you see largely don't make any sense.\n\nTissot's a fun example because those are 2 watches that are nearly identical to each other, but one's a quartz and the other is mechanical.  If you don't like Tissot... then Hamilton?  The Khaki Field Quartz 38mm is $540.00 Canadian.  The Khaki Field Mechanical 38mm is $800.  Again... like, wtf?  There are minor differences between them, but that amount of money in difference?",
                          "score": 2,
                          "created_utc": 1738255640.0,
                          "replies": [
                            {
                              "id": "ma1mcux",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1738258835.0,
                              "replies": [
                                {
                                  "id": "ma1pjor",
                                  "author": "hyperforms9988",
                                  "body": "I hope so regarding quartz watches.  It's so senseless.  Not to shit on people that like mechanicals but when what you're selling me is something I have to hand-wind to keep going... which means I have to constantly have it powered or literally set the time almost every time I wear one before I go out of the house, it keeps time less accurately compared to a quartz, and it costs more, it's like... why?  I'm not saying mechanical watches should die off, but it's almost like on paper, the really cheap watches should be mechanicals... and instead it seems to be the other way around.\n\nThere's a whole market of people out there, and I don't want to use \"fashion watch\" as a term for it because that has negative connotations associated with watches that are garbage all around and are built entirely on their marketing campaigns and shit, that see these things as jewelry and fashion, and care far more about how they look than they do about a $400 movement being in one that they will never actually see or look at.  Put that money into the fucking case, the strap/band, the clasp, the dial, the hands, etc... not the thing that nobody actually sees.  Good quality workhorse movement at a good price and not the \"Rolls Royce\" of movements.\n\nI'm not shitting on enthusiasts who do care about movements, but it's kind of like... how come we don't have economy cars that look like $100,000 sports cars?  Can I get the body without the fucking expensive engine with all the horsepower that I'm never going to use because I'm not planning on ever going to a racing track?  Why doesn't that exist?  Same for watches.  Different product altogether, but same overall idea.",
                                  "score": 0,
                                  "created_utc": 1738259702.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ma743cj",
          "author": "Ab47203",
          "body": "Automatic movements aren't high price anymore. The sapphire was 100% lab grown in the same way phone screens are. The last point you made is accurate and makes sense though.",
          "score": 1,
          "created_utc": 1738332838.0,
          "replies": []
        },
        {
          "id": "m9z9r5q",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1738225628.0,
          "replies": [
            {
              "id": "ma87xgt",
              "author": "AlbiFoxtrot",
              "body": "Hey could you shoot me a dm of the company your husband likes so I can look into them too?",
              "score": 1,
              "created_utc": 1738344555.0,
              "replies": [
                {
                  "id": "ma89r8o",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1738345063.0,
                  "replies": [
                    {
                      "id": "ma8aqs0",
                      "author": "AlbiFoxtrot",
                      "body": "Thank you! Sounds about par for shopping on AliExpress so I'll do some research before buying.",
                      "score": 1,
                      "created_utc": 1738345336.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9vshtt",
      "author": "predictingzepast",
      "body": "Neat until you look at the price..",
      "score": 12,
      "created_utc": 1738181462.0,
      "replies": [
        {
          "id": "m9vtjdu",
          "author": "KittenTripp",
          "body": "or try telling the actual time on it...",
          "score": 9,
          "created_utc": 1738181749.0,
          "replies": [
            {
              "id": "m9weyw9",
              "author": "Ok_Relative_5783",
              "body": "It explained in the article how to read time on it but I still can't read the time on it.",
              "score": 7,
              "created_utc": 1738187498.0,
              "replies": [
                {
                  "id": "m9xapii",
                  "author": "GibsMcKormik",
                  "body": "The center ship is seconds. The inner ring is min and the ufo is the hand. The outer ring is the hour and uses the same ufo indicator.",
                  "score": 2,
                  "created_utc": 1738196962.0,
                  "replies": [
                    {
                      "id": "ma0j2z6",
                      "author": "Funksultan",
                      "body": "You have it backwards.  The inner UFO is hours, the outer is minutes.... just like any clock/watch.",
                      "score": 2,
                      "created_utc": 1738247480.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9wy9cr",
                  "author": "Cendyan",
                  "body": "Right. Inner ring with smaller blue asteroids hour hand?  Outer ring, big green asteroids, minute hand? Ok if so, which asteroid do you use for which?",
                  "score": 1,
                  "created_utc": 1738193055.0,
                  "replies": [
                    {
                      "id": "m9x1g49",
                      "author": "grendelone",
                      "body": "The entire ring rotates, so it doesn't matter which part of the ring you use as a reference point as long as you always use the same one. Given the design, it's probably easiest to spot the UFO on each ring. But again, you could use any reference point you wanted.",
                      "score": 3,
                      "created_utc": 1738194045.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9w07pb",
      "author": "AtariXL",
      "body": "Tempest 2000 music unlocked a 30 year old memory, but I'll wait for the Steam Watch, thanks.",
      "score": 3,
      "created_utc": 1738183557.0,
      "replies": []
    },
    {
      "id": "m9vn85p",
      "author": "ZimaGotchi",
      "body": "I really like cellulose handed \"mystery dial\" type watches but the popularity doesn't justify some of these prices. Mr Jones is like *the* maker who exemplifies this current design trend and their watches are much less. There's also a Chinese manufacturer Time Essence that sells these type of watches for $20.",
      "score": 9,
      "created_utc": 1738180010.0,
      "replies": [
        {
          "id": "m9xj28s",
          "author": "None",
          "body": "[removed]",
          "score": 1,
          "created_utc": 1738199620.0,
          "replies": [
            {
              "id": "m9xotia",
              "author": "ZimaGotchi",
              "body": "They're all too small for me unfortunately. It's like they think the only people who want to have fun are women and children",
              "score": 1,
              "created_utc": 1738201478.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9wgb0g",
      "author": "SnagglepussJoke",
      "body": "It looks fun.",
      "score": 2,
      "created_utc": 1738187857.0,
      "replies": []
    },
    {
      "id": "m9xtvyz",
      "author": "LordByronsCup",
      "body": "This has got to be better than those Preparation H Hemorrhoids watches.",
      "score": 2,
      "created_utc": 1738203118.0,
      "replies": []
    },
    {
      "id": "m9zfvks",
      "author": "MetaVaporeon",
      "body": "i'd hate to have to read time off of that",
      "score": 1,
      "created_utc": 1738229520.0,
      "replies": []
    },
    {
      "id": "m9zt0iz",
      "author": "Strict-Background-23",
      "body": "Best I can do is three fiddy\n\n![gif](giphy|RQ1gQt69dgzwhOmON0)",
      "score": 1,
      "created_utc": 1738237213.0,
      "replies": []
    },
    {
      "id": "ma0jea8",
      "author": "HaggisMcD",
      "body": "I had an Asteroids watch from Fossil that I loved. You couldn’t play on it but it looked like the original arcade game. Never worked right after I replaced the battery unfortunately.",
      "score": 1,
      "created_utc": 1738247584.0,
      "replies": []
    },
    {
      "id": "ma13vtv",
      "author": "corrector300",
      "body": "$500 I'm kinda glad they're sold out so I don't have to ponder how I'd afford one.",
      "score": 1,
      "created_utc": 1738253712.0,
      "replies": []
    },
    {
      "id": "ma15v26",
      "author": "GrayDaysGoAway",
      "body": "Imagine paying hundreds of dollars just to look like the most turbo nerd that ever turbo nerded.",
      "score": 0,
      "created_utc": 1738254269.0,
      "replies": [
        {
          "id": "ma1p1u5",
          "author": "readyforadirtnap",
          "body": "Hahahahaha.. turbo nerd.",
          "score": 2,
          "created_utc": 1738259567.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9zutqc",
      "author": "TensionWarm1936",
      "body": "Only a mug would pay that much for this to go in their collection with their Moonswatch.",
      "score": 0,
      "created_utc": 1738238116.0,
      "replies": []
    },
    {
      "id": "ma0j8hd",
      "author": "BlackBricklyBear",
      "body": "This should have been made into a smartwatch face, frankly.",
      "score": 0,
      "created_utc": 1738247531.0,
      "replies": []
    },
    {
      "id": "m9z3huj",
      "author": "None",
      "body": "LOL...what a rip off for a cheap ass watch.",
      "score": -1,
      "created_utc": 1738221882.0,
      "replies": []
    },
    {
      "id": "m9z8avx",
      "author": "Subway",
      "body": "Got one with a coupon code for 250.- :-)",
      "score": -1,
      "created_utc": 1738224730.0,
      "replies": [
        {
          "id": "ma04o06",
          "author": "yoguckfourself",
          "body": "Which code? How did you get it before they sold out?",
          "score": 2,
          "created_utc": 1738242416.0,
          "replies": [
            {
              "id": "ma0tqoq",
              "author": "Subway",
              "body": "It was posted in the comments on a blog (local Switzerland) that reported on the watch. Lucky to have read the comments first as I already had the watch in the cart.",
              "score": 2,
              "created_utc": 1738250792.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9vxwes",
      "author": "None",
      "body": "[deleted]",
      "score": -11,
      "created_utc": 1738182939.0,
      "replies": [
        {
          "id": "m9w1fts",
          "author": "SQL617",
          "body": "It’s a hobby, like any other. Watches make up a $103Bn industry globally, all replaced by a “phone app” or a $2 watch. A fool and his money can literally be said about any other hobby, including yours.",
          "score": 9,
          "created_utc": 1738183879.0,
          "replies": [
            {
              "id": "m9w37rc",
              "author": "None",
              "body": "[deleted]",
              "score": -5,
              "created_utc": 1738184349.0,
              "replies": [
                {
                  "id": "m9wtxiz",
                  "author": "turtledancers",
                  "body": "Opinion with no critical thinking behind it. Like you’re farting out your mouth",
                  "score": 4,
                  "created_utc": 1738191737.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ma14ywv",
      "author": "Top-Gas-8959",
      "body": "1,650??? Discounted to 499?!?!?!\n\n![gif](giphy|QA6TZLe75gU2GFC6Qs|downsized)",
      "score": -2,
      "created_utc": 1738254018.0,
      "replies": []
    },
    {
      "id": "m9yhe9g",
      "author": "None",
      "body": "$500 for a watch is a scam. This is a scam.",
      "score": -11,
      "created_utc": 1738211352.0,
      "replies": [
        {
          "id": "m9yuvwz",
          "author": "ArdillasVoladoras",
          "body": "$500 is pretty cheap for a mechanical watch",
          "score": 3,
          "created_utc": 1738217293.0,
          "replies": [
            {
              "id": "ma0534n",
              "author": "None",
              "body": "Yeah if you have more money then sense lol",
              "score": 0,
              "created_utc": 1738242581.0,
              "replies": [
                {
                  "id": "ma0588c",
                  "author": "ArdillasVoladoras",
                  "body": "Mad at people spending money how they want?",
                  "score": 2,
                  "created_utc": 1738242635.0,
                  "replies": [
                    {
                      "id": "ma05i3d",
                      "author": "None",
                      "body": "No just mad that people fall for this shit lol, it's a piece of metal and plastic on your fucking wrist, it shouldn't be $500 lol",
                      "score": 0,
                      "created_utc": 1738242740.0,
                      "replies": [
                        {
                          "id": "ma0ercd",
                          "author": "ArdillasVoladoras",
                          "body": "Watches are by and large jewelry, there's always a markup. \"Piece of metal and plastic\" is underselling how durable modern mechanical watches are though.",
                          "score": 2,
                          "created_utc": 1738246066.0,
                          "replies": [
                            {
                              "id": "ma0evem",
                              "author": "None",
                              "body": "Doesn't matter, it's a waste of resources and money.",
                              "score": 1,
                              "created_utc": 1738246105.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ma0egoh",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1738245964.0,
              "replies": [
                {
                  "id": "ma0htma",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1738247073.0,
                  "replies": [
                    {
                      "id": "ma0nw4v",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1738249014.0,
                      "replies": [
                        {
                          "id": "ma0vvre",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1738251416.0,
                          "replies": [
                            {
                              "id": "ma14rpc",
                              "author": "Abigail716",
                              "body": "Actually no, the Rolex markup is lower. A standard datejust is $7,800 and is around $1,200 to make. That's a x6.3 markup. This watch is a 8.3x markup. \n\nI never said it was overpriced. The market is never wrong, since people bought it at that price It was correctly priced. I'm just saying it's marked up significantly higher than comparable watches there's a difference between being unfairly priced and overpriced.",
                              "score": 2,
                              "created_utc": 1738253963.0,
                              "replies": [
                                {
                                  "id": "ma157rs",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 2,
                                  "created_utc": 1738254088.0,
                                  "replies": [
                                    {
                                      "id": "ma17obp",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 1,
                                      "created_utc": 1738254779.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9z3c61",
          "author": "Santa__Christ",
          "body": "you're not too bright huh",
          "score": 2,
          "created_utc": 1738221791.0,
          "replies": [
            {
              "id": "ma05bpk",
              "author": "None",
              "body": "How does this have anything to do with my intelligence, it's a piece of metal and plastic that is strapped to your wrist, nothing like that should be $500",
              "score": -1,
              "created_utc": 1738242672.0,
              "replies": [
                {
                  "id": "ma0boza",
                  "author": "Santa__Christ",
                  "body": "Lol, keep digging that hole",
                  "score": 1,
                  "created_utc": 1738245002.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}