{
  "post": {
    "title": "Lack Of Interest In The PS5 Pro Is Forcing Scalpers To Sell Them For A Loss",
    "author": "a_Ninja_b0y",
    "id": "1gomy7l",
    "score": 5557,
    "created_utc": 1731310780.0,
    "selftext": "",
    "num_comments": 416,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gomy7l/lack_of_interest_in_the_ps5_pro_is_forcing/"
  },
  "comments": [
    {
      "id": "lwjssvr",
      "author": "HeftyArgument",
      "body": "hahahahahaha suck shit assholes!\n\nI hope nobody buys them from you and you’re stuck with the bag.",
      "score": 1699,
      "created_utc": 1731311213.0,
      "replies": [
        {
          "id": "lwjzxio",
          "author": "techieman33",
          "body": "Hopefully supplies are high enough to get Sony through the holiday season. If they get short in December then the scalpers might still come out ahead.",
          "score": 290,
          "created_utc": 1731316003.0,
          "replies": [
            {
              "id": "lwk60el",
              "author": "XTornado",
              "body": ">  If they get short in December then the scalpers might still come out ahead. \n\nI doubt it, I feel Sony themselves were a bit over their head, I am sure they sell but not crazy with that price. Specially for people who want to continue with physical games.\nPlus most of the really interested people will have it already.",
              "score": 142,
              "created_utc": 1731320175.0,
              "replies": [
                {
                  "id": "lwk83wj",
                  "author": "xRyozuo",
                  "body": "Wait does the ps5 have no disc option?",
                  "score": 22,
                  "created_utc": 1731321587.0,
                  "replies": [
                    {
                      "id": "lwk9eux",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 101,
                      "created_utc": 1731322421.0,
                      "replies": [
                        {
                          "id": "lwkg1kx",
                          "author": "Kumirkohr",
                          "body": "Huh, you’d think that between a base model and the “Pro” model that the base model would be the one without the disc drive",
                          "score": 63,
                          "created_utc": 1731326310.0,
                          "replies": [
                            {
                              "id": "lwl1skp",
                              "author": "rebbsitor",
                              "body": "The original PS5 you can buy with or without a disc drive. Sony's been reporting a drop in physical media sales every year as people opt more and more for digital. \n\nWith the PS5 Pro, they're just selling one model and letting people buy the add on disc drive they already sell for the digital only PS5 if they want it.",
                              "score": 33,
                              "created_utc": 1731335562.0,
                              "replies": [
                                {
                                  "id": "lwoacz3",
                                  "author": "andDevW",
                                  "body": "Dip in first sales of new discs. For all anyone knows disc resale is booming like never before while Sony and game studios just aren't benefitting from it. Physical media with built-in licenses will be the death of game consoles as it puts them at a tremendous disadvantage to PC gaming which is zero resale one-per-customer.",
                                  "score": 6,
                                  "created_utc": 1731372704.0,
                                  "replies": []
                                },
                                {
                                  "id": "lwlxak3",
                                  "author": "Kramer7969",
                                  "body": "Yes we’re opting for it, it’s not the fact that the disc just unlocks the download anyway and you can’t play directly if the disc most cases.",
                                  "score": 10,
                                  "created_utc": 1731345700.0,
                                  "replies": [
                                    {
                                      "id": "lwmqqjz",
                                      "author": "Derpwarrior1000",
                                      "body": "Tbf, imagine 160gb uncompressed games on CD-ROM. Since USB has taken over there’s been little need to upgrade the read/write of most optical discs to match modern gaming standards",
                                      "score": 8,
                                      "created_utc": 1731354658.0,
                                      "replies": [
                                        {
                                          "id": "lwn9p0n",
                                          "author": "FilthyCasual04",
                                          "body": "Rightfully so, it’s a superior medium.\nI’d love official game usb sticks",
                                          "score": 21,
                                          "created_utc": 1731360445.0,
                                          "replies": [
                                            {
                                              "id": "lwo3cnq",
                                              "author": "mccoyn",
                                              "body": "They're called cartridges.",
                                              "score": 7,
                                              "created_utc": 1731370241.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "lwobwm3",
                                              "author": "UnsealedLlama44",
                                              "body": "I used to think we would have movies on USB sticks before streaming became a thing",
                                              "score": 1,
                                              "created_utc": 1731373247.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lwnx91h",
                                      "author": "thisisredlitre",
                                      "body": "Honestly I primarily use the drivr for a Blu-ray player so not having a disc drive is a knock against buying one for me",
                                      "score": 5,
                                      "created_utc": 1731368093.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "lwo3is4",
                                      "author": "Deltahotel_",
                                      "body": "You mean there’s like nothing on the disc and you’re just downloading and storing and running the data off the drive?",
                                      "score": 1,
                                      "created_utc": 1731370300.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lwoewwh",
                                  "author": "mattmaster68",
                                  "body": "“People don’t want discs anymore!” - Sony probably \n\nNo, the games we want to play aren’t on disc! >:(",
                                  "score": 1,
                                  "created_utc": 1731374318.0,
                                  "replies": []
                                },
                                {
                                  "id": "lwv28y4",
                                  "author": "F1incy",
                                  "body": "But Sony and Microsoft want us to buy digital. Because then they dictate the price.\n\nYou can still get things on sale for a discount, but if you buy and play a single player game at full price, and then trade it to gamestop/EB games, someone else buys it for half its original retail value. You repeat that process; finish it, trade it in, someone else buys it. 3 people have just played that game for the full retail price in Sony's eyes. Means less money in their pocket.\n\nSo in the end, of course they want to push digital. Because it keeps more money in their pockets.",
                                  "score": 1,
                                  "created_utc": 1731468764.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lwl4wk2",
                              "author": "walrusbwalrus",
                              "body": "Exactly. Why I’m not bothering to update right now since my standard ps5 is also my main media player and we are coming up to xmas season which is always a lot of movies in my house. I gotta have my muppet christmas carol!",
                              "score": 23,
                              "created_utc": 1731336662.0,
                              "replies": [
                                {
                                  "id": "lwl9j6l",
                                  "author": "Kumirkohr",
                                  "body": "I’ve got a hand-me-down PS4 with a broken internal disc drive. Found that out the hard way when I picked up a physical copy of *Young Frankenstein* from the local library (can’t get it on streaming anywhere) to watch on Halloween because my fiancé had never seen it before. \n\nWound up having to use an old external disc drive I bought for my MacBook in college a decade ago and it would not work on anything else except her work machine, a giant iMac she had to carry home on the subway. It all worked out, but it would have been better if we could watch it on the TV",
                                  "score": 6,
                                  "created_utc": 1731338232.0,
                                  "replies": [
                                    {
                                      "id": "lwla3s4",
                                      "author": "walrusbwalrus",
                                      "body": "That sounds super annoying but absolutely worth the pain, if for nothing other than Putting on the Ritz!",
                                      "score": 7,
                                      "created_utc": 1731338419.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "lwlru6x",
                                      "author": "i_am_fear_itself",
                                      "body": "this is why people pirate stuff (a dig at media companies, not the commenter above)",
                                      "score": 4,
                                      "created_utc": 1731344016.0,
                                      "replies": [
                                        {
                                          "id": "lwlsnvi",
                                          "author": "Kumirkohr",
                                          "body": "I know, I’ve just been squeamish about that stuff ever since I killed the family desktop in middle school trying to watch *Doctor Who*",
                                          "score": 3,
                                          "created_utc": 1731344266.0,
                                          "replies": [
                                            {
                                              "id": "lwlv42t",
                                              "author": "Dr_Cleanser",
                                              "body": "Technology is so hit or miss. \n\nI remember in the 90’s it took me like 8 hours to download a Green Lantern wallpaper off of Cartoon Network.com using dial up.\n\nFun times.",
                                              "score": 2,
                                              "created_utc": 1731345028.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "lwovzxv",
                                              "author": "walrusbwalrus",
                                              "body": "Weeping angels still give me nightmares. I feel your pain.",
                                              "score": 1,
                                              "created_utc": 1731380470.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "lwlahbg",
                                      "author": "Taste-T-Krumpetz",
                                      "body": "Young Frankenstein is on Vudu/Fandago NOW.",
                                      "score": 1,
                                      "created_utc": 1731338542.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "lwnq5hh",
                                      "author": "beren12",
                                      "body": "Plex or jellyfin, a vpn, and some hdd space.",
                                      "score": 1,
                                      "created_utc": 1731365657.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "lwous08",
                                  "author": "Kredstarr2020",
                                  "body": "My favourite is that Muppet one where they all show up to (I think) Fozzies grandmas and there’s Sesame Street, muppet show and Fraggles and the Swedish chef gets excited to cook Big Bird lol",
                                  "score": 1,
                                  "created_utc": 1731380027.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lwkfjcd",
                          "author": "idontknow39027948898",
                          "body": "For seven hundred dollars, you would think that you would be getting all of the options included.",
                          "score": 5,
                          "created_utc": 1731326036.0,
                          "replies": [
                            {
                              "id": "lwkj8d2",
                              "author": "StrategicBlenderBall",
                              "body": "Well, then they wouldn’t be options.",
                              "score": 1,
                              "created_utc": 1731327945.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lwk9njj",
                          "author": "xRyozuo",
                          "body": "That makes 0 sense. So basically if you have no internet because it went out, the ps5 is useless",
                          "score": 1,
                          "created_utc": 1731322570.0,
                          "replies": [
                            {
                              "id": "lwkag3i",
                              "author": "XTornado",
                              "body": "The other comment didn't explain it too well.\n\nThe earliest PS5, there were two models, PS5 with disk and PS5 digital. \n\nThen they came up with something else, which is the same, but instead the base hardware is the same, the disk drive it's in a way that it can be installed by the user.\n\nIf you buy the PS5 slim model, basically is that but with included disk already installed (or at least included on the box).\nIf you buy the digital is the same hardware but without the disk installed, but if you want, you can buy the disk drive down the line and install it.\n\nThe PRO, same but they don't sell one mode/version with disk drive included, there is one model, without disk drive included, if you want disk you buy it separately. At 119$ or so... which adds up to the already expensive pro model.\nI personally got it, because I was lucky getting a 30th anniversary.... but yeah financially doesn't makes sense.\n\nRegardless, regarding the internet thing, to install a disk drive you need to update/activate online I think so... at least for that you will need it, and also I am not so sure how well it works the console even with disks without connecting it to internet from time to time...\n\nAlso if the internet goes out, even digital can be played, up to certain point as it needs to revalidate the license at some point.",
                              "score": 10,
                              "created_utc": 1731323060.0,
                              "replies": []
                            },
                            {
                              "id": "lwksx4n",
                              "author": "thelingeringlead",
                              "body": "You literally cannot play a game from a disc on any current gen console, without internet to download the rest of the files and update it. The discs are only useful at this point, for used game sales since technically the disc acts as your license/product key. You  cannot play a PS5 game from it's disc right out of the package.",
                              "score": 6,
                              "created_utc": 1731332184.0,
                              "replies": [
                                {
                                  "id": "lwmh8ph",
                                  "author": "microbit262",
                                  "body": "They could just start selling USB dongles with the licences on them like for expensive business software then. Saves all the optical drive stuff.",
                                  "score": 4,
                                  "created_utc": 1731351765.0,
                                  "replies": [
                                    {
                                      "id": "lwn9pvr",
                                      "author": "billbixbyakahulk",
                                      "body": "It's the collectors. They're the ones who don't want discs to go away. They're very fickle, too - even something like switching to a usb stick would probably set them off. Regardless, since there's a market, Sony will sell to them.",
                                      "score": 1,
                                      "created_utc": 1731360453.0,
                                      "replies": [
                                        {
                                          "id": "lwnww1i",
                                          "author": "yoniyuri",
                                          "body": "They could still have the stick in a case like Switch games.",
                                          "score": 2,
                                          "created_utc": 1731367963.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lwo4qum",
                                  "author": "pholan",
                                  "body": "It’s true you can’t play directly from the disc; the game has to copy to internal storage first. You can absolutely install and play many games without internet access. Without internet, you just end up with whatever version shipped on the disc, bugs and all. The only single-player games that should require internet to install are those that didn’t fit on the disc.",
                                  "score": 1,
                                  "created_utc": 1731370733.0,
                                  "replies": []
                                },
                                {
                                  "id": "lwkupwa",
                                  "author": "xRyozuo",
                                  "body": "Last I played on a console it was the ps2.\n\nThe fact that they’re getting rid of discs is such a tragedy for budget gamers",
                                  "score": 2,
                                  "created_utc": 1731332890.0,
                                  "replies": [
                                    {
                                      "id": "lwkygwe",
                                      "author": "thelingeringlead",
                                      "body": "They effectively got rid of discs being a useful medium to run games off of during the PS4/Xbox One generation. They finally quit pretending near the end of the life cycle and with this current Gen I'm almost positve discs are pratically ceremonial at this point, there isn't disc out there that could store the amount of data that modern games take up.",
                                      "score": 4,
                                      "created_utc": 1731334335.0,
                                      "replies": [
                                        {
                                          "id": "lwlph7l",
                                          "author": "_RADIANTSUN_",
                                          "body": "That's literally only true for a couple of games that have poor optimization for storage space e.g. COD games that download all the languages together.\n\nCurrently UHD BDs store like 60GB, triple layer can hold like 100GB.\n\nThere are like 8 games on PS5 that couldn't fit on a triple layer BD (Horizon forbidden West is technically 101 GB so let's just call it borderline (it \"could be made to fit\") and most of them are due to similar issues like like huge uncompressed audio files for different languages and stuff like that. \n\nIn truth most of these games don't need that big file sizes, but since they're no longer limited to discs, they now can afford to be storage-inefficient because the impetus just gets placed in the player (\"get a bigger SSD\").",
                                          "score": 2,
                                          "created_utc": 1731343290.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "lwkvqaz",
                                  "author": "None",
                                  "body": "Literally?",
                                  "score": 0,
                                  "created_utc": 1731333282.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "lwkoyk9",
                              "author": "PageOthePaige",
                              "body": "You can still play all your games without internet.",
                              "score": 2,
                              "created_utc": 1731330556.0,
                              "replies": [
                                {
                                  "id": "lwmj9mj",
                                  "author": "Suckage",
                                  "body": "Depends.. If you have zero internet access, then you can’t use the Pro.\n\nThe setup for the external disc drive includes verifying that it’s the official one, and that verification is done server-side.",
                                  "score": 3,
                                  "created_utc": 1731352382.0,
                                  "replies": [
                                    {
                                      "id": "lwmjkd1",
                                      "author": "PageOthePaige",
                                      "body": "Yes. You need Internet to use the device. You don't need constant, or even frequent or good, internet.",
                                      "score": 2,
                                      "created_utc": 1731352472.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lwkaef8",
                              "author": "None",
                              "body": "Digital games only need internet for installation. You can play your games offline. This isn't a PC with always online DRMs. \n\n\nOnly issue you will suffer from is fixed prices (physical copies are cheaper than their digital counterparts) and delisted games won't be playable on a digital only console but you can still play your delisted games from the disc assuming the game had a physical release.",
                              "score": 1,
                              "created_utc": 1731323032.0,
                              "replies": [
                                {
                                  "id": "lwl28an",
                                  "author": "rebbsitor",
                                  "body": "> delisted games won't be playable on a digital only console\n\nDelisted games can't be purchased, but if you own them you can play them or redownload them.",
                                  "score": 6,
                                  "created_utc": 1731335720.0,
                                  "replies": [
                                    {
                                      "id": "lwl4gq8",
                                      "author": "None",
                                      "body": "Yes that's what I meant. But like if you buy a digital xbox. You won't be able to play orange box on it but you can play it if you got a physical xbox since you can just insert the disc inside.",
                                      "score": 2,
                                      "created_utc": 1731336510.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lwlmh6j",
                              "author": "codywater",
                              "body": "Games don’t run off of the discs anymore. The disc serves as a validation mechanism, then the actual game is downloaded to the system. Many games have live content or require a live connection regardless of whether you own the physical or digital version.",
                              "score": 1,
                              "created_utc": 1731342362.0,
                              "replies": [
                                {
                                  "id": "lwnfjel",
                                  "author": "xRyozuo",
                                  "body": "I know I run into that bullshit in some pc games too. I guess in my mind there is an expectation that there are certain single player games that should always be plug and play.",
                                  "score": 1,
                                  "created_utc": 1731362235.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lwnqrzo",
                          "author": "SwarthyRuffian",
                          "body": "I wonder how much I could sell a used disc drive for lol",
                          "score": 1,
                          "created_utc": 1731365863.0,
                          "replies": []
                        },
                        {
                          "id": "lwpr6vf",
                          "author": "catsrcool89",
                          "body": "Not in the us.",
                          "score": 1,
                          "created_utc": 1731395489.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lwl915d",
                      "author": "Halcyon520",
                      "body": "Also no stand to set it up vertically 😅",
                      "score": 3,
                      "created_utc": 1731338067.0,
                      "replies": []
                    },
                    {
                      "id": "lwm84ez",
                      "author": "Wojtas_",
                      "body": "You have to purchase the drive separately. Which pushes the price even further up.",
                      "score": 1,
                      "created_utc": 1731348995.0,
                      "replies": []
                    },
                    {
                      "id": "lwrh3j6",
                      "author": "Newtons2ndLaw",
                      "body": "Sony is trying to turn off as many users as possible.",
                      "score": 1,
                      "created_utc": 1731426354.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwlebap",
                  "author": "cloversfield",
                  "body": "idk they said it had more preorders than the ps4 pro so it sounds like it’s doing really well",
                  "score": 1,
                  "created_utc": 1731339792.0,
                  "replies": [
                    {
                      "id": "lwlgt1i",
                      "author": "XTornado",
                      "body": "Still some of those will be scalpers...\nBut I admit it was just a feeling I have not real data.",
                      "score": 1,
                      "created_utc": 1731340580.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwmiemb",
                  "author": "None",
                  "body": "After the announcement of you no longer own your games, i have no idea how you guys own anything but physical copies.",
                  "score": 1,
                  "created_utc": 1731352121.0,
                  "replies": [
                    {
                      "id": "lwndiom",
                      "author": "XTornado",
                      "body": "But you don't own them either physically, much else nowadays with current consoles. That is still a license.\n\nNevertheless-less I am a physical games guy, but let 's be honest that is ending sooner than later.",
                      "score": 1,
                      "created_utc": 1731361613.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwmmg0o",
                  "author": "cronoes",
                  "body": "Everything about the Pro appeals to people who would have bought mid to high end PCs, but didnt want to abandon the Sony ecosystem just yet. \n\nThat isnt a lot of people.",
                  "score": 1,
                  "created_utc": 1731353349.0,
                  "replies": []
                },
                {
                  "id": "lwq28ut",
                  "author": "Kopie150",
                  "body": "Also considering physical versions are by far the most Cost effective. Psn versions of games are still €60 while i can't even find a new disc version above €30 for a lot of games",
                  "score": 1,
                  "created_utc": 1731402916.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwm1f7b",
              "author": "BasedBeazy",
              "body": "Right now Pros may not be in store but you can order and get it in about 1-3 days, stock has been steady and I can pick up a console at a store after a 15 min drive where I live, I think stock will be available",
              "score": 1,
              "created_utc": 1731346963.0,
              "replies": []
            },
            {
              "id": "lwnhtn1",
              "author": "ponziacs",
              "body": "The pro is a niche item I bet a lot of kids don’t even know about. We have a PS5 and I don’t even think my kids know there is a pro model.",
              "score": 1,
              "created_utc": 1731362952.0,
              "replies": []
            },
            {
              "id": "lwpkkzr",
              "author": "sceadwian",
              "body": "I'm not entirely sure why there is essentially no compelling reason to purchase it.",
              "score": 1,
              "created_utc": 1731391576.0,
              "replies": []
            },
            {
              "id": "lwlfsf4",
              "author": "fanatic26",
              "body": "That would mean there are enough people stupid enough to buy such a pointless upgrade. A fool and his money are soon  parted. Either from the manufacturer or a scalper, dumb people will dumb.",
              "score": -3,
              "created_utc": 1731340261.0,
              "replies": [
                {
                  "id": "lwltcvv",
                  "author": "derintrel",
                  "body": "Didn’t Sony just announce that they are selling ahead of the PS4 Pro was selling in the same timeframe?",
                  "score": 2,
                  "created_utc": 1731344483.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwk3e6n",
          "author": "alexefy",
          "body": "You’d think scalpers would be terminally online. They didn’t do the bare minimum research to see the demand just wouldn’t be there. The pro is an extremely niche product that had a lukewarm reception at best. The ps4 pro didn’t do massive numbers either.",
          "score": 33,
          "created_utc": 1731318405.0,
          "replies": [
            {
              "id": "lwklmpz",
              "author": "newsflashjackass",
              "body": "> You’d think scalpers would be terminally online. \n\nIf scalpers were intelligent they could contribute something of value to society instead of behaving like landlords.",
              "score": 43,
              "created_utc": 1731329089.0,
              "replies": [
                {
                  "id": "lwln8ur",
                  "author": "ACBluto",
                  "body": "Naw, at least landlords can serve a purpose. Renting is a valid housing strategy for many people - either because they will be living in an area for a short term, because they prefer to maintain mobility, or because the day to day cost of renting is less than house ownership. You need landlords to allow for renters. There are predatory landlords, but the very fact of being a landlord does not make you wrong \n\nNo one needs a scalper. They are nothing but vultures. But the best solution to scalpers comes from the manufacturing side - stop with the scarcity. Ensure supply is appropriate to demand, and there is no market for scalpers.",
                  "score": 7,
                  "created_utc": 1731342600.0,
                  "replies": [
                    {
                      "id": "lwmd5zv",
                      "author": "pt-guzzardo",
                      "body": "> stop with the scarcity\n\n\"Oh gosh, why didn't we think of that. We can just stop having scarcity.\" -- manufacturers",
                      "score": 5,
                      "created_utc": 1731350528.0,
                      "replies": [
                        {
                          "id": "lwmzmml",
                          "author": "ACBluto",
                          "body": "I know, some of it is genuine shortages. But there is a lot of artificial and purposefully manufactured scarcity today - it is a driver of engagement. People rush out to buy things they think are going to be scarce.. even if otherwise they would wait to buy.\n\nBut not everything has to be that way:\n\nOne example I can think of is Garth Brooks. He knows he sells out arenas. Scalpers were making an absolute mint off of him. So he books a venue, it it sells out immediately, he adds another show, and then another. Even in smaller markets, he will play 4-5 shows back to back. Sometimes 2 a day. Pretty much everyone who wants to go will.",
                          "score": 4,
                          "created_utc": 1731357383.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lwlywuf",
                      "author": "newsflashjackass",
                      "body": "> No one needs a scalper. They are nothing but vultures.\n\nMakes me wonder how society would function if we woke up tomorrow and all the landlords had disappeared.",
                      "score": 2,
                      "created_utc": 1731346197.0,
                      "replies": []
                    },
                    {
                      "id": "lwm62tn",
                      "author": "djk29a_",
                      "body": "The justifications I see from scalpers isn’t that different from what I see from people in HFT. Using some small set of numbers and metrics while ignoring the externalities which is precisely the problem that no system (nope, not even socialism, sorry) has solved and that everyone being critical of said activity or institution is talking about whether it’s Big Tech, Big Pharma, Big Oil, or even Big Government.",
                      "score": 2,
                      "created_utc": 1731348372.0,
                      "replies": []
                    },
                    {
                      "id": "lwndoou",
                      "author": "billbixbyakahulk",
                      "body": "> Ensure supply is appropriate to demand\n\nLOL there are PhDs right at this very moment trying to figure that out so they don't over/under order materials, manufacturing, tooling, distribution and people to run all of it. Cause when you seriously blow it, you have ET for the Atari 2600. \n\nScalpers are never going away. They only thing you can control when it comes to scalpers is *your own choice* to pay their vig to get that thing NOW NOW NOW MINE MINE MINE I DESERVE IT I DON'T WANT TO BE LAST FOMO FOMO FOMO!!!",
                      "score": 1,
                      "created_utc": 1731361665.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwmq4fm",
                  "author": "FoolOnDaHill365",
                  "body": "There are so many industries and business that thrive off the market like this and profit being a middle man. Scalpers are just the one that is obvious.",
                  "score": 1,
                  "created_utc": 1731354473.0,
                  "replies": []
                },
                {
                  "id": "lwlnkyd",
                  "author": "challengeaccepted9",
                  "body": "Hey, if you're a good landlord, you're continuously working to keep the property maintained.\n\n\nNo element of being a scalper requires any work beyond buying something cheap and then selling it for a rip-off price.\n\n\n(Also, there'll always be people who want to rent rather than own - maybe they're not sure on the area they've moved to yet, maybe they want the freedom to move around etc - so even if the housing crisis was fixed overnight, people would still want landlords.\n\n\nNobody wants scalpers except the scalpers themselves.)",
                  "score": -2,
                  "created_utc": 1731342704.0,
                  "replies": [
                    {
                      "id": "lwlymbp",
                      "author": "newsflashjackass",
                      "body": "> Hey, if you're a good landlord, you're continuously working to keep the property maintained.\n\nYeah, and good cops don't spoil the bunch. Theoretically speaking.",
                      "score": 4,
                      "created_utc": 1731346106.0,
                      "replies": [
                        {
                          "id": "lwm1l2g",
                          "author": "challengeaccepted9",
                          "body": "Yes. In both professions there are good examples and bad examples, well done.",
                          "score": -1,
                          "created_utc": 1731347012.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwk73d1",
          "author": "explosiv_skull",
          "body": "I mean, if it's at a discount...",
          "score": 5,
          "created_utc": 1731320905.0,
          "replies": []
        },
        {
          "id": "lwkh5l0",
          "author": "Akaonisama",
          "body": "If they hold onto them long enough, they’ll make a profit like 30 years from now. I’m sure they could sell them for a pretty penny unopened lol",
          "score": 2,
          "created_utc": 1731326895.0,
          "replies": []
        },
        {
          "id": "lwmg7dd",
          "author": "FullAzan",
          "body": "I can't recall if it was earlier this year or late last year, but after letting my kids shop for some toys and checking out, we saw a guy trying to return six or seven of the base consoles at a Walmart. I don't usually delight in people's misfortune, but it felt good watching the older gentleman at the returns counter tell him no repeatedly. \n\n\nThat's a lot of money he invested, you know ~ and now he's stuck with it. Poor guy... lol",
          "score": 2,
          "created_utc": 1731351449.0,
          "replies": []
        },
        {
          "id": "lwm0jvg",
          "author": "SHADOWSTRIKE1",
          "body": "The article is clickbait.  They aren’t selling at a loss.  \n\nEven the auction they mentioned in the article as “going for $560” is now up to $770 (above retail) and still has several days left.\n\nI don’t like scalpers either, but this article has no substance.",
          "score": 1,
          "created_utc": 1731346696.0,
          "replies": []
        },
        {
          "id": "lwmhlcp",
          "author": "artraeu82",
          "body": "I walked into a Best Buy and got one on release day so I can’t see people buying over retail, and next shipments come this week.",
          "score": 1,
          "created_utc": 1731351872.0,
          "replies": []
        },
        {
          "id": "lwn5u9l",
          "author": "Imapatriothurrrdurrr",
          "body": "The 30th anniversary edition is for sale on eBay for 3,800 dollars lol. Get fucked.",
          "score": 1,
          "created_utc": 1731359272.0,
          "replies": []
        },
        {
          "id": "lwngcqt",
          "author": "Aware_Material_9985",
          "body": "Shit if it were me, I would hang onto them until the tariffs kick in and undercut that price to sell all mine for a slight gain",
          "score": 1,
          "created_utc": 1731362487.0,
          "replies": [
            {
              "id": "lwngtom",
              "author": "HeftyArgument",
              "body": "Scalpers playing the long game knowing trump will shoot all of their dead bags to the moon.\n\nIt all makes sense now.",
              "score": 1,
              "created_utc": 1731362634.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwrjsw4",
          "author": "None",
          "body": "Supplyside fuckrags",
          "score": 1,
          "created_utc": 1731427209.0,
          "replies": []
        },
        {
          "id": "lwmnzz5",
          "author": "Eurynom0s",
          "body": "They'll be able to flip them once the tariffs raise the MSRP price. Assuming Sony didn't just go with this batshit pricing so that it was free profit if Harris won, tariffs already baked in if Trump won.",
          "score": 1,
          "created_utc": 1731353824.0,
          "replies": []
        },
        {
          "id": "lwk9uta",
          "author": "pukem0n",
          "body": "Nobody is buying those available in stores, so why would anyone buy from scalpers? Supply outstrips demand, so this is a bad item to scalp.",
          "score": -1,
          "created_utc": 1731322695.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwjs9au",
      "author": "chibiace",
      "body": "let me find my tiny violin.",
      "score": 949,
      "created_utc": 1731310859.0,
      "replies": [
        {
          "id": "lwjzxhu",
          "author": "Fushigibama",
          "body": "![gif](giphy|KZSUN7FKBZrm2WHDdX|downsized)",
          "score": 192,
          "created_utc": 1731316003.0,
          "replies": [
            {
              "id": "lwk0q2w",
              "author": "TheGenericMun",
              "body": "Needs to be smaller",
              "score": 24,
              "created_utc": 1731316549.0,
              "replies": [
                {
                  "id": "lwk194b",
                  "author": "Fushigibama",
                  "body": "![gif](giphy|CLbGZ9GQbaznhqjRkE)",
                  "score": 38,
                  "created_utc": 1731316916.0,
                  "replies": []
                },
                {
                  "id": "lwki5h4",
                  "author": "MrHedgehogMan",
                  "body": "https://i.redd.it/58lbkbq0ynn61.jpg",
                  "score": 20,
                  "created_utc": 1731327400.0,
                  "replies": [
                    {
                      "id": "lwkmrjj",
                      "author": "TheGenericMun",
                      "body": "That's still a little big, but acceptable 🤣",
                      "score": 5,
                      "created_utc": 1731329600.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwjw3ln",
          "author": "bokewalka",
          "body": "Possibly, the tinniest violin in the world",
          "score": 33,
          "created_utc": 1731313377.0,
          "replies": [
            {
              "id": "lwk3zel",
              "author": "None",
              "body": "[removed]",
              "score": 35,
              "created_utc": 1731318812.0,
              "replies": [
                {
                  "id": "lwkcexl",
                  "author": "B_Chev",
                  "body": "My violin is so small the observer effect puts it out of tune when I take it out :(",
                  "score": 10,
                  "created_utc": 1731324256.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwkmyzu",
          "author": "tychozero",
          "body": "![gif](giphy|CkulhgggRftfi)",
          "score": 5,
          "created_utc": 1731329693.0,
          "replies": []
        },
        {
          "id": "lwkf3bj",
          "author": "shibe_ceo",
          "body": "Not even brown recluse spiders have violins small enough for this",
          "score": 3,
          "created_utc": 1731325792.0,
          "replies": []
        },
        {
          "id": "lwtk5gc",
          "author": "GodzillaUK",
          "body": "[Handsome Jack approves](https://youtu.be/MrRQjRawuz4?si=bPP4ZdZ2h2Sn8RzZ&t=18)",
          "score": 2,
          "created_utc": 1731449751.0,
          "replies": []
        },
        {
          "id": "lwoeepf",
          "author": "No-Staff1170",
          "body": "👌",
          "score": 1,
          "created_utc": 1731374136.0,
          "replies": []
        },
        {
          "id": "lwk3r8j",
          "author": "OnlyForF1",
          "body": "Here you go ^^🎻",
          "score": 1,
          "created_utc": 1731318655.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwjsgsr",
      "author": "steinrrr",
      "body": "![gif](giphy|7k2LoEykY5i1hfeWQB)",
      "score": 228,
      "created_utc": 1731310993.0,
      "replies": []
    },
    {
      "id": "lwjsimo",
      "author": "Estrava",
      "body": "How did they determine if it's lack of interest vs... there's sufficient/planned supply?",
      "score": 211,
      "created_utc": 1731311026.0,
      "replies": [
        {
          "id": "lwjwf3n",
          "author": "Durzel",
          "body": "It’s probably just adequate supply. We’re well past the chip shortage days where you had to sit in an hour long queue just to buy the original PS5.\n\nThe relative lack of supply of disc drives is cursed though. Sony obviously didn’t think so many people would want to have that functionality back.",
          "score": 214,
          "created_utc": 1731313594.0,
          "replies": [
            {
              "id": "lwka2rc",
              "author": "GrE1sS",
              "body": "Disc drive is what killed my interest, I had a pre-order and could pick it up. But without the disc drive I can’t play the games I own. And enjoy the pro.\n\nAnd if I would go digital I would rather buy it on PC",
              "score": 74,
              "created_utc": 1731322831.0,
              "replies": [
                {
                  "id": "lwkwuhi",
                  "author": "Omegalazarus",
                  "body": "Can you not add the disc drive on? Lame!",
                  "score": 2,
                  "created_utc": 1731333712.0,
                  "replies": [
                    {
                      "id": "lwmeebm",
                      "author": "GrE1sS",
                      "body": "Yup you can, and the cost was okay for me. But it's just not available and I am not buying from a scalper",
                      "score": 18,
                      "created_utc": 1731350896.0,
                      "replies": []
                    },
                    {
                      "id": "lwli5i3",
                      "author": "vingt-2",
                      "body": "You can but its sold out for now.",
                      "score": 6,
                      "created_utc": 1731341004.0,
                      "replies": [
                        {
                          "id": "lwlipam",
                          "author": "Omegalazarus",
                          "body": "Disk drive is the real scalping opportunity. \\s",
                          "score": 6,
                          "created_utc": 1731341178.0,
                          "replies": []
                        },
                        {
                          "id": "lwm94fl",
                          "author": "Wonderful_Orchid_363",
                          "body": "There’s like 10 of them at my local Walmart lol",
                          "score": 1,
                          "created_utc": 1731349301.0,
                          "replies": [
                            {
                              "id": "lwme93i",
                              "author": "GrE1sS",
                              "body": "Yup I've heard that it's a EU thing. Checked all shops around, some even delisted the item. Others don't allow pre-orders. \n\nI think the expected restock is Q1 25...",
                              "score": 1,
                              "created_utc": 1731350852.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lwlapix",
                      "author": "None",
                      "body": "You can",
                      "score": 3,
                      "created_utc": 1731338617.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwpnjmu",
                  "author": "RevolEviv",
                  "body": "I got almost the last drive in the UK (4 weeks back?) at MSRP but have no regrets on buying my PRO. It's def worth it and selling the OG PS5 it cost barely anything (factoring in the SSD upgrade I needed).\n\n  \nFTR I have a decent PC too (RTX3080 + 12900k) but prefer the PRO by far... it looks and runs awesome and it's much nicer to play (most) games on the console than on my PC these days (on my 65\" LG OLED)",
                  "score": 1,
                  "created_utc": 1731393285.0,
                  "replies": [
                    {
                      "id": "lwpy2n2",
                      "author": "GrE1sS",
                      "body": "Lucky you, I didn't think much of the drive to be honest until the release. \n\nBut I have a 4090 and a cable running to the TV.   \nBut for me the PRO would bring me closer with much more easier use, just start it and continue, no fiddling around with screens, starting the game ETC. \n\nI have also an OLED monitor, but the TV is a bit different experience but with the standard PS5 the difference in quality is just a bit too big",
                      "score": 1,
                      "created_utc": 1731400010.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lwkafqe",
                  "author": "Durzel",
                  "body": "I can't be bothered and don't really have the space for a PC nowadays, and I also like buying stuff digitally.  For the money though it ought to be included.  Depending on how good the PS5 Pro sales are, though, it might have proven to Sony that people will buy it regardless even if they have to buy the drive separately.",
                  "score": -8,
                  "created_utc": 1731323054.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwk69qh",
              "author": "XTornado",
              "body": "> The relative lack of supply of disc drives is cursed though. Sony obviously didn’t think so many people would want to have that functionality back.\n\nI am yet not sure if the guy that came up with that  will get a bonus or not.\nWill they get it because it selling good and the extra cash they got with the separate overpriced disk drive or he won't get it as it wasn't expensive enough to make people to stay on digital and get even more money this way.",
              "score": 10,
              "created_utc": 1731320348.0,
              "replies": [
                {
                  "id": "lwn5v3g",
                  "author": "Dornith",
                  "body": "I'm willing to bet it was a calculated discussion and they knew the result going in. \n\nThere's extra overhead to selling two different versions of the same product. Extra manufacturing costs for setting up different assembly lines, extra logistics costs from storing and resupplying two different SKUs, etc.\n\nGiven that the PS5 Pro is a more niche product than the PS5, which itself is still competing with the PS4 holdouts, they probably decided that the few extra sales they'd get from including the disc drive didn't outweigh the costs for extra manufacturing + logistics + materials.\n\nContrary to what reddit believes, major companies like Sony are in the business of calculated risks.",
                  "score": 1,
                  "created_utc": 1731359279.0,
                  "replies": [
                    {
                      "id": "lwnehxo",
                      "author": "XTornado",
                      "body": "Of course two models wouldn't make sense. The idea would be that a pro version that is already so expensive should be a version with disk drive not without it. Like make it modular aswell with option of disk or no disk seems even more work.\n\nBut whatever... they had they reasons of course.",
                      "score": 2,
                      "created_utc": 1731361913.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwlm51j",
              "author": "Art__Vandellay",
              "body": ">Sony obviously didn’t think so many people would want to have that functionality back.\n\nOh you sweet summer child. They want people to buy digital copies, so they 'limited supply', obviously",
              "score": 6,
              "created_utc": 1731342257.0,
              "replies": []
            },
            {
              "id": "lwpng95",
              "author": "RevolEviv",
              "body": "It's not a \"Lack of interest\" it's because Sony made many many units to prevent scalping amongst other things. It's selling better than PS4 PRO, it's #1 console on Amazon worldwide and MLID reports that insiders say they are selling extremely well (80% of stock gone and they had a LOT of stock).",
              "score": 1,
              "created_utc": 1731393230.0,
              "replies": []
            },
            {
              "id": "lwka0jy",
              "author": "IveKnownItAll",
              "body": "You'd think so, but Sony had shortages with the ps3 release too. They've done it to themselves repeatedly",
              "score": 0,
              "created_utc": 1731322794.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwjw8y0",
          "author": "OwnSimple4788",
          "body": "It is most likely enough supply Sony already stated is selling more than the ps4 pro in the same time period, people just have a hate boner for the pro and want to spread the negativity.",
          "score": 28,
          "created_utc": 1731313476.0,
          "replies": [
            {
              "id": "lwk30rt",
              "author": "Eastern_Interest_908",
              "body": "And those sales includes scalping.",
              "score": 6,
              "created_utc": 1731318149.0,
              "replies": [
                {
                  "id": "lwlkdsh",
                  "author": "OwnSimple4788",
                  "body": "There arent as many scalpers as people think lmak",
                  "score": -4,
                  "created_utc": 1731341705.0,
                  "replies": [
                    {
                      "id": "lwlmfdb",
                      "author": "Eastern_Interest_908",
                      "body": "That doesn't make sense. If there wouldn't be they wouldn't be in a position to manipulate the price. ",
                      "score": -1,
                      "created_utc": 1731342346.0,
                      "replies": [
                        {
                          "id": "lwlxjr6",
                          "author": "72kdieuwjwbfuei626",
                          "body": "They aren’t.",
                          "score": 2,
                          "created_utc": 1731345778.0,
                          "replies": []
                        },
                        {
                          "id": "lwn6dus",
                          "author": "Dornith",
                          "body": "If they were in a position to manipulate the price then we wouldn't be seeing articles about them selling at a loss.",
                          "score": -1,
                          "created_utc": 1731359438.0,
                          "replies": [
                            {
                              "id": "lwnbomn",
                              "author": "Eastern_Interest_908",
                              "body": "That doesn't prove anything you can buy every single one of them and sell for 2k but if nobody is interested you have to lower the price. ",
                              "score": 1,
                              "created_utc": 1731361055.0,
                              "replies": [
                                {
                                  "id": "lwndwjh",
                                  "author": "Dornith",
                                  "body": "If no one is interested then you didn't sell them for 2k. You asked for 2k and the market said, \"no\".",
                                  "score": -1,
                                  "created_utc": 1731361732.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lwlrd4f",
                      "author": "MetalstepTNG",
                      "body": "No, many people flip goods when the holidays are around the corner.",
                      "score": 0,
                      "created_utc": 1731343871.0,
                      "replies": []
                    },
                    {
                      "id": "lwlrdq7",
                      "author": "riceisnice29",
                      "body": "There don’t need to be don’t they buy in bulk? It’s not like each scalper is buying one console and selling it and thats it. Or am I understanding what you’re saying wrong?",
                      "score": 0,
                      "created_utc": 1731343876.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lwlcwt3",
              "author": "ZeusHatesTrees",
              "body": "They don't really have a way to determine if the sales Sony made were by actual interested customers or scalpers buying them up predicting a rush on them.  I know literally no one with a PS5 Pro, nor interest in buying one.  I wouldn't be surprised to find most of Sony's profit was from scalpers.",
              "score": 5,
              "created_utc": 1731339337.0,
              "replies": []
            },
            {
              "id": "lwk3dri",
              "author": "None",
              "body": "[deleted]",
              "score": -4,
              "created_utc": 1731318397.0,
              "replies": [
                {
                  "id": "lwknvhr",
                  "author": "dekusyrup",
                  "body": "The PS4 pro was launched 11 years ago.  The number of gamers worldwide has almost doubled since then.  I reckon PS4 pro sales are aincent history and not much for a baseline.",
                  "score": 1,
                  "created_utc": 1731330090.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lwmvp17",
              "author": "sesor33",
              "body": "Sony never said that, some random guy on resetera said preorders were \"slightly above\" ps4 pro. Which is bad when you keep in mind that there are MORE gamers now than there were when the PS4 pro released.",
              "score": -2,
              "created_utc": 1731356173.0,
              "replies": [
                {
                  "id": "lwmvyqm",
                  "author": "OwnSimple4788",
                  "body": "Not on consoles tho they have been complaing about how they cant grow they user base",
                  "score": 1,
                  "created_utc": 1731356257.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwjxghj",
          "author": "Forzyr",
          "body": "Sony said It's selling better than the PS4 pro, so it's just click bait",
          "score": 9,
          "created_utc": 1731314306.0,
          "replies": []
        },
        {
          "id": "lwltnzn",
          "author": "None",
          "body": "I mean it’s very obvious based on how it was received online. It’s definitely lack of interest. Some folks from best buy have commented that they have tons and no ones buying them.",
          "score": 1,
          "created_utc": 1731344580.0,
          "replies": []
        },
        {
          "id": "lwluav6",
          "author": "Ntwynn",
          "body": "It’s an expensive niche product. I’d imagine there’s probably just the right amount of supple.",
          "score": 1,
          "created_utc": 1731344778.0,
          "replies": []
        },
        {
          "id": "lwnfaak",
          "author": "billbixbyakahulk",
          "body": "Usually they don't know (nor do they particularly care). To some degree they're just gambling there'll be a shortage or at least the perception of a shortage, such that someone will pay their price. For example, if you're SO SURE the local stores will run out while you're off on a family vacation, you might just pay the scalper price up front because of that assumption.",
          "score": 1,
          "created_utc": 1731362157.0,
          "replies": []
        },
        {
          "id": "lwnrw43",
          "author": "cyyshw19",
          "body": "It’s probably both. I don’t know what scalpers are thinking but PS4 Pro never sold out… like mid-gen upgrade always have limited audience so it’s easy for Sony to meet demand with enough supply.",
          "score": 1,
          "created_utc": 1731366240.0,
          "replies": []
        },
        {
          "id": "lwlrmst",
          "author": "USeaMoose",
          "body": "As others have said, it's mostly just a click-bait title. Though, I think you get there by comparing it to a new gen console launch. Where, chip shortage or not, when a console is popular, it never stays on the shelves for more than a couple minutes.\n\nIf this were the PS6, and scalpers were selling consoles at a loss, it would be reasonable to assume that the launch did not go as well as Sony would have hoped. But it's not that. It is a mid-generation refresh, and demand is going to be completely different for those. It's also probably a situation where they expect sales to be more spread out. These are not die-hard PS fans who don't already a PlayStation 5. These are either people who never got the PS5, or people who have ne, and are considering replacing it.",
          "score": 1,
          "created_utc": 1731343953.0,
          "replies": []
        },
        {
          "id": "lwjwc26",
          "author": "ChucklesInDarwinism",
          "body": "They did not but this is a more click bait title.",
          "score": 0,
          "created_utc": 1731313535.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwjtrdz",
      "author": "jsuwangsa",
      "body": "Those dumb scalpers. 😂",
      "score": 59,
      "created_utc": 1731311825.0,
      "replies": []
    },
    {
      "id": "lwjv3jx",
      "author": "jaredearle",
      "body": "There isn’t a lack of interest in the PS5 Pro; Sony simply made enough and made them easily available. \n\nhttps://www.eurogamer.net/ps5-pro-price-has-not-had-a-negative-impact-on-sales-says-sony-boss\n\nScalpers misjudged, not Sony.",
      "score": 137,
      "created_utc": 1731312707.0,
      "replies": [
        {
          "id": "lwk4id7",
          "author": "corruptboomerang",
          "body": "Hopefully Nintendo can do the same for the Switch 2!",
          "score": 36,
          "created_utc": 1731319172.0,
          "replies": [
            {
              "id": "lwltjoy",
              "author": "_RADIANTSUN_",
              "body": "They won't cuz Nintendo operates on an extremely different model. They are not Sony who has 1000 other businesses and they don't have the same scale for moving hardware: to them, overproducing is an existential risk cuz  it is relatively really easy to increase and scale up production but once you've done it, manufacturing and supply contracts have been set for timescales for years and then it's insanely difficult to scale it back. The hundreds of thousands of units start to pile up and you have to start keeping them in warehouses with all the associated costs, losses due to pilferage and warehouse conditions, and have to get rid of the glut by either slashing prices (like the 3DS) or invest in/hope for demand picking up. They cannot absorb losses like this the same way Sony can.\n\nLots of people believe Nintendo does \"artificial scarcity\", they don't, they are just an extremely financially conservatively run Japanese business because that's what has allowed them to exist for so long in probably the single most brutal consumer tech environment in the last 40 years. Nintendo has walked through this exact boneyard and remembers the skeletons of fallen giants like Atari, SEGA, THQ... All gone from the console hardware arena or entirely, literally because they produced too much hardware they couldn't sell.\n\nThey fundamentally will never risk this same kind of thing happening again because they would rather have unmet demand to leave some money on the table, generate some hype and maybe piss a few people off... vs risking losing it all big time.",
              "score": 14,
              "created_utc": 1731344542.0,
              "replies": []
            },
            {
              "id": "lwma4lf",
              "author": "JerHat",
              "body": "Eh, not likely. A totally new console has a lot more demand.",
              "score": 1,
              "created_utc": 1731349604.0,
              "replies": [
                {
                  "id": "lwmli76",
                  "author": "corruptboomerang",
                  "body": "Nintendo have made specific mention of wanting to foil scalpers. So here's hoping.",
                  "score": 3,
                  "created_utc": 1731353064.0,
                  "replies": [
                    {
                      "id": "lwp4rfc",
                      "author": "Taki_Minase",
                      "body": "Yes, they are stockpiling",
                      "score": 2,
                      "created_utc": 1731383915.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwjzorp",
          "author": "Chagrim",
          "body": "Exactly this! People just think that PS5 launch was \"normal\" but Corona virus impacted every single electronic productions then, ans it was hard to get anything then. Remember for example GPU's? Sony just couldn't make them as much as they wanted. Now things are normalized and Sony can produce PS5 Pro's as much as they want to.",
          "score": 15,
          "created_utc": 1731315835.0,
          "replies": [
            {
              "id": "lwlcaip",
              "author": "DontGetNEBigIdeas",
              "body": "Haven’t heard anyone call it “Corona Virus” since April 2020. Thanks for the memories!",
              "score": 5,
              "created_utc": 1731339134.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwk9b40",
          "author": "OTB2",
          "body": "Sorry but would you expect anything different from a Sony exec? Imo he is talking BS because this was not presented in the marketing as just a hardcore users console. And even so, the hardcore crowd is sizable enough to have the console sold out for at least a couple weeks. This thing should not have been so readily available the day it came out. The price is just too high.",
          "score": -5,
          "created_utc": 1731322356.0,
          "replies": [
            {
              "id": "lwknweo",
              "author": "A_Shadow",
              "body": ">And even so, the hardcore crowd is sizable enough to have the console sold out for at least a couple weeks. This thing should not have been so readily available the day it came out. The price is just too high.\n\n\nBased on what? The PS4 Pro didn't run out of stock when it released either. So why would the PS5 pro?",
              "score": 7,
              "created_utc": 1731330101.0,
              "replies": []
            },
            {
              "id": "lwlbifk",
              "author": "TingleyStorm",
              "body": "I don’t know why you’re being downvoted, it’s exactly what that Sony exec is saying. He’s saving face so stock doesn’t tank and shareholders aren’t pissed.\n\n“Oh but sales are still on track” partially thanks to SCALPERS, who aren’t purchasing the consoles to play. Take those sales away and suddenly you’re coming up short of targets.\n\nSony dropped the ball this generation. There was a chip shortage yeah but there was still a lack of first-party games that weren’t also available on the PS4, and Microsoft also experienced the chip shortage but bounced back faster and provided one of the best bang-for-buck gaming experiences with gamepass.",
              "score": 1,
              "created_utc": 1731338880.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwjskjn",
      "author": "PetyrDayne",
      "body": "![gif](giphy|KZSUN7FKBZrm2WHDdX|downsized)",
      "score": 40,
      "created_utc": 1731311062.0,
      "replies": []
    },
    {
      "id": "lwjv4kb",
      "author": "-Average_Joe-",
      "body": "![gif](giphy|8fen5LSZcHQ5O|downsized)",
      "score": 12,
      "created_utc": 1731312726.0,
      "replies": []
    },
    {
      "id": "lwjxvfg",
      "author": "Necessary_Common4426",
      "body": "Sympathy for them is in a dictionary between shit and syphilis",
      "score": 11,
      "created_utc": 1731314590.0,
      "replies": [
        {
          "id": "lwk8bg0",
          "author": "notactuallyabrownman",
          "body": "It’s there for everyone, that’s just where it goes.",
          "score": -3,
          "created_utc": 1731321721.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwk5aw7",
      "author": "theleaphomme",
      "body": "![gif](giphy|J8FZIm9VoBU6Q)",
      "score": 10,
      "created_utc": 1731319702.0,
      "replies": []
    },
    {
      "id": "lwjsolg",
      "author": "BrainJar",
      "body": "No, a healthy supply of PS5 Pro’s means that anyone can buy one, and not have to rely on scalpers to buy one.  There’s plenty of interest.  There’s just more consoles available than have been purchased.",
      "score": 26,
      "created_utc": 1731311134.0,
      "replies": [
        {
          "id": "lwkw3ol",
          "author": "None",
          "body": "The other thing this clickbait article doesn't cover is the fact that most of these scalpers are well within the return window, especially since there are many extended return windows for the holiday season right now. If these scalpers are smart they'll simply return the consoles and get their money back.",
          "score": 12,
          "created_utc": 1731333425.0,
          "replies": [
            {
              "id": "lwm2v5f",
              "author": "adzy2k6",
              "body": "Will it be hard for them to return them in volume though? It just looks like a massive scam to the retailer. I'd imagine the return window being like 31 days?",
              "score": 2,
              "created_utc": 1731347405.0,
              "replies": [
                {
                  "id": "lwm3avj",
                  "author": "None",
                  "body": "And the console released last Thursday. Even if they only had a two week return window, if they're smart they'll return them.\n\nAlso, volume matters to only some retailers. Best Buy for example will get suspicious. Target? They don't give a fuck. Especially if they aren't open.",
                  "score": 2,
                  "created_utc": 1731347536.0,
                  "replies": [
                    {
                      "id": "lwmdhf5",
                      "author": "adzy2k6",
                      "body": "Ah, shows how little attention I've paid to it. I thought it had released ages ago.",
                      "score": 3,
                      "created_utc": 1731350623.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwkzimu",
      "author": "unepmloyed_boi",
      "body": "You'd have to be some kind of shut in basement dweller or have rocks in you head to be a scalper right now expecting people to overpay for things with everything that has been going on in the news for months.\n\nRetailers and online merchants are struggling to sell regular shit at discount prices. People are still dealing with inflation, rising cost of living, layoffs...etc. and tightening their purse strings.",
      "score": 15,
      "created_utc": 1731334729.0,
      "replies": [
        {
          "id": "lwldq59",
          "author": "Fap_Left_Surf_Right",
          "body": "One thing is for certain, a redditor will respond to gaslight that everything is going well. \n\nYou just don’t understand. Here’s a link to a corporate media outlet explaining the world for you. Don’t use your own eyes and experience, instead allow them to tell you about prices.\n\nEvery fucking thread it happens. And it should be laughed at.",
          "score": 9,
          "created_utc": 1731339602.0,
          "replies": [
            {
              "id": "lwp4wo2",
              "author": "Taki_Minase",
              "body": "Amen",
              "score": 1,
              "created_utc": 1731383978.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwmbaxc",
      "author": "WinterFan8681",
      "body": "Good work people lets keep it up. 🤙🏻",
      "score": 4,
      "created_utc": 1731349962.0,
      "replies": []
    },
    {
      "id": "lwmnmcb",
      "author": "Avenger772",
      "body": "Get fucked scalpers. Get a real job.",
      "score": 3,
      "created_utc": 1731353710.0,
      "replies": []
    },
    {
      "id": "lwk8q94",
      "author": "None",
      "body": "The pro can play the same games and few games better…. Ok. But my tv isn’t better",
      "score": 8,
      "created_utc": 1731321986.0,
      "replies": [
        {
          "id": "lwlhgf5",
          "author": "Fap_Left_Surf_Right",
          "body": "This is the bottleneck. I’m PC and going to 4k gaming wasn’t just an expensive new rig. I also needed a new $1k+ monitor for the 4k system to work as intended. \n\nThese people are buying new gaming hardware and using old, shit tier displays. It’s not just the console, you need to replace your display as well.",
          "score": 3,
          "created_utc": 1731340783.0,
          "replies": [
            {
              "id": "lwlipc6",
              "author": "None",
              "body": "Which is why I never understood pro consoles unless you buy them at end of that generations life to have one to last longer term in a collection. \n\nAnd yes I’m also on pc as well. I looked at building a powerful new pc and realized, I can cheap out on the graphics card cause my display isn’t doing all that lol.\n\nAnd new displays won’t come down",
              "score": 3,
              "created_utc": 1731341178.0,
              "replies": [
                {
                  "id": "lwllbr6",
                  "author": "Fap_Left_Surf_Right",
                  "body": "I spent $2500 on a 4k rig, then $1k on a display to produce proper 4k. So $3500 for real 4k experience. \n\nI think these console gamers are being misled massively. \n\n1) only 2% of steam gamers are 4k. The media grossly misrepresents the 4k ecosystem. For the most part, nobody you know has it. \n\n2) A great console on a Black Friday television is NOT 4k. If I bought a television that could handle what my PC can do, it would cost as much as the PC itself. \n\n3) the media is lying to them about 4k. They don’t have the displays, the consoles can’t do it at standard frame rates, this $700 box will never give you standard 4k gaming. It’s all a lie which is infuriating bc I’m a lifelong gamer and I get what they want. It’s a lie that buying a PS Pro can do this stuff.",
                  "score": 1,
                  "created_utc": 1731342002.0,
                  "replies": [
                    {
                      "id": "lwlrvru",
                      "author": "None",
                      "body": "Another point is that a lot of 4k tvs have 60hz frame rate which is garbage.",
                      "score": 2,
                      "created_utc": 1731344029.0,
                      "replies": [
                        {
                          "id": "lwlu002",
                          "author": "Fap_Left_Surf_Right",
                          "body": "I’m watching Linus try the PS Pro now and it’s a Toyota Corolla at best. “120hz display at 30fps”\n\nWow. What a $700 piece of shit to waste gamers money.",
                          "score": 2,
                          "created_utc": 1731344684.0,
                          "replies": [
                            {
                              "id": "lwlxm2d",
                              "author": "None",
                              "body": "Right you could build a low end pc and get access to Xbox games as well as all the exclusives Sony is bringing to pc now. Then buy whatever monitor you want and even go ultra wide, which is where it’s at",
                              "score": 3,
                              "created_utc": 1731345797.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lwroamj",
          "author": "edvek",
          "body": "My TV is good, I bought a good one because I wanted one and for the PS5. But I have zero need for the pro.",
          "score": 1,
          "created_utc": 1731428627.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwmpm00",
      "author": "no_f-s_given",
      "body": "Lol, fuck em. I hope the bastards lose big.",
      "score": 3,
      "created_utc": 1731354316.0,
      "replies": []
    },
    {
      "id": "lwmrp1w",
      "author": "Ahhshit96",
      "body": "Hahahaha",
      "score": 3,
      "created_utc": 1731354951.0,
      "replies": []
    },
    {
      "id": "lwoohvf",
      "author": "schaudhery",
      "body": "Why wouldn’t they just return them? They just came out..",
      "score": 3,
      "created_utc": 1731377721.0,
      "replies": []
    },
    {
      "id": "lwpphwo",
      "author": "mujinzou",
      "body": "Good. Hope they go broke.",
      "score": 3,
      "created_utc": 1731394447.0,
      "replies": []
    },
    {
      "id": "lwppk9n",
      "author": "foodrepublik",
      "body": "It only looks decent now, in a few years suddenly we're back to blurry graphics and 30 fps when game devs doesn't even bother optimizing their games.",
      "score": 3,
      "created_utc": 1731394487.0,
      "replies": []
    },
    {
      "id": "lwjzfvo",
      "author": "Gardening_investor",
      "body": "Good fuck those scalpers. I hope they lose millions of dollars collectively.",
      "score": 6,
      "created_utc": 1731315665.0,
      "replies": [
        {
          "id": "lwl5v8q",
          "author": "Pokedudesfm",
          "body": "if they bought them with their own money they can return them to the store.\n\nif they bought them with a stolen credit card, they can list it for lest than MSRP and still make money",
          "score": 1,
          "created_utc": 1731336994.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwk6ur2",
      "author": "TheRealPyroManiac",
      "body": "It’s more Sony is prepared and there isn’t a global chip storage compared to 2020.",
      "score": 4,
      "created_utc": 1731320742.0,
      "replies": []
    },
    {
      "id": "lwkvfnz",
      "author": "SerakClaw",
      "body": "![gif](giphy|UU1bHu6QWyFxZM63Jh)\n\nWhat a tragedy",
      "score": 4,
      "created_utc": 1731333168.0,
      "replies": []
    },
    {
      "id": "lwjvdw4",
      "author": "MaxPotionz",
      "body": "Price wise Sony didn’t leave any meat on the bone either for scalpers which I’m ok with. Msrp will drop eventually anyways as well for everyone else.",
      "score": 2,
      "created_utc": 1731312897.0,
      "replies": []
    },
    {
      "id": "lwl6n50",
      "author": "CrossTheRiver",
      "body": "If there was one unifying factor us regular folks could all agree on, scalpers suck and deserve this failure.",
      "score": 2,
      "created_utc": 1731337257.0,
      "replies": []
    },
    {
      "id": "lwlbojz",
      "author": "TurboLover427",
      "body": "Good. May a camel's ass be in their face.",
      "score": 2,
      "created_utc": 1731338935.0,
      "replies": [
        {
          "id": "lwleswc",
          "author": "Chris56855865",
          "body": "Literally",
          "score": 2,
          "created_utc": 1731339948.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwlft41",
      "author": "autoerratica",
      "body": "GOOD, fuck scalpers… get a real job.",
      "score": 2,
      "created_utc": 1731340267.0,
      "replies": []
    },
    {
      "id": "lwm8v8j",
      "author": "FollowTheDick",
      "body": "Suck it up vultures",
      "score": 2,
      "created_utc": 1731349223.0,
      "replies": []
    },
    {
      "id": "lwm9cpi",
      "author": "JerHat",
      "body": "How much of a loss are we talking about? I would consider buying one from a scalper at a price significantly under retail.",
      "score": 2,
      "created_utc": 1731349371.0,
      "replies": []
    },
    {
      "id": "lwm9z9z",
      "author": "No_Detective_But_304",
      "body": "Good.",
      "score": 2,
      "created_utc": 1731349560.0,
      "replies": []
    },
    {
      "id": "lwmaj9z",
      "author": "Sgruvs",
      "body": "Burn baby, burn!",
      "score": 2,
      "created_utc": 1731349727.0,
      "replies": []
    },
    {
      "id": "lwmbobr",
      "author": "hardwood1979",
      "body": "My heart bleeds for them....",
      "score": 2,
      "created_utc": 1731350075.0,
      "replies": []
    },
    {
      "id": "lwmgqlx",
      "author": "ZeusBaxter",
      "body": "Beautiful irony.",
      "score": 2,
      "created_utc": 1731351611.0,
      "replies": []
    },
    {
      "id": "lwmjfs1",
      "author": "None",
      "body": "Well if you own a PS5, it's not a worthwhile upgrade.\n\nIf you don't own a PS5, it's still not worth paying £800 when the original model is much cheaper.\n\nWe need more people boycotting scalpers like this though.",
      "score": 2,
      "created_utc": 1731352433.0,
      "replies": []
    },
    {
      "id": "lwn9zz5",
      "author": "MilkChugg",
      "body": "Cool fuck scalpers.",
      "score": 2,
      "created_utc": 1731360539.0,
      "replies": []
    },
    {
      "id": "lwnmn6v",
      "author": "TaxMysterious8859",
      "body": "I mean the console is in stock everywhere. Why would you ever pay above retail for something that's available at retail. \n\nThe disc drives are the only thing not available.",
      "score": 2,
      "created_utc": 1731364503.0,
      "replies": []
    },
    {
      "id": "lwnnb76",
      "author": "zterrans",
      "body": "And no one of value suffered.  I like these feel-good stories.",
      "score": 2,
      "created_utc": 1731364719.0,
      "replies": []
    },
    {
      "id": "lwoe7it",
      "author": "Axon14",
      "body": "Sony trying to scalp us a PS5 pro with that sticker price",
      "score": 2,
      "created_utc": 1731374065.0,
      "replies": []
    },
    {
      "id": "lwojmh0",
      "author": "jtaylor3rd",
      "body": "![gif](giphy|5tiG8KMfk8h7Dabth8)",
      "score": 2,
      "created_utc": 1731375988.0,
      "replies": []
    },
    {
      "id": "lwot5of",
      "author": "sporadicMotion",
      "body": "This is positively heart warming.",
      "score": 2,
      "created_utc": 1731379431.0,
      "replies": []
    },
    {
      "id": "lwp07ph",
      "author": "Tommonator80",
      "body": "Return them for a refund. This story is fake.",
      "score": 2,
      "created_utc": 1731382084.0,
      "replies": []
    },
    {
      "id": "lwp659o",
      "author": "EMP_Jeffrey_Dahmer",
      "body": "This is good. To hell with those scalpers.",
      "score": 2,
      "created_utc": 1731384502.0,
      "replies": []
    },
    {
      "id": "lwqpgu3",
      "author": "garciawork",
      "body": "Is the PS5 pro out already? Didn't even realize.",
      "score": 2,
      "created_utc": 1731416269.0,
      "replies": []
    },
    {
      "id": "lwsbbjl",
      "author": "None",
      "body": "Fucking love it.",
      "score": 2,
      "created_utc": 1731435695.0,
      "replies": []
    },
    {
      "id": "lwszcc2",
      "author": "TheMerchantofPhilly",
      "body": "Honestly, I wasn’t even aware it was on the market.",
      "score": 2,
      "created_utc": 1731443046.0,
      "replies": []
    },
    {
      "id": "lwthabb",
      "author": "ArchonTheta",
      "body": "Lol. Idiot scalpers",
      "score": 2,
      "created_utc": 1731448852.0,
      "replies": []
    },
    {
      "id": "lwtjr4a",
      "author": "GodzillaUK",
      "body": "Poor scumbags, losing money on something they obtained with no good will behind it, just a desire to fleece people of their hard earned money.  Won't someone please think of the scumbags?!",
      "score": 2,
      "created_utc": 1731449626.0,
      "replies": []
    },
    {
      "id": "lwulfpx",
      "author": "Lowebrew",
      "body": "Good, dirty scum!",
      "score": 2,
      "created_utc": 1731462640.0,
      "replies": []
    },
    {
      "id": "lwvv6a3",
      "author": "nothingexceptfor",
      "body": "Hahahaha, this makes me happy, I don’t even play or have any PS at all but this is gold",
      "score": 2,
      "created_utc": 1731483237.0,
      "replies": []
    },
    {
      "id": "lwk7rlq",
      "author": "ThisNameTakenTooLoL",
      "body": "Only incredibly stupid ones I guess. Those with IQ higher than room temperature would just return them if they couldn't sell within the return window.",
      "score": 4,
      "created_utc": 1731321359.0,
      "replies": [
        {
          "id": "lwkly0u",
          "author": "DR_van_N0strand",
          "body": "Obviously this story started because some were sold at a loss that are obviously stolen where the seller doesn’t have that option. \n\nThis story just came from one dumb third tier gaming site and everyone ran with it.",
          "score": 3,
          "created_utc": 1731329232.0,
          "replies": [
            {
              "id": "lwknccv",
              "author": "ThisNameTakenTooLoL",
              "body": "Makes sense. Everybody hates scalpers so they really want it to be true.",
              "score": 0,
              "created_utc": 1731329856.0,
              "replies": [
                {
                  "id": "lwknt0s",
                  "author": "DR_van_N0strand",
                  "body": "💯\n\nI mean we just saw more than half the voters in America use the same logic last week.",
                  "score": 2,
                  "created_utc": 1731330061.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwldais",
          "author": "wellhiyabuddy",
          "body": "Or they could just wait for tariffs to skyrocket the price, then sell for even larger profits",
          "score": 0,
          "created_utc": 1731339461.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwk1le0",
      "author": "a_man_has_a_name",
      "body": "It's not lack of interest, it's just there is sufficient supply, the PS5 Pro is actually slightly ahead of the PS4 Pro in the same time period after release.\n\nPeople need to remember that the PS5 was hard to find not just because of demand, but the global supply chain issues caused by COVID, and consoles being in supply, even immediately after release is the norm, not the other way around.",
      "score": 4,
      "created_utc": 1731317154.0,
      "replies": [
        {
          "id": "lwlkz8g",
          "author": "saints21",
          "body": "Considering the gaming market has seen a huge amount of growth over the last decade, it'd be a failure of massive proportions if it wasn't ahead of the PS4 Pro.",
          "score": 2,
          "created_utc": 1731341892.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwjujbk",
      "author": "RZ_1911",
      "body": "1k$ for a console which does not bring anything ? They expected what ?",
      "score": 6,
      "created_utc": 1731312339.0,
      "replies": [
        {
          "id": "lwjwzr0",
          "author": "themindisaweapon",
          "body": "I'll wait until GTA6 is released, by then it will have come down in price.",
          "score": 3,
          "created_utc": 1731313985.0,
          "replies": [
            {
              "id": "lwjxh1k",
              "author": "RZ_1911",
              "body": "The thing is - in terms of raw processing power 5 pro is not far away from generic 5 which is MUCH cheaper . And feature - optical media \n\nI don’t think that gta6 will feature any visual difference. Except - marketing junk . So what’s point on that 1k$ abomination?",
              "score": 2,
              "created_utc": 1731314317.0,
              "replies": [
                {
                  "id": "lwjytem",
                  "author": "themindisaweapon",
                  "body": "I've got a 4K OLED TV so my hope is being able to run majority of titles at that resolution maxed out. It is a decent step up in performance from the OG PS5 from what Digital Foundry has uncovered. Guess we'll see...",
                  "score": 3,
                  "created_utc": 1731315237.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lwk02rq",
      "author": "lancehunter01",
      "body": "RemakeStation 5 Pro",
      "score": 2,
      "created_utc": 1731316106.0,
      "replies": []
    },
    {
      "id": "lwk1kef",
      "author": "Home_Assistantt",
      "body": "🎻",
      "score": 2,
      "created_utc": 1731317134.0,
      "replies": []
    },
    {
      "id": "lwkjcat",
      "author": "beardingmesoftly",
      "body": "Imagine getting a new console when the old console hasn't even been pushed to its limit yet",
      "score": 2,
      "created_utc": 1731327999.0,
      "replies": [
        {
          "id": "lwm5l48",
          "author": "Placed-ByThe-Gideons",
          "body": "The current gen consoles are beyond pushed to the limit. They rely on either dynamic resolution, upscaling or both in pretty much all titles. How many games have a 30fps quality mode? 30fps about as low as you can go and still have a playable experience. \n\nSo yea they're absolutely at their limit.",
          "score": 1,
          "created_utc": 1731348221.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwk0avn",
      "author": "Historical-Bag9659",
      "body": "1000 bucks for a PS5 Pro? I might as well buy a PC at that rate.",
      "score": 2,
      "created_utc": 1731316263.0,
      "replies": []
    },
    {
      "id": "lwjwelv",
      "author": "Typical-Raspberry718",
      "body": "Scalpers should have bought the Xbox series x galaxy, That console is hard to purchase!",
      "score": 1,
      "created_utc": 1731313584.0,
      "replies": [
        {
          "id": "lwkbnv1",
          "author": "BrewKazma",
          "body": "Because its a limited edition. Just like the 30th anniversary pro.",
          "score": 1,
          "created_utc": 1731323807.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwk02i4",
      "author": "Urbanyeti0",
      "body": "Great news, let’s get a few more of them to fail  and hopefully they’ll leave the awful scammy practice entirely",
      "score": 1,
      "created_utc": 1731316101.0,
      "replies": []
    },
    {
      "id": "lwk1kms",
      "author": "Monkfich",
      "body": "They’re probably trying to get stuck into the 9800x3d gravy train instead.",
      "score": 1,
      "created_utc": 1731317139.0,
      "replies": []
    },
    {
      "id": "lwk1xe3",
      "author": "None",
      "body": "Lay off the avocado toast, stop the starbucks, cinch the ol bootstraps and work a few extra jobs to get back in the black...\n\nServes you right reseller trash\n\nI'll take one for 99 cents",
      "score": 1,
      "created_utc": 1731317384.0,
      "replies": []
    },
    {
      "id": "lwk3mah",
      "author": "Mudcat-69",
      "body": "![gif](giphy|CLbGZ9GQbaznhqjRkE)",
      "score": 1,
      "created_utc": 1731318563.0,
      "replies": []
    },
    {
      "id": "lwk6atb",
      "author": "myreptilianbrain",
      "body": "good",
      "score": 1,
      "created_utc": 1731320367.0,
      "replies": []
    },
    {
      "id": "lwk91zl",
      "author": "Square_Grocery_619",
      "body": "![gif](giphy|cO39srN2EUIRaVqaVq)",
      "score": 1,
      "created_utc": 1731322197.0,
      "replies": []
    },
    {
      "id": "lwk94ml",
      "author": "mystaninja",
      "body": "Congratulations! You've(Sony) won!",
      "score": 1,
      "created_utc": 1731322242.0,
      "replies": []
    },
    {
      "id": "lwka4a6",
      "author": "Agamouschild",
      "body": "Good",
      "score": 1,
      "created_utc": 1731322856.0,
      "replies": []
    },
    {
      "id": "lwkc1i9",
      "author": "madkingsentobln",
      "body": "I love this news",
      "score": 1,
      "created_utc": 1731324034.0,
      "replies": []
    },
    {
      "id": "lwkekza",
      "author": "verbal_incontinence",
      "body": "Good",
      "score": 1,
      "created_utc": 1731325510.0,
      "replies": []
    },
    {
      "id": "lwkjmm1",
      "author": "Justthetippliz",
      "body": "Good I hope it goes down more",
      "score": 1,
      "created_utc": 1731328139.0,
      "replies": []
    },
    {
      "id": "lwkk78c",
      "author": "None",
      "body": "One of the biggest scalpers in my city still has PS5s from COVID hahahahaha and a pile of switch lights for some reason? Always makes me laugh when he reposts them for 5$ less than a month ago.",
      "score": 1,
      "created_utc": 1731328416.0,
      "replies": []
    },
    {
      "id": "lwkm82g",
      "author": "MrFiendish",
      "body": "Probably a good idea to buy them now before there’s another trade war and the price of electronics goes up again.",
      "score": 1,
      "created_utc": 1731329357.0,
      "replies": []
    },
    {
      "id": "lwkmbjg",
      "author": "Ondexb",
      "body": "![gif](giphy|10JhviFuU2gWD6)",
      "score": 1,
      "created_utc": 1731329400.0,
      "replies": []
    },
    {
      "id": "lwkoyv1",
      "author": "None",
      "body": "Read this article and went to check FB Marketplace.  Most listings are basically at cost+tax. Trying to break even.",
      "score": 1,
      "created_utc": 1731330559.0,
      "replies": []
    },
    {
      "id": "lwkpx1p",
      "author": "Vig_2",
      "body": "From what I’ve read, the system is a top seller on Amazon and is outpacing the PS5 sales from its launch. The difference is that Sony has the supply this time, so scalpers are selling at a loss. But, they are making money off of disk drives.",
      "score": 1,
      "created_utc": 1731330962.0,
      "replies": [
        {
          "id": "lwl9elf",
          "author": "Mirda76de",
          "body": "Pure marketing by Sony and Amazon. Actual selling is disastrous. According to prompting retail. At least in Europe.",
          "score": 1,
          "created_utc": 1731338190.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwkta3v",
      "author": "templestate",
      "body": "It’s not lack of interest, it’s availability…",
      "score": 1,
      "created_utc": 1731332327.0,
      "replies": []
    },
    {
      "id": "lwkv2cn",
      "author": "persianbeast999",
      "body": "Meanwhile Scalpers in Iran selling more than 30%",
      "score": 1,
      "created_utc": 1731333024.0,
      "replies": []
    },
    {
      "id": "lwkx42e",
      "author": "MathematicianVivid1",
      "body": "Whomp whomp",
      "score": 1,
      "created_utc": 1731333816.0,
      "replies": []
    },
    {
      "id": "lwkxcyy",
      "author": "dramafan1",
      "body": "Now only if they made more limited addition anniversary versions too.",
      "score": 1,
      "created_utc": 1731333912.0,
      "replies": []
    },
    {
      "id": "lwky41v",
      "author": "smudgetimeusa",
      "body": "Love to see it!",
      "score": 1,
      "created_utc": 1731334199.0,
      "replies": []
    },
    {
      "id": "lwkztfc",
      "author": "bezerko888",
      "body": "Eeap what you sow. I'm glad to see people waking up",
      "score": 1,
      "created_utc": 1731334839.0,
      "replies": []
    },
    {
      "id": "lwl00dn",
      "author": "None",
      "body": "Sweet, discount pros on eBay!!",
      "score": 1,
      "created_utc": 1731334910.0,
      "replies": []
    },
    {
      "id": "lwl08ys",
      "author": "iambarrelrider",
      "body": "![gif](giphy|eJYCWZtDqyxuyM2Zhj)",
      "score": 1,
      "created_utc": 1731334998.0,
      "replies": []
    },
    {
      "id": "lwl0eb9",
      "author": "None",
      "body": "Don't worry. Sony will see the mistake and go back to false demand next hardware cycle.",
      "score": 1,
      "created_utc": 1731335053.0,
      "replies": []
    },
    {
      "id": "lwl0o2h",
      "author": "shatteredmatt",
      "body": "Scalping what amounts to a purchase aimed at a niche part of the gaming market is pretty dumb.",
      "score": 1,
      "created_utc": 1731335152.0,
      "replies": []
    },
    {
      "id": "lwl0zsa",
      "author": "SGKurisu",
      "body": "Good",
      "score": 1,
      "created_utc": 1731335270.0,
      "replies": []
    },
    {
      "id": "lwl181y",
      "author": "blueblurz94",
      "body": "Good. Let the scalpers suffer.",
      "score": 1,
      "created_utc": 1731335354.0,
      "replies": []
    },
    {
      "id": "lwl4qvk",
      "author": "SpliTTMark",
      "body": "If something doesn't sell out in 5 minute's its not worth scalping. Like the anniversary edition",
      "score": 1,
      "created_utc": 1731336608.0,
      "replies": []
    },
    {
      "id": "lwl59og",
      "author": "None",
      "body": "What’s hilarious is anybody who trades in a retail-price-purchased PS5 disc model towards a Pro purchase ends up paying approximately $970 for the console this generation. The $1K price tags aren’t far off ",
      "score": 1,
      "created_utc": 1731336787.0,
      "replies": []
    },
    {
      "id": "lwl6dmf",
      "author": "JeffCrossSF",
      "body": "This is almost certainly click-bait.\n\n“Lack of interest” is not the same as “we can’t build them fast enough to meet overwhelming demand”. I have a feeling sony will sell a good number of these, but it is not 2020 and supply chains are not blocked like they were at launch.",
      "score": 1,
      "created_utc": 1731337167.0,
      "replies": [
        {
          "id": "lwl8zik",
          "author": "Mirda76de",
          "body": "Actually, according to my private contacts in retail at least in Europe- selling is disastrous. Even with all marketing articles and claiming numbers… It’s just a damage control. If price remain the same- it’s going to be failure of the year.",
          "score": 3,
          "created_utc": 1731338051.0,
          "replies": [
            {
              "id": "lwmzkmt",
              "author": "JeffCrossSF",
              "body": "I wonder how ps4 pro compared?",
              "score": 1,
              "created_utc": 1731357366.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwl9848",
      "author": "BMP77777",
      "body": "Good",
      "score": 1,
      "created_utc": 1731338131.0,
      "replies": []
    },
    {
      "id": "lwlenar",
      "author": "CosmicChanges",
      "body": "I hope this is true. I love it when scalpers like this play themselves and take a loss.",
      "score": 1,
      "created_utc": 1731339898.0,
      "replies": []
    },
    {
      "id": "lwlf5xe",
      "author": "magichands88",
      "body": "Couldn’t have happened to a nicer group of folks.",
      "score": 1,
      "created_utc": 1731340063.0,
      "replies": []
    },
    {
      "id": "lwlfkey",
      "author": "fanatic26",
      "body": "Good. Scalpers deserve the worst form of cancer.",
      "score": 1,
      "created_utc": 1731340190.0,
      "replies": []
    },
    {
      "id": "lwlg4fs",
      "author": "Mrvision27",
      "body": "Great! Where?",
      "score": 1,
      "created_utc": 1731340365.0,
      "replies": []
    },
    {
      "id": "lwlhkf2",
      "author": "caribbean_caramel",
      "body": "Hahahahaha get fucked! LMAO",
      "score": 1,
      "created_utc": 1731340817.0,
      "replies": []
    },
    {
      "id": "lwljfgo",
      "author": "jqcitizen",
      "body": "Didn't I read yesterday that these we're gonna be $1k after the inauguration? I hope those needy children get these cheap PS5 Pros before then!",
      "score": 1,
      "created_utc": 1731341405.0,
      "replies": []
    },
    {
      "id": "lwljfw5",
      "author": "Qualityhams",
      "body": "I love this for them",
      "score": 1,
      "created_utc": 1731341409.0,
      "replies": []
    },
    {
      "id": "lwljnut",
      "author": "repalpated",
      "body": "Oh no!   Anyway...",
      "score": 1,
      "created_utc": 1731341478.0,
      "replies": []
    },
    {
      "id": "lwljq6b",
      "author": "Fritzschmied",
      "body": "At least sometimes justice hits.",
      "score": 1,
      "created_utc": 1731341498.0,
      "replies": []
    },
    {
      "id": "lwlk6kr",
      "author": "Definitely_Alpha",
      "body": "Shouldnt they hold until tarrifs set in?",
      "score": 1,
      "created_utc": 1731341641.0,
      "replies": []
    },
    {
      "id": "lwlkt1s",
      "author": "FritoPendejo1",
      "body": "Good. Screw those “people”.",
      "score": 1,
      "created_utc": 1731341838.0,
      "replies": []
    },
    {
      "id": "lwlktii",
      "author": "OhFaceXO",
      "body": "Scalpers can suck my dick. I'm never buying a console again and if that drives the prices down for others then that's a good thing.",
      "score": 1,
      "created_utc": 1731341842.0,
      "replies": []
    },
    {
      "id": "lwllvxi",
      "author": "masonvand",
      "body": "*You get what you fucking deserve!*",
      "score": 1,
      "created_utc": 1731342178.0,
      "replies": []
    },
    {
      "id": "lwllym4",
      "author": "primusautobot",
      "body": "Scalping must b stopped",
      "score": 1,
      "created_utc": 1731342201.0,
      "replies": []
    },
    {
      "id": "lwlml30",
      "author": "TheHytekShow",
      "body": "I’ll buy it for 100, shits worthless to me without an insane deal",
      "score": 1,
      "created_utc": 1731342396.0,
      "replies": []
    },
    {
      "id": "lwln6ir",
      "author": "Chazybaz13",
      "body": "I just checked and someone bid on it so I'm not sure it'll be at a loss?",
      "score": 1,
      "created_utc": 1731342580.0,
      "replies": []
    },
    {
      "id": "lwlqm3g",
      "author": "Snake_eyes_12",
      "body": "Scalping is not a viable business for most people. It's kind of like options trading, there has to be certain variables at play and a little bit of luck has to play in. \n\n1. Its not a new console generation. Most people who wanted a PS5 already have one and an upgrade isn't for most current PS5 owners.  \n2. No chip shortage. Sony is able to maintain a steady supply this time.",
      "score": 1,
      "created_utc": 1731343640.0,
      "replies": []
    },
    {
      "id": "lwlxdzn",
      "author": "None",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1731345729.0,
      "replies": [
        {
          "id": "lwp0edq",
          "author": "Vlad_Yemerashev",
          "body": "I am surprised I had to scroll this far to see this!",
          "score": 2,
          "created_utc": 1731382156.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwly4h5",
      "author": "ryebread9797",
      "body": "Good",
      "score": 1,
      "created_utc": 1731345954.0,
      "replies": []
    },
    {
      "id": "lwlzdft",
      "author": "MyCleverNewName",
      "body": ":)",
      "score": 1,
      "created_utc": 1731346338.0,
      "replies": []
    },
    {
      "id": "lwlzxfw",
      "author": "MclovinsHomewrecker",
      "body": "Time to swoop in!",
      "score": 1,
      "created_utc": 1731346509.0,
      "replies": []
    },
    {
      "id": "lwm0xo3",
      "author": "ph0lly",
      "body": "This is wonderful news, scalpers are scum",
      "score": 1,
      "created_utc": 1731346815.0,
      "replies": []
    },
    {
      "id": "lwm1lxi",
      "author": "magikot9",
      "body": "Good",
      "score": 1,
      "created_utc": 1731347020.0,
      "replies": []
    },
    {
      "id": "lwm2dwd",
      "author": "chenjia1965",
      "body": "Luckily they bought something no one cares about atm",
      "score": 1,
      "created_utc": 1731347258.0,
      "replies": []
    },
    {
      "id": "lwm5610",
      "author": "TheSecretofBog",
      "body": "If scalpers are paying retail and trying to sell above that, can’t they just return them for their price back? Is there some sort of caveat where they can’t be returned? Not sure why they’d take a loss.",
      "score": 1,
      "created_utc": 1731348093.0,
      "replies": []
    },
    {
      "id": "lwm6hax",
      "author": "Ground0x",
      "body": "Where are these scalpers. I’m looking to buy haha",
      "score": 1,
      "created_utc": 1731348494.0,
      "replies": []
    },
    {
      "id": "lwm6sia",
      "author": "Sa0t0me",
      "body": "Was about to buy a ps5 for the fam but opted for a switch , the fam games are where is at …",
      "score": 1,
      "created_utc": 1731348589.0,
      "replies": []
    },
    {
      "id": "lwm817v",
      "author": "None",
      "body": "Hey, finally! Not against true value add reselling, fuck these guys",
      "score": 1,
      "created_utc": 1731348967.0,
      "replies": []
    },
    {
      "id": "lwm8aiz",
      "author": "glasspheasant",
      "body": "What are the key selling points for an upgrade from a PS5 to a Pro? I don’t recall seeing anything I couldn’t live without but may have missed an important upgrade.",
      "score": 1,
      "created_utc": 1731349047.0,
      "replies": []
    },
    {
      "id": "lwm8axq",
      "author": "dxkillo",
      "body": "In a sea of negative news recently, this is the positivity I need pumped in my veins lmao",
      "score": 1,
      "created_utc": 1731349050.0,
      "replies": []
    },
    {
      "id": "lwmmysk",
      "author": "burito23",
      "body": "Saw the reviews, if there is any benefit it’s not for gaming. Pass.",
      "score": 1,
      "created_utc": 1731353508.0,
      "replies": []
    },
    {
      "id": "lwmqatd",
      "author": "hawksdiesel",
      "body": "sorry not sorry.",
      "score": 1,
      "created_utc": 1731354525.0,
      "replies": []
    },
    {
      "id": "lwmqrzz",
      "author": "ChamberofSarcasm",
      "body": "It's almost like people don't have enough money to buy really expensive things...",
      "score": 1,
      "created_utc": 1731354670.0,
      "replies": []
    },
    {
      "id": "lwmzr7i",
      "author": "Samwellikki",
      "body": "They’re going after that market of PC enthusiasts that upgrade for $500 to gain 5 more fps… but it ain’t there for consoles",
      "score": 1,
      "created_utc": 1731357422.0,
      "replies": []
    },
    {
      "id": "lwn15xr",
      "author": "CrunchyJeans",
      "body": "Sucks to suck",
      "score": 1,
      "created_utc": 1731357852.0,
      "replies": []
    },
    {
      "id": "lwn1rxh",
      "author": "Accomplished_Dark_37",
      "body": "Xbox Series X with the drive is $449 right now. Last Xmas it was down to $349.",
      "score": 1,
      "created_utc": 1731358038.0,
      "replies": []
    },
    {
      "id": "lwn63ud",
      "author": "fringecar",
      "body": "Awesome! That's great. The best part is the time they wasted.",
      "score": 1,
      "created_utc": 1731359353.0,
      "replies": []
    },
    {
      "id": "lwn8ngd",
      "author": "the__poseidon",
      "body": "Oh no, anyway",
      "score": 1,
      "created_utc": 1731360129.0,
      "replies": []
    },
    {
      "id": "lwnc2oh",
      "author": "137thaccount",
      "body": "Oh wow people can’t afford stuff especially with it’s twice the price. Who would have thought",
      "score": 1,
      "created_utc": 1731361174.0,
      "replies": []
    },
    {
      "id": "lwnc37j",
      "author": "downtownfreddybrown",
      "body": "Cantines will fill with their tears everywhere lol",
      "score": 1,
      "created_utc": 1731361178.0,
      "replies": []
    },
    {
      "id": "lwndyk5",
      "author": "TheBman26",
      "body": "![gif](giphy|7k2LoEykY5i1hfeWQB)",
      "score": 1,
      "created_utc": 1731361748.0,
      "replies": []
    },
    {
      "id": "lwnffdd",
      "author": "JitteryBendal",
      "body": "Music to my ears!!",
      "score": 1,
      "created_utc": 1731362200.0,
      "replies": []
    },
    {
      "id": "lwnfrn6",
      "author": "TonyHoffman",
      "body": "Good. F ‘em",
      "score": 1,
      "created_utc": 1731362306.0,
      "replies": []
    },
    {
      "id": "lwniewg",
      "author": "Hella4nia",
      "body": "Maybe if they had a disk drive",
      "score": 1,
      "created_utc": 1731363138.0,
      "replies": []
    },
    {
      "id": "lwno8pt",
      "author": "SpeedoCheeto",
      "body": "oh nooooooooooo",
      "score": 1,
      "created_utc": 1731365024.0,
      "replies": []
    },
    {
      "id": "lwnoneh",
      "author": "Charlieninehundred",
      "body": "![gif](giphy|8fen5LSZcHQ5O)",
      "score": 1,
      "created_utc": 1731365158.0,
      "replies": []
    },
    {
      "id": "lwns5zi",
      "author": "dac79nj",
      "body": "![gif](giphy|J8FZIm9VoBU6Q)",
      "score": 1,
      "created_utc": 1731366334.0,
      "replies": []
    },
    {
      "id": "lwnslo8",
      "author": "None",
      "body": "Steamdeck OLED + ps5 controller > ps5",
      "score": 1,
      "created_utc": 1731366483.0,
      "replies": []
    },
    {
      "id": "lwnuuow",
      "author": "bighatartorias",
      "body": "I think it’s more good supply, rather than lack of interest.",
      "score": 1,
      "created_utc": 1731367253.0,
      "replies": []
    },
    {
      "id": "lwnv0i2",
      "author": "boykinsir",
      "body": "Heh.",
      "score": 1,
      "created_utc": 1731367309.0,
      "replies": []
    },
    {
      "id": "lwnwhzz",
      "author": "han_jobs5",
      "body": "Let me get it for $400 flat",
      "score": 1,
      "created_utc": 1731367827.0,
      "replies": []
    },
    {
      "id": "lwnyyy5",
      "author": "Yrrebbor",
      "body": "That's a shame.",
      "score": 1,
      "created_utc": 1731368699.0,
      "replies": []
    },
    {
      "id": "lwnztth",
      "author": "The_Devil_that_Heals",
      "body": "Anyone could’ve predicted this lol",
      "score": 1,
      "created_utc": 1731369004.0,
      "replies": []
    },
    {
      "id": "lwo5j2a",
      "author": "AshTraordinary",
      "body": "Would like to personally see these “at a lost sales”, would pick up below RRP",
      "score": 1,
      "created_utc": 1731371010.0,
      "replies": []
    },
    {
      "id": "lwo77pm",
      "author": "nydjason",
      "body": "No disc no thanks",
      "score": 1,
      "created_utc": 1731371601.0,
      "replies": []
    },
    {
      "id": "lwo7du5",
      "author": "zampanman",
      "body": "﹥Test",
      "score": 1,
      "created_utc": 1731371660.0,
      "replies": []
    },
    {
      "id": "lwo7ghs",
      "author": "JAXxXTheRipper",
      "body": "Oh no. Poor scammers 😭",
      "score": 1,
      "created_utc": 1731371686.0,
      "replies": []
    },
    {
      "id": "lwo7mqv",
      "author": "DkoyOctopus",
      "body": "get fucked. \n\n![gif](giphy|3o6ZtpzSCmlYjdsGlO|downsized)",
      "score": 1,
      "created_utc": 1731371747.0,
      "replies": []
    },
    {
      "id": "lwo7u3e",
      "author": "fjf1085",
      "body": "It took me forever to get a PS5, I have zero interest in the Pro right now.",
      "score": 1,
      "created_utc": 1731371818.0,
      "replies": []
    },
    {
      "id": "lwo8zpn",
      "author": "FastRedPonyCar",
      "body": "No enhanced Bloodborne. That’s a deal killer right there for me. \n\nPatiently waiting for ChadPS4 emulation to mature further.",
      "score": 1,
      "created_utc": 1731372223.0,
      "replies": []
    },
    {
      "id": "lwocadu",
      "author": "irishemperor",
      "body": "better check ebay for pricing on the world's smallest violin",
      "score": 1,
      "created_utc": 1731373382.0,
      "replies": []
    },
    {
      "id": "lwodgci",
      "author": "DraefilkToo",
      "body": "I love this.",
      "score": 1,
      "created_utc": 1731373799.0,
      "replies": []
    },
    {
      "id": "lwoem8w",
      "author": "Xephhpex",
      "body": "Reseller eat that loss!",
      "score": 1,
      "created_utc": 1731374212.0,
      "replies": []
    },
    {
      "id": "lwogqyd",
      "author": "Neziwi",
      "body": "Where? I checked ebay and facebook marketplace and they're routinely still listed over MSRP.",
      "score": 1,
      "created_utc": 1731374969.0,
      "replies": []
    },
    {
      "id": "lwohclg",
      "author": "None",
      "body": "LOL",
      "score": 1,
      "created_utc": 1731375183.0,
      "replies": []
    },
    {
      "id": "lwoieii",
      "author": "None",
      "body": "Awesome news 🤦🏽‍♂️😉😂",
      "score": 1,
      "created_utc": 1731375557.0,
      "replies": []
    },
    {
      "id": "lwol8vy",
      "author": "Son-of-Suns",
      "body": "Where are they selling them at a loss? Just checked eBay. It's not happening there (at least at first glance).",
      "score": 1,
      "created_utc": 1731376569.0,
      "replies": []
    },
    {
      "id": "lwonau2",
      "author": "Nigel_Trumpberry",
      "body": "I truly hope these scalpers get what they deserve",
      "score": 1,
      "created_utc": 1731377298.0,
      "replies": []
    },
    {
      "id": "lwov83v",
      "author": "Praise-Bingus",
      "body": "You love to see it",
      "score": 1,
      "created_utc": 1731380189.0,
      "replies": []
    },
    {
      "id": "lwp04lp",
      "author": "None",
      "body": "Shocker",
      "score": 1,
      "created_utc": 1731382049.0,
      "replies": []
    },
    {
      "id": "lwp4iw1",
      "author": "Taki_Minase",
      "body": "Haha good job parasites.",
      "score": 1,
      "created_utc": 1731383816.0,
      "replies": []
    },
    {
      "id": "lwpb8yl",
      "author": "infamusforever223",
      "body": "That's what they get.",
      "score": 1,
      "created_utc": 1731386783.0,
      "replies": []
    },
    {
      "id": "lwpd7b2",
      "author": "Practical_Meanin888",
      "body": "Bought my ps5 2 years ago and played total of 10 hours. Playing just 1-2 hours on $80 games and losing interest",
      "score": 1,
      "created_utc": 1731387710.0,
      "replies": []
    },
    {
      "id": "lwpee8s",
      "author": "Drmo6",
      "body": "Had nothing to do with lack of interest. There’s just more available than scalpers expected. These greedy bastards thought they were gonna get a 2020 again.",
      "score": 1,
      "created_utc": 1731388298.0,
      "replies": []
    },
    {
      "id": "lwphckb",
      "author": "colaboksen2k",
      "body": "Sad fucking people, $$$$ root of all evil.",
      "score": 1,
      "created_utc": 1731389808.0,
      "replies": []
    },
    {
      "id": "lwpi4bh",
      "author": "123_fake_name",
      "body": "We only just got our ps5 recently we can’t afford to buy another console.",
      "score": 1,
      "created_utc": 1731390219.0,
      "replies": []
    },
    {
      "id": "lwpis2h",
      "author": "cavemold582",
      "body": "Haha good",
      "score": 1,
      "created_utc": 1731390578.0,
      "replies": []
    },
    {
      "id": "lwpuqd1",
      "author": "NIN10DOXD",
      "body": "They'll make bank once a new PS5 Pro costs $1,000 in a few months from tariffs.",
      "score": 1,
      "created_utc": 1731397777.0,
      "replies": []
    },
    {
      "id": "lwq19bz",
      "author": "None",
      "body": "Hahahahahhahahahahahahaha fucking losers",
      "score": 1,
      "created_utc": 1731402230.0,
      "replies": []
    },
    {
      "id": "lwqmqx0",
      "author": "Outrageous-Ruin-5226",
      "body": "Get a steam deck guys.",
      "score": 1,
      "created_utc": 1731415070.0,
      "replies": []
    },
    {
      "id": "lwqreou",
      "author": "StarLordCore",
      "body": "Good",
      "score": 1,
      "created_utc": 1731417093.0,
      "replies": []
    },
    {
      "id": "lwrkz77",
      "author": "Avon_Parksales",
      "body": "So, with all the flack the PS5 pro has gotten, they still thought it was a good idea to stock up? Good for them.",
      "score": 1,
      "created_utc": 1731427583.0,
      "replies": []
    },
    {
      "id": "lwzprdh",
      "author": "No_Alternative_3319",
      "body": "Are they not allowed to return them?",
      "score": 1,
      "created_utc": 1731536551.0,
      "replies": []
    },
    {
      "id": "lx381ut",
      "author": "haaiiychii",
      "body": "\"Lack of interest\"\n\nBut isn't it selling better than the PS4 Pro did? So more like they have an adequate supply.",
      "score": 1,
      "created_utc": 1731593815.0,
      "replies": []
    },
    {
      "id": "lwju7fs",
      "author": "Skaikrish",
      "body": "Probably also means on the Other Side there is Not that Big of a demand. Or Sony produced at Lot more this time.\nProbably a Bit of both tho",
      "score": 1,
      "created_utc": 1731312119.0,
      "replies": []
    },
    {
      "id": "lwjwbgh",
      "author": "iamdadmin",
      "body": "Good. Serves them right.",
      "score": 1,
      "created_utc": 1731313524.0,
      "replies": []
    },
    {
      "id": "lwk1cma",
      "author": "pragmatic84",
      "body": "Sony: \"Look at me! I am the scalper now!\"",
      "score": 1,
      "created_utc": 1731316983.0,
      "replies": []
    },
    {
      "id": "lwk39z8",
      "author": "DDFoster96",
      "body": "I'll take them off your hands for a peppercorn. They'll make good doorstops if nothing else.",
      "score": 1,
      "created_utc": 1731318324.0,
      "replies": []
    },
    {
      "id": "lwk3zwn",
      "author": "GameZard",
      "body": "Good thing no one wants a PS5 pro.",
      "score": 1,
      "created_utc": 1731318821.0,
      "replies": []
    },
    {
      "id": "lwk8p3b",
      "author": "ChickenAndRiceIsNice",
      "body": "I rage quit the PS5 when it came out and switched to Xbox for a couple years. Walked into an EB Games and got my PS5 Pro a few days ago! Such a good feeling to have normal supply again, for once.",
      "score": 1,
      "created_utc": 1731321966.0,
      "replies": []
    },
    {
      "id": "lwka4d4",
      "author": "Atzkicica",
      "body": "Baaaahahaha!",
      "score": 1,
      "created_utc": 1731322858.0,
      "replies": []
    },
    {
      "id": "lwketvw",
      "author": "airsoft04",
      "body": "I love it when people like this or small businesses owners cry about losing money. Yoo this is all part of the risk you took! No one told you to put the money down you did that for yourself! Don’t cry when you don’t get what you want!",
      "score": 1,
      "created_utc": 1731325649.0,
      "replies": [
        {
          "id": "lwlglgg",
          "author": "Fap_Left_Surf_Right",
          "body": "It’s bizarre they don’t own it. I spent a lot of my career in finance and this is very similar to futures trading. \n\nThe difference is futures traders own the decision. They didn’t blame everything under the sun bc they made a bad bet.",
          "score": 1,
          "created_utc": 1731340513.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwkieb6",
      "author": "analyticaljoe",
      "body": "I bought a PS5 Pro. It's OK. Not amazing. Not nothing. Is Spiderman 2 smoother? Yep. Was is it great on the P5 as-is? Yep.",
      "score": 1,
      "created_utc": 1731327525.0,
      "replies": []
    },
    {
      "id": "lwkk9t9",
      "author": "Spidaaman",
      "body": "Eat shit, scalpers.",
      "score": 1,
      "created_utc": 1731328451.0,
      "replies": []
    },
    {
      "id": "lwl5776",
      "author": "PhantomRoyce",
      "body": "I made the choice to Chuck out a few extra hundred bucks and built a pretty sweet gaming PC instead of getting a PS5 and I’m happy about it. If I do get one it’ll just be for my living room to play stuff I don’t feel like going to my PC for",
      "score": 1,
      "created_utc": 1731336762.0,
      "replies": []
    },
    {
      "id": "lwm9mpg",
      "author": "Cinder2010",
      "body": "Not to go all pcmr but honestly consoles aren't offering anything anymore. I loved my consoles, but it's overpriced and just as bulky anymore.  More games more everything. I hope they all realize that, and fix whatever the hell they doing now. It's insane",
      "score": 1,
      "created_utc": 1731349456.0,
      "replies": []
    },
    {
      "id": "lwmlg57",
      "author": "AlteredCabron2",
      "body": "funny thing is\n\nbuying a ps5 is not an experience anymore\n\nits just another tool in the house\n\nlife is wierd",
      "score": 1,
      "created_utc": 1731353047.0,
      "replies": []
    },
    {
      "id": "lwk615f",
      "author": "MasterLogic",
      "body": "Reddit lives in a bubble, the ps5 pro is selling faster than the ps4 pro. It's just when the ps5 launched we had covid halting production lines and limiting stock. With the pro launch Sony have been able to produce enough stock to handle the demand.\n\n\nIt's pretty simple to understand. Has nothing to do with nobody wanting a pro, they've just made enough of them this time that each shop isn't limited to 5 consoles like before. ",
      "score": -1,
      "created_utc": 1731320188.0,
      "replies": [
        {
          "id": "lwk8dyx",
          "author": "Agent101g",
          "body": "1-2 years from now it'll be obsolete",
          "score": 4,
          "created_utc": 1731321766.0,
          "replies": [
            {
              "id": "lwkoslo",
              "author": "Darkiedarkk",
              "body": "With them still thinking it’s running on 4k but it’s just upscaling. I bet the ps6 is gonna launch with less features too.",
              "score": 3,
              "created_utc": 1731330484.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lwkc42l",
      "author": "Witram",
      "body": "Post the story of the thing get karma point reddit thing story of the game the game the",
      "score": 0,
      "created_utc": 1731324077.0,
      "replies": []
    },
    {
      "id": "lwkfr9e",
      "author": "objecter12",
      "body": "Finally some good fucking news",
      "score": 0,
      "created_utc": 1731326157.0,
      "replies": []
    },
    {
      "id": "lwksevk",
      "author": "SergeantSlapNuts",
      "body": "Good.  Hopefully they all end up bankrupt and on the streets.",
      "score": 0,
      "created_utc": 1731331979.0,
      "replies": []
    },
    {
      "id": "lwl91a1",
      "author": "blacksoxing",
      "body": "I will always type this: I support the idea of scalping as I lived in a small town where you had TWO retail stores in a 25 mile radius.....and while I never bought from scalpers I had to wait sometimes MONTHS for a product to get stocked (which would sometimes seemingly never hit the floor!) \n\nI think many people get outraged at the notion of a scalper charging say 25% higher for a product....if that person in the small town can play the console then what's the harm? I now live in a big city and have ways to get notifications the moment these things drop BUT again, if you're that parent in small town USA (or wherever) who is trying to buy that big present of a PS5 Pro for the fam....why can't a scalper step in to assist if they can't find it on their normal online retailers or in stores???",
      "score": 0,
      "created_utc": 1731338068.0,
      "replies": []
    },
    {
      "id": "lwlzc8z",
      "author": "SHADOWSTRIKE1",
      "body": "There is zero chance they are selling them for a loss this soon.  Scalpers can easily return merchandise that isn’t selling well this close to release.\n\nThe auction the article linked as “evidence” was just starting out and they said it was going for $560.  Well as of right now it’s up to $770, which is over retail price, and still has several days left.\n\nThis article is nothing.  I dislike scalpers as much as the next guy, but this is just clickbait.",
      "score": 0,
      "created_utc": 1731346328.0,
      "replies": []
    },
    {
      "id": "lwnovmt",
      "author": "AllCommiesRFascists",
      "body": "Reddit finds out the law of supply and demand swings both ways. Hopefully scalpers make up the profit in other products",
      "score": 0,
      "created_utc": 1731365233.0,
      "replies": []
    },
    {
      "id": "lwnox6x",
      "author": "Quirky-Pie9661",
      "body": "Oh they’ll sell once self destructive voters figure out tariffs are not the Tussin solution to the economy",
      "score": 0,
      "created_utc": 1731365248.0,
      "replies": []
    },
    {
      "id": "lwpb4r4",
      "author": "zerostar83",
      "body": "That's such a misleading title. They aren't forced to sell anything, they can keep the items they purchased.",
      "score": 0,
      "created_utc": 1731386729.0,
      "replies": []
    },
    {
      "id": "lwpne9f",
      "author": "RevolEviv",
      "body": "It's not a \"Lack of interest\" it's because Sony made many many units to prevent scalping amongst other things. It's selling better than PS4 PRO, it's #1 console on Amazon worldwide and MLID reports that insiders say they are selling extremely well (80% of stock gone and they had a LOT of stock).",
      "score": 0,
      "created_utc": 1731393198.0,
      "replies": []
    },
    {
      "id": "lwklpbl",
      "author": "DR_van_N0strand",
      "body": "How did this false story manage to get so much traction?\n\nObviously that’s bullshit and anyone who bought one to scalp can just return it for all their money back. \n\nAny sold at a “loss” are obviously stolen by people who dont have that option.",
      "score": -5,
      "created_utc": 1731329121.0,
      "replies": [
        {
          "id": "lwkug3s",
          "author": "SUPRVLLAN",
          "body": "Because people vote with emotion above all else.",
          "score": -1,
          "created_utc": 1731332784.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwjy88a",
      "author": "datsmamail12",
      "body": "What if Sony was the good guy all along and raised the price for PS5 Pro only to screw the scalpers knowing well enough that no one's gonna buy this crap \"upgrade\"?",
      "score": -2,
      "created_utc": 1731314836.0,
      "replies": []
    },
    {
      "id": "lwkq263",
      "author": "trunolimit",
      "body": "Nice",
      "score": -1,
      "created_utc": 1731331021.0,
      "replies": []
    },
    {
      "id": "lwkq53t",
      "author": "Disastrous-Resident5",
      "body": "I don’t get it, is this supposed to be bad news? This is great news!",
      "score": -1,
      "created_utc": 1731331056.0,
      "replies": []
    },
    {
      "id": "lwkdqal",
      "author": "ElPispo",
      "body": "I’ll literally only get it just to play GTA 6 on it. Then sell it immediately once it comes out on PC",
      "score": -3,
      "created_utc": 1731325029.0,
      "replies": []
    },
    {
      "id": "lwkmlce",
      "author": "TheBoringJourneyToIn",
      "body": "If I like the ps5 pro I get down voted. If I dislike the steam deck I get downvoted. Both priced the same. \n\nReddit is wild sometimes.",
      "score": -3,
      "created_utc": 1731329523.0,
      "replies": []
    }
  ]
}