{
  "post": {
    "title": "Nintendo expects to sell fewer Switches than planned as new model looms / It expects to sell 12.5 million units this year instead of the 13.5 million it previously forecast.",
    "author": "a_Ninja_b0y",
    "id": "1gkcrq3",
    "score": 1266,
    "created_utc": 1730829288.0,
    "selftext": "",
    "num_comments": 115,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gkcrq3/nintendo_expects_to_sell_fewer_switches_than/"
  },
  "comments": [
    {
      "id": "lvk7zrp",
      "author": "CrippledCox",
      "body": "Oh no! That means they will only sell 155 million total over the consoles lifetime instead of 156 million!",
      "score": 481,
      "created_utc": 1730830491.0,
      "replies": [
        {
          "id": "lvk8k6i",
          "author": "ahmed132wine",
          "body": "Truly sad day for nintendo! How will the CEO feed his kids!",
          "score": 135,
          "created_utc": 1730830654.0,
          "replies": [
            {
              "id": "lvk8yfa",
              "author": "Brandunaware",
              "body": "Same way he always has. Leftover Mario cereal from the '90s.",
              "score": 88,
              "created_utc": 1730830768.0,
              "replies": [
                {
                  "id": "lvkzogh",
                  "author": "MtnDewTangClan",
                  "body": "Ah. He really is just like me.",
                  "score": 25,
                  "created_utc": 1730838571.0,
                  "replies": [
                    {
                      "id": "lvoxsx7",
                      "author": "HenkPoley",
                      "body": "“He issa justa laika mee!”",
                      "score": 2,
                      "created_utc": 1730893761.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvlueah",
                  "author": "liquidben",
                  "body": "Nintendo - it’s a cereal you know",
                  "score": 8,
                  "created_utc": 1730847737.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvlidgk",
              "author": "Jgabes625",
              "body": "A sad day for Nintendo and therefore the world.",
              "score": 6,
              "created_utc": 1730843993.0,
              "replies": [
                {
                  "id": "lvn3l57",
                  "author": "Suspicious-Bid-53",
                  "body": "The little mushroom people of Nova Scotia screaming in terror",
                  "score": 3,
                  "created_utc": 1730863649.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lvlz1j4",
              "author": "Specialist-Rope-9760",
              "body": "Don’t worry they’ll probably sue some YouTubers or something for playing a Mario stream to make up some lost cash",
              "score": 3,
              "created_utc": 1730849293.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvla5u7",
          "author": "matej86",
          "body": "PS2 sold 155 million. You know the execs are absolutely targeting that for lifetime Switch sales.",
          "score": 46,
          "created_utc": 1730841621.0,
          "replies": [
            {
              "id": "lvlmbet",
              "author": "redsterXVI",
              "body": "At this point there's no chance the Switch isn't going to beat that. While in rich nations Switches might not sell anymore and vanish from store shelves once the Switch 2 is released, in poorer nations it will only really become affordable at that point. They will still sell this for years.",
              "score": 26,
              "created_utc": 1730845191.0,
              "replies": [
                {
                  "id": "lvloug9",
                  "author": "redsterXVI",
                  "body": "Just checked the PS2. The PS3 released in Nov 2006 but the PS2 was sold until the end of 2012. 6 more years! Total lifetime was 12 years, so it was previous gen during half its run! It seems to have sold ~37M (of the total 155M) times while the PS3 was already on the market!",
                  "score": 14,
                  "created_utc": 1730845975.0,
                  "replies": [
                    {
                      "id": "lvn05nx",
                      "author": "negcap",
                      "body": "My son took my old PS2 to college and still plays it every day. I am trying to find a cheap copy of Parappa and Jet Moto 2 for him.",
                      "score": 5,
                      "created_utc": 1730862416.0,
                      "replies": []
                    },
                    {
                      "id": "lvma2ep",
                      "author": "gramathy",
                      "body": "Yeah the ps2 has a long lifespan especially in poorer countries",
                      "score": 1,
                      "created_utc": 1730853063.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvlkfmy",
              "author": "None",
              "body": "a price drop and it clears that easy lol",
              "score": 29,
              "created_utc": 1730844613.0,
              "replies": []
            },
            {
              "id": "lvn1aub",
              "author": "_RADIANTSUN_",
              "body": "They had the opportunity with the DS But they dropped it out for the 3DS",
              "score": 1,
              "created_utc": 1730862829.0,
              "replies": []
            },
            {
              "id": "lvlswc4",
              "author": "ChafterMies",
              "body": "Switch is a handheld. Nintendo DS sold 154M so Switch is already closing in on the best selling handheld outside of phones. But keep in mind that at the time Nintendo sold so many DS units, Nintendo also sold 101M Wii units. Overall, Nintendo is down about 100M total units from its Wii/DS peak.",
              "score": -5,
              "created_utc": 1730847252.0,
              "replies": [
                {
                  "id": "lvltnqo",
                  "author": "MrSnowmanJoe",
                  "body": "The Switch hasn't outsold the DS yet.",
                  "score": 7,
                  "created_utc": 1730847498.0,
                  "replies": [
                    {
                      "id": "lvm5i1y",
                      "author": "ChafterMies",
                      "body": " My mistake.",
                      "score": 2,
                      "created_utc": 1730851480.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvki60g",
      "author": "sciolycaptain",
      "body": "My Switch is in pretty bad condition, and I would like to replace it with the OLED. But that seems silly knowing the Switch 2 will be out next year.",
      "score": 162,
      "created_utc": 1730833417.0,
      "replies": [
        {
          "id": "lvkpxd3",
          "author": "Shoelebubba",
          "body": "I’m sort of hoping for an OLED option at launch because losing out on how nice the OLED screen looks on the current Switch to get a different type of screen on the Switch 2 would be a bummer.",
          "score": 51,
          "created_utc": 1730835692.0,
          "replies": [
            {
              "id": "lvm7sbs",
              "author": "clara_the_cow",
              "body": "There’s noooo way a switch 2 comes out without an OLED screen, right? That’d be so ridiculous",
              "score": 35,
              "created_utc": 1730852283.0,
              "replies": [
                {
                  "id": "lvmokir",
                  "author": "kurttheflirt",
                  "body": "Well it is Nintendo so we really don’t know til it launches",
                  "score": 21,
                  "created_utc": 1730858222.0,
                  "replies": [
                    {
                      "id": "lwbjcq5",
                      "author": "None",
                      "body": "Now with cost effective e-ink! How quirky is Nintendo, right?",
                      "score": 1,
                      "created_utc": 1731191439.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvmkkyx",
                  "author": "CMDR_omnicognate",
                  "body": "Maybe, on one hand the OLED is so much nicer than the standard one, on the other hand, it complicates production, plus if they release an OLED version separately in like 2 years time or so there’s a lot of people that bought the switch 2 that will buy an OLED version on top of the one they already have",
                  "score": 12,
                  "created_utc": 1730856794.0,
                  "replies": []
                },
                {
                  "id": "lvn1up2",
                  "author": "MarcoSolo23",
                  "body": "Rumors are the new one will have an LCD screen",
                  "score": 2,
                  "created_utc": 1730863028.0,
                  "replies": [
                    {
                      "id": "lvn2h6d",
                      "author": "clara_the_cow",
                      "body": "I saw rumors of a $400 price point, I can’t imagine charging more than the current OLED while downgrading the screen",
                      "score": 7,
                      "created_utc": 1730863251.0,
                      "replies": [
                        {
                          "id": "lvo4e2v",
                          "author": "HKei",
                          "body": "I think your imagination needs some work, there's plenty of handheld devices sold at that price point with LCD screens.",
                          "score": 1,
                          "created_utc": 1730878308.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvnnmp2",
                  "author": "Juggernox_O",
                  "body": "Knowing that the OLED will come at some point, I will happily wait until the OLED 2 comes out. Early adopting has bitten me in the ass every time.",
                  "score": 2,
                  "created_utc": 1730871431.0,
                  "replies": [
                    {
                      "id": "lvnpmcm",
                      "author": "hypnotichellspiral",
                      "body": "I think I will do the same. I have a huge backlog of games I kinda want to play through anyway, so I'm not exactly wanting for new content to entertain me.",
                      "score": 3,
                      "created_utc": 1730872259.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lvneum5",
                  "author": "The-student-",
                  "body": "Rumors suggest no OLED at launch. ",
                  "score": 1,
                  "created_utc": 1730867876.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lvkjhv3",
          "author": "Esternaefil",
          "body": "Agreed. My family has two, one we bought and one we inherited. But when my son turned six he ran off with the one I was using as my personal machine and I've been tempted to get a new one ever since. But I've held off... Knowing there is a new version incoming makes it seem so illogical to buy an older model now.",
          "score": 13,
          "created_utc": 1730833807.0,
          "replies": []
        },
        {
          "id": "lvn4lq6",
          "author": "Mother_Restaurant188",
          "body": "Definitely wait at this point unless it’s completely unplayable.\n\nI got the Switch OLED when it launched even though my Switch OG was totally fine (except for the awful battery life).\n\nWorth every penny.",
          "score": 3,
          "created_utc": 1730864013.0,
          "replies": []
        },
        {
          "id": "lvmu6j2",
          "author": "None",
          "body": "You can probably get the oled console only for less than 180. Not worth getting unless your switch is bricked tho imo",
          "score": 2,
          "created_utc": 1730860276.0,
          "replies": []
        },
        {
          "id": "lvmufe5",
          "author": "bigsnow999",
          "body": "Wait for another because of those disgusting scalpers",
          "score": 1,
          "created_utc": 1730860366.0,
          "replies": []
        },
        {
          "id": "lvs3hlw",
          "author": "JPWRana",
          "body": "I am selling a brand new switch OLED in case you are interested.",
          "score": 1,
          "created_utc": 1730926064.0,
          "replies": []
        },
        {
          "id": "lvlziji",
          "author": "Specialist-Rope-9760",
          "body": "It will be interesting as long as they don’t totally fuck up backwards compatibility. I think that will make or break the system. \n\nIt will also be interesting where OLED sits in the new lineup and if they would launch with multiple options out of the gate. It would be hard to expect current OLED users to downgrade their screens",
          "score": 1,
          "created_utc": 1730849452.0,
          "replies": [
            {
              "id": "lvoicei",
              "author": "CarlosFer2201",
              "body": "They just announced backwards compatibility yesterday. They didn't specify if that includes physical copies though.",
              "score": 2,
              "created_utc": 1730885258.0,
              "replies": []
            },
            {
              "id": "lvok9hw",
              "author": "Weir99",
              "body": "Rumours seem to indicate only a base option at release. Nintendo's probably seen enough disastrous console launches that they don't want to over produce for this one.\n\nIf sales go well, I would bet that we'll see an OLED and Lite model earlier in the new devices lifecycle than what happened with the Switch",
              "score": 1,
              "created_utc": 1730886412.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvk97q9",
      "author": "Brandunaware",
      "body": "Teasing a successor that's probably backwards compatible but not announcing anything concrete does not seem like a great strategy for selling the current model. They've made money hand over fist on this thing so they're fine, but I have to wonder what their communications strategy is. Or maybe it's supply issues and the timeline went pear shaped on them.",
      "score": 86,
      "created_utc": 1730830841.0,
      "replies": [
        {
          "id": "lvkrh2o",
          "author": "Jamie00003",
          "body": "It’s Nintendo. Communication has always been terrible with them. Fans want a switch 2, they get Alarmo",
          "score": 57,
          "created_utc": 1730836147.0,
          "replies": [
            {
              "id": "lvkusz8",
              "author": "jarvis_says_cocker",
              "body": "Don't forget the music app!",
              "score": 12,
              "created_utc": 1730837133.0,
              "replies": [
                {
                  "id": "lvr1c7a",
                  "author": "lowtoiletsitter",
                  "body": "The music app is pretty cool. I need the OG legend of Zelda theme while running errands. Or working. Or anything.",
                  "score": 1,
                  "created_utc": 1730915667.0,
                  "replies": [
                    {
                      "id": "lvr2cdc",
                      "author": "jarvis_says_cocker",
                      "body": "Is it on the app currently? I don't see any Zelda games pre-64 in the music app.",
                      "score": 1,
                      "created_utc": 1730915939.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvml7tu",
              "author": "CMDR_omnicognate",
              "body": "Nintendo won’t want to announce a switch successor until after the holiday period, since they sell bucketloads of consoles over that time period as Christmas gifts, announcing a new console coming out in the next 6-9 months from now would probably dissuade a lot of parents from buying them for their kids",
              "score": 6,
              "created_utc": 1730857028.0,
              "replies": [
                {
                  "id": "lvpog5h",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1730902379.0,
                  "replies": [
                    {
                      "id": "lvpopwv",
                      "author": "AutoModerator",
                      "body": "Hello, /u/Jamie00003! Thanks for contributing. However, your comment has been automatically removed. techradar.com is banned from /r/gadgets due to placement of malicious advertising.\n\n\"Malicious advertisments\" include, but are not limited to:\n\n* Unexpected redirection to other sites, or unexpected opening of additional background tabs\n\n* Ads for scams or malware, such as \"you've won the lottery\" or \"virus detected\".\n\n* Advertisements that run malicious script.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
                      "score": 1,
                      "created_utc": 1730902460.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lvmelrl",
              "author": "dan-theman",
              "body": "At least it runs Doom.",
              "score": 4,
              "created_utc": 1730854621.0,
              "replies": []
            },
            {
              "id": "lvl3h3g",
              "author": "_Didds_",
              "body": ">Communication has always been terrible with them.\n\nI have an alternate take, maybe with rose tinted glasses, but something I really belive to be true.\n\nThey are the best from the big 3 console market players at communicating things without exaggerated hype or making fans guess what they mean.\n\nMicrosoft and Sony are happy to tease their products and new consoles and let fans build their hype over incomplete information, or limited information. Most other major player console launch was marked with people having to guess or decrypt what some features would mean, console version capabilities and limitations and how they eoukd fare vs the competition. Most of the time a clear picture is only provided by 3rd party websites, post launch reviews or other similar sort of media.\n\nNow Nintendo doesn't take part of that game. They will talk to consumers when they feel it's the correct time for them, and not fall to temptation to build hype with vague information in between. Their launch communication will provide a clear picture of what the product is, their gimmick vs the competition and what to expect from it. Reviews post launch won't uncover for the most part new stuff or shocking limitations cause it will be made clear by Nintendo what the product is. They will talk less, and less often, but when they do they will nail the pin in the head and not dance around the subject.\n\nAnd breaking the above rule that's one thing that made the Wii U a failure. They failed to communicate clearly what the console was and aimed to achieve, it's features and 3rd party communication ran wild with it, instead of Nintendo taking the active voice.\n\nI honestly preffer their method of talking when they feel like they should and not when people try to pressure them to, and try to make them in control of their own narrative instead of relying to hype or hear say. And that's why most Nintendo fans can really on the good old method of if Nintendo doesn't say something then it's not oficial, or otherwise they woukd say it themselves.",
              "score": 6,
              "created_utc": 1730839678.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvl0kyg",
          "author": "Esc777",
          "body": "Being off by like 8% isn’t a huge issue. \n\nFrankly I’m surprised *anyone* is buying a switch right now. ",
          "score": 11,
          "created_utc": 1730838835.0,
          "replies": [
            {
              "id": "lvl1j3c",
              "author": "Estrava",
              "body": "The general consumer probably doesn’t think or read news on if a new one is coming. It still makes great gifts for kids and new games like Mario party will come out and people will get the console for the first time.",
              "score": 7,
              "created_utc": 1730839114.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvkpmxb",
          "author": "Sir_Lanian",
          "body": "Why would they announce a new console before the Christmas period? That's just stupidity.",
          "score": 3,
          "created_utc": 1730835608.0,
          "replies": []
        },
        {
          "id": "lvlqt7x",
          "author": "jibbyjackjoe",
          "body": "You're joking, right? Announcing it now right before the holiday would plummet the sales of current consoles.",
          "score": 3,
          "created_utc": 1730846591.0,
          "replies": []
        },
        {
          "id": "lvkds92",
          "author": "wicktus",
          "body": "Ensuring a strong line-up and solid supplies, don’t look beneath that imho especially since it was apparently slated for a Q4 2024 launch but delayed to ensure a stronger launch ",
          "score": 3,
          "created_utc": 1730832147.0,
          "replies": [
            {
              "id": "lvkv4e8",
              "author": "Shakey_J_Fox",
              "body": "I hope so. Nintendo hasn’t had a system launch with a solid exclusive lineup since GameCube. I just want to do more than play a wii sports type game for the first six months after release otherwise what’s the point of early adoption?",
              "score": -1,
              "created_utc": 1730837229.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvkoyrp",
          "author": "CrippledCox",
          "body": "They had a major investor meeting and had to confirm when the next console was coming. I’m sure they would have done it differently if it didn’t line up with that.",
          "score": 1,
          "created_utc": 1730835410.0,
          "replies": []
        },
        {
          "id": "lvld4tp",
          "author": "jp007",
          "body": "What has Nintendo teased? I wanna see!",
          "score": 1,
          "created_utc": 1730842482.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvks0o4",
      "author": "None",
      "body": "Seems like they want the best selling console of all time crown from the PS2:\nhttps://en.wikipedia.org/wiki/List_of_best-selling_game_consoles?wprov=sfti1#Best-selling_game_consoles\n\nOnce they announce the successor, sales will likely plummet.",
      "score": 39,
      "created_utc": 1730836309.0,
      "replies": [
        {
          "id": "lvl7nwb",
          "author": "blueblurz94",
          "body": "They know they can beat the 155 million figure, which was Sony’s last officially confirmed total for the PS2 in 2012. Anything above that is just a bonus for Nintendo to boost their lead as the new all-time sales king of consoles after nearly 2 decades(PS2 took the crown from the Gameboy/Gameboy Color in mid-2007). That 160 million statement from former Sony CEO Jim Ryan earlier this year as he was retiring has not been officially confirmed or supported by Sony themselves. So the 155 million figure is the official number to beat. It’s only fair since Nintendo posts official numbers every quarter.",
          "score": 19,
          "created_utc": 1730840889.0,
          "replies": [
            {
              "id": "lvo19ha",
              "author": "uo_taipon",
              "body": "His statement kinda sounded like an attempt to keep the best selling console title.",
              "score": 3,
              "created_utc": 1730876993.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lx26z7n",
          "author": "talllankywhiteboy",
          "body": "I’m expecting the Switch to take up the “budget” portion of the Nintendo line up for a few years. If they drop the price of the Switch Lite by $50 and bundle something like Mario Kart 8 with it, it would still be a great buy for kids. ",
          "score": 2,
          "created_utc": 1731574760.0,
          "replies": []
        },
        {
          "id": "lvnkx6m",
          "author": "Atlastitsok",
          "body": "Had no idea the DS sold so well",
          "score": 1,
          "created_utc": 1730870300.0,
          "replies": [
            {
              "id": "lvnrq55",
              "author": "Grabsy",
              "body": "The fact that it sold only 1million less than the PS2 pisses someone at Nintendo off IMMENSELY",
              "score": 7,
              "created_utc": 1730873134.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lvlmnoq",
      "author": "-Luro",
      "body": "My son wants a switch. I explained that if we wait a bit we can get the new one that will most likely (hopefully) play older games too. Also no point in getting a switch now because you won’t be able to play all new games that will come out for years…",
      "score": 15,
      "created_utc": 1730845296.0,
      "replies": []
    },
    {
      "id": "lvlb5c0",
      "author": "None",
      "body": "I wanted to get a switch last year but didn’t buy one because I know there is a new one coming.",
      "score": 10,
      "created_utc": 1730841906.0,
      "replies": []
    },
    {
      "id": "lvmk3yz",
      "author": "CMDR_omnicognate",
      "body": "It’s worth mentioning that the switch, a console that has been out for nigh on 8 years now, sold about half as many units as the x/s in its entire lifespan in this year alone.",
      "score": 8,
      "created_utc": 1730856621.0,
      "replies": [
        {
          "id": "lvndd36",
          "author": "FlowerBoyScumFuck",
          "body": "Yea but half the lifetime sales from the past 6 months are twice that, and that's just this year alone. Not to mention sales are forecasted to triple by 27% in the next quarter, according to year over year sales projections from last years pre-sales over the next quarter's yearly profits.",
          "score": 2,
          "created_utc": 1730867301.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvlmp8h",
      "author": "fundiedundie",
      "body": "Switch 2 next summer or fall.",
      "score": 3,
      "created_utc": 1730845310.0,
      "replies": []
    },
    {
      "id": "lvo1t1g",
      "author": "Mister-Nash-Ketchum",
      "body": "Who gives a flying fuck??",
      "score": 4,
      "created_utc": 1730877216.0,
      "replies": []
    },
    {
      "id": "lvkl5gx",
      "author": "Gsquat",
      "body": "I just wish the new model was more powerful. It doesn't even out-pace the steam deck, which has been out for years. It was pretty disappointing to see insane frame drops in a game like Pokémon Violet.",
      "score": 11,
      "created_utc": 1730834290.0,
      "replies": [
        {
          "id": "lvm7fx8",
          "author": "None",
          "body": "[deleted]",
          "score": 12,
          "created_utc": 1730852165.0,
          "replies": [
            {
              "id": "lvmdm9f",
              "author": "whoknows234",
              "body": "Seemed to be a focus back in the Ultra64/Nintendo 64 days...\n\nEdit: Also the Gamecube was more powerful than the PS2.",
              "score": 3,
              "created_utc": 1730854281.0,
              "replies": []
            },
            {
              "id": "lvm7nev",
              "author": "Gsquat",
              "body": "I guess. I just want the games to run well. That's all.",
              "score": 1,
              "created_utc": 1730852237.0,
              "replies": []
            },
            {
              "id": "lwh2vvz",
              "author": "ye_olde_green_eyes",
              "body": "The slow-down on that Link's Awakening remake was jarring and awful. I don't need better graphics from Nintendo, but I do hope that their games will run at 60fps on the Switch 2 at a minimum.",
              "score": 1,
              "created_utc": 1731272853.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvo2uh4",
          "author": "KowardlyMan",
          "body": "Remember that if you see frame drops in an exclusive, it's really not the console's fault. It's completely the developer. They could have worked on performances better (in the case of Pokemon, the new games are terribly optimized), or used a graphical style that is less resource intensive. We're not talking about ports, the game is done for this hardware.",
          "score": 3,
          "created_utc": 1730877639.0,
          "replies": [
            {
              "id": "lvp9fpc",
              "author": "Gsquat",
              "body": "Right. That's what someone else said. I guess my point was I definitely wanted to see the Switch 2 be a little more capable than the steam deck and it doesn't look like that's going to happen. I'll still probably get one and enjoy it, but just nitpicking. I trust the MP4 will be optimized well. I just hope to never experience a AAA title perform that bad on a console again.",
              "score": 2,
              "created_utc": 1730897762.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvng0bd",
          "author": "TeacupsInTime",
          "body": "Iirc weren't the rumors that it'd be around PS4 level?  I think that puts it around the power of the Steam Deck",
          "score": 2,
          "created_utc": 1730868328.0,
          "replies": [
            {
              "id": "lvp8t61",
              "author": "Gsquat",
              "body": "I saw it was supposed to be close, but still fall a little short. I really feel that it should outperform the Steam Deck given the extra years of development and having all the funds/resources of a company as big as Nintendo.",
              "score": 2,
              "created_utc": 1730897556.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lvo6ugq",
          "author": "KowardlyMan",
          "body": "Remember that if you see frame drops in an exclusive, it's really not the console's fault. It's completely the developer. They could have worked on performances better (in the case of Pokemon, the new games are terribly optimized), or used a graphical style that is less resource intensive. We're not talking about ports, the game is done for this hardware.",
          "score": 2,
          "created_utc": 1730879383.0,
          "replies": []
        },
        {
          "id": "lvkrv9y",
          "author": "Jamie00003",
          "body": "What kind of statement is that? Of course the switch is weaker, it came out in 2017. Deck came out in 2022. Having said that switch 2 will probably still be weaker",
          "score": 1,
          "created_utc": 1730836265.0,
          "replies": [
            {
              "id": "lvl0e6x",
              "author": "Gsquat",
              "body": "But I was talking about the Switch 2...\n\nRecap: I wish the new Switch coming out would be more powerful than it is. \n\nThe original switch was disappointing because of that same issue.",
              "score": 4,
              "created_utc": 1730838780.0,
              "replies": [
                {
                  "id": "lvl45l0",
                  "author": "Augen76",
                  "body": "Nintendo's two biggest success stories (Wii and Switch) have something in common. They were under powered from day one.  I'd be shocked if they didn't release their next system underpowered as well learning from this.",
                  "score": 4,
                  "created_utc": 1730839873.0,
                  "replies": [
                    {
                      "id": "lvl8smc",
                      "author": "None",
                      "body": "Art direction > specs. That helps almost every single Nintendo exclusive.",
                      "score": 11,
                      "created_utc": 1730841220.0,
                      "replies": [
                        {
                          "id": "lvl91o2",
                          "author": "Augen76",
                          "body": "Also makes them age so much better. Realism in ten years struggles, but style holds up",
                          "score": 8,
                          "created_utc": 1730841294.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lvlvfj5",
                      "author": "used_",
                      "body": "It’s been a key business strategy for them. They take older, establish technology (thus cheaper) and design their systems off that.",
                      "score": 3,
                      "created_utc": 1730848078.0,
                      "replies": []
                    },
                    {
                      "id": "lvlh62z",
                      "author": "Gsquat",
                      "body": "I mean, don't get me wrong. I can't wait to play Metroid Prime 4. I just wish I could play it at high frames/textures/resolution without issue. That's all I'm asking for.",
                      "score": 1,
                      "created_utc": 1730843647.0,
                      "replies": []
                    },
                    {
                      "id": "lvlli99",
                      "author": "BandiriaTraveler",
                      "body": "I hope they make it at least a bit more up to date than the og Switch, whose chipset was dated even in 2017. The Switch was a great indie machine in the early years, but it has really struggled with some big indie games in more recent years. And even first party games have had performance issues since day one, and increasingly so as time has gone on. It would be nice to have a reason to use my Switch more than a week or two a year when one of the big first party releases drops.",
                      "score": 1,
                      "created_utc": 1730844942.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lvkqnen",
      "author": "Feesuat69",
      "body": "What about the video games that get bought on the switch?",
      "score": 2,
      "created_utc": 1730835905.0,
      "replies": []
    },
    {
      "id": "lvky4zk",
      "author": "N3M3S1S75",
      "body": "Everyone is holding out",
      "score": 4,
      "created_utc": 1730838121.0,
      "replies": [
        {
          "id": "lvnuhc5",
          "author": "LookAtTheFlowers",
          "body": "I feel like I am truly the odd one out. \n\nI see what everyone is saying, but I still want to get an OLED. I’d been contemplating getting a Switch Lite for the last 5 years. Never did. Then I start paying attention to the OLED recently. I like it. \n\nSome are saying it (Switch 2) could be released next fall. That’s too long for me. Between now and then I’ll have a combined four months off work.  I could play so much. I’ve saved up for it so why not. I’m gonna do it.",
          "score": 1,
          "created_utc": 1730874245.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvm9239",
      "author": "leppernfriends",
      "body": "So they are going to lose 250 millions to piracy 😱",
      "score": 1,
      "created_utc": 1730852719.0,
      "replies": []
    },
    {
      "id": "lvmgqn0",
      "author": "fayrent20",
      "body": "My original switch wasn’t doing well almost exploding battery pack. I got a brand new OLED just a few days ago. Love it!!!!!!!!!",
      "score": 1,
      "created_utc": 1730855395.0,
      "replies": []
    },
    {
      "id": "lvn11o3",
      "author": "Public-Rutabaga4575",
      "body": "Metroid prime 4 will be my life for a short time when it comes out.",
      "score": 1,
      "created_utc": 1730862736.0,
      "replies": []
    },
    {
      "id": "lvn1qzm",
      "author": "HaloGuy381",
      "body": "If they’d kindly give us more info about what consoles the future games will be on, that would help. I’m still waiting 9 months in to hear if I need a new console for Pokemon Legends ZA or if my existing Switch will suffice, because the concept of news is a myth with Nintendo. (I don’t care if the game is still a ways out, they should know what -platform- it’s on by now.)",
      "score": 1,
      "created_utc": 1730862991.0,
      "replies": []
    },
    {
      "id": "lvn29hz",
      "author": "None",
      "body": "Down with the king. Long live the king.",
      "score": 1,
      "created_utc": 1730863174.0,
      "replies": []
    },
    {
      "id": "lvn6qwq",
      "author": "Ready-Sometime5735",
      "body": "🥱",
      "score": 1,
      "created_utc": 1730864787.0,
      "replies": []
    },
    {
      "id": "lvnp2wq",
      "author": "Muzician",
      "body": "I predict a WiiU type thing where the Joycons remain the main controller and just the unit itself is an upgrade. The current form factor has room for a bigger display, internals, battery etc.",
      "score": 1,
      "created_utc": 1730872034.0,
      "replies": []
    },
    {
      "id": "lvo3l9m",
      "author": "Less_Party",
      "body": "For reference the WiiU and Vita were both in the 12-15 million ballpark for lifetime sales.",
      "score": 1,
      "created_utc": 1730877945.0,
      "replies": []
    },
    {
      "id": "lvopq8h",
      "author": "nopalitzin",
      "body": "My bad. I pirated a 30yo game.",
      "score": 1,
      "created_utc": 1730889758.0,
      "replies": []
    },
    {
      "id": "lvpgzj7",
      "author": "antisp1n",
      "body": "Someone TLDR me on what this means in the Switch vs PS2 number game. Chances of PS2 being dethroned?",
      "score": 1,
      "created_utc": 1730900137.0,
      "replies": []
    },
    {
      "id": "lvqy1io",
      "author": "CycloneMonkey",
      "body": "Welp, it's been a good 135 years boys, time to pack it up. Looking forward to Mario Odyssey 2 on the PS5.",
      "score": 1,
      "created_utc": 1730914784.0,
      "replies": []
    },
    {
      "id": "lvr3dhh",
      "author": "EpicMachine",
      "body": "Nintenpoo will only release Switch2 if they stop selling Switch1 units. \n\nUntil then, there will never be a Switch2.",
      "score": 1,
      "created_utc": 1730916230.0,
      "replies": []
    },
    {
      "id": "lvs3mh3",
      "author": "JPWRana",
      "body": "In case anyone is interested. I am selling a brand new switch OLED. Send me a dm for more info",
      "score": 1,
      "created_utc": 1730926099.0,
      "replies": []
    },
    {
      "id": "lvta6lo",
      "author": "Sevencross",
      "body": "Well duh, I’m not buying a second one for Christmas. Anyone who have a shit already has one",
      "score": 1,
      "created_utc": 1730938738.0,
      "replies": []
    },
    {
      "id": "lvycczc",
      "author": "kinisonkhan",
      "body": "They'll sell even fewer with tariffs attached.",
      "score": 1,
      "created_utc": 1731009395.0,
      "replies": []
    },
    {
      "id": "lw8vjtp",
      "author": "Gutmach1960",
      "body": "Trump’s tariffs are going to kill that projection.",
      "score": 1,
      "created_utc": 1731159321.0,
      "replies": []
    },
    {
      "id": "lvlsp5k",
      "author": "bonesnaps",
      "body": "Who wants to buy mine, my Steam Deck blows it out of the water and into a distance galaxy void of life and overpriced Nintendo games/ports.\n\nI mostly just end up using the SD for steam indie games anyways though lol.",
      "score": 0,
      "created_utc": 1730847186.0,
      "replies": []
    },
    {
      "id": "lvmupg4",
      "author": "Tourman36",
      "body": "Why is switch even still a thing when Steam deck and various other handlers run circles around this thing?",
      "score": -2,
      "created_utc": 1730860468.0,
      "replies": [
        {
          "id": "lvp7r6k",
          "author": "baltimorecalling",
          "body": "Steam deck doesn't have Nintendo exclusives.",
          "score": 3,
          "created_utc": 1730897212.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lvml9mc",
      "author": "7nightstilldawn",
      "body": "I love Nintendo, but it’s not even an iPad.",
      "score": 0,
      "created_utc": 1730857046.0,
      "replies": []
    },
    {
      "id": "lvmqd3m",
      "author": "rhinotomus",
      "body": "Idk maybe if you wouldn’t resell 20 year old games for 60-80 bucks more people would buy new systems solely for nostalgia",
      "score": 0,
      "created_utc": 1730858879.0,
      "replies": []
    },
    {
      "id": "lvndlkn",
      "author": "kevi959",
      "body": "If you dont have a switch by now, youve been fucking off way too long.",
      "score": 0,
      "created_utc": 1730867394.0,
      "replies": []
    },
    {
      "id": "lvmv7ov",
      "author": "Avocadoexpresss",
      "body": "Will it have better games than a glorified cell phone?",
      "score": -2,
      "created_utc": 1730860652.0,
      "replies": []
    }
  ]
}