{
  "post": {
    "title": "‘Nobody holds their Switch 2 like this’: Dbrand responds to claims its Killswitch detaches Joy-Cons | Some customers says the Joy-Cons fall off if the console is held a certain way.",
    "author": "a_Ninja_b0y",
    "id": "1ljlvr9",
    "score": 1695,
    "created_utc": 1750796491.0,
    "selftext": "",
    "num_comments": 200,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ljlvr9/nobody_holds_their_switch_2_like_this_dbrand/"
  },
  "comments": [
    {
      "id": "mzkzaa1",
      "author": "MrKuub",
      "body": "When all else fails, try the Steve Jobs tactic of “you’re holding it wrong!”.\n\nExcept Steve gave all iPhone 4 owners a free solution - whether or not he believed in it.",
      "score": 1305,
      "created_utc": 1750798953.0,
      "replies": [
        {
          "id": "mzl4exy",
          "author": "Drone314",
          "body": "I was so expecting to see a picture of Steve holding a switch",
          "score": 191,
          "created_utc": 1750800445.0,
          "replies": [
            {
              "id": "mzlb774",
              "author": "TMStage",
              "body": "[With the power of AI slop, even your wildest dreams can come true!](https://i.imgur.com/L6MFJdU.png)",
              "score": 79,
              "created_utc": 1750802482.0,
              "replies": [
                {
                  "id": "mzld2wf",
                  "author": "attilayavuzer",
                  "body": "I feel like I'm there",
                  "score": 87,
                  "created_utc": 1750803076.0,
                  "replies": [
                    {
                      "id": "mzmz00w",
                      "author": "utopicunicornn",
                      "body": "Can confirm I was there",
                      "score": 5,
                      "created_utc": 1750823045.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzlhwjz",
                  "author": "Justin__D",
                  "body": "Hands are shockingly normal. Nice Switch Pro Max he's got there though.",
                  "score": 31,
                  "created_utc": 1750804634.0,
                  "replies": [
                    {
                      "id": "mzljscm",
                      "author": "TubasAreFun",
                      "body": "it’s forced perspective. In reality, his arms are just very long",
                      "score": 14,
                      "created_utc": 1750805262.0,
                      "replies": []
                    },
                    {
                      "id": "mzlmv4t",
                      "author": "internetlad",
                      "body": "I immediately noticed his Dr. No backwards shirt",
                      "score": 3,
                      "created_utc": 1750806266.0,
                      "replies": []
                    },
                    {
                      "id": "mzm21ri",
                      "author": "raybreezer",
                      "body": "Nah. Switch is normal size, his hands are just too small.",
                      "score": 3,
                      "created_utc": 1750811324.0,
                      "replies": []
                    },
                    {
                      "id": "mznvs2e",
                      "author": "CutsAPromo",
                      "body": "Its far too big, he's dropping that in the fish tank, not showing it off to the world ",
                      "score": 2,
                      "created_utc": 1750839722.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n04fwgz",
                  "author": "Kroepoeksklok",
                  "body": "That’s fake because nobody holds their Switch 2 like this.",
                  "score": 2,
                  "created_utc": 1751053870.0,
                  "replies": []
                },
                {
                  "id": "mzpktvf",
                  "author": "Confused-Raccoon",
                  "body": "lmfao.",
                  "score": 1,
                  "created_utc": 1750864349.0,
                  "replies": []
                },
                {
                  "id": "mzor6ae",
                  "author": "Cottontael",
                  "body": "This is so bad it just looks like a bad Photoshop.",
                  "score": 0,
                  "created_utc": 1750855160.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mzlg8bf",
              "author": "Olde94",
              "body": "No but we did get the [iHand](https://www.iphonesavior.com/2010/07/apple-ihand-gives-iphone-4-the-grip-it-deserves.html)",
              "score": 4,
              "created_utc": 1750804083.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzla3ib",
          "author": "CoastingUphill",
          "body": "I had an iPhone 4 at the time and it was so easy to see that reception dropped if you connected those antennas by touching them. It was such a ridiculous problem to have on a phone.",
          "score": 65,
          "created_utc": 1750802146.0,
          "replies": [
            {
              "id": "n07zzsz",
              "author": "Dracogame",
              "body": "I had an iPhone 4 at the time and I used it without cover until the iPhone 6, and never had any issue. I was able to reproduce the problem by squeezing it really hard on the antenna and holding. It was very deliberate. And it still worked anyway. So… ¯\\_(ツ)_/¯ ",
              "score": 1,
              "created_utc": 1751108098.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzmqf0o",
          "author": "CanEnvironmental4252",
          "body": "This company goes out of their way to be assholes. They’ve basically made it part of their brand. Think less-rich Elon Musk. One time, a customer complained that all of their products are priced to be just under the $25 Free Shipping threshold at $24.95, so they raised the threshold to $50.\n\nhttps://www.news18.com/news/tech/what-is-happening-with-dbrand-they-are-bullying-customers-for-pointing-out-a-weird-shipping-policy-3885143.html",
          "score": 57,
          "created_utc": 1750819746.0,
          "replies": [
            {
              "id": "mzoxukz",
              "author": "Cottontael",
              "body": "\"I should be able to hit free shipping on just 1 10 dollar item\" is a weird thing to expect. I can at least understand  being annoyed by customers demanding that. They're just trying to offer free shipping on multiple purchases.\n\nEnshittification out of spite is a baby move however.",
              "score": 4,
              "created_utc": 1750857469.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzl49ro",
          "author": "RoundTableMaker",
          "body": "And he released a video of competing phone doing the same thing except blurred the back ground so you couldn’t see the guy walking in front of the broadcast antenna .",
          "score": 35,
          "created_utc": 1750800402.0,
          "replies": [
            {
              "id": "mzlwcno",
              "author": "PhillAholic",
              "body": "Cell phones work without line of sight?",
              "score": -9,
              "created_utc": 1750809346.0,
              "replies": [
                {
                  "id": "mzm2ulo",
                  "author": "RoundTableMaker",
                  "body": "The test situation in the video was dubious enough to warrant criticism.",
                  "score": 5,
                  "created_utc": 1750811601.0,
                  "replies": [
                    {
                      "id": "mzyn2o1",
                      "author": "PhillAholic",
                      "body": "Do you have a link to the video? It's been 15 years.",
                      "score": 0,
                      "created_utc": 1750975473.0,
                      "replies": [
                        {
                          "id": "mzyqz0d",
                          "author": "RoundTableMaker",
                          "body": "I do not. I will look around. Not sure why you are getting downvoted",
                          "score": 1,
                          "created_utc": 1750976745.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzlfjwd",
          "author": "DDFoster96",
          "body": "Remember, it's impossible for the PR hacks to be wrong - the customer must surely be.",
          "score": 9,
          "created_utc": 1750803863.0,
          "replies": []
        },
        {
          "id": "mzmeqsy",
          "author": "AugustMKraft",
          "body": "What do you mean \"except\"? Dbrand is also giving owners a free solution, they'll replace anyone's unit if this issue occurs during regular use, and they're improving the tolerances in their next batch so it won't detach that easily in the future.",
          "score": 11,
          "created_utc": 1750815707.0,
          "replies": [
            {
              "id": "mzo87fr",
              "author": "ToMorrowsEnd",
              "body": "but but that doesnt fuel my internets rage!",
              "score": 5,
              "created_utc": 1750846912.0,
              "replies": []
            },
            {
              "id": "mzopa3w",
              "author": "Shabbypenguin",
              "body": "The issue is they took preorders for a case that is more than 3 times their competition, I had to go caseless on my switch 2 for several weeks. Now that I have it I have to wait until middle/late July in order to get a fix right joycon cover. \n\nMeanwhile they make statements belittling peoples experiences and a video showing a gross exaggeration of how silly you have to hold it in order for it to fall off, which it doesn’t need to be.",
              "score": 5,
              "created_utc": 1750854450.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzldopa",
          "author": "mndza",
          "body": "I completely forgot about the bumper cases! I want one for my current phone",
          "score": 1,
          "created_utc": 1750803269.0,
          "replies": []
        },
        {
          "id": "mzn7239",
          "author": "kittyfresh69",
          "body": "I really thought the original design of the switch controllers connection to the screen was decent and didn’t need much improvement this new design is inferior in every way.",
          "score": -4,
          "created_utc": 1750826488.0,
          "replies": []
        },
        {
          "id": "mzp0v05",
          "author": "Z3130",
          "body": "Jobs’ strategy relied on him understanding people and technology in a way that almost nobody else has. He was an asshole and some of his decisions aged poorly, but the phones we all currently use are largely due to his vision.\n\nIf you don’t have Jobs’ vision, using his strategy won’t go well. You can be an only be an asshole if you’re right and have good tech.",
          "score": -2,
          "created_utc": 1750858469.0,
          "replies": []
        },
        {
          "id": "mzleury",
          "author": "AndronicusPrime",
          "body": "It was a bullshit issue. No one held the phone in a way that bridged the antenna.",
          "score": -33,
          "created_utc": 1750803640.0,
          "replies": [
            {
              "id": "mzm1fof",
              "author": "SuperBackup9000",
              "body": "The people in their advertisements were, but regardless of it people were doing it naturally or not, messing it up shouldn’t have been as easy as it was, especially for a company like Apple during its “it just works” era. Using should be easy, causing problems should be difficult.",
              "score": 5,
              "created_utc": 1750811111.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzl6hva",
      "author": "Kekeripo",
      "body": "So the case itself becomes a big leaver if you hold the console just by one joycon? (not supporting the tablet with your fingers)\n\nI do get that one would not hold it like that when in use, but picking it up is another thing. Without some form of physical latching or making the case a one piece design, I don't see how one could prevent this leaver action from happening.",
      "score": 256,
      "created_utc": 1750801068.0,
      "replies": [
        {
          "id": "mzlbcz0",
          "author": "PhantomWang",
          "body": "The tl;dr is that Nintendo purposefully left a small gap between the display and joycons so that holding it this way wouldn't create leverage that allows the joycon to separate. Dbrand's grip fills this gap, so it has the leverage necessary to disconnect unintentionally.",
          "score": 306,
          "created_utc": 1750802532.0,
          "replies": [
            {
              "id": "mzlevre",
              "author": "Kekeripo",
              "body": "I just tested my \"naked\" switch 2 and no wiggling or shaking causes the console to detach. Definitly a oversight in the design on their end.\n\nI've had many dbrand products over the years and when i had trouble with a faulty killswitch (ROG Ally) and screenprotector, dbrand replaced them both for free. I'm sure they'll make this right, like they have done in the past. But damn, the killswitch line of product seems to be a bit of a sore spot for them, considering delays and issues with earlier devices.",
              "score": 118,
              "created_utc": 1750803649.0,
              "replies": [
                {
                  "id": "mzlglxu",
                  "author": "RobertdBanks",
                  "body": "They already issued a response saying they’re redesigning the joycon grips and sending them for free to everyone who ordered the case regardless if they had the issue or not. So yes, they’re taking care of it after their initial response of “you’re holding it wrong”.",
                  "score": 88,
                  "created_utc": 1750804207.0,
                  "replies": [
                    {
                      "id": "mzlxdim",
                      "author": "StanielReddit",
                      "body": "Can you provide a source for this.  Just got my case yesterday and have noticed the same exact problem and want to kill myself for spending $80 on this shit.",
                      "score": 7,
                      "created_utc": 1750809692.0,
                      "replies": [
                        {
                          "id": "mzm0gxx",
                          "author": "RobertdBanks",
                          "body": "r/dbrand\n\nhttps://www.reddit.com/r/dbrand/s/IfsTqIzdY0",
                          "score": 30,
                          "created_utc": 1750810775.0,
                          "replies": [
                            {
                              "id": "mzm4suq",
                              "author": "StanielReddit",
                              "body": "Thank you very much, friend.",
                              "score": 7,
                              "created_utc": 1750812283.0,
                              "replies": []
                            },
                            {
                              "id": "mzxivr6",
                              "author": "TakeyaSaito",
                              "body": "Fair enough, good on them for fixing it, everyone makes mistakes.",
                              "score": 1,
                              "created_utc": 1750963444.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mzpv1tb",
                      "author": "Confused-Raccoon",
                      "body": "This is how I expected them to handle it. Send out a big post explaining how the end user is wrong/weird, how they've tested it and their findings but actually just sort it out at their expense.\n\nLike when their phone grip cases kept peeling apart. They explained the hows and whys and just fixed it for everyone at their expense.",
                      "score": 1,
                      "created_utc": 1750867206.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzljrei",
                  "author": "stilusmobilus",
                  "body": "Yeah one thing I’ve waited for is a detach complaint and aside from this here I haven’t seen one. I’d imagine that’s been rigorously tested by now, by accident as well.",
                  "score": 1,
                  "created_utc": 1750805253.0,
                  "replies": [
                    {
                      "id": "mzm9vqw",
                      "author": "Kindness_of_cats",
                      "body": "It was basically *the thing* everyone tested back in March when they started letting people get hands-on with it.\n\nYou can really tell that they spent 8 years perfecting the design and how to make a magnetic connection work.",
                      "score": 5,
                      "created_utc": 1750814035.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mzln62b",
              "author": "SuperCat76",
              "body": "An additional thing I think is going on as well is that the thickness varies.\n\nSo if it is a thicker one it may push the Joycons out just a little bit. Increasing the distance to the magnets decreasing the pull they have on the controller and this making them even easier to have fall off.",
              "score": 3,
              "created_utc": 1750806364.0,
              "replies": []
            },
            {
              "id": "mzljhzw",
              "author": "stilusmobilus",
              "body": "Without further research beyond this post, I suspected it had something to do with interfering with this gap.",
              "score": 1,
              "created_utc": 1750805166.0,
              "replies": []
            },
            {
              "id": "mzptftb",
              "author": "Confused-Raccoon",
              "body": "Why didn't Nintendo see fit to put a physical, mechanical lock in place to begin with? They know a huge portion of there user base is children.\n\nI thought that's what the detach button was, but apparently you can just pull them off?",
              "score": 0,
              "created_utc": 1750866760.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzlazhr",
          "author": "your_evil_ex",
          "body": "It doesn't happen if you have no case on the Switch 2, because they intentionally leave a gap between the joycon and system",
          "score": 11,
          "created_utc": 1750802416.0,
          "replies": []
        },
        {
          "id": "mzlrgjt",
          "author": "Fett32",
          "body": "Its actually common to hold it like that, just not for everyone. A lot of my time on switch and the steam deck I'm just holding it with my left hand. Games like vampire survivors, some of the Pokémon, etc can be played one-handed.",
          "score": 8,
          "created_utc": 1750807740.0,
          "replies": [
            {
              "id": "mznyzfn",
              "author": "Kekeripo",
              "body": "What i meant by \"holding it like that\" was holding it with one hand by only one joycon. It's damn heavy on the hand and not much to (at least me) hold left if you don't move your fingers to the tablet part.",
              "score": 2,
              "created_utc": 1750841657.0,
              "replies": [
                {
                  "id": "mzr0380",
                  "author": "Fett32",
                  "body": "Yeah, I tend to hold it by the joycon. If you angle it up a bit, you can pinch the joycon between the bottom of your index finger and the pad below your thumb. Ends up surprising light, with the leverage working in your favor and reducing finger strain. I usually play for at least an hour before switching positions. Tho I do tend to have a finger on the console, but not always.",
                  "score": 1,
                  "created_utc": 1750878591.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzm4ydf",
          "author": "shewy92",
          "body": "I mean, just grabbing a drink or a snack you can hold it with one hand. I bet a lot of people do that. It shouldn't break just because of that.",
          "score": 9,
          "created_utc": 1750812339.0,
          "replies": [
            {
              "id": "mznz32e",
              "author": "Kekeripo",
              "body": "A copy and past from a similar comment: What i meant by \"holding it like that\" was holding it with one hand by only one joycon. It's damn heavy on the hand and not much to (at least me) hold left if you don't move your fingers to the tablet part.",
              "score": 2,
              "created_utc": 1750841716.0,
              "replies": [
                {
                  "id": "mzoc6h1",
                  "author": "shewy92",
                  "body": "Doesn't mean no one tries to do so. I can hold my Steamdeck with one hand and it's bigger than a Switch.  The dbrand Killzone case gives you a big handle to hold from so it would be easier to try and do so.",
                  "score": 3,
                  "created_utc": 1750848908.0,
                  "replies": [
                    {
                      "id": "mzpcuuc",
                      "author": "Kekeripo",
                      "body": "You're missunderstanding me a tiny bit. I mean holding the entire switch by the joycon alone, no fingers touching the tablet. That is hard. I can one hand my ally x no problems, but if I had to claw it, no chance.",
                      "score": 2,
                      "created_utc": 1750862096.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzlawyj",
          "author": "RobertdBanks",
          "body": "The same way a bunch of other cases avoid it, don’t have the material slightly push the joycon out further. That’s the issue here. I have a clear plastic case on mine with separate holders for the screen and joycons and it works like normal.",
          "score": 6,
          "created_utc": 1750802394.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzksxgr",
      "author": "fafarex",
      "body": ">‘Nobody holds their Switch 2 like this’\n\n\"do you guys not have phones\" vibe, big PR fail.",
      "score": 637,
      "created_utc": 1750797169.0,
      "replies": [
        {
          "id": "mzl2iph",
          "author": "ill0gitech",
          "body": "Have you forgotten antenna-gate and “you’re holding it wrong”?",
          "score": 121,
          "created_utc": 1750799884.0,
          "replies": [
            {
              "id": "mzl3e2x",
              "author": "fafarex",
              "body": "No, but the reference was already done in the article so why do it again myself.",
              "score": 54,
              "created_utc": 1750800142.0,
              "replies": [
                {
                  "id": "mzl5vox",
                  "author": "RaptorAllah",
                  "body": "reddit reading only headlines moment (I do the same but at least I don't comment about it)",
                  "score": 28,
                  "created_utc": 1750800882.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mzn8xhv",
              "author": "Marvel_this",
              "body": "Death grip!",
              "score": 1,
              "created_utc": 1750827343.0,
              "replies": [
                {
                  "id": "mznw9v8",
                  "author": "not_a_moogle",
                  "body": "My doctor told me not to",
                  "score": 2,
                  "created_utc": 1750840020.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzmyqpo",
          "author": "realityfooledme",
          "body": "I tried to get a case from dbrand for a steamdeck and I have to say, their customer service is exactly inline with this stance. After they messed up the shipping and then refused to even communicate with me until they received the package back I canceled it and went with a different brand.   It was a birthday present, time was a factor and if they had just responded to an email I would have happily paid for a second one to get a case on the way if they would give me a refund when the other case came back.   Nope, sarcastic emails were all I got back. \n\nAnd whether it’s real or supposed to be a joke, as a customer my take away was that they are undeservedly cocky.  It’s a very “you should be grateful we’re even doing this stupid shit” attitude and I’ll never shop with them again.",
          "score": 9,
          "created_utc": 1750822943.0,
          "replies": [
            {
              "id": "mzodv76",
              "author": "LilMoWithTheGimpyLeg",
              "body": "From what I've read: being rude is their \"style\".\n\nJust like it's _my_ style to buy from someone else!",
              "score": 4,
              "created_utc": 1750849702.0,
              "replies": []
            },
            {
              "id": "mzpt42l",
              "author": "Confused-Raccoon",
              "body": "My only experience with them is phone cases. Mine fall apart, in a way they're aware of and they sent the revised version + original skin out free of charge. I also asked if I could get a different skin, the obsidian(oil spill) one. They said sure thing champ and sent that too. It was the wrong colour(red n blue), but I felt bad complaining about a freebie. \n\nI guess it's the same everywhere. Some one gets amazing customer service, someone gets the other end and receives shit service.",
              "score": 1,
              "created_utc": 1750866669.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzlnedj",
          "author": "HeftyArgument",
          "body": "have they not seen videos of kids raging at video games?\n\nImagine little timmy getting angry playing mario kart, his involuntary enraged tensing and gripping suddenly detaching the joy cons and letting the switch fall to the floor lol.",
          "score": 5,
          "created_utc": 1750806438.0,
          "replies": [
            {
              "id": "mzm82oo",
              "author": "Particular_Night_360",
              "body": "Little Timmy? I’m a grown ass adult and I’ve watched my phone disappear into a lake multiple times.",
              "score": 1,
              "created_utc": 1750813416.0,
              "replies": [
                {
                  "id": "mzo5z0o",
                  "author": "Cola_and_Cigarettes",
                  "body": "Lmao Christ. Was that video of the kid shoving the Wiimote up his arse you?",
                  "score": 5,
                  "created_utc": 1750845710.0,
                  "replies": [
                    {
                      "id": "mzpsevu",
                      "author": "Confused-Raccoon",
                      "body": "Classic.",
                      "score": 1,
                      "created_utc": 1750866474.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzm8akx",
                  "author": "HeftyArgument",
                  "body": "you tossed it into the river in a fit of rage?",
                  "score": 3,
                  "created_utc": 1750813489.0,
                  "replies": [
                    {
                      "id": "mzmd4b9",
                      "author": "MeBeEric",
                      "body": "*lake",
                      "score": 1,
                      "created_utc": 1750815148.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzpsd9u",
                  "author": "Confused-Raccoon",
                  "body": "Breh, why you raging at the lake?",
                  "score": 1,
                  "created_utc": 1750866461.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzno8jn",
          "author": "Cedric_T",
          "body": "This is just a regular day at dbagbrand.",
          "score": 2,
          "created_utc": 1750835269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzktk02",
      "author": "LDC1234",
      "body": "It doesn't matter how rare this can happen. All that matters is that it can happen. It is in real bad taste to respond to legit consumer criticism and concern by basically going \"nuh uh\"",
      "score": 402,
      "created_utc": 1750797347.0,
      "replies": [
        {
          "id": "mzkut69",
          "author": "fireaxe99",
          "body": "Have you ever read a Dbrand reply or email? This is on brand for them.",
          "score": 212,
          "created_utc": 1750797701.0,
          "replies": [
            {
              "id": "mzl7nbw",
              "author": "ZachOf_AllTrades",
              "body": "Usually their snarky messaging is paired with good product design though",
              "score": 84,
              "created_utc": 1750801412.0,
              "replies": [
                {
                  "id": "mzln14i",
                  "author": "lilboytuner919",
                  "body": "They design good functional cases, they aren’t Michelangelo. If no one wants to use your product, it sucks. Period.",
                  "score": 29,
                  "created_utc": 1750806320.0,
                  "replies": [
                    {
                      "id": "mzlvbng",
                      "author": "ZachOf_AllTrades",
                      "body": "Yeah thats my point",
                      "score": 1,
                      "created_utc": 1750809008.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mzli9fs",
              "author": "Deep90",
              "body": "It honestly gets annoying when they turn on the teenage angst to minimize actual problems.\n\nThey did it during their phone case debacle as well.\n\n\nMaybe I'm biased though. I bought a laptop skin from them which at the time didn't include a skin for the inside. They later added that skin to the set for free. I asked if I could buy it separately, and they told me to buy a whole new set at full price.",
              "score": 42,
              "created_utc": 1750804756.0,
              "replies": []
            },
            {
              "id": "mzla348",
              "author": "kungfungus",
              "body": "it's on Dbrand",
              "score": 26,
              "created_utc": 1750802143.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzlcp41",
          "author": "VanceIX",
          "body": "Latest update is that they're going to give everyone who bought the cases new, updated joycon covers. I still hope they redesign the dock adapter or give skins for the bottom of the console to prevent scratching from their adapter because it's not great.\n\nI fully agree that their initial official response was terrible.\n\n[https://www.reddit.com/r/dbrand/comments/1ljlhwy/joycon\\_detachment\\_update\\_part\\_2\\_were\\_fixing\\_it/](https://www.reddit.com/r/dbrand/comments/1ljlhwy/joycon_detachment_update_part_2_were_fixing_it/)",
          "score": 29,
          "created_utc": 1750802953.0,
          "replies": []
        },
        {
          "id": "mzlq9ii",
          "author": "R1talynn",
          "body": "Responding to stupid people with an answer they don’t like is just fine. Fuck stupid customers.",
          "score": -19,
          "created_utc": 1750807352.0,
          "replies": []
        },
        {
          "id": "mzl3do7",
          "author": "GlossyGecko",
          "body": "I mean, setting the switch 2 aside completely, your phone battery can just spontaneously combust, it happens to some people… that’s just a thing that can happen, it could happen as I type this.",
          "score": -65,
          "created_utc": 1750800138.0,
          "replies": [
            {
              "id": "mzl5dd6",
              "author": "BigfootFlex",
              "body": "I mean, setting the phone battery aside completely, you can just randomly have a heart attack, it happens to some people… that’s just a thing that can happen, it could happen as I type this.",
              "score": 39,
              "created_utc": 1750800729.0,
              "replies": [
                {
                  "id": "mzlg72d",
                  "author": "LOAARR",
                  "body": "Classic reddit upvoting someone implying \"maybe you should/could die\" in response to someone making a slightly snarky criticism of someone criticising a big bad corporation.\n\nYes Reddit, corporation bad. But you need to be better than this. Upvoting legitimate hatred and thinly-veiled \"maybe you could die\" comments because they're in agreeance with you is how we get cyber-bullying so bad that people legitimately do hurt themselves, like the fox rescue girl that we just lost largely because of online bullying from sources like snark subreddits.\n\nGrow up. You're talking to other humans like, at least half the time. Act like it.\n\nEDIT: And in classic reddit fashion, you've all doubled-down and are downvoting me en masse as I predicted you would. Well, unlike all of you, I'm not a spineless coward who deletes their post once they have -5 points because I know that these downvotes mean that I've upset you. And when you say something critical of someone that upsets them, you know that you've struck them at their core. Hopefully you've all learned something and can grow up and stop bullying in the name of \"being right\". Even if 1 person in 100 thinks something, you don't have to aggressively tell them they're an idiot or imply that they could maybe try dying, you can just have a good faith argument with them and try to understand where they're coming from. After all, just because half of an entire country thinks something is right doesn't make it right as we've learned from the United States of America where most of you reading this are from.\n\nBe better.",
                  "score": -38,
                  "created_utc": 1750804072.0,
                  "replies": [
                    {
                      "id": "mzmxqfh",
                      "author": "Secret_Caterpillar",
                      "body": "The downvotes are because your comment is idiotic. The heart attack comment was an analogy pointing out that using a \"what if\" scenario is not a valid argument because you can come up with any ridiculous situation that could technically happen; it was never wishing for them to have a heart attack. \n\nEveryone understood that except you and yet, instead of realizing that you misunderstood, you chose to double down on self righteousness.",
                      "score": 11,
                      "created_utc": 1750822540.0,
                      "replies": [
                        {
                          "id": "mzne8wb",
                          "author": "LOAARR",
                          "body": "No.\n\nIf someone says to you,\n\n>Maybe don't do that\n\nAnd then they reply,\n\n>Maybe DIE\n\nI'm not sure how else you could possibly take that. Maybe don't use analogies involving the death of the person you're talking about?\n\nGood god, it's like taking to literal children. Grow up, little Jeffery.",
                          "score": -11,
                          "created_utc": 1750829920.0,
                          "replies": [
                            {
                              "id": "mznqlrx",
                              "author": "Secret_Caterpillar",
                              "body": "But that's not what they said, which is why you can't quote what actually happened and you have to resort to using an example of your own interpretation because the literal text does not support your argument. In fact, not only did they not tell them to have a heart attack, they never even implied that they should at all. They only commented that it's within the realm of possibilities, an analogy to point out the fallacy of what-if arguments, a fact that has already been explained to you. \n\nThis is a gradeschool level literary device and your inability to understand that when everyone else was capable is indicative of your poor reasoning, not a moral failing of everyone else. \n\nThe reason everybody downvoted you without comment is because your little rant was so incredibly ignorant that it didn't warrant the effort to explain why because everyone knew that you would do exactly what you are doing now; you refuse any responsibility for being wrong and instead double down on what is clearly a lack of reading comprehension on your part. And your weak attempts at ad homs just further illustrates that you know you're wrong but you're too intellectual dishonest and fragile of ego to accept it. \n\nYou remind me of a flat earther, so confident that everyone else is wrong because you can't understand elementary concepts. I can't wait for you to reply with the same fallacious argument that you already tried twice and close it out with another pathetic attempt to insult me; that will surely make you right on the third try.",
                              "score": 6,
                              "created_utc": 1750836634.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mzlk6oa",
              "author": "lugerd",
              "body": "The problem is that the case INCREASES the chance of the switch dropping from your hands. It negates the reason why people would buy the protective case in the first place.\n\nI know all devices can break on their own, but why would you buy a protective case that would cause it to break more easily?",
              "score": 9,
              "created_utc": 1750805396.0,
              "replies": [
                {
                  "id": "mzlkoo7",
                  "author": "GlossyGecko",
                  "body": "I mean, to be honest with you, unless you’re letting kids use your switch all the time, I don’t really even understand why you’d want a case anyway. They build those things so fucking sturdy. I mean, my little nephew owns his own switch and that thing is basically mint, and he’s not exactly gentle with his toys, so even then I don’t really get why you’d want a case on your switch. \n\nMy own original switch has never been in a case and is pretty much perfect.\n\nI really don’t get what you MFs are doing with your consoles that you feel like you need to strap a case to the thing at all.",
                  "score": -3,
                  "created_utc": 1750805559.0,
                  "replies": [
                    {
                      "id": "mzm967a",
                      "author": "Kindness_of_cats",
                      "body": "Because some people know they're naturally clumsy, or they use it in environments where it's more likely to be damaged, or they're just plain cautious about their devices.  \n\nRegardless, the grips specifically aren't really for protection so much as to address the non-existent ergonomics of the device.  They've even discussed that they're likely going to be selling them individually.",
                      "score": 3,
                      "created_utc": 1750813792.0,
                      "replies": []
                    },
                    {
                      "id": "mzn4wns",
                      "author": "Jaerba",
                      "body": "The main value of this specific case is the joycon grips themselves.  The default Joycons don't feel great to hold. \n\n\nThere are other cases with grips but those tend to be even bulkier across the rest of the unit. \n\n\nYou buy this to get very ergonomic grips that are fairly easy to attach/detach.  The extra case features are just a bonus that you can ignore.",
                      "score": 1,
                      "created_utc": 1750825532.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mzm0qew",
              "author": "someguyhaunter",
              "body": "A battery is a complex technical bit of equipment which interacts with electricity.\n\n...\n\n*This is a case.* \n\n...\n\nSure a battery shouldn't fail but something as simple as a case and especially one so expensive should NEVER be able to fail. It is as clear as day they never tested this in any real capacity.",
              "score": 5,
              "created_utc": 1750810868.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzldahl",
      "author": "ghostpicnic",
      "body": "Between the “le epic and heckin relatable brand” persona they force so hard on social media, the cheap attempts at garnering clout and buzz by leaking products, and being outright rude and racist to their customers just asking for help with defective products, I hate these guys so fucking much and sincerely hope they go out of business.\n\nThey made fun of an Indian guy with the last name “Chitransh” by telling him “your name is basically shit rash” in response to him asking for help with a skin that started discoloring shortly after purchase. He wasn’t being snarky or rude, just a guy genuinely asking for support to address an issue with *their* product. Who treats their customers like this?? On a public forum no less. The intention was clearly to dismiss his claims while sending some harassment his way.\n\nShitty company run by shitty people that make shitty products they don’t stand by. These guys are the REAL “shit rash” of their industry.",
      "score": 208,
      "created_utc": 1750803142.0,
      "replies": [
        {
          "id": "mzlnvd0",
          "author": "UBC145",
          "body": "Oh damn I remember that one. I think MKBHD made a video about it. That was Dbrand?",
          "score": 41,
          "created_utc": 1750806586.0,
          "replies": [
            {
              "id": "mzlrb82",
              "author": "ghostpicnic",
              "body": "Yep",
              "score": 14,
              "created_utc": 1750807691.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzm4evs",
          "author": "deka101",
          "body": "Man I wanted to buy a phone case from them, it seems like the best option for what I'm looking for, but I really loathe their edgey cringe early internet type shit they constantly put out",
          "score": 19,
          "created_utc": 1750812148.0,
          "replies": [
            {
              "id": "mzmm824",
              "author": "ghostpicnic",
              "body": "I’ve felt similarly. There have been a few times in the past (before the controversies) where I’ve been interested in a some of their cases.\n\nHowever, after all the shit they’ve pulled (and continue to do, I mean look at the post we’re commenting on), I simply will not support a company that is this consistently awful to their partners and customers. \n\nIt’s your money so of course you’re free to do what with it what you want, but for me, they have shown a level of disrespect to their consumers where I feel like they don’t deserve my money. \n\nThere are plenty of other brands that make just as good, if not better products that don’t constantly disrespect the people keeping them afloat.",
              "score": 6,
              "created_utc": 1750818243.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzm0uf4",
          "author": "Chas_Tenenbaums_Sock",
          "body": "Agreed. I remember following them a while back and thinking their responses to rude people were edgy and funny. All the while thinking some of the skins were well done or the ps5 dark plates a cool idea. Then id see them be really rude to people that didn’t deserve it, especially those with seemingly legit issues or complaints. No fucking thanks.",
          "score": 16,
          "created_utc": 1750810906.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzl5i1y",
      "author": "Mrhyderager",
      "body": "dbrand's whole shtick is being overly antagonistic with their customers. And it mostly works because their products are truly superior - I've got the Killswitch for my Ally X and it's by far the best case on the market.\n\nAll that said, sure seems like they'd do just as much business, if not more, if they stopped operating like they're a Dick's Last Resort for tech accessories.",
      "score": 130,
      "created_utc": 1750800769.0,
      "replies": [
        {
          "id": "mzliu3f",
          "author": "Deep90",
          "body": "They need a more technical professional face to address product concerns, not the marketing interns kid.",
          "score": 10,
          "created_utc": 1750804947.0,
          "replies": []
        },
        {
          "id": "mzl6ln7",
          "author": "astraldirectrix",
          "body": "Agreed, my dbrand iPhone case goes hard (has survived multiple throws with only a few scratches), but *sometimes* the company is a little too tongue in cheek.",
          "score": 17,
          "created_utc": 1750801099.0,
          "replies": [
            {
              "id": "mzl7j02",
              "author": "BastianHS",
              "body": "I had a dbrand case on my phone and I put it on the top of my car while I was opening the door and forgot like a dumbass.  It came flying off while I was doing 75 on the interstate.  Some scuffs on the case, phone was 100%.  Dbrands marketing is dumb as hell but their cases are legit the best.",
              "score": 9,
              "created_utc": 1750801376.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzlf8i6",
          "author": "Rusty_Rhin0",
          "body": "That's mostly a marketing thing for them and this is kinda newish. They gave a ghost case v2.0 for free to everyone who bought the first defective version. Someone else said they did something similar with the steam deck case\n\nTheir subreddit has plenty of posts of issues with their robot account commenting to have the poster reach out for usually a replacement, or something \n\nNot sure if their marketing got to their heads or if this is a (downward) turning point but definitely a little out of character and not a really bad sign",
          "score": 3,
          "created_utc": 1750803762.0,
          "replies": [
            {
              "id": "mzpww9n",
              "author": "Confused-Raccoon",
              "body": "Their socials and outward facing facia is... Testing at times. But if there is a problem and they can fix it, they usually will at their expense. And then post a cringy, but in depth, post about the whats/whys/whens. You can't say that for many companies these days.",
              "score": 2,
              "created_utc": 1750867726.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzktl8w",
      "author": "RoundTableMaker",
      "body": "We need steve jobs to tell everyone they are holding it wrong.",
      "score": 35,
      "created_utc": 1750797357.0,
      "replies": []
    },
    {
      "id": "mzlmcfi",
      "author": "SuperCat76",
      "body": "Me who has picked up the console by one side to pull it towards me as I had set it off to the side.\n\nAnd have popped one controller off to do some mouse mode in menus while holding the system by one Joycon.",
      "score": 6,
      "created_utc": 1750806098.0,
      "replies": []
    },
    {
      "id": "mzlab6l",
      "author": "VaMpiller",
      "body": "You have to be more careful to not damage your switch with the protective case on than without. It's ridiculous!",
      "score": 9,
      "created_utc": 1750802211.0,
      "replies": []
    },
    {
      "id": "mzlknfo",
      "author": "lazymutant256",
      "body": "Yea sure if people were holding it right it probably wouldn’t happen.. but that’s not the point.  It shouldn’t be happening at all.",
      "score": 4,
      "created_utc": 1750805549.0,
      "replies": []
    },
    {
      "id": "mzl5snt",
      "author": "DoomOne",
      "body": "Turns out that when you put rubber between detachable connecting items, the connection weakens a bit. Who would have thought?",
      "score": 12,
      "created_utc": 1750800857.0,
      "replies": [
        {
          "id": "mzlx7a6",
          "author": "LDC1234",
          "body": "So, the way Nintendo designed it is that there is a gap between the joycon and the console to prevent leverage buidling up and separating. The killswitch grip fills this gap, which causes it to fall off if held in a certain way.",
          "score": 8,
          "created_utc": 1750809634.0,
          "replies": []
        },
        {
          "id": "mzldy2w",
          "author": "gralfighter",
          "body": "Uhm that’s not even remotely the problem.",
          "score": -12,
          "created_utc": 1750803352.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzkw56k",
      "author": "Scorpio989",
      "body": "Reminds me of the 3DS having a volume slider directly adjacent to the left stick.",
      "score": 10,
      "created_utc": 1750798073.0,
      "replies": []
    },
    {
      "id": "mzliasw",
      "author": "TimeForWaluigi",
      "body": "Every person I know who owns a switch 2 has carried it like that at least once",
      "score": 3,
      "created_utc": 1750804769.0,
      "replies": []
    },
    {
      "id": "mzm9acw",
      "author": "TheRealSeeThruHead",
      "body": "That website is ad cancer",
      "score": 3,
      "created_utc": 1750813832.0,
      "replies": []
    },
    {
      "id": "mzkuxq2",
      "author": "onikaroshi",
      "body": "Jokes on them, I don’t hold my switch at all!",
      "score": 5,
      "created_utc": 1750797736.0,
      "replies": []
    },
    {
      "id": "mzmggyz",
      "author": "_Spastic_",
      "body": "I watched the videos. As someone who has no interest in the Switch or Switch 2, that is definitely a problem.",
      "score": 2,
      "created_utc": 1750816289.0,
      "replies": []
    },
    {
      "id": "mzmnwhe",
      "author": "LordTommy33",
      "body": "I was wondering if it was people doing the whole “hold the console by one joy-con and see if it holds” thing with this. But the video just shows someone slightly bending it back a little, a totally normal motion that would happen when holding the console in portable mode. This looks pretty bad. And wasn’t this also the company that also had early access to the console to design stuff and leaked a bunch of stuff against their NDA? They should have had time to check this stuff out.",
      "score": 2,
      "created_utc": 1750818830.0,
      "replies": []
    },
    {
      "id": "n06cqf6",
      "author": "drfsupercenter",
      "body": "Are there any good Switch 2 joycon grips on the market right now? That's one thing I miss from my original Switch is having some bulk behind the controllers when I play in handheld mode.",
      "score": 2,
      "created_utc": 1751077400.0,
      "replies": []
    },
    {
      "id": "mzkwhv5",
      "author": "w1n5t0nM1k3y",
      "body": "It would have been so easy to just tell people that if they are unhappy they can return the product for a refund and the 5-10% that don't like it wouldn't have anything to complain about and they would still be selling a lot of cases to people who don't see this as a problem.",
      "score": 5,
      "created_utc": 1750798171.0,
      "replies": []
    },
    {
      "id": "mzlbucm",
      "author": "TingleyStorm",
      "body": "If you read the article, Dbrand is basically saying “look, we know we designed it wrong and we’re fixing it in revisions, but it’s still your fault somehow so get fucked.”",
      "score": 3,
      "created_utc": 1750802684.0,
      "replies": [
        {
          "id": "mzn5flp",
          "author": "Jaerba",
          "body": "That was their response and it fucking sucked. \n\n\nTo be fair, their latest response is a mea culpa to all of that where they conclude we should be able to hold it any way we want.",
          "score": 1,
          "created_utc": 1750825762.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzmzj52",
      "author": "Jaerba",
      "body": "It's such an absurd statement.  You're sitting on the couch and you put your Switch on the side table.  When you try to pick it up again, you're going to pick it up holding one of the Joycons before bringing it to your other hand.  That's when the failure happens because of the dbrand case.  The Switch 2 does not fail in that scenario in any other circumstances. \n\n\nIt's just a failure of the case.\n\n\nNintendo even shows people holding it that way in their own documentation.",
      "score": 2,
      "created_utc": 1750823257.0,
      "replies": []
    },
    {
      "id": "mzo35ur",
      "author": "Maxamus53",
      "body": "This was a big concern of mine and it stopped me from buying one until I actually tried holding my naked Switch 2 by a single joycon.\n\n1. The joycon is physically too small for me to hold without touching the back of the switch.\n2. It feels like I'm going to snap something so I by default try and brace the switch.\n\nI think this issue is made worse by the grip case having nice handles which allows people to actually swing it by the single joycon, I don't really think this is a case defect, it's just limitations of magnetic connection along with a heavy hand held console.",
      "score": 3,
      "created_utc": 1750844134.0,
      "replies": []
    },
    {
      "id": "mzl70na",
      "author": "neospriss",
      "body": "They just posted an update where they dunk on themselves.  Check it out in r/dbrand.",
      "score": 5,
      "created_utc": 1750801223.0,
      "replies": [
        {
          "id": "mzl820a",
          "author": "Esc777",
          "body": "No, I don’t think I will",
          "score": 17,
          "created_utc": 1750801532.0,
          "replies": [
            {
              "id": "mzlcnc2",
              "author": "RobertdBanks",
              "body": "Well, they’re sending everyone a newly designed set of joycon grips that won’t have the issue for free regardless if they had the issue or not. So that’s good.",
              "score": 8,
              "created_utc": 1750802938.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzlam0v",
      "author": "RobertdBanks",
      "body": "Anyone who is using the touch screen while holding it would hold it that way.",
      "score": 2,
      "created_utc": 1750802301.0,
      "replies": []
    },
    {
      "id": "mzlfif5",
      "author": "Klatty",
      "body": "iPhone 4s allll over again. wtf",
      "score": 2,
      "created_utc": 1750803850.0,
      "replies": [
        {
          "id": "mzlvev2",
          "author": "Neo_Techni",
          "body": "Was wondering how long till someone made a reference to \"you're holding it wrong\"",
          "score": 3,
          "created_utc": 1750809037.0,
          "replies": [
            {
              "id": "mzmjzeh",
              "author": "neddoge",
              "body": "You mean the same reference the article itself refers to towards the bottom of the page?",
              "score": 2,
              "created_utc": 1750817477.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzm7hpz",
          "author": "Silver_Myr",
          "body": "There wasn't anything really wrong with the iPhone 4, it was mainly a media generated controversy",
          "score": 1,
          "created_utc": 1750813216.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzlufxj",
      "author": "DrVagax",
      "body": "One thing is sure, they got a absolutely horrid customer relationship team, sure all the funny and edgy marketing tactics with YouTubers paid off like with Linus Tech Tips but I have seen some seriously rude responses that offered no solution at all to a persons issue.",
      "score": 3,
      "created_utc": 1750808717.0,
      "replies": [
        {
          "id": "mzlws7v",
          "author": "RedScaledOne",
          "body": "Example there is?",
          "score": 1,
          "created_utc": 1750809491.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzlunsc",
      "author": "Evilfenrir",
      "body": "The console just came out...",
      "score": 3,
      "created_utc": 1750808788.0,
      "replies": [
        {
          "id": "mzmpy06",
          "author": "JS-87",
          "body": "And they built a grip cover based on prototypes and leaked information resulting in an inferior product and somehow people are blaming Nintendo for exacerbating this companies problem.",
          "score": 6,
          "created_utc": 1750819571.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzlbc4m",
      "author": "JonathanBro",
      "body": "In BeatEmUps Switch 2 video he is using a similar accessory/grip on his and towards the end of the video he has the same issue https://youtu.be/0hhR3f_1qGA?si=ZpzhI-7fjkaWKO1u",
      "score": 1,
      "created_utc": 1750802524.0,
      "replies": []
    },
    {
      "id": "mzlid05",
      "author": "DaringDomino3s",
      "body": "Kinda glad I didn’t order one now. Guess I’ll wait til the redo the grips",
      "score": 1,
      "created_utc": 1750804789.0,
      "replies": []
    },
    {
      "id": "mzm0baq",
      "author": "WhiteHawk77",
      "body": "Wonder how many Switch 2’s have got damaged by this, I see one dropped over on its screen in one of the videos.  Glad my grips don’t do that and I’ve held it that way a good few times now and no budge.",
      "score": 1,
      "created_utc": 1750810720.0,
      "replies": []
    },
    {
      "id": "mzmc9r3",
      "author": "mark5hs",
      "body": "\"According to the company, the situation only occurs if players hold the Switch 2 by the Joy-Cons without supporting the main console from behind with their fingers, if they hold it by a single Joy-Con, and if they hold it parallel to the ground (i.e. flat down).\"\n\nThey want us to have our fingers bracing the back the whole time we play?",
      "score": 1,
      "created_utc": 1750814856.0,
      "replies": []
    },
    {
      "id": "mzmk6mz",
      "author": "BuckZero",
      "body": "This really solidified my choice going with the Savage Raven",
      "score": 1,
      "created_utc": 1750817547.0,
      "replies": []
    },
    {
      "id": "mznb93g",
      "author": "Shibby8Muk",
      "body": "DBrand’s marketing and responses to controversies have made sure I’ll never purchase a product from them. The quickest way to make it so I never wanna give your company money is to try and be a quirky edgy company. Like what’s so hard about making a quality product and having normal adult conversations with consumers?",
      "score": 1,
      "created_utc": 1750828440.0,
      "replies": []
    },
    {
      "id": "mznd9ja",
      "author": "Strange-East-4001",
      "body": "[Homey called it.](https://www.reddit.com/r/dbrand/s/d3pqSlXCO0)",
      "score": 1,
      "created_utc": 1750829429.0,
      "replies": []
    },
    {
      "id": "mzndylj",
      "author": "sock0puppet",
      "body": "This is leaving me wondering if somewhere in the manufacturing tolerances it may be too thick in that specific area, which may actually weaken the magnetic hold.",
      "score": 1,
      "created_utc": 1750829778.0,
      "replies": []
    },
    {
      "id": "mznetcg",
      "author": "Tocaculo",
      "body": "A console where the controllers don’t just whiff while I driving",
      "score": 1,
      "created_utc": 1750830204.0,
      "replies": []
    },
    {
      "id": "mznxbq8",
      "author": "SunwindPC",
      "body": "Wow dbrand really effed up doubling down like this",
      "score": 1,
      "created_utc": 1750840659.0,
      "replies": []
    },
    {
      "id": "mznxc2e",
      "author": "MarioGeeUK",
      "body": "Yeah that video clearly shows the issue. I’m not a manufacturer but I’m a gamer and I don’t think is that crazy to push pressure where shown. I mean, that’s where you hold the device from 🤣",
      "score": 1,
      "created_utc": 1750840665.0,
      "replies": []
    },
    {
      "id": "mzo0p47",
      "author": "PokeRedstone",
      "body": "Wow that is the most unprofessional response I’ve ever seen from a company of really any size. Imagine digging in your heels and literally saying “our product isn’t bad and the small change we’re making doesn’t even make it better because it was never bad.” But like fully LITERALLY saying it. I thought their products were cool and well made, but the flippant response clearly shows they don’t even take pride in how good it actually is. They take pride in how good they think it is no matter what any customer says.",
      "score": 1,
      "created_utc": 1750842675.0,
      "replies": []
    },
    {
      "id": "mzpdiyf",
      "author": "Riustuue",
      "body": "Well evidently people do hold it that way, otherwise it wouldn’t be an issue. This is not a good response 😅",
      "score": 1,
      "created_utc": 1750862289.0,
      "replies": []
    },
    {
      "id": "mzpzr2f",
      "author": "Confused-Raccoon",
      "body": "Typical Dbrand.\n\n![gif](giphy|agwRgmVDJceZO)",
      "score": 1,
      "created_utc": 1750868521.0,
      "replies": []
    },
    {
      "id": "mzq1hyh",
      "author": "Sadodare",
      "body": "Just get a case like Mumba's for now that allows for removal of the joycon without the grip (grip hinges back) and can actually fit the dock with the case on. Eventually dbrand might fix this use case scenario but until they do.... Options will increase the longer the unit is available.",
      "score": 1,
      "created_utc": 1750869004.0,
      "replies": []
    },
    {
      "id": "mzqscpm",
      "author": "cb393303",
      "body": "dbrand fucking up a case on release, if I had a penny for each time, I would have 2....",
      "score": 1,
      "created_utc": 1750876382.0,
      "replies": []
    },
    {
      "id": "mzu4a45",
      "author": "radium_eye",
      "body": "I'm using one of those Blade cases with the hinges, mechanically linked to be all one piece, dockable thing. I tried the bigger Titan one and didn't like the added weight though it's joycon grips were better feeling when using it lying down especially. Trade offs, so far, but it doesn't stress the joycons & gives them good mechanical support at all times. I have not found removing the controllers for use to be a hassle with this case, but it feels very good when together.",
      "score": 1,
      "created_utc": 1750917285.0,
      "replies": []
    },
    {
      "id": "mzuootx",
      "author": "Chuck_Loads",
      "body": "dbrand is a good company, but their public communications are known for being over-the-top snarky. Them saying something like this then fixing the issue for free is completely on brand for them.",
      "score": 1,
      "created_utc": 1750928947.0,
      "replies": []
    },
    {
      "id": "mzwg5fs",
      "author": "BucketsAMF",
      "body": "Dbrand is garbage. I've had two of their phone cases fall apart after only a few months. Not even sure why I bought the second one lol. Stay away from Dbrand. It's overpriced, over hyped trash.",
      "score": 1,
      "created_utc": 1750952667.0,
      "replies": []
    },
    {
      "id": "n01rc3v",
      "author": "awol720",
      "body": "Is it just me or does dbrand kind of blow. Their site is straight up rude to you ",
      "score": 1,
      "created_utc": 1751024650.0,
      "replies": []
    },
    {
      "id": "n01xbkc",
      "author": "jonny__27",
      "body": "Ah, Dbrand. The company that keeps shilling its shit whenever and wherever they can. Back when I had a Steam Deck and a ROG Ally I still remember all the totally organic posts about the \"lifesaver\" Dbrand cases for them when they got released. Those obnoxious stunts alone made me go for Skull&Co instead. Good job Dbrand! High five yourselves and call that a mission success!",
      "score": 1,
      "created_utc": 1751027022.0,
      "replies": []
    },
    {
      "id": "n0chbut",
      "author": "LightningsHeart",
      "body": "Switch 2 is a joke. Sliding joycons wasn't broken and they tried to fix it.",
      "score": 1,
      "created_utc": 1751165135.0,
      "replies": [
        {
          "id": "n0k8d9j",
          "author": "TheFlusteredcustard",
          "body": "Sliding joycons had some small issues, mostly related to being able to slide peripherals on incorrectly and get them stuck, and the possibility of damage to the rails making joycons have problems. I've never tried the switch 2, so I have no idea how well the magnets can hold the console, but at least conceptually I'm not against moving away from rails.",
          "score": 1,
          "created_utc": 1751284010.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0d7tf5",
      "author": "Less_Party",
      "body": "At this point seek out Dbrand specifically for their signature blend of passive aggression and premium pricing. It’s like a form of soft findom that won’t look suspicious on your bank statement.",
      "score": 1,
      "created_utc": 1751177629.0,
      "replies": []
    },
    {
      "id": "n0f0rgx",
      "author": "Legendacb",
      "body": "When you read the full response it sounds perfectly fine and respectful",
      "score": 1,
      "created_utc": 1751209174.0,
      "replies": []
    },
    {
      "id": "mzljt9v",
      "author": "SirWhatsalot",
      "body": "I mean, yes, but I remember people bending their metal phones on purpose and saying \"LoOk My PhOnE BeNdS!!!\". Like yeah, it's metal...\n\nWe are in a world where people will make problems where none exist just for the clicks, when we already have plenty of said problems without making more up.\n\n***BUT*** I don't use DBrand and I haven't use the item in question so... There is that.",
      "score": 0,
      "created_utc": 1750805271.0,
      "replies": []
    },
    {
      "id": "mzl7e9x",
      "author": "skaliton",
      "body": "it is wild that they claim this\n\n  \n....I mean 'the claw' was a thing for the psp\n\n[https://www.reddit.com/r/MonsterHunter/comments/9be0wc/behold\\_the\\_claw/](https://www.reddit.com/r/MonsterHunter/comments/9be0wc/behold_the_claw/)\n\nand to anyone who thinks that is a joke...no, you actually had to hold it like that because you needed instant access to every button",
      "score": 1,
      "created_utc": 1750801337.0,
      "replies": [
        {
          "id": "mzl9amb",
          "author": "UnsorryCanadian",
          "body": "I was forced to learn the claw for Monster Hunter and then LIVE the claw for Peace Walker\n\nThe PSP *physically* hurt to play sometimes",
          "score": 1,
          "created_utc": 1750801904.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzl82ho",
      "author": "Fire_Lord_Cinder",
      "body": "People are holding the switch kind of weird in the clips I’ve seen. I always have fingers on the console too, not just the joycon. \n\nRegardless of case or not, the way people are holding it puts a lot of strain on the joycon-switch connection point and IMO would likely lead to damage over the long term.",
      "score": 1,
      "created_utc": 1750801536.0,
      "replies": []
    },
    {
      "id": "mzlmonm",
      "author": "technobeeble",
      "body": "Dbrand's marketing always left a sour taste in my mouth.",
      "score": 1,
      "created_utc": 1750806208.0,
      "replies": []
    },
    {
      "id": "mzlmr2z",
      "author": "Plankisalive",
      "body": "I was afraid of this kind of thing happening back when they first announced the new magnetic joy cons.",
      "score": 1,
      "created_utc": 1750806230.0,
      "replies": []
    },
    {
      "id": "mzmaa3d",
      "author": "silverslant",
      "body": "Dbrand sucks and their fanboys are insufferable",
      "score": 1,
      "created_utc": 1750814170.0,
      "replies": []
    },
    {
      "id": "mzmidg3",
      "author": "6volt",
      "body": "Dbrand did a solid when the case for the steam deck came out that had magnets that interfered with the exhaust fan. Solid company I'm sure they'll make it right if they did anything.",
      "score": 1,
      "created_utc": 1750816931.0,
      "replies": []
    },
    {
      "id": "mzo0z2z",
      "author": "GameMask",
      "body": "Outside of just being an awful PR response that would have been solved by just admitting it's a potential problem for some customers and promising to do right by them, there's more than just a few viral videos showcasing how the joycons can pretty easily fall off even without doing anything special. Plus, it's not uncommon to reach for a drink or your phone with one hand while gaming. Or picking up the console by the joycon. \n\nWorse yet though, normally you'd have your fingers on the Switch 2 itself while holding it, giving the joycon some added support. However, the grips on the joycon, while nice for ergonomics, do make it so you'll have less of your fingers on the actual console while holding it. If you have smaller hands you may be holding it entirely by the joycon. That's going to increase the leverage on the magnets.",
      "score": 1,
      "created_utc": 1750842841.0,
      "replies": []
    },
    {
      "id": "mzluxtx",
      "author": "TeamCameltotem",
      "body": "Saw this coming a mile away, just terrible design to begin with.",
      "score": 1,
      "created_utc": 1750808880.0,
      "replies": []
    },
    {
      "id": "mzlfjim",
      "author": "MaxDiehard",
      "body": "Dbrand are just pure shitbags. Why anyone supports them is beyond me.",
      "score": 1,
      "created_utc": 1750803860.0,
      "replies": []
    },
    {
      "id": "mzl68uv",
      "author": "deathbunnyy",
      "body": "a new age of shitty mad catz style shit for a new generation and even dumber people who lived through it and still buy third party trash accessories.",
      "score": -3,
      "created_utc": 1750800993.0,
      "replies": [
        {
          "id": "mzldd9j",
          "author": "GlossyGecko",
          "body": "Everybody knows the younger sibling who is always player 2 gets the shitty mad catz controller.",
          "score": 1,
          "created_utc": 1750803167.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzlgjhi",
      "author": "DragonEmperor",
      "body": "Not buying any of their products after reading this lmao, what a joke.",
      "score": 0,
      "created_utc": 1750804184.0,
      "replies": []
    },
    {
      "id": "mzlw9h5",
      "author": "chicharrofrito",
      "body": "This is why I never want to buy the switch 2",
      "score": -2,
      "created_utc": 1750809317.0,
      "replies": []
    },
    {
      "id": "mzngm1b",
      "author": "Ok_Drag5089",
      "body": "I don’t hold my Switch2 any way because I’m not paying for something I don’t really own.",
      "score": -1,
      "created_utc": 1750831133.0,
      "replies": []
    },
    {
      "id": "mzlcskx",
      "author": "RobertdBanks",
      "body": "Dbrand updated their reply and said they are replacing everyone’s joycon grips for free regardless if they had the issue or not. They redesigned the joycon grips to not have the issue. So that’s good.",
      "score": 0,
      "created_utc": 1750802984.0,
      "replies": []
    },
    {
      "id": "mznniw2",
      "author": "foggedmind21",
      "body": "It was ALWAYS the Joy-Cons Nintendo…not the color or the screen",
      "score": 0,
      "created_utc": 1750834870.0,
      "replies": []
    },
    {
      "id": "mzpaeq3",
      "author": "_Undivided_",
      "body": "Never liked Dbrand as a company and have always refused to purchase anything they offer.  They go out of their way to be assholes, all in the name of marketing. They will never see a penny from me.",
      "score": 0,
      "created_utc": 1750861384.0,
      "replies": []
    },
    {
      "id": "mzl67eb",
      "author": "thecraigbert",
      "body": "So basically original joycons after time?",
      "score": -6,
      "created_utc": 1750800981.0,
      "replies": [
        {
          "id": "mzl84yr",
          "author": "GlossyGecko",
          "body": "Look at the video in the link. They’re right, nobody holds the switch like that lol. The fuck are these people doing? Trying to bend the switch? Reminds me of people who complain about stick drift but then you find out that they fucking throw their controller at the wall whenever they lose in a game. Like yeah, no shit you have stick drift bro.",
          "score": -16,
          "created_utc": 1750801556.0,
          "replies": [
            {
              "id": "mzl9s71",
              "author": "MrOreo3",
              "body": "Go to r/dbrand there is a lot more than those holding it bad.  Some are really bad.",
              "score": 2,
              "created_utc": 1750802052.0,
              "replies": []
            },
            {
              "id": "mzn5ta8",
              "author": "Jaerba",
              "body": "You just have to hold it that way for a second for it to fail.  So the example is you put the Switch on a side table and then when you pick it up again, you're initially only holding it with one hand.  That's when it would fail and it's a pretty realistic, common scenario.\n\n\nOr you're playing a game and you scratch your nose or take a drink.  It doesn't take any force beyond gravity for it to fail.",
              "score": 2,
              "created_utc": 1750825931.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzkzmar",
      "author": "PsyJak",
      "body": "I hold my Switch in *EVERY* way. Nintendo should have thought this through. As well as everything else about the Switch 2.",
      "score": -37,
      "created_utc": 1750799049.0,
      "replies": [
        {
          "id": "mzl3zse",
          "author": "LDC1234",
          "body": "This isn't a Nintendo issue. This is a Dbrand Killswitch issue. The way the killswitch wraps around the Joycon prevents it from fully securing to the console.",
          "score": 21,
          "created_utc": 1750800321.0,
          "replies": []
        }
      ]
    }
  ]
}