{
  "post": {
    "title": "Nexus 6P design could make a comeback as... the iPhone 17 Air?! | A newly leaked image provides the best look yet at what might be the iPhone 17 Air.",
    "author": "a_Ninja_b0y",
    "id": "1i7e1tt",
    "score": 160,
    "created_utc": 1737560721.0,
    "selftext": "",
    "num_comments": 79,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i7e1tt/nexus_6p_design_could_make_a_comeback_as_the/"
  },
  "comments": [
    {
      "id": "m8k2r2f",
      "author": "Fomentation",
      "body": "Bring back rear finger print scanners. I miss my 6P for that feature alone.",
      "score": 120,
      "created_utc": 1737562556.0,
      "replies": [
        {
          "id": "m8kgxya",
          "author": "bubbleboba53",
          "body": "Agreed. It was in the perfect position for unlocking it with your index finger while pulling it out of your pocket.",
          "score": 27,
          "created_utc": 1737566446.0,
          "replies": [
            {
              "id": "m8l1fa6",
              "author": "Fantomex305",
              "body": "I loved being able to do that and being able to pull down the notification bar on the 3 XL. I still pull that phone out and power it up just to do that sometimes.",
              "score": 14,
              "created_utc": 1737571908.0,
              "replies": [
                {
                  "id": "m8t4lak",
                  "author": "velocazachtor",
                  "body": "I still find myself swiping down on the back of my pixel 7 pro... ",
                  "score": 1,
                  "created_utc": 1737671777.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8lpfx4",
          "author": "kronikfumes",
          "body": "Fellow 6P owner way back when! That rear finger print scanner was ahead of its time.",
          "score": 4,
          "created_utc": 1737578353.0,
          "replies": []
        },
        {
          "id": "m8n7l0t",
          "author": "ShadowPhynix",
          "body": "If they rereleased an identical copy of the 6p but with modern hardware, I’d buy it in a heartbeat. I was gutted when the big core fail issue happened to me :( \n\n(if anyone has one with this issue, and lost photos as a result, there’s a fix on XDA now!)",
          "score": 8,
          "created_utc": 1737594373.0,
          "replies": [
            {
              "id": "m8o9n6c",
              "author": "_Spectre0_",
              "body": "Big core fail? You mean the battery dying faster than a candle in the wind? Or was there a different major issue plaguing that model?\n\nI say this as someone who loved the design and both copies of that phone outside that issue (RMA’d the first to get the second, then switched to an iPhone before it could affect the second too… which it eventually did, but thankfully I wasn’t reliant on it). Still wouldn’t buy a google phone again anytime soon, but glad to see Apple rip the good parts of that design off",
              "score": 1,
              "created_utc": 1737607648.0,
              "replies": [
                {
                  "id": "m8p0r4l",
                  "author": "ShadowPhynix",
                  "body": "The performance CPU cores had a critical issue that could cause them to totally fail, resulting in a bootloop (because initial boot would occur with the smaller cores, then when they tried to initialise the bigger ones, it would crash, restart ... loop).\n\ntbh I wish I could go back. I'd take incompetence accidentally killing the battery than competence intentionally killing the battery - can't wait to get rid of my iphone now that android watches have started to finally catch up.",
                  "score": 3,
                  "created_utc": 1737621833.0,
                  "replies": [
                    {
                      "id": "m91kii3",
                      "author": "Poopnstein",
                      "body": "This happened to me when it was just a couple of months out of warranty... Was not cool.",
                      "score": 1,
                      "created_utc": 1737780470.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8pr2zl",
              "author": "Switchblade88",
              "body": "Have you got a link??\n\nI had one die from this and the second is sitting in a drawer but still functioning, so I'll take any fix available",
              "score": 1,
              "created_utc": 1737636499.0,
              "replies": [
                {
                  "id": "m8pwvhy",
                  "author": "ShadowPhynix",
                  "body": "I only found out earlier today when I decided to google the issue to make sure I wasn't completely misremembering it, so I can't vouch for it, but comments seem rather positive. Use your own judgement and all that.\n\nhttps://xdaforums.com/t/guide-fix-for-nexus-6p-bootloop-of-death-8-22-android-o-working.3640279/",
                  "score": 1,
                  "created_utc": 1737638752.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8q1wo9",
          "author": "Naud1993",
          "body": "I have that on my S9+ and I can also lower my notifications by swiping on it.",
          "score": 2,
          "created_utc": 1737640530.0,
          "replies": []
        },
        {
          "id": "m9ny0lt",
          "author": "One_Stranger7794",
          "body": "I think my 6P was the most handsome phone I ever owned, loved to just turn it around in my hands over and over",
          "score": 2,
          "created_utc": 1738083864.0,
          "replies": []
        },
        {
          "id": "m8nko15",
          "author": "gdeLopata",
          "body": "freaking yes what is the benefit os the on screen one? my 6p still serves as 3d printer klipper screen!",
          "score": 1,
          "created_utc": 1737598601.0,
          "replies": []
        },
        {
          "id": "m8osyr2",
          "author": "reapersivan",
          "body": "Great phone, sad it hit the shitter after the boot loop issue years ago. Wish I kept it",
          "score": 1,
          "created_utc": 1737617115.0,
          "replies": []
        },
        {
          "id": "m8pb5xp",
          "author": "Florian422",
          "body": "Never tried the rear finger print reader, but I still use my honor 20 / Huawei nova 5t with the finger print reader being on the power button, on the right side. It's been years and it's still working perfectly, doesn't take any space and works every time. I don't know why so few phones used that, the placement is perfect too and falls right under my thumb at any time",
          "score": 1,
          "created_utc": 1737628405.0,
          "replies": []
        },
        {
          "id": "m8k7brx",
          "author": "ASK_ABT_MY_USERNAME",
          "body": "I find on screen ones just as convenient, maybe even better.",
          "score": 0,
          "created_utc": 1737563836.0,
          "replies": [
            {
              "id": "m8kdd55",
              "author": "Fomentation",
              "body": "The biggest part for me is the groove for the scanner on the back of the phone that was a non visual indicator of where the finger should be. I'd have it unlocked as it was coming out of my pocket. \n\nOn screen fingerprint readers just don't have the same physical indicator. Probably doesn't matter for people that can get the muscle memory down but it's something that I find myself missing on modern hardware.",
              "score": 21,
              "created_utc": 1737565474.0,
              "replies": [
                {
                  "id": "m8kqezw",
                  "author": "kooldude700",
                  "body": "Don't know how long you been using on screen scanner for but for me it was annoying at first especially since the s10's scanner is tiny; however, I got used to it pretty quickly and could nail it down everytime. \n\nHonestly not that big of a deal especially since phones have bigger ones now too.",
                  "score": 2,
                  "created_utc": 1737568982.0,
                  "replies": [
                    {
                      "id": "m8l2lkh",
                      "author": "RGB3x3",
                      "body": "It's god-awful on Pixels (at least pixel 8 and below). The thing barely ever registers my thumb, and fucks up constantly. At least the ultrasonic ones are much better than the optical.",
                      "score": 0,
                      "created_utc": 1737572216.0,
                      "replies": [
                        {
                          "id": "m8l5hpf",
                          "author": "Lrauka",
                          "body": "I have a 6 pro and it works every time, unless my finger is not on the sensor correctly or something like that. But I can pull my phone out and muscle memory my finger onto the screen and have it opened up before I even see the screen itself. You may have had a bad scanner.",
                          "score": 0,
                          "created_utc": 1737572991.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m8m05ls",
              "author": "toomanymarbles83",
              "body": "The screen one on my Pixel 7 is absolute junk. Doesn't recognize my finger most of the time.",
              "score": 3,
              "created_utc": 1737581193.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8k5esc",
          "author": "Tzayad",
          "body": "Yeah, fuck this in the display shit. Only works 30% of the time if I'm lucky, and if you do it in low light, like in the middle of the night in bed, the flash from the finger reader is fucking blinding.",
          "score": 1,
          "created_utc": 1737563293.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8k2956",
      "author": "bossofthisjim",
      "body": "Give me my nexus 4 back. ",
      "score": 14,
      "created_utc": 1737562419.0,
      "replies": [
        {
          "id": "m8mpka7",
          "author": "betogess",
          "body": "What an amazing phone. But I would have to go for original nexus. The pearl was so nice",
          "score": 1,
          "created_utc": 1737588705.0,
          "replies": []
        },
        {
          "id": "m8rpcl0",
          "author": "wamj",
          "body": "I loved my nexus 6. That and my Samsung galaxy s3.",
          "score": 1,
          "created_utc": 1737657715.0,
          "replies": []
        },
        {
          "id": "m8slwjg",
          "author": "Kebo94",
          "body": "I still think about the nexus 5 and how great the rubbery plastic was. You didn't need a case like you do now for preatty much and phone.",
          "score": 1,
          "created_utc": 1737666595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8k06h2",
      "author": "blacksoxing",
      "body": "I **loved** my Nexus 6P but remember all the issues it had. So many issues that Google went \"hey, umm, send us your 6P and we'll send you a brand new Pixel\".\n\nNote: I did and the mic in my Pixel went out a month after its warranty ended and it hurt my heart so much that I left the Google lineup and eventually went to IOS. It was just pitiful that the only way I could talk to someone was via bluetooth and worse that Google's CS was like \"yeah you can take it to iFixit but it will be about $300....\"",
      "score": 42,
      "created_utc": 1737561836.0,
      "replies": [
        {
          "id": "m8kchij",
          "author": "Acceptable-Truck3803",
          "body": "And the nexus 6P was my fav with cyanogenmod. It took a lot to pry that phone away from me even after the warranty ended.",
          "score": 3,
          "created_utc": 1737565233.0,
          "replies": []
        },
        {
          "id": "m8k3r9q",
          "author": "SpicyRice99",
          "body": "Same story with my Pixel 6 display lol",
          "score": 5,
          "created_utc": 1737562832.0,
          "replies": []
        },
        {
          "id": "m9nyr8v",
          "author": "One_Stranger7794",
          "body": "Almost identical story, got the 6P and loves it until battery started dying at 30%, side button and headphone jack stopped working etc.\n\nGot a Pixel as a replacement, and it was good for a month? The coolest thing about it was the squeeze for assistant, but that and the screen gave out a few weeks later.\n\nUnless otherwise proven, I don't really have any faith in Google's hardware design",
          "score": 1,
          "created_utc": 1738084117.0,
          "replies": [
            {
              "id": "m9nz7pq",
              "author": "blacksoxing",
              "body": "I agree, and honestly if those two things never happened I'd be a person who would probably be rocking whatever the latest Pixel is right now. Instead, I'm now using an iPhone 13PM and frankly have zero desire to even attempt to change it",
              "score": 1,
              "created_utc": 1738084257.0,
              "replies": [
                {
                  "id": "m9oj6ug",
                  "author": "One_Stranger7794",
                  "body": "Ya I feel like Google fumbling the Pixel line in it's early days is still causing a lot of others to think the same",
                  "score": 1,
                  "created_utc": 1738089722.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8knky0",
          "author": "kvothe5688",
          "body": "never had any issues with pixels. used 4a, 6a and now 8",
          "score": 1,
          "created_utc": 1737568228.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8k06h9",
      "author": "None",
      "body": "Originally a Huawei design",
      "score": 12,
      "created_utc": 1737561836.0,
      "replies": []
    },
    {
      "id": "m8jy1if",
      "author": "objecter12",
      "body": "Maybe unpopular opinion, but I don’t think Apple should shed its style for that. I’m all for changing things up every few gens, but aping google’s camera structure isn’t the answer.",
      "score": 29,
      "created_utc": 1737561242.0,
      "replies": [
        {
          "id": "m8jyjgw",
          "author": "correctingStupid",
          "body": "A symmetrical high up camera bar is undeniably better than a phone that wobbles on a desk and doesn't fit cradles well.",
          "score": 63,
          "created_utc": 1737561380.0,
          "replies": [
            {
              "id": "m8k00d7",
              "author": "garry4321",
              "body": "Right? “Apeing” a style is a GREAT call when your style makes no fucking sense and is functionally illogical. They literally make phones that can’t lie flat without a case",
              "score": 10,
              "created_utc": 1737561788.0,
              "replies": [
                {
                  "id": "m8khqqj",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -20,
                  "created_utc": 1737566662.0,
                  "replies": [
                    {
                      "id": "m8l2ueo",
                      "author": "i-like-to-be-wooshed",
                      "body": "are you dense",
                      "score": 8,
                      "created_utc": 1737572282.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8k32ef",
          "author": "gadgetluva",
          "body": "There’s really not too many ways to build out a camera system these days if you want to have 3 lenses. You either go vertical (Samsung), horizontal (Google), or cluster them on one side (iPhone) or in the middle (OnePlus/Chinese OEMs). \n\nApple moving to a horizontal layout may be “stealing” from Nexus/Pixel, but it’s probably the best option for a new design since Google’s phones are the least popular/recognized in the market.",
          "score": 5,
          "created_utc": 1737562642.0,
          "replies": []
        },
        {
          "id": "m8k88o9",
          "author": "TedClaxton94",
          "body": "Personally I think we’re underestimating the power of Apple branding. I don’t think an average consumer will look at this and think “it look like a pixel”. They’ll look at pixel and think “it looks like the new iPhone”. \n\nOf course, you may have a different reason for wanting them to keep their current style or do something other than this. But thought I’d give my two cents on the branding angle.",
          "score": 2,
          "created_utc": 1737564086.0,
          "replies": []
        },
        {
          "id": "m8prsqt",
          "author": "NuclearReactions",
          "body": "It's ok if its the superior design. So tired of my phone wobbling when i use it while it's laying on the desk",
          "score": 1,
          "created_utc": 1737636791.0,
          "replies": []
        },
        {
          "id": "m8kpdf7",
          "author": "leo-g",
          "body": "It is expected to house the front camera elements too. The rest of the body can go as slim as the usb-c port will allow them but the camera has a minimum thickness due to how light works.\n\nIt’s incredibly Apple-like to have these sort of visual trickery (in a good way).",
          "score": 0,
          "created_utc": 1737568701.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8kptp0",
      "author": "leo-g",
      "body": "I don’t think anybody realise that this design is pretty smart in the context of Apple. The thick bump is expected to house the front camera elements too. The rest of the body can go as slim as the usb-c port will allow them but the cameras has a minimum thickness due to how light works.\n\nIt’s incredibly Apple-like to have these sort of visual trickery (in a good way).",
      "score": 8,
      "created_utc": 1737568821.0,
      "replies": []
    },
    {
      "id": "m8jz3z3",
      "author": "ab_90",
      "body": "Dynamic Island front and back !",
      "score": 3,
      "created_utc": 1737561537.0,
      "replies": []
    },
    {
      "id": "m8krrpg",
      "author": "jamesbecker211",
      "body": "I guess I'm confused as to why Apple thought \"make them even thinner\" was what we wanted? We want long lasting batteries and useful features. A thin phone will sacrifice both of those for the sake of being thin and light",
      "score": 3,
      "created_utc": 1737569347.0,
      "replies": [
        {
          "id": "m8ohbno",
          "author": "aBunchOfSpiders",
          "body": "The goal of making devices thinner pushes innovation into slimming down components and also makes the devices be perceived as higher end by consumers. If you have two identically equipped devices and one is thicker, just because the battery lasts longer, will look less futuristic and impressive to most consumers. That part sucks but the push to make components smaller and more efficient is quite useful in the long run.  \n\nAlso, smaller devices means less material used. Might be a tiny amount per device but multiply that by tens of millions of devices and the company could be saving a big chunk of cash on raw materials.  \n\nNot saying I agree with this direction fully but these are some of the big reasons. With how phones have been perceived lately, I think releasing a skinnier phone actually could bring some excitement back to users even if it’s all superficial.",
          "score": 2,
          "created_utc": 1737611044.0,
          "replies": []
        },
        {
          "id": "m8ps1k2",
          "author": "NuclearReactions",
          "body": "I don't want thin, i want smaller. Iphone 4 sized",
          "score": 1,
          "created_utc": 1737636890.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8p3ugk",
      "author": "liquidmasl",
      "body": "that is so ugly pls no",
      "score": 2,
      "created_utc": 1737623810.0,
      "replies": []
    },
    {
      "id": "m8jx4ms",
      "author": "FacepalmFullONapalm",
      "body": "Looks familiar… like I’ve seen it on Google before. Or as Google, to be more accurate.",
      "score": 5,
      "created_utc": 1737560988.0,
      "replies": [
        {
          "id": "m8jyc2m",
          "author": "correctingStupid",
          "body": "A phone manufacturer decided to deviate from copying Apple designs then Apple copies them. Love it.",
          "score": 8,
          "created_utc": 1737561323.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8k5e0y",
      "author": "goozy1",
      "body": "Remember when Apple sued Samsung over rounded corners?",
      "score": 2,
      "created_utc": 1737563287.0,
      "replies": []
    },
    {
      "id": "m8lcxrl",
      "author": "GrayDaysGoAway",
      "body": "About time the fucking idiots designing phones quit making the backs lopsided by clustering all the cameras on one side.",
      "score": 1,
      "created_utc": 1737574978.0,
      "replies": []
    },
    {
      "id": "m8l7qrh",
      "author": "None",
      "body": "I’m all for this. Refresh and finally it can stop wobbling on a table",
      "score": 1,
      "created_utc": 1737573593.0,
      "replies": []
    },
    {
      "id": "m8m57vl",
      "author": "RodneyRuxin18",
      "body": "iPhone Air with an all new design. We think you're going to love it.",
      "score": 1,
      "created_utc": 1737582548.0,
      "replies": []
    },
    {
      "id": "m8nfxis",
      "author": "VapidRapidRabbit",
      "body": "I just know a lot of people are gonna drop their phones and crack that bar.",
      "score": 1,
      "created_utc": 1737597050.0,
      "replies": []
    },
    {
      "id": "m8t9be8",
      "author": "Finchypoo",
      "body": "That's just a Pixel 9 pro with the camera moved up.",
      "score": 1,
      "created_utc": 1737673163.0,
      "replies": []
    },
    {
      "id": "m8kdmye",
      "author": "PlaneCandy",
      "body": "Y’all are calling Apple out for copying but there are only so many variations that can be done on a rectangular slab with 3 cameras in the back that have to be out of the way of your hands ",
      "score": 0,
      "created_utc": 1737565549.0,
      "replies": [
        {
          "id": "m8l2k0m",
          "author": "IE114EVR",
          "body": "In this case it looks like 1 camera, so it begs the question “why does the visor stretch across the back?”. It seems like an aesthetic choice. Unless this could this be how they will arrange their 2-3 camera array for other iPhones?",
          "score": 1,
          "created_utc": 1737572206.0,
          "replies": [
            {
              "id": "m8lqvax",
              "author": "proanimus",
              "body": "Yeah, I wonder if this is intended to standardize the layout across their lineup. Same camera bar regardless of the number of cameras and sensors.",
              "score": 2,
              "created_utc": 1737578733.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8ka79q",
      "author": "FdPros",
      "body": "apple, that looks like absolute shit.\n\nnot sure if on purpose or not, so they can say that their budget models dont sell (i assume air is going to be a cheaper model)",
      "score": 0,
      "created_utc": 1737564618.0,
      "replies": []
    },
    {
      "id": "m8k02x2",
      "author": "Fritzschmied",
      "body": "Honestly it looked shit on Google phones and it still looks shit. Modern phones are just so bad looking without a case that makes it uniform on the back. Why can’t we just have a slightly thicker phone both banger battery life and no camera bump. That hole making it thinner for no reason is fuckin pointless.",
      "score": -10,
      "created_utc": 1737561808.0,
      "replies": [
        {
          "id": "m8k5oiw",
          "author": "gadgetluva",
          "body": "Because thick, bulky phones don’t sell well. People want large screens, but slim devices. Why do you think every company goes after thinness and touts it in their marketing materials? Big batteries are great, but not at the expense of size and bulkiness.",
          "score": 3,
          "created_utc": 1737563370.0,
          "replies": [
            {
              "id": "m8k89v5",
              "author": "Fritzschmied",
              "body": "I don’t say that the phones have to be really thick. But one mm more that what are the current iPhones wont hurt anybody and the camera would already be able to be flush. And honestly I often read comments all over the internet that are the same opinion. Especially the people that actually use their phones for work and not just run after the newest trend. Also it’s just not possible to buy a flagship with a flat camera. So you don’t really have a choice to express it with your wallet. Maybe people do want it? Or if they actually don’t want to make it thicker then they should at least try to make the camera smaller and not an eyesore. Honestly the camera quality is already good enough for a phone and most of the quality comes from the post processing anyways. No need to include bigger optics. And if you actually want to make nice pictures a phone doesn’t cut it anyways.",
              "score": 1,
              "created_utc": 1737564094.0,
              "replies": [
                {
                  "id": "m8kzrag",
                  "author": "gadgetluva",
                  "body": "Phones would need to be 2-3mm thicker to be flush with the cameras, which is pretty substantial since phones are only around 8mm thick - that’s a 25-35% increase in thickness. May not sound like a lot on paper, but it translates to a far worse, bulkier feel in hand. Thick phones just don’t sell. \n\nI’ll also point out that I see a lot of comments about wanting “flush” phones too, but its easy to have an opinion about a hypothetical, but its different to actually follow through with a purchase.",
                  "score": 1,
                  "created_utc": 1737571470.0,
                  "replies": [
                    {
                      "id": "m8l3pnr",
                      "author": "Fritzschmied",
                      "body": "Would take it. Because it would be the same as now. I just wouldn’t use a case because if the camera is flush it’s useless anyways.",
                      "score": 1,
                      "created_utc": 1737572514.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m8k8me7",
          "author": "HooHooHooAreYou",
          "body": "I have a phone for you! \nhttps://www.tomsguide.com/phones/android-phones/energizer-is-back-with-a-phone-that-packs-a-ginormous-28000-mah-battery",
          "score": 1,
          "created_utc": 1737564188.0,
          "replies": [
            {
              "id": "m8k9hh3",
              "author": "Fritzschmied",
              "body": "Why is it so hard to understand to people that 1mm thicker wouldn’t hurt anybody but it would just make it a better phone in every aspect.",
              "score": 0,
              "created_utc": 1737564423.0,
              "replies": [
                {
                  "id": "m8kagks",
                  "author": "HooHooHooAreYou",
                  "body": "Not for everyone. I would prefer a phone as you said because I often go long periods of time without being next to a charger. My wife can charge her phone on a wireless desktop charger all day, and wants her phone to be thinner, lighter, and easier to fit into pockets and other places. To overcome most camera bumps and signficantly improve battery life, we're looking at impactfully more than 1mm.",
                  "score": 2,
                  "created_utc": 1737564688.0,
                  "replies": [
                    {
                      "id": "m8kbdti",
                      "author": "Fritzschmied",
                      "body": "Yea I understand that those people exist that want thin phones but why is there just not an option for a slightly thicker flagship phone with no fucking camera sticking out and more battery life. That’s the thing I mainly criticize. Not that the thin phones exist but rather that the thick phones don’t exist besides some gimmicks like the one you mentioned.",
                      "score": 1,
                      "created_utc": 1737564937.0,
                      "replies": []
                    },
                    {
                      "id": "m8kc2hl",
                      "author": "Fritzschmied",
                      "body": "Also if you charge you phone all the time it’s shit for longevity because the battery goes to shit faster. If you have to charge your phone only ever 2-3 days it will last you way longer in general which in turn is also better for the environment.",
                      "score": 1,
                      "created_utc": 1737565122.0,
                      "replies": [
                        {
                          "id": "m8kfcfz",
                          "author": "HooHooHooAreYou",
                          "body": "Yeah I know. My wife still has that access anytime she needs.",
                          "score": 1,
                          "created_utc": 1737566015.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}