{
  "post": {
    "title": "Anker’s Tabletop UV Printer Will Make Your Prints Look Like Real Painted Art | The eufyMake E1 UV printer is bringing embossed prints directly into the home.",
    "author": "chrisdh79",
    "id": "1k9tk7a",
    "score": 613,
    "created_utc": 1745840887.0,
    "selftext": "",
    "num_comments": 73,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k9tk7a/ankers_tabletop_uv_printer_will_make_your_prints/"
  },
  "comments": [
    {
      "id": "mphjznk",
      "author": "ToMorrowsEnd",
      "body": "And it will do so at extremely expensive prices for the ink.  I know someone that is a beta tester for that machine.  that print cost them $100 in ink. to do the relief it prints many layers over and over to build it up.  a small ink set is $250 and that print demoed uses about 1/2 the ink.   They are marking up standard UV ink hard and putting it in sealed cartridges at a massive premium.   Standard UV ink is about $40-$60 a liter.   this setup gets you about 100ml for that same price.",
      "score": 179,
      "created_utc": 1745850224.0,
      "replies": [
        {
          "id": "mpi91zk",
          "author": "kermityfrog2",
          "body": "Cheap printer, expensive ink. Where have I heard that strategy before?",
          "score": 98,
          "created_utc": 1745857789.0,
          "replies": [
            {
              "id": "mpj84nl",
              "author": "Emperor-Commodus",
              "body": "> Cheap printer\n\nDid you read the article? The printer is almost $2,000.",
              "score": 18,
              "created_utc": 1745868115.0,
              "replies": [
                {
                  "id": "mpj8ebv",
                  "author": "kermityfrog2",
                  "body": "Do you know what a UV printer is? Usually UV printers are in the $30,000 to $50,000 range.",
                  "score": 47,
                  "created_utc": 1745868196.0,
                  "replies": [
                    {
                      "id": "mploz7s",
                      "author": "TheDailySpank",
                      "body": "$50,000 gets you a UV printer with a 6'x10' bed and a 4-section vacuum system.",
                      "score": 12,
                      "created_utc": 1745898210.0,
                      "replies": []
                    },
                    {
                      "id": "mpnz3io",
                      "author": "G_ntl_m_n",
                      "body": "Do you know what a UV printer premium is? That'll cost you about 150,000 $",
                      "score": 3,
                      "created_utc": 1745937201.0,
                      "replies": [
                        {
                          "id": "mpoxrq0",
                          "author": "kermityfrog2",
                          "body": "Oh yeah, I guess that's the post-tariff cost now. LOL",
                          "score": 2,
                          "created_utc": 1745947274.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mpjj6k1",
                      "author": "Emperor-Commodus",
                      "body": "Another source says the ink cartridges are $299. A $2000 printer with $300 ink cartridges isn't \"cheap printer, expensive ink\", it's just \"expensive everything\". In the \"cheap printer, expensive ink\" model, the printers are *extremely* cheap, sometimes even less expensive than the ink refill itself. They're intentionally heavily subsidized to lock the consumer in. This printer is far too expensive to make the model work.\n\n>Usually UV printers are in the $30,000 to $50,000 range.\n\nAnker is marketing this printer to makers for home use. It's not the same as a $50k machine aimed at manufacturers, like the Casio mentioned in the article.\n\nAgain, did you read the article? It explicitly mentions this.\n\n>>UV printing isn’t a new technology. The process uses UV-curable inks to apply layers of color onto a surface that can dry almost instantly when subjected to specific wavelengths of light. This means it can coat practically any surface, from paper to wood to acrylic. You can find a fair number of desktop-sized UV flatbed printers ranging from $2,000 up to $7,000. For something that offers 3D texture, you normally have to shell out a lot more money. Back in 2018, Casio showed off similar 3D printing features with a $50,000 UV printer. That sort of tech is now far more affordable. Anker calls its latest eufyMake device the “first” 3D texture UV printer for home use.",
                      "score": 2,
                      "created_utc": 1745871464.0,
                      "replies": [
                        {
                          "id": "mpwt40p",
                          "author": "Call_Me_Mack",
                          "body": "Just wanted to point out the $300 for ink is for an entire replacement kit. \nOtherwise I think the individual inks are around $42 for 100ml each. \n\nMost \"reviews\" on YouTube so far say the ink usage isn't bad unless you are doing the embossing/\"3d\" prints all the time or large prints at maximum heights. \nOtherwise regular prints are fair it seems.",
                          "score": 3,
                          "created_utc": 1746047978.0,
                          "replies": []
                        },
                        {
                          "id": "mpvonir",
                          "author": "tankueray",
                          "body": "Okay, let me clarify something here.  Most current UV printers are very large format sign printers, like for billboards, and they can even cost over 6 figures.  Flatbed printers of this type were initially dreamed up as DTG printers, and they were quite expensive because t-shirts are always a money maker, it wasn't because the printer was cutting edge technology.  (Casio was way late to the game, btw.)\n\nWell before 2018, [Direct Color Systems](https://www.directcolorsystems.com/about-2/) were selling units based off of the Epson dx5 printers that could go higher than 5mm.  Iirc they were around $25,000 - $45,000 and were made to withstand commercial production, but no bigger than any non-Kornit DTG printer or 40W RF laser system at the time.  I checked them out at every trade show I attended, but there is limited ROI for commercial printing applications, and bespoke items take too much human time to actually be profitable. \n\nAt the same time, Roland was selling a 20\" solvent printer/cutter using the dx7 printhead for under $10,000, and a professional vinyl cutter or sublimation system was under $1000.  \n\nThe markup was only\\*\\* because of wanting to cash in on the folks that were coming from Cricut vinyl cutting into the \"professional\" market who didn't have the space or clientele to screen print or print billboards, and who saw the DTG printers as their golden ticket.  Those first A3 sized UV flatbeds looked nearly identical to the DTGs as well.  I never saw those little phone case sized UV printers at a trade show, that market was (and still is) dominated by sublimation, which was not only faster and cheaper, but the customer could send a photo from their phone to the queue while standing in line and it was ready when they got to the front.  That entire printer/heat press/software system was less than $3000 and extremely portable.  What system do you think the Cricut moms bought into?  What is the marketing strategy of this printer again?\n\n(Sublimation was a cheap way to get into the business, but it wasn't cheap to stay in because of proprietary printers, ink, software, and specially coated blanks.  Guess what Cricut marketed to their maker-moms after the big sublimation patent wars were sorted out?)\n\n\\*\\*To be fair, most of the DTG/UV printers like that at the time were assembled by hand in the US from off the shelf Epson printers without Epson's permission, so some of the cost was actual small-scale labor, fabrication, and electronics.  And the high cost of all professional systems includes in-person training and human tech support from your regional reps at nearly any time of day or night.",
                          "score": 1,
                          "created_utc": 1746036141.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mphn95j",
          "author": "fraseyboo",
          "body": "Ooof, that’s a tough sell for now then. Thankfully the 3D printing community are insanely good at open sourcing solutions so we’ll probably see a much cheaper version soon. That’ll inevitably be followed up by companies making their own versions too.\n\nGive it maybe a year or so and this tech will be available from pretty much every major 3D printer manufacturer.",
          "score": 31,
          "created_utc": 1745851239.0,
          "replies": [
            {
              "id": "mphur3a",
              "author": "jjayzx",
              "body": "Ink printers would have been done long ago, but the ongoing issue is the print head. No easy way to make one. There needs to be a company willing to design and sell an open source print head.",
              "score": 26,
              "created_utc": 1745853532.0,
              "replies": [
                {
                  "id": "mpi30g5",
                  "author": "Gecko23",
                  "body": "It wouldn’t be surprising if the print head for this machine is novel and covered by active patents. You’ll see the 3rd party innovation when those expire, just like FDM exploded after a number of key patents went away.",
                  "score": 19,
                  "created_utc": 1745855981.0,
                  "replies": [
                    {
                      "id": "mpiu9ow",
                      "author": "NotAHost",
                      "body": "I know ink print heads more than I'd like to admit due to grad school and some of my jobs. While there are a lot of patents around ink print heads, there are a lot of brands out there and with respect to printing something as simple as a UV ink (i.e. not particle loaded, normal viscosity range ~10-20cps), you can pretty much use any branded print head.  Print heads are usually manufactured with a semiconductor/MEMs-like process, so open source for print heads are much more difficult. However, finding the cheapest COTS printhead and building around it is likely, you can find a variety of projects on hackaday for example. \n\nA big challenge with any sort of ink print head is that they dry out and fail. You can do things to keep them from drying out, but from a consumer perspective we are spoiled by low maintenance devices and ink print heads always have *some* routine maintenance such as flushing with a solvent made for the ink, or keeping it plugged in to occasionally jet and refilling the ink as an operating cost even when you're not using the printer. I wouldn't put it past the open source community to find innovative ways to keep printheads from drying out, I did my own sort of 'hacks' at my job, but IMO it's a matter of scale, and I'm not sure if there will be a large enough community to maintain drive in open source UV printers.",
                      "score": 4,
                      "created_utc": 1745863958.0,
                      "replies": []
                    },
                    {
                      "id": "mpj09wt",
                      "author": "ToMorrowsEnd",
                      "body": "I'm betting 100% its the same Epson UV printhead used on all UV printers sold.",
                      "score": 3,
                      "created_utc": 1745865752.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mphxh36",
                  "author": "fraseyboo",
                  "body": "A lot of the advancements we've seen in 3D printing have come from large projects like Voron and Klipper along with dedicated enthusiasts like CNCKitchen. There are definitely challenges with building a printhead like this but there's a big enough enthusiast community out there that'll figure out most of the R&D for free.\n\nIf you look at a project like Enraged Rabbit Carrot Feeder you'll see how the open source community integrate with companies to regularise a specification and make kits, that eventually leads to commercial implementations.",
                  "score": 4,
                  "created_utc": 1745854345.0,
                  "replies": [
                    {
                      "id": "mpj8c7i",
                      "author": "jjayzx",
                      "body": "I've been in the 3d printing and multicopter community since inception. It's one thing to machine basic parts and design PCBs and scrounge whatever is already available. There's no standard print head to rip from something or just available in mass. Print heads use the same technology as chip manufacturing.",
                      "score": 3,
                      "created_utc": 1745868177.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mpkqr5b",
          "author": "Sylanthra",
          "body": "Can you use normal filament 3d printer for the shape and this to \"paint\" over it as a finishing step?",
          "score": 4,
          "created_utc": 1745885850.0,
          "replies": [
            {
              "id": "mpvqw10",
              "author": "tankueray",
              "body": "I've also wondered about this, and given my experience with both technologies I'm hypothesizing that you might be able to build up some base depth with FDM, but it would have to be mostly flat so that the laser depth finders would still be able to focus enough to give the required print resolution.  Any more than about 1mm will probably leave those lower levels looking fuzzy or oversprayed.  An alternative would be to use the UV printer to print a background, then 3D print on the substrate whatever element you really wanted to stand out, a la hueforge.",
              "score": 1,
              "created_utc": 1746036788.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpr363v",
          "author": "joe_bibidi",
          "body": "Not to \"defend\" it but it strikes me like this is going to be something for like, small business hustler types. It doesn't really make much sense to me for general enthusiast purposes or for real industrial applications, it feels like some of those \"cheap\" (read: not that cheap) embroidery machines that streetwear startups were using like crazy in the 2010s. But in this case, it'll be like, shitty art stalls at bad street fairs selling knockoff Basquiats/Warhols/etc. for $300 with $200 of production costs under their belt.",
          "score": 1,
          "created_utc": 1745970495.0,
          "replies": [
            {
              "id": "mpuqfwg",
              "author": "tankueray",
              "body": "I agree. No one with real commercial printer experience has reviewed it that I've seen so far.",
              "score": 1,
              "created_utc": 1746026264.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mpkuhb3",
          "author": "altarr",
          "body": "Your beta tester is making extreme prints at that cost.  This is designed to add depth and print on a wide variety of objects, not replace 3d printer style relief",
          "score": -1,
          "created_utc": 1745887155.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mphd6gu",
      "author": "Underskysly",
      "body": "This dose not look like real painted art, it looks more like gimmicky raised prints",
      "score": 59,
      "created_utc": 1745848018.0,
      "replies": [
        {
          "id": "mphgjc8",
          "author": "Princess_Moon_Butt",
          "body": "These kinds of printers _can_ be really cool for textured prints.  If you're trying to make it look like an oil painting, you're gonna have a rough time, but it can do some cool stuff.\n\nThat said, this specific one looks like it can _only_ run through Anker's cloud service- no desktop app or direct communications. Which probably means that they not only steal all of your pictures via some buried line in their TOS, but that if they ever decide to pull support for it, you're left with a very expensive brick.",
          "score": 42,
          "created_utc": 1745849121.0,
          "replies": [
            {
              "id": "mphk7jz",
              "author": "ToMorrowsEnd",
              "body": "this is the biggest problem.  It's cloud connected and does not work at all when not on the internet.",
              "score": 14,
              "created_utc": 1745850293.0,
              "replies": []
            },
            {
              "id": "mphto1z",
              "author": "LogJamminWithTheBros",
              "body": "What if it turns out they use the stuff people print to train ai models?",
              "score": 6,
              "created_utc": 1745853200.0,
              "replies": [
                {
                  "id": "mphvg4m",
                  "author": "Princess_Moon_Butt",
                  "body": "I'm sure that's 100% the game plan.  And/or selling the stored data/artworks as a bundle to some 'designers' who will scour it for cool images and list the designs on redbubble or other insta-print shops.",
                  "score": 5,
                  "created_utc": 1745853740.0,
                  "replies": []
                },
                {
                  "id": "mphvqnv",
                  "author": "resil_update_bad",
                  "body": "I think that's implied",
                  "score": 1,
                  "created_utc": 1745853828.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mphw6rg",
              "author": "iMogal",
              "body": "Agreed. Would not buy.",
              "score": 1,
              "created_utc": 1745853963.0,
              "replies": [
                {
                  "id": "mpi0d8s",
                  "author": "Great_Dismal",
                  "body": "But it can print on tapered mugs…",
                  "score": 3,
                  "created_utc": 1745855201.0,
                  "replies": [
                    {
                      "id": "mpi3snn",
                      "author": "iMogal",
                      "body": "So?\nPlease see comment above.",
                      "score": 1,
                      "created_utc": 1745856215.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mpie3k6",
                  "author": "Great_Dismal",
                  "body": "I knew I should have added the /s",
                  "score": 2,
                  "created_utc": 1745859269.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mphdwot",
          "author": "Jacklebait",
          "body": "The flat prints it does is pretty wild. Make metal posters for $2 worth of ink.\n\nThe discord and FB group has a lot of the photos of the projects the beta guys did. Not in my price range and they are targeting \"Makers\\Sellers\".",
          "score": 2,
          "created_utc": 1745848259.0,
          "replies": [
            {
              "id": "mpjdhv0",
              "author": "ffxivdia",
              "body": "Do u have a link to that discord server?",
              "score": 1,
              "created_utc": 1745869758.0,
              "replies": [
                {
                  "id": "mpjeibk",
                  "author": "Jacklebait",
                  "body": "https://discord.gg/eufymake",
                  "score": 2,
                  "created_utc": 1745870063.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mphryuu",
          "author": "AnRealDinosaur",
          "body": "It looks like a gimmicky raised print of trashy Ai slop. Is the \"real painted art\" in the room with you, gizmodo?",
          "score": 5,
          "created_utc": 1745852684.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mphz2b2",
      "author": "ElvishLore",
      "body": "And they use AI art to showcase this? Ugh.",
      "score": 10,
      "created_utc": 1745854816.0,
      "replies": []
    },
    {
      "id": "mph41hv",
      "author": "butter4dippin",
      "body": "That shit probably won't work without an Internet connection and it probably spies on you",
      "score": 74,
      "created_utc": 1745844744.0,
      "replies": [
        {
          "id": "mph5xzq",
          "author": "imakesawdust",
          "body": "And given Anker's history, they'll swear up and down that it doesn't spy on you until someone shows the network traffic indicating that it does.",
          "score": 40,
          "created_utc": 1745845451.0,
          "replies": [
            {
              "id": "mph8697",
              "author": "stockinheritance",
              "body": "chief versed slap sable wrench unique bike capable full vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 16,
              "created_utc": 1745846265.0,
              "replies": [
                {
                  "id": "mph93im",
                  "author": "imakesawdust",
                  "body": "Look up the Eufy (an Anker sub-brand) controversy.  They doubled-down on their claims that their cameras only did local storage even after people published network traffic proving that the cameras were uploading unencrypted video streams to the cloud.",
                  "score": 39,
                  "created_utc": 1745846595.0,
                  "replies": [
                    {
                      "id": "mphgokn",
                      "author": "Sawses",
                      "body": "As a general rule, do *not* put your cameras on your main network. You put them on a subnet that links them to each other and to a shared folder that serves as their storage. They shouldn't ever be able to see anything except that shared folder and, depending on the device, each other.",
                      "score": 22,
                      "created_utc": 1745849168.0,
                      "replies": [
                        {
                          "id": "mpima3e",
                          "author": "RustywantsYou",
                          "body": "Awesome and how do I do that. Is there like a website I can learn about it or something",
                          "score": 5,
                          "created_utc": 1745861638.0,
                          "replies": [
                            {
                              "id": "mpj9bp1",
                              "author": "beren12",
                              "body": "Find a managed switch, cheap online and learn how to use it",
                              "score": 1,
                              "created_utc": 1745868479.0,
                              "replies": []
                            },
                            {
                              "id": "mpinlz6",
                              "author": "Sawses",
                              "body": "Honestly, that is one area where I would say ChatGPT is an essential resource. Tell it your experience level, the operating system you're using, and what exactly you want, and ask it to guide you.\n\nThat's how I taught myself Linux to set up my own home-based server. There are just a ton of moving parts and considerations that a novice won't think of, and that's where LLMs excel--they're great at providing context and prompting you to ask the important questions. Most guides assume way more competence than I had. \n\nI constantly found myself using it to figure out the broad strokes of what I wanted to do, Googling up some of the many well-written guides on those topics, and then asking ChatGPT to explain any command or phrase that was used without explanation in the guide.",
                              "score": -6,
                              "created_utc": 1745862019.0,
                              "replies": [
                                {
                                  "id": "mptvf6f",
                                  "author": "IronPikachu",
                                  "body": "funny how you got downvoted, seemingly solely for the high crime of suggesting that someone use ai",
                                  "score": 0,
                                  "created_utc": 1746016386.0,
                                  "replies": [
                                    {
                                      "id": "mpv6f0p",
                                      "author": "tankueray",
                                      "body": "Right? I'm old school and had to learn Linux by walking to school both ways uphill, in the snow, everyday; but I think this might be an actual useful thing that AI could do.  \n\nAnd it was a respectful, well written answer.  (Again, crusty old Gen X here, so that's usually not my style, but I'd like to compliment the writer for it.)",
                                      "score": 0,
                                      "created_utc": 1746030909.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mphd54o",
                  "author": "ArchusKanzaki",
                  "body": "The charger and cable are fine.\n\nIts the internet-connected one that can be a problem and need to take abit more caution.",
                  "score": 8,
                  "created_utc": 1745848006.0,
                  "replies": [
                    {
                      "id": "mphgri6",
                      "author": "szotsaki",
                      "body": "You'd think so: [https://shop.hak5.org/products/omg-cable](https://shop.hak5.org/products/omg-cable)\n\nFeatures:\n\n* **Easy WiFi Control** Full control with your web browser. Desktop or mobile.\n* **Keystroke Injection** Instant DuckyScript payloads. No recompiling or reprogramming, just click run! And with industry-leading 890keys/sec speeds.\n* **Lots of Payload slots** Basic model comes with 8 slots. Elite has extra storage allowing up to 200 slots!\n* **Global Keymaps** With 192 keymaps already built in, you can target machines across the world.\n* **Built in IDE** The WebUI not only provides 100% of the controls, but also gives you helpful feedback to catch syntax errors while rapidly building payloads.\n* **Mobile Payloads** Cables with a USB-C active end, or Directional C to C, can automatically transmit to mobile devices with a USB-C connector. Connect just the active end!\n* **Stealth** The implant stays dormant until a payload is deployed. No logs. No detections. The cable behaves just like a normal USB 2.0 cable. (5v charging, 480mps data transfer) Spoof any USB identifer (VID/PID), extended USB Identifier, and network MAC address.\n\n* **Hardware Keylogger** Elite models contain a passive hardware keylogger designed for FullSpeed USB keyboards with detachable cables. Store up to 650,000 keystrokes. For tested keyboards & more info go [here](https://github.com/O-MG/O.MG-Firmware/wiki/Keylogger).\n* **HIDX StealthLink** Elite models: setup a bidirectional tunnel from Target Host > [O.MG](http://O.MG) \\> Control Machine.\n* **Encrypted Network C2** Elite models: Use an encrypted connection to access & control your O.MG from anywhere. Then disable the onboard WebUI to hide and protect your O.MG on untrusted networks. Compatible with any server that runs python.\n* **Self-Destruct** Make your legal team happy by ensuring sensitive payloads & loot are gone, and the O.MG Cable is fully inert. (recoverable with O.MG Programmer)\n* **Geo-Fencing** Trigger payloads or other actions based on location. Keep your tool from falling out of scope! Ex: self-destruct if someone takes the [O.MG](http://O.MG) Cable home.\n* **WiFi Triggers** Trigger payloads at long range with a single beacon.",
                      "score": -10,
                      "created_utc": 1745849194.0,
                      "replies": [
                        {
                          "id": "mphh54c",
                          "author": "ArchusKanzaki",
                          "body": "....And are you really suggesting Anker stealthily ship you hacked cable? REALLY? Yes, I know they exist, but I do not believe Anker is shipping those. I know ppl were up in arms for the Eufy thing, but don't be that stupid",
                          "score": 16,
                          "created_utc": 1745849316.0,
                          "replies": [
                            {
                              "id": "mpjf0bd",
                              "author": "szotsaki",
                              "body": "Just because I linked a cable, for general education, to show that it takes virtually no space to embed a remote keylogger within, you're suddenly calling me stupid and shouting in your comment.\n\nIt's just an interesting fact, that's all. Why do you need to get personal over a cable?",
                              "score": 1,
                              "created_utc": 1745870212.0,
                              "replies": [
                                {
                                  "id": "mplg3c6",
                                  "author": "ArchusKanzaki",
                                  "body": "....because its not even related to the topic? I told the other guy that Anker's cable and charger are fine but the internet-connected devices Anker selling may need to be careful. And you are the one who jump with totally unrelated product. What I'm supposed to infer from that?",
                                  "score": 1,
                                  "created_utc": 1745894816.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mph4y17",
          "author": "Mooseymax",
          "body": "But I can make my own custom embossed Pokemon cards right?",
          "score": 3,
          "created_utc": 1745845081.0,
          "replies": []
        },
        {
          "id": "mphdkkq",
          "author": "Jacklebait",
          "body": "It works offline but the AI features are connection dependent.",
          "score": 1,
          "created_utc": 1745848148.0,
          "replies": []
        },
        {
          "id": "ms0752r",
          "author": "aphaits",
          "body": "Man there should be a global regulation where hardware components should work offline and cloud features is not mandatory.",
          "score": 1,
          "created_utc": 1747094441.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mph6kyn",
      "author": "FreezaSama",
      "body": "Big nope from me dog.",
      "score": 7,
      "created_utc": 1745845686.0,
      "replies": []
    },
    {
      "id": "mph7677",
      "author": "historicartist",
      "body": "👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽 go stuff your printer",
      "score": 5,
      "created_utc": 1745845902.0,
      "replies": []
    },
    {
      "id": "mphjdo9",
      "author": "GentlemenHODL",
      "body": "This is going to make those making giclees a lost easier. I don't know if that's good or bad though.",
      "score": 2,
      "created_utc": 1745850030.0,
      "replies": []
    },
    {
      "id": "mphpy7j",
      "author": "Specialist-Bee-9406",
      "body": "This is perfect for making tacky religious art to sell to evangelicals!",
      "score": 2,
      "created_utc": 1745852066.0,
      "replies": []
    },
    {
      "id": "mpny0w5",
      "author": "seanrm92",
      "body": "Can't wait to crank out AI slop to sell at my local arts market.",
      "score": 1,
      "created_utc": 1745936879.0,
      "replies": []
    },
    {
      "id": "mpouw4u",
      "author": "HotHamBoy",
      "body": "Of course they printed an AI dragon",
      "score": 1,
      "created_utc": 1745946461.0,
      "replies": []
    },
    {
      "id": "mpv3t4n",
      "author": "None",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1746030142.0,
      "replies": [
        {
          "id": "mpv3vym",
          "author": "tankueray",
          "body": "3D printing is also a business I've been in for nearly 20 years, and I'm sorry folks, those of you that are trying to envision this machine like a 3D printer or that it could be improved with the ingenuity of the 3D printer/open source community are out of your element.  This is not new, look up DIY DTG and see that there are limits to what is possible.  The electronics and print heads are always going to be proprietary.  The reason why printheads are so expensive is that the manufacturers shut down 3rd party sales years ago, even though they didn't make their own specialty ink, wide-format machines at the time.  They also have electronic lockout systems on them now, as do the ink cartridge readers and ink counters.  The only way to get an OEM printhead from the manufacturer is to have proof of purchase of the machine it was originally installed in, or through one of the few companies authorized to use those heads in the machines that they manufacture.  \n\nThe popularity of this KS will wake the dragon.  Eufy/Anker will have to abide by whatever deal they made (or will be forced to make) with the printhead and print engine manufacturer.  If they are not transparent with that information, then there's a real chance that this machine could be a brick once their supply of printheads runs out, plus it could get tied up in lawsuits like Stratasys vs. Bambu or Sawgrass' patent suits against...everybody. \n\nAnyone who's been in the small-scale commercial printing space knows this already, but the rest of y'all need to understand it as well.  I'm still watching this thing and might buy it, but I may also decide to wait until Christmas when all the OG backers are selling because they can't get parts or support.  One thing I am confident in with the 3D/open source community involved is that the machine itself will be able to be used even without the proprietary software or server communication, and I have a lot of practice working on printheads.  \n\nP.S. - For the newbies that are interested in this thing, inkjet printers have very specific temperature and humidity requirements.  Only one reviewer I saw mentioned that, and most of the others appear as though they had these machines in their garages.  You can't keep it in a garage unless it's temperature controlled, and the little carbon filter is worthless, just like FDM or Resin printing, do not keep this thing unventilated in a living space.",
          "score": 1,
          "created_utc": 1746030166.0,
          "replies": [
            {
              "id": "mrmu29h",
              "author": "redcomp12",
              "body": "It means on room at apartment its not good? Where children also living? Not an house, small apartment",
              "score": 1,
              "created_utc": 1746904615.0,
              "replies": [
                {
                  "id": "msaov9x",
                  "author": "tankueray",
                  "body": "No.  Across all industries where thermoplastic, thermoset, or chemical or photo-polymerized resins are used; they have some of the most strict worker safety standards for exposure.  If you can't dedicate a closed room with mechanical ventilation to it, I wouldn't recommend putting it where children are.",
                  "score": 1,
                  "created_utc": 1747240789.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mqicwk4",
      "author": "BusyNoise315",
      "body": "What about long-term support?  This machine has proprietary parts like a Glowforge, so when it breaks, you’ll likely have to pay to ship it to China for repairs, covering shipping and tariffs both ways, which could get pricey fast. The ink is already overpriced at $299 for 600ml, and with tariffs, it jumps to $477 to ship to you—that’s $12.50–$23.50 for just 100 small prints, compared to the 3060UV-V2’s $0.24! eufyMake’s lack of transparency on ink usage and support is a red flag, and they’ve already abandoned their 3D printer backers in the past, leaving them with nothing. They’re promising free shipping on 6,437 units, but that’s $7.9 million in shipping and tariffs they might not handle, risking delays or hidden fees. You’ll have to raise your prices much higher than expected to recoup costs on this toss-away machine. Save your money",
      "score": 1,
      "created_utc": 1746350310.0,
      "replies": []
    },
    {
      "id": "mrmir32",
      "author": "redcomp12",
      "body": "Do you think will be other manufacturers of the ink? Sth cheaper?",
      "score": 1,
      "created_utc": 1746900757.0,
      "replies": []
    },
    {
      "id": "mphvja1",
      "author": "Mister-Bohemian",
      "body": "I ran away from eufy when I learned how prohibitive their ui is and how cheap and irreplaceable their parts are.",
      "score": 0,
      "created_utc": 1745853766.0,
      "replies": []
    },
    {
      "id": "mpkfl5x",
      "author": "AccomplishedIgit",
      "body": "Can’t wait for all the terrible art this is going to enable",
      "score": 0,
      "created_utc": 1745882008.0,
      "replies": []
    },
    {
      "id": "mpl3cwj",
      "author": "mishyfuckface",
      "body": "That’s a picture alright",
      "score": 0,
      "created_utc": 1745890300.0,
      "replies": []
    },
    {
      "id": "mpidpij",
      "author": "RainOfAshes",
      "body": "Look guys, you can only connect to it with your phone! How hip! 🤮",
      "score": -1,
      "created_utc": 1745859158.0,
      "replies": []
    },
    {
      "id": "mpja5dd",
      "author": "teedeeguantru",
      "body": "That’s cool. I was worried that the tariffs were going to put the price of hideous crap out of my reach.",
      "score": -1,
      "created_utc": 1745868732.0,
      "replies": []
    }
  ]
}