{
  "post": {
    "title": "Sony is halting production of recordable Blu-ray, MiniDiscs and MiniDV cassettes",
    "author": "a_Ninja_b0y",
    "id": "1i8whih",
    "score": 769,
    "created_utc": 1737728563.0,
    "selftext": "",
    "num_comments": 68,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i8whih/sony_is_halting_production_of_recordable_bluray/"
  },
  "comments": [
    {
      "id": "m8wy8ao",
      "author": "NuPNua",
      "body": "They were still making blank Minidiscs? Crazy. Loved that format, perfect stop gap between Walkmen and MP3 unlike CD Walkmen which were too big by necessity.",
      "score": 237,
      "created_utc": 1737729071.0,
      "replies": [
        {
          "id": "m8xoipn",
          "author": "Iucidium",
          "body": "I bought some blank MDs from Japan not long ago, oh man.",
          "score": 35,
          "created_utc": 1737736677.0,
          "replies": [
            {
              "id": "m8zdhny",
              "author": "originalusername__",
              "body": "There are dozens of us!",
              "score": 21,
              "created_utc": 1737753767.0,
              "replies": [
                {
                  "id": "m910zfj",
                  "author": "Sivalon",
                  "body": "Dozens!",
                  "score": 4,
                  "created_utc": 1737772837.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9187wc",
          "author": "cutestslothevr",
          "body": "Japan loves its antiquated formats.  Minidiscs are loved for having a better, closer to CD, sound quality than MP3s normally do.   Audiophiles have moved on to lossless files though, since modern storage media has made file size less important.",
          "score": 18,
          "created_utc": 1737775480.0,
          "replies": [
            {
              "id": "m95o0dk",
              "author": "deknegt1990",
              "body": "My father is an amateur radio maker and he still actively uses MD because it's a quick format to play jingles, bumpers and other soundbites in a way that's logical and easy for him to cue up ahead of time.\n\n\nHe has a PC to record with and play actual music, but uses MD (amongst every other format from the past 50 years) to add to the recordings in a less cumbersome way since he doesn't have access to pro studio software other than Audition 1.0 he bought ages ago.",
              "score": 2,
              "created_utc": 1737839773.0,
              "replies": [
                {
                  "id": "m9au33y",
                  "author": "73893",
                  "body": "Has he ever looked into a Roland Sp404? Lots of space what he’d use it for, all triggered by pressing the pads. Adding sounds is just dragging and dropping via usb or you can record straight into it with a mic in or the internal mic the 404 has",
                  "score": 2,
                  "created_utc": 1737913876.0,
                  "replies": [
                    {
                      "id": "m9gsiyu",
                      "author": "deknegt1990",
                      "body": "That would be pretty cool (at least from my point of view), but his entire studio is cobbled together with stuff he picked up on the cheap and he learned to make it work in his system, so just buying something like that is kind of out of his playbook.",
                      "score": 2,
                      "created_utc": 1737992178.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m90777v",
          "author": "gatsome",
          "body": "Panasonic might still make them",
          "score": 6,
          "created_utc": 1737762716.0,
          "replies": []
        },
        {
          "id": "m92ml3s",
          "author": "UnusualSoup",
          "body": "In Japan they are super popular, still.",
          "score": 3,
          "created_utc": 1737802301.0,
          "replies": [
            {
              "id": "m92n7y3",
              "author": "NuPNua",
              "body": "Not surprised, they still love physical media there for people who live in tiny houses.\n\nI know the format flopped in the US but a lot of people had them in the UK when I was in school. Web MDs were the one, people were rocking those 256mb MP3 sticks and I could store three times as much on one MD with meta data and all.",
              "score": 3,
              "created_utc": 1737802689.0,
              "replies": [
                {
                  "id": "m94fv1q",
                  "author": "mhathaway1",
                  "body": "I’m so confused by your comment, which sounds genuine when I read it. Why would people that live in tiny houses that have very limited storage space prefer physical media that they have to store on shelves? If I had a super small space, all I would want is a super nice laptop and have everything by digital media. I have so much physical media right now because I own a huge house and at some point my possessions have taken over my house and I want to just purge it all. ",
                  "score": 3,
                  "created_utc": 1737826776.0,
                  "replies": [
                    {
                      "id": "m99q0p2",
                      "author": "TheMelv",
                      "body": "Smaller physical media compared to larger alternatives. I'm assuming maybe there are areas with bad/no Internet access.",
                      "score": 0,
                      "created_utc": 1737901865.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m90f0yk",
          "author": "chum_slice",
          "body": "They will stop these formats… but floppy discs… keep em coming… 😂",
          "score": 2,
          "created_utc": 1737765271.0,
          "replies": [
            {
              "id": "m98z7si",
              "author": "KFR42",
              "body": "It's because of all those super important legacy systems that still run off of them.",
              "score": 1,
              "created_utc": 1737889550.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m8wz0eh",
          "author": "Giantmidget1914",
          "body": "MiniDV is the small video cassettes for handheld camcorders.  Not that I disagree with you on mini disc but I don't think they've been making those for a while now.",
          "score": -19,
          "created_utc": 1737729322.0,
          "replies": [
            {
              "id": "m8wz59y",
              "author": "NuPNua",
              "body": "It says both in the headline.",
              "score": 16,
              "created_utc": 1737729366.0,
              "replies": [
                {
                  "id": "m8wzdc5",
                  "author": "Giantmidget1914",
                  "body": "Omg, you're right.  I missed that altogether somehow.   My bad.",
                  "score": 7,
                  "created_utc": 1737729438.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m8x0a0y",
              "author": "ASaltySeacaptain",
              "body": "Skaters are in trouble. They were keeping the MiniDV format alive.",
              "score": 13,
              "created_utc": 1737729729.0,
              "replies": [
                {
                  "id": "m8xfqzb",
                  "author": "Sam-Lowry27B-6",
                  "body": "And fisheye lens manufacturers",
                  "score": 6,
                  "created_utc": 1737734252.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8x0coe",
      "author": "Vaestmannaeyjar",
      "body": "Uh oh. Going to have to stock on some. I only use them as a collector and 90es nostalgic, as they have no real use in terms of efficiency nowadays. But listening to music on my 90es hifi is more engaging than just using a phone.",
      "score": 74,
      "created_utc": 1737729753.0,
      "replies": [
        {
          "id": "m8x27zu",
          "author": "feinting_goat",
          "body": "I know exactly what you mean. I use minidiscs to rip my records to maintain that 90’s feeling too.",
          "score": 18,
          "created_utc": 1737730334.0,
          "replies": [
            {
              "id": "m8xkct9",
              "author": "Camburgerhelpur",
              "body": "Guess I gotta research ripping records. I have a ton I'd love to  rip",
              "score": 6,
              "created_utc": 1737735540.0,
              "replies": [
                {
                  "id": "m8xmm9n",
                  "author": "feinting_goat",
                  "body": "I have a Sony minidisc recorder. Coming from a vinyl I record it just like a tape deck, Manually punch it in and out. This is how I “archived” my albums before I could record them to a PC. But now that pretty much everything is available everywhere there’s not even a need to “preserve” a recording unless you have something truly special.",
                  "score": 5,
                  "created_utc": 1737736155.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8x4l4q",
          "author": "SouthestNinJa",
          "body": "I’ll still throw files and what I want on a disc to give to people instead of a flash drive. This way I don’t have to worry about it coming back untrusted.",
          "score": 3,
          "created_utc": 1737731045.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8xnkal",
      "author": "triadwarfare",
      "body": "I remember upgrading from CD to a DVD burner but Blu-Ray burners never caught on. My DVD Burner/Bluray reader stopped being useful after more than 10 years. I also could not open the drive as I think something stuck inside.",
      "score": 31,
      "created_utc": 1737736414.0,
      "replies": [
        {
          "id": "m8z8d0k",
          "author": "dudeAwEsome101",
          "body": "I kept waiting for Blu-ray drives price to go down before putting one in my system. They never got cheap enough to to the price of a DVD burner, so I skipped them all together.\n\n\nI still have an old external LG DVD writer in case I come across an OLD disc.",
          "score": 24,
          "created_utc": 1737752312.0,
          "replies": [
            {
              "id": "m8za2ne",
              "author": "YeahMateYouWish",
              "body": "Yeah same here, and disks were still relatively expensive too. Digital storage got better and cheaper before blu rays were anywhere near as useful/disposable as CDs or dvds.",
              "score": 4,
              "created_utc": 1737752800.0,
              "replies": [
                {
                  "id": "m8zbbzs",
                  "author": "dudeAwEsome101",
                  "body": "Yeah, by the time Blu-ray came in price a bit, thumb drives had large capacity at cheap prices, and cloud storage was common.\n\n\nCompare that to the era of DVDs where a thumb drives were pricy and had sizes in MB compared to 4.5GB of a DVD. I remember having a few rewritable dual layer DVDs that made sharing stuff with friends at school a lot easier.",
                  "score": 3,
                  "created_utc": 1737753159.0,
                  "replies": [
                    {
                      "id": "m8zclod",
                      "author": "YeahMateYouWish",
                      "body": "Sounds like we've had a similar journey with media. I bought a pack of 10 DVDrw and used to pass them around with stuff on until thumb drives were cheap. Did you have spindles of DVD-R all over the place? I did with movies on. I found a blank 50 spindle a few months ago and gave them to my wife's dad as he's still stuck back in the dvd age haha.",
                      "score": 2,
                      "created_utc": 1737753517.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m905vcy",
                  "author": "glitchvid",
                  "body": "That's what got me, good drives were down to $50 at one point, but the $/GB on recordable media is painful, basically unchanged over the decades.\n\n\nI still use it for extra-long-term cold storage backups, but it's only economical for smaller files.",
                  "score": 2,
                  "created_utc": 1737762288.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m8yvy83",
          "author": "iosseliani_stani",
          "body": "There's a little rubber ribbon/band that's part of the opening mechanism, and that is usually the first thing to go since it's prone to decay. Though sometimes it's just caked in dust & debris and only needs to be cleaned out to work again, and even if it has decayed it's easy to replace if you're OK with taking stuff apart.\n\nOf course, I only use my drive's burning capabilities for CDs now, and even then only once or twice a year for the rare friend who still appreciates a physical mix CD. I haven't had to burn a DVD or Blu-ray in over a decade.",
          "score": 3,
          "created_utc": 1737748763.0,
          "replies": []
        },
        {
          "id": "m9g1lxw",
          "author": "Trang0ul",
          "body": "Blu-rays were introduced to the market too late, when everyone was switching to flash drives or cloud storage.",
          "score": 1,
          "created_utc": 1737983079.0,
          "replies": []
        },
        {
          "id": "m9wt1gh",
          "author": "this_dudeagain",
          "body": "If you don't use them for a long time the belt will dry rot and get stuck. Not hard to fix.",
          "score": 1,
          "created_utc": 1738191473.0,
          "replies": [
            {
              "id": "m9zr8ry",
              "author": "triadwarfare",
              "body": "It's literally hard to open. I think I snapped a few plastic parts trying to disassemble that thing.",
              "score": 1,
              "created_utc": 1738236276.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xgfhw",
      "author": "rumski",
      "body": "If you have a NetMD device gathering dust you can play with https://web.minidisc.wiki. I found that and brought out my portable recorder and deck again and have been making new mixes.",
      "score": 18,
      "created_utc": 1737734442.0,
      "replies": []
    },
    {
      "id": "m8y7mms",
      "author": "yoshilurker",
      "body": "Man I thought MiniDisc went out of production years ago. I guess I should buy some while I can just because.",
      "score": 11,
      "created_utc": 1737741956.0,
      "replies": [
        {
          "id": "m8zl3lb",
          "author": "Noctew",
          "body": "HiMDs went out of production many years ago, but regular ones were still being made. MD was huge in Japan so they kept them available for a long time after they stopped making new recorders. I hope they still have a good supply in their warehouses, even if production ceases now. \n\nI got a great deal on some NOS Sony Metal XR tapes when they dumped them, years after production ended - maybe it'll be the same with MD.",
          "score": 6,
          "created_utc": 1737755911.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m8yotyk",
      "author": "AeitZean",
      "body": "As long as someone is still making burnable blu rays I can use for backups then thats fine. I thought the title meant sony were stopping anyone from producing any for a minute 😅",
      "score": 13,
      "created_utc": 1737746747.0,
      "replies": [
        {
          "id": "m96en3k",
          "author": "vcsx",
          "body": "4K Blu-Ray is probably the last form of physical media we'll ever see.  Stores are already shrinking or eliminating their DVD/Blu-Ray sections.  Give it another 10 years and they'll be as rare as movie rental stores.",
          "score": 3,
          "created_utc": 1737848296.0,
          "replies": [
            {
              "id": "m9db56w",
              "author": "Thelango99",
              "body": "So what do people play when an internet connection is not available?",
              "score": 1,
              "created_utc": 1737938992.0,
              "replies": [
                {
                  "id": "m9dbf1k",
                  "author": "vcsx",
                  "body": "You can play downloaded digital movies and games without internet.",
                  "score": 1,
                  "created_utc": 1737939075.0,
                  "replies": [
                    {
                      "id": "m9fuhir",
                      "author": "doyouevennoscope",
                      "body": "Yeah, but not if the HDD gets fried lmao then it's all instantly gone forever.",
                      "score": 0,
                      "created_utc": 1737979986.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9jo5gc",
                  "author": "Next-Abalone-267",
                  "body": "Read books!?",
                  "score": 1,
                  "created_utc": 1738021676.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m8yt7b9",
      "author": "speculatrix",
      "body": "I definitely need to buy blank Blu-ray media. I don't burn many disks but soon new-old stock will become very expensive.",
      "score": 7,
      "created_utc": 1737747979.0,
      "replies": [
        {
          "id": "m95ti9i",
          "author": "Emu1981",
          "body": "I bought a Blu-ray burner back in like 2018/2019 but I still haven't bought a single piece of recordable media for it lol",
          "score": 2,
          "created_utc": 1737841441.0,
          "replies": [
            {
              "id": "m95x86i",
              "author": "speculatrix",
              "body": "I have a virtual optical drive.. It's looks like a portable 2.5\" hard drive, but you copy on iso files and it pretends to be a cd, dvd or Blu-ray. It can also act as a hard drive. Since I bought it, I've hardly ever needed to burn a coaster.",
              "score": 1,
              "created_utc": 1737842598.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m8xzjmi",
      "author": "piratecheese13",
      "body": "Oh no! Now how will our underfunded highschool video production class that hasn’t gotten new cameras in 30 years possibly function?!",
      "score": 11,
      "created_utc": 1737739724.0,
      "replies": []
    },
    {
      "id": "m8x43e5",
      "author": "Fufubear",
      "body": "God I loved minidisc!  Best quality of music I had as a kid WAY over the mp3 player degraded quality.",
      "score": 7,
      "created_utc": 1737730896.0,
      "replies": []
    },
    {
      "id": "m8x27jk",
      "author": "spreadthaseed",
      "body": "NetMD players were awesome. Hard to complete with an iPods utility…. But they were awesome",
      "score": 3,
      "created_utc": 1737730330.0,
      "replies": []
    },
    {
      "id": "m90dhyh",
      "author": "bluesmudge",
      "body": "I was amazed they still made MiniDV cassettes since the cameras stopped being relevant 10 years ago. I always thought Sony made the best tapes with the fewest dropouts. I do still have a camera that record in HDV on MiniDV, so time to stock up so I can still have some fun with that camera. The footage has a unique look, with a bit of a '90s/'00s handycam look because of the limited color space and dated sensor, but with a semi-respectable 1080i resolution. So it could still be a useful tool in the future. Sometimes you just want something that looks different to be visually compelling, not something that technically performs the best.",
      "score": 3,
      "created_utc": 1737764761.0,
      "replies": []
    },
    {
      "id": "m8z8t8s",
      "author": "None",
      "body": "XDCAM 4 Ever",
      "score": 2,
      "created_utc": 1737752439.0,
      "replies": []
    },
    {
      "id": "m8z6jfg",
      "author": "FuelForYourFire",
      "body": "I'm glad I stayed true to HD-DVD, suckers!    .....",
      "score": 3,
      "created_utc": 1737751799.0,
      "replies": []
    },
    {
      "id": "m8wytib",
      "author": "EditedRed",
      "body": "This is going to upset North Korea.",
      "score": 3,
      "created_utc": 1737729260.0,
      "replies": []
    },
    {
      "id": "m8x3bmr",
      "author": "armyguy8382",
      "body": "Damn.",
      "score": 1,
      "created_utc": 1737730665.0,
      "replies": []
    },
    {
      "id": "m8z82bi",
      "author": "Kumimono",
      "body": "Noooo. :(",
      "score": 1,
      "created_utc": 1737752228.0,
      "replies": []
    },
    {
      "id": "m92irjm",
      "author": "thenotanurse",
      "body": "Ngl I didn’t know they were still making any of these.",
      "score": 1,
      "created_utc": 1737799899.0,
      "replies": []
    },
    {
      "id": "m92kas4",
      "author": "AtomicSymphonic_2nd",
      "body": "Oh, I’m extremely sure this will piss off some older Japanese customers of theirs.\n\nThey will likely even try to get a petition to go around demanding Sony continue producing Minidiscs.\n\nAnd I’m sure that petition will not even get past 10,000 signatures. Lol",
      "score": 1,
      "created_utc": 1737800871.0,
      "replies": []
    },
    {
      "id": "m92yb22",
      "author": "zuctronic",
      "body": "Good thing I have about 600 blank minidiscs and dozens of blank mini DV cassettes in my collection already!",
      "score": 1,
      "created_utc": 1737808882.0,
      "replies": []
    },
    {
      "id": "m9311yv",
      "author": "bigersmaler",
      "body": "Damn. The hotel from Casino Royale will need a new security system.",
      "score": 1,
      "created_utc": 1737810150.0,
      "replies": []
    },
    {
      "id": "m934tyx",
      "author": "AzhdarianHomie",
      "body": "Males me wanna get some blank MiniDiscs, wonder of the software is still called SonicStage",
      "score": 1,
      "created_utc": 1737811769.0,
      "replies": []
    },
    {
      "id": "m93afyf",
      "author": "Riptide360",
      "body": "End of an era.",
      "score": 1,
      "created_utc": 1737813973.0,
      "replies": []
    },
    {
      "id": "m9599dk",
      "author": "gnapster",
      "body": "Thankfully, my 2003 video camera takes SD cards and tapes. It’s laughable that I still have it, but it’s the easiest way to get that tape effect on camera without using filters, especially if you are a new filmmaker which describes my young cousin who I lent it to.",
      "score": 1,
      "created_utc": 1737835274.0,
      "replies": []
    },
    {
      "id": "m8zm56d",
      "author": "best2keepquiet",
      "body": "Less plastic out in the world",
      "score": -2,
      "created_utc": 1737756211.0,
      "replies": []
    },
    {
      "id": "m90c9lv",
      "author": "justhereforsee",
      "body": "Less plastic good.     Entering the era that we don’t own any of our media but it still cost full price",
      "score": -2,
      "created_utc": 1737764362.0,
      "replies": []
    }
  ]
}