{
  "post": {
    "title": "Nintendo Switch 2 case could be a true teaser of the new handheld's design and dimensions | A larger form factor and new dimensions for the Switch 2, according to Dbrand",
    "author": "chrisdh79",
    "id": "1hfftl3",
    "score": 252,
    "created_utc": 1734343081.0,
    "selftext": "",
    "num_comments": 97,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hfftl3/nintendo_switch_2_case_could_be_a_true_teaser_of/"
  },
  "comments": [
    {
      "id": "m2bb6hy",
      "author": "Chronotaru",
      "body": "Wouldn't this be in breach of an NDA or something? How would they know that, and be so brazen about it? Maybe someone has a friend with a devkit? I wouldn't want to test the patience of Nintendo lawyers.",
      "score": 51,
      "created_utc": 1734347975.0,
      "replies": [
        {
          "id": "m2bl2bf",
          "author": "samtherat6",
          "body": "I’m guessing Nintendo hasn’t sent them a console, but maybe to another case manufacturer that DBrand is buddies with.",
          "score": 15,
          "created_utc": 1734353313.0,
          "replies": [
            {
              "id": "m2cj8li",
              "author": "trickman01",
              "body": "Doubt any of their “friends” would risk sharing anything with them.",
              "score": 4,
              "created_utc": 1734366113.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2j5062",
          "author": "Tacotuesday8",
          "body": "Well my uncle works for Nintendo…",
          "score": 2,
          "created_utc": 1734459923.0,
          "replies": []
        },
        {
          "id": "m2gq2h3",
          "author": "thanatossassin",
          "body": "Dbrand has a history of sucking, I don't think any legit company would ever seriously give them a prototype.",
          "score": 6,
          "created_utc": 1734421770.0,
          "replies": [
            {
              "id": "m2mt33v",
              "author": "doubleshotofespresso",
              "body": "remember their knock off animal crossing new horizons switch dock and joycon skins? yeah, no way ***nintendo*** of all companies is giving ***them*** a console",
              "score": 4,
              "created_utc": 1734512551.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2c1osp",
          "author": "maqcky",
          "body": "Probably a factory leak. I don't think they get any official license from Nintendo.",
          "score": 3,
          "created_utc": 1734360149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2b53c0",
      "author": "Fritzschmied",
      "body": "If that’s true that it won’t have an oled that would be a huge miss tbh.",
      "score": 131,
      "created_utc": 1734343962.0,
      "replies": [
        {
          "id": "m2b9124",
          "author": "Concupiscence",
          "body": "They gotta leave something for the mid gen refresh so people double dip.",
          "score": 167,
          "created_utc": 1734346609.0,
          "replies": [
            {
              "id": "m2c45jy",
              "author": "cockyjames",
              "body": "I'm thinking they will do a refresh with an OLED panel at the same time they do a die-shrink revision. Just speculating. But follow the Steamdeck model",
              "score": 22,
              "created_utc": 1734361038.0,
              "replies": [
                {
                  "id": "m2e1u25",
                  "author": "Ehtor",
                  "body": "Didn't they do it first though?",
                  "score": 13,
                  "created_utc": 1734383170.0,
                  "replies": [
                    {
                      "id": "m2e3hfj",
                      "author": "cockyjames",
                      "body": "Well Nintendo did a die shrink that was a quiet revision, though they changed the packaging. And separately they did an OLED model with the die shrink. But not the two at the same time. But yeah, you’re sort of right, they just did it incrementally. SD did it in one revision, which is how I *think * Nintendo will do it this time around",
                      "score": 3,
                      "created_utc": 1734383689.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2b9fzo",
          "author": "Hamuelin",
          "body": "Agreed. They did so well with the OLED display. It’d be sad to see an upgraded Switch 2 actually have a sizeable downgrade in a key area. \n\nSome people won’t mind of course and that’s absolutely fine, power to them. But as with the more recent Steam Deck, OLED screens are just so so much nicer to look at. Especially for bright and saturated titles that Nintendo are known for.",
          "score": 39,
          "created_utc": 1734346876.0,
          "replies": [
            {
              "id": "m2blhzd",
              "author": "KarmabearKG",
              "body": "I’m one of those weirdos that really doesn’t play my switch  handheld at all, so it doesn’t bother me personally. It means the device should be cheaper in theory",
              "score": 29,
              "created_utc": 1734353512.0,
              "replies": [
                {
                  "id": "m2c1ws4",
                  "author": "Ashencroix",
                  "body": "They should consider releasing 2 SKUs at launch: a cheaper one with LCD and a pricier one with OLED to give a choice. Maybe a 3rd one for pure docked users that don't have a screen, on board battery, and joycons and come bundled with a pro controller and is cheaper than either hybrid models?",
                  "score": 16,
                  "created_utc": 1734360229.0,
                  "replies": [
                    {
                      "id": "m2cjfyp",
                      "author": "fluteofski-",
                      "body": "As a former supply chain guy, I’d wager that having a no-screen switch won’t really save enough to be worth opening additional dies and SKU’s. You might chop $20~$30 off the end price. Because the different design configs are gonna cost money to too. And for $30 I’d wager that just about any consumer would be like “eh. Yeah. Might as well take the screen one.” There’s also risk in carrying additional sku’s that you don’t know for certain will sell especially if they’re at a lesser price point, that can take away sales from higher price points. If they end up with excess inventory, and have to reduce prices it also devalues the higher price models.\n\nThe OLED/LCD one wouldn’t be a bad idea but as someone else said I wouldn’t be surprised if they launch with LCD, because it’s easier to secure supply and ramp production for those. They’ll secure all the launch sales, and then release OLED later to double up on sales where people want to upgrade to OLED, some LCD will end up on the used market (which is fine for Nintendo, because that means they have a new customer buying games), but/and a lot will go to become a 2nd household switch (kids/multiplayer/families) as Nintendo positions themselves as a family oriented console.",
                      "score": 24,
                      "created_utc": 1734366179.0,
                      "replies": [
                        {
                          "id": "m2dsk2o",
                          "author": "colin_colout",
                          "body": "This guy value streams ☝️☝️☝️",
                          "score": 7,
                          "created_utc": 1734380267.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2d3m4c",
              "author": "piroso",
              "body": "So while I 100% am disappointed by the news (or rumors) that it won't have a OLED screen, it's funny because I would also never use it in handheld mode. \n\n\nI do currently own a launch version of the switch (my daughters) and I did purchase the BOTW OLED version of the switch. I just can't stand the joycons whatsoever and only ever play with it docked and with a pro controller. Maybe the new joycons will be bigger and a more comfortable fit in my hands and that would change my feelings on using it in handheld mode. \n\n\n\nI just feel like the only two reasons I can think of them not using a OLED panel would be 1 to cut production costs and 2 to have something to add to the refresh. But without having any real knowledge of how much these things cost, I do wonder how much more it would really add to the price tag (assuming my guess is anything near correct). Regardless of all this, not launching with an OLED is a pretty simple way for me to feel like I don't mind waiting. Which again is such a funny outlook considering what my expected use case will be haha.",
              "score": 3,
              "created_utc": 1734372541.0,
              "replies": []
            },
            {
              "id": "m2bx3gw",
              "author": "Esc777",
              "body": "They are. And more expensive. This is classic Nintendo. ",
              "score": 0,
              "created_utc": 1734358412.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2bk48x",
          "author": "Mother_Restaurant188",
          "body": "A huge miss indeed. Switch OLED is gorgeous.\n\nBut as long as the LCD is higher quality than Switch OG then it should hold me off until an OLED version. I don’t mind waiting.",
          "score": 9,
          "created_utc": 1734352865.0,
          "replies": []
        },
        {
          "id": "m2cp10u",
          "author": "PeaceBull",
          "body": "As a mainly handheld player I was annoyed with the no OLED news. \n\nUntil I thought about how new parts (cpu/gpu/ram) cost more compared to a nearly tax year old console’s parts. And while I’d love the better screen the better internals are way more important to me if I had to choose. And the reality is Nintendo has a price ceiling that they’re unwilling to go over so there will have to be sacrifices.",
          "score": 3,
          "created_utc": 1734367954.0,
          "replies": []
        },
        {
          "id": "m2gmbaq",
          "author": "Johnny_Menace",
          "body": "Yeah going from OLED back to LCD is a huge downgrade",
          "score": 3,
          "created_utc": 1734419398.0,
          "replies": []
        },
        {
          "id": "m2cyxdg",
          "author": "johnsnoflake76",
          "body": "If sales don’t meet expectations, we may get that Oled refresh sooner than 4 years",
          "score": 2,
          "created_utc": 1734371082.0,
          "replies": []
        },
        {
          "id": "m2rmhlh",
          "author": "Forest_GS",
          "body": "being larger than the original switch is a huge miss as well, there are already pocketable windows palm handhelds powerful enough to emulate the original nintendo switch.",
          "score": 2,
          "created_utc": 1734577709.0,
          "replies": []
        },
        {
          "id": "m2csl0z",
          "author": "jackolantern_",
          "body": "That's how they keep the price down and then sell a more expensive version",
          "score": 1,
          "created_utc": 1734369087.0,
          "replies": [
            {
              "id": "m2cu01i",
              "author": "Fritzschmied",
              "body": "They could have just keep using the oled screen in the current switch oled which is perfectly fine and also kept the price down because the wouldn’t have do develop and source a new screen.",
              "score": 2,
              "created_utc": 1734369538.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2c99pi",
          "author": "_sharpmars",
          "body": "120 Hz > OLED\n\nBut yeah, both would be preferable.",
          "score": -4,
          "created_utc": 1734362828.0,
          "replies": [
            {
              "id": "m2cbagr",
              "author": "Fritzschmied",
              "body": "Maybe for you. I would take a 60hz oled all day long over a 120 hz lcd. Especially for mobile gaming because honestly the gpu inside that thing won’t be able to do 120hz anyway for the AAA titles.",
              "score": 12,
              "created_utc": 1734363512.0,
              "replies": [
                {
                  "id": "m2ckbtn",
                  "author": "_Rand_",
                  "body": "I'll definitely agree with this.\n\nNintendo barely cares about performance, 120fps on a regular basis isn't happening.  I'd rather have a nice screen 100% of the time than 120fps in 1/20 games.\n\nWell, unless it does VRR/framegen which I doubt it will.",
                  "score": 5,
                  "created_utc": 1734366463.0,
                  "replies": [
                    {
                      "id": "m2oqfuf",
                      "author": "ArtOfWarfare",
                      "body": "I’d say performance comes more from software than hardware.\n\nI don’t think compute cycle times have changed much in the past 20 years - everything is in the 1-4 GHz range. So if you went all out, your performance is 4x better.\n\nImprovements by boosting cores are similarly linear, but it depends on your software being written so it can scale across multiple cores.\n\nReally the place where improvements come from is software, where you find something taking O^2 or O^3 or worse time and bring it down. You don’t see the 10-20% improvement typical from hardware changes - you see it go 10-1000x faster.\n\nThat’s why you see a game like BotW and Pokemon on the same console. One of those games are actually well optimized. The other is terrible and takes 10x as long or worse to do the same thing.",
                      "score": 1,
                      "created_utc": 1734542742.0,
                      "replies": []
                    },
                    {
                      "id": "m2cq9le",
                      "author": "_sharpmars",
                      "body": "It will 100% have DLSS 3 frame generation",
                      "score": -2,
                      "created_utc": 1734368344.0,
                      "replies": [
                        {
                          "id": "m2csyh3",
                          "author": "_Rand_",
                          "body": "I'd like to think so, I just don't trust nintendo to do the obvious.\n\nLike how long did it take them to do acceptable online features?\n\nI half expect the damn thing to be capable and they just disable it for no apparent reason.",
                          "score": 1,
                          "created_utc": 1734369205.0,
                          "replies": [
                            {
                              "id": "m2duuw1",
                              "author": "colin_colout",
                              "body": "Couldn't games just implement fsr?",
                              "score": 1,
                              "created_utc": 1734380993.0,
                              "replies": [
                                {
                                  "id": "m2h07bk",
                                  "author": "Mistrblank",
                                  "body": "Yep.  There’s no need for specific hardware either.   Switch 1 already does this.   No Man’s Sky got a huge boost in look from it.",
                                  "score": 1,
                                  "created_utc": 1734428678.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2ce7m3",
                  "author": "None",
                  "body": "I personally don't care whenever or not its OLED or LCD. I just want the battery life to not be shit.",
                  "score": 1,
                  "created_utc": 1734364481.0,
                  "replies": [
                    {
                      "id": "m2ci9a6",
                      "author": "Fritzschmied",
                      "body": "Also in that case oled is the better option if battery life matters to you.",
                      "score": 7,
                      "created_utc": 1734365797.0,
                      "replies": [
                        {
                          "id": "m2clfv6",
                          "author": "None",
                          "body": "That’s the only reason why I got Steam Deck Oled instead of LCD model lol. But Switch’s case the battery life was good on V2 and lite models, it became perfect on OLED model though. \n\n\nI hate the fact that Switch 2 will be bigger (My main issue with steam deck) but as long as the battery is good and we will get new games instead of remakes of old ones (Looking at you PS5). Everything will be good.",
                          "score": 1,
                          "created_utc": 1734366819.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2d75jy",
              "author": "spinelession",
              "body": "lol, the current switch can’t even push 30fps half the time",
              "score": 4,
              "created_utc": 1734373648.0,
              "replies": [
                {
                  "id": "m2ddkru",
                  "author": "_sharpmars",
                  "body": "Many first-party Switch games run at a flawless 60 FPS, including Mario Kart 8, Super Mario Odyssey, Metroid Prime Remastered, Super Smash Bros. Ultimate, Metroid Dread, Super Mario Bros. Wonder and Splatoon 2 & 3.\n\nFuture 60 FPS games could reach 120 FPS with DLSS frame generation.",
                  "score": 2,
                  "created_utc": 1734375631.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2c69r1",
          "author": "LePouletMignon",
          "body": "Mini-LED is better than OLED.\n\nGetting really old with the uncritical \"OLED\" comments. Even LCDs can be solid if it's a quality panel. Look at the PS Portal.",
          "score": -8,
          "created_utc": 1734361791.0,
          "replies": [
            {
              "id": "m2dgar7",
              "author": "obi1kenobi1",
              "body": "What are you talking about? The Portal is a great example of how awful LCDs are, it’s an absolutely terrible screen by every metric except resolution. A laughably bad display by 2023 standards that Sony should be deeply ashamed of, considering that they were the early pioneers of OLED and by now OLED is a mature and affordable technology. The only barely adequate mini LED LCD I’ve ever seen in my life is the one from the 16” MacBook Pro, which has an order of magnitude more dimming zones than is typical on mini LED displays, the only mini LED I’ve ever seen where bloom isn’t immediately noticeable and distracting, and even it’s put to shame in terms of color intensity and contrast by the dirt cheap portable OLED monitor I got off of Amazon.\n\nThe only way “mini LED” is better than OLED is if you got confused and meant *micro* LED, but that technology is still mostly experimental and not commercially viable so we don’t really know if it has the benefits that it claims to (and likely won’t find out for ~10-15 years).",
              "score": 2,
              "created_utc": 1734376471.0,
              "replies": [
                {
                  "id": "m2dhdgx",
                  "author": "sargrvb",
                  "body": "I won't buy OLED until they fix burn in. I have a very expensive Dell 21:9 that is noticeably charred after three years of use. I can only imagine how badly a portable game console would do with kids who play 2+ hours a day every day. Certain GUI elements will scar the panel. I'm sure Nintendo people don't care because they'll buy another after a couple years anyways, but I don't think we should standardize obselesence any more than we already have.",
                  "score": 1,
                  "created_utc": 1734376801.0,
                  "replies": [
                    {
                      "id": "m2dmk9c",
                      "author": "guywhoclimbs",
                      "body": "Have you seen the burn in videos from Wulff Den? Switch oled took a really long time to have burn in. I'm really impressed with how well it's done.",
                      "score": 5,
                      "created_utc": 1734378393.0,
                      "replies": [
                        {
                          "id": "m2drq0f",
                          "author": "sargrvb",
                          "body": "Good recommendation, just watched it. It again proves my point. I suggest those interested in OLED watch it. \n\nhttps://youtu.be/E2FpG6M037E\n\nIt backs 100% of what I've said. Takes about 2 years to start heavily noticing the burn in, after 3 I see it all the time. I expect my top line electronics / displays to last 5 years personally before I refresh. It's really irritating to me. But I get it. Not everyone cares about accurate colors. If you're a 1-3 game person, avoid OLED at all cost. The 'moving pixels' thing basically gradients the decay, but does NOT fix the problem.",
                          "score": 2,
                          "created_utc": 1734380004.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2dyrv5",
                      "author": "obi1kenobi1",
                      "body": "The good news is that burn in is already fixed, it’s really not an issue anymore. On modern devices from the past 5 years or so the only way to get an OLED to burn in is with great effort, subjecting it to one static high contrast image for literal years on end.\n\nNo amount of normal gameplay will ever burn in an OLED in any significant way, I’ve seen LCDs with worse burn-in than modern OLEDs.",
                      "score": -2,
                      "created_utc": 1734382223.0,
                      "replies": [
                        {
                          "id": "m2dzwn9",
                          "author": "sargrvb",
                          "body": "You're 100% wrong on this, which is why I keep bringing up my comments. Until someone SHOWS the new tech working 'flawlessly' it doesn't exist. Show me a screen without OLED burn in after two years of heavy use. It doesn't exist. Stop spamming misinformation.",
                          "score": 1,
                          "created_utc": 1734382572.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2c81un",
              "author": "Fritzschmied",
              "body": "Yes mini led CAN be better than oled. But lcd definitely isn’t.",
              "score": -2,
              "created_utc": 1734362411.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2czx3m",
          "author": "VagueSomething",
          "body": "OLED sucks for gaming. It still burns in, yes it is harder to cause than it used to but if you play a few hundred hours of a game with static UI you still risk it happening. As nice as they colours look, reliable longer life is better for your average gamer than luxury screens.",
          "score": -5,
          "created_utc": 1734371397.0,
          "replies": [
            {
              "id": "m2d1502",
              "author": "Fritzschmied",
              "body": "That’s bulshit. You can prevent burn in today pretty good. If not every smart watch would burn in and they don’t. Also oled lixel refresh also got way better in the last years.",
              "score": 0,
              "created_utc": 1734371774.0,
              "replies": [
                {
                  "id": "m2dhnvh",
                  "author": "sargrvb",
                  "body": "This is 100% not bullshit. The reason watch screens don't burn in is because they're idle more than 50% of the day. People who have not power-used an OLED have no idea how bad it can get even with pixel shifting, break times, etc. It's an actual concern.",
                  "score": 1,
                  "created_utc": 1734376891.0,
                  "replies": [
                    {
                      "id": "m2dli0r",
                      "author": "Fritzschmied",
                      "body": "I literally have my Apple Watch in always on screen mode for over a year and it hasn’t burn in. With proper software it is possible to prevent it.",
                      "score": 1,
                      "created_utc": 1734378069.0,
                      "replies": [
                        {
                          "id": "m2dqg4a",
                          "author": "sargrvb",
                          "body": "A year isn't long enough. Like I said, it takes three or so on the best screens. This isn't even debatable, it's physics.\n\nEdit: Physics don't lie. Expect to replace that watch about 2 years in, if not 3 for sure. \n\nhttps://youtu.be/E2FpG6M037E",
                          "score": 1,
                          "created_utc": 1734379602.0,
                          "replies": [
                            {
                              "id": "m2dumbt",
                              "author": "Fritzschmied",
                              "body": "A year always on is way more than i would use my switch in 5-10 years tbh. 🤷🏻‍♂️\n\nAlso if the base model of the switch would have oled game devs could take that into account and design the zu around that. If it has a lcd nobody cares and once the oled edition will be release the same issue will be there.",
                              "score": 0,
                              "created_utc": 1734380918.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2cc57y",
      "author": "randomIndividual21",
      "body": "Who really care about switch 2 design? I mean it's literally the same, just slightly bigger",
      "score": 22,
      "created_utc": 1734363798.0,
      "replies": [
        {
          "id": "m2d0msp",
          "author": "ArminTamzarrian",
          "body": "Yeah. Ask the real questions like will the Wii U Sports baseball be back or nah",
          "score": 12,
          "created_utc": 1734371618.0,
          "replies": []
        },
        {
          "id": "m2ccxf2",
          "author": "LeRoseEigengrau",
          "body": "Some people just want any crumb of info while others might take this as a sign it’s release is nearing.",
          "score": 3,
          "created_utc": 1734364057.0,
          "replies": [
            {
              "id": "m2cdaqj",
              "author": "randomIndividual21",
              "body": "Well then, here is some more crumb, it's going to announced at Jan and releade in march",
              "score": -2,
              "created_utc": 1734364180.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2evqys",
          "author": "DvaInfiniBee",
          "body": "Just give me a small Lite version with HDMI out and I will buy it instantaneously. That’s ALL I freaking want.",
          "score": 1,
          "created_utc": 1734393176.0,
          "replies": []
        },
        {
          "id": "m2d7pin",
          "author": "BluePeriod_",
          "body": "It’s really boring. I hope for clamshell even as a lite variant. The whole “tablet sized console with remotes” thing is so chintzy and unimaginative. It’s not even portable in a convenient way.",
          "score": -5,
          "created_utc": 1734373819.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2bm5b8",
      "author": "None",
      "body": "God can they please fix the shitty ergonomics of the joycons please?",
      "score": 14,
      "created_utc": 1734353809.0,
      "replies": [
        {
          "id": "m2c68mq",
          "author": "Oldsodacan",
          "body": "Also how goddamn breakable they are. The 80 dollar price tag combined with how the joysticks just stop working is incredibly shitty.",
          "score": 12,
          "created_utc": 1734361781.0,
          "replies": [
            {
              "id": "m2cl4gy",
              "author": "ltlt1",
              "body": "The Switch 2 Joy-Con will supposedly hall effect joysticks, so there's at least that...",
              "score": 4,
              "created_utc": 1734366717.0,
              "replies": [
                {
                  "id": "m2exqcm",
                  "author": "Oldsodacan",
                  "body": "“New and improved joy cons now 100 dollars”",
                  "score": 2,
                  "created_utc": 1734393885.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2ce2w0",
      "author": "None",
      "body": "Uhg. Still no D pad.",
      "score": 13,
      "created_utc": 1734364438.0,
      "replies": [
        {
          "id": "m2cnjny",
          "author": "HRudy94",
          "body": "Idk why you got downvoted though, it makes no sense to still not have a proper dpad.   \n  \nYeah i know \"joycons can be used as single controllers\" and shit, but it's easily the worse controller you could have when it comes to comfort and it just feels like a gimmick, just bring a proper controller with it. 99% of joycon use is vertical with the two pieces together anyways, either attached to the console or to the grip. Almost nobody uses them splitted between 2 players.",
          "score": 5,
          "created_utc": 1734367491.0,
          "replies": [
            {
              "id": "m2crz2s",
              "author": "stefanopolis",
              "body": "It sucks because the split joycons is one of its biggest physical defining features for the console but also like you said, nobody uses it that way. So they’ll keep it like a vestigial limb and we’ll all be the worse for it.",
              "score": 5,
              "created_utc": 1734368889.0,
              "replies": [
                {
                  "id": "m2e2mzu",
                  "author": "Ehtor",
                  "body": "I'd like to see them release a first-party Joy-Con with a D-pad then.",
                  "score": 4,
                  "created_utc": 1734383423.0,
                  "replies": []
                },
                {
                  "id": "m2gkfhu",
                  "author": "FUTURE10S",
                  "body": "Fucking Clubhouse Games forces me to use it that way on local multiplayer, I got the AA adapter so the controller won't feel so smaall",
                  "score": 0,
                  "created_utc": 1734418268.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2d7tia",
          "author": "BluePeriod_",
          "body": "It’s a big reason I just went for the Lite in the end.",
          "score": 0,
          "created_utc": 1734373853.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2lxam1",
      "author": "marc-andre-servant",
      "body": "If the're still relying on Nvidia chip eFuses for jailbreak protection, I'd guess an overclocked Raspberry Pi microcontroller would be able to time the exact moment any Nintendo digital signature is verified and cut power to the CPU for a few nanoseconds to skip the firmware validation check. This is the exact method used to jailbreak \"new\" Switch consoles like the Switch Lite and the OLED model.\n\nEven if there are no boot ROM vulnerabilities in the CPU/GPU code, if you can carefully time a nanosecond-precision power glitch to the chip and there are no glitch detection circuits within the SoC itself, you can get it to skip instructions. The OG Switch did have a USB bug in the boot ROM (fusee gelee). This was fixed in later models but didn't prevent open-source modchips from glitching the power supply to the SoC at the exact time it performed \"if (signatureInvalid()) {abortBoot()}\".",
      "score": 1,
      "created_utc": 1734494735.0,
      "replies": []
    },
    {
      "id": "m2bimmx",
      "author": "FroggyCrossing",
      "body": "Ugh I hope not. No one wants a LARGER handheld ffs",
      "score": -21,
      "created_utc": 1734352133.0,
      "replies": [
        {
          "id": "m2c0pkr",
          "author": "HeirOfBreathing",
          "body": "what was the best seller of every ds? oh yeah the xl",
          "score": 9,
          "created_utc": 1734359788.0,
          "replies": [
            {
              "id": "m2d1sy7",
              "author": "SoldierOfOrange",
              "body": "To be fair the 3DS XL still fits in my pocket, and I can just throw that in my bag. For a Switch, you always need a case to protect the screen and buttons, which makes its footprint like twice if not three times that of the 3DS XL. Its successor being even bigger would kind of suck.",
              "score": 5,
              "created_utc": 1734371977.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2bmxys",
          "author": "Concupiscence",
          "body": "I do. I have tons of handhelds and I love my Steam Deck (I doubts it's going to be bigfer than it). I never play them outside, I just love the form factor and being able to play on the couch while my wife watches something else. I'm probably on the minority, but if I go out somewhere, it's not to play videogames. I understand for people who travel for work and have downtime in a hotel room or something though.",
          "score": 8,
          "created_utc": 1734354171.0,
          "replies": [
            {
              "id": "m2bqg2f",
              "author": "TabulatorSpalte",
              "body": "The only way to solve this is for Nintendo to offer two form factors.",
              "score": -5,
              "created_utc": 1734355712.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2c5lv1",
          "author": "hey_you_too_buckaroo",
          "body": "Yeah. Some people might want that, but I'd rather keep it small. ",
          "score": 4,
          "created_utc": 1734361559.0,
          "replies": []
        },
        {
          "id": "m2cmg8w",
          "author": "HRudy94",
          "body": "On one hand i did think the same but then i remembered the Switch is already not really portable nowadays lol. Since you will need a bag to carry it anyways, might as well make it a bit bigger to fit a bigger battery and screen. as long as it's not heavier it's alright.  \nThough, yeah i'd rather see them make actual handhelds that fit in your pocket like the PSVita/GPD Win 4/ 3DS (XL) etc, but i guess if they're going the switch route again they might as well make it a bit bigger.",
          "score": 1,
          "created_utc": 1734367144.0,
          "replies": []
        },
        {
          "id": "m2cp534",
          "author": "Slick_Wylde",
          "body": "This is literally the number one thing I’d want for a new console. I got the switch towards the beginning, played handheld like 1% of the time because it felt much too small. I really hope the successor finds a way to stay small enough to be portable but substantial enough that I can get a good grip and easily play games in my lap.",
          "score": 1,
          "created_utc": 1734367991.0,
          "replies": []
        },
        {
          "id": "m2fye7t",
          "author": "PocketNicks",
          "body": "You don't speak for everyone. I want larger handhelds, therefore you're wrong.",
          "score": 1,
          "created_utc": 1734407453.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2bgfmt",
      "author": "None",
      "body": "Give us a real console, Nintendo, and some kind of underpowered bs with mobile games",
      "score": -39,
      "created_utc": 1734351001.0,
      "replies": [
        {
          "id": "m2bxj3z",
          "author": "Esc777",
          "body": "Imagine saying this on the heels of one of the most successful consoles of all time. ",
          "score": 21,
          "created_utc": 1734358580.0,
          "replies": [
            {
              "id": "m2c9o00",
              "author": "Twelvve12",
              "body": "That’s literally all they ever say “iTs So UnDeRpOwErEd”\n\n\nAs Nintendo *consistently* outsells the competition",
              "score": 8,
              "created_utc": 1734362963.0,
              "replies": [
                {
                  "id": "m2ca6vr",
                  "author": "Esc777",
                  "body": "Not even just in sales but in consumer satisfaction. \n\nGeneral consensus amongst gamers is that the switch is fine to good to beloved. \n\nMeanwhile the series X and PS5 are grumbled about. What does it say when the flagship of graphics like the PS5 pro debuts to such a thud?",
                  "score": 6,
                  "created_utc": 1734363141.0,
                  "replies": [
                    {
                      "id": "m2ce3ch",
                      "author": "Twelvve12",
                      "body": "At most Nintendo gets heat for their ravenous copyright lawsuits. Which I can’t disagree too much with",
                      "score": 4,
                      "created_utc": 1734364442.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2caccn",
              "author": "RodneyRuxin18",
              "body": "Fair, but not everyone likes it.",
              "score": 1,
              "created_utc": 1734363193.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2cfuz8",
          "author": "m0stly_toast",
          "body": "The switch is the most “real console” out of the current generation and it’s not even close, how about the Xbox and playstation give us real enjoyable games and original IPs?",
          "score": 2,
          "created_utc": 1734365017.0,
          "replies": [
            {
              "id": "m2hnzu9",
              "author": "munchyslacks",
              "body": "There are pros and cons to each. Yeah you could get a “real” console like a PS5 if you don’t mind paying several hundred more and don’t mind having like 10 exclusive games after 5 years. The Switch has 180 exclusives and twice as many games with a Metacritic score of 85 or higher, and it’s on track to being the best selling console of all time. Maybe it’s fair to admit that the underpowered console was a choice, and they knew exactly what they were doing from the start?",
              "score": 1,
              "created_utc": 1734441917.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2cr23r",
          "author": "Cheezewiz239",
          "body": "From someone who's never touched their games I bet",
          "score": 1,
          "created_utc": 1734368596.0,
          "replies": []
        },
        {
          "id": "m2fyknm",
          "author": "PocketNicks",
          "body": "Go buy a real console then, or a gaming pc. There are plenty of other options if you don't like the handheld format.",
          "score": 0,
          "created_utc": 1734407525.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2e04s0",
      "author": "crashbandyh",
      "body": "The performance difference between the switch and switch 2 will be about the same or less than the difference between the ps5 to ps5 pro, mark my words",
      "score": -12,
      "created_utc": 1734382641.0,
      "replies": [
        {
          "id": "m2e9174",
          "author": "Braydon64",
          "body": "Not even close. Take a look at the rumored spacs and it is lightyears beyond what the Switch 1 is.",
          "score": 8,
          "created_utc": 1734385442.0,
          "replies": []
        }
      ]
    }
  ]
}