{
  "post": {
    "title": "Nintendo Switch 2 confirmed to feature NVIDIA T239 SoC with 1536 CUDA Ampere GPU",
    "author": "None",
    "id": "1kh2fi9",
    "score": 1697,
    "created_utc": 1746637095.0,
    "selftext": "",
    "num_comments": 459,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kh2fi9/nintendo_switch_2_confirmed_to_feature_nvidia/"
  },
  "comments": [
    {
      "id": "mr43e1q",
      "author": "francescomagn02",
      "body": "Everyone shit talking the specs when all i want to know is what this means for the chances the console has of a day 1 exploit",
      "score": 709,
      "created_utc": 1746643903.0,
      "replies": [
        {
          "id": "mr4j3p4",
          "author": "shavin_high",
          "body": "100 percent. I used the hell out of my day one switch 1 exploit",
          "score": 300,
          "created_utc": 1746648482.0,
          "replies": [
            {
              "id": "mr4qepl",
              "author": "alxrenaud",
              "body": "Just give me a stable emulator like Ryujinx and I'm fine. I bought many switch games, but I mostly play them on my emulator because the performance is so much better.",
              "score": 163,
              "created_utc": 1746650542.0,
              "replies": [
                {
                  "id": "mr4ve3f",
                  "author": "shavin_high",
                  "body": "Hopefully whomever comes along with a switch 2 emulator doesn't shout it from the rooftops like the last guys",
                  "score": 90,
                  "created_utc": 1746651938.0,
                  "replies": [
                    {
                      "id": "mr5zzru",
                      "author": "StarZax",
                      "body": "They didn't, especially Ryujinx devs\n\nWhat made so much noise was mostly the repackers uploading the new Zelda as if it was a PC game, Fitgirl and stuff like that. That gave way too much attention, I had a friend who was playing BoTW in front of my eyes and when I asked which emulator he was using, he asked me what an emulator was. It was THAT easy. I don't see why I should blame the emulators devs for doing that. You could blame the Yuzu devs for making too much money with their patreon because they'd lock the early access versions behind a paywall, but Ryujinx were square.\n\nIt's just bound to happen when piracy becomes THAT easy and mainstream. History told that over and over again (stuff like LimeWire, eMule, megaupload, and so on...)",
                      "score": 58,
                      "created_utc": 1746665452.0,
                      "replies": [
                        {
                          "id": "mr6dv6e",
                          "author": "Mehhish",
                          "body": "If you read the Discord, the moderators/devs were being total dumb asses bragging about pirating TOTK before release, and helping people get it running, even providing download links. That shit made me facepalm so hard. Nintendo has spies everywhere, it's pretty obvious they would have spies in a Switch emulator Discord.",
                          "score": 24,
                          "created_utc": 1746670200.0,
                          "replies": [
                            {
                              "id": "mr6ga82",
                              "author": "kayyeh",
                              "body": "What discord were you on? The Ryujinx discord was pretty stringent on even mentioning the leak before the release. While Yuzu was a bit more lenient, I highly doubt anyone explicitly talked about running the game pre-release there.",
                              "score": 10,
                              "created_utc": 1746671075.0,
                              "replies": [
                                {
                                  "id": "mr6mx3j",
                                  "author": "ItsAMeUsernamio",
                                  "body": "It’s what got them in trouble in the end. Yuzu had a paid early access patreon the whole point of which is to get patches for the newest games, and for the ones in the later half of the Switch’s life that meant games before release since people were able to upload roms of leaked physical copies due to the console being cracked wide open.",
                                  "score": 14,
                                  "created_utc": 1746673616.0,
                                  "replies": []
                                },
                                {
                                  "id": "mr8w6nu",
                                  "author": "StarZax",
                                  "body": "No they didn't, a lot of headlines tried to paint it like that.\n\nAt worst, you had some moderators reaching out in DM to help \"unofficially\" like anyone else could, but there was no piracy talk, even less leaks",
                                  "score": 0,
                                  "created_utc": 1746713035.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mr8vtlq",
                              "author": "StarZax",
                              "body": "I heavily doubt you're talking about any official Discord\n\nIt was very well known that leaks weren't officially supported, you needed to actively find unofficial patches/bypasses by yourself (often available on github) because the devs on both Yuzu and Ryujinx were clear and had rules about their software not being updated for leaks, they would start to work on games after their official release.\n\n  \nWith ToTK, it just happened that because the game is coming near the end of the console's life cycle, it was running pretty well already.\n\n  \nI've heard some things about the Yuzu discord, like they were supposedly sharing some links on DM on something like that, but it wasn't open-bar piracy like some headlines tried to paint the situation to be.\n\nBut Ryujinx, again, they were square. They weren't making \"too much money\" because nothing was locked behind a paywall, and that's probably why Nintendo never tried to sue them, they just knocked on someone's door and threatened. That's what they do.\n\nAnd honestly, even in Yuzu's case, I don't think they were cooked on the matter of who's right, but they were definitely cooked on the matter of Nintendo having time, energy and resources to spend on court.",
                              "score": 2,
                              "created_utc": 1746712920.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr7b17r",
                          "author": "hybridfrost",
                          "body": "Honestly Nintendo kind of showed their cards that the Switch 2 will likely have a similar vulnerability as the first Switch by absolutely stomping out the emulators of a 7 year old console (at the time). But yes, the dev team basically throwing it in Nintendo’s face that they were pirating their brand new Zelda probably didn’t help either",
                          "score": 1,
                          "created_utc": 1746685311.0,
                          "replies": []
                        },
                        {
                          "id": "mroo24g",
                          "author": "None",
                          "body": "[removed]",
                          "score": 0,
                          "created_utc": 1746929059.0,
                          "replies": [
                            {
                              "id": "mroxc02",
                              "author": "StarZax",
                              "body": "I feel nothing but pity for you. I hope that you're a bot, I don't want to imagine the waste of ressources you would be if you were real",
                              "score": 1,
                              "created_utc": 1746932892.0,
                              "replies": [
                                {
                                  "id": "msb6m8j",
                                  "author": "haniblecter",
                                  "body": "nah, I'm real. just don't appreciate people complaining that software theft shouldn't have penalties...",
                                  "score": 0,
                                  "created_utc": 1747245788.0,
                                  "replies": [
                                    {
                                      "id": "msfecih",
                                      "author": "StarZax",
                                      "body": "Then media illiteracy is a real issue for you. My post was never about whether \"software theft shouldn't have penalties\", so your insults make even less sense\n\n  \nIt's unfortunate you're not a bot, but because you're breathing, I still feel pity and sympathy for you. I hope you'll manage to be a better person one day.",
                                      "score": 1,
                                      "created_utc": 1747306256.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr4w199",
                      "author": "alxrenaud",
                      "body": "I would not be surprised if some guys just pick up Ryujinx and update it for Switch2. The architecture may not be much different if it's so easily backwards compatible unless they run the Switch1 games on an internal emulator..",
                      "score": 20,
                      "created_utc": 1746652125.0,
                      "replies": [
                        {
                          "id": "mr6djml",
                          "author": "Mehhish",
                          "body": "It's more similar to Wine than an emulator.",
                          "score": 6,
                          "created_utc": 1746670088.0,
                          "replies": []
                        },
                        {
                          "id": "mr5f9jt",
                          "author": "dire_bedlam",
                          "body": "ModernVintageGamer confirmed it’s emulation, not native BC. So I wouldn’t expect an exploit or emulator any time soon",
                          "score": 14,
                          "created_utc": 1746658280.0,
                          "replies": [
                            {
                              "id": "mr5j907",
                              "author": "Slight-Coat17",
                              "body": "It's not emulation, per se. It's translation, more akin to what Apple does with Rosetta to enable Intel apps to run on their custom CPUs.\n\nIf someone were to dump the translation layer from an exploitable Switch 2...",
                              "score": 17,
                              "created_utc": 1746659648.0,
                              "replies": [
                                {
                                  "id": "mr66ipe",
                                  "author": "funguyshroom",
                                  "body": "Rosetta is translating instructions from x86 to ARM. Both Switch 1 and 2 are ARM so I wonder what is even needed to be translated.",
                                  "score": 7,
                                  "created_utc": 1746667683.0,
                                  "replies": [
                                    {
                                      "id": "mr7e8i1",
                                      "author": "Phoenix__Light",
                                      "body": "The API calls in the GPU changed between the tegra x1 and the more modern ampure generations",
                                      "score": 5,
                                      "created_utc": 1746687215.0,
                                      "replies": [
                                        {
                                          "id": "mr7u0l6",
                                          "author": "SaintLouisX",
                                          "body": "It doesn't change in any meaningful way, either for the Switch service point of view or for the GPU itself.\n\nThe service that devs use to interact with the GPU doesn't have that much in it really ([ref](https://switchbrew.org/wiki/NV_services)), cause there isn't a lot you need from it. Allocating memory, sending the command buffers and some synchronisation is mostly it, which is just the address space, channel and syncpt sections of that reference. The rest don't really matter.\n\nFrom the actual GPU side, the architecture will be the same. Graphics drivers ultimately just exist to turn the graphics api commands into a string of instructions to be sent to the GPU. The process by which this happens (pushbuffers) doesn't change, it's the same in Maxwell as it is in Ampere, and was introduced before Maxwell, but I don't remember which architecture it came in on. Maybe Fermi.\n\nnVidia's open docs don't list all architecture manuals unfortunately, but you can compare the oldest they have (volta) with ampere, for the pushbuffer stuff: [volta](https://github.com/NVIDIA/open-gpu-doc/blob/master/manuals/volta/gv100/dev_ram.ref.txt#L814) vs [ampere](https://github.com/NVIDIA/open-gpu-doc/blob/master/manuals/ampere/ga100/dev_ram.ref.txt#L842). They're identical, and I promise it's the same format for Maxwell on Switch 1, as this was implemented in Yuzu and Ryujinx.\n\nAnd then you can look at the engine methods themselves, like the 3d engine for example, since that's what people usually care about most: [maxwell](https://github.com/NVIDIA/open-gpu-doc/blob/master/classes/3d/clb197.h) vs [ampere](https://github.com/NVIDIA/open-gpu-doc/blob/master/classes/3d/clc797.h) and yeah they obviously differ in offsets, but all of the basic stuff we care about is pretty much the same. Old and new still of course have setting the type of vertices, if transform feedback is used in the geometry shader, tessellation config stuff, setting the rasteriser config like viewport/scissor/depth/clip planes/stencil, blend settings for fragment shader output etc etc. Which shaders are active, their program pointers and bind groupings. I see there is some new stuff, like the mesh shader methods in Ampere, but as far as I know mesh shaders aren't used very much currently, so they're not going to show up in a large percent of games anyway.\n\nSo yeah it's a bit different, but it's not all unheard of for basic operation to get Switch 2 emulation going, everything that already exists in the Switch 1 emulators can be reused there. The way you interact with the GPU via the nv serivce will for sure be almost identical, the way you read the commands and send them off into the engines is all the exact same. The engines themselves are the only things which differ, but they're very similar overall. nVidia don't entirely re-design their *entire* GPU architecture every new series, it's iterative development.\n\nI think Switch 2 emulation, if the console was day 1 hacked again, could show up within just a few months. It wouldn't be a basic emu, only running the basic launch titles like Puyo Puyo Tetris for Switch 1 either, it would be a pretty mature emulator. That is, if people weren't afraid of a Nintendo lawsuit.",
                                          "score": 3,
                                          "created_utc": 1746697172.0,
                                          "replies": [
                                            {
                                              "id": "mr8oo7h",
                                              "author": "funguyshroom",
                                              "body": "I think how hard Nintendo went after both Switch emulators one after another at the very end of the console's lifecycle tells us everything we need to know about how difficult it's gonna be to emulate Switch 2.",
                                              "score": 2,
                                              "created_utc": 1746710606.0,
                                              "replies": [
                                                {
                                                  "id": "mr953ti",
                                                  "author": "SaintLouisX",
                                                  "body": "Yeah I think that's why Nintendo went after them, because of how similar the architectures are. It's the same kernel, the whole services infrastructure will be the same. That's why I said I think it would only take a few months to get games running if another exploit was found.",
                                                  "score": 2,
                                                  "created_utc": 1746715711.0,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "mrd862v",
                                              "author": "JustMikesOpinion",
                                              "body": "I appreciate the detailed explanation. Helps me understand how it all works much deeper.",
                                              "score": 1,
                                              "created_utc": 1746764237.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mr6j396",
                                      "author": "whut-whut",
                                      "body": "It's for piracy protection. The PS4 and PS5 do a similar thing running games in a virtual machine that only runs signed and encrypted data for games, so it's much harder to jailbreak the system.",
                                      "score": 6,
                                      "created_utc": 1746672120.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr5kgo6",
                      "author": "NecroCannon",
                      "body": "That’s the shit that irks me about modern piracy\n\nShut the fuck up already, you guys somehow fueling egos from this are fucking shit up for the people that just want to play games.\n\nIt’s like the “what are you going to do, stab me?”, of piracy, YES, THEY’RE GOING TO GET IT REMOVED! Piracy so well worked before because companies hardly knew how we were doing it, now some dude emulating Mario Wonder on a Steam Deck can hit the front page of Reddit sharing it everywhere… just to brag about running a game that would have of course, run.",
                      "score": -3,
                      "created_utc": 1746660054.0,
                      "replies": [
                        {
                          "id": "mr6jayz",
                          "author": "TheMilkKing",
                          "body": "“Companies hardly knew how we were doing it” \n\nBro you have no fucking idea what you are talking about. *You* figured out how to pirate games, and you don’t think the companies which have an interest in the sales of those games could? Besides, most reliable sources operate out of countries that are legally untouchable. We can yap about them as much as we like.",
                          "score": 0,
                          "created_utc": 1746672201.0,
                          "replies": [
                            {
                              "id": "mr6jjd5",
                              "author": "NecroCannon",
                              "body": "Surrre that’s why Switch emulators on Android keeps dropping like flies",
                              "score": -1,
                              "created_utc": 1746672292.0,
                              "replies": [
                                {
                                  "id": "mr6l4n5",
                                  "author": "TheMilkKing",
                                  "body": "I was talking about modern piracy in general, but regarding switch emulation specifically: No shit that’s gonna get blammed from official app stores. There’s plenty of Android Switch emus on GitHub tho innit",
                                  "score": 2,
                                  "created_utc": 1746672903.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr4vz1x",
                  "author": "Jubenheim",
                  "body": "The performance is only better after years of tweaking and optimizing, and you STILL don’t have full compatibility for all games without varying amount of tweaking on your part. \n\nConsidering the Switch 2 is backwards compatible and way more capable than the Switch 1, I’m completely hyped to buy the new console and never even so much as connect to the internet without an exploit posted online. It’ll be my go-to handheld along with my Steamdeck if it means I can play all Switch 1 games with better compatibility for free.",
                  "score": 22,
                  "created_utc": 1746652108.0,
                  "replies": [
                    {
                      "id": "mr4wr00",
                      "author": "alxrenaud",
                      "body": "And all the power to you! I barely ever use my switch in portable mode. I really cannot play comfortably on any portable console. I use them almost only on flights. I get that most people enjoy the portability a lot more as it suits their lifestyles better and that was the homerun the switch made.",
                      "score": 3,
                      "created_utc": 1746652333.0,
                      "replies": []
                    },
                    {
                      "id": "mriqkyq",
                      "author": "CatProgrammer",
                      "body": "The Switch 2 has also explicitly been stated to not be backwards-compatible with all Switch games.",
                      "score": 1,
                      "created_utc": 1746841191.0,
                      "replies": [
                        {
                          "id": "mrizfr6",
                          "author": "Jubenheim",
                          "body": "Misleading. Nintendo **explicitly stated that MOST Switch 1 games** will be backwards compatible.\n\nIn fact, you can even check out the [list](https://www.nintendolife.com/guides/nintendo-switch-2-backwards-compatible-guide-what-switch-games-cant-be-played) of Switch 1 games not compatible with the Switch 2 and how small it is.",
                          "score": 1,
                          "created_utc": 1746844647.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr4wl0u",
                      "author": "Jamie00003",
                      "body": "“I can play all Switch 1 games with better compatibility for free.”\n\nThese aren’t all free",
                      "score": -8,
                      "created_utc": 1746652285.0,
                      "replies": [
                        {
                          "id": "mr4wpyp",
                          "author": "Jubenheim",
                          "body": "We’re talking about day 1 exploits here. A.K.A., jailbreaking.",
                          "score": 10,
                          "created_utc": 1746652325.0,
                          "replies": [
                            {
                              "id": "mr5860v",
                              "author": "AtomicSymphonic_2nd",
                              "body": "The amount of shit PC gamers put themselves through just to save a few dollars… Christ on a stick, y’all are ridiculous.\n\nWhat’s wrong with just buying the damned game with your hard-earned cash?",
                              "score": -20,
                              "created_utc": 1746655880.0,
                              "replies": [
                                {
                                  "id": "mr5a2af",
                                  "author": "alman12345",
                                  "body": "Why the fuck would I want to pay Nintendo again for doing 0 work “porting” it to the switch 2 and just running it at a higher resolution and frame rate? Modders figured that out for free on the OG switch with overclocking, I’m not paying Nintendo full price to do essentially 0 work for the same Zelda experience. Once there’s a hardware exploit I’ll buy the console and hold my middle finger to Nintendo as I do it.",
                                  "score": 6,
                                  "created_utc": 1746656511.0,
                                  "replies": []
                                },
                                {
                                  "id": "mr59slb",
                                  "author": "Oops_I_Cracked",
                                  "body": "Some of us are fucking poor?",
                                  "score": 5,
                                  "created_utc": 1746656422.0,
                                  "replies": []
                                },
                                {
                                  "id": "mr58r5f",
                                  "author": "ShinsBlownOff",
                                  "body": "![gif](giphy|3o85xIO33l7RlmLR4I)",
                                  "score": 2,
                                  "created_utc": 1746656075.0,
                                  "replies": []
                                },
                                {
                                  "id": "mr6klsa",
                                  "author": "TheMilkKing",
                                  "body": "“The amount of shit” is a couple of mouse clicks over the course of a half hour, and it saves potential thousands of dollars. I have a 3DS loaded up with hundreds of games, most of which are either unavailable for purchase digitally or insanely expensive physically. Have fun paying $120 for Mario Kart tho",
                                  "score": 1,
                                  "created_utc": 1746672700.0,
                                  "replies": [
                                    {
                                      "id": "mrahubl",
                                      "author": "Oops_I_Cracked",
                                      "body": "Right? To get the last game I pirated working the process was: \n\n1. Visit website\n\n2. Find game I wanted\n\n3. Click download\n\n4. Launch game\n\nHow is that “so much shit”? It is genuinely no more difficult (and honestly sometimes easier) than getting a legitimately purchased game running on my PC.",
                                      "score": 1,
                                      "created_utc": 1746729878.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr9ex7g",
                  "author": "homer_3",
                  "body": "> the performance is so much better\n\nIt's not though. Like at all. Performance is significantly worse in Yuzu/Ryujinx.",
                  "score": 0,
                  "created_utc": 1746718585.0,
                  "replies": [
                    {
                      "id": "mr9jk6v",
                      "author": "alxrenaud",
                      "body": "I am sorry it is not for you. Playing in 4k60 for most titles (even if it is just upscaling) instead of 720/900p @ 30ish fps is a major upgrade for me.",
                      "score": 1,
                      "created_utc": 1746719920.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr4wabc",
              "author": "Jamie00003",
              "body": "Any idea if there’s value in mine? It’s on the latest firmware but it’s a launch day switch",
              "score": 4,
              "created_utc": 1746652198.0,
              "replies": [
                {
                  "id": "mr5feb6",
                  "author": "shavin_high",
                  "body": "its probably good. check this site\n\nhttps://switchway.net/check-your-switch/",
                  "score": 5,
                  "created_utc": 1746658326.0,
                  "replies": [
                    {
                      "id": "muudedj",
                      "author": "nsfdrag",
                      "body": "Useful!",
                      "score": 2,
                      "created_utc": 1748502808.0,
                      "replies": []
                    },
                    {
                      "id": "mr5prpb",
                      "author": "Jamie00003",
                      "body": "Ah nice thank you",
                      "score": 1,
                      "created_utc": 1746661841.0,
                      "replies": []
                    },
                    {
                      "id": "mr6asrl",
                      "author": "cjcs",
                      "body": "Dang. Had high hopes because I had an HAC-001, but it’s refurbished so almost certainly patched 😢",
                      "score": 1,
                      "created_utc": 1746669132.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mwd1v3z",
                  "author": "hellowiththepudding",
                  "body": "Value? No. You won’t get a premium when selling it. If you want to hack it there is value in that.",
                  "score": 1,
                  "created_utc": 1749235105.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr5u4iy",
              "author": "AlexHimself",
              "body": "I just ordered a switch 2 and I've never owned a switch one. What can you do with an exploit?",
              "score": 3,
              "created_utc": 1746663385.0,
              "replies": [
                {
                  "id": "mr6614t",
                  "author": "jackerypigeon",
                  "body": "The original switch shipped with a hardware vulnerability, accessed by shorting two pins on the joycon rail, that allowed you to load custom firmware, homebrew, games etc. Later hardware revisions fixed the vulnerability but could be modded with a hardware modchip to boot similar software. My launch switch is still going strong, custom firmware and all! Hoping for a similar exploit for the new one but wouldn't hold my breath haha",
                  "score": 13,
                  "created_utc": 1746667538.0,
                  "replies": [
                    {
                      "id": "mr6fb4g",
                      "author": "AlexHimself",
                      "body": "Ah so you could bootleg games if you wanted to. And other things of course but that makes sense.",
                      "score": 8,
                      "created_utc": 1746670719.0,
                      "replies": []
                    },
                    {
                      "id": "mriqvlu",
                      "author": "CatProgrammer",
                      "body": "> accessed by shorting two pins on the joycon rail\n\n\nThis is as silly and even easier than the PSP battery exploit, what the fuck. ",
                      "score": 2,
                      "created_utc": 1746841305.0,
                      "replies": [
                        {
                          "id": "mwdiwj4",
                          "author": "Kylemsguy",
                          "body": "This is different from the PSP trick. That was how Sony implemented a way to reimage the console for repairs.\n\nThis was a leftover of when the Tegra X1 was being used in Android devices. The low level recovery mode (APX) was triggered by holding two buttons (probably volume up/down and home), and one of the buttons lived on the joy con rail.\n\nI have no idea why they felt the need to do that. Perhaps they had a debug jig that plugged in to the joy con rails for debugging.",
                          "score": 1,
                          "created_utc": 1749240267.0,
                          "replies": [
                            {
                              "id": "mwehcsc",
                              "author": "CatProgrammer",
                              "body": "> The low level recovery mode (APX) was triggered by holding two buttons (probably volume up/down and home)\n\n\nThat seems way too easy to accidentally do. A bunch of phones still use volume button+power button for screenshot even.",
                              "score": 1,
                              "created_utc": 1749251520.0,
                              "replies": [
                                {
                                  "id": "mwfgv8c",
                                  "author": "Kylemsguy",
                                  "body": "This button combination only triggers this mode on boot up. A lot of Android and iOS devices have used these combinations to boot into recovery modes",
                                  "score": 1,
                                  "created_utc": 1749264794.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr6jrrp",
                      "author": "Eurynom0s",
                      "body": "I never bothered with my launch Switch but may take a whack at it once my Switch 2 arrives.",
                      "score": 1,
                      "created_utc": 1746672380.0,
                      "replies": [
                        {
                          "id": "mr6nlar",
                          "author": "jackerypigeon",
                          "body": "No evidence that anything similar will be possible on the Switch 2 yet, although talented hackers will soon find out!",
                          "score": 2,
                          "created_utc": 1746673888.0,
                          "replies": [
                            {
                              "id": "mr6oc4y",
                              "author": "Eurynom0s",
                              "body": "I meant that I'll be more willing to fuck around with modding my OG Switch once I have the Switch 2.",
                              "score": 8,
                              "created_utc": 1746674193.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr7xp6h",
              "author": "jacobpederson",
              "body": "Still using my day 1 switch exploit :D",
              "score": 1,
              "created_utc": 1746699326.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr6de5x",
          "author": "Mehhish",
          "body": "This! I only bought a Switch 1 because of the exploit. The moment I heard the Switch got hacked, was the moment I bought one.",
          "score": 5,
          "created_utc": 1746670035.0,
          "replies": []
        },
        {
          "id": "mr5l6ie",
          "author": "Fredasa",
          "body": "Hopefully they find it sometime in the next year, so the emulator can be ready for when From's game drops.\n\nI'm certainly not champing at the bit for an almost-PS4-looking _Mario Kart_ that continues the **20 year tradition** of failing to hit 60fps in its \"party mode\" (four player split-screen).",
          "score": 11,
          "created_utc": 1746660294.0,
          "replies": [
            {
              "id": "mr6dme9",
              "author": "DuckDatum",
              "body": "Can you help me understand this? What are we saying, that there’s a high probability of there being an exploitable hardware vulnerability to install your own firmware—like with the switch1?\n\nWhat about the hardware being used would give away the idea that there’s a high probability of that happening?",
              "score": 1,
              "created_utc": 1746670114.0,
              "replies": [
                {
                  "id": "mr6iky3",
                  "author": "Fredasa",
                  "body": "Hmm.\n\nIt's less about the hardware being likely to have an obvious vulnerability and more about the extreme desirability and therefore impetus for hackers to find a way.  Due to:\n\n* A portable console being inherently more useful to own in an unlocked capacity than typical consoles.\n* Nintendo's properties being platform exclusive.\n* Nintendo re-entering—or more accurately *catching up to*—the core gamer market _willy nilly,_ not because the Switch 2 represents an unexpected leap in power (not hardly) but more because core _console_ gaming has been slowing down gen by gen until we've reached the point where From Software is willing to develop a AAA game for Nintendo.\n* That all said, the Switch 2 _is_ roughly on par with a Steamdeck while having a larger and higher resolution screen.  That makes it a _de facto_ choice for emulators and the like.\n* Speaking of From Software, their next Souls-like game is going to be exclusive to the Switch 2.  Come hell or high water, somebody _is_ going to do something about that.\n\nI'd rather not pretend that the combined genius of the hacking community is no match for a hardware market that has a history of being caught with their pants down.",
                  "score": 3,
                  "created_utc": 1746671926.0,
                  "replies": [
                    {
                      "id": "mr7bd38",
                      "author": "DuckDatum",
                      "body": "Yeah, no argument against that—where there’s a will, there’s a way… and there’s a whole lot of will, no doubt.\n\nI’m just wondering why then there’d be a priority for the first generation of devices. I guess, so that you can get a modded system as soon as possible, makes sense. I didn’t understand what was changing between these generations and why I’m noticing this prioritization. \n\nIs there less will to mod the models that come after initial patches? Like, fewer people are working on it overall because there’s now the option of just going on eBay to find a vulnerable model?",
                      "score": 1,
                      "created_utc": 1746685503.0,
                      "replies": [
                        {
                          "id": "mr8ki25",
                          "author": "uzishan",
                          "body": "first generation usually tends to have these exploits. a lot of them can be fixed simply by sw and/or firmware updates and in some cases even hw revisions fix these exploits?",
                          "score": 2,
                          "created_utc": 1746709159.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr8ke1l",
                      "author": "uzishan",
                      "body": "By all metrics Switch 2 is noticeably above Steamdeck, and that's the steamdeck oled. 120hz screen, hdr, 1080p, a chipset that's less power hungry while delivering slightly better handheld performance than the steamdeck, battery life(advertised at least) and way better size while also benefiting from games that will be optimized like crazy exclusively for it? and with a more user friendly interface/accesibility.",
                      "score": 0,
                      "created_utc": 1746709119.0,
                      "replies": [
                        {
                          "id": "mr91474",
                          "author": "Fredasa",
                          "body": "When I brought up the comparison to the Steamdeck—and I promise I was not attempting to be ambiguous about this—I was offering its value as an alternative to said device, i.e. in what capacity it could potentially fulfill one of the Steamdeck's most popular functions.  I was not, repeat, not trying to step on somebody's toes.",
                          "score": 1,
                          "created_utc": 1746714528.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr697ev",
              "author": "SupremeDictatorPaul",
              "body": "I’ll get it, but as the release title game it’s pretty underwhelming. I know they just released Tears of the Kingdom like a year ago, and a few Mario and Kirby games relatively recently, but I’m really surprised they don’t have a Zelda or Mario game ready for launch. \n\nI suspect they had all of the timelines set to release the games and Switch 2 a year or two ago, and COVID screwed up the hardware timeline. But it still feels disappointing. I have to pay $20 to make Total look a little nicer on Switch 2? Really?",
              "score": 1,
              "created_utc": 1746668583.0,
              "replies": [
                {
                  "id": "mr6h1jn",
                  "author": "AnRealDinosaur",
                  "body": "Yeah very underwhelming. Don't get me wrong I like playing Mario kart (I am human after all) but not enough to pay more than say $30 for it. (Not saying that's the value of the dev's work, just that it's not a franchise I'm super into.) I did order a switch 2, but only because I'm worried about US pricing and availability and because I know there will eventually be new Zelda, 3d Mario, and Pokémon games I'll want to play. I'm not into any of the launch titles except the DK one. That looks incredible but I'm balking at the price for now. I also have zero interest in physical releases that require downloads so I guess we'll see how that develops. I'll just buy the game from the e-shop if a \"game key\" is the only physical option.",
                  "score": 2,
                  "created_utc": 1746671356.0,
                  "replies": [
                    {
                      "id": "mr6xnhp",
                      "author": "SupremeDictatorPaul",
                      "body": "In general, I only buy digital games, and I only buy those using gift cards from Costco that I bought at 10-20% off. And I typically only buy the games if they’re already on sale. \n\nHonestly, I have no idea who is buying these games at $70. Those prices are ridiculous.",
                      "score": 3,
                      "created_utc": 1746678230.0,
                      "replies": [
                        {
                          "id": "mr8jlpl",
                          "author": "uzishan",
                          "body": "A lot of people. Games are behind in having prices updated for the inflation of the last 15 years. It's all about the value each sees. Like, is that game gonna bring me x hours of enjoyment? yes? okay, I'll get it.\n\ne.g. for me Mario Kart 8 ended up bringing \\~300h of entertainment for 60euros. That's 300 goddamn hours for something that costs as much as 2 nights of partying. And in general, if it's a game I judge can bring me at least 20h of actual enjoyment for 60euros then it's a steal. 70 euros? at least 35h and 80euros at least 50 hours and some digital extra goodies.\n\nGranted, for nintendo games, except for Mario Kart 8, I never paid more than 50euros per game because I had NSO and I'd always get that 100eur eur for 2 tickets to redeem 2 nintendo exclusives.",
                          "score": 2,
                          "created_utc": 1746708839.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr6jxom",
                  "author": "Eurynom0s",
                  "body": "I dunno if Switch 2 was impacted by COVID, but Switch OLED was almost certainly supposed to be a Switch Pro and not just a Switch with a better screen before COVID hit.",
                  "score": 2,
                  "created_utc": 1746672443.0,
                  "replies": []
                },
                {
                  "id": "mr8inxr",
                  "author": "uzishan",
                  "body": "Nah, thje underwhelming release is intentional to minimize chances of rush & scalping and bet instead on announcing later some games to be released in time for winter holidays and max out the sales then.",
                  "score": 1,
                  "created_utc": 1746708501.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr5xx22",
          "author": "Racxie",
          "body": "This was the main reason I wanted a day one Switch 2, but then remembered that I barely touch my Switch I’ve had since day one despite it being capable of the same thing. Not to mention that games like Metroid Prime will still be playable on Switch.\n  \nSwitch 2 will be the first Nintendo console I won’t have bought on day one since the GameCube, and possibly the first Nintendo console I may not even end up buying at all.",
          "score": 1,
          "created_utc": 1746664729.0,
          "replies": [
            {
              "id": "mr8y3es",
              "author": "Droidlivesmatter",
              "body": "Oddly enough.. the moment I had a console I could pirate games on, I never got around to playing it. \nI felt like if I spent money on the game i had more of a reason to play it, because \"oh I can put the free games off eventually\" and eventually never comes.",
              "score": 1,
              "created_utc": 1746713623.0,
              "replies": [
                {
                  "id": "mr9fp2e",
                  "author": "Racxie",
                  "body": "Yeah, I like the “fun” of just modding stuff more, but either way I have way too much of a backlog of paid games to even think about playing games for “free”.",
                  "score": 1,
                  "created_utc": 1746718809.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr62wv4",
          "author": "TreeToTea",
          "body": "What’s that?",
          "score": 1,
          "created_utc": 1746666475.0,
          "replies": [
            {
              "id": "mr6c1s3",
              "author": "GeT_Tilted",
              "body": "Software exploits to install custom firmware for homebrew apps and piracy.",
              "score": 2,
              "created_utc": 1746669564.0,
              "replies": [
                {
                  "id": "mr7nqdz",
                  "author": "HisaAnt",
                  "body": "Damn, when has r/gadgets become r/piracy. People here begging for a way to pirate Switch 2 games day one is just quite pathetic to see.",
                  "score": -2,
                  "created_utc": 1746693178.0,
                  "replies": [
                    {
                      "id": "mr7qra4",
                      "author": "dumbledayum",
                      "body": "Better than 90$ Price tags. And better for game preservation. Otherwise another company like Bungie would say “They don’t have that build anymore”\n\nI don’t condone this, I have a Playstation so I don’t have any other way to get games other than from the official store. But this gives more power to people",
                      "score": 6,
                      "created_utc": 1746695112.0,
                      "replies": []
                    },
                    {
                      "id": "mvbv5w4",
                      "author": "rW0HgFyxoJhYka",
                      "body": "Its a online forum. Nobody cares. Gadgets are about gadgets and how to get the most out of them.",
                      "score": 1,
                      "created_utc": 1748734738.0,
                      "replies": []
                    },
                    {
                      "id": "mr7v6an",
                      "author": "jamesick",
                      "body": "weird take",
                      "score": 0,
                      "created_utc": 1746697871.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr7q60z",
          "author": "Popular_Mastodon6815",
          "body": "Hard to say because it will come with Denuvo (rumored). Which means if the hardware is modified it might not let it run any games. Will either be extremely easy for an exploit or will take a few years.",
          "score": 1,
          "created_utc": 1746694732.0,
          "replies": []
        },
        {
          "id": "mrkvtea",
          "author": "rathlord",
          "body": "Unfortunately Nintendo will be intentionally trying to permanently brick consoles for people who try to crack/exploit. \n\nDoesn’t mean it won’t be possible, just means it’s more risky (and you inherently are supporting this new policy by buying one). \n\nI’ve decided I’m happy with my Steam Deck and done supporting Nintendo. I loved our Switches (bought two- one to crack and one to keep legit permanently), but between their new pricing for games and the constant doubling down on shitty, anti-consumer practices I’m just don’t with them. I don’t need their games that bad.",
          "score": 1,
          "created_utc": 1746880698.0,
          "replies": [
            {
              "id": "mrmnjxa",
              "author": "francescomagn02",
              "body": "I'm not saying you should not be worried but such a system would need to be extremely lenient to avoid false positives, the homebrew scene is already familiar with blocking any telemetry data about the console's state being sent to nintendo and i doubt they would go further than that",
              "score": 0,
              "created_utc": 1746902375.0,
              "replies": [
                {
                  "id": "mrmrfqj",
                  "author": "rathlord",
                  "body": "They made active changes to their terms to explicitly state they would be trying to do just that, so I don’t think the worry is unfounded. I cracked my old switch and am familiar with the DNS changes and stuff to avoid account bans, but that’s a big difference between an account issue and an actually bricked device. \n\nGranted in most cases blocking network access might work, but they could also build checks into the firmware to brick the device without communications (which is the major difference between this and their old account-based punitive system). \n\nThis would likely impact the people on the forefront of testing cracks and exploits the most, with the majority of users waiting for presumed safe methods, but that ultimately still isn’t an argument for supporting Nintendo or writing off how seriously anti-consumer intentionally bricking people’s owned devices is.",
                  "score": 1,
                  "created_utc": 1746903702.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mrnag7c",
          "author": "TM34SWAG",
          "body": "Don't know how enforceable this will be but Nintendo is claiming it will turn every hacked/jailbroken/exploited (whatever you want to call it) device into a $450 brick.\n\nBuyer be warned that you might spend a lot of money on something that exploits completely break.",
          "score": 1,
          "created_utc": 1746910251.0,
          "replies": []
        },
        {
          "id": "mr6lzpi",
          "author": "InevitableBudget4868",
          "body": "Only reason I preordered. Day 1 switch, played every game I ever wanted for free. Best ROI imaginable",
          "score": 1,
          "created_utc": 1746673243.0,
          "replies": []
        },
        {
          "id": "mr7w7et",
          "author": "right_there",
          "body": "This is the only thing that would get me to buy one of these things. My day one Switch sat unopened for nine months until a doable custom firmware was ready. Played every Switch game I ever wanted to play (most before their release dates!) and never paid Nintendo a single cent other than for the console.\n\nI don't feel bad at all considering how scummy and anti-consumer Nintendo is. Fuck em.",
          "score": 0,
          "created_utc": 1746698474.0,
          "replies": []
        },
        {
          "id": "mr4iv7d",
          "author": "Draxden",
          "body": "Same brother, same",
          "score": -1,
          "created_utc": 1746648412.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr694lu",
      "author": "GhostNappa101",
      "body": "Now put it into a new Nvidia shield",
      "score": 54,
      "created_utc": 1746668556.0,
      "replies": [
        {
          "id": "mr72vn5",
          "author": "Placed-ByThe-Gideons",
          "body": "Please! \n\nMy shield: I'm tired boss",
          "score": 9,
          "created_utc": 1746680811.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5exmz",
      "author": "boner79",
      "body": "I am Jack's complete lack of surprise.  Nintendo hasn't released a console with latest and greatest HW specs for over 20 years (since Gamecube 2001 release).",
      "score": 70,
      "created_utc": 1746658168.0,
      "replies": [
        {
          "id": "mr7ljhw",
          "author": "BananLarsi",
          "body": "Hell, people said the same about the WII, and constantly shit on the fact that it didn’t even have HDMI. \n\nThe Wii sold over 100 million units.",
          "score": 24,
          "created_utc": 1746691755.0,
          "replies": [
            {
              "id": "mr80gun",
              "author": "fmaz008",
              "body": "- No HDMI?\n- nop!\n- Because it's cheaper?\n- No, because we can sell an additional adapter!\n- So we same a but on the manufacturing\n- And make money with mandatory adapters!\n\n... idk if Nintendo sold theirnown adapter. I just had my mind go wild for a sec... don't mind me...",
              "score": 2,
              "created_utc": 1746700813.0,
              "replies": [
                {
                  "id": "mr82ob9",
                  "author": "BananLarsi",
                  "body": "Everything came in the box. And they had no first party video adapter. \n\nThe point is people have said the same thing about Nintendo for YEARS, when in reality Nintendo has done it this way since before the Wii. \n\nThe Nintendo DS had way worse specs than the PSP. The DS sold 155 million copies, the psp sold 80 million. \n\nThe Wii had worse specs than the Xbox 360and PlayStation 3. it still outsold them. \n\nWhen the Wii U tanked due to horrible marketing, the 3DS still had worse specs than the PSVITA. The 3ds sold 75 million and the vita sold 10-15 million. \n\nNintendo consistently does great with worse hardware.",
                  "score": 13,
                  "created_utc": 1746701894.0,
                  "replies": [
                    {
                      "id": "mr84hm5",
                      "author": "fmaz008",
                      "body": "Nintendo offers unique game IPs that lots of people like. Just take all the Marios: they don't require fancy graphics power, so nintendo gets away with it.\n\nMost games on (from) Nintendo don't aim to be realistic to begin with.\n\nBut I would expect the console price to be lower if it has older/not great hardware.",
                      "score": 3,
                      "created_utc": 1746702746.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr8lh9y",
          "author": "uzishan",
          "body": "Gamecube was the superior high end console when it released. but 2 significantly inferior consoles outsold it because they were multimedia devices as well (Xbox & Playstation 2), resulting in a high end expensive console that was barely sold (because let's be honest, most of PS2 sales were because it was a great cheap dvd player, not a great console). N64 was also quite unlucky despite being a beast. And with that nintendo said F it and decided to go for quirky and something for everyone.\n\n  \nSteamdeck released in 2022 and switch still kept selling more even after that. (e.g. Steamdecks are approximately 4 million sold since launch. Switch sold 15.7 million units only between April 2023 and March 2024)",
          "score": 5,
          "created_utc": 1746709505.0,
          "replies": [
            {
              "id": "mrxbg4n",
              "author": "Oriolesguy",
              "body": "No. PS2 is the greatest selling console because it had the greatest library of video games ever created. No one gave a shit about the fact that it could play DVDs.\n\nDon't confuse the PS2 being a DVD player for homes because DVD players were half the price (and cheaper) of a PS2. No one was buying them specifically for playing DVDs. Versus the PS3 being used as a Blu-Ray player because even at $700, it was cheaper than any Blu-Ray player on the market (opening retail was a minimum $1,000) at the time.",
              "score": 1,
              "created_utc": 1747062757.0,
              "replies": [
                {
                  "id": "mrxbymp",
                  "author": "uzishan",
                  "body": "Except it was because of the super cheap dvd player status. It was a strong marketing focus and back then it didn't even have the cult following backed by a strong library, it had strong sales while it had the weakest library on the market and there are documentaries on the matter and people that worked on it that confirmed the cheap dvd player status.\n\nEdit: bonus points, blu ray never hit as high as dvd and 700eur/$ was still a massively high price.",
                  "score": 1,
                  "created_utc": 1747062910.0,
                  "replies": []
                },
                {
                  "id": "n1lhhqf",
                  "author": "pichukirby",
                  "body": ">No one gave a shit about the fact that it could play DVDs.\n\nThat's just as ridiculous as claiming the DVDs were the only reason. The truth is, both the library and the DVD capabilities significantly impacted the success of the PS2",
                  "score": 1,
                  "created_utc": 1751784660.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr3ieey",
      "author": "Vitss",
      "body": "The number of CUDA cores is a tad lower than what I anticipated. I was hoping for something closer to an RTX 3050M, but this configuration falls about 30% short even compared to the weakest mobile Ampere variant. It makes you wonder how long hardware like this can realistically keep up, even with upscaling.",
      "score": 379,
      "created_utc": 1746637932.0,
      "replies": [
        {
          "id": "mr3q4oe",
          "author": "m0rogfar",
          "body": "The Switch 1 fell around 70% short of the 50-series Maxwell cards when it launched in 2017, so being only 30% short of a 50-series card is actually a huge improvement, even adjusted for time of release.\n\nThat’s even before considering that the 50 series has moved substantially upmarket due to better integrated graphics and therefore costs far more than it did in the Maxwell days. The Switch 2 also has much better cooling when docked than the Switch 1 did.\n\nPoint being that while the Switch 2 is absolutely not going to be setting console speed records, it’s less behind than the Switch 1 was, and by a fairly wide margin too.",
          "score": 212,
          "created_utc": 1746640114.0,
          "replies": [
            {
              "id": "mr3ueq4",
              "author": "Hattix",
              "body": "It's not *just* 70% short of the GM107/GM207. The Switch, as the Tegra X1 (TM670D), also used a different flavour of Maxwell. Maxwell-lite if you will.\n\nIt has two SMs built as normal, with their 128 CUDA cores, but then a crappy little 256 kB L2 cache. Not only that, but the L1 cache was also only 2x 12 kB per SM (as \"SM sub-partitions\"), down from 2x 24 kB. Shared memory store is down from 96 kB to 64 kB.\n\nInterconnect was also wimpy, data from each SM could only travel at 64 bytes per clock out to the L2. With only one L2 partition, that's a peak bandwidth of around 46 GB/s. No, not TB/s. Slower than main memory on nearly all of the GTX 900 series.\n\nIt was the smallest, lightest, and weakest thing which could legitimately call itself \"Maxwell\". Due to the paired-GPC architecture, Maxwell couldn't actually go below two SMs and here, yeah, it was two SMs.",
              "score": 101,
              "created_utc": 1746641317.0,
              "replies": [
                {
                  "id": "mr4pfkm",
                  "author": "Onceforlife",
                  "body": "So switch 2 in comparison is not the weakest but still pretty week",
                  "score": 11,
                  "created_utc": 1746650268.0,
                  "replies": [
                    {
                      "id": "mr54w9f",
                      "author": "Hattix",
                      "body": "You can scale a machine by how much power it uses to a quite reasonable degree of accuracy, especially within the same architecture. There's no magic pixie dust to get massive performance out of less power.\n\nAs we know Switch 2 uses Ampere on an 8nm-class node (Nvidia doesn't transition architectures between nodes as a rule, but maybe it did) and it's based on T239, which has 1536 CUDA cores, we know straight away it's inferior to the almost unlovable RTX 2050 (taking the second testicle off the RTX 3050).\n\nWe don't know clocks, but we know they're not going to be high. Low power Ampere was around 1,300 MHz (Tegra T194, which had more cores). It'll probably have 6 GPCs with 2 SMs each. Memory performance will likely be utterly awful, because that's the nature of LPDDR.\n\nRaw specs, it's going to be around 4 TFLOPS FP32, 8 TFLOPS FP16, and 110 GB/s RAM.\n\n**By handheld standards** it's about double a Steam Deck. We also have Nvidia's reputation here: Nvidia has a very bad reputation in small SoCs. Tegra became such an insult that Nvidia all-but bandoned the brand. It never seemingly recovered after the failure of Project Denver (and the firing of the entire SoC team...) and made few mass-market inroads since, the Switch being one notable exception (and still dogged by very poor GPU performance).",
                      "score": 40,
                      "created_utc": 1746654824.0,
                      "replies": [
                        {
                          "id": "mr5vcak",
                          "author": "DeathKringle",
                          "body": "If it’s double a steam deck they can do a lot considering the performance of a steam deck and how it plays a lot of games.",
                          "score": 16,
                          "created_utc": 1746663822.0,
                          "replies": [
                            {
                              "id": "mr6i4l7",
                              "author": "AnRealDinosaur",
                              "body": "Yeah as a huge fan of the deck, a portable console with twice the power sound pretty sick. Switch 2 looks a lot better when you think of it like a handheld. The steam deck is around $500 as well. I know it's not tied to one developer and you have access to all the stupid cheap steam sales, but the device itself is priced similarly.",
                              "score": 12,
                              "created_utc": 1746671757.0,
                              "replies": [
                                {
                                  "id": "mr6q95j",
                                  "author": "feartheoldblood90",
                                  "body": ">Switch 2 looks a lot better when you think of it like a handheld.\n\nAlmost like it's a handheld\n\n(Not aimed at you, but rather the general discourse around this)",
                                  "score": 5,
                                  "created_utc": 1746674974.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mr6e1dn",
                              "author": "CosmicCreeperz",
                              "body": "Especially if it has a more reasonable battery life on higher end 3D games.",
                              "score": 2,
                              "created_utc": 1746670261.0,
                              "replies": []
                            },
                            {
                              "id": "mrdxwva",
                              "author": "spong_miester",
                              "body": "Is this more because of the ability to tweak a games video settings than actual hardware performance?",
                              "score": 1,
                              "created_utc": 1746778845.0,
                              "replies": [
                                {
                                  "id": "mrf688q",
                                  "author": "DeathKringle",
                                  "body": "Raw performance is hardware through and through , and drivers. \n\n\nBut game performance????\n\nOptimization for a given resolution, display, and known hardware. \n\n\nSo if the steam deck can play a variety of games, with different styles, standards etc. \n\nThen it stands to reason that if the switch 2 is 2x as powerful a steam deck. And knowing Nintendo has rules and formatting to sort of streamline things with uniformity.  Then it stands to reason the games likely can be around the steam decks fps rate while having more features enabled and higher res. \n\nRaw tflops ain’t everything tho so we shall see. But it’s a good sign that they can do a lot. \n\nThe steam deck impressed a lot of people with its meager hw",
                                  "score": 1,
                                  "created_utc": 1746799377.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr6dty5",
                          "author": "CosmicCreeperz",
                          "body": "Note Switch sold 150M units.  With that precedent, that is plenty enough to keep a product line going.  Plenty for a new custom SoC, or even a process shrink to reduce costs and power consumption…",
                          "score": 2,
                          "created_utc": 1746670188.0,
                          "replies": [
                            {
                              "id": "mraurb0",
                              "author": "poofyhairguy",
                              "body": "Nintendo is going to save that process shrink for a midlife fanless model just like it did with the Switch Lite.",
                              "score": 1,
                              "created_utc": 1746733715.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr6oi6a",
                          "author": "zzazzzz",
                          "body": "double the steamdeck with nvidia software stack is still market leading performance on a handheld. the real question is cpu performance imo.",
                          "score": 5,
                          "created_utc": 1746674259.0,
                          "replies": []
                        },
                        {
                          "id": "mr8mxy9",
                          "author": "bryf50",
                          "body": "I expect the clocks in handheld mode will be really low. Like a few 100mhz. That will probably be where it loses ground to the steam deck. Because the steam deck despite its age is on a superior process node",
                          "score": 1,
                          "created_utc": 1746710016.0,
                          "replies": []
                        },
                        {
                          "id": "mr6dttf",
                          "author": "SupremeDictatorPaul",
                          "body": "The unfortunate bit is that I don’t care about the mobile aspect at all. I only use my Switch docked to a big TV so I can use a decent large controller. I’d happy buy a non-mobile Switch 2 without a screen/battery/dock, that instead had 4x the processing power. Heck, I’d pay a few hundred extra for a “dock” with built in powerful GPU. \n\nInstead, as you point out, the performance is heavily constrained to what you could play walking around.",
                          "score": -2,
                          "created_utc": 1746670186.0,
                          "replies": [
                            {
                              "id": "mrav929",
                              "author": "poofyhairguy",
                              "body": "Nintendo’s stats shows that for the Switch 1 only 20% of players played it primarily in docked mode. Most used it hybrid, but even the handheld exclusive user base was larger (30%).\n\nYou are outnumbered on this one.",
                              "score": 1,
                              "created_utc": 1746733856.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr3y8h8",
              "author": "HiddenoO",
              "body": "That's not a fair comparison though since the 3050M is four years old when the Switch 2 is released whereas the 950M was only two years old when the Switch 1 was released. It's effectively a full generation older.\n\nUltimately, the only thing that matters is how it compares to current-gen GPUs at the point of release, not how it compares to the generation the chip is based on.",
              "score": 38,
              "created_utc": 1746642415.0,
              "replies": [
                {
                  "id": "mr44smx",
                  "author": "m0rogfar",
                  "body": "Maxwell was more than three years old when the Switch released. It was not a new architecture, and it arguably aged worse, as Pascal was a bigger leap than Lovelace/Blackwell.",
                  "score": 17,
                  "created_utc": 1746644306.0,
                  "replies": [
                    {
                      "id": "mr4wwzw",
                      "author": "Cutebrute",
                      "body": "Pascal was not very different from proper Maxwell, architecturally. The general CUDA structure/layout was very similar to Maxwell. \n\nThe Pascal generation was a big generational uplift because of the manufacturing change to 16nm finfet process. That was one of the greatest single node jumps in recent history which carried that generation in terms of power and efficiency. \n\nBlackwell is on the same manufacturing process as Lovelace and the general architecture is pretty mature at this point so the improvements are  minor and targeted to specific use cases. Nvidia has to move from 4nm to 2-3nm manufacturing to get much more power at this point. ",
                      "score": 9,
                      "created_utc": 1746652381.0,
                      "replies": [
                        {
                          "id": "mr66468",
                          "author": "SilverBackGuerilla",
                          "body": "You guys are nerds.",
                          "score": -9,
                          "created_utc": 1746667563.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr74hi8",
                      "author": "HiddenoO",
                      "body": "The code name (G20) only started with the 900 series, and the process size (20nm) was even smaller than that used for the 900 series. Just because an architecture existed by name doesn't mean much.\n\nThat's why I'm saying the real comparison should be to current-gen GPUs at similar price points, not arbitrary previous-gen GPUs that might share die similarities.\n\nIf you buy a Switch 2 now, you care about how well it performs compared to other options on the market now, and how it will in another N years time. Nobody gives a crap how it compares to some arbitrary mobile GPU from a few years ago.",
                      "score": 1,
                      "created_utc": 1746681662.0,
                      "replies": []
                    },
                    {
                      "id": "mrc95x1",
                      "author": "rnw10va",
                      "body": "The Switch 1's hardware being old when the console released doesn't mean you can change what it is compared to. If the Switch 2 used a 5 year old GPU we shouldn't compare it to 2020 GPUs. The competitors to a product is what alternatives exist during it's approximate life cycle.\n\nThe Switch came out in 2017, so you should compare it to 2017 GPUs. The Switch 2 is releasing in 2025, so you compare it to 2025 GPUs.\n\nSorry if I'm misunderstanding what you're saying. To me it sounds as though you're giving Nintendo a pass on performance issues on the Switch 1 because they used old hardware inside of their new hardware launch.",
                      "score": 1,
                      "created_utc": 1746750361.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr601kz",
                  "author": "eestionreddit",
                  "body": "Isn't the switch derived from 750/750Ti Maxwell rather than GTX 900 Maxwell?",
                  "score": 1,
                  "created_utc": 1746665469.0,
                  "replies": [
                    {
                      "id": "mr746wz",
                      "author": "HiddenoO",
                      "body": "The code name is G20B with G20 only appearing with the 900 series, and the process is 20nm which is in between the 900 series and 10 series for the most part. The process alone is one of the largest factors in GPU performance (per watt) in recent generations.\n\nUltimately, none of that matters, though; what matters is how it compares to other commercially available GPUs at the time of its release. You could make a great GPU based on Amper and you could make a terrible GPU based on Blackwell.",
                      "score": 1,
                      "created_utc": 1746681505.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr46fa7",
              "author": "Lord_Silverkey",
              "body": ">The Switch 1 fell around 70% short of the 50-series Maxwell cards when it launched in 2017, so being only 30% short of a 50-series card is actually a huge improvement, even adjusted for time of release.\n\nIf your numbers are correct, that's still 70% short of **three** year old card architecture vs. 30% short of **five** year old card architecture.\n\nThat's not apples to apples, and not confidence inspiring to me.",
              "score": 30,
              "created_utc": 1746644781.0,
              "replies": [
                {
                  "id": "mr4af0p",
                  "author": "thelastsupper316",
                  "body": "Ada to Blackwell wasn't much of a jump.",
                  "score": 9,
                  "created_utc": 1746645954.0,
                  "replies": [
                    {
                      "id": "mr57dqu",
                      "author": "AtomicSymphonic_2nd",
                      "body": "… much to the disappointment of high-end hardware nerds and PC gaming influencers everywhere. 🫤",
                      "score": 3,
                      "created_utc": 1746655622.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr617b9",
                  "author": "SpeedflyChris",
                  "body": "Okay, but in those days Nvidia was still giving actual performance gains generation to generation.",
                  "score": 1,
                  "created_utc": 1746665879.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr5tgyq",
              "author": "thatsnotmiketyson",
              "body": "I assure you that though the price of the 50 tier has moved upmarket, the performance has not.",
              "score": 4,
              "created_utc": 1746663148.0,
              "replies": [
                {
                  "id": "mr6mcab",
                  "author": "m0rogfar",
                  "body": "It kinda has though?\n\nThe Maxwell -> Ampere multigenerational jump generally came with an approximately 2x improvement in price/performance across the board, if you compare GPUs with the same launch MSRP. The 50 series Ampere cards are around 3x faster than the late Maxwell 50 series cards though, so there’s a much bigger performance uplift than what you’d expect from the generational improvements to go with the higher price.",
                  "score": -1,
                  "created_utc": 1746673382.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msuqxhp",
              "author": "raycert07",
              "body": "Let's not glaze 50 series, or 40 series, or even 30 series low end because they barely even jump performance from generation to generation at the low end.",
              "score": 1,
              "created_utc": 1747515799.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr46mgw",
          "author": "nguyenm",
          "body": "Thing is, it's actually fine if and only if the same or upgraded 720p OLED screen was used. Native 720p on a handheld have extremely high chances to beat upscaled 1080p at typical use cases. \n\nCoincidentally, DLSS Quality uses 720p as it's base resolution at 1080p output and DLSS Ultra-Performance (meant for 8K, also introduced at Ampere) also uses 720p for a 2160p/4k output. So if regular Nintendo users aren't sick of the sub-standard image quality the OG Switch offers when docked, get used to be treated with temporally accumulated eye-candy rather than just integer scaling.",
          "score": 14,
          "created_utc": 1746644840.0,
          "replies": [
            {
              "id": "mr5ckbv",
              "author": "alman12345",
              "body": "Upscaling (even at 1080p) has been completely changed with DLSS Transformer, where before people could say it was give and take between native and upscaled the new version of DLSS looks better than native pretty much across the board and they even extrapolate data that doesn’t exist (which some have observed as DLSS appearing to clean textures up to a higher setting than they’re at natively). Not running DLSS when transformer is available is honestly a mistake at this point, if I were Nintendo I would run DLSS on quality even at 720p to get either better battery life relative to the performance or more frames per second at the reduced handheld clock speeds (or some combination thereof). Having DLSS in a handheld will be the actual game changer for the switch 2 relative to other handhelds, AMD hasn’t even managed to squeeze their hardware upscaling into their latest handheld APUs.",
              "score": 8,
              "created_utc": 1746657357.0,
              "replies": [
                {
                  "id": "mr6pc3a",
                  "author": "zzazzzz",
                  "body": "dlss still causes a bunch of artifacts and color crushing on anything in motion. so unless you are talking about still frames you are just wrong.",
                  "score": 0,
                  "created_utc": 1746674600.0,
                  "replies": [
                    {
                      "id": "mr6r486",
                      "author": "alman12345",
                      "body": "Nah, I’m right. DLSS 4 is generally regarded as better than native by [multiple](https://youtu.be/5kI92zArqEA) [YouTubers.](https://youtu.be/ELEu8CtEVMQ) Their evidence is also far more [empirical](https://www.techspot.com/article/2957-nvidia-dlss-4-vs-dlss-3/) than “bunch of artifacts” and “color crushing”, so their word is far more valuable than yours.",
                      "score": 5,
                      "created_utc": 1746675336.0,
                      "replies": [
                        {
                          "id": "mr6rz2a",
                          "author": "zzazzzz",
                          "body": "so i should trust them over my own eyes? \n\nand dlss is a tradeoff, you cant make a objective judgement and say its better or worse. because yes in some cases it does look better than native, but in others like the ones i highlighted like dark scenes and anything in motion there is still obvious issues. to me personally the trailing artifacts on objects in movement are extremely distracting and ruin the experience. thats my opinion. and no some yourtuber having his own opinion that doesnt align with mine doest matter. because i can have my opwn opinion and you could have your own opinion but i guess you would rather just have some random youtubers opinion instead of forming your own..",
                          "score": -1,
                          "created_utc": 1746675696.0,
                          "replies": [
                            {
                              "id": "mr6tu41",
                              "author": "alman12345",
                              "body": "It objectively handles motion more than well enough to compete with and frequently beat native, even CNN had reached the point where it was a toss up and transformer (as I said) even recovers texture detail that didn’t even exist natively. I couldn’t care less what your eyes see or what your opinion is, everyone else and their mother are singing the praises. I’ve also used it, and it does look better than native (especially when combined with the extra frames from decreased load). It’s literally to the point where I need to comb for defects and I can find them in the aliased dogshit that is native rendering just as well as I can in an upscaled image. \n\nNative is dead for the vast majority, you’re essentially the gaming equivalent of an audiophile who only maintains FLAC and Vinyl because you can “hear the difference”. Actually, it’s even worse, instead of there being a tangible difference with one being superior when it can be used effectively native rendering isn’t even free of all the shimmering, transparency issues, and jaggies that DLSS helps remove. Literally [no one](https://youtube.com/watch?v=p-BCB0j0no0) agrees with your position, it’s give and take in the best case for native (vs DLSS 3) and it gets obliterated by DLSS 4 on the vast majority of tested metrics only nudging the occasional win here or there.\n\n[DLSS 4 performance (1280x720 internal) vs Native TAA (2560x1440 internal) at 2:54, DLSS steamrolls the native image in fidelity…like it’s no contest, and it was clipped in motion.](https://youtube.com/watch?v=ELEu8CtEVMQ)",
                              "score": 2,
                              "created_utc": 1746676503.0,
                              "replies": [
                                {
                                  "id": "mraiha5",
                                  "author": "Exeftw",
                                  "body": "They hated him because he spoke the truth.",
                                  "score": 3,
                                  "created_utc": 1746730066.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr5iawz",
              "author": "phire",
              "body": "You can also get a significant boost in effective performance when developers can spend time optimising and tuning a game for a single GPU.",
              "score": 0,
              "created_utc": 1746659327.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr3j2ns",
          "author": "encreturquoise",
          "body": "About 10 years like the Switch 1 did",
          "score": 13,
          "created_utc": 1746638125.0,
          "replies": [
            {
              "id": "mr3or71",
              "author": "Vitss",
              "body": "Did it, though? I don’t know, try playing a third-party title that got ported to the Switch and then compare it to literally any other modern platform it launched on. If that’s what we’re calling “keeping up,” then sure. But, calling that is like saying a bicycle keeps up with a motorcycle as long as they're technically moving in the same direction",
              "score": 32,
              "created_utc": 1746639728.0,
              "replies": [
                {
                  "id": "mr3pk5m",
                  "author": "DrunkenBartender17",
                  "body": "Definitely did not, by the time Tears of the Kingdom and Scarlet/Violet came out my gen1 Switch had been unusable with higher-demand games for a year or two already. Love my switch, but it is the mobile phone of console gaming.",
                  "score": 28,
                  "created_utc": 1746639953.0,
                  "replies": [
                    {
                      "id": "mr3twto",
                      "author": "blueblurz94",
                      "body": "Yeah unless heavily optimized correctly, most average third party efforts that were AAA on Switch were definitely looking bad by its 6th year on the market. 2022 was the last time I saw any quality third party ports from PS4/Xbox One.",
                      "score": 5,
                      "created_utc": 1746641175.0,
                      "replies": []
                    },
                    {
                      "id": "mr3tg1w",
                      "author": "None",
                      "body": "To be fair if you are buying a switch 2 for big AAA photorealistic games than you are already sold on low frame rates.\n\nLike ppl are saying gta 6 will be on switch 2 and thats only happening if you like 20fps or tons of compression.",
                      "score": 7,
                      "created_utc": 1746641040.0,
                      "replies": [
                        {
                          "id": "mr5w42b",
                          "author": "Abba_Fiskbullar",
                          "body": "I doubt Switch 2 has the CPU grunt to run GTA 6 in any capacity. It'll be a challenge on the Series S which is far more capable. I'm sure it'll get GTA 5 though.",
                          "score": 5,
                          "created_utc": 1746664097.0,
                          "replies": []
                        },
                        {
                          "id": "mr56b3k",
                          "author": "mickelboy182",
                          "body": "Tears of the Kingdom and Pokemon are Switch exclusives... I don't think the original commenter is even suggesting what you are, he just wants the first party stuff to not feel behind the times.",
                          "score": 3,
                          "created_utc": 1746655275.0,
                          "replies": [
                            {
                              "id": "mr5844t",
                              "author": "None",
                              "body": "Both commenters specifically mentioned issues with 3rd party high demand games.",
                              "score": -1,
                              "created_utc": 1746655862.0,
                              "replies": [
                                {
                                  "id": "mr5x2nr",
                                  "author": "PartRight6406",
                                  "body": "Redditors don't read comments they want other people to read theirs.",
                                  "score": -1,
                                  "created_utc": 1746664433.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr43gad",
                      "author": "Howeird12",
                      "body": "I couldn’t finish totk frame drops bothered me too much",
                      "score": 6,
                      "created_utc": 1746643921.0,
                      "replies": []
                    },
                    {
                      "id": "mr3uq2q",
                      "author": "Clemenx00",
                      "body": "Well it isnt a console \n\nIt is a portable with video out.",
                      "score": -16,
                      "created_utc": 1746641406.0,
                      "replies": [
                        {
                          "id": "mr3vj0i",
                          "author": "DrunkenBartender17",
                          "body": "If we’re going to be splitting hairs here, Nintendo calls it a console.",
                          "score": 13,
                          "created_utc": 1746641634.0,
                          "replies": [
                            {
                              "id": "mr49kra",
                              "author": "MikkelR1",
                              "body": "If Nintendo called a dog a cat, would you believe them?\n\nIts a tablet. Nothing more nothing less.",
                              "score": -10,
                              "created_utc": 1746645709.0,
                              "replies": [
                                {
                                  "id": "mr4aqwb",
                                  "author": "DrunkenBartender17",
                                  "body": "Do you buy a PS5 and think you’re getting a Vita? What kind of question even is that my guy?",
                                  "score": 5,
                                  "created_utc": 1746646051.0,
                                  "replies": [
                                    {
                                      "id": "mr4baf1",
                                      "author": "MikkelR1",
                                      "body": "I can ask you the same internet friend because i dont understand your point lmao.",
                                      "score": -8,
                                      "created_utc": 1746646205.0,
                                      "replies": [
                                        {
                                          "id": "mr4boc8",
                                          "author": "DrunkenBartender17",
                                          "body": "… that the switch is a console, that did not hold up for 10 years. I feel like that’s pretty well established above.",
                                          "score": 3,
                                          "created_utc": 1746646316.0,
                                          "replies": [
                                            {
                                              "id": "mr4c1s9",
                                              "author": "MikkelR1",
                                              "body": "And the argument was that it isn't a console but a handheld. Which it is. And you said but Nintendo calls it a console. Which is irrelevant because it isn't.\n\nThat leaves me still questioning why i would think id buy a vita when buying a PS5.",
                                              "score": -5,
                                              "created_utc": 1746646426.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr3p7ax",
                  "author": "encreturquoise",
                  "body": "I have a PS5 for that. Nintendo consoles have never been a good platform for 3rd party games, with some exceptions",
                  "score": -4,
                  "created_utc": 1746639853.0,
                  "replies": [
                    {
                      "id": "mr3q38j",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1746640103.0,
                      "replies": [
                        {
                          "id": "mr3vtqt",
                          "author": "Decipher",
                          "body": "SNES, actually. The GameCube didn’t get much support because it had proprietary discs with less storage. The N64 didn’t get much support because it had cartridges in the age of CDs.",
                          "score": 5,
                          "created_utc": 1746641719.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr4gwgg",
                  "author": "SwampOfDownvotes",
                  "body": "Try playing a third party title on the ps5 vs switch on an airplane.\n\n\nI guess you could say the ps5 isn't keeping up with the switch in that context.\n\n\nMy point is nobody is claiming the switch has games looking like ps5 games. They are much different devices. ",
                  "score": -5,
                  "created_utc": 1746647836.0,
                  "replies": [
                    {
                      "id": "mr59qgz",
                      "author": "None",
                      "body": "You can. You just need the portal. And it still runs better than a switch.",
                      "score": 0,
                      "created_utc": 1746656403.0,
                      "replies": [
                        {
                          "id": "mr7f70e",
                          "author": "Phoenix__Light",
                          "body": "Bro has never used a portal if you think this is remotely true lmao",
                          "score": 1,
                          "created_utc": 1746687785.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr6ofqc",
              "author": "whoknows234",
              "body": "Chip is already 5 year old technology.",
              "score": 1,
              "created_utc": 1746674233.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5rb8o",
          "author": "gamwizrd1",
          "body": "Keep up with what? BotW looked good enough to be an amazing game. Games on Switch 2 will look even better, which will still be good enough to be amazing games.\n\nThe best solution for high resolution gaming will always be an expensive PC. The people who own those expensive PC's do not want the Switch 2 to cost $800 just so that we can count the hairs on DK's butt. Parents don't want the Switch 2 to be $800 either. Nintendo wants to sell consoles to the masses, not impress computer graphic enthusiasts.",
          "score": 7,
          "created_utc": 1746662375.0,
          "replies": [
            {
              "id": "mr5xmrt",
              "author": "PartRight6406",
              "body": "Even expensive PCs cannot run AAA games at 4k with a stable frame rate and anyone who says they can is lying to you. \n\nI have a 4090 super and there's no shot I'm getting 60fps at 4k with max settings",
              "score": 6,
              "created_utc": 1746664628.0,
              "replies": [
                {
                  "id": "mr7n2eg",
                  "author": "Jamestayne",
                  "body": "Wow, how did you get a 4090 super? Those don’t even exist.",
                  "score": 5,
                  "created_utc": 1746692742.0,
                  "replies": [
                    {
                      "id": "mr8doug",
                      "author": "PartRight6406",
                      "body": "I mixed up my last GPU with my current, but nice snark.",
                      "score": 0,
                      "created_utc": 1746706621.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr5ztyp",
                  "author": "gamwizrd1",
                  "body": "Exactly. So what do people expect a $400 handheld device for kids to do?",
                  "score": 1,
                  "created_utc": 1746665396.0,
                  "replies": [
                    {
                      "id": "mr9hz69",
                      "author": "AintNobody-",
                      "body": "That's the thing that I keep going back to (and did for the Switch 1, for which I was banned from %notable gaming forum% for being a console warrior). It's a 7-inch budget tablet, slightly ruggedized for kids. All one needs is an eye and two brain cells to rub together to identify this. Why would anyone compare it to enthusiast-level PC performance? It's so wacky.",
                      "score": 4,
                      "created_utc": 1746719466.0,
                      "replies": []
                    },
                    {
                      "id": "mr9jepy",
                      "author": "nWhm99",
                      "body": "Dude, it’s gaming, all of it is for kids lol",
                      "score": 1,
                      "created_utc": 1746719877.0,
                      "replies": [
                        {
                          "id": "mr9mas1",
                          "author": "KingBoomi",
                          "body": "My bad, I forgot that adults aren't allowed to enjoy interactive stories for leisure. Only passive stories like movies and books. Thanks for reminding me!\n\nEnjoy your adulthood, fellow adult (within the rules, of course)!",
                          "score": 0,
                          "created_utc": 1746720728.0,
                          "replies": [
                            {
                              "id": "mr9rqbn",
                              "author": "nWhm99",
                              "body": "Oh wait, so gaming is beyond kids? Hmm, perhaps you should tell yourself that one comment ago, that would have saved me sometime.",
                              "score": 1,
                              "created_utc": 1746722339.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr93gmi",
              "author": "Digitlnoize",
              "body": "When are people going to realize that it’s the GAMES that matter most, not the graphics fidelity. Hell, Zork is one of my favorite games of all time and it doesn’t even have graphics at all lol.  I’m not saying graphics don’t matter at all, but they’re not the end all be all. I’ll happily take an amazing game with alright graphics over a alright game with amazing graphics.",
              "score": 1,
              "created_utc": 1746715226.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr4ctkb",
          "author": "Liroku",
          "body": "I doubt the switch 2 games will be drastically more graphically improved. I would guess most games will look about the same, with more life on the screen. More npc's, better draw distance, but probably about the same as far as models and textures go.",
          "score": 3,
          "created_utc": 1746646654.0,
          "replies": [
            {
              "id": "mr5x987",
              "author": "PartRight6406",
              "body": "Crazy considering you can already see that they are majorly improved.",
              "score": 6,
              "created_utc": 1746664496.0,
              "replies": []
            },
            {
              "id": "mr6pqhn",
              "author": "vanstinator",
              "body": "the good news there is we already know this isn't true, because we've been shown side by side comparisons directly from Nintendo. Games will look much better.",
              "score": 3,
              "created_utc": 1746674760.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5rbvi",
          "author": "correctingStupid",
          "body": "These are also going to be running much much lower power than a laptop",
          "score": 1,
          "created_utc": 1746662381.0,
          "replies": []
        },
        {
          "id": "mr3jufl",
          "author": "None",
          "body": "[deleted]",
          "score": -1,
          "created_utc": 1746638347.0,
          "replies": [
            {
              "id": "mr3kckq",
              "author": "wildgirl202",
              "body": "About 10 years like the Switch 1 did",
              "score": 3,
              "created_utc": 1746638489.0,
              "replies": [
                {
                  "id": "mr3ku0b",
                  "author": "Yalkim",
                  "body": "About 10 years like the Switch 1 did",
                  "score": 2,
                  "created_utc": 1746638626.0,
                  "replies": [
                    {
                      "id": "mr3mi4x",
                      "author": "JoeDawson8",
                      "body": "About 10 years like the Switch 1 did",
                      "score": 0,
                      "created_utc": 1746639095.0,
                      "replies": [
                        {
                          "id": "mr3o928",
                          "author": "Illustrious-Fill-708",
                          "body": "About 10 years like the Switch 1 did",
                          "score": 0,
                          "created_utc": 1746639588.0,
                          "replies": [
                            {
                              "id": "mr3ouw4",
                              "author": "KrakenClubOfficial",
                              "body": "About 10 years like the Switch 1 did",
                              "score": 0,
                              "created_utc": 1746639756.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr5ovwp",
          "author": "ManyInterests",
          "body": "I'm not worried about it. We're seeing pretty long console cycles and smaller leaps between generations anyhow (both in capability and what devs take advantage of). If you can play a game like Cyberpunk on the switch 2 today, it'll probably be able to play a ton of games for the foreseeable future.",
          "score": -1,
          "created_utc": 1746661538.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr3uzws",
      "author": "007Ati",
      "body": "I don't understand what people expected from a handheld console for 450€/$\n\nIf they would have used current gen tech with a big battery it would have cost 700-1000€/$ like other handhelds cost. Nobody would buy the switch 2 then.\n\nMost people just want 60 fps Nintendo games, and it seems that's what we are getting. I am more than fine with that..... People can still buy a PS5/Xbox/PC if they prefer performance and graphics for third party games.",
      "score": 181,
      "created_utc": 1746641484.0,
      "replies": [
        {
          "id": "mr4n0cz",
          "author": "hstheay",
          "body": "It’s beyond good enough for any kind of great gameplay with good enough graphics. Only if you want those photorealistic, non-stylised visuals the Switch won’t be for you, which is fair. \n\nThis is Nintendo to a tee since the Gamecube, and it has worked great almost always (the only exception was the Wii U).\n\nThese specs do not have me worried, Nintendo hasn’t disappointed in what they do best in a long time.",
          "score": 64,
          "created_utc": 1746649609.0,
          "replies": [
            {
              "id": "mr4oy3o",
              "author": "AssGagger",
              "body": "Cyberpunk, GTA6, and Doom Dark Ages are releasing on Switch 2. It seems like it's going to have plenty of power to pump current gen graphics to its 1080p screen. It's much more powerful, compact, and user friendly than a Steamdeck for the same price.",
              "score": 7,
              "created_utc": 1746650134.0,
              "replies": [
                {
                  "id": "mr5ulj8",
                  "author": "neonlights326",
                  "body": "GTA 6 is not confirmed for the Switch 2, nor is there any guarantee it will come to the Switch 2 (GTA 4 and GTA 5 aren't on any Nintendo platform)",
                  "score": 22,
                  "created_utc": 1746663556.0,
                  "replies": [
                    {
                      "id": "mr67ynr",
                      "author": "hyperforms9988",
                      "body": "I would hope that they're looking at a console that sold 150 MILLION units, and then looking at its successor, and are saying to themselves \"maybe we should make every effort possible to get this thing on that console\".  Not confirmed, but as a business, how do you look at that and pass that up unless you really have no choice?  If it were on Switch 2 on launch day, that would be within the first year of the console being out.  That's a *long* time to be on the digital shelves and in sales charts.",
                      "score": -8,
                      "created_utc": 1746668160.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr579qe",
                  "author": "bashermalone",
                  "body": "Yeah but be prepared for some 30fps titles. Although hopefully a 60fps performance mode will always be an option.",
                  "score": 14,
                  "created_utc": 1746655585.0,
                  "replies": []
                },
                {
                  "id": "mr5xfof",
                  "author": "Abba_Fiskbullar",
                  "body": "GTA6 isn't coming out on Switch 2, that's delusional. Doom the Dark Ages might be technically possible, but all the rumors about a Switch 2 release originate from comment threads like this one, so it's still wishful thinking.",
                  "score": 12,
                  "created_utc": 1746664560.0,
                  "replies": [
                    {
                      "id": "mr6c8u3",
                      "author": "GeT_Tilted",
                      "body": "Perfect time to re-release GTA5 for switch 2.",
                      "score": 4,
                      "created_utc": 1746669633.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr555ag",
                  "author": "hstheay",
                  "body": "Yeah true, people here seem to forget good 1080p can absolutely be done on hardware a few years ‘behind’.",
                  "score": 4,
                  "created_utc": 1746654903.0,
                  "replies": []
                },
                {
                  "id": "mrfomjm",
                  "author": "Aggrokid",
                  "body": "Source on GTA6 and Doom Dark Ages?",
                  "score": 1,
                  "created_utc": 1746805078.0,
                  "replies": [
                    {
                      "id": "mrfsh6l",
                      "author": "AssGagger",
                      "body": "It's not confirmed, but Take Two CEO said they \"fully expect\" to support Switch 2 and that Nintendo can support audiences of all ages. Id said they're looking into it, but only received dev kits in March.",
                      "score": 1,
                      "created_utc": 1746806238.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr56e48",
                  "author": "Jerzylo",
                  "body": "Switch 2 will *have* to use aggressive upscaling to make any newer games run decently. I bet the internal resolution will be something like 480p at most.\n\nAlso Steamdeck is not really a competitor, the use case and customer base are totally different. \n\nIf you want to play Nintendo titles get a switch, otherwise don't, simple as",
                  "score": 1,
                  "created_utc": 1746655301.0,
                  "replies": [
                    {
                      "id": "mr5eoq1",
                      "author": "AssGagger",
                      "body": "Cyberpunk runs at 60fps on high settings with a 3050 at 1080p. It will be much more optimized on a Switch 2. Nothing is going to need to run at 480p internal, lol.  \n  \nIf you want to play anything handheld for $500, the Switch 2 is overwhelmingly the best option.",
                      "score": 0,
                      "created_utc": 1746658083.0,
                      "replies": [
                        {
                          "id": "mr61h4w",
                          "author": "Rybread52",
                          "body": "They said they were aiming for consistent 40fps on Switch 2",
                          "score": 10,
                          "created_utc": 1746665975.0,
                          "replies": []
                        },
                        {
                          "id": "mr6hkjt",
                          "author": "Dry-Recognition8077",
                          "body": "A 3050 desktop, a 3050m(which was what was used for comparison) runs cyberpunk at around 50 fps at 1080p low, *which the switch 2 is 30% slower than btw*",
                          "score": 3,
                          "created_utc": 1746671553.0,
                          "replies": []
                        },
                        {
                          "id": "mr5xskf",
                          "author": "PartRight6406",
                          "body": "No it doesn't",
                          "score": -4,
                          "created_utc": 1746664684.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr5xq0v",
              "author": "PartRight6406",
              "body": "Since the 64 you mean. The psx blew the 64 out performance wise.",
              "score": -2,
              "created_utc": 1746664659.0,
              "replies": [
                {
                  "id": "mr63dnf",
                  "author": "sali_nyoro-n",
                  "body": "The Nintendo 64 was pretty advanced tech for when it was designed (ca. 1993), the problem is that actually getting the console out the door took longer than it had any right to. Even so, it's in many ways entirely capable of matching the PSX, mostly just being held back by \n\n1: Cartridges being far smaller than CD-ROMs, forcing sounds and textures to be compressed significantly compared to those on the PSX (and making Final Fantasy VII style several hundred megabyte pre-rendered FMVs a non-starter), and\n\n2: the ridiculous latency of the system's Rambus memory, which requires programmers to take a very different approach to their work compared to other systems where moving data from one part of the system to another is generally quite fast between solid-state components.",
                  "score": 2,
                  "created_utc": 1746666637.0,
                  "replies": [
                    {
                      "id": "mr6kl9g",
                      "author": "PartRight6406",
                      "body": "are you trying to say that the 64 was not blown out by the psx",
                      "score": 0,
                      "created_utc": 1746672695.0,
                      "replies": [
                        {
                          "id": "mr6ljqz",
                          "author": "sali_nyoro-n",
                          "body": "Not in hardware terms, no. It got blown out in _sales,_ but the actual hardware performance between the two is reasonably competitive, with the Nintendo 64 having things like a Z-buffer (so you don't get the characteristic warping of most PS1 and Saturn games) and a much faster CPU, but you also have memory latency from hell that forces you to write code to minimise read/write operations between parts of the system even when in theory it would be more cycle efficient. \n\nOverall, if the PSX could do it, you could probably get an N64 to do it with sufficient knowledge of how to code for the platform, and vice versa (storage medium limits notwithstanding). It's not like comparing either system to something like the Dreamcast where it's a clear and undeniable slaughter for the fifth-gen hardware.",
                          "score": 1,
                          "created_utc": 1746673068.0,
                          "replies": [
                            {
                              "id": "mr6ma4d",
                              "author": "PartRight6406",
                              "body": "Wrong",
                              "score": 0,
                              "created_utc": 1746673358.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr8ocf4",
          "author": "ryo4ever",
          "body": "Exactly and people don’t realise the compromise for battery life. This is a portable console. Kids don’t want their switch to shutdown after 45mins of game play. I mean parents would love it of course…",
          "score": 2,
          "created_utc": 1746710495.0,
          "replies": []
        },
        {
          "id": "mr5hktc",
          "author": "HelpRespawnedAsDee",
          "body": "when the next PS/Xbox is announced you are all gonna be shitting on the specs. nintendo gets treated with kids gloves in this site.",
          "score": 9,
          "created_utc": 1746659075.0,
          "replies": [
            {
              "id": "mr6aosc",
              "author": "rivieredefeu",
              "body": "People can just be objective and say:\n\nNintendo has a different financial, marketing, and design strategy than the rest. They tend to build somewhat lower cost consoles and focus more on innovative features and bet that pays off. Sometimes it works (Wii, 3DS, Switch) and sometimes it does not (GameCube, WiiU).",
              "score": 10,
              "created_utc": 1746669094.0,
              "replies": []
            },
            {
              "id": "mr78xzj",
              "author": "Sa404",
              "body": "Both the PS5 and Xbox sX were really powerful when they came out (in fact they’re still pretty good thanks to Nvidia and AMD keeping GPU as high as possible",
              "score": 2,
              "created_utc": 1746684110.0,
              "replies": []
            },
            {
              "id": "mr8kgf2",
              "author": "PandaPanPink",
              "body": "Will they? I feel like for the past generation nobody really cares about graphics anymore as long as the game runs well as proven by how many people use performance mode on ps5 vs quality, and with how nintendo makes games I don’t see these specs causing any major hiccups or slowdown like BOTW on switch had in places.",
              "score": 1,
              "created_utc": 1746709142.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr86xla",
          "author": "OkDragonfruit9026",
          "body": "Why not make a switch pro? Enthusiasts would buy it enough.",
          "score": 1,
          "created_utc": 1746703838.0,
          "replies": []
        },
        {
          "id": "mtyyc7h",
          "author": "None",
          "body": "Those other handhelds have to make all their profit on the hardware itself. A console has way more ways to earn money (online fee, game sales etc.). \n\nThats why a pc is always more expensive than a console. If a console is same price as a similar specced pc (switch 2 / steam deck), its actually a pretty poor value. ",
          "score": 1,
          "created_utc": 1748069552.0,
          "replies": []
        },
        {
          "id": "mr50fok",
          "author": "Gnash_",
          "body": "We are even getting a rock solid 120 fps for Mario Kart and Metroid, so I’m happy",
          "score": 0,
          "created_utc": 1746653439.0,
          "replies": []
        },
        {
          "id": "mr4zrlm",
          "author": "nicman24",
          "body": "It is not even entry point performance (lower than 3050) on a series that is 4 years old - rtx3xxx released 2020",
          "score": -3,
          "created_utc": 1746653235.0,
          "replies": [
            {
              "id": "mr5taum",
              "author": "punIn10ded",
              "body": "What's the power draw for the 3050? And how do you think that will impact a handheld/portable device?",
              "score": 2,
              "created_utc": 1746663088.0,
              "replies": [
                {
                  "id": "mr6xldl",
                  "author": "nicman24",
                  "body": "Don't be dense. They are the same silicon.",
                  "score": -1,
                  "created_utc": 1746678204.0,
                  "replies": [
                    {
                      "id": "mr70jtn",
                      "author": "punIn10ded",
                      "body": "... You're kidding right?",
                      "score": 2,
                      "created_utc": 1746679620.0,
                      "replies": [
                        {
                          "id": "mr741dx",
                          "author": "nicman24",
                          "body": "nope that is how mobile chips work. they are the same silicon clocked lower. if a desktop gpu and laptop gpu have the same cuda / shaders / rops / whatever they are literally the same and usually a lower bin as the laptop one does not need to desktop clocks",
                          "score": 0,
                          "created_utc": 1746681423.0,
                          "replies": [
                            {
                              "id": "mr7fq7l",
                              "author": "Phoenix__Light",
                              "body": "Ummm, do you understand that power draw and TDP constraints exist in a portable device? A true 3050 would drain the switch in 30 minutes if it ran on the switch as is",
                              "score": 2,
                              "created_utc": 1746688105.0,
                              "replies": [
                                {
                                  "id": "mr7gt4o",
                                  "author": "nicman24",
                                  "body": "and your point is? i do not understand what you are trying to argue.\n\nthat is why they are not clocked the same, while being the same gpu on the lithography level.",
                                  "score": 1,
                                  "created_utc": 1746688767.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr4ym1u",
          "author": "ray111718",
          "body": "Not to mention this looks like the first Nintendo system in a while they are selling at a loss like ps and ms",
          "score": 0,
          "created_utc": 1746652886.0,
          "replies": []
        },
        {
          "id": "mr5mo32",
          "author": "chuycobo",
          "body": "Same people complaining about console prices are fine spending 1k every other year on new pc graphics cards claiming a victory because of Steam sales.",
          "score": 0,
          "created_utc": 1746660785.0,
          "replies": []
        },
        {
          "id": "mr5e28m",
          "author": "alman12345",
          "body": "This is like saying we don’t know why people expected more than 12GB on the 5070, we know the chip is cheap for both (especially the switch, because they’re not only using something stupidly small but also on an ancient node from Samsung) and the accompanying hardware is cheap as well (again, especially the switch since almost everything is plastic). Valve had a custom APU in a low volume console that they’ve been offering at $400 base price for years now, to think Nintendo couldn’t have offered the switch 2 cheaper than $450 is misguided given what it has and how expensive it actually is to produce.",
          "score": -2,
          "created_utc": 1746657867.0,
          "replies": [
            {
              "id": "mr5p6sk",
              "author": "cockyjames",
              "body": "https://www.reddit.com/r/NintendoSwitch2/s/cp0OIWZt0A",
              "score": 1,
              "created_utc": 1746661642.0,
              "replies": [
                {
                  "id": "mr5rst2",
                  "author": "alman12345",
                  "body": "Ah yes, a “we believe” as a definitive bill of materials. What a solid case for how expensive a console made entirely of plastic with an SoC from an antiquated node including reference ARM cores should cost to produce. Did you think this was evidence of something?",
                  "score": 0,
                  "created_utc": 1746662549.0,
                  "replies": [
                    {
                      "id": "mr6cr34",
                      "author": "cockyjames",
                      "body": "Why would I take your opinion over there’s? Especially when they were very accurate in estimating the OLED model?\n\nAlso what is this metal handheld you’re in love with?",
                      "score": 0,
                      "created_utc": 1746669810.0,
                      "replies": [
                        {
                          "id": "mr6djbb",
                          "author": "alman12345",
                          "body": "First, theirs, not there’s. Second, who verified their accuracy? If it was Nintendo then I’m sure there’s no way whatsoever that they lied to make the price seem more reasonable…\n\nFinally, who said metal? Glass screens are standard on every device under the sun, except for the dogshit that is Nintendo’s switch. Also, the switch is decidedly made out of extremely poor quality plastic to the absolute lowest standard imaginable. It’s like if Jerryrig compared a Galaxy S22 to a $45 Temu phone, holding a Steam Deck compared to a switch feels that much different. Their margins are higher than they want to pretend, but go ahead and continue to be spoonfed lies about how much things cost so you can lick Nintendo’s boots harder.",
                          "score": 1,
                          "created_utc": 1746670085.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr47ybk",
          "author": "turb0_encapsulator",
          "body": "The whole point of consoles used to be you got the hardware effectively subsidized but paid more for the games. Now these companies want it both ways.",
          "score": -20,
          "created_utc": 1746645228.0,
          "replies": [
            {
              "id": "mr497kg",
              "author": "impuritor",
              "body": "Hasn’t been that way for a long time.",
              "score": 17,
              "created_utc": 1746645600.0,
              "replies": [
                {
                  "id": "mr49qcr",
                  "author": "turb0_encapsulator",
                  "body": "Well maybe that’s why the industry is dying.",
                  "score": -21,
                  "created_utc": 1746645755.0,
                  "replies": [
                    {
                      "id": "mr4a1ti",
                      "author": "impuritor",
                      "body": "The switch is likely going to become the best selling video game console of all time this year. So no that’s not true either.",
                      "score": 11,
                      "created_utc": 1746645848.0,
                      "replies": [
                        {
                          "id": "mr4hb76",
                          "author": "Ok-Mention4443",
                          "body": "Isn’t that kinda exciting??? PS2 was the king for a long time",
                          "score": 1,
                          "created_utc": 1746647954.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr4bbh9",
                      "author": "PM_ME_STEAM_KEY_PLZ",
                      "body": "The industry is bigger than is has ever been, and continues to grow.",
                      "score": 9,
                      "created_utc": 1746646213.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr4p3dz",
              "author": "Mr__Pleasant",
              "body": "Nintendo hasn't been needing to do this though",
              "score": 1,
              "created_utc": 1746650174.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr3nvsa",
      "author": "Shapes_in_Clouds",
      "body": "Not surprising given the form factor and price point.",
      "score": 71,
      "created_utc": 1746639485.0,
      "replies": [
        {
          "id": "mr3rb4q",
          "author": "PikaV2002",
          "body": "> price point\n\nlol",
          "score": -30,
          "created_utc": 1746640440.0,
          "replies": [
            {
              "id": "mr3x0nk",
              "author": "NoMoreVillains",
              "body": "Could you point me to other $450 handhelds with more modern tech?\n\nThanks",
              "score": 46,
              "created_utc": 1746642063.0,
              "replies": [
                {
                  "id": "mtyyhr4",
                  "author": "None",
                  "body": "Meta quest 3 (4nm chipsets, 4k120hz screen). Not a handheld but mobile device as well.\n\nSteam deck (6-7nm chipset, 4 GB more ram, much better CPU, more memory bandwith).\n\nSwitch 2 uses 8nm samsung node. ",
                  "score": 1,
                  "created_utc": 1748069642.0,
                  "replies": []
                },
                {
                  "id": "mr49aza",
                  "author": "ThermalJuice",
                  "body": "Listen, Nintendo isn’t about modern cutting edge technology or performance. They’re about the “user experience”. Just like Apple in the, get less and pay more category, but it’s easy to use and you’re already invested.",
                  "score": -9,
                  "created_utc": 1746645627.0,
                  "replies": [
                    {
                      "id": "mr5sj9o",
                      "author": "DifficultyNo7758",
                      "body": "The M series processors are some of the best in the world right now. I hate apple to my core with their closed garden proprietary trash environment. But damn don't talk about shit you don't know, give apple the respect it deserves, they're making and have made other companies play catch up with the m series.",
                      "score": 9,
                      "created_utc": 1746662813.0,
                      "replies": []
                    },
                    {
                      "id": "mr5gqhc",
                      "author": "Prince_Uncharming",
                      "body": "Apple hasn’t been in the “get less and pay more” category for *years*.\n\nBase iPad is better than any other tablet you can get for that price. Same goes for the MacBook Air. Arguably true for the base iPhone as well.\n\nAt this point, in many segments Apple is both the performance *and* value leader which is sort of crazy.",
                      "score": 3,
                      "created_utc": 1746658781.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr4872d",
                  "author": "TomSaylek",
                  "body": "The steam deck?",
                  "score": -23,
                  "created_utc": 1746645299.0,
                  "replies": [
                    {
                      "id": "mr49x95",
                      "author": "NoMoreVillains",
                      "body": "All indications point to it being stronger then the Steam Deck  though",
                      "score": 29,
                      "created_utc": 1746645812.0,
                      "replies": [
                        {
                          "id": "mr4nq34",
                          "author": "None",
                          "body": "And only the lowest tier Steamdeck is cheaper, with the other two higher end versions being $100-200 more than Switch2.",
                          "score": 13,
                          "created_utc": 1746649800.0,
                          "replies": [
                            {
                              "id": "mtyyw1n",
                              "author": "None",
                              "body": "But also feature an oled screen and more storage. 256 GB LCD vs 256 GB LCD is the real comparison\n\nIf you add in the cost of a micro sd express card to catch up to steam decks storage they are close in price again",
                              "score": 1,
                              "created_utc": 1748069871.0,
                              "replies": [
                                {
                                  "id": "mu0qzog",
                                  "author": "None",
                                  "body": "That's a fair point, but I would also say to consider docking. The Switch 2 obviously comes with a dock, and one that will boost performance. \n\nWhereas the Steamdeck dock must be purchased separately ($80 for 1st party, and prices vary for 3rd party) -- and the Steamdeck docks don't change the performance of the system.",
                                  "score": 1,
                                  "created_utc": 1748099745.0,
                                  "replies": [
                                    {
                                      "id": "mu1su91",
                                      "author": "None",
                                      "body": "Well steam deck comes with a case which the switch 2 doesnt. It also doesnt need a dock, you can literally just connect it to any monitor with usb c cable. But sure, deck doesnt boost its performance when docked, thats just not what its designed for. Its a handheld. If somebody is looking for a stationary system there are much better options than a steam deck.",
                                      "score": 1,
                                      "created_utc": 1748111787.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mtyyqaa",
                          "author": "None",
                          "body": "Steam deck trumps the Switch 2 undocked in GPU slightly, CPU performance widely, memory bandwith and ram according to this very leak. Switch only gets an edge in the docked modes GPU power with no battery power limitations. ",
                          "score": 1,
                          "created_utc": 1748069778.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr49mk3",
                  "author": "NextBigTing",
                  "body": "At least 5 other handheld gaming devices will be releasing this year. So give it a few months and your wish will be granted",
                  "score": -20,
                  "created_utc": 1746645724.0,
                  "replies": [
                    {
                      "id": "mr49yqv",
                      "author": "NoMoreVillains",
                      "body": "And what do they cost?",
                      "score": 19,
                      "created_utc": 1746645824.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr3vlki",
              "author": "Dependent-Mode-3119",
              "body": "I mean it costs around the same as the LCD steamdeck and is a bit more powerful",
              "score": 20,
              "created_utc": 1746641654.0,
              "replies": [
                {
                  "id": "mr47kis",
                  "author": "SerCharles",
                  "body": "it's definitely more powerful than the LCD SD and has way better hardware. bigger screen, docking in the box, removable controllers etc",
                  "score": 26,
                  "created_utc": 1746645115.0,
                  "replies": [
                    {
                      "id": "mtyzsbs",
                      "author": "None",
                      "body": "According to this very leak the CPU is signifcany worse, it has less ram and less memory bandwith.\n\nThe GPU is about on par when undocked but better when docked. Scince he asked for a comparison to a handheld you need to look at the undocked performance though. And here is weaker than a steam deck lcd in every way but it’s screen. \n\nThe steam deck does also come with a free case, two trackspads, analog triggers, 4 back buttons and, most importantly, cheaper games and free online.\n\nAll in all its the much better value",
                      "score": 1,
                      "created_utc": 1748070399.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr4851n",
          "author": "Bootychomper23",
          "body": "Price point? Lmao!!!!",
          "score": -28,
          "created_utc": 1746645283.0,
          "replies": [
            {
              "id": "mr4ns2r",
              "author": "Bard_the_Bowman_III",
              "body": "Is there another $450 handheld with better specs? I'm not aware of one.",
              "score": 34,
              "created_utc": 1746649816.0,
              "replies": [
                {
                  "id": "mtz04un",
                  "author": "None",
                  "body": "Yes the steam deck. \n\nMuch better CPU\n\n4 GB more Ram\n\n20 GBS more menory bandwith\n\n10% better GPU vs Switch 2 undocked.\n\nSwitch 2 docked has more GPU performance but you asked for a comparison to a handheld, so you need compare handheld to handheld.\n\nSwitch 2 has a dock, better screen and joycons\n\nSteam deck has trackpads, a free case, back buttons and most importantly, way cheaper games and free online",
                  "score": 1,
                  "created_utc": 1748070603.0,
                  "replies": []
                },
                {
                  "id": "mr57vx7",
                  "author": "haarschmuck",
                  "body": "Each game costing $80-$100 is what they're talking about.\n\nIt's insane.",
                  "score": -10,
                  "created_utc": 1746655787.0,
                  "replies": []
                },
                {
                  "id": "mr5a82o",
                  "author": "None",
                  "body": "RoG ally. Nintendo somehow managed to be worse than a device that is 2 years old and is having a new release soon.",
                  "score": -11,
                  "created_utc": 1746656565.0,
                  "replies": []
                },
                {
                  "id": "mr4te25",
                  "author": "Bootychomper23",
                  "body": "Shits 730 for me!!! 800 with tax. It’s about on par with steam deck pricing here with what sounds like a slight edge in power and what will be an even bigger edge in custom optimization.. so it is competitive true… minus the games.. they will ad up at 99-115 a pop",
                  "score": -27,
                  "created_utc": 1746651378.0,
                  "replies": [
                    {
                      "id": "mr5nsmb",
                      "author": "Zyoy",
                      "body": "So then get a steam deck? Nintendo isn’t entitled to cater to you. I’m not getting it, why do you have to make a fit over something that they are being upfront about.",
                      "score": 6,
                      "created_utc": 1746661166.0,
                      "replies": [
                        {
                          "id": "mr6lkji",
                          "author": "Bootychomper23",
                          "body": "I own one as well as a ps5 pro, I’m also buying a switch 2, money is not an issue for me… I’m just noting it’s more expensive then the other platforms that actually discount their games so it’s funny to claim it’s got a low price point when it’s one of the more expensive consoles to buy for overall.",
                          "score": 1,
                          "created_utc": 1746673076.0,
                          "replies": [
                            {
                              "id": "mr6ppmt",
                              "author": "Zyoy",
                              "body": "You don’t have to buy those games and like you said if money isn’t an issue then again what’s ya problem. Because it sounds like money is an issue,",
                              "score": 1,
                              "created_utc": 1746674750.0,
                              "replies": [
                                {
                                  "id": "mr6qrwm",
                                  "author": "Bootychomper23",
                                  "body": "The comment was saying that for the price point switch is a good deal the argument here is that actual games etc make that price point much higher then the alternatives of course  they can not play switch 2 games which is why I’m buying one but saying it’s price point is a selling point when Nintendo is one of the most expensive platforms to game on if you actually pay for your games Is funny to me.",
                                  "score": 1,
                                  "created_utc": 1746675192.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr4497p",
      "author": "D-inventa",
      "body": "I think Nintendo has proven again and again, it's what you do with the hardware, not what the hardware can do. ",
      "score": 86,
      "created_utc": 1746644152.0,
      "replies": [
        {
          "id": "mr5ect9",
          "author": "r31ya",
          "body": "The new switch have like 7x power (similar chipset and running spec benchmark) of Nintendo switch and around Steamdeck power...\n\nwhich impresses me more on OG Switch that still run pretty strong nowadays.",
          "score": 16,
          "created_utc": 1746657968.0,
          "replies": [
            {
              "id": "mr5ozo5",
              "author": "DOndus",
              "body": "Around steam deck power in handheld but nearly double docked at least in terms of GPU from what I’ve heard",
              "score": 11,
              "created_utc": 1746661573.0,
              "replies": [
                {
                  "id": "mr67731",
                  "author": "OtakuAttacku",
                  "body": "so is it more accurate to say that in handheld mode the GPU is throttled to 50%. Beyond battery life, I wonder how much does heat dissipation play into this cause iirc the switch 2 dock has extra fans.",
                  "score": 6,
                  "created_utc": 1746667902.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr4qett",
          "author": "spreadthaseed",
          "body": "Golden eye is a good example",
          "score": 7,
          "created_utc": 1746650543.0,
          "replies": [
            {
              "id": "mr5okb5",
              "author": "_RADIANTSUN_",
              "body": "N64 was the more powerful console by far so that is a bad example. Better example would be something like Super Mario Galaxy 2. A game which to this day looks BEAUTIFUL.",
              "score": 5,
              "created_utc": 1746661428.0,
              "replies": [
                {
                  "id": "mr5toxz",
                  "author": "tooclosetocall82",
                  "body": "If the N64 had had a CD drive idk if PlayStation would be around today. It had the graphics but people were more impressed with FMV.",
                  "score": 2,
                  "created_utc": 1746663226.0,
                  "replies": [
                    {
                      "id": "mr65p7y",
                      "author": "sali_nyoro-n",
                      "body": "Sony did still have a year and a half functionally unopposed in the 5th generation, Sega having blasted both of its legs off with a shotgun with barrels labelled \"32X\" and \"early Saturn launch\". They also had far more permissive terms for publishing software than Nintendo, who were still imposing various strict requirements on publishers at the time. On top of this, the PlayStation had an existing install base, room to cut console prices if needed from cost savings and a pretty decent library of titles by the time the Nintendo 64 came out. \n\nNintendo probably wouldn't have run into the severe issues they did in getting third parties to support the console though, which would help their performance in the west. Though the management's prejudice towards 2D games would still lose them sales in Japan where, ironically, the Saturn's design legacy making it a sprite-drawer first and a polygon-drawer second made it an ideal platform for things like scrolling shoot-em-ups, 2D platformers and traditional fighting games. \n\nIn turn, that would've stopped the GameCube from being a total bust since it would've given them a better chance of actually having games for the damn thing to launch with and allowed it to come out closer to the PS2, though they'd have to use full-sized DVDs to avoid losing half of their developers to Sony.",
                      "score": 1,
                      "created_utc": 1746667434.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr4gi2a",
          "author": "-Badger3-",
          "body": "And then everything that’s not Mario looks like blurry, jagged shit.",
          "score": -11,
          "created_utc": 1746647719.0,
          "replies": [
            {
              "id": "mr4ycn8",
              "author": "D-inventa",
              "body": "sincerely doubt that's going to be the case with the Switch 2. The only thing i'm worried about is the controllers. I'm very surprised they decided not to go with Hall Effect sticks......very very surprised.",
              "score": 4,
              "created_utc": 1746652808.0,
              "replies": [
                {
                  "id": "mr61t31",
                  "author": "Rybread52",
                  "body": "The Hall effect magnets probably interfered with the magnets that hold the joycons in place",
                  "score": 1,
                  "created_utc": 1746666088.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr40iwu",
      "author": "mawheabo",
      "body": "![gif](giphy|zXA5VEmXr7OUg)",
      "score": 39,
      "created_utc": 1746643078.0,
      "replies": [
        {
          "id": "mr54x75",
          "author": "BleachSoulMater",
          "body": "![gif](giphy|3D3lebqT9m9yxu32Sx)",
          "score": 6,
          "created_utc": 1746654832.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr3k7n5",
      "author": "black_samorez",
      "body": "3 generations behind on release lol",
      "score": 127,
      "created_utc": 1746638451.0,
      "replies": [
        {
          "id": "mr3qmun",
          "author": "v-komodoensis",
          "body": "Yeah, because that was such a deal-breaker with the Switch 1. 😅\n\nTruth is that as long as it runs the games decently, people will be content with it.\n\nIf you want a powerful handheld Nintendo is not where you should be looking at and people are okay with it, I suppose.",
          "score": 118,
          "created_utc": 1746640254.0,
          "replies": [
            {
              "id": "mr5f34b",
              "author": "r31ya",
              "body": "i was thinking that NSwitch2 slightly less powerful than PS4\n\nbut Geekerwan stand-in benchmark noted that the GPU is slightly more power than PS4 in Handheld and nearly twice more powerful in docked. the CPU is easily 5x more powerful than olde Jaguar in PS4, not to mention the 1gb/s speed of the Storage compared to PS5 50mb/s\n\n[https://www.youtube.com/watch?v=3pr\\_V8rtzrE&t=5s](https://www.youtube.com/watch?v=3pr_V8rtzrE&t=5s)\n\n\\---\n\nit follow tradition of a new handheld that is slightly more powerful than last gen",
              "score": 6,
              "created_utc": 1746658219.0,
              "replies": [
                {
                  "id": "mr68c9f",
                  "author": "sali_nyoro-n",
                  "body": "To be fair, the Jaguar CPU in the PS4 and Xbox One was a complete dog even for the time. Eight sluggish (1.6GHz in the PS4, 1.75GHz in the Xbox One) tablet processors provided by two quad-core modules sellotaped together, and the total lack of performance is part of why games are so damn big now as audio had to be stored uncompressed to allow those pieces of shit to run games without choking on real-time decompression. Five times that is still frankly... not a lot?",
                  "score": 3,
                  "created_utc": 1746668286.0,
                  "replies": [
                    {
                      "id": "mr6ey3f",
                      "author": "r31ya",
                      "body": "Nope,\n\nWhile GPU is \"competitive\" with current on-board graphics at least on docked mode.\n\nThe CPU is lagging behind mobile latest. Showing that it is 4 years old tech.\n\nBut that tester noted that the CPU is enough to run things like cyberpunk 2.0.",
                      "score": 1,
                      "created_utc": 1746670589.0,
                      "replies": [
                        {
                          "id": "mr6gqux",
                          "author": "sali_nyoro-n",
                          "body": "The _GPU_ is fine, yes. It's somewhere in the region of a GTX 1050 Ti but with the benefit of newer technologies like DLSS that enable it to get a lot more in the way of functional results than its raw performance would otherwise suggest. Would've been more impressive in 2023, seeing as it's running on a 2020 architecture (Ampere). \n\nThe CPU being a relative weak point isn't surprising given that most games are primarily GPU driven. Luckily, Cyberpunk 2077 was designed to work even on the decrepit and CPU-limited PS4 and CDPR were able to make The Witcher 3 run on the Switch, so I can believe it has the capacity to run the improved Version 2.0 with some system-specific optimisation work. It should be good enough for the next few years in any case.",
                          "score": 3,
                          "created_utc": 1746671246.0,
                          "replies": [
                            {
                              "id": "mr6jj6b",
                              "author": "r31ya",
                              "body": "Yeah, one particular issue is that current gen game is freakin happy with ps5/xboxseries cpu upgrade and have raised the minimum required cpu for newer game.\n\nAnd now we'll see whether switch 1ghz, 8 thread cpu could keep up or not.",
                              "score": 2,
                              "created_utc": 1746672290.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr3r8yz",
              "author": "Madnoir",
              "body": "All that matters with video games is that they look good. I'll take boring good looking slop on the PS5 Pro rather than fun decent looking games on the Switch 2.\n\nedit: apparently I need to add an /s here",
              "score": 51,
              "created_utc": 1746640424.0,
              "replies": [
                {
                  "id": "mr3thzw",
                  "author": "DigitallyDetained",
                  "body": "And that’s why these systems can co-exist. Some people don’t care as much about that and will be more than happy with the Switch 2.",
                  "score": 14,
                  "created_utc": 1746641056.0,
                  "replies": []
                },
                {
                  "id": "mr3vf1l",
                  "author": "raccoonbrigade",
                  "body": "After playing TOTK, I'm side eyeing my PS5. It can do so much more than the switch so why doesn't it?",
                  "score": 6,
                  "created_utc": 1746641602.0,
                  "replies": [
                    {
                      "id": "mr47ug0",
                      "author": "xondk",
                      "body": "Personally i think the whole \"pretty graphics\"/realism ray trace e.t.c. is foced on too much, and it has reached dminishing returns.\n\nThe switch simply didn't have that option so more focus on gameplay and stories naturally happened.\n\nAnd ultimately what makes a good game isn't the graphics.",
                      "score": 20,
                      "created_utc": 1746645196.0,
                      "replies": [
                        {
                          "id": "mr59lfh",
                          "author": "AtomicSymphonic_2nd",
                          "body": "For folks that like to tinker (like the Digital Foundry folks and a rather large proportion of PC enthusiasts), the gameplay is secondary to the fascinating aspects of new technology being demonstrated.\n\nA game a merely a medium for them. In fact, many of them find tech demos to be just as entertaining as games themselves.\n\nThen again, I think it’s because they’re more interested in coding/engineering than they are in just “having fun”.\n\nSeeing the technology work is their version of “fun”.\n\nLike, I recall a lot of focus by PC gamers on that UE5 “The Matrix Awakens” tech demo that ran only on PS5 and Series X consoles for a long while.\n\nThese are the same folks that actually really enjoy their day jobs as software engineers or computer engineers. lol",
                          "score": 1,
                          "created_utc": 1746656356.0,
                          "replies": [
                            {
                              "id": "mr78knk",
                              "author": "xondk",
                              "body": "Oh it definitely is a point for sales of games, 'using the latest tech' and such, and I get that being a tech guy myself, it is great to see.\n\nBut it just doesn't translate to the game being 'good' and often the focus on tech and graphics, at least in my mind, is at the detriment to gameplay and story.\n\nCourse if it causes more sales, even if there is low retention, as in people don't play the game for long or don't complete it, it still means they got a sale, so I get it.",
                              "score": 1,
                              "created_utc": 1746683903.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr3wjsw",
                      "author": "Madnoir",
                      "body": "I've been playing video games since SNES and this generation has been the absolute worst. Neither Sony nor Microsoft are trying anything. I never even bought a Series X/S since literally every \"exclusive\" is on PC at the same time and  PS5 only gets timed exclusives. Nintendo is the only console trying something unique, yeah it doesn't look as pretty but they actually give me a reason to use my Switch.",
                      "score": 9,
                      "created_utc": 1746641926.0,
                      "replies": [
                        {
                          "id": "mr48pfy",
                          "author": "Kindness_of_cats",
                          "body": "Even graphically it's been an underwhelming generation.\n\n I'm honestly convinced that we're beginning to hit a point of diminishing returns on what new console generations bring to the table for the average gamer.  I look at DF videos of some games, and they'll say some shit like \"The Series S version is severely compromised, with basic reflections and low quality textures\" then they'll show a clip that feels like one of those Spot the Difference games until they zoom in on some laughably minor detail.  \n\nFFS, a game that's running on console hardware equivalent to what we had about ~8 years old today looks like BotW or AC Origins.\n\nA decade ago, an ~8 year old game would have looked like fucking Mario Galaxy(a game that is natively STANDARD DEFINITION) or the original fucking Oblivion.",
                          "score": 9,
                          "created_utc": 1746645451.0,
                          "replies": [
                            {
                              "id": "mr6febt",
                              "author": "ArmedWithBars",
                              "body": "What should have been the focus was framerate and upscaling. Nearly every single person owns a 60hz TV and 120+hz are getting popular as prices go down. Games releasing at 30fps in 2024/2025 is some grade A bullshit.",
                              "score": 1,
                              "created_utc": 1746670751.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr3yi2c",
                          "author": "raccoonbrigade",
                          "body": "PC and  Switch covers all of my needs. I used to really love Sony. Their movement to AAA western focused tastes have driven me away. On top of that, other Japanese devs largely moving to the Switch, and more recently PC, has given me no reason to want a PlayStation. And I've been a Sony 🐎 since the PS1. \n\nAnd yeah, Xbox had some good stuff at one point lol",
                          "score": 2,
                          "created_utc": 1746642492.0,
                          "replies": [
                            {
                              "id": "mr54nl9",
                              "author": "Madnoir",
                              "body": "Pretty much. I did get a PS5 at launch but I've played maybe 5 games that were \"exclusive\" on it. Honestly I probably haven't even turned it on since Astro Bot. I could honestly see not buying a PS6 at all if this continues.",
                              "score": 1,
                              "created_utc": 1746654747.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mr4nw0s",
                          "author": "heat13ny",
                          "body": "It comes across like you’re more into console exclusivity over unique experiences. I’ll never understand caring about games releasing ONLY on the platform you chose. Like what does that even do for you?\n\nAs far as unique experience this generation I have played more great games in so many varied genres   than I ever have. I play on PC (and have a switch I haven’t touched since Metroid Dread came out) so I have access to things like humble bundle, gamepass, sales, etc so the amount of interesting shit I have access to seems endless to me. I don’t know what you guys that are upset with the industry right now are doing. Not meaning this as a slight I’m being completely genuine. I don’t understand where you guys are looking for games if you feel there is dearth of creative, interesting shit.",
                          "score": 2,
                          "created_utc": 1746649846.0,
                          "replies": [
                            {
                              "id": "mr51fb2",
                              "author": "Madnoir",
                              "body": "You're misinterpreting what I'm trying to say. \n\nWhat do either Xbox or Sony do that should get me to buy their consoles? If games play identically on the consoles and/or PC then I don't need more than one of them. Like I said Sony does get timed exclusives but they eventually get to PC so I could just wait, Xbox games are just immediately on PC. On the other hand Nintendo has countless titles and series that won't get ported. Going further with the uniqueness of the switch for example having a touchscreen and of course the Joy Cons they're able to create experiences that can't be matched on the other platforms. Unfortunately console exclusivity and unique experience kind of go hand in hand.  \n\nThat being said I do think to the push to multiplatform is bad for the industry and arguably a large part of why AAA are so stagnant. There's no reason to innovate the games. Instead Sony and Microsoft are in a technical arms race to make slightly better hardware than the other that marginally improves graphics over the other.",
                              "score": 0,
                              "created_utc": 1746653745.0,
                              "replies": [
                                {
                                  "id": "mr6kj5i",
                                  "author": "BRAND-X12",
                                  "body": ">What do they do\n\nIdk, dualsense and reliable performance on a media machine + 4K Blu-ray player for 1/3rd the price of a PC setup?\n\nThe benefits of home consoles have never really changed all that much.",
                                  "score": 1,
                                  "created_utc": 1746672672.0,
                                  "replies": []
                                },
                                {
                                  "id": "mr5bz4l",
                                  "author": "heat13ny",
                                  "body": "Wow we are of the exact opposite mindset almost 100%. I think it should have ALWAYS been multiplatform because what benefit is a walled garden to me, the consumer? I feel like the best possible industry is born when the only leverage a company has is with how good their game is. Not how many studios they can buy. \n\nAs far as things like the joy cons and touch screen, they're fun gimmicks to me but don't make great games. I've never had an experience that relied on hardware gimmicks like motion controls, the kinect, or dualsense controller that engrossed me the way a simply really good game will. Don't get me wrong, I enjoy them and hope we keep seeing fun little things like this, but they do NOT push the industry forward to me. The only exception would be VR cause that shits crazy.\n\nAgain, I don't know where you're looking for games to be able to say AAA is stagnant right now. Like what do you think is missing? What genres? I may have some recommendations.",
                                  "score": 1,
                                  "created_utc": 1746657157.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr4o2en",
                          "author": "m0rogfar",
                          "body": "It’s pretty insane that the Switch 2 is coming out around five years after the PS5 and Series X, and it doesn’t seem too unrealistic that they’ll catch up on exclusives by the end of this year if their June direct is up to their usual standards.",
                          "score": 1,
                          "created_utc": 1746649896.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mr4dqxk",
                      "author": "Madnoir",
                      "body": "Honestly I never finished TOTK or BOTW so I'm pretty excited for the huge leap in quality.",
                      "score": 1,
                      "created_utc": 1746646926.0,
                      "replies": []
                    },
                    {
                      "id": "mr4cfgv",
                      "author": "Jaerba",
                      "body": "I have the complete opposite reaction.  TotK looks so bad and aliased that I have a difficult time playing it.",
                      "score": 0,
                      "created_utc": 1746646539.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr3sne9",
                  "author": "v-komodoensis",
                  "body": "That's awful",
                  "score": 2,
                  "created_utc": 1746640812.0,
                  "replies": [
                    {
                      "id": "mr3sr59",
                      "author": "Madnoir",
                      "body": "I thought I laid on the sarcasm enough to not put a /s",
                      "score": 18,
                      "created_utc": 1746640842.0,
                      "replies": [
                        {
                          "id": "mr3wbq3",
                          "author": "TheTrueSurge",
                          "body": "Yeah I took you at face value as well, with /s it’s funny, but without it, it’s a posture lots of people truly have.",
                          "score": 3,
                          "created_utc": 1746641862.0,
                          "replies": []
                        },
                        {
                          "id": "mr3syo8",
                          "author": "v-komodoensis",
                          "body": "Oh it went right over my head lol",
                          "score": 2,
                          "created_utc": 1746640902.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr3x307",
                  "author": "None",
                  "body": "Man I’m sorry to hear that",
                  "score": 1,
                  "created_utc": 1746642081.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr69631",
              "author": "h3rpad3rp",
              "body": "I don't care if the console is powerful. I DO care if it can handle the games they release for it, because the Switch 1 couldn't. \n\nBOTW and TOTK were both great games, but man they ran like absolute shit. And that is a flagship first party Nintendo IP. Absolutely no excuse for those games to have such frame drop issues. While the environments looked nice, it isn't like they were graphically impressive. They were the only two games I bought for the switch, and the poor performance was a big part of the reason.\n\nIf I play a shiney new game on PC and my old computer can't keep up, that is just how PC is. If I play a game on a console, it damn well better run smoothly because that game was made specifically for that hardware. When the game's developer made the hardware as well, then there should be no question that it will run perfectly.",
              "score": 4,
              "created_utc": 1746668571.0,
              "replies": []
            },
            {
              "id": "mr4uqaw",
              "author": "SenpaiSwanky",
              "body": "Facts don’t matter, PC players just like to talk shit.",
              "score": 3,
              "created_utc": 1746651748.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr3rgod",
          "author": "suicidaleggroll",
          "body": "It’s a handheld.  Strap a PS5 pro to a portable monitor and UPS and toss it in a wheel barrow if you want current gen.",
          "score": 33,
          "created_utc": 1746640483.0,
          "replies": [
            {
              "id": "mr40nji",
              "author": "Shoelebubba",
              "body": "And game for all of maybe 30 minutes.",
              "score": 16,
              "created_utc": 1746643116.0,
              "replies": [
                {
                  "id": "mr41d0p",
                  "author": "suicidaleggroll",
                  "body": "\"Ma, more UPSs!\"",
                  "score": 6,
                  "created_utc": 1746643321.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr4guwg",
              "author": "kmcdow",
              "body": "I'm not an expert on these chips, but is this SOC even competitive with the Z1E/Z2E that are in competing handhelds from asus/lenovo?",
              "score": 0,
              "created_utc": 1746647823.0,
              "replies": [
                {
                  "id": "mr4vhwu",
                  "author": "m0rogfar",
                  "body": "The chips should be largely in the same ballpark.\n\nThe most noticeable difference is probably going to be that the power of the Z1E/Z2E can be adjusted up or down by the handheld manufacturer depending on the battery and cooling, so it can run better in thicker and heavier systems.\n\nNintendo seems to have gone for a thinner and lighter profile, which means that it’ll probably fall slightly short in handheld use, but has gone with the fairly novel idea that the new dock is designed to actively cool the Switch 2, so that it will likely take the lead when docked to an external display.",
                  "score": 7,
                  "created_utc": 1746651969.0,
                  "replies": [
                    {
                      "id": "mr4waad",
                      "author": "kmcdow",
                      "body": "Interesting, thanks for the information!",
                      "score": 1,
                      "created_utc": 1746652198.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mraxt6y",
                  "author": "benjoo1551",
                  "body": "I think those are quite a bit more expensive too",
                  "score": 1,
                  "created_utc": 1746734606.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr4pvqe",
          "author": "imetators",
          "body": "It almost sounds like Nintendo was always ahead of the competition with hardware.",
          "score": 3,
          "created_utc": 1746650393.0,
          "replies": []
        },
        {
          "id": "mr4lma2",
          "author": "Chrisnness",
          "body": "This is actually very modern compared to other mobile GPUs",
          "score": 1,
          "created_utc": 1746649216.0,
          "replies": []
        },
        {
          "id": "mr4wecz",
          "author": "None",
          "body": "I currently play my Switch 1 more than my Series X. What’s your point?",
          "score": 1,
          "created_utc": 1746652231.0,
          "replies": []
        },
        {
          "id": "mr3nvt6",
          "author": "CharlieandtheRed",
          "body": "Yeah, I was on the fence, but this really seals the deal -- not getting it.",
          "score": -12,
          "created_utc": 1746639486.0,
          "replies": [
            {
              "id": "mr488uh",
              "author": "impuritor",
              "body": "Can you not get it quieter?",
              "score": 3,
              "created_utc": 1746645314.0,
              "replies": [
                {
                  "id": "mr49z47",
                  "author": "CharlieandtheRed",
                  "body": "I probably could, but then I'd have to miss out on a ton of downvotes! :P",
                  "score": -2,
                  "created_utc": 1746645827.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr6bv28",
      "author": "ItsAMeAProblem",
      "body": "Well those sure are words ...",
      "score": 3,
      "created_utc": 1746669498.0,
      "replies": []
    },
    {
      "id": "mr4fjkv",
      "author": "he-tried-his-best",
      "body": "Chatting about power of a Nintendo console and ignoring the absolute bangers that Nintendo do out out time and time again.  What are you lot smoking?",
      "score": 23,
      "created_utc": 1746647446.0,
      "replies": [
        {
          "id": "mr5rqb0",
          "author": "Critical_Impact",
          "body": "That's the fundamental problem, they're the only thing I really want to play but I don't want to have to dedicate an entire console purchase just to play Zelda and Mario games.",
          "score": 7,
          "created_utc": 1746662524.0,
          "replies": [
            {
              "id": "mr932a8",
              "author": "TheMightyZan",
              "body": "I have always bought Nintendo products just for Zelda games.\n\nLuckily there are usually other games I find on sales and whatnot, so I'm not just playing one game, but damn if I don't refuse to miss out on that one title.\n\nI'm not saying it's smart, but here we are.",
              "score": 3,
              "created_utc": 1746715109.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr51pi5",
          "author": "nicman24",
          "body": "Yuzu",
          "score": 7,
          "created_utc": 1746653832.0,
          "replies": [
            {
              "id": "mr57wjv",
              "author": "HopelessRespawner",
              "body": "Ryujinx",
              "score": 3,
              "created_utc": 1746655793.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr4p7zz",
      "author": "CheesyFinster",
      "body": "Yeah…. Not surprising at all\n\nEveryone acting suprised in here must not be familiar with Nintendo or have short term memory loss from all the glazing they were doing while getting pounded by Nintendo’s new price points the past month or so",
      "score": 9,
      "created_utc": 1746650209.0,
      "replies": []
    },
    {
      "id": "mr9322f",
      "author": "Junkman120",
      "body": "Awesome. This means it can run GTA VI",
      "score": 2,
      "created_utc": 1746715107.0,
      "replies": [
        {
          "id": "mrbybaw",
          "author": "Neo_Techni",
          "body": "*IV",
          "score": 2,
          "created_utc": 1746746388.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5701o",
      "author": "ScoobiesSnacks",
      "body": "1080-1440p 60fps is a sweet spot for gaming in my opinion (especially with DLSS). 4K 60 was never going to happen and PS5 Pro can barely do this so not sure why anyone thought Switch 2 could.",
      "score": 5,
      "created_utc": 1746655498.0,
      "replies": []
    },
    {
      "id": "mr78nfe",
      "author": "Sa404",
      "body": "Just like the switch 1 once again but at steam deck price",
      "score": 3,
      "created_utc": 1746683947.0,
      "replies": [
        {
          "id": "mr7alvg",
          "author": "None",
          "body": "[removed]",
          "score": -1,
          "created_utc": 1746685065.0,
          "replies": [
            {
              "id": "mravxtt",
              "author": "albastine",
              "body": "Steam deck has 4GB more (and faster) ram and a smaller  resolution of 800p vs 1080p on the switch 2. You can only stretch not enough ram so far on a console game while on a PC game, you can change your settings.",
              "score": 2,
              "created_utc": 1746734055.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr3tp0n",
      "author": "master2873",
      "body": "$450 for 5 year old tech. It's borderline infuriating that the Switch Subreddit would shit on the Switch 1's hardware for \"showing its age\" and how it's \"under powered\" (in comparison to other consoles that aren't even mobile which is WILD to me), and now they're in the same boat again, and it's all hunky Dory to them. They would always point out how the Switch's SoC was made in 2015 like it was a bad thing even as early as 2020, but it's fine for the Switch 2 to actually be older tech than the Switch 1 on release, and charge you $150 more... It also wouldn't surprise me if Nintendo under clocks Ampere for battery life like they did with Switch 1 either.\n\nEdit: Fixed a word for clarification.",
      "score": 12,
      "created_utc": 1746641112.0,
      "replies": [
        {
          "id": "mr4uzt3",
          "author": "PSIwind",
          "body": "No, the issue is that the Switch needed a refresh a looooooong time ago and the games were showing it, even from Nintendo themselves in some cases.",
          "score": 9,
          "created_utc": 1746651824.0,
          "replies": [
            {
              "id": "mr56vah",
              "author": "master2873",
              "body": "Most of the Switch 1 issues stemmed from memory bandwidth issues, which the Switch 2 is remedying. Also, Game Freak honestly shouldn't be used as a form of judgement for hardware capability (not exactly saying you've said this). There's a lot of first party titles that look and run pretty great within reason. TotK is nothing short of a miracle it looks and runs as well as it does in comparison to BotW.\n\nI would agree though, it definitely needed a bit of a refresh, especially in the last few years, but with everything going on now with tarrifs and etc. it seems like bad timing, but nothing any of these companies are able to do about it really.",
              "score": 3,
              "created_utc": 1746655455.0,
              "replies": [
                {
                  "id": "mrfuto6",
                  "author": "PSIwind",
                  "body": "Even though it was developed by KT, I counted AoC in there. Echoes of Wisdom was another game that had issues. Paper Mario TTYD Remake, maybe it was an engine thing, but it ran at 30 FPS (Locked, but still) since they focused more on the visuals. Just a few on the top of my head. GF still should be looked at, even if Gen 10 may not look absolutely incredible, Overclocking the OG Switch to its actual factory speeds basically eliminated most FPS issues with SV so while the argument is that GF should be developing with the specs they have in mind, it does show that SV just needs a bit extra power. Not talking visuals here though, but ZA is already a pretty massive improvement in all regards",
                  "score": 2,
                  "created_utc": 1746806959.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr3xp8x",
          "author": "NO_SPACE_B4_COMMA",
          "body": "When hasn't this been the case for Nintendo systems? They've always been focused on games rather than high end hardware. If they have any more horsepower it'll drive the cost up. \n\n\nAnd who cares? The games Nintendo makes are fun. Mario games, Zelda, etc. Donkey Kong looks like a blast. \n\n\nIf you want shitty buggy games that look great, the Xbox, PS5, and PC are available. \n\n\nI got my pre-order in. I can't wait to finish totk on it, and play DK. If I want amazing graphics, I'll switch to my PC with the $1500 GPU. \n\n\nAll this whining on Reddit, and all you have to do is just not buy it if you aren't happy with it. This isn't just directed at you, but at everyone whining about price and power. ",
          "score": 25,
          "created_utc": 1746642261.0,
          "replies": [
            {
              "id": "mr5p1e0",
              "author": "TheNorthComesWithMe",
              "body": "The Wii was the first system where Nintendo wasn't competing on compute power.",
              "score": 3,
              "created_utc": 1746661590.0,
              "replies": []
            },
            {
              "id": "mr45iea",
              "author": "Endonae",
              "body": "Nintendo competed on performance up until the Wii.",
              "score": 1,
              "created_utc": 1746644512.0,
              "replies": [
                {
                  "id": "mr48ibb",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "Yes sorta, when GPUs weren't so grossly overpriced. Not so sure they really competed with other consoles, but just kept up. Different times. We didn't have 4k TVs, HDR, or 300GB games with high resolution textures, so the tech was easier. We also didn't have AI competing for GPUs, driving up costs. ",
                  "score": 3,
                  "created_utc": 1746645392.0,
                  "replies": [
                    {
                      "id": "mr6d5dc",
                      "author": "sali_nyoro-n",
                      "body": "The GameCube's hardware specs absolutely _smoked_ the PS2's and the hardware was ready to launch in 2000 (but they had no games so they had to wait until 2001). In fact, in many regards the GameCube's hardware can hold up to the original Xbox (better CPU performance, slightly more raw polygon performance), and while it lacks a true shader system, it has a pseudo-programmable system known as \"TEV\" (Texture EnVironment unit) that performs a very similar function. \n\nThis is how the GameCube and later Wii could run almost their entire libraries in 480p, often at 60 FPS, and part of why GameCube games looked really damn good for their time even next to the likes of Halo 2 and Doom 3 running on the original Xbox.",
                      "score": 2,
                      "created_utc": 1746669947.0,
                      "replies": []
                    },
                    {
                      "id": "mr4bi3z",
                      "author": "PM_ME_STEAM_KEY_PLZ",
                      "body": "You Have a 5090?",
                      "score": -1,
                      "created_utc": 1746646266.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr48x2x",
                  "author": "impuritor",
                  "body": "So you have to go back twenty years. Seems to me that their business model changed a long time ago.",
                  "score": 1,
                  "created_utc": 1746645513.0,
                  "replies": [
                    {
                      "id": "mr503mn",
                      "author": "Endonae",
                      "body": "I guess it has been a long time.",
                      "score": 1,
                      "created_utc": 1746653337.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr7gebn",
                  "author": "Phoenix__Light",
                  "body": "20 years might as well be eons ago for tech companies though",
                  "score": 0,
                  "created_utc": 1746688515.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr50vro",
              "author": "nicman24",
              "body": "I don't get that myth. All Nintendo consoles except the Wii, pushed some new tech - even the Wii arguably with ir cams in the controllers.\n\nThe switch 2 has nothing new and honestly I hope it does a Wii U.",
              "score": 1,
              "created_utc": 1746653577.0,
              "replies": [
                {
                  "id": "mr52jww",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "I mean, so far it isn't pulling a WiiU. It's following the legacy of the switch 1, which people loved. \n\n\nBut honestly, if you don't think it's worth it, why do you care?",
                  "score": 2,
                  "created_utc": 1746654092.0,
                  "replies": [
                    {
                      "id": "mr6xofu",
                      "author": "nicman24",
                      "body": "Wii u had the streaming thing switch I liked",
                      "score": -1,
                      "created_utc": 1746678243.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr6c7nq",
                  "author": "sali_nyoro-n",
                  "body": "\"New tech\" for Nintendo post-GameCube was always something gimmicky and \"innovative\" rather than high-end, though. The Wii had an overclocked GameCube CPU with a modestly-improved GPU, the Wii U was _three_ GameCube CPUs on one die overclocked even further with a mid-range PC graphics card from like 2010 shoved in it and the Switch was a Tegra X1 gaming tablet. But the Wii had its motion controls, the Wii U had its second-screen gimmick and the Switch had the Joy-Cons.",
                  "score": 1,
                  "created_utc": 1746669621.0,
                  "replies": [
                    {
                      "id": "mraykff",
                      "author": "nicman24",
                      "body": "Nah the switch had the dock",
                      "score": 1,
                      "created_utc": 1746734833.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr4dz9n",
              "author": "master2873",
              "body": ">When hasn't this been the case for Nintendo systems? They've always been focused on games rather than high end hardware. If they have any more horsepower it'll drive the cost up. \n\nThat's point I was making even. I always thought people were too harsh on the Switch 1. They were also known for affordability, and decided that wasn't going to be a thing anymore, and decide to charge even more for 5 year old tech, and charge MUCH more for their own games. $80 for Mario Kart is just dumb. Now we also have this weird game key card BS with third party games (at least most of them) that's also invalidating the huge amount of physical sales of Switch games, and the plug an play aspect of their games that is VERY absent with the other platforms. This is also assuming that people who are buying these products have reliable access to Internet with good speeds, which even in the US, we still have areas without reliable internet.\n\nThe whole point of having affordable gaming products is for more people to get into it, and more people can buy them which equals more sources of money. I also understand that Nintendo isn't the only one who has raised prices, but just mean this overall. I would love to see the cost per unit on their hardware myself.\n\nEdit: Yes down vote something sensible. \"Just don't buy it\" has to be the most flawed logic imaginable. Most people who are talking about it WANT to buy it, but can't afford it! Not to mention, action like this never lead to anything with a company like this who is arrogant. WiiU and Virtual Boy flopped because no one actually wanted them, or was marketed extremely poorly.",
              "score": -2,
              "created_utc": 1746646994.0,
              "replies": [
                {
                  "id": "mr4sjqs",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "I think this response makes sense 👍",
                  "score": 0,
                  "created_utc": 1746651145.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "msim4vy",
              "author": "humanzrdoomd",
              "body": "Why are you riding Nintendo's dick",
              "score": 0,
              "created_utc": 1747342953.0,
              "replies": [
                {
                  "id": "msjixrq",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "What are you, 12? I've grown up with Nintendo, since the NES. Yes, I like Nintendo. No, I don't approve of some of the things they do. Nothing I said is \"riding nintendo's dick\". \n\nOnce you grow up, you'll learn that hating things because other people hate it is boring. Just play what you like. I'm mostly a PC gamer. I play my switch about 30 hours a year, if that. \n\nStop following what everyone else cries about and raging about non-sense that has no affect on your life. If you don't like Nintendo, don't buy it. I don't like the shit Apple does, so I don't buy their shit. \n\nNow move along, you've responded to an 8 day old post.",
                  "score": 1,
                  "created_utc": 1747353975.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr4abr7",
              "author": "Sick_Wave_",
              "body": "There was one time when they focused on high end tech, when they required the RAM expansion pack for the 3D Donkey Kong game. It must not have sold well.",
              "score": -3,
              "created_utc": 1746645928.0,
              "replies": [
                {
                  "id": "mr52pmj",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "The N64? It was required for a few games.",
                  "score": 1,
                  "created_utc": 1746654141.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr583n0",
              "author": "haarschmuck",
              "body": "> The games Nintendo makes are fun.\n\nMario Kart, a game I would pay $20-30 for, is releasing at 80 fucking dollars.",
              "score": -3,
              "created_utc": 1746655857.0,
              "replies": [
                {
                  "id": "mr59ln2",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "Or, $50 if you buy the bundle. But if you aren't willing to pay more than $30 for, that's fine, because others are. I've been rocking Mario Kart since launch day on the SNES. I make plenty of money so $80 isn't an issue for me. Or better yet, I preordered the bundle so it's only $50.",
                  "score": 5,
                  "created_utc": 1746656357.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr6d9ak",
          "author": "None",
          "body": "[removed]",
          "score": 0,
          "created_utc": 1746669986.0,
          "replies": [
            {
              "id": "mr6my4e",
              "author": "master2873",
              "body": "People who make a comment about something that everyone does for a specific reason, and doesn't add to the conversation at all, other than be rude for no good reason \"are annoying ASF\".\n\nIt's called transparency since you can't see edit history of the comment, and I bet you would be the same person to claim someone is trying to hide something via an edit if they didn't do this either.\n\nEdit: Did this to annoy you.\n\nEdit 2: This is funny now. Thanks for me being in your head rent free.\n\nEdited, Edit: Edited my edit, because it needed pointless editing.",
              "score": 0,
              "created_utc": 1746673628.0,
              "replies": [
                {
                  "id": "mr6y5lz",
                  "author": "Kitchen-Category-138",
                  "body": "Lol, you're so mad.",
                  "score": 1,
                  "created_utc": 1746678465.0,
                  "replies": [
                    {
                      "id": "mr76nab",
                      "author": "master2873",
                      "body": ">Lol, you're so mad.\n\nIt's funny you think that if you saw my comment with the pointless edits. I was actually kinda hoping you would find it a bit humorous for how dumb and over the top it was lol.",
                      "score": 0,
                      "created_utc": 1746682834.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr4ow9f",
      "author": "ScoobiesSnacks",
      "body": "Can someone ELI5? Is this good or bad? I would assume it’s PS4 Pro/Series S level of graphics?",
      "score": 2,
      "created_utc": 1746650120.0,
      "replies": [
        {
          "id": "mr5zohe",
          "author": "Asgard033",
          "body": "The GPU is better than a PS4, worse than a Series S. Compared to smartphone chips, it's in about the same ballpark as a Snapdragon 8 Gen 3's GPU\n\nhttps://youtu.be/3pr_V8rtzrE&t=602\n\nThe CPU is pretty poor, but still better than PS4\n\nhttps://youtu.be/3pr_V8rtzrE&t=961",
          "score": 6,
          "created_utc": 1746665343.0,
          "replies": []
        },
        {
          "id": "mr53w40",
          "author": "submerging",
          "body": "Worse. PS4.",
          "score": -2,
          "created_utc": 1746654507.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5jhnc",
      "author": "Cakeking7878",
      "body": "I think people forget how lacking the switch 1 specs where on release. And yet it didn’t matter because Nintendo forced game companies to optimize and it worked. Some switch games where really running at the edge of what the switch 1 could do (totk) and I’m excited to see what they’ll do with the switch 2",
      "score": 2,
      "created_utc": 1746659730.0,
      "replies": []
    },
    {
      "id": "mr6tj3l",
      "author": "I_pee_in_shower",
      "body": "Honestly if there is a fast emulator I might skip the gadget all together this time. I don’t think I’d worth buying a console to play 3-5 games over 5 years.",
      "score": 2,
      "created_utc": 1746676367.0,
      "replies": []
    },
    {
      "id": "mr44vf6",
      "author": "MrDaebak",
      "body": "If I want real high quality graphics, I'll use my gaming PC. I dont care if the Switch 2 is only a little bit better. What I want is MY FREAKING FIRE EMBLEM GAME ON THE SWITCH 2. Nintendo should announce it already. Its driving me nuts.",
      "score": 2,
      "created_utc": 1746644328.0,
      "replies": [
        {
          "id": "mr53s4p",
          "author": "gizmo998",
          "body": "It’s been like 20 days. Calm the fuck.",
          "score": 7,
          "created_utc": 1746654472.0,
          "replies": [
            {
              "id": "mr5mb53",
              "author": "SkuloftheLEECH",
              "body": "i will perish if they do not announce fire emblem by the 15th of may",
              "score": 9,
              "created_utc": 1746660667.0,
              "replies": []
            },
            {
              "id": "mr7ipll",
              "author": "MrDaebak",
              "body": "20 days for you, way more days since the last released FE game",
              "score": 1,
              "created_utc": 1746689967.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mrbvh4h",
          "author": "Talkycoder",
          "body": "It's not about wanting high-end graphics; it's about wanting smooth performance. That shouldn't mean third-party titles should look like Wii games, though.\n\nPress the ability button in Tears of the Kingdom, and the game becomes a slideshow... and that's a first-party game.\n\nBetter yet, play any Pokemon game. Look at how Pokemon Legends currently looks no different.",
          "score": 0,
          "created_utc": 1746745385.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr3okus",
      "author": "DRazzyo",
      "body": "'1050 Ti levels, with DLSS'\n\nWe're legit in the PS4 base performance territory.\n\nOk, unlike PS4, it has upscaling, but that is just abysmal for a 400-500 dollar console.",
      "score": -5,
      "created_utc": 1746639680.0,
      "replies": [
        {
          "id": "mr3tyln",
          "author": "DigitallyDetained",
          "body": "A PS4 also isn’t handheld. They have the laws of physics to contend with, and also have a battery last more than six minutes.",
          "score": 53,
          "created_utc": 1746641189.0,
          "replies": [
            {
              "id": "mr3uqet",
              "author": "DRazzyo",
              "body": "Most handheld PCs easily match this level of performance, even going as 2-3 years back.\nIf this released 3 years ago, then fine. But this doesn’t bode well for 3rd party games even a few years from now.",
              "score": -28,
              "created_utc": 1746641409.0,
              "replies": [
                {
                  "id": "mr46434",
                  "author": "Optimus_Prime_Day",
                  "body": "Most pc handheld cost double what this costs, even today.",
                  "score": 49,
                  "created_utc": 1746644689.0,
                  "replies": [
                    {
                      "id": "mr49ghh",
                      "author": "DRazzyo",
                      "body": "Right now, a Steamdeck will most likely match the handheld performance of a Switch 2, except it's 3 years old and had models that were cheaper than the Switch 2.  \nROG Ally, exact same thing\n\nPS4 tier performance for both devices, except they're 2-3 years old and cost less or the same as a Switch 2",
                      "score": -30,
                      "created_utc": 1746645672.0,
                      "replies": [
                        {
                          "id": "mr4flmu",
                          "author": "Optimus_Prime_Day",
                          "body": "Ugh, the steam deck gpu is equivalent to a gtx1050. It costs the same as a switch 2 and is weaker. You're making up facts and trying to convince yourself that you're right, but you aren't.",
                          "score": 27,
                          "created_utc": 1746647462.0,
                          "replies": [
                            {
                              "id": "mr51h3t",
                              "author": "nicman24",
                              "body": "That ti stands for like 10% more my dude.\n\nAlso you cannot content with steam.\n\nGaben protects.",
                              "score": -14,
                              "created_utc": 1746653760.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr3xv94",
                  "author": "NO_SPACE_B4_COMMA",
                  "body": "How much are those handheld PCs in comparison? I'm just curious. ",
                  "score": 15,
                  "created_utc": 1746642310.0,
                  "replies": [
                    {
                      "id": "mr3z4pa",
                      "author": "CactusCustard",
                      "body": "A couple hundred more expensive lol",
                      "score": 28,
                      "created_utc": 1746642673.0,
                      "replies": [
                        {
                          "id": "mr436c3",
                          "author": "NO_SPACE_B4_COMMA",
                          "body": "Yep! That's why Nintendo isn't using the latest greatest, lol. Imagine the whining if they did get a faster GPU? Everyone crying about the current price, geez this would be ten times worse lol",
                          "score": 9,
                          "created_utc": 1746643842.0,
                          "replies": []
                        },
                        {
                          "id": "mr49t2b",
                          "author": "DRazzyo",
                          "body": "No.\n\nBase Steamdeck is in line with performance of a PS4 (at a much lesser price than a Switch 2, 3 years ago), as is the ROG Ally Z1X, which is slightly pricier, but only at around 500\\~ and that's with much more built in memory.\n\nSo, a 2-3 year old handhelds, at the same price as the Switch 2.",
                          "score": -2,
                          "created_utc": 1746645777.0,
                          "replies": [
                            {
                              "id": "mr53n19",
                              "author": "submerging",
                              "body": "The rog ally (non-X version) also has garbage battery and fries SD cards",
                              "score": 7,
                              "created_utc": 1746654428.0,
                              "replies": []
                            },
                            {
                              "id": "mr5qa1f",
                              "author": "DOndus",
                              "body": "The Switch 2 can also be docked for basically double or more of the performance",
                              "score": 2,
                              "created_utc": 1746662016.0,
                              "replies": []
                            },
                            {
                              "id": "mrfwd91",
                              "author": "PSIwind",
                              "body": "You don't factor in that Steam Deck games go through a Linux wrapper and these are still PC games, so while you can tinker with settings, they aren't developing these ports with the Deck in mind, they're using multiple rigs and can't factor in every difference in specs. Switch 2 has multiple optimization features for developers, documentation, and they only need to port/develop for one system in mind. Also, comparing the chipset to a 1050 Ti off of just numbers is ridiculous because of how many factors there are to make things better. They even say this at the end of the video that the numbers dont actually mean much with direct comparisons.",
                              "score": 1,
                              "created_utc": 1746807436.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr51k05",
                      "author": "nicman24",
                      "body": "I got my steam deck for 350",
                      "score": -1,
                      "created_utc": 1746653785.0,
                      "replies": [
                        {
                          "id": "mr527vg",
                          "author": "NO_SPACE_B4_COMMA",
                          "body": "And steam deck is slower: https://store.steampowered.com/steamdeck/",
                          "score": 11,
                          "created_utc": 1746653989.0,
                          "replies": [
                            {
                              "id": "mr6xrj9",
                              "author": "nicman24",
                              "body": "By around 20 percent. It released 3 years ago.",
                              "score": 1,
                              "created_utc": 1746678284.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr45ad6",
                  "author": "PineapplePizza99",
                  "body": "No shit Sherlock! They cost almost double the Switch 2 too!",
                  "score": 6,
                  "created_utc": 1746644448.0,
                  "replies": [
                    {
                      "id": "mr48z2h",
                      "author": "DRazzyo",
                      "body": "No, they don't. Right now, a Steamdeck will most likely match the handheld performance of a Switch 2, except it's 3 years old and had models that were cheaper than the Switch 2.\n\nSteamdeck has the equivalent power of a base PS4.\n\nSo yeah. Moot point.",
                      "score": 2,
                      "created_utc": 1746645530.0,
                      "replies": [
                        {
                          "id": "mr5674o",
                          "author": "Dt2_0",
                          "body": "You must have unrealistically high expectations of the Steam Deck's performance. It's based on a Zen 2 APU. Only the cheapest Steam Decks are cheaper than the Switch 2, and are a few graphics generations behind as well.\n\nNot to mention that unlike AMD (outside of their most recent GPUS, which I rate as passable), Nvidia actually can upscale at reasonable levels of quality.",
                          "score": 9,
                          "created_utc": 1746655239.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr3weqz",
                  "author": "DDFoster96",
                  "body": "Nintendo Fanboyz don't know what a PC handheld is. ",
                  "score": -13,
                  "created_utc": 1746641886.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr3x0ji",
          "author": "Tenshizanshi",
          "body": "It's also a handheld. Good luck taking your PS4 and monitor on a trip",
          "score": 17,
          "created_utc": 1746642062.0,
          "replies": [
            {
              "id": "mr6avsq",
              "author": "sali_nyoro-n",
              "body": "To be fair to the PS4, if you built one on current process nodes, you _could_ conceivably get it down to the same 45W TDP as the Switch 2 is expected to run at given that the PS4 Slim from 2016 has a 165W PSU and the unit itself runs at 80-120W in gameplay typically with brief spikes to 140W or so.",
              "score": 0,
              "created_utc": 1746669161.0,
              "replies": []
            },
            {
              "id": "mr5rpqb",
              "author": "jerryfappington",
              "body": "The PS4 is over a decade old… this isn’t the dig you think it is. The weird nintendo fanboys defending this stuff is really weird.",
              "score": -5,
              "created_utc": 1746662519.0,
              "replies": [
                {
                  "id": "mr5s385",
                  "author": "Tenshizanshi",
                  "body": "Stay angry, it'll be the best seller every Nintendo console is because it's amazing",
                  "score": 2,
                  "created_utc": 1746662652.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr3ts58",
          "author": "TheBoBiZzLe",
          "body": "Yet on point for a handheld.  Steam deck, all those window handhelds, ect.  \n\nGames will focus on DLSS so get ready for a muddy 10 years :) outside of the expensive first party games.\n\nExpect pokemon will still look like poo",
          "score": 8,
          "created_utc": 1746641138.0,
          "replies": [
            {
              "id": "mr6b1tf",
              "author": "sali_nyoro-n",
              "body": "> Expect pokemon will still look like poo\n\nAnd run like a three-legged horse, because you could give Game Freak an honest-to-god supercomputer and they'd still choke it with their terrible code.",
              "score": 2,
              "created_utc": 1746669219.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr5q08x",
          "author": "DOndus",
          "body": "Yeah but it’s not 1 to 1. It has the benefits of modern chipsets despite running around that same power in handheld. In docked it’s gonna push a lot more. It’s got more ram and faster storage. So despite being similar to ps4 a game like Cyberpunk for example can actually be playable with the expansions that ps4 couldn’t. FF7 remake is a downscaled port of the ps5 verison. And in the case of street fighter 6, it actually looks better than the Series S version thanks to DLSS.\n\nBut overall I think it would have been slightly more impressive had it released a year or 2 earlier like it was allegedly supposed to.",
          "score": 1,
          "created_utc": 1746661921.0,
          "replies": []
        },
        {
          "id": "mr513f3",
          "author": "nicman24",
          "body": "That is legit steam deck territory",
          "score": -2,
          "created_utc": 1746653642.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr40xxz",
      "author": "None",
      "body": "![gif](giphy|km2mais9qzYI)",
      "score": 2,
      "created_utc": 1746643200.0,
      "replies": []
    },
    {
      "id": "mr5homm",
      "author": "greengiant333",
      "body": "Is this good? Is this bad?",
      "score": 1,
      "created_utc": 1746659111.0,
      "replies": [
        {
          "id": "mr5l9yf",
          "author": "Almawt",
          "body": "It doesn’t quite have the same power as last gen consoles and is absolutely destroyed by current gen consoles in terms of power, but it is pretty good for what it offers as a handheld portable console with a bit more power than base steam deck",
          "score": 8,
          "created_utc": 1746660326.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5niqb",
      "author": "NTRedmage",
      "body": "So...a bit more cuda cores than a 1660 super, but less than a GTX 1070. Not really all that impressed, even moreso that it's probably very low clocked for power saving.",
      "score": 1,
      "created_utc": 1746661074.0,
      "replies": []
    },
    {
      "id": "mr6m2nu",
      "author": "A_Dragon",
      "body": "Is that good?",
      "score": 1,
      "created_utc": 1746673274.0,
      "replies": []
    },
    {
      "id": "mr87a4c",
      "author": "gofreaksgo",
      "body": "Oh hell yeah!",
      "score": 1,
      "created_utc": 1746703989.0,
      "replies": []
    },
    {
      "id": "mr8eyvn",
      "author": "None",
      "body": "So does this mean fallout and a better version of skyrim?",
      "score": 1,
      "created_utc": 1746707112.0,
      "replies": []
    },
    {
      "id": "mr8xck8",
      "author": "UrDeAdPuPpYbOnEr",
      "body": "Is it going to be able to run things like call of duty and gta5?",
      "score": 1,
      "created_utc": 1746713398.0,
      "replies": []
    },
    {
      "id": "mrpql3z",
      "author": "gitg0od",
      "body": "\"2021\" this switch 2 is already a relic, and it will be the nintendo console for next seven years.... wow, going to drag down games technically so hard, i'm talking about third party studios games.... i hope they will boycott it.",
      "score": 1,
      "created_utc": 1746948071.0,
      "replies": []
    },
    {
      "id": "mr51qhm",
      "author": "PKblaze",
      "body": "Wow... that's underwhelming.   \nGuess I was right to pick up a steam deck lol",
      "score": -1,
      "created_utc": 1746653840.0,
      "replies": []
    },
    {
      "id": "mr3y8xa",
      "author": "grumble11",
      "body": "That honestly is pretty weak. I know it’s a mobile handset but I wish they had gone one or two generations newer, this thing will show its age.",
      "score": 0,
      "created_utc": 1746642419.0,
      "replies": []
    },
    {
      "id": "mr6edqm",
      "author": "sali_nyoro-n",
      "body": "This would've been a pretty decent console if it released this time in 2023, but it's definitely behind the curve this late. Ampere is five year old technology already and the GPU isn't even RTX 3050 Mobile level. GTX 1050 Ti performance docked puts it somewhere between the original PS4 and the PS4 Pro. \n\n_GTX 750 Ti_ performance in handheld sounds like it might be worse than even the Steam Deck, which... ouch. Again, would've been fine in 2023, but launching at the price it is in 2025, that's not great. Feels like the hardware's best years are already behind it, which lends credence to those delay rumours.",
      "score": 0,
      "created_utc": 1746670385.0,
      "replies": [
        {
          "id": "mr6iqpj",
          "author": "geminijono",
          "body": "This is the essence of Gunpei Yokoi’s philosophy of Lateral Thinking with Withered Technology. He created the Gameboy with old tech and it sold like hotcakes, unlike Xboxes that sell at a loss (historically). Same principle applies here. If Switch 2 can give a steady 30-60fps with intense games, or have performance and graphical modes, this is fantastic for them, even with tariffs baked into the pricing",
          "score": 7,
          "created_utc": 1746671986.0,
          "replies": []
        },
        {
          "id": "mr6ha06",
          "author": "Realistic-Nature9083",
          "body": "Maybe Nintendo will release a pro version in 2 years?",
          "score": 1,
          "created_utc": 1746671443.0,
          "replies": [
            {
              "id": "mr7aox2",
              "author": "None",
              "body": "[removed]",
              "score": 1,
              "created_utc": 1746685114.0,
              "replies": [
                {
                  "id": "mr8k1s2",
                  "author": "Realistic-Nature9083",
                  "body": "I think this time it could be different.",
                  "score": 1,
                  "created_utc": 1746708997.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr6krm6",
      "author": "Xece08",
      "body": "Sigh... Another generation of switch holding back multiplatform games.",
      "score": 1,
      "created_utc": 1746672762.0,
      "replies": []
    },
    {
      "id": "mr3vumi",
      "author": "TheBoBiZzLe",
      "body": "I’ll double down on what I thought before.  They need to make a doc/external GPU.  Handheld can run off itself and comes with a standard dock.  Switch pro dock can be like $500 and have a 5060ti equivalent. \n\nCut all this tip toeing.",
      "score": -7,
      "created_utc": 1746641726.0,
      "replies": [
        {
          "id": "mr4bgv8",
          "author": "mschuster91",
          "body": ">They need to make a doc/external GPU\n\nThat involves USB-4 aka Thunderbolt. PCI Express over USB-C if you want. Works, but the chips and cables required to pull that off are *expensive*. And so is signal routing. At the point you want to resort to this... you might just want to buy a PS5.\n\nWhat I wouldn't oppose is a revival of the Gamecube. Basically the same support for games and controllers the Switch has, just with (way) more GPU horsepower and more storage. The only thing that such a thing can't play is anything using the touchscreen.",
          "score": 12,
          "created_utc": 1746646256.0,
          "replies": [
            {
              "id": "mr56mot",
              "author": "Dt2_0",
              "body": "Honestly, I feel like I have been the only one screaming for a Switch Console Only model.\n\nLike seriously, ship the hardware in a nondescript box with just power in and HDMI out, maybe a USB Port or so, a cart port, and a Pro Controller. I'd buy that thing day one.",
              "score": 4,
              "created_utc": 1746655378.0,
              "replies": []
            },
            {
              "id": "mr557l8",
              "author": "jayzz911",
              "body": "This just isnt gonna happen, not because i dont think it should, i would pre-order an 800 euro gamecube tomorrow but because every time nintendo tries to compete on the power of consoles they straight up lose. The snes is the last time this wasnt true.\n\nThe n64 cpu clocked 3 times the speed of the ps1, had double to quadruple the ram but got out innovated on the disc v cartride. \n\nGamecube time comes around, again a more powerfull console but loses due to being out innovated again with the dvd and dvd player functionality of the ps2. \n\nThey took the lesson learned here and made the Wii, a less powerfull console (the cell processor on the ps3 stomped it pretty severely and won the generation because they out inovated the competiton. Wiiu is a nightmare on all fronts. switch comes out, this thing has 3 gigs of ram and is about as powerful as a mobile phone from a few years prior. Still wins it's generation. Now i doubt the switch 2 is going to do anywhere near as well, for some reason they thought the eyetoy was gonna be a defining feature (like not even kinect which was impressive but the fucking eyetoy).\nBut the lesson for Nintendo seems pretty solidfied as doing our own thing is a better way to go.\n\n(this all is of course heavily speculated by me as I am not the famous John Nintendo, owner of Nintendo)",
              "score": 1,
              "created_utc": 1746654924.0,
              "replies": []
            },
            {
              "id": "mr4es3j",
              "author": "TheBoBiZzLe",
              "body": "Whelp.  Time to for Nintendo to invent a new connection type :)\n\nLol imagine the chips that connect the joycons had that type of connection.  So when you plug your device into the dock you have to take off the joycons and put two connections on.  Ultimate “jacking in!” Feel.",
              "score": -1,
              "created_utc": 1746647226.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr3y4b9",
          "author": "NO_SPACE_B4_COMMA",
          "body": "I 10000% agree with this. Optional upgraded dock to increase fps and graphic quality. ",
          "score": 2,
          "created_utc": 1746642382.0,
          "replies": []
        },
        {
          "id": "mr41r0r",
          "author": "hardy_83",
          "body": "Not a bad idea. I mean 5060 is a bit much but if this device is the equivalent to a 1050ti, then a docked GPU equivalent to, say, a mobile 4060, 4050 or something.\n\nIf it was a 5060ti, Nintendo would probably charge over 1k. lol",
          "score": -2,
          "created_utc": 1746643432.0,
          "replies": [
            {
              "id": "mr4euze",
              "author": "ChucklesInDarwinism",
              "body": "It's equivalent to 1050ti if docked. if not it's around 750ti, as per the article. Even a 3070 docked would be huge.",
              "score": 1,
              "created_utc": 1746647250.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr58rqt",
      "author": "Slacker_75",
      "body": "Overpriced underpowered junk",
      "score": 1,
      "created_utc": 1746656080.0,
      "replies": []
    },
    {
      "id": "mr3rt9m",
      "author": "None",
      "body": "[deleted]",
      "score": -11,
      "created_utc": 1746640578.0,
      "replies": [
        {
          "id": "mr4bc6k",
          "author": "Sick_Wave_",
          "body": "This comment is.\n\n![gif](giphy|Le5BxgkiTShtS)",
          "score": 10,
          "created_utc": 1746646219.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5knw0",
      "author": "banecroft",
      "body": "Look at how cyperpunk look on the console, it’s fantastic. This is a none issue",
      "score": -2,
      "created_utc": 1746660122.0,
      "replies": []
    },
    {
      "id": "mr3xato",
      "author": "B16B0SS",
      "body": "how does this compare to other non-gigantic handhelds like the retroid pocket 5?  I'm not interested in a steam deck due to its heft although I do see that the switch 2 is large, but it doesn't seem as thick or heavy",
      "score": 0,
      "created_utc": 1746642145.0,
      "replies": [
        {
          "id": "mr4pdfu",
          "author": "None",
          "body": "Switch 2 is the same thickness as the Switch 1. So it’ll be a larger but still just as thin handheld.\n\nIt is heavier than a Switch, but lighter than a Steamdeck.",
          "score": 2,
          "created_utc": 1746650251.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr3owpb",
      "author": "pewbdo",
      "body": "Just looked up the # of cuda cores in my 5080 for reference. Kinda wish I didn't because God damn 1536 ain't shit.",
      "score": -15,
      "created_utc": 1746639770.0,
      "replies": []
    },
    {
      "id": "mr805cz",
      "author": "ThisIsntOkayokay",
      "body": "Not buying.",
      "score": -1,
      "created_utc": 1746700649.0,
      "replies": []
    },
    {
      "id": "mr3p4vu",
      "author": "None",
      "body": "[deleted]",
      "score": -17,
      "created_utc": 1746639834.0,
      "replies": [
        {
          "id": "mr3y0cr",
          "author": "NO_SPACE_B4_COMMA",
          "body": "How much do those PC handhelds cost in comparison?",
          "score": 12,
          "created_utc": 1746642351.0,
          "replies": []
        },
        {
          "id": "mr46b91",
          "author": "iGappedYou",
          "body": "Any console manufacturer is a ripoff merchant.",
          "score": 2,
          "created_utc": 1746644748.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr9d2h9",
      "author": "hidazfx",
      "body": "I'm really not sure why people are complaining here about graphics and \"I don't expect it to keep up\". The Switch 1 still runs quite a few of the best titles on that platform, which look great for how small it is. And it's from 2017 and definitely started development earlier than that.\n\nNintendo clearly isn't prioritizing top level fidelity and raw horsepower anymore. They're prioritizing an experience, something only they can offer. I personally still think games like Mario Kart, BotW, and Portal 2 look great to this day. Yeah, they're no Cyberpunk but they don't look terrible at all.",
      "score": 0,
      "created_utc": 1746718047.0,
      "replies": [
        {
          "id": "mrasw8k",
          "author": "albastine",
          "body": "The specs of the switch 2 are cool for now but what happens when the next gen comes out?\n\nPeople are pretending Switch 2 is a current gen console. \n\nIt is not.\n\nIt's an early Next Gen console. \n\nNintendo sat on the Switch 2 for YEARS just so the C-Suite could chase the \"Most consoles Sold\" trophy. Sucks for anyone that bought a switch within the last few months or got one for Christmas and were not \"in the know.\"\n\nNow the real problem happens when next gen comes out ( one or two years from now) and the consoles can actually handle a mature UE5 game using RDNA4/5. Meanwhile, Nintendo will be on 3 generations old tech that can barely run the raytracing demands of a future title with its 12 RT Cores.\n\nLet's put it this way. When Nintendo cheaps out on hardware, you get 1st party titles that look like Pokemon. Nintendo use to be known for their highly optimized high performance titles. Now, everyone just settles for playable from them. Dropped frames be damned. \n\nThe real question is will the Switch 2 be viable when it hits near end of life around 2031 (2033 if Nintendo keeps the 8 year cadence instead of the six year console release)? \n\nThey had an excuse when they released the switch because the Wii U bombed so hard they were turtling up and being cautious. Why are they being cheap now after the meteoric success of the switch? They are shooting themselves in the foot for no reason outside of \"fans will buy it regardless.\"\n\nEdit: Nintendo hasn't prioritized graphics since the GameCube. Also forgot to mention Nintendo cheapest out on RAM with the switch 2 only having 12GB of shared RAM which will age very poorly.",
          "score": 1,
          "created_utc": 1746733160.0,
          "replies": [
            {
              "id": "mraxc4z",
              "author": "hidazfx",
              "body": "Developers will continue to optimize their games for the Switch 2, just as they have managed with the Switch 1 (whether or not they were initially optimized on release is up for debate though). I really don't see any switch games utilizing any sort of ray tracing at all, or at least not the full fat thing. How many gamers actually only game with RTX or equivalent on in every game? I can't imagine it's many. I never did when I had my 3080, and I still don't with my 6950XT.\n\nYes the switch 2 will be less powerful than an Xbox or PS5, but that's fine. It's not a speed machine. Nintendo will use it to sell Mario, Zelda and Pokemon just as they always have.",
              "score": 1,
              "created_utc": 1746734467.0,
              "replies": [
                {
                  "id": "mrb6o9r",
                  "author": "albastine",
                  "body": "You are missing the point. You keep on comparing the switch 2 to PS5/Xbox Series. It will be far less powerful than the ps6/next Xbox.  Games are now starting to make RT mandatory.\n\nYou can only optimize so much. The Storage being severely slower, lack of AI, the RAM being 12GB instead of 16GB minimum, Ampere instead of least Lovelace, the overall mediocre specs for 2025, it all leads to poor optimization down the line. You think the 3050 level of power will last even with God tier optimization till 2031?\n\nThen again what's the point of arguing with \"it doesn't matter, people will buy it\" in a debate on whether the Switch 2's specs will age well.  People will deal with Pokemon level of optimization.",
                  "score": 1,
                  "created_utc": 1746737215.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mr6gp2w",
      "author": "tastefuleuphemism",
      "body": "For what? Mario? Nintendo needs better games!",
      "score": -3,
      "created_utc": 1746671228.0,
      "replies": [
        {
          "id": "mr71264",
          "author": "None",
          "body": "of all the companies, you're saying nintendo needs better games?",
          "score": 7,
          "created_utc": 1746679873.0,
          "replies": []
        },
        {
          "id": "mr72joy",
          "author": "dmillibeats",
          "body": "You buy a PlayStation or pc for dope games. You buy Nintendo to play fun games",
          "score": 2,
          "created_utc": 1746680637.0,
          "replies": [
            {
              "id": "munf8nn",
              "author": "sammyfrosh",
              "body": "You buy Nintendo to play baby games.",
              "score": 0,
              "created_utc": 1748409884.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mr5ffkl",
      "author": "None",
      "body": "Absolute Garbage!! When can I buy one!!",
      "score": -3,
      "created_utc": 1746658338.0,
      "replies": []
    }
  ]
}