{
  "post": {
    "title": "Sonos and Ikea are ending their partnership | The companies are winding down their Symfonisk lineup after years of collaboration. No further products are planned.",
    "author": "chrisdh79",
    "id": "1kgxzif",
    "score": 581,
    "created_utc": 1746626176.0,
    "selftext": "",
    "num_comments": 112,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kgxzif/sonos_and_ikea_are_ending_their_partnership_the/"
  },
  "comments": [
    {
      "id": "mr39hkt",
      "author": "HopelessMelancholy",
      "body": "Everything I've heard about Sonos seems to be them burning bridges with customers and/or partner companies. How are they still relevant?",
      "score": 263,
      "created_utc": 1746635378.0,
      "replies": [
        {
          "id": "mr3z1pl",
          "author": "diamondintherimond",
          "body": "What happens when many companies go public: enshitification. \n\nI remember the day they announced their intention to IPO and thinking it was the beginning of the end.",
          "score": 134,
          "created_utc": 1746642649.0,
          "replies": [
            {
              "id": "mr49psn",
              "author": "None",
              "body": "\\*ALWAYS\\* is.",
              "score": 32,
              "created_utc": 1746645751.0,
              "replies": []
            },
            {
              "id": "mra53xg",
              "author": "parisidiot",
              "body": "idk my friend has had sonos through multiple versions for like 10 years and it always seemed significantly worse to me than networked amps. the app has always sucked, it is just even worse now. there have always been really weird connection issues that are difficult to diagnose and fix.\n\nwe have them at work and they're constantly dropping out and being strange.",
              "score": 6,
              "created_utc": 1746726192.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr3bgqr",
          "author": "TypicalDelay",
          "body": "For the average user their product works well. I bought my soundbar and subwoofer two years ago plugged them in and set up the app. \n\nHaven’t opened the app or though about it since really - it just works with my tv and occasionally I play Spotify on it",
          "score": 29,
          "created_utc": 1746635960.0,
          "replies": [
            {
              "id": "mr82h58",
              "author": "Emergency_Hawk_6947",
              "body": "Same. Although my system is close to 4 years old now I still love it.",
              "score": 3,
              "created_utc": 1746701798.0,
              "replies": []
            },
            {
              "id": "mr5tc11",
              "author": "pattymcfly",
              "body": "Then you way over paid. A regular soundbar would do that for you. Plenty of wireless subwoofer soundbar kits out there for much less money and similar audio performance.\n\nSonos only is justified if you really want multi room in-sync audio. And even THAT is less valuable now if you are willing to use google home devices. \n\n\nI say this as someone who has 4 Sonos speakers, a Sonos port, and two Sonos amps.",
              "score": 13,
              "created_utc": 1746663099.0,
              "replies": [
                {
                  "id": "mr60p0j",
                  "author": "TypicalDelay",
                  "body": "Ehh these days there are really good soundbars but mostly I don't care about chasing the tippity top of price to audio quality ratio. (also I got my beam 2 on sale and it's very compact) \n\nFor the most part the Sonos ecosystem just works and delivers good audio quality with modularity and upgradeability.",
                  "score": 11,
                  "created_utc": 1746665698.0,
                  "replies": []
                },
                {
                  "id": "mr5xh1d",
                  "author": "Tsringer",
                  "body": "Shit… lol I was just considering going down the route of Sonos. Can you recommend some suggestions?",
                  "score": 7,
                  "created_utc": 1746664573.0,
                  "replies": [
                    {
                      "id": "mr5xzjq",
                      "author": "pattymcfly",
                      "body": "It’s still the best and most flexible option. If all you are doing is a single room like a home theatre around a tv… skip Sonos. It’s not the best audio quality for the money. You can always add a port to a AV receiver later if you want to use the home theatre with the rest of your multi room Sonos network.",
                      "score": 8,
                      "created_utc": 1746664753.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr70h0z",
                  "author": "WrongUserID",
                  "body": "I agree, and if someone is willing to pay the same amount, you can even get better specs.\n\nI still rock some of Chromecast Audio for multiroom sync. They work very well.",
                  "score": 5,
                  "created_utc": 1746679581.0,
                  "replies": []
                },
                {
                  "id": "mrdaffo",
                  "author": "thunderflies",
                  "body": "Most regular sound bars are uglier and Sonos gives you the ability to add wireless satellites later which is nice.",
                  "score": 1,
                  "created_utc": 1746765337.0,
                  "replies": []
                },
                {
                  "id": "mrehrci",
                  "author": "F-21",
                  "body": "My SO has it because she wanted a nice looking speaker and the square one from Ikea fit what she wanted. Sonos or not...",
                  "score": 1,
                  "created_utc": 1746790176.0,
                  "replies": []
                },
                {
                  "id": "mrw9c5t",
                  "author": "throwawaylawblog",
                  "body": "I’m unaware of other wireless subwoofers and ecosystems that integrate with a multi-room setup and do so in an entirely wireless nature.\n\nAlso, contrary to a lot of the comments in here, I have not had issues with my Sonos setup for connectivity or otherwise. I set it up 2-3 years ago and have never tweaked it again. It took me 10 minutes to setup. \n\nI’ll gladly pay more for that type of convenience, which is ultimately what I think Sonos is selling. I am fortunate that money is not generally an issue, but time is usually an issue. I’ll pay more to save time.",
                  "score": 1,
                  "created_utc": 1747049091.0,
                  "replies": []
                },
                {
                  "id": "mr82w6i",
                  "author": "Emergency_Hawk_6947",
                  "body": "That’s like telling someone who bought a luxury car or first class flight ticket to say they overpaid. There is a price for everything. If he had bought a Vizio soundbar for the price of Sonos then that would have been case of him paying too much. \n\nThis is complaining Apple to a cheap no brand android phone.",
                  "score": 0,
                  "created_utc": 1746701997.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr90u3n",
              "author": "Bdr1983",
              "body": "Until they decide to discontinue that line and just... cut support. Won't work anymore.",
              "score": 1,
              "created_utc": 1746714444.0,
              "replies": []
            },
            {
              "id": "mrda1gc",
              "author": "thunderflies",
              "body": "Yeah I have a Sonos sound bar I use the same way. I really only picked it because it looked less ugly than the other options I saw, the connected features don’t actually matter at all I guess.",
              "score": 1,
              "created_utc": 1746765147.0,
              "replies": []
            },
            {
              "id": "mr6mvrr",
              "author": "zzazzzz",
              "body": "ye but to do that you could have bought a soundbar for a quarter of the price and gotten the same experience. you are not really using any of the features that make sonos.",
              "score": 0,
              "created_utc": 1746673601.0,
              "replies": [
                {
                  "id": "mr6pjm3",
                  "author": "TypicalDelay",
                  "body": "Absolutely not. Please find me a soundbar that's a quarter or even half the price of a beam 2 that even competes with it.",
                  "score": 4,
                  "created_utc": 1746674682.0,
                  "replies": [
                    {
                      "id": "mr6rdc6",
                      "author": "zzazzzz",
                      "body": "Hisense AX5125H is half the price and you get 2 extra channels and a sub on top of it. \n\nand if you go away from shitty sounbars and buy actual hifi stuff you get better sound with 2 20 year old dusty speakers on wire. you can get those for a tenner on ebay.",
                      "score": 1,
                      "created_utc": 1746675441.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mr9uxbp",
          "author": "mecha_power",
          "body": "They used to be good and were essentially the only game in town when it comes to network audio and easily playing audio from your phone and not using bluetooth. But other companies have caught up and they were really trying hard to push for subscription revenue which I suspect is a reason for the big changes.",
          "score": 3,
          "created_utc": 1746723265.0,
          "replies": []
        },
        {
          "id": "mr60i81",
          "author": "funnyfarm299",
          "body": "Because they have the largest product portfolio in the wireless multi-room audio space.",
          "score": 1,
          "created_utc": 1746665631.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr2evox",
      "author": "Y34rZer0",
      "body": "I’m thoroughly unimpressed with Sonos",
      "score": 190,
      "created_utc": 1746626371.0,
      "replies": [
        {
          "id": "mr2h5rx",
          "author": "koolaidismything",
          "body": "They had the balls to send an OTA update to $600 speakers bricking them cause they were “moving in a different direction” \n\nThose people got boned.. they offered no new speakers just an email (if you registered).",
          "score": 141,
          "created_utc": 1746627088.0,
          "replies": [
            {
              "id": "mr2j98g",
              "author": "Y34rZer0",
              "body": "My father purchased one of their AU$600 sound bars about a month ago.     \nIt wouldn’t start working until you set it up with the phone app, which you had to do over your wifi after connecting it to the network.       \nProblem was that it was a pain in the ass to connect to Wi-Fi , and he’s fairly tech savvy.    \nHe spent half an hour total on the phone with their support, with their advice being useless.   \nIn total he was trying to get the thing to turn on for four hours.      \nI felt bad for him. Also it’s just a fu*%ing speaker! I understand that it has other features that require network connection and that you would need to use the app to apply optimum settings but there’s no reason  that it shouldn’t just output some sound when you plug it into your TV.    \nPlus the damn app had the balls to offer a Paid monthly subscription to get other features!        \n\non top of all of this I don’t think the sound is worth the price and it’s only got one damn type of input! It takes optical audio in and THAT’S ALL! One input!      \n\nit comes with a lead that is a HDMI to optical converter (yes I know, that puzzled me too but it works)   \n\nNo HDMI! No HDMI outputs so you can loop from it out to your TV like EVERY OTHER  high end audio product.   \nNot even the red and white RCA stereo inputs.    \n\nNeedlessly overly complicated product",
              "score": 42,
              "created_utc": 1746627724.0,
              "replies": [
                {
                  "id": "mr2lcxz",
                  "author": "Bleeezus",
                  "body": "If he wanted a soundbar you could just plug in and play, why’d he buy Sonos? The main appeal of the Sonos system is playing things over Wi-Fi",
                  "score": 24,
                  "created_utc": 1746628352.0,
                  "replies": [
                    {
                      "id": "mr2rnmy",
                      "author": "Great_Hamster",
                      "body": "Sonos' packaging said I could play music from my phone. It didn't say that this was only through a very limited selection of apps that had to be installed on the Soundbar itself.\n\n\nThat's why I bought and then returned mine. ",
                      "score": 25,
                      "created_utc": 1746630213.0,
                      "replies": [
                        {
                          "id": "mr57uyf",
                          "author": "skalpelis",
                          "body": "It does AirPlay too, if you're inclined that way (apple ecosystem, that is). You don't need an app for that apart from the initial setup",
                          "score": 2,
                          "created_utc": 1746655778.0,
                          "replies": [
                            {
                              "id": "mr6mbnj",
                              "author": "Great_Hamster",
                              "body": "Sadly, I don't own any Apple devices.",
                              "score": 1,
                              "created_utc": 1746673375.0,
                              "replies": [
                                {
                                  "id": "mriuzda",
                                  "author": "SovietMacguyver",
                                  "body": "Airplay can be done via open source stuff, if you like",
                                  "score": 2,
                                  "created_utc": 1746842884.0,
                                  "replies": [
                                    {
                                      "id": "mrlkys8",
                                      "author": "Great_Hamster",
                                      "body": "Thank you! I've returned the Sonos speaker, but I'm really glad to hear that there are other ways to make it work.",
                                      "score": 1,
                                      "created_utc": 1746889745.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mr3g7yq",
                          "author": "samehaircutfucks",
                          "body": "So you bought an expensive product without doing any research?",
                          "score": -36,
                          "created_utc": 1746637309.0,
                          "replies": [
                            {
                              "id": "mr3yp3g",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 17,
                              "created_utc": 1746642548.0,
                              "replies": [
                                {
                                  "id": "mr3znj2",
                                  "author": "samehaircutfucks",
                                  "body": "yeah because reviews from people who don't do their research are sure to be the most informed.",
                                  "score": -27,
                                  "created_utc": 1746642824.0,
                                  "replies": [
                                    {
                                      "id": "mr49x5d",
                                      "author": "thissexypoptart",
                                      "body": "You’re not disputing the facts so I assume this review is accurate. \n\nIt doesn’t matter how much research this person did. If a $600 speaker requires setting up and registering through wifi connection before it can even play audio, I don’t want it. This is a useful thing to read for a potential consumer. The ads I used to hear from Sonos definitely didn’t emphasize the need for wifi to use a goddamn speaker.",
                                      "score": 15,
                                      "created_utc": 1746645811.0,
                                      "replies": [
                                        {
                                          "id": "mr4hful",
                                          "author": "samehaircutfucks",
                                          "body": "It's a wifi speaker, the entire point of sonos is to be able to connect them all together wirelessly... their website literally says \"Mix and match speakers. Everything works seamlessly together over WiFi.\" when you search \"sonos\" in google. a 10 second google search will tell you that.",
                                          "score": -15,
                                          "created_utc": 1746647992.0,
                                          "replies": [
                                            {
                                              "id": "mr4j8bx",
                                              "author": "thissexypoptart",
                                              "body": "Sounds like shit, why would someone buy a speaker that *has* to be connected to wifi to work? Plenty exist that have wired ports, Bluetooth, and wifi connectivity.\n\nAnd there are several Sonos speakers that have usb or other direct wired connections possible. It’s ridiculous to require some kind of registration to use a speaker.\n\nI’m glad someone let me know. I’d do my research before purchasing anything that expensive, of course, but now I know I don’t even need to bother looking into Sonos.",
                                              "score": 6,
                                              "created_utc": 1746648520.0,
                                              "replies": [
                                                {
                                                  "id": "mr56pkk",
                                                  "author": "samehaircutfucks",
                                                  "body": "sounds like it's not the product for you then; nobody said you _had_ to buy it..",
                                                  "score": -2,
                                                  "created_utc": 1746655404.0,
                                                  "replies": [
                                                    {
                                                      "id": "mr573th",
                                                      "author": "thissexypoptart",
                                                      "body": "Yes lol, I have basically said as much in every comment. That’s not really the point, though. \n\nDid you forget your original comment in this thread or something?",
                                                      "score": 4,
                                                      "created_utc": 1746655532.0,
                                                      "replies": [
                                                        {
                                                          "id": "mr582wm",
                                                          "author": "samehaircutfucks",
                                                          "body": "Are you joking? You're the one who just went on a rant about how it's not the product for you. all I did was point out this guy didn't do his research and show how easy it is to find this information. No reason to get emotional.",
                                                          "score": -1,
                                                          "created_utc": 1746655850.0,
                                                          "replies": [
                                                            {
                                                              "id": "mr5ejvk",
                                                              "author": "None",
                                                              "body": "[deleted]",
                                                              "score": 5,
                                                              "created_utc": 1746658036.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mr5i7kw",
                                                                  "author": "samehaircutfucks",
                                                                  "body": "change tech to something else; if I buy a sewing machine without doing any research, can't set it up and return it is it fair for me to blame the sewing machine manufacturer?",
                                                                  "score": 0,
                                                                  "created_utc": 1746659295.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mr5v7e2",
                                                                      "author": "David-Puddy",
                                                                      "body": ">if I buy a sewing machine without doing any research, can't set it up and return it is it fair for me to blame the sewing machine manufacturer?\n\n\nIf the machine is needlessly complicated and requires a WiFi connection to sew?\n\n\nYes.\n\n\nI shouldn't need to do research to know whether or not my widget-spooling device can spool widgets. I should be safe in the knowledge that buying a widget-spooling device will allow me to spool my widgets.",
                                                                      "score": 2,
                                                                      "created_utc": 1746663774.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            },
                                                            {
                                                              "id": "mr5eo5k",
                                                              "author": "thissexypoptart",
                                                              "body": "It wasn’t a rant. I was saying the product sounds like a bad product, and disagreeing with you. This is a weird way to handle someone disagreeing with you. Nothing I said was emotional.\n\nMaybe give the thread a reread. Idk what else to tell you.",
                                                              "score": 2,
                                                              "created_utc": 1746658077.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mr5hv0x",
                                                                  "author": "samehaircutfucks",
                                                                  "body": "for you to disagree with me that would require me to take a stance on something; I never defended Sonos and their setup. Literally all I did was point out they didn't do their research and how easy it is to find that information.",
                                                                  "score": 0,
                                                                  "created_utc": 1746659174.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mr5724v",
                              "author": "notjordansime",
                              "body": "Yes. Most non techy people do *exactly* that. They trust the sales representative. Everyone in my family does this, and they end up with the Black Friday special budget edition of the product. I always say “wait until I have a day off and I’ll go with you to buy”, but people usually just want the new gizmo now.",
                              "score": 2,
                              "created_utc": 1746655517.0,
                              "replies": [
                                {
                                  "id": "mr5898z",
                                  "author": "samehaircutfucks",
                                  "body": "ok you just proved my point though lol",
                                  "score": 0,
                                  "created_utc": 1746655909.0,
                                  "replies": [
                                    {
                                      "id": "mr58ztt",
                                      "author": "notjordansime",
                                      "body": "right, but don’t act surprised and be like “wait.. did you really buy something without research?” when that’s how most people do it.",
                                      "score": 2,
                                      "created_utc": 1746656156.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mr3njko",
                              "author": "the_simurgh",
                              "body": "So many people do. People joke it takes me six months and three store trips to get any major purchase that isnt comic book art. The thing is i get top of the line stuff for much less than anyone else because i do my research before buying.",
                              "score": 3,
                              "created_utc": 1746639391.0,
                              "replies": [
                                {
                                  "id": "mr57981",
                                  "author": "notjordansime",
                                  "body": "Same, I’m literally the only one that I know who does this. Shopping with other people is a very eye-opening experience.",
                                  "score": 2,
                                  "created_utc": 1746655581.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mr6lpfz",
                              "author": "Great_Hamster",
                              "body": "Yes. I'd received a recommendation from another customer a year or two before, and that along with the packaging made me think it would probably fit my needs. Of course, I also got it from a shop with a very good return policy. I like to think I would have done more research if I was not buying it from that shop.",
                              "score": 1,
                              "created_utc": 1746673129.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mr2pts4",
                      "author": "ErGo404",
                      "body": "It's no excuse for the setup hassle that came with the new app.\n\nThe old one wasn't perfect but it was usually reliable and the setup process was simpler.",
                      "score": 4,
                      "created_utc": 1746629676.0,
                      "replies": []
                    },
                    {
                      "id": "mr2mon7",
                      "author": "Y34rZer0",
                      "body": "Honestly I don’t know why he chose that one. he’s usually quite discerning with purchases and puts the homework in.     \n\nHe’s already got one of those apple airport things so he can play music to his Marantz system (which is a good brand btw) from his PC or whatever.      \n\nPlus the whole point of a sound bar is to plug into a TV really. Why Sonos decided to make this difficult escapes me.        \nI bet the size of their speaker R&D department is a smaller than the department that designs their phone apps and other bullshit.       \n\nnext time I buy a speaker i’m sticking with the Germans  lol",
                      "score": 1,
                      "created_utc": 1746628751.0,
                      "replies": []
                    },
                    {
                      "id": "mr5v6ld",
                      "author": "wvraven",
                      "body": "When I bought my dad his it was for the voice enhancement.   At the time it was the best soundbar that could do it in the price range.    There are others now but Im not sure how they compare.",
                      "score": 1,
                      "created_utc": 1746663766.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mr4syjk",
                  "author": "pwn_intended",
                  "body": "Not defending Sonos as a company because of the messed up stuff they do, but you are wrong about the no HDMI input. Unfortunately it requires that you connect it to an eARC HDMI port on your TV. Not a problem for any TV made in the last ~7 years, and this is actually the preferred option over using the included HDMI - optical adapter, and the only way to get the “Dolby Atmos” option fwiw. The main drawback is losing an HDMI input on your tv. \n\nI agree with all of the hate about the app though. I am very tech savvy and it took about 2 hours to connect my sub to my system. Ended up having to factory reset all 8 Sonos products in my house.",
                  "score": 8,
                  "created_utc": 1746651260.0,
                  "replies": []
                },
                {
                  "id": "mr3zxsc",
                  "author": "HeartyBeast",
                  "body": "Hope he returned it",
                  "score": 2,
                  "created_utc": 1746642907.0,
                  "replies": []
                },
                {
                  "id": "mregt5r",
                  "author": "BalooBot",
                  "body": "I bought one of their Bluetooth speakers for a trip to Europe because I always listen to music in the shower. Got over there and you can't fucking use it in Bluetooth only mode until you connect it to WiFi. Can't even just use a hotspot because you *must* be connected to the same WiFi network. All the hotels had a splash screen where you have to agree to the terms before connecting. I wandered Europe for more than a month with a heavy ass speaker in my backpack for no damn reason.",
                  "score": 2,
                  "created_utc": 1746789746.0,
                  "replies": []
                },
                {
                  "id": "mr3ha38",
                  "author": "Ok-Tourist-511",
                  "body": "And they don’t even sound that good. $300 Samsung soundbar sounds better than the $500 beam.",
                  "score": 1,
                  "created_utc": 1746637613.0,
                  "replies": []
                },
                {
                  "id": "mr528e2",
                  "author": "myasterism",
                  "body": "And then, from the other end of the universe, there’s HomePod…\n\nApple’s ecosystem has its drawbacks, but reliable and intuitive interoperability ain’t on that list.",
                  "score": 1,
                  "created_utc": 1746653994.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr4l088",
              "author": "_B_Little_me",
              "body": "“Buy our expensive speaker, we will never plan obsolescence”\n\n10 years later….\n\n“We can’t support this anymore”",
              "score": 5,
              "created_utc": 1746649038.0,
              "replies": [
                {
                  "id": "mr4m88z",
                  "author": "koolaidismything",
                  "body": "You know who’s been my goto.. mid range ass JBL. Had a Flip 4 and Flip 5 for all my home entertainment stuff and showering listening to podcasts and stuff. Amazing clean sound.. ~$120 and last forever.. once you buy it you own it. \n\nSonos.. entry level is like a G and they juice you for monthly fees. That doesn’t sound like a luxury brand.. that’s vaporware.",
                  "score": 0,
                  "created_utc": 1746649390.0,
                  "replies": [
                    {
                      "id": "mr6damw",
                      "author": "goblue123",
                      "body": "My dude you are one of the most unreliable narrators in this whole thread.",
                      "score": 1,
                      "created_utc": 1746669999.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr3812j",
              "author": "unematti",
              "body": "These things are why i keep myself to open standards. In this case... Wired speakers and simple amps",
              "score": 6,
              "created_utc": 1746634952.0,
              "replies": [
                {
                  "id": "mr38mie",
                  "author": "koolaidismything",
                  "body": "Yeah at that price point I should be able to plug and play.. not download their stupid app then pay a monthly fee to unlock features. \n\nI made a JBL Flip 5 work for years but I mostly watch stuff on a laptop or iPad.",
                  "score": 1,
                  "created_utc": 1746635125.0,
                  "replies": [
                    {
                      "id": "mr6cqs1",
                      "author": "goblue123",
                      "body": "The whole point of it is that it tunes itself to your room. It has no idea where you sit. It needs a microphone where you sit to hear what it sounds like there. That microphone is in your phone. \n\nThere are tens of thousands of speakers out there if you don’t want the one specific product that works in this fashion.\n\nI have never paid a monthly fee to Sonos.",
                      "score": 1,
                      "created_utc": 1746669807.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mr3j6xl",
              "author": "GrayDaysGoAway",
              "body": "Do you have a link or anything where I could read about this? I know they used to brick speakers for people using their recycling program for discounts on new speakers, but I can't seem to find any google results about them doing so in other situations.\n\nI'm not doubting it happened; Sonos is a dogshit company. Just really interested to learn more.",
              "score": 3,
              "created_utc": 1746638159.0,
              "replies": [
                {
                  "id": "mr4sclo",
                  "author": "thewolfman2010",
                  "body": "Literally not true and people love to mixup the issue and conflate it. They did brick some speakers during their recycling fiasco and reversed course. \n\nPeople gonna believe whatever fits their narrative. \n\nI’ve been in the ecosystem for over 15 years and have at least one of every device. A lot of utter bullshit in these responses.",
                  "score": 4,
                  "created_utc": 1746651089.0,
                  "replies": [
                    {
                      "id": "mr53ttt",
                      "author": "myasterism",
                      "body": "As someone with no dog in this fight (happily in Apple’s ecosystem but not pushing my opinion), I’d be interested to read some sources that you feel accurately represent the situations in question. And I do mean that sincerely, and not as some sort of challenge—I would genuinely appreciate your insight, particularly considering you seem to have extensive experience with the platform.\n\nAll I really remember is that Sonos fucked up more than once, and in damning ways that I never heard satisfying explanations/resolutions for. Still, that’s really no more than a questionable vibe-memory.",
                      "score": 1,
                      "created_utc": 1746654487.0,
                      "replies": [
                        {
                          "id": "mr5a0np",
                          "author": "thewolfman2010",
                          "body": "Their two biggest “scandals” in the last 10 years (in my opinion) are the upgrade program offering where they initially traded discount coupons for older hardware and the rushed app overhaul to release their over ear headphones. \n\nYes, they have had a rocky road in some decision making. There’s no doubt about that. Their hardware is not poor as other replies make it seem. \n\nhttps://www.theverge.com/2025/1/13/24342282/sonos-app-redesign-controversy-full-story\n\nhttps://www.theverge.com/2020/3/5/21166777/sonos-ending-recycle-mode-trade-up-program-sustainability",
                          "score": 1,
                          "created_utc": 1746656496.0,
                          "replies": [
                            {
                              "id": "mrbedbz",
                              "author": "wkavinsky",
                              "body": "I mean the Arc is straight up performance competitive with regular non-sonos soundbars in the same price range.\n\nPeople get easily duped by \"this has more channels for half the price\" rather than the actual sound that comes out of the sound bar - especially when you've done the once-only audio set up for where it is in the room.",
                              "score": 2,
                              "created_utc": 1746739570.0,
                              "replies": []
                            },
                            {
                              "id": "mr9weya",
                              "author": "GrayDaysGoAway",
                              "body": "I don't see anybody here suggesting that they have bad hardware. It's all about them being anti-consumer assholes with shitty software.",
                              "score": 1,
                              "created_utc": 1746723688.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mr3ylvz",
                  "author": "WeekendHistorical476",
                  "body": "Only thing I can find. https://www.theverge.com/2020/1/23/21079269/sonos-ceo-patrick-spence-apology-legacy-products-software-updates",
                  "score": 1,
                  "created_utc": 1746642522.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr2hnr8",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1746627240.0,
              "replies": [
                {
                  "id": "mr2hzdf",
                  "author": "koolaidismything",
                  "body": "https://en.community.sonos.com/general-feedback-and-conversation-229090/can-you-un-brick-a-sonos-device-6841736",
                  "score": 2,
                  "created_utc": 1746627338.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr2taox",
          "author": "Mrbond404",
          "body": "Yeah, Sonos has been on a downhill slide for a while now. That app redesign was a complete disaster, and now they're ditching one of their more affordable product lines. Not surprised, but definitely disappointed. They seem to be losing focus on what made them good in the first place.",
          "score": 6,
          "created_utc": 1746630688.0,
          "replies": []
        },
        {
          "id": "mr3k05t",
          "author": "Jeffrey_C_Wheaties",
          "body": "We have Sonos at the bar I work at, the speakers constantly cut in and out, disconnect etc. \n\nThe UI on the app is absolutely terrible and gets worse with every update. \n\nI’ll never own a Sonos product and complain to my boss to never buy more.",
          "score": 4,
          "created_utc": 1746638392.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr33dl1",
      "author": "Playtek",
      "body": "I loved their stuff for a long time, I am way less in love with it these days.  Unfortunately it’s all over my house and would be prohibitively expensive to replace it all, but I won’t be buying any new Sonos products. \n\nTheir new app is one of the worst implementation of upgrade I have ever seen. Practically unusable for the first year and just barely functioning after several.",
      "score": 78,
      "created_utc": 1746633591.0,
      "replies": [
        {
          "id": "mr3ctmc",
          "author": "peanutbuttercult",
          "body": "The insistence on Sonos as both hardware and a streaming service is just horrible brand positioning. Anyone buying speakers primarily to play music is already going to have Apple Music or Spotify and their superior catalogue and UX - but Sonos Radio gobbles up so much real estate in the app that it’s killed the ability to quickly manage the speakers themselves.\n\nAll the Sonos app ever needed to be was a tool for quickly building out speaker groups and adjusting settings.",
          "score": 42,
          "created_utc": 1746636354.0,
          "replies": [
            {
              "id": "mr5udn4",
              "author": "pattymcfly",
              "body": "Keeping the audio synchronized is patented. \n\nAV receivers have similar capabilities. \n\nGoogle home devices can be grouped.",
              "score": 6,
              "created_utc": 1746663476.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr38j9v",
          "author": "unematti",
          "body": "Is there no way to convert the hardware to something open source? Surely there were some people buying it who also could hack it, it's way too popular.",
          "score": 5,
          "created_utc": 1746635099.0,
          "replies": [
            {
              "id": "mr3cki7",
              "author": "Playtek",
              "body": "Maybe, the hardware works great, it’s the software that sucks and has put me off from buying anymore.",
              "score": 10,
              "created_utc": 1746636281.0,
              "replies": []
            },
            {
              "id": "mr6bg4s",
              "author": "JakesInSpace",
              "body": "But then you wouldn’t need to buy their new products.",
              "score": 1,
              "created_utc": 1746669354.0,
              "replies": [
                {
                  "id": "mr7043k",
                  "author": "unematti",
                  "body": "Idno... I've been told over and over he'd change from iPhone to Samsung S series, and the only thing stopping him is the software. I myself haven't bought a new phone since the Note20 ultra. High part because I don't want to be involved with the directions the software is going in.\n\nI am considering xperia phones tho, because it's possible to easily switch out the OS to even other than android.\n\nI know I would've gotten Sonos stuff too. But I already heard of other companies doing what they did before.",
                  "score": 1,
                  "created_utc": 1746679406.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mr5pvbq",
          "author": "Krazzy4u",
          "body": "Same here but I stopped buying for the same reason.  It was the right choice when Covid hit but the company changed.",
          "score": 3,
          "created_utc": 1746661875.0,
          "replies": []
        },
        {
          "id": "mr46xll",
          "author": "Spaghet-3",
          "body": ">Unfortunately it’s all over my house and would be prohibitively expensive to replace it all, but I won’t be buying any new Sonos products.\n\nNot just expensive to replace, but there is no other single whole-home audio platform or company with the variety of products (form factors, price points, etc.) that match Sonos. \n\nSonos has small speakers, medium speakers, big speakers, portable small speakers, portable big speakers, 3 sizes of sound bar, 2 sizes of subs, an amplifier for third-party passive speakers, and a network audio player for third-party powered speakers. And that is ignoring all the discontinued speakers that are still supported by the latest app. \n\nNobody else has even half the product lineup of Sonos.\n\nAs much as I want to ditch my Sonos, even I had $10,000 burning a hole in my pocket, I am not sure what I would go with. I don't see a close alternative.",
          "score": 10,
          "created_utc": 1746644931.0,
          "replies": [
            {
              "id": "mr4owsy",
              "author": "Pire666",
              "body": "That would be bluesound. \nThey have most of it with better quality and also many thirdparty Amps / Aktivspeaker that work with the same app.",
              "score": 7,
              "created_utc": 1746650124.0,
              "replies": [
                {
                  "id": "mr4tkap",
                  "author": "Spaghet-3",
                  "body": "Oh, they certainly got better since the last time I looked. This looks much better than it used to. Still missing a few categories, albeit minor ones. I'll take a closer look at this.",
                  "score": 4,
                  "created_utc": 1746651425.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mr692vg",
              "author": "convincedbutskeptic",
              "body": "I came to the realization that I don't listen to music in every room and that I can just take a Bluetooth speaker outside.  That was the beginning of the end for Sonos",
              "score": 5,
              "created_utc": 1746668540.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mr53xk9",
          "author": "methetinternet",
          "body": "Yeah I have 7 of their speakers that I bought ~10 years ago. Loved them and recommend to everything. \nDue to software updates they’ve been a lot worse for the last few years and I’m worried about their future. Wouldn’t buy more or recommended to others these days.",
          "score": 3,
          "created_utc": 1746654519.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr38uy9",
      "author": "Friendly-Human85",
      "body": "I still recommend Symfonisk for rears!! Pleasantly surprised and happy, especially for the price. (+Arc, Mini Sub)",
      "score": 15,
      "created_utc": 1746635193.0,
      "replies": []
    },
    {
      "id": "mr38nkl",
      "author": "SpicyHabanero69",
      "body": "I had one of their bookshelf speakers and while it produced great sound for a decent price, the OS was terrible. This was when they switched to the new Sonos app, and this product was lost in-between. Towards the end of its life I had to put it on life support (Ethernet connection ) in order to have it stay connected to our internet. WiFi would drop out every hour or so.",
      "score": 9,
      "created_utc": 1746635134.0,
      "replies": []
    },
    {
      "id": "mr4ajme",
      "author": "flower4000",
      "body": "My roommates cousin worked for Sonos (I think they quit 2 years ago) and for years we got free speakers, we hate all of the Sonos part of those speakers (they’re good speakers with built it enshittification). Hell, the first like 2 don’t even work anymore cus they’re first gen, and the app “aged” them out so they just don’t even work. The Sonos app shit is annoying as fuck, we hate that alexia is listening. The only one we still use is the sound bar cus it’s pretty solid — when it doesn’t disconnect from the tv for no reason, and we wouldn’t even have it if it wasn’t free.",
      "score": 8,
      "created_utc": 1746645993.0,
      "replies": [
        {
          "id": "mr538nd",
          "author": "dcdttu",
          "body": "Your sound bar disconnection from the TV might very well be your HDMI cable.  HDMI cables are notoriously unreliable and will eventually start acting up.",
          "score": 2,
          "created_utc": 1746654303.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr32yao",
      "author": "circlehead28",
      "body": "I bought one of their speakers early on in the partnership and it was the most infuriating product I’d ever dealt with.\n\nConstantly dropping connectivity, forcing me to use the app. Good riddance. \n\nFor a brand that has some solid speakers, SONOS sure does seem to be shitting the bed recently.",
      "score": 14,
      "created_utc": 1746633468.0,
      "replies": []
    },
    {
      "id": "mr4ac8l",
      "author": "None",
      "body": "Sadly after going public and the top priority becoming profits, there's not much point in stickin with their (Sonos) ecosystem. They 'app' and backend are a total mess now and in many cases unusable.",
      "score": 6,
      "created_utc": 1746645932.0,
      "replies": []
    },
    {
      "id": "mr4a5py",
      "author": "ConsistentAsparagus",
      "body": "I am pretty satisfied by my Symfonisk: good design (they are behind me in my office’s bookshelf and really don’t stand out), good enough sound (I’m absolutely no audiophile but I can feel the difference between low level and everything over that, I can’t feel the difference in the higher levels), really good price.",
      "score": 4,
      "created_utc": 1746645879.0,
      "replies": [
        {
          "id": "mrmrgqs",
          "author": "None",
          "body": "Same i like symfonisk stuff more then i like Sonos stuff, have two bookshelf, two picture frames, and a lamp, with plans to pick up two more picture frames and another lamp, hopefully this doesn't mean obsolescence for the symfonisk stuff, that'd lead me to sell all my songs based gear",
          "score": 2,
          "created_utc": 1746903712.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrcbil1",
      "author": "jpnewbury",
      "body": "I bought a Sonos at Costco. Returned it as its app is a dog’s breakfast and Sonos couldn’t care less . Customer service was a joke. Arrogant company. They deserve to go bankrupt.",
      "score": 3,
      "created_utc": 1746751242.0,
      "replies": []
    },
    {
      "id": "mr5faln",
      "author": "Ceph99",
      "body": "My parents got a Sonos a few years ago and I heard it was supposed to be a great brand. \n\nI rarely have to walk away from a piece of tech. I had to walk away from that POS while trying to set it up. It was the most unintuitive shit ever. \n\nIt’s a fucking speaker. Plug it in and it should work. But nooooo.",
      "score": 2,
      "created_utc": 1746658290.0,
      "replies": [
        {
          "id": "mr5gwv5",
          "author": "palindromesUnique",
          "body": "*New Reddit-wide unique palindrome found:*\r>**a Sonos a**\r \r ^(currently checked 92041344 comments) \\\n >!(palindrome: a word, number, phrase, or sequence of symbols that reads the same backwards as forwards) !<",
          "score": 3,
          "created_utc": 1746658842.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr5txn8",
      "author": "AJMaskorin",
      "body": "Can get behind Sonos after they made my speaker virtually useless because a new model came out. It used to work as an air play speaker for awhile after that, but now that feature doesn’t even work most of the time",
      "score": 2,
      "created_utc": 1746663315.0,
      "replies": []
    },
    {
      "id": "mr6a8l4",
      "author": "Opie045",
      "body": "I still have an OG play 3 that is going strong.",
      "score": 2,
      "created_utc": 1746668940.0,
      "replies": []
    },
    {
      "id": "mr7zv4p",
      "author": "123_fake_name",
      "body": "Sonos “was” a fantastic product with an easy to use app, and unbelievable good customer support…….. but each time they update the app it got worse to the point that it’s unusable.  - someone who professionally installs it.",
      "score": 2,
      "created_utc": 1746700501.0,
      "replies": []
    },
    {
      "id": "mr80buh",
      "author": "Grindelbart",
      "body": "How is Sonos still a thing?",
      "score": 2,
      "created_utc": 1746700741.0,
      "replies": []
    },
    {
      "id": "mrbwjqi",
      "author": "7Sans",
      "body": "there is reason why when people hear a company is going to go public their first reaction is a legitimate concern about that company's quality going downhill compare to what they were before.\n\nbecause when a company goes public, customers aren't the one they need to please the most anymore, it's the shareholders. that shift in focus might sound small but it's huge and most companies fall into the trap and at the end, fails.",
      "score": 2,
      "created_utc": 1746745766.0,
      "replies": []
    },
    {
      "id": "mr52lxm",
      "author": "penmonicus",
      "body": "This is quite a shame, now that I finally bought one of the picture frame speakers and got a third-party printed cover. I would get more if I had the money. Wonder if they’ll be going cheap soon.",
      "score": 1,
      "created_utc": 1746654109.0,
      "replies": []
    },
    {
      "id": "mr5h1oq",
      "author": "deankh3647",
      "body": "I’ve used Sonos for years, the days before you could connect on Spotify were dark. The app is rubbish, I just like how you can use your phone and the speaker doesn’t stop since it’s connected via internet.",
      "score": 1,
      "created_utc": 1746658889.0,
      "replies": []
    },
    {
      "id": "mr6a6wa",
      "author": "collectsuselessstuff",
      "body": "That’s okay. I don’t plan to purchase anymore Sonos products. Holy shit they suck now.",
      "score": 1,
      "created_utc": 1746668924.0,
      "replies": [
        {
          "id": "mrkx69d",
          "author": "panzerbjrn",
          "body": "I have some Gen 1 speakers which are still great and I'm never buying another Sonos product. After the godawful Gen 2 upgrade they are dead to me.",
          "score": 1,
          "created_utc": 1746881249.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mr7u8d1",
      "author": "shysaver",
      "body": "I have a symfonisk in the kitchen to listen to podcasts and some music. I think I used the sonos app once to set the speaker up and then never again, I just use it as an airplay device, it’s been fine tbh\n\nShame that they are discontinuing it",
      "score": 1,
      "created_utc": 1746697302.0,
      "replies": [
        {
          "id": "mr8zcdy",
          "author": "dantheriver",
          "body": "Yea, I guess I’m not a power user or something… no real issues out of Sonos set up aside from how annoying it is to re-do the whole thing if I change my WiFi setup.",
          "score": 1,
          "created_utc": 1746713997.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mrar3dk",
      "author": "Actual-Carpenter-90",
      "body": "I hate Sonos, got so frustrated that I threw the whole system directly in the dumpster and it felt great",
      "score": 1,
      "created_utc": 1746732623.0,
      "replies": []
    },
    {
      "id": "mrk1hh8",
      "author": "Orangesteel",
      "body": "The Sonos roam is effectively disposable. Non replaceable batteries. £200 speaker that you throw away after two years. I replaced my own batteries, but the design makes this awful, including having to disconnect the circuit board and tiny ribbon cables. The batteries are glued in as well, so good luck(!)",
      "score": 1,
      "created_utc": 1746864034.0,
      "replies": []
    },
    {
      "id": "mr4caeg",
      "author": "MrThorntonReed",
      "body": "We got a Sonos at the end of 2019 and it was really, really awful to deal with, so I’d call this good.",
      "score": 1,
      "created_utc": 1746646497.0,
      "replies": []
    }
  ]
}