{
  "post": {
    "title": "[Eric Migicovsky] Why We’re Bringing Pebble Back",
    "author": "overseergti",
    "id": "1ibkayl",
    "score": 1274,
    "created_utc": 1738012503.0,
    "selftext": "",
    "num_comments": 178,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ibkayl/eric_migicovsky_why_were_bringing_pebble_back/"
  },
  "comments": [
    {
      "id": "m9ixo8o",
      "author": "Galactic_Danger",
      "body": "holy shit pebble is coming back?\n\nLoved mine until I lost it a few years ago. Great smartwatch.",
      "score": 407,
      "created_utc": 1738013775.0,
      "replies": [
        {
          "id": "m9jr2vl",
          "author": "raxitron",
          "body": "I also lost mine and the only other person I knew that had one lost theirs. Maybe they should invest in the band a bit as their first move.",
          "score": 77,
          "created_utc": 1738022623.0,
          "replies": [
            {
              "id": "m9krmp5",
              "author": "None",
              "body": "[deleted]",
              "score": -19,
              "created_utc": 1738034502.0,
              "replies": [
                {
                  "id": "m9l3qur",
                  "author": "raxitron",
                  "body": "Nah I had the Kickstarter one and I specifically remember getting drunk and waking up at a friend's house without it.",
                  "score": 10,
                  "created_utc": 1738039105.0,
                  "replies": [
                    {
                      "id": "m9l7dm9",
                      "author": "PerNewton",
                      "body": "You wuz robbed!",
                      "score": 4,
                      "created_utc": 1738040645.0,
                      "replies": []
                    },
                    {
                      "id": "m9l94v6",
                      "author": "LegitimateHall4467",
                      "body": "Did your friend like his /hers?",
                      "score": 1,
                      "created_utc": 1738041429.0,
                      "replies": [
                        {
                          "id": "m9npsqm",
                          "author": "raxitron",
                          "body": "Haha well that was like 10 or 15 years ago so I guess he's kept it pretty well hidden. Damn I invited him to my wedding without even knowing he was a thief.",
                          "score": 1,
                          "created_utc": 1738081581.0,
                          "replies": [
                            {
                              "id": "m9ntwwb",
                              "author": "LegitimateHall4467",
                              "body": "I hope you didn't loose your spouse then.",
                              "score": 1,
                              "created_utc": 1738082731.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9lsft7",
                      "author": "okmarshall",
                      "body": "Are you sure you weren't stoned? I'll see myself out.",
                      "score": 0,
                      "created_utc": 1738051818.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9l1eil",
                  "author": "Blastcheeze",
                  "body": "You can also just use regular watch bands with it. I swapped mine for a stretchy canvas band almost right away.",
                  "score": 4,
                  "created_utc": 1738038150.0,
                  "replies": [
                    {
                      "id": "m9lhxyq",
                      "author": "kurotech",
                      "body": "Yea that's the good thing about most smart watches is they use a standard band clasp so just about any band will work",
                      "score": 0,
                      "created_utc": 1738045737.0,
                      "replies": [
                        {
                          "id": "m9mqcon",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1738070362.0,
                          "replies": [
                            {
                              "id": "m9nqapy",
                              "author": "kurotech",
                              "body": "Yeah fitbit are one of the few brands that use smaller clasp style but there are still plenty of after market options out there for them that have better clasps in general",
                              "score": 1,
                              "created_utc": 1738081721.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9lqkkx",
              "author": "None",
              "body": "[removed]",
              "score": -25,
              "created_utc": 1738050661.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9kwia4",
          "author": "trashcatt_",
          "body": "I had the exact same reaction. The Pebble is still my favorite smart watch I've ever owned. I wish I hadn't sold mine but I'm sure the battery would be shot by now.",
          "score": 12,
          "created_utc": 1738036254.0,
          "replies": []
        },
        {
          "id": "m9jvt82",
          "author": "DFrostedWangsAccount",
          "body": "Holy shit that's exciting I still use my Pebble Time Steel",
          "score": 15,
          "created_utc": 1738024140.0,
          "replies": []
        },
        {
          "id": "m9jxlob",
          "author": "drealph90",
          "body": "The hardware is still abandoned, but Google has released the source code so Pebble lovers can get proper community firmware updates.\n\n\nEdit:\n\nSo apparently I didn't read the article that's actually linked on this post, I was jumping to conclusions because I had read earlier this day about Google releasing the source code for the pebble watch OS. \n\nThe linked article is about the founder of Pebble watch trying to revive the hardware now that the source code for Pebble OS has been released.",
          "score": 23,
          "created_utc": 1738024712.0,
          "replies": [
            {
              "id": "m9k1bux",
              "author": "celticchrys",
              "body": "...and the article linked is about how the original founder of Pebble has announced that he's bringing back some version of the hardware. Now that the software is finally open sourced, he can legally use it again for a new device.",
              "score": 44,
              "created_utc": 1738025901.0,
              "replies": [
                {
                  "id": "m9k1l0f",
                  "author": "drealph90",
                  "body": "Well shit, that'll teach me to reach the article next time instead of just trying to remember an article I read before",
                  "score": 8,
                  "created_utc": 1738025982.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9iva1v",
      "author": "dicemaze",
      "body": "Holy shiiiiiiiiiiit!\n\nI LOVED my Pebble Time Round. I would have kept using it if the magnetic charging mechanism didn’t fail on me after the company went under. The ability to change music tracks or volume with buttons was huge—no looking down at the screen required!",
      "score": 176,
      "created_utc": 1738013108.0,
      "replies": [
        {
          "id": "m9j5bwt",
          "author": "Show985",
          "body": "Best looking smartwatch ever.",
          "score": 41,
          "created_utc": 1738015929.0,
          "replies": [
            {
              "id": "m9j8wgh",
              "author": "regan9109",
              "body": "I got compliments on it all the time, people were stunned it was a smartwatch!",
              "score": 17,
              "created_utc": 1738016964.0,
              "replies": []
            },
            {
              "id": "m9mhhkj",
              "author": "RhysDerby",
              "body": "Best also for short trips: didn’t need to pack a charger",
              "score": 3,
              "created_utc": 1738066662.0,
              "replies": []
            },
            {
              "id": "m9k1p5v",
              "author": "tempest_87",
              "body": "Had my pebble steel until it literally ceased to function.",
              "score": 3,
              "created_utc": 1738026019.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9l7qe2",
          "author": "PerNewton",
          "body": "What were the price points on the Pebble?",
          "score": 1,
          "created_utc": 1738040804.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9iwuk0",
      "author": "NJH_in_LDN",
      "body": "Buttons for music control is already a win.",
      "score": 90,
      "created_utc": 1738013546.0,
      "replies": [
        {
          "id": "m9o7uz9",
          "author": "audigex",
          "body": "Volume control is the main reason I sometimes still wear my gen1 Apple Watch - my AirPods have play/pause, next track etc but no volume control\n\nI don’t really care about most of the rest of what the Watch does, I don’t use the fitness stuff and although notifications could be handy when I worked in the office, I work from home now so a glance at my phone isn’t a problem… so a watch with a long battery life that was more focused on music control (notifications wouldn’t hurt) would suit me down to the ground these days",
          "score": 3,
          "created_utc": 1738086643.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9iw6x0",
      "author": "Double_Intention_641",
      "body": "I'd buy one. The death of the pebble ecosystem made me abandon my last one.  I'd want to see some kind of open source environment to support it long term.",
      "score": 230,
      "created_utc": 1738013363.0,
      "replies": [
        {
          "id": "m9iylki",
          "author": "joesighugh",
          "body": "It is going to be open-sourced, Google already announced that.",
          "score": 91,
          "created_utc": 1738014034.0,
          "replies": [
            {
              "id": "m9l57l1",
              "author": "earth-dweller-human",
              "body": "Not will, IS! https://github.com/google/pebble",
              "score": 35,
              "created_utc": 1738039714.0,
              "replies": [
                {
                  "id": "m9liode",
                  "author": "timsredditusername",
                  "body": "> This is the latest version of the internal repository from Pebble Technology providing the software to run on Pebble watches. Proprietary source code has been removed from this repository and it will not compile as-is. This is for information only.",
                  "score": 19,
                  "created_utc": 1738046131.0,
                  "replies": [
                    {
                      "id": "m9lpr5l",
                      "author": "sillypicture",
                      "body": "So.. its a corpse of what it was and can't be revived?",
                      "score": 7,
                      "created_utc": 1738050161.0,
                      "replies": [
                        {
                          "id": "m9lrpe7",
                          "author": "YAOMTC",
                          "body": "Not *can't*. But requires a lot of work. Rebble and others are looking at it now to figure out what can be done with it.",
                          "score": 12,
                          "created_utc": 1738051353.0,
                          "replies": [
                            {
                              "id": "m9lzpie",
                              "author": "sillypicture",
                              "body": "So we *could* get s sexy zombie of pebble?",
                              "score": 2,
                              "created_utc": 1738056500.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m9o64s2",
                          "author": "audigex",
                          "body": "It could be revived, but it would require time and effort to recreate the propriety code that couldn’t be released\n\nIf we know what that removed code does and how this code expects to interact with it, it’s almost always possible to recreate it (or create something that does a similar-enough job)\n\nThe question is whether someone is volunteering to do that or, if not, whether someone (eg a company like Pebble) is going to pay someone to do it",
                          "score": 6,
                          "created_utc": 1738086170.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9j1df9",
      "author": "BinOfBargains",
      "body": "This seriously made my day. Absolutely love the platform and I'm really excited to see what they can do with modern e-paper/e-ink and sensor tech.",
      "score": 60,
      "created_utc": 1738014808.0,
      "replies": [
        {
          "id": "m9jrd29",
          "author": "Skeeterdrums",
          "body": "Same here--this is just fantastic news. I'm not as big of a fan of my current watch as I was of my Pebble.",
          "score": 9,
          "created_utc": 1738022716.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9j1259",
      "author": "None",
      "body": "I worked with a guy who helped start pebble. He gave me one of his and I loved it. By the time I needed a new one, they weren’t selling them anymore. \n\nI hope they come back.",
      "score": 41,
      "created_utc": 1738014721.0,
      "replies": []
    },
    {
      "id": "m9j31nh",
      "author": "Bobbler23",
      "body": "Oooh, nice!\n\nI still have my original Kickstarter one in the drawer somewhere. I really miss that week long battery life on modern smartwatches.",
      "score": 15,
      "created_utc": 1738015272.0,
      "replies": [
        {
          "id": "m9ksv8g",
          "author": "dgsharp",
          "body": "My Garmin Vivoactive 5 lasts most of a week.\n\nI would have stuck with Pebble. Was a great watch. It died after a few years and I’ve been through a couple of alternatives. I miss being able to do quick text responses (even if they were just canned options), none of my newer smart watches have supported that. (I’d have an Apple Watch but the battery life just seems like a nonstarter for me.)",
          "score": 6,
          "created_utc": 1738034933.0,
          "replies": [
            {
              "id": "m9lj7or",
              "author": "KryanSA",
              "body": "The last 4-6 years of Samsung galaxy smartwatches have had quick (and manual typed or spoken) replies for text messages.\n\nThe introduction of Google Wear initially slashed battery life, but that's finally been resolved with the latest watches.\n\nMy Galaxy Watch Ultra can go 5-7 days with the AOD off.\n\n\nI'm going to assume you're an iPhone user, which is why your newer smartwatches haven't supported that.\nThats a you/iPhone problem though. From Apple's perspective, you use an Apple watch or nothing.",
              "score": 2,
              "created_utc": 1738046420.0,
              "replies": []
            },
            {
              "id": "m9lulr8",
              "author": "GolemancerVekk",
              "body": "But Vivoactive 5 can do canned text replies, can't it?",
              "score": 2,
              "created_utc": 1738053185.0,
              "replies": [
                {
                  "id": "m9m90kx",
                  "author": "dgsharp",
                  "body": "As the other commenter mentioned this must be an iOS limitation. Lame.",
                  "score": 1,
                  "created_utc": 1738062286.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9j9j30",
      "author": "jrodp1",
      "body": "Never owned one. But always heard good things. \n\nCould someone tell me why it's so awesome to them personally.",
      "score": 24,
      "created_utc": 1738017148.0,
      "replies": [
        {
          "id": "m9jb12z",
          "author": "PwmEsq",
          "body": "E paper/no touch screen tends to mean long battery life and low costs.\n\nLike i only needed to charge once every 2 weeks but could still control my songs and respond to texts etc.",
          "score": 38,
          "created_utc": 1738017587.0,
          "replies": [
            {
              "id": "m9jth3e",
              "author": "ThatLaloBoy",
              "body": "For what it’s worth, Amazfit’s wearables also last 14+ days and can do all that plus work as a fitness tracker. And it can do that with a touchscreen and color display. \n\nI’m willing to go back to Pebble if they release a good product with a nice design though. The Pebble Round is still my favorite wearable ever.",
              "score": 14,
              "created_utc": 1738023396.0,
              "replies": [
                {
                  "id": "m9l2ofi",
                  "author": "Blastcheeze",
                  "body": "I had a Bip for a while, but it was kinda janky compared to my Pebbles. They had a really easy to use, intuitive, smooth UI.",
                  "score": 6,
                  "created_utc": 1738038666.0,
                  "replies": []
                },
                {
                  "id": "m9khgwi",
                  "author": "ChemiluminescentAshe",
                  "body": "I wonder how it'll stack up against Coros/Garmin color MIP watches. They last weeks.",
                  "score": 2,
                  "created_utc": 1738031101.0,
                  "replies": []
                },
                {
                  "id": "m9n4x8t",
                  "author": "wizard7926",
                  "body": "Touchscreen is a non-starter for me. \n\n\nEvery watch I've tried with a touchscreen becomes useless in any situation involving water despite being \"waterproof.\" \n\n\nMeanwhile my Pebble works perfectly in the pool, shower, washing dishes, bathtime, you name it. ",
                  "score": 1,
                  "created_utc": 1738075410.0,
                  "replies": []
                },
                {
                  "id": "m9ovfkx",
                  "author": "PwmEsq",
                  "body": "For sure, but this was doing that back in 2013, i would imagine they could make it even better 13 years later",
                  "score": 1,
                  "created_utc": 1738093069.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9jyihe",
          "author": "Orjnd",
          "body": "Always on display, long battery life, buttons, and the philosophy of not being a smartphone on your wrist. Really open platform, lots of community made watchfaces and watchapps.",
          "score": 14,
          "created_utc": 1738025002.0,
          "replies": [
            {
              "id": "m9lkl7y",
              "author": "netver",
              "body": "You're essentially describing Garmin without the sports part.",
              "score": 2,
              "created_utc": 1738047173.0,
              "replies": [
                {
                  "id": "m9ma8mt",
                  "author": "Orjnd",
                  "body": "Yeah, garmin is great too. They're sports watches first, very serious, but in my opinion the non sports part feels clunkier, a bit of an aftertought, and doesn't have the same wide variety of apps and watchfaces (could be different today, the garmin I own is older). Pebble was frequently releasing OS updates, fleshing out the software, and the app and watchface community was really active, because that was the essence of the device.",
                  "score": 1,
                  "created_utc": 1738062980.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9l2io0",
          "author": "Blastcheeze",
          "body": "It’s actually a smart watch rather than a half-baked computer that’s too small. It does notifications, step tracking, music control, and it’s got physical buttons. The e-ink screen and lack of unnecessary features means you can get about a week on one charge easily, with the screen always on. Plus you can see it out in sunlight.",
          "score": 9,
          "created_utc": 1738038601.0,
          "replies": []
        },
        {
          "id": "m9kpk1b",
          "author": "SpartyEsq",
          "body": "I loved that it was a smartwatch that didn't look like one. \n\nI always feel like a dork with a suit and a google pixel watch or the like.",
          "score": 6,
          "created_utc": 1738033790.0,
          "replies": []
        },
        {
          "id": "m9mx5ik",
          "author": "zovits",
          "body": "It was the first actually usable SmartWatch. I used to wear a watch 0-24, and none of the other models could be used the same way: put it on, glance on it whenever you want to know the time and forget about it otherwise. It's visible in daylight, waterproof, lightweight and has a small profile, has great battery life (7-10 days), and the first gen could even be charged while being worn. Also it does not try to do things it could only do suboptimally.",
          "score": 5,
          "created_utc": 1738072816.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9jgy37",
      "author": "emiliabow",
      "body": "Ok sounds good! Unfortunately I'm invested in apple watch but my first gen pebble was the doorway to electronic watches I'll never forget",
      "score": 19,
      "created_utc": 1738019375.0,
      "replies": []
    },
    {
      "id": "m9j7kmk",
      "author": "Masterofunlocking1",
      "body": "Still have my OG and a pebble time. I don’t know how much I’ll like a new pebble after seeing how well apple watch works. I’d trying one just to see what it does but if you can’t reply to messages and it just gives notifications, it will probably sit in a drawer.",
      "score": 8,
      "created_utc": 1738016576.0,
      "replies": [
        {
          "id": "m9ns17p",
          "author": "ugman77",
          "body": "I had a time round and a P2. Both could send preset text responses and voice dictate.",
          "score": 2,
          "created_utc": 1738082207.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9j3qhn",
      "author": "Raw_Venus",
      "body": "I had the OG pebble and loved it. It was my first (semi) smart watch.",
      "score": 5,
      "created_utc": 1738015470.0,
      "replies": []
    },
    {
      "id": "m9iuoss",
      "author": "Neo_Techni",
      "body": "One please. I've bought numerous smart watches since then and they've all lacked the ability to hold 2 buttons down to change music tracks, or the always on screen.",
      "score": 14,
      "created_utc": 1738012944.0,
      "replies": []
    },
    {
      "id": "m9j65uz",
      "author": "None",
      "body": "Oh wow. I still have my black Pebble Steel. I loved that thing. A relatively inexpensive, robust and longer lasting (per charge) replacement to the Apple Watch would get worn quite a bit I suspect.",
      "score": 10,
      "created_utc": 1738016169.0,
      "replies": []
    },
    {
      "id": "m9jdyud",
      "author": "cscottnet",
      "body": "I'll buy it.  I had both Kickstarter versions, wrote a lot of watch face apps, & loved the software stack which was very old-school m68k mac (in a good way).  Got several sqfmi watchys and published hacking projects on hackaday for them as well. Given that Eric has partnered with sqfmi in the past, this gives me good feelings about the repebble.",
      "score": 9,
      "created_utc": 1738018461.0,
      "replies": [
        {
          "id": "m9jmi7h",
          "author": "Nihilistic_Chimp",
          "body": "Making your own faces was the best. Make your watch how you wanted it, not how someone else says you want it",
          "score": 5,
          "created_utc": 1738021140.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9j9i9r",
      "author": "kschonrock",
      "body": "I had a pebble, it had some display corruption issue. Got it replaced twice, all with the same problem. Still liked it.",
      "score": 5,
      "created_utc": 1738017141.0,
      "replies": [
        {
          "id": "m9oieo5",
          "author": "nachog2003",
          "body": "i had a pebble classic, had the same problem, new watch developed the same issue a week later, their support actually offered me a pebble time as a replacement as an apology which was really nice of them, it still boots but the display is water damaged and barely visible unfortunately.",
          "score": 2,
          "created_utc": 1738089510.0,
          "replies": []
        },
        {
          "id": "m9lj20p",
          "author": "retainftw",
          "body": "One of mine had the same issue but I never used it enough to care enough to get it replaced. Sounds like it was a fw issue? Or was it an actual hardware problem?",
          "score": 1,
          "created_utc": 1738046336.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9jelfp",
      "author": "AwwwSheetMulch",
      "body": "i hope maybe one will come with an LED that blinks when you've missed a call or text. I really miss that from my S8 and back.",
      "score": 5,
      "created_utc": 1738018651.0,
      "replies": [
        {
          "id": "m9jwavd",
          "author": "Neo_Techni",
          "body": "The old ones had rumble to tell you to check notifications. For a while after my Pebble died, I had phantom pebble syndrome",
          "score": 3,
          "created_utc": 1738024296.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9jgbf0",
      "author": "Avrution",
      "body": "I just want the great battery life and alarm function.  I use a first gen Amazfit Bip and get 90 days of battery per charge.",
      "score": 5,
      "created_utc": 1738019181.0,
      "replies": []
    },
    {
      "id": "m9jplej",
      "author": "prguitarman",
      "body": "I collaborated with Pebble for their color watches. Great company and still have my watch. Glad to hear they’ll return!",
      "score": 4,
      "created_utc": 1738022144.0,
      "replies": []
    },
    {
      "id": "m9j1jad",
      "author": "ColdestCore",
      "body": "Looking forward to what may come out.\n\nSince Pebble, I've moved over to Garmin which fulfills my needs for activity tracking. Hopefully they can bring a watch with e-ink back that fulfills that",
      "score": 6,
      "created_utc": 1738014853.0,
      "replies": []
    },
    {
      "id": "m9j72s3",
      "author": "rabidbot",
      "body": "This is awesome.  The first pebble was so fun, instant buy.",
      "score": 5,
      "created_utc": 1738016432.0,
      "replies": []
    },
    {
      "id": "m9jay88",
      "author": "PunchNessie",
      "body": "I had a Pebble Time Round and thought it was great.  The market has changed a lot but they had a fun little interface that, with some updates, could be unique in the marketplace.",
      "score": 3,
      "created_utc": 1738017563.0,
      "replies": []
    },
    {
      "id": "m9jpq5s",
      "author": "DadsTheMan69",
      "body": "Dude I work my Pebble Steel for years and got tons of use out of it working in the theatre. Miss that thing.",
      "score": 3,
      "created_utc": 1738022186.0,
      "replies": []
    },
    {
      "id": "m9jtwod",
      "author": "3-DMan",
      "body": "Yay, can keep using my refurbished OG Pebble! (tho battery be gettin' long in the tooth now)",
      "score": 3,
      "created_utc": 1738023536.0,
      "replies": []
    },
    {
      "id": "m9kr1wd",
      "author": "Domodude17",
      "body": "Looking forward to hearing Linus talk about this excitedly on the WAN show lol",
      "score": 3,
      "created_utc": 1738034301.0,
      "replies": []
    },
    {
      "id": "m9ji9s2",
      "author": "wingspantt",
      "body": "Pebble was the first and best smart watch I ever had. Since they turned off the servers, no watch has EVER been as intuitive and usable while also having killer battery life AND an always-on screen. None. And I tried a few.",
      "score": 5,
      "created_utc": 1738019790.0,
      "replies": []
    },
    {
      "id": "m9jq6xn",
      "author": "japavao97",
      "body": "This is without a doubt the best news I have received in over a decade. I have worn my pebble every day for the past 11 years ever since I got my first one.",
      "score": 6,
      "created_utc": 1738022337.0,
      "replies": []
    },
    {
      "id": "m9jlzs5",
      "author": "baconinspace",
      "body": "I still have my old pebble. This post reminded me I still have it. Now I just have to find it!",
      "score": 2,
      "created_utc": 1738020974.0,
      "replies": []
    },
    {
      "id": "m9k1f9f",
      "author": "ThoughtFission",
      "body": "I have one of the first ones from kickstarter. Still have the original box.",
      "score": 2,
      "created_utc": 1738025932.0,
      "replies": []
    },
    {
      "id": "m9k6smg",
      "author": "Voltae",
      "body": "Fitbit hardware is steaming dog shit, so maybe bringing back the competitor's hardware will actually be a good thing.",
      "score": 2,
      "created_utc": 1738027646.0,
      "replies": []
    },
    {
      "id": "m9kfhg9",
      "author": "Ectorious",
      "body": "I got here as soon as I heard pebble was back",
      "score": 2,
      "created_utc": 1738030448.0,
      "replies": []
    },
    {
      "id": "m9kg08l",
      "author": "_its_a_SWEATER_",
      "body": "Wanted this over an Apple Watch, and then they got bought and discontinued. I’m still bummed I had to get an AW instead. If it’s good, I’ll get it!",
      "score": 2,
      "created_utc": 1738030619.0,
      "replies": []
    },
    {
      "id": "m9kwllz",
      "author": "Touchit88",
      "body": "I loved my pebbles, but had screen issues.  If this releases, I'll buy one!",
      "score": 2,
      "created_utc": 1738036287.0,
      "replies": []
    },
    {
      "id": "m9l2mdp",
      "author": "SuperRob",
      "body": "Oof. This is like those ‘dumb phones’ trying to get you to see value in the limited functionality we had a decade or more ago. The problem is our expectations changed.\n\nI still have my Pebble in a drawer. At the time, I loved it for the basic functionality and customization it offered. But the biggest issue was that it couldn’t integrate into iOS at the level I really wanted. So the basic functionality it offered didn’t really meet my needs, but it was the best there was at the time.\n\nAnd then Apple came out with the Apple Watch and allowed the deeper integration. Then they added health and fitness tracking. And while I hate the battery life on my Apple Watch, I’m not willing to give up the functionality and go back to something like Pebble.",
      "score": 2,
      "created_utc": 1738038643.0,
      "replies": []
    },
    {
      "id": "m9l2o81",
      "author": "stoikoviro",
      "body": "![gif](giphy|KD8UMklkntkgitZKAX)\n\n  \nI am still wearing the Pebble Time.",
      "score": 2,
      "created_utc": 1738038664.0,
      "replies": []
    },
    {
      "id": "m9l9hmo",
      "author": "mrblaze1357",
      "body": "My HS physics teacher had the original and loved it. So when I saved up enough money I picked up the Pebble Time, and to this day it's still my favorite watch. \n\nThere's some QOL stuff that could be done to improve it but I'd love to have a modern version no matter what the cost.",
      "score": 2,
      "created_utc": 1738041588.0,
      "replies": []
    },
    {
      "id": "m9j5vsz",
      "author": "hedoeswhathewants",
      "body": "\"Because we think we can make money\"",
      "score": 2,
      "created_utc": 1738016088.0,
      "replies": [
        {
          "id": "m9k402r",
          "author": "fvck_u_spez",
          "body": "Did you read the article?",
          "score": 8,
          "created_utc": 1738026758.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9j875i",
      "author": "None",
      "body": "[deleted]",
      "score": 4,
      "created_utc": 1738016759.0,
      "replies": [
        {
          "id": "m9jk7gy",
          "author": "kayak83",
          "body": "Why \"f* Garmin\"? As a runner, I really like my Garmin (Forerunner series). I also tend to recommend their non-forerunner watches over a \"traditional\" smart watch from Samsung or Google- on the android side of things, at least.",
          "score": 5,
          "created_utc": 1738020402.0,
          "replies": [
            {
              "id": "m9jm80j",
              "author": "Nihilistic_Chimp",
              "body": "Garmin bought the tech and buried the watch. Typical corporate bullshit\n\nEdit: Oops it was Fitbit that bought Pebble then Google acquired it.",
              "score": -7,
              "created_utc": 1738021049.0,
              "replies": [
                {
                  "id": "m9jp8se",
                  "author": "Supermite",
                  "body": "I thought it was Fitbit that bought them out.",
                  "score": 9,
                  "created_utc": 1738022032.0,
                  "replies": []
                },
                {
                  "id": "m9jthhy",
                  "author": "kayak83",
                  "body": "Fitbit bought Pebble. Google bought Fitbit.",
                  "score": 6,
                  "created_utc": 1738023400.0,
                  "replies": []
                },
                {
                  "id": "m9jqgb7",
                  "author": "TheStealthyPotato",
                  "body": "Lol, no they didn't. You've confused Garmin with Fitbit.",
                  "score": 6,
                  "created_utc": 1738022420.0,
                  "replies": []
                },
                {
                  "id": "m9l38w9",
                  "author": "Blastcheeze",
                  "body": "Fitbit bought Pebble and they actually kept things running way longer than they had any obligation to. \n\nThen Google bought Fitbit and added it to the Google Graveyard.",
                  "score": 3,
                  "created_utc": 1738038898.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9j3s4j",
      "author": "MissusNesbitt",
      "body": "Holy fuck boys, I’m so hyped. I loved my old pebbles.",
      "score": 2,
      "created_utc": 1738015483.0,
      "replies": []
    },
    {
      "id": "m9j7rkb",
      "author": "bruh-iunno",
      "body": "if they make it I'll buy it",
      "score": 2,
      "created_utc": 1738016633.0,
      "replies": []
    },
    {
      "id": "m9j7tvp",
      "author": "kcjnz",
      "body": "Pebble was flippin' great, I loved mine!",
      "score": 2,
      "created_utc": 1738016652.0,
      "replies": []
    },
    {
      "id": "m9j9n5s",
      "author": "djamp42",
      "body": "Ohhh im following this hard, I need a new one.",
      "score": 2,
      "created_utc": 1738017181.0,
      "replies": []
    },
    {
      "id": "m9jbb4x",
      "author": "PeeThenPoop",
      "body": "I loved my pebble steel(?) before they were bought out. If they can make it an open source project or similar to before, I’m all in\n\nEdit: it is open source, that’s awesome",
      "score": 2,
      "created_utc": 1738017669.0,
      "replies": []
    },
    {
      "id": "m9jd2gi",
      "author": "Lucetar",
      "body": "Loved my Pebble! I'll be following this with interest.",
      "score": 2,
      "created_utc": 1738018193.0,
      "replies": []
    },
    {
      "id": "m9je9oo",
      "author": "DarkForce8",
      "body": "I’ve been eagerly waiting for a replacement for my pebble time! Looking forward to the rebirth of pebble",
      "score": 2,
      "created_utc": 1738018552.0,
      "replies": []
    },
    {
      "id": "m9jgtbu",
      "author": "MrPeterIt",
      "body": "BEST NEWS OF 2025",
      "score": 2,
      "created_utc": 1738019333.0,
      "replies": []
    },
    {
      "id": "m9jm36e",
      "author": "Lynda73",
      "body": "I loved my pebble and wish I still had it. Only had to charge it once a week vs every day for the Apple Watch (so mine is always dead). I actually gave up even trying about a week ago and idk where my Apple Watch even is now. I also liked that pebble was very limited in what it did (basically show me my texts, time, date, weather, who’s calling). Pebble was the only useful smart watch I ever had. The last straw for me with the Apple Watch was somehow it got set on need to enter passcode to use, but that resets so fast, I couldn’t even get in the settings long enough to turn it off with the watch. Haven’t bothered doing it thru my phone because that’s when I pretty much decided f this watch and it’s been dead ever since. Had to charge that thing every single day, so sometimes I would have to charge it 5-6 times before I even used it once, because I don’t often need the time. Only thing it was useful for was the find my phone feature. And there’s disposable e-cigs that can do that. 😑",
      "score": 2,
      "created_utc": 1738021004.0,
      "replies": []
    },
    {
      "id": "m9jmht3",
      "author": "intellifone",
      "body": "Seriously would 109% consider switching from my Apple Watch. I have the 4 and have never seen a reason to upgrade except battery life on my 4 is now terrible. Always was but now it barely gets through the day. And notifications are delayed. \n\nWould love a new one to still have a heart rate monitor and GPS. But keep the screen simple. Color e-ink is a thing now. And give me at least 36 hours of battery while using the heart rate monitor",
      "score": 2,
      "created_utc": 1738021136.0,
      "replies": []
    },
    {
      "id": "m9latpf",
      "author": "Fandango_Jones",
      "body": "[Linus Tech Tips Review ](https://www.youtube.com/watch?v=8oeyv3LiKB0&t=73) 11 years ago was wild.",
      "score": 2,
      "created_utc": 1738042201.0,
      "replies": []
    },
    {
      "id": "m9ixn1t",
      "author": "PleaseDontEatMyVRAM",
      "body": "nice!",
      "score": 2,
      "created_utc": 1738013766.0,
      "replies": []
    },
    {
      "id": "m9jhtdh",
      "author": "nydjason",
      "body": "Fuck Tim Apple",
      "score": 1,
      "created_utc": 1738019646.0,
      "replies": []
    },
    {
      "id": "m9ix278",
      "author": "AdSapiens",
      "body": "I have a factory second from the first run of pebbles. \n\nJust bragging",
      "score": 2,
      "created_utc": 1738013605.0,
      "replies": [
        {
          "id": "m9l9tqw",
          "author": "SpicyRice99",
          "body": "Lol",
          "score": 2,
          "created_utc": 1738041741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9jmhyt",
      "author": "Exile714",
      "body": "Gotta give Eric his due, he’s tried and failed and tried and failed and the guy keeps trying.\n\nRIP Pebble 1.0 and Beeper.",
      "score": 1,
      "created_utc": 1738021138.0,
      "replies": []
    },
    {
      "id": "m9jnd9u",
      "author": "derrhn",
      "body": "I absolutely loved my OG red pebble.",
      "score": 1,
      "created_utc": 1738021420.0,
      "replies": []
    },
    {
      "id": "m9joyvx",
      "author": "LeCrushinator",
      "body": "Why when I open this blog post does it only take up about 10% of my monitor from side to side?",
      "score": 1,
      "created_utc": 1738021943.0,
      "replies": []
    },
    {
      "id": "m9jwacb",
      "author": "jerkcore",
      "body": "This is very promising. I recently grew fed up enough with the periodic unreliability of my fitbit sense to toss it in a drawer indefinitely, and have been woefully bare-wristed ever since.",
      "score": 1,
      "created_utc": 1738024292.0,
      "replies": []
    },
    {
      "id": "m9jz5wq",
      "author": "howln404",
      "body": "wow pebble that's a name i haven't heard in a long time",
      "score": 1,
      "created_utc": 1738025210.0,
      "replies": []
    },
    {
      "id": "m9k6voo",
      "author": "CrystalHandle",
      "body": "This is amazing. As one of backers for all of the Kickstarters, I can't wait to see what they bring. It doesn't have to be anything new or revolutionary, I just want a watch again. \n\nI just dug out my three pebbles and they all have sticky rubber from years of neglect. Can't wait to wear a new one!",
      "score": 1,
      "created_utc": 1738027673.0,
      "replies": []
    },
    {
      "id": "m9k6ws0",
      "author": "BottAndPaid",
      "body": "Sign me up this sounds awesome !",
      "score": 1,
      "created_utc": 1738027683.0,
      "replies": []
    },
    {
      "id": "m9kcr7u",
      "author": "None",
      "body": "This cool i will support could afford a pebble back then.",
      "score": 1,
      "created_utc": 1738029560.0,
      "replies": []
    },
    {
      "id": "m9kkah1",
      "author": "snowdn",
      "body": "What, best news all year!!!",
      "score": 1,
      "created_utc": 1738032038.0,
      "replies": []
    },
    {
      "id": "m9kmlml",
      "author": "DXsocko007",
      "body": "I loved pebble but things have evolved way past what they can do. I feel like it’s going to look like a cheap fisher price watch. I hope it’s cool. I just don’t know. It’s been like 10 years",
      "score": 1,
      "created_utc": 1738032804.0,
      "replies": []
    },
    {
      "id": "m9konyb",
      "author": "SSG_Vegeta",
      "body": "These were my favorite watches. I ended up buying every color on eBay when they sold to Fitbit and ran them for a while. \n\nAlas the Apple Watch won out and while I’m fond of them, I’m not too sure they could woo me. \n\nA pebble phone though? Something my iPhone could forward to or something for when I don’t need to be tempted by it? I might jive with that. \n\nGive me a 2 week battery life and barebones text and calling with e ink screen and we’re cooking.",
      "score": 1,
      "created_utc": 1738033488.0,
      "replies": []
    },
    {
      "id": "m9kthgc",
      "author": "takingbackmilton",
      "body": "I still have mine but the side buttons got worn down and tore. Hard buttons would be nice.",
      "score": 1,
      "created_utc": 1738035149.0,
      "replies": []
    },
    {
      "id": "m9kts3m",
      "author": "illAdvisedMemeName",
      "body": "I got an Apple Watch a couple years ago and love it, but if they can make a good smart watch with better battery life I will be looking for a replacement eventually.",
      "score": 1,
      "created_utc": 1738035254.0,
      "replies": []
    },
    {
      "id": "m9kwlso",
      "author": "koriroo",
      "body": "I loved my pebble smart watch, I am looking forward to this.",
      "score": 1,
      "created_utc": 1738036289.0,
      "replies": []
    },
    {
      "id": "m9l4ijv",
      "author": "JonesTownJello",
      "body": "Hell yes!!",
      "score": 1,
      "created_utc": 1738039423.0,
      "replies": []
    },
    {
      "id": "m9lekzt",
      "author": "Abba_Fiskbullar",
      "body": "Unfortunately, all of my Pebbles, some of which were preproduction, disintegrated within a year. My skin pH destroys rubber and glue.",
      "score": 1,
      "created_utc": 1738044015.0,
      "replies": []
    },
    {
      "id": "m9lfyn3",
      "author": "Practical-Custard-64",
      "body": "I had the original Pebble Steel back in the day. It had a chronic design fault that meant that the connection to the screen wasn't secure and it showed garbled patterns. I went through 3 of them and shortly before the company went belly up they wanted to \"upgrade\" me to the Pebble Time, which just looked and felt like a cheap piece of plastic. They refused to let me have a Pebble Time Steel even if I paid the extra.\n\nI really liked the Pebble Steel (when it worked) but didn't like the downgrade to the Pebble Time. I went out and bought an Android Wear (which later became WearOS) watch. The LG Urbane if memory serves.",
      "score": 1,
      "created_utc": 1738044707.0,
      "replies": []
    },
    {
      "id": "m9lipr7",
      "author": "npete",
      "body": "I think I owned 5 OG retail Pebbles, total.  My first two, iirc, had bad vibe motors.  Then I had a couple that had display issues and I think my last one still worked, but after so many failing Pebbles, I was ready to move on and not wait for the last one to fail, especially since the Pebble company was shutting down.  To clarify, these were all replaced under the warranty, though the last couple were beyond the original warranty but the replacements failed so soon after I got them, that they replaced them under the repair warranty.  Anyway, I loved using the Pebble.  It was so simple and intuitive and I thought they looked great on my wrist.  That said, I don't know that I'll be pre-ordering one or anything because I am still feeling pretty burned.  All these years later.",
      "score": 1,
      "created_utc": 1738046152.0,
      "replies": []
    },
    {
      "id": "m9liw2s",
      "author": "retainftw",
      "body": "I've still got two of the original Kickstarter ones in my closet. Are they good for anything still?",
      "score": 1,
      "created_utc": 1738046247.0,
      "replies": []
    },
    {
      "id": "m9ln4cz",
      "author": "ralphonsob",
      "body": "He's going to have to fight the Indian [Pebble Watch](https://www.pebblecart.com/collections/digital-smartwatches) people for the name.",
      "score": 1,
      "created_utc": 1738048599.0,
      "replies": []
    },
    {
      "id": "m9longg",
      "author": "Calimariae",
      "body": "I still have mine in this drawer right here.",
      "score": 1,
      "created_utc": 1738049497.0,
      "replies": []
    },
    {
      "id": "m9lxnbc",
      "author": "tdutim",
      "body": "Huge fan. Still have mine.",
      "score": 1,
      "created_utc": 1738055177.0,
      "replies": []
    },
    {
      "id": "m9msz2h",
      "author": "dargonmike1",
      "body": "I remember buying a couple backgrounds/ color schemes from their official App Store. This was back in 2018 or so, I never got those backgrounds :(",
      "score": 1,
      "created_utc": 1738071337.0,
      "replies": []
    },
    {
      "id": "m9ngmwu",
      "author": "PeriodicAnxiety",
      "body": "i’ve been missing a smartwatch since my pebbles died (all of them 🥲) but no others compare. i’m sure it wouldn’t be as free and open as it was before, but pebble maybe returning is the bit of hopeful news i needed today. but pebble would be the only smartwatch to make me put down my casio again if they did come back",
      "score": 1,
      "created_utc": 1738078965.0,
      "replies": []
    },
    {
      "id": "m9ra30y",
      "author": "ant1992",
      "body": "Genuine question. How is pebble going to compete 10 years later with everyone having an Apple Watch or samsung watch on their wrists? I had a pebble and it was amazing. People recognized it and always asked about it (before Apple Watch was released). Pebble was gaining heavy traction until apple came through and Fitbit acquired them. I don’t see any hype  happening unless they market the shit out if it. I can only see the hype for a very small niche market. Unless the keep it low cost and dominate on Amazon above the cheap Chinese watches that barely work",
      "score": 1,
      "created_utc": 1738119055.0,
      "replies": [
        {
          "id": "mipyxyz",
          "author": "Affectionate-Boot-58",
          "body": "They said they're not going to compete with the other watches out there That's one of the main reasons why pebble failed a decade ago",
          "score": 1,
          "created_utc": 1742432778.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ma2vf1e",
      "author": "SsooooOriginal",
      "body": "Gonna be sad when people get this and realize we are no longer in the days when you can just skip tracks without having your own music or a premium sub to something. ",
      "score": 1,
      "created_utc": 1738271236.0,
      "replies": []
    },
    {
      "id": "m9ky4lo",
      "author": "thewolfman2010",
      "body": "I’m confused by reading his blogs. He intends to bring back Pebble in almost an identical format as the original, yet expects it to be a different outcome? I fail to see how this will succeed other than being a cheap smartwatch that most people won’t want. I was an original Pebble backer and had one when they launched, I don’t see that with beefed up specs competing with Apple, Garmin, etc.",
      "score": 1,
      "created_utc": 1738036864.0,
      "replies": [
        {
          "id": "m9lny3q",
          "author": "ralphonsob",
          "body": "I could still see a light cheap watch with long battery life, with smart functions like notification display and music control, having a pretty good market. Like a modernized Casio digital watch. (How they haven't updated those in 40 years is beyond me.)\n\nThe customizable display would give it fashion appeal too.",
          "score": 1,
          "created_utc": 1738049077.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9j2tz9",
      "author": "bindermichi",
      "body": "That‘s a good question Eric. I can‘t think of a single reason other than grifting more investor money",
      "score": 0,
      "created_utc": 1738015212.0,
      "replies": []
    },
    {
      "id": "m9jt7o8",
      "author": "RunningM8",
      "body": "This is cute and all but I could never give up my Apple Watch, it’s a tiny iPhone on my wrist. I’m so reliant on it it’s more important to me than my phone.",
      "score": 0,
      "created_utc": 1738023311.0,
      "replies": []
    },
    {
      "id": "m9jb29r",
      "author": "nosajdriab",
      "body": "Best phone. Long battery life. No crazy bells and whistles but the basics. Count me in!!",
      "score": 0,
      "created_utc": 1738017596.0,
      "replies": []
    },
    {
      "id": "m9jx0gn",
      "author": "sergantsnipes05",
      "body": "Pebble was cool when it was the only thing. \n\nI can’t see people going back to it. The Apple Watch ecosystem is just too big now",
      "score": -3,
      "created_utc": 1738024523.0,
      "replies": []
    },
    {
      "id": "m9kz5tu",
      "author": "Zubon102",
      "body": "Yes! Please please please bring it back.  \n  \nI don't need all this health and exercise monitoring crap. I don't want to charge it every day, or even once a week. I don't need a tiny touchscreen. I don't even need color.",
      "score": 0,
      "created_utc": 1738037264.0,
      "replies": []
    },
    {
      "id": "m9lmgsg",
      "author": "sucobe",
      "body": "Wow. Haven’t heard that name in forever. My very first smart watch.",
      "score": 0,
      "created_utc": 1738048222.0,
      "replies": []
    },
    {
      "id": "m9mxaxy",
      "author": "Tupperwarfare",
      "body": "Sorry bud. I was an early adopter. And upgraded to the next model after that. Then you sold out and abandoned us. \n\nNO THANKS.",
      "score": -1,
      "created_utc": 1738072869.0,
      "replies": [
        {
          "id": "m9o0tbi",
          "author": "heyfergy",
          "body": "He didn't \"sell out\", the company was collapsing and about to go under and he sold it to save what he could.",
          "score": 2,
          "created_utc": 1738084701.0,
          "replies": []
        },
        {
          "id": "mipz4p9",
          "author": "Affectionate-Boot-58",
          "body": "The company was failing so he had to sell to fitbit  🤦",
          "score": 1,
          "created_utc": 1742432842.0,
          "replies": [
            {
              "id": "miq0oae",
              "author": "Tupperwarfare",
              "body": "Sucks, for sure, but I don’t want to jump back into an ecosystem that may or may not be there in a couple years… like last time.",
              "score": 0,
              "created_utc": 1742433379.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9jo872",
      "author": "Mysterious_Case9576",
      "body": "Owned two. Returned them both. Hardware was as lackluster as the OS, even back then. The smartwatch market IS Apple for a majority of consumers. Why even bother?",
      "score": -15,
      "created_utc": 1738021701.0,
      "replies": [
        {
          "id": "m9jrgfl",
          "author": "sunkenrocks",
          "body": "For starters, an apple watch is useless on android, 71% of the global smart phone market...",
          "score": 7,
          "created_utc": 1738022746.0,
          "replies": [
            {
              "id": "m9jsb70",
              "author": "Mysterious_Case9576",
              "body": "And 2/3 of the major brands (Apple/Samsung/Google) already cater exclusively to Android",
              "score": -6,
              "created_utc": 1738023023.0,
              "replies": [
                {
                  "id": "m9jt0qe",
                  "author": "sunkenrocks",
                  "body": "Yes, so Android users are already used to multiple vendors converging on one OS... Also, this is Google, you do realise that? Fitbit bought Pebble which Google now own...",
                  "score": 1,
                  "created_utc": 1738023250.0,
                  "replies": [
                    {
                      "id": "m9k6k14",
                      "author": "Mysterious_Case9576",
                      "body": "It was a device with a lot of potential that nobody seemed to care about nowadays it seems that people don’t really care about these devices and if they do, they already have a device which is made by Apple or Samsung. It is the way it is. It’s cute that he’s owning up to his past discretions butagain who cares it’s a market that’s already boring in 2025.",
                      "score": 0,
                      "created_utc": 1738027570.0,
                      "replies": [
                        {
                          "id": "m9kcz57",
                          "author": "sunkenrocks",
                          "body": "Smart watches don't last forever, especially with their small batteries. What you really mean is you're not personally interested and surprisingly this product line isn't solely marketed to you.",
                          "score": 2,
                          "created_utc": 1738029632.0,
                          "replies": [
                            {
                              "id": "m9kiap7",
                              "author": "Mysterious_Case9576",
                              "body": "I had two. It was clearly for me and I was an early adopter through Kickstarter. I’ve had several Apple Watches since and currently. I can’t see any reason to look at anything else. I am a majority of people. THAT’S what these guys never understand.",
                              "score": -1,
                              "created_utc": 1738031374.0,
                              "replies": [
                                {
                                  "id": "m9ltrzo",
                                  "author": "Lucaboox",
                                  "body": "I was also an early adopter and had the pebble and pebble time, now use an Apple Watch but would rather have a pebble any day but both of mine broke I wanted the more slim time 2 but was never able to get one before they went crazy in price. I hate having to charge my Apple Watch every night and don’t even use half the features only need some smalls apps and texting with voice, the pebble time had that.",
                                  "score": 1,
                                  "created_utc": 1738052656.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9l7i1j",
      "author": "tommyalanson",
      "body": "Going to dig out your old Palm Pilot too?",
      "score": -4,
      "created_utc": 1738040699.0,
      "replies": []
    },
    {
      "id": "m9j60dn",
      "author": "50_K",
      "body": "God my Pebble was such a PoS that it made me swear off smart watches for years. Good luck with round two I guess...",
      "score": -12,
      "created_utc": 1738016125.0,
      "replies": [
        {
          "id": "m9j7si5",
          "author": "Starbreiz",
          "body": "Aww why? Which model? I adored mine.",
          "score": 2,
          "created_utc": 1738016641.0,
          "replies": [
            {
              "id": "m9jdca6",
              "author": "50_K",
              "body": "It's been a decade I can't remember which model. It always had syncing and charging problems. Wasn't particularly comfortable either.",
              "score": -2,
              "created_utc": 1738018275.0,
              "replies": [
                {
                  "id": "m9jpai1",
                  "author": "Starbreiz",
                  "body": "Bummer! I was just curious, I had two different models, I've also forgotten which :) I especially liked the e-ink display and long battery life. I think I replaced the band for comfort, but I've been on the Apple Watch platform since Google killed Pebble. (I meant fitbit, thanks for the corrections)",
                  "score": 1,
                  "created_utc": 1738022047.0,
                  "replies": [
                    {
                      "id": "m9lmhjg",
                      "author": "beaurepair",
                      "body": ">since Google killed Pebble.\n\nPebble killed pebble (read Eric's blog about why they failed), and Fitbit bought the IP, then Google bought FitBit \n\nGoogle kills plenty, but google had nothing to do with the death of Pebble",
                      "score": 2,
                      "created_utc": 1738048234.0,
                      "replies": [
                        {
                          "id": "m9oe5a9",
                          "author": "Starbreiz",
                          "body": "Apologies - I brain farted there and said the wrong company. I appreciate the correction. (I did know it was Fitbit as I wore the last model of Pebble that was made.) I moved to the Fitbit watch after, hated it, and got an Apple Watch.",
                          "score": 1,
                          "created_utc": 1738088354.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m9jsool",
                      "author": "50_K",
                      "body": "I felt like the Fossil hybrids did the whole e-ink thing a lot better. They also looked wayyyy better than the Pebble. Considering the Pebble failed when it had first mover advantage it seems kind of laughable they would try to release it with tons of fantastic competition at all price points now.",
                      "score": -2,
                      "created_utc": 1738023142.0,
                      "replies": [
                        {
                          "id": "m9lmdm2",
                          "author": "beaurepair",
                          "body": "Fossil hybrids lack a lot of features, have garbage displays and notifications are super unreliable and unactionable. Music control barely worked and just felt bloated.",
                          "score": 0,
                          "created_utc": 1738048172.0,
                          "replies": [
                            {
                              "id": "m9mjl7h",
                              "author": "50_K",
                              "body": "lol you just described my Pebble!",
                              "score": 0,
                              "created_utc": 1738067604.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}