{
  "post": {
    "title": "Canon R50 V review: An affordable vlogging camera that lags behind its rivals",
    "author": "dapperlemon",
    "id": "1m04rmo",
    "score": 65,
    "created_utc": 1752542926.0,
    "selftext": "",
    "num_comments": 11,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m04rmo/canon_r50_v_review_an_affordable_vlogging_camera/"
  },
  "comments": [
    {
      "id": "n36nhx5",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752542927.0,
      "replies": []
    },
    {
      "id": "n37c6pz",
      "author": "HansBooby",
      "body": "canon in a nutshell",
      "score": 22,
      "created_utc": 1752552192.0,
      "replies": [
        {
          "id": "n37o4wy",
          "author": "speculatrix",
          "body": "Canon have always segmented their market and deliberately made any non-35mm-sensor cameras badly inferior to their full sized bodies. \n\nThey didn't seem to realise that there's a lot of people who want compact bodies that are packed with cutting edge features. Hence OMD and the OM1 unit with the micro four thirds sensor. Or to some extent Sony and the A6700 with APSc sensor.",
          "score": 12,
          "created_utc": 1752557768.0,
          "replies": [
            {
              "id": "n40mv7i",
              "author": "Griffdude13",
              "body": "I LOVE my A6700. Overheating issues aside (happens far less as long as you fold the screen out from the body), it punches way above what its $1400 price tag suggests.",
              "score": 2,
              "created_utc": 1752941933.0,
              "replies": [
                {
                  "id": "n40w1zx",
                  "author": "speculatrix",
                  "body": "I've been very impressed with the technical capabilities of my a6700. Not such a fan of the user interface.\n\nEdit: fixed autocorrect \"user interface\"",
                  "score": 2,
                  "created_utc": 1752944809.0,
                  "replies": [
                    {
                      "id": "n40webl",
                      "author": "Griffdude13",
                      "body": "I will say that Canon has a much easier menu to navigate on their devices. Sony’s still leaves a lot to be desired. \n\nThat being said, it’s still better than what it used to be. The old menus from previous generations was one of the most infuriating things to navigate.",
                      "score": 1,
                      "created_utc": 1752944911.0,
                      "replies": [
                        {
                          "id": "n45cot8",
                          "author": "speculatrix",
                          "body": "Really? My main camera is a Lumix and I found it quite intuitive. I can't believe Sony cameras used to be worse. I guess if you only ever used Sony, you'd become familiar and never think there was anything wrong.",
                          "score": 1,
                          "created_utc": 1753010244.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n37rorx",
              "author": "dearpisa",
              "body": "They’re only primarily full-frame manufacturers who have a dual card slot APS-C body with IBIS (Canon R7). Sony and Nikon don’t have such a body at all, Panasonic has M43 pro bodies, and Fujifilm is primary APS-C to begin with\n\nOr, in short, they have the best APS-C body amongst the full-frame brands",
              "score": 3,
              "created_utc": 1752559600.0,
              "replies": [
                {
                  "id": "n3abhh4",
                  "author": "runandgum",
                  "body": "Sony’s FX30 has dual card slots and IBIS. Although, it lacks a mechanical shutter, if some photographers need this.",
                  "score": 2,
                  "created_utc": 1752596766.0,
                  "replies": [
                    {
                      "id": "n3amg64",
                      "author": "dearpisa",
                      "body": "Right, I know nothing about the cinema bodies, but they’re probably not comparable anyway (shutter, and much higher price, and probably not enough advanced photography features?)",
                      "score": 1,
                      "created_utc": 1752599736.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n39qosl",
      "author": "No_Free_Samples",
      "body": "We as a society don’t need to give any more tools to Vloggers",
      "score": 6,
      "created_utc": 1752590956.0,
      "replies": []
    }
  ]
}