{
  "post": {
    "title": "Nintendo has teamed up with Japan’s online marketplaces to fight Switch 2 scalping | Mercari, Yahoo Auction and Rakuten are all working to stop Switch 2 consoles being resold.",
    "author": "a_Ninja_b0y",
    "id": "1kwwu8z",
    "score": 928,
    "created_utc": 1748375223.0,
    "selftext": "",
    "num_comments": 119,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kwwu8z/nintendo_has_teamed_up_with_japans_online/"
  },
  "comments": [
    {
      "id": "mul6zzb",
      "author": "garry4321",
      "body": "And FB marketplace/kijiji probably putting out scalping guides and a recommended price fix to ensure top scalping dollar",
      "score": 100,
      "created_utc": 1748380980.0,
      "replies": [
        {
          "id": "mum4ouj",
          "author": "cat_prophecy",
          "body": "Well both people are equally assholes to me. If people wouldn't pay scalper prices then scalpers wouldn't have reason to call shit.",
          "score": 27,
          "created_utc": 1748391973.0,
          "replies": [
            {
              "id": "muoi0sr",
              "author": "M1QN",
              "body": "Scalpers don’t lose money on you not buying hardware, that’s the problem. They purchase things with bots, then sell them on local marketplaces, but unlike e.g. concert or football matches tickets there is no pressure for them to sell it, if nobody buys a console or a gpu they just return it, get a full refund and buy it again and can repeat so indefinitely. It would maybe work if absolutely nobody purchased from them, but that is never going to be the case. And getting few thousand dollars even from 200-300k investment with no chance of losing money will always be considered good",
              "score": -8,
              "created_utc": 1748431163.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mul2frw",
      "author": "Takenabe",
      "body": "I'm sure as hell not going to be reselling mine; it's staying right on the store shelf collecting dust where it belongs.",
      "score": 170,
      "created_utc": 1748379603.0,
      "replies": [
        {
          "id": "mum56hi",
          "author": "edwardthefirst",
          "body": "I feel like it would be great friends with my ps5",
          "score": 25,
          "created_utc": 1748392141.0,
          "replies": []
        },
        {
          "id": "murohhu",
          "author": "feartheoldblood90",
          "body": "Lol. I do not besmirch you deciding not to buy the Switch 2, that's your prerogative and I understand why you wouldn't, but there's no world in which \"your\" Switch 2 that you don't buy isn't immediately scooped up by someone else. There won't be a single Switch 2 gathering dust on any store shelves",
          "score": 5,
          "created_utc": 1748465930.0,
          "replies": []
        },
        {
          "id": "mulfvg2",
          "author": "TeknoPagan",
          "body": "Agreed. This “we can brick your purchase” attitude says I save a lot of money.",
          "score": 53,
          "created_utc": 1748383741.0,
          "replies": [
            {
              "id": "mumpkd6",
              "author": "Various_Librarian750",
              "body": "Yes, same reason to not get a PS5 as well since they also have a bricking clause.",
              "score": 10,
              "created_utc": 1748399123.0,
              "replies": [
                {
                  "id": "munv4ga",
                  "author": "elton_john_lennon",
                  "body": "Wait what?! Did they add that later on, or was it in the agreement from the beginning?",
                  "score": 5,
                  "created_utc": 1748418686.0,
                  "replies": [
                    {
                      "id": "munzxru",
                      "author": "Faster319",
                      "body": "It was in there since the beginning.",
                      "score": 6,
                      "created_utc": 1748421561.0,
                      "replies": [
                        {
                          "id": "muo0ju9",
                          "author": "elton_john_lennon",
                          "body": "I would expect reddit to flip the table and roar because of that, and I'm finding about it in a comment section of an unrelated article. For a brief second I thought about buying PS5 solely for PSVR2, but now that idea is dead.",
                          "score": 3,
                          "created_utc": 1748421925.0,
                          "replies": [
                            {
                              "id": "muo1p9u",
                              "author": "Faster319",
                              "body": "It's because game journos have realised they get more clicks from creating articles with misleading headlines, especially within regards to Nintendo. A good example is the whole $90 debacle or the \"all games being a download key\", people currently have such a hatred for Nintendo that any article containing any sort of negativity surrounding it will get latched on immediately and spread.\n\nThe same thing wouldn't happen with the PS5 since that just won't get the same amount of clicks, so journalists don't bother reporting on it. At least that's my take on the whole situation.",
                              "score": 7,
                              "created_utc": 1748422604.0,
                              "replies": [
                                {
                                  "id": "muo3bfi",
                                  "author": "elton_john_lennon",
                                  "body": "> all games being a download key\"\n\nWait, wasn't it the case that nintendo wants games to be downloaded and even games that have a memory card will have to download something from the servers to work? I thought that was the deal. \n\n^^^^^^.\n\nThe way I understand it, the problem was that nintendo simply wants to have total control over the game market. They have 0% control over physical copies that are 100% self contained on the physical medium they are distributed with, and they wanted to change that. If you already sell a box in the store, there is no reason for it not to have all of the game files on it. Adding requirement for download or even just a server connection, makes you now dependant on nintendo and lets them control second hand/used market. \n\n^^^^^^.\n\nNegativity towards nintendo comes from such practices and overall nintendo pettiness I believe, lawsuits and all, they seem to be the gaming equivalent of disney.\n\nSure it is a business, but so is valve for example, they also make a ton of money and their approach to consumer/customer is completely different even though they do also have 100% total controll over games that they sell, but their case is different because they only have digital distribution, and they do massive sales. Nintendo wants to do both, have games be $60 indefinitely, no sales, and also have them be digital and dependant on their will to let you play them.",
                                  "score": 0,
                                  "created_utc": 1748423569.0,
                                  "replies": [
                                    {
                                      "id": "muo9zfx",
                                      "author": "FireLucid",
                                      "body": "Except all Nintendo games are fully on cartridge and it's 3rd parties offering the download stuff. It's up to the Dev. Cyberpunk is fully on cartridge for example. I'll be picking that up next week.",
                                      "score": 4,
                                      "created_utc": 1748427337.0,
                                      "replies": [
                                        {
                                          "id": "muofj74",
                                          "author": "elton_john_lennon",
                                          "body": "> Except all Nintendo games are fully on cartridge and it's 3rd parties offering the download stuff\n\nWhy would it matter which ones are which? The move is clear and it is about control, especially given that as I've just learned they implemented \"we can brick your purchase” strategy.",
                                          "score": -1,
                                          "created_utc": 1748430048.0,
                                          "replies": [
                                            {
                                              "id": "mus56lm",
                                              "author": "FireLucid",
                                              "body": "Every Nintendo game is fully on cartridge and does not need anything form the server to work. Unless there is a required day 1 patch for the console, you can never connect it online and play all games they release minus any online features of course. This gives them the least control of the 3 options for distributing games at retail.\n\nAs for bricking the console, I live somewhere that has actual consumer laws about that stuff so they didn't even try it.",
                                              "score": 1,
                                              "created_utc": 1748471006.0,
                                              "replies": [
                                                {
                                                  "id": "muuj4hw",
                                                  "author": "elton_john_lennon",
                                                  "body": "You repeated the same thing about nintendos own titles as if that mattered and changed anything. Like I asked before - why would it matter which ones are which? \n\nThey just increased control and showed their true colours, you are just lucky that some of that control may not affect you, but that doesn't change their intentions. \n\n\nI own Quest3, I can and do use it without connecting it to the internet at all, just standalone and PC over WiFi without internet connection, and Meta own titles can be played without internet connection after initial purchase and download if they are not multiplier ones. Does that change who Meta is, what their intentions are, and that they want to have control, just because I use it offline and happen to live where gdpr should be protecting me? Not in the slightest. \n\nIf people show that they are ok with being walked over by nintendo, and that they buy those key card boxes just fine, next edition of the console might be digital only for all the titles.",
                                                  "score": -1,
                                                  "created_utc": 1748506171.0,
                                                  "replies": [
                                                    {
                                                      "id": "muyvu10",
                                                      "author": "FireLucid",
                                                      "body": "> You repeated the same thing about nintendos own titles as if that mattered and changed anything. Like I asked before - why would it matter which ones are which?\n\nYou had an incorrect preconceived idea (Nintendo are forcing downloads), started off you post with that, then went on about to about how it's because Nintendo is all about 100% control, and you are dependent on their servers and you have to download it they somehow have control over the 2nd hand market.\n\nThen when I pointed out this was not the case and especially not for Nintendo, you double down and say it doesn't matter what Nintendo are doing?\n\nClearly, 3rd party publishers can choose how they distribute their games, just as they do on Xbox or PS5. Fully on disc, disc/card with download required (they are calling it a key card) or code in a box (ew). All platforms have this except PC which don't really do much retail distribution at all.\n\nMS and Sony all have the same options. You can sell a full game or a card/disc with a download required and you cannot sell a code in a box as it's a single use code and just about everyone thinks it's pretty shit.\n\nSeems like Sony and MS are the ones after more control, they have both sold devices that don't take physical media at all, either full stop or require another purchase.\n\nSo in the end, I don't understand your point at all as there is nothing here that Sony and MS are not already doing.",
                                                      "score": 1,
                                                      "created_utc": 1748558528.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "muwzv1m",
                                      "author": "Various_Librarian750",
                                      "body": "If Nintendo wanted games to be downloaded they would have gone and removed the cartridge slot from the console. As a business their motive will always be to earn from as many revenue streams as possible, which is why we have so many options to buy the same game.",
                                      "score": 1,
                                      "created_utc": 1748538735.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mus8nnm",
                              "author": "zeelbeno",
                              "body": "Nah i wouldn't expect it tbh unless it's put right in their face.\n\nJust like how reddit didn't care about palestine until 2023",
                              "score": 2,
                              "created_utc": 1748472138.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "muwz8zj",
                      "author": "Various_Librarian750",
                      "body": "It has always been there. I have not gone through the Xbox clause but I will not be surprised if there is one there too. Gaming outlets and especially \"gamers\" love to spread half information, so even if my college degree is useless, I learnt one valuable thing there: do your research.",
                      "score": 1,
                      "created_utc": 1748538565.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mund6ec",
              "author": "FUTURE10S",
              "body": "I wish all Switch 2 owners a very unpatchable hardware exploit that allows emergency reflashing of BIOS/system firmware to break Nintendo's bullshit.",
              "score": 4,
              "created_utc": 1748408868.0,
              "replies": []
            },
            {
              "id": "mulxvrh",
              "author": "Dhiox",
              "body": "You do understand that nothing changed right? That was always on their terms of service, and is on everyone else's. The reporting was just ragebait trying to bank on the already existng anger about the price to get clicks",
              "score": 4,
              "created_utc": 1748389660.0,
              "replies": [
                {
                  "id": "munrzdj",
                  "author": "TheModeratorWrangler",
                  "body": "Not sure why you’re being downvoted like I literally went through hell to preserve a launch day Animal Crossing to do the crown duping glitch because I knew the moment I update that’s gone. Nintendo has always had this stance and I remember seeing the article and thinking “how is this news?”",
                  "score": 1,
                  "created_utc": 1748416826.0,
                  "replies": [
                    {
                      "id": "muokxr0",
                      "author": "MagmaSeraph",
                      "body": "Because a bunch of entitled babies just started getting their first consoles.\n\n\nI remember when Nintendo was bricking 3DS because of modding way back in the day.\n\n\nI'm an old pirate; if you want to mod your console, do it and share your results with the community without giving up too much info on yourself. There's always a way around this stuff.\n\n\nDon't sit there and pretend Nintendo or most other companies will sit there and gleefully allow you to tinker with their stuff.",
                      "score": 0,
                      "created_utc": 1748432415.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mun1h66",
              "author": "okram2k",
              "body": "I was on the fence of getting one but the more we get closer to launch the more I'm just \"nah\"",
              "score": 1,
              "created_utc": 1748403612.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mul48vl",
          "author": "hockeyfan608",
          "body": "Lmao\n\nYeah sure it is",
          "score": -25,
          "created_utc": 1748380141.0,
          "replies": [
            {
              "id": "mulmsfo",
              "author": "Daiquiri-Factory",
              "body": "It is for me. Fuck that. I have a Steam Deck. I love my switch, but the ability to have someone turn off something physical that I purchased? Yeah, never getting one. But you do you.",
              "score": 10,
              "created_utc": 1748386018.0,
              "replies": [
                {
                  "id": "mulws5a",
                  "author": "hockeyfan608",
                  "body": "Sure\n\nI’m not getting one either (for now)\n\nBut your just delusional if you think any of these are just gonna be sitting on the shelf for the foreseeable future",
                  "score": -13,
                  "created_utc": 1748389298.0,
                  "replies": [
                    {
                      "id": "mum7fbr",
                      "author": "Daiquiri-Factory",
                      "body": "They are getting downvoted for calling people delusional, without knowing what the people they called that really think. That would be my guess. It’s not what you say, it’s how you say it.",
                      "score": 9,
                      "created_utc": 1748392904.0,
                      "replies": []
                    },
                    {
                      "id": "mum4w39",
                      "author": "loblegonst",
                      "body": "No idea why you got down voted? Since you're absolutely right. Its going to sell a ridiculous amount. Even with all the bad press.",
                      "score": -6,
                      "created_utc": 1748392042.0,
                      "replies": [
                        {
                          "id": "muqceck",
                          "author": "edvek",
                          "body": "They never said it won't sell well, everyone knows it will. They said they won't be buying it. Then the guy was like \"ya sure\" implying \"you're going to buy it anyway, don't lie\" when there are people out there who will not be buying it because of the costs and other shenanigans Nintendo is pulling.\n\nWould a switch 2 be nice to have? Sure. Is it worth the price they are asking? Hell no.",
                          "score": 0,
                          "created_utc": 1748452258.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mum6ulv",
                  "author": "DiZial",
                  "body": "Why do you love your Switch then? Nintendo has had this capability for multiple consoles now, people are just finally realizing it",
                  "score": -10,
                  "created_utc": 1748392708.0,
                  "replies": [
                    {
                      "id": "mum73kd",
                      "author": "Daiquiri-Factory",
                      "body": "I like Smash Bros, Mario Kart, and many other Nintendo franchises. I also play most of them emulated on the deck. And no, they haven’t. My switch has never been connected to WiFi. Lmao.",
                      "score": 5,
                      "created_utc": 1748392792.0,
                      "replies": [
                        {
                          "id": "munhpwj",
                          "author": "CutsAPromo",
                          "body": "Why even have a switch?  Steamdeck runs zelda better than the switch lol",
                          "score": 2,
                          "created_utc": 1748411145.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "muof4n4",
          "author": "Herban_Myth",
          "body": "Agreed. Staying far away from Nintendo.",
          "score": -3,
          "created_utc": 1748429864.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mukpety",
      "author": "Musetrigger",
      "body": "Good fight. Show the scalpers they're not welcome.",
      "score": 96,
      "created_utc": 1748375893.0,
      "replies": []
    },
    {
      "id": "munq69c",
      "author": "Vigorously_Swish",
      "body": "Love the effort. It will probably help, but definitely won’t kill it.",
      "score": 10,
      "created_utc": 1748415769.0,
      "replies": []
    },
    {
      "id": "mulhg2d",
      "author": "stgiga",
      "body": "Scalpers are trash.",
      "score": 30,
      "created_utc": 1748384249.0,
      "replies": [
        {
          "id": "mun0jkd",
          "author": "RSufyan",
          "body": "Without emotions, can u explain why?",
          "score": -44,
          "created_utc": 1748403227.0,
          "replies": [
            {
              "id": "mun1ii4",
              "author": "tony971",
              "body": "They add no value to the products. They simply add in a tiered pricing model that makes products exactly as expensive as people are willing to pay for them. And they take the difference for their trouble. If they disappeared, nothing of value would be lost and people who buy the products to own them would have more money to spend on other things.",
              "score": 39,
              "created_utc": 1748403627.0,
              "replies": [
                {
                  "id": "muni883",
                  "author": "Windowplanecrash",
                  "body": "They also limit availability, reducing the chances people with lower incomes could afford the switch 2. ",
                  "score": 20,
                  "created_utc": 1748411409.0,
                  "replies": []
                },
                {
                  "id": "mun3fmc",
                  "author": "WolverinesThyroid",
                  "body": "I'm not defending scalpers, but the value they add is they let people with extra money buy a console without having to fight for a preorder.  They just pay 2x markup or whatever and get the thing they want.\n\nScalpers also usually account for less than 5% of sales.",
                  "score": -56,
                  "created_utc": 1748404432.0,
                  "replies": [
                    {
                      "id": "munjzp3",
                      "author": "Marble_Dude",
                      "body": "And who are those people fighting for a preorder? Exactly, scalpers too. These leeches buy them in bulk like a family of 5 every week. They just create an artificial demand and take advantage of desperate people.",
                      "score": 24,
                      "created_utc": 1748412338.0,
                      "replies": [
                        {
                          "id": "muor5zd",
                          "author": "WolverinesThyroid",
                          "body": "but you talk like most the preorders go to scalpers.  When in reality most go to normal people.",
                          "score": -13,
                          "created_utc": 1748434856.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mun4jy9",
                      "author": "tony971",
                      "body": "Yeah instead of 20 people buying a product before it goes OOS, they can all wait and buy it for 2x the price from one guy who bought all of them right when they became available. Scalpers help create the market urgency that you say they’re alleviating.",
                      "score": 26,
                      "created_utc": 1748404912.0,
                      "replies": [
                        {
                          "id": "mung5ui",
                          "author": "mach1alfa",
                          "body": "and if graphics card are anything to go by, manufacturers will increase the prices themselves when they see people are fine with paying 2x with a middleman, screwing people who are willing to wait no matter what",
                          "score": 12,
                          "created_utc": 1748410350.0,
                          "replies": [
                            {
                              "id": "munk7ob",
                              "author": "heyhotnumber",
                              "body": "This is unfortunately an unregulated capitalism problem and not the fault of people doing what they legally can to make money. \n\nShareholders *gleefully* advocate for **much** more aggressive anti-consumer behavior all of the time and that’s just a standard form of business. \n\nScalping will keep happening as long as it’s legal to do so. It’s literally just supply and demand at work.",
                              "score": 5,
                              "created_utc": 1748412456.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "muorbug",
                          "author": "WolverinesThyroid",
                          "body": "It would be more like instead of 20 people buying the product for themselves 19 are buying it for themselves and 1 is buying it to sell.  Then 1 person who didn't bother gets that product because they had more money to spend.\n\nIt's not great but its the minority.",
                          "score": -3,
                          "created_utc": 1748434915.0,
                          "replies": [
                            {
                              "id": "muoycv3",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1748437409.0,
                              "replies": [
                                {
                                  "id": "mup8l2a",
                                  "author": "WolverinesThyroid",
                                  "body": "scalpers sell there products at a much slower rate than a store. If a store gets 10 items today that are in high demand they will be gone by the end of the day at the soonest. A scalper could be trying to sell that same item online for days to weeks.",
                                  "score": 0,
                                  "created_utc": 1748440729.0,
                                  "replies": [
                                    {
                                      "id": "mup96fh",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 0,
                                      "created_utc": 1748440911.0,
                                      "replies": [
                                        {
                                          "id": "mupd17w",
                                          "author": "WolverinesThyroid",
                                          "body": "not really. They are allowing someone to exchange money for time.",
                                          "score": 0,
                                          "created_utc": 1748442071.0,
                                          "replies": [
                                            {
                                              "id": "mupfm5f",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": 1,
                                              "created_utc": 1748442819.0,
                                              "replies": [
                                                {
                                                  "id": "mupl37l",
                                                  "author": "WolverinesThyroid",
                                                  "body": "You know more than 2 people in the world exist.  10 products are available 9 normally people and a scalper buy the products.  The product is $100.  I didn't wait in line for the product but I want it, so I give the scalper $200.  I paid $100 extra to not have to deal with fighting crowds to get it. I was never going to be that 10th person in line.  This is fictitious me not real me by the way.",
                                                  "score": 1,
                                                  "created_utc": 1748444377.0,
                                                  "replies": [
                                                    {
                                                      "id": "mupqlhv",
                                                      "author": "None",
                                                      "body": "[deleted]",
                                                      "score": 1,
                                                      "created_utc": 1748445940.0,
                                                      "replies": [
                                                        {
                                                          "id": "muqds5x",
                                                          "author": "WolverinesThyroid",
                                                          "body": "but companies don't do that.  Nintendo doesn't think 10 people want the Switch 2.  They think that they can make X units before release. Sometimes they can make more but they may artificially deflate the numbers so that it can have a big buzz about being hard to get and selling out.\n\nIf the store has 10 that means closer to 20+ people want it.",
                                                          "score": 1,
                                                          "created_utc": 1748452667.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mukrlfe",
      "author": "NOUSEORNAME",
      "body": "Good luck.",
      "score": 18,
      "created_utc": 1748376521.0,
      "replies": []
    },
    {
      "id": "musryjx",
      "author": "fusiondynamics",
      "body": "Blame the idiots who pay scalper prices instead of just waiting.  No buyers no scalpers.",
      "score": 2,
      "created_utc": 1748478630.0,
      "replies": []
    },
    {
      "id": "mulj5vn",
      "author": "RailGun256",
      "body": "good. the only unfortunate thing is that it really only targets the Japan centric marketplaces. Hopefully this sets a precedent where it can happen at an international scale.",
      "score": 4,
      "created_utc": 1748384812.0,
      "replies": [
        {
          "id": "mulybob",
          "author": "Dhiox",
          "body": "I mean, how would they even do that? Its completely legal to resell physical objects you own. Only way to stop it would be to somehow convince Ebay not to want to make more money..",
          "score": 3,
          "created_utc": 1748389808.0,
          "replies": [
            {
              "id": "mum8dxu",
              "author": "BigSwedenMan",
              "body": "Restrict the number of sales available per payment method and address. At least make it difficult to do at scale. Don't target resale, target initial sales",
              "score": 2,
              "created_utc": 1748393234.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mumxl6s",
      "author": "goldaxis",
      "body": "More FOMO bait. Price drop in six months, just be patient.",
      "score": 4,
      "created_utc": 1748402047.0,
      "replies": [
        {
          "id": "muoai4b",
          "author": "FireLucid",
          "body": "The switch never had a price drop afaik. Heck, prices have been going up for other consoles. I expect Japan is seeing shortages as they will be wanting a lot of stock moved to America before the tariffs come back.",
          "score": 8,
          "created_utc": 1748427610.0,
          "replies": [
            {
              "id": "muprg1x",
              "author": "goldaxis",
              "body": "This isn’t the switch. You will learn. ",
              "score": -4,
              "created_utc": 1748446179.0,
              "replies": [
                {
                  "id": "mus3duf",
                  "author": "FireLucid",
                  "body": "I take that back. Apparently Sony is implementing a price drop soon after just increasing prices around the world because of tariffs. I guess Nintendo has them worried.",
                  "score": 1,
                  "created_utc": 1748470426.0,
                  "replies": [
                    {
                      "id": "mut4uwu",
                      "author": "goldaxis",
                      "body": "Switch2 is the least of Sony's worries with the Playstation. They really shot themselves in the foot with Concord. They won't recover any time soon.",
                      "score": 1,
                      "created_utc": 1748483041.0,
                      "replies": [
                        {
                          "id": "mutmq4j",
                          "author": "FireLucid",
                          "body": "They are doing alright compared to Xbox this gen and did pretty fine last gen as well.",
                          "score": 1,
                          "created_utc": 1748489549.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mukntsy",
      "author": "gldoorii",
      "body": "With the pricing why let scalpers make the money when Ninty can make it themselves",
      "score": 6,
      "created_utc": 1748375443.0,
      "replies": [
        {
          "id": "mukocx9",
          "author": "a_Ninja_b0y",
          "body": "Nintendo :- ''Fine, I will do it myself''",
          "score": 6,
          "created_utc": 1748375594.0,
          "replies": []
        },
        {
          "id": "mumg07k",
          "author": "stellvia2016",
          "body": "Their margin on the original Switch was 10% or less. Compare that to something like an iPhone which is around 50%. Inflation alone would make the original Switch price of $299 be 399 today. Adding in extra factors such as more demand for chips, increased shipping costs, and possibly a margin for the current market instability: They're once again making 10% margin or less.\n\nAs for the cost in Japan: It's to counter to deflation their currency had against the dollar over the last 4 years. It was 110:1 back then and spiked to over 160:1 before coming down to hover in the 150-140:1 range lately.\n\n110 x 450 = 49500. The MSRP of the Japan Switch2 is 49980. 150 x 450 = 67500. 67500 / 110 = $613 USD.\n\nThat is why they get preferential pricing, bc everyone there is making the same amount they made 4 years ago. If they priced it at current market rates, they would price themselves out of their home market based on global exchange rates, which is silly.",
          "score": 2,
          "created_utc": 1748395847.0,
          "replies": [
            {
              "id": "munvti5",
              "author": "elton_john_lennon",
              "body": "> Compare that to something like an iPhone which is around 50%.\n\nWhy would you compare it to something like an iPhone though? \n\nDo you have to buy $60 apps on the iPhone to have anything to do on it, or does it come loaded fully functional and most of what you can think of is either free of costs just a few bucks?",
              "score": 0,
              "created_utc": 1748419092.0,
              "replies": [
                {
                  "id": "muo7ir2",
                  "author": "leddhedd",
                  "body": "Well the revenue from the app store certainly contributes, and isn't insignificant, not to mention it's not usual to have consoles on a 2-3 year upgrade cycle, whilst apple would try to have you ever 12 months if they could, Nintendo is likely only charging you once or twice a decade for the hardware",
                  "score": 3,
                  "created_utc": 1748425996.0,
                  "replies": [
                    {
                      "id": "muoc2m5",
                      "author": "elton_john_lennon",
                      "body": "> Well the revenue from the app store certainly contributes, and isn't insignificant,\n\n\nSure it does but what difference does it make from a consumer perspective? Apple makes plenty of money from the app store, and yet they still don't charge $60 for an app, not even their own crucial apps.  They could easily charge $99 for calls, $59 for imessage, $99 for photo app, $59 for navigation, etc. \n\nWith phones there are free apps, sales, dollar apps, and the device comes fully functional with all required apps for its hardware, where with nintendo the hardware comes naked with nothing useful, and nintendo wants to charge you for a freakin' tutorial. \n\n^^^^^^.\n\n>it's not usual to have consoles on a 2-3 year upgrade cycle, whilst apple would try to have you ever 12 months if they could, Nintendo is likely only charging you once or twice a decade for the hardware\n\nIt's not like they sell you once per decade, and have to charge more so that the hardware can \"last\" a decade.  They charge you once a decade and you end up with decade old hardware, so that hardly seems unfair. It's even worse than that because given that nintendo is never on the bleeding edge of tech, it's more like charging once a decade for already 3 year old tech. \n\nYou can also easily buy an iPhone and not buy another for 10 year period, so that doesn't really make a difference from hardware perspective in this comparison. \n\n\n^^^^^^.\n\nConsoles are in the ink printer business. You charge 0 or minimal margin for hardware and recoup on consumables (software in case of nintendo). That is why it shouldn't be compared to something like an iPhone where they make most of the money selling the hardware, and they can't rely on software sales because a lot of people don't even need to buy software to use the hardware, because like I've said iPhone comes preloaded and additional apps are free in lot of cases.",
                      "score": 0,
                      "created_utc": 1748428414.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mup5hc1",
                  "author": "stellvia2016",
                  "body": "Most of the games available on the console aren't provided by Nintendo, they're sold by 3rd parties. Many of which charge far less than $60. Also, calling most mobile things as free or a few bucks is disingenuous given how heavily they lean into MTX and gacha.\n\nAnd given Nintendo's margin is 10% or less, how much lower do you expect it to be? It's not reasonable to expect companies to sell their hardware at a loss. Sony and Xbox were doing it trying to build market share and what happened was they lost money on most of their generations. Nintendo is the only console maker that's been in the green for all console gens. Also, a lot of products tend to shoot for like a 30% margin, so 10% is quite low.",
                  "score": 1,
                  "created_utc": 1748439760.0,
                  "replies": [
                    {
                      "id": "mupb6z4",
                      "author": "elton_john_lennon",
                      "body": "> is disingenuous given how heavily they lean into MTX and gacha.\n\n\"They\"? What? :D Google maps - costs no money, Signal - costs no money, ChatGPT/Gemini/etc - costs no money, Instagram - costs no money, Uber app - costs no money, and many more. Those are one of the most used apps, they greatly expand what the device is capable of, millions of people use them, and they cost no money. \n\nThere is nothing disingenuous about what I wrote. Phone primary function is communication/photo/multimedia, that is what it is mostly used for by people around the world, and that is even more of a reason not to compare it to a gaming console. \n\n^^^^^^.\n\n> And given Nintendo's margin is 10% or less, how much lower do you expect it to be?\n\nThat is not what I am addressing. I was responding to explanation of Switch2 price in comparison to iPhone price, where that comparison makes no sense in my opinion as those two have rather different business model.",
                      "score": 1,
                      "created_utc": 1748441526.0,
                      "replies": [
                        {
                          "id": "muphj0y",
                          "author": "stellvia2016",
                          "body": "So what does any of that have to do with excusing having a larger margin? Apple has the highest market cap in the world. They're absolutely making filthy money off their grossly inflated margins.\n\n10% is quite low of a margin for a commodity you only sell one of to a consumer every 7-8 years. The things with less margin than that are generally bc they are regularly consumed items like food, or heavily contested markets like basic clothing.",
                          "score": 0,
                          "created_utc": 1748443365.0,
                          "replies": [
                            {
                              "id": "mupjjh2",
                              "author": "elton_john_lennon",
                              "body": "> So what does any of that have to do with excusing having a larger margin?\n\nI already explained what - they have a different business model and they can't recoup that much money on software as closed-system-console manufacturers can, so they earn money on the hardware itself. \n\n^^^^^^.\n\n> Apple has the highest market cap in the world. \n\nWhat does that have to do with Nintendo and theirs? \n\nYou brought up apple, you have to explain how they can be compared, rather than me trying to explain that they can't, I only mentioned reasons against it because I'm a nice person, but it's you who have to make a case here really :) \n\n\n\n^^^^^^.\n\n> They're absolutely making filthy money off their grossly inflated margins.\n\nSo because apple does it, then it is okay for others to do it? Is that really your argument - whataboutism?\n\n\nThose are different products, that have different target, different main functionality, and are sold by companies under different business models, there is hardly anything that makes sense in this comparison.",
                              "score": 1,
                              "created_utc": 1748443936.0,
                              "replies": [
                                {
                                  "id": "mupmb90",
                                  "author": "stellvia2016",
                                  "body": ">I already explained what - they have a different business model and they can't recoup that much money on software as closed-system-console manufacturers can, so they earn money on the hardware itself. \n\nApple takes a 30% cut of all revenue made on their app store. They made $10B from it last year alone. Which is on top of $200B in iphone hardware sales, which means around $100B is profit...",
                                  "score": 1,
                                  "created_utc": 1748444729.0,
                                  "replies": [
                                    {
                                      "id": "muq7fos",
                                      "author": "elton_john_lennon",
                                      "body": ">Apple takes a 30% cut of all revenue made on their app store. They made $10B from it last year alone. Which is on top of $200B in iphone hardware sales, which means around $100B is profit...\n\nI know how much their cut is, hard to miss it given the last lawsuit with Epic blasted on all news portals, and it is still a completely different business model, because **you don't have to buy anything to use their product.** \n\n^^^^^^.\n\nIn the last 5 years minimum, probably longer than that, I have not bought a single paid app on the phone. \n\n^^^^^^.\n\nLet's crack the numbers, $10B from app sales versus $200B in hardware sales, that makes only 5% of apples income. \n\nNintendo, on the other hand, made 50% from sales of software vs hardware in 20/21 (couldn't find last year ones, but I doubt ratio will be much different). \n\nSo yeah, they have a very different approach.",
                                      "score": 1,
                                      "created_utc": 1748450791.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "munlvv3",
      "author": "FandomMenace",
      "body": "The only way to stop scalping is to flood the market at launch. Whenever your supply can't meet demand, scalpers will emerge. Instead of all this garbage, build up your supply and blitz launch day.",
      "score": 1,
      "created_utc": 1748413367.0,
      "replies": []
    },
    {
      "id": "muo05b9",
      "author": "Fredasa",
      "body": "And with the devil may care attitude about scalping outside of Japan, I can't help but draw a parallel to Japanese publishers leaving game localization tasks entirely to third parties, who then butcher the localization.  Who cares, right?  They still sell the product—mission accomplished.",
      "score": 1,
      "created_utc": 1748421684.0,
      "replies": []
    },
    {
      "id": "muod681",
      "author": "sebjapon",
      "body": "It’s a bit drastic. A max price being the price of new would have been preferable in my opinion.",
      "score": 1,
      "created_utc": 1748428954.0,
      "replies": []
    },
    {
      "id": "mupbafg",
      "author": "starker",
      "body": "Better go to etsy and craigslist",
      "score": 1,
      "created_utc": 1748441555.0,
      "replies": []
    },
    {
      "id": "mumqkys",
      "author": "nwerdnerd",
      "body": "Soooo couldn’t they put a cap on the amount of money anything under “switch 2” can be sold for",
      "score": 1,
      "created_utc": 1748399485.0,
      "replies": [
        {
          "id": "mumxgyb",
          "author": "VagabondVivant",
          "body": "This is what I'm wondering. What if you got a Switch 2 as a gift or the like and didn't want it? You should be able to sell it for at or below market value, at least.",
          "score": 0,
          "created_utc": 1748402000.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mukr9yb",
      "author": "epsilonzer0",
      "body": "Japan has always had a weird notion of free market practices. To this day it is still illegal to rent physical media in Japan.",
      "score": -10,
      "created_utc": 1748376429.0,
      "replies": [
        {
          "id": "muld2jt",
          "author": "None",
          "body": "[deleted]",
          "score": 28,
          "created_utc": 1748382853.0,
          "replies": []
        },
        {
          "id": "mulnz2x",
          "author": "valensk",
          "body": "What the hell are you talking about? I can go to the GEO down the street to rent Blurays or manga.",
          "score": 26,
          "created_utc": 1748386402.0,
          "replies": [
            {
              "id": "muwm4ns",
              "author": "epsilonzer0",
              "body": "Japan's Copyright Act generally prohibits renting out copyrighted works like video games for profit without the copyright holder's permission. This means businesses cannot legally operate video game rental services unless they have explicit authorization from the game publishers or rights holders, which is rarely granted. Historically, video game rentals were more common in Japan, but the practice has largely disappeared due to these legal restrictions and industry pushback from game companies. For example, Nintendo and other major publishers have opposed rental services to protect their sales, leading to a decline in such businesses since the 1990s. Today, physical rental shops for video games are nearly nonexistent in Japan, and digital rentals are tightly controlled by platforms like Nintendo eShop, PlayStation Store, or Steam, which don’t allow third-party rentals.For personal use, sharing or lending games to friends or family is generally fine, as it doesn’t involve commercial intent. However, reselling or distributing rented games could violate copyright laws if done without permission.",
              "score": 1,
              "created_utc": 1748534895.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mum7t01",
          "author": "SeNsEi021",
          "body": "I've lived in Japan for over 15 years and not once heard or seen this before. Geo and Tsutaya are the huge rental chains. However, I think what you are referring to are physical video games, other forms are media are fine.",
          "score": 9,
          "created_utc": 1748393034.0,
          "replies": []
        },
        {
          "id": "muoy12t",
          "author": "kinokomushroom",
          "body": "How it feels to spread misinformation 🌈 🐬💦",
          "score": 3,
          "created_utc": 1748437297.0,
          "replies": []
        },
        {
          "id": "muktnrx",
          "author": "Scorpio989",
          "body": "I've been told it's partially to protect the \"kaitori\" culture of aftermarket resale/trade-in. Pawn shops in Japan are relatively massive, the one I went to had 3 floors.",
          "score": 4,
          "created_utc": 1748377110.0,
          "replies": [
            {
              "id": "muwm10k",
              "author": "epsilonzer0",
              "body": "Japan's Copyright Act generally prohibits renting out copyrighted works like video games for profit without the copyright holder's permission. This means businesses cannot legally operate video game rental services unless they have explicit authorization from the game publishers or rights holders, which is rarely granted. Historically, video game rentals were more common in Japan, but the practice has largely disappeared due to these legal restrictions and industry pushback from game companies. For example, Nintendo and other major publishers have opposed rental services to protect their sales, leading to a decline in such businesses since the 1990s. Today, physical rental shops for video games are nearly nonexistent in Japan, and digital rentals are tightly controlled by platforms like Nintendo eShop, PlayStation Store, or Steam, which don’t allow third-party rentals.For personal use, sharing or lending games to friends or family is generally fine, as it doesn’t involve commercial intent. However, reselling or distributing rented games could violate copyright laws if done without permission.",
              "score": 1,
              "created_utc": 1748534866.0,
              "replies": []
            },
            {
              "id": "multicd",
              "author": "starliight-",
              "body": "It’s also like the most fun shopping experience too",
              "score": 1,
              "created_utc": 1748388225.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "muof6s6",
      "author": "johnyeros",
      "body": "All of this for a regurgitated system selling the same remade game and store is fully of indie game you can buy from any other platform. Get a Dann android gaming device and forget this company exist.",
      "score": 1,
      "created_utc": 1748429891.0,
      "replies": []
    },
    {
      "id": "mund2ex",
      "author": "Wactout",
      "body": "I purposely bought switches, during Covid using bots, to sell at retail, to friends and neighbors. I never made a cent. I’ve been playing Nintendo since I was born. I can’t even anymore. I can’t afford it. \nI couldn’t pre order a single switch 2. And I won’t even bother at this point. Our economy is tanking so fast, I can’t justify it. I’m a tattoo artist, who specializes in nerd stuff. But I live paycheck to everyone else’s paycheck. I have to pay rent, before a console.",
      "score": -1,
      "created_utc": 1748408815.0,
      "replies": []
    },
    {
      "id": "mum87zm",
      "author": "JackfruitCalm3513",
      "body": "They're fighting to stop reselling but are they fighting to stop the scalpers from getting them in the first place? I guess probably not cuz a system sold Is a system sold in Nintendo's eyes",
      "score": 0,
      "created_utc": 1748393177.0,
      "replies": []
    },
    {
      "id": "mul4105",
      "author": "rickrat",
      "body": "Great, now can we do GameStop and marketplace?",
      "score": -5,
      "created_utc": 1748380075.0,
      "replies": []
    },
    {
      "id": "mumr0a7",
      "author": "None",
      "body": "Nintendo is a bully on prices yet tries to bully the people being bullies. Funny",
      "score": -8,
      "created_utc": 1748399640.0,
      "replies": [
        {
          "id": "mun0he4",
          "author": "RegalKillager",
          "body": "hyping up scalpers to own corporations",
          "score": 7,
          "created_utc": 1748403201.0,
          "replies": [
            {
              "id": "mun1kvq",
              "author": "okram2k",
              "body": "there are no good guys here",
              "score": -6,
              "created_utc": 1748403654.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mumxrrj",
      "author": "1leggeddog",
      "body": "Doubt that's gonna move the needle at all.\n\nI mean, we've been dealing with scalpers for like a decade now",
      "score": 0,
      "created_utc": 1748402117.0,
      "replies": []
    },
    {
      "id": "munwoeu",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1748419596.0,
      "replies": [
        {
          "id": "muozvko",
          "author": "kinokomushroom",
          "body": "Can't you just buy the multinational version at regular stores after launch? It should be easier to get than the obviously more popular Japanese-only version.",
          "score": 1,
          "created_utc": 1748437924.0,
          "replies": [
            {
              "id": "musj45n",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1748475586.0,
              "replies": [
                {
                  "id": "musp8nq",
                  "author": "kinokomushroom",
                  "body": "It'll come out in a week, we'll need to wait and see.",
                  "score": 2,
                  "created_utc": 1748477686.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mursbpv",
      "author": "Dnaldon",
      "body": "Maybe fix their Pokémon card situation first? This just tells me it won't work.",
      "score": 0,
      "created_utc": 1748467036.0,
      "replies": []
    },
    {
      "id": "mum1nl2",
      "author": "septimaespada",
      "body": "I’ve never heard of scalping being a big problem in Japan, anybody know if that’s true?",
      "score": -4,
      "created_utc": 1748390935.0,
      "replies": [
        {
          "id": "mum76cn",
          "author": "SeNsEi021",
          "body": "Yes scalping is huge in Japan. Especially with Japanese people themselves and mainland Chinese tourists coming over. 転売ヤー or \"tenbaiya\" are what we call scalpers here. Very big problem in Japan across industries, and most recently at McDonalds with happy meal toys.",
          "score": 13,
          "created_utc": 1748392819.0,
          "replies": [
            {
              "id": "mumpokn",
              "author": "mochi_chan",
              "body": "I remember the big scalping happening during the first Switch sales (I am in Japan too, but not Japanese) and have seen it across Anime goods and some other things. I did not know this happened with happy meals though.\n\n転売ヤー最悪だ！！",
              "score": 2,
              "created_utc": 1748399164.0,
              "replies": [
                {
                  "id": "mumq3ba",
                  "author": "SeNsEi021",
                  "body": "Yeah, it was recently with the Chiikawa toys, something my daugther wanted but were sold out thanks to the tenbaiya. The worst thing is, the scalpers bought dozens of happy meals, took the toys then left the food at the MCD. Eventually everything had to be thrown out. Truly 最悪.",
                  "score": 2,
                  "created_utc": 1748399309.0,
                  "replies": [
                    {
                      "id": "mumqz4e",
                      "author": "mochi_chan",
                      "body": "This is truly terrible. Lots of food waste. I am sorry your your daughter did not get Chiikawa. I don't have any kids, but I like Chiikawa, she is very cute.",
                      "score": 2,
                      "created_utc": 1748399628.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mumf3t6",
              "author": "septimaespada",
              "body": "Wow, I had no idea. And where do scalpers sell their stuff usually? Is there an eBay equivalent?",
              "score": 2,
              "created_utc": 1748395540.0,
              "replies": [
                {
                  "id": "mumfflq",
                  "author": "SeNsEi021",
                  "body": "Mercari, yahoo shopping, yahoo auctions are the big ones.",
                  "score": 3,
                  "created_utc": 1748395654.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mumxxug",
          "author": "Marvelous_XT",
          "body": "It's a huge scalpers market over there, Nintendo aside, iPhone is another best selling list for scalpers. Chinese scalpers buy in bulk from people that got the slot to buy new iPhone releases and then they will resell. I have a friend currently working in Japan, he makes some quick money by reselling his slot to scalpers.",
          "score": 3,
          "created_utc": 1748402184.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mum3d5m",
      "author": "chunckybydesign",
      "body": "Won’t be buying Nintendo ever again, but it’s good to see companies counter scalping.",
      "score": -5,
      "created_utc": 1748391517.0,
      "replies": []
    },
    {
      "id": "mukzo2y",
      "author": "None",
      "body": "[deleted]",
      "score": -6,
      "created_utc": 1748378813.0,
      "replies": [
        {
          "id": "mul7zjc",
          "author": "AiR-P00P",
          "body": "ebay is the worst. you can report listings all day and all you'll get in response is an automated \"we didn't find anything wrong\" response, even when it's a listing clearly advertising a pre-order which is against their ToS. absolutely useless. ",
          "score": 2,
          "created_utc": 1748381285.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mulfn9o",
      "author": "TeknoPagan",
      "body": "Won’t ever own a Switch2.  Fuck that noise.",
      "score": -13,
      "created_utc": 1748383667.0,
      "replies": []
    }
  ]
}