{
  "post": {
    "title": "Philips Hue bulbs will be even more expensive in July. And it may not end there | Some Hue products already cost more in the US than they do elsewhere.",
    "author": "chrisdh79",
    "id": "1lk2mnp",
    "score": 689,
    "created_utc": 1750849161.0,
    "selftext": "",
    "num_comments": 148,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lk2mnp/philips_hue_bulbs_will_be_even_more_expensive_in/"
  },
  "comments": [
    {
      "id": "mzohno7",
      "author": "Swizzy88",
      "body": "They've always been overpriced.",
      "score": 263,
      "created_utc": 1750851391.0,
      "replies": [
        {
          "id": "mzp573d",
          "author": "its_an_armoire",
          "body": "Switching away from the Hue ecosystem saved me *so much*, obviously it was the right move",
          "score": 72,
          "created_utc": 1750859846.0,
          "replies": [
            {
              "id": "mzpj48u",
              "author": "Careless_Mango_7948",
              "body": "What are we switching to? I have Govee items as well but now they’re also very pricey.",
              "score": 28,
              "created_utc": 1750863867.0,
              "replies": [
                {
                  "id": "mzpp95f",
                  "author": "JoeSmithDiesAtTheEnd",
                  "body": "I’d love to know this also.\n\nI’ve been trying out other bulb brands in less frequently used rooms in my house, and I still can’t find ones I like as much as Hue. Hue bulbs are super responsive. I’ve tried Govee, Kasa, Wyze, and IKEA. And Govee has been my secondary preference, but they’re not nearly as snappy.\n\nI feel stuck with Hue for future bulb replacements, as any smart bulbs need to be instant to pass the wife test.",
                  "score": 34,
                  "created_utc": 1750865597.0,
                  "replies": [
                    {
                      "id": "mzpu6t6",
                      "author": "kr4ckenm3fortune",
                      "body": "Wtf? I just get regular lightbulbs.\n\nThe fuck we need these kind of lights for?",
                      "score": -52,
                      "created_utc": 1750866966.0,
                      "replies": [
                        {
                          "id": "mzqug8g",
                          "author": "Yummier",
                          "body": "For me it was resolving two needs for the main ceiling lamp in the apartment:\n\n1. It needs to be dimmable and there isn't an existing dimmer installed\n2. It needs to have different temperatures based on activity. \n\nHue bulbs solved both issues. The lamp is now great for any occasion, be it reading, crafts, cooking, movie night...you name it. That's super convenient in a small apartment where space is a limited resource. I bought mine on a sale, the round glass orb ones, and it ended up costing about the same as the normal bulbs I replaced.",
                          "score": 23,
                          "created_utc": 1750876985.0,
                          "replies": [
                            {
                              "id": "mzri7s4",
                              "author": "lowcrawler",
                              "body": "but they are really low quality light... yeah, it's orange or whatever color... but the cri is abysmal",
                              "score": -16,
                              "created_utc": 1750883775.0,
                              "replies": [
                                {
                                  "id": "mzxc2cz",
                                  "author": "nicetriangle",
                                  "body": "MFGs of smart bulbs make high CRI lights FYI, but besides that point I'm gonna make a rough guess that 99% of the population doesn't give a damn and would find the light quality of any decent smart bulb on the market to be completely adequate.\n\nPeople don't care about CRI at all nor do they know what it even means. They'll care that the lights dim to a nice warm color that makes their home feel cozy in the evenings and works with their phone app. They're not using them for filmmaking.",
                                  "score": 3,
                                  "created_utc": 1750961517.0,
                                  "replies": [
                                    {
                                      "id": "mzxckao",
                                      "author": "lowcrawler",
                                      "body": "but it just looks so artificial and assy.\n\npeople might not know why... but they can def tell.  think of how many people raged about CFL light quality.",
                                      "score": -2,
                                      "created_utc": 1750961657.0,
                                      "replies": [
                                        {
                                          "id": "mzxgl98",
                                          "author": "nicetriangle",
                                          "body": "They're miles better than CFL bulbs. People's problem with CFLs was that they were cold and sterile feeling. Current gen high quality LEDs including smart bulbs don't have that problem at all.",
                                          "score": 3,
                                          "created_utc": 1750962792.0,
                                          "replies": [
                                            {
                                              "id": "mzxhvyc",
                                              "author": "lowcrawler",
                                              "body": "that sterile feeling is more than just color temp, it's also CRI.\n\nI still get the crappy sterile feeling from low CRI (which includes most smart bulbs like the Hue at roughly 80 RA) LEDs.  \n\nthey are cool, don't misunderstand me... but the light quality is objectively terrible",
                                              "score": 0,
                                              "created_utc": 1750963161.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mzrvd4x",
                          "author": "StickFigureFan",
                          "body": "They're amazing to be able to read books in bed and then when you feel tired you use voice commands to turn them off without needing to get up or even reaching over to a lamp.",
                          "score": 7,
                          "created_utc": 1750887599.0,
                          "replies": [
                            {
                              "id": "mzsljva",
                              "author": "kr4ckenm3fortune",
                              "body": "Uhhhh...that what the clapper was invented for?",
                              "score": -8,
                              "created_utc": 1750896053.0,
                              "replies": [
                                {
                                  "id": "mztwczi",
                                  "author": "TokinDaley",
                                  "body": "Now the clappers on my phone",
                                  "score": 5,
                                  "created_utc": 1750913405.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mzpya9i",
                          "author": "JoeSmithDiesAtTheEnd",
                          "body": "For me, I live in an old house where they intended for you to use floor and desk lamps. The light fixtures are also all on their own circuits. So unless I wanna go around the room turning on/off multiple light sources, smart bulbs are the best choice.",
                          "score": 16,
                          "created_utc": 1750868114.0,
                          "replies": [
                            {
                              "id": "mztiy6t",
                              "author": "zzazzzz",
                              "body": "or you could get smart light switches instead of a bunch of very pricy bulbs",
                              "score": 1,
                              "created_utc": 1750907721.0,
                              "replies": [
                                {
                                  "id": "mzxcikx",
                                  "author": "nicetriangle",
                                  "body": "Lemme know when smart switches can change the color temperature and dimness of any given LED bulb and we can talk.",
                                  "score": 3,
                                  "created_utc": 1750961644.0,
                                  "replies": []
                                },
                                {
                                  "id": "mzznned",
                                  "author": "LTsidewalk",
                                  "body": "Smart lights solve the end problem, the lights. Landlords are not too welcoming to someone taking off the faceplate to install their own switches.",
                                  "score": 1,
                                  "created_utc": 1750988115.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mzxaxf2",
                          "author": "nicetriangle",
                          "body": "Lol nah smart bulbs are a big quality of life upgrade for general home comfort and coziness. The color temperature (this is the major game changer), dimming, app/voice control, scheduling, etc is just great. Being able to say a voice command and have the entire floor of an open plan house instantly turn to a dim warm setting for a cozy evening in is lovely.\n\nThey also last quite a long time. I have some that are north of 10 years old and still work perfectly.\n\nI've convinced several people to get them and everyone agrees they'd never go back. Anybody talking this much trash about them clearly hasn't really used them for any prolonged amount of time.",
                          "score": 2,
                          "created_utc": 1750961201.0,
                          "replies": []
                        },
                        {
                          "id": "mzquozt",
                          "author": "echocage",
                          "body": "Ok grandpa",
                          "score": 2,
                          "created_utc": 1750877054.0,
                          "replies": [
                            {
                              "id": "mzslvzg",
                              "author": "kr4ckenm3fortune",
                              "body": "Man...just buy the damn clapper...that all you need.",
                              "score": -7,
                              "created_utc": 1750896168.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mzqxq4e",
                          "author": "BiggerDamnederHeroer",
                          "body": "seriously. It took $3 and the knowledge already in my head to put two lamps on the same dimmer. the f.",
                          "score": -6,
                          "created_utc": 1750877913.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mzqr48h",
                  "author": "TheCruelSloth",
                  "body": "Ikea",
                  "score": 9,
                  "created_utc": 1750876023.0,
                  "replies": [
                    {
                      "id": "mzqwnkr",
                      "author": "Careless_Mango_7948",
                      "body": "Ty I’ll check out what they have",
                      "score": 1,
                      "created_utc": 1750877611.0,
                      "replies": []
                    },
                    {
                      "id": "mzsmvi0",
                      "author": "unicornsausage",
                      "body": "Right? Bulbs and switches are less than 10 bucks a pop, pretty much my whole house has them",
                      "score": 1,
                      "created_utc": 1750896502.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzppa8k",
                  "author": "its_an_armoire",
                  "body": "Actually, I use Govee bulbs too but I haven't bought any in a couple years, didn't know the prices went up!",
                  "score": 5,
                  "created_utc": 1750865605.0,
                  "replies": []
                },
                {
                  "id": "mzq6i4x",
                  "author": "Swizzy88",
                  "body": "I have a a couple of bulbs and govee led strip I bought quite a few years ago. No idea what I'd be switching to when the need arises but I have noticed govee going way up in price.",
                  "score": 1,
                  "created_utc": 1750870398.0,
                  "replies": []
                },
                {
                  "id": "mzshxw6",
                  "author": "ShinsBlownOff",
                  "body": "I use homeassistant with zb2mqtt and a cheap sonoff zigbee adapter. I was able to keep all of the hue bulbs and add them to my new zigbee network and now I can get any zigbee compliant bulb or device I want to add to my IoT setup.",
                  "score": 1,
                  "created_utc": 1750894854.0,
                  "replies": [
                    {
                      "id": "mzsub2e",
                      "author": "Careless_Mango_7948",
                      "body": "Great thanks! I’ll check it out :)",
                      "score": 1,
                      "created_utc": 1750899035.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mzwtt37",
                  "author": "igotabridgetosell",
                  "body": "any zigbee bulbs, don't go for cheap wifi bulbs cuz they use a lot more power and cause wifi congestion.  but on those other devices, you notice that 1% brightness is brighter on other devices than hue, so i'm still on hue.",
                  "score": 1,
                  "created_utc": 1750956514.0,
                  "replies": []
                },
                {
                  "id": "mzq0yot",
                  "author": "ElectrikDonuts",
                  "body": "I'm love to find some open source bulbs, plugs, thermostat, air quality sensors, cameras, remote blinds, etc.  \n\nI wish I could get all these on the same app and off load the 6-10 apps I have running all this",
                  "score": 1,
                  "created_utc": 1750868855.0,
                  "replies": [
                    {
                      "id": "mzq5iq7",
                      "author": "Careless_Mango_7948",
                      "body": "Yea there’s a home app for iPhone but I had issues with it. \n\nStill on hue and separate Govee apps but the automate features make it so I don’t have to open them too often.",
                      "score": 2,
                      "created_utc": 1750870125.0,
                      "replies": [
                        {
                          "id": "mzq6dl9",
                          "author": "ElectrikDonuts",
                          "body": "I've got hue, wyze, robovac, resideo, ring, best way, simplisafe, myq, schlag home, smart control,smart things, Tesla, govee, eufy. \n\nIt's just fucking insane\n\nTemped to ditch ring and simplisafe and put those on wyze",
                          "score": 1,
                          "created_utc": 1750870363.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzr6eb6",
          "author": "zkareface",
          "body": "Have they? Do they have any solid competition?\n\n\nI've tried IKEA and they don't work good enough. ",
          "score": 3,
          "created_utc": 1750880413.0,
          "replies": []
        },
        {
          "id": "mzregh5",
          "author": "Psimo-",
          "body": "Is there a significant cost in the US because here in the U.K. they are pretty much the cheapest WiFi enabled variable white + RGB lamps around.",
          "score": 2,
          "created_utc": 1750882715.0,
          "replies": []
        },
        {
          "id": "mzprle2",
          "author": "m__a__s",
          "body": "Which is why I don't have any and don't care.",
          "score": -6,
          "created_utc": 1750866247.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzoeub5",
      "author": "Perfect_Opinion7909",
      "body": "Who knew voting had consequences and tariffs aren’t paid by foreign countries.",
      "score": 337,
      "created_utc": 1750850151.0,
      "replies": [
        {
          "id": "mzokiir",
          "author": "kytheon",
          "body": "I wish they just call tariffs by their real name: import taxes.",
          "score": 122,
          "created_utc": 1750852584.0,
          "replies": [
            {
              "id": "mzp39vv",
              "author": "rawrberry_",
              "body": "But then I can't blame checks notes... The left, immigrants, or climate change.",
              "score": 37,
              "created_utc": 1750859253.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzokdvl",
          "author": "QuaternionsRoll",
          "body": "Pffft, Hue has been a gigantic ripoff for at least a decade now. $1 worth of LEDs packaged and sold in $100 increments",
          "score": 27,
          "created_utc": 1750852533.0,
          "replies": [
            {
              "id": "mzouo0s",
              "author": "PatSajaksDick",
              "body": "Gonna disagree with you there, these have been the most reliable part of my smart home, I’ve had some for a decade with no issues, sure there’s plenty of cheaper brands but Hue quality is great",
              "score": 44,
              "created_utc": 1750856391.0,
              "replies": [
                {
                  "id": "mzp7oyp",
                  "author": "Killahdanks1",
                  "body": "Yeah, we have over 60 hue lights in our house. Most of them I’ve had for over 10 years. But when I look at the prices now, they are much higher. But they will last, I’ve had several replaced for free if they fail. Great product, but like most high quality products it’s going to cost you.",
                  "score": 12,
                  "created_utc": 1750860597.0,
                  "replies": []
                },
                {
                  "id": "mzowgd7",
                  "author": "Paratwa",
                  "body": "Same. I have some hue bulbs that have to be at least 15 years old and still work perfectly",
                  "score": 16,
                  "created_utc": 1750857006.0,
                  "replies": []
                },
                {
                  "id": "mzp25h3",
                  "author": "Training-Flan8092",
                  "body": "I’m a cheap ass and have 7-10 different apps from all types of smart home devices, none of them Hue because of how absurdly expensive they are. \n\nI too have never had an issue with a single one. \n\nNone give me problems, they all react to Google Home no problem, in 6+ years in my current house I’ve not had a single issue. \n\nThat being said I’m really digging Govee and tend to buy that brand now when I get more.",
                  "score": 13,
                  "created_utc": 1750858894.0,
                  "replies": [
                    {
                      "id": "mzphjl9",
                      "author": "PoliticalyUnstable",
                      "body": "I also really like Govee. But they are expensive as well. I've done a fair amount of lighting in my house and Govee is my favorite. Reliable app, great colors, good brightness, longevity is there etc.",
                      "score": 3,
                      "created_utc": 1750863421.0,
                      "replies": [
                        {
                          "id": "mzpqap4",
                          "author": "Training-Flan8092",
                          "body": "This is definitely fair. To be clear Govee is my middle ground between expense and quality. \n\nThe app is great and it has good color transitions that feel close to hue. They also have good variety and the materials they use feel strong. \n\nThat being said I have Black Friday items I’ve gotten for pennies that are still doing great. Bulbs, switches, things that aren’t strips where I care about points of light and transitions, all really just make more sense to go cheap to me.",
                          "score": 3,
                          "created_utc": 1750865888.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mzp1k0k",
                  "author": "QuaternionsRoll",
                  "body": "I’m not saying they’re *bad*, just that they’re severely overpriced. There’s no technical/practical reason for them to be as expensive as they are.",
                  "score": 6,
                  "created_utc": 1750858700.0,
                  "replies": []
                },
                {
                  "id": "mzplsmk",
                  "author": "drae-",
                  "body": "I bought two dozen,\n\nEvery one failed before the adversied bulb hours.\n\nSwitched to govee and been happy.",
                  "score": 2,
                  "created_utc": 1750864623.0,
                  "replies": []
                },
                {
                  "id": "mzrij1p",
                  "author": "lowcrawler",
                  "body": "*build quality\n\n... the light quality is awful",
                  "score": 1,
                  "created_utc": 1750883865.0,
                  "replies": []
                },
                {
                  "id": "mzp4fln",
                  "author": "kurotech",
                  "body": "Good news is they don't have microphones atleast oh wait some do",
                  "score": -1,
                  "created_utc": 1750859614.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzovv44",
          "author": "well_damm",
          "body": "When is the lightbulb factory being built?\n\nYou know one that would cost millions in planning, hiring, etc and a company willing to do it.",
          "score": 7,
          "created_utc": 1750856805.0,
          "replies": [
            {
              "id": "mzoyfxg",
              "author": "Stellardong",
              "body": "Johnny Lightbulbs reporting for 80 hour a week factory duty",
              "score": 2,
              "created_utc": 1750857666.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzowqat",
          "author": "TEOsix",
          "body": "Yeah I feel like my bulbs that turn pink and blue are more of an optional purchase. They are already the most expensive bulbs.",
          "score": 1,
          "created_utc": 1750857098.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzoda64",
      "author": "Jamie00003",
      "body": "They’re the most expensive smart bulbs you can buy on the market, and you’re still tied into their stupid hub. Good luck with that Phillips\n\nDon’t get me wrong, they’re good but why no thread/matter bulbs? My guess is they want to suck user data via the hubs",
      "score": 86,
      "created_utc": 1750849429.0,
      "replies": [
        {
          "id": "mzogb9b",
          "author": "mookbrenner",
          "body": "I use almost exclusively Phillips Hue lights without using their hub.",
          "score": 37,
          "created_utc": 1750850807.0,
          "replies": [
            {
              "id": "mzoggt9",
              "author": "Jamie00003",
              "body": "You have to use a hub of some type though right? With thread you don’t (unless you count smart speakers) and that hub is 100% sucking your data",
              "score": -35,
              "created_utc": 1750850876.0,
              "replies": [
                {
                  "id": "mzoilsf",
                  "author": "Xerain0x009999",
                  "body": "You can control them using home assistant + a zigbee controller. Basically, you build your own hub on your own local hardware. This is much more common than you think.",
                  "score": 39,
                  "created_utc": 1750851793.0,
                  "replies": [
                    {
                      "id": "mzojmcx",
                      "author": "idkalan",
                      "body": "They also have the Hue light switches that can also control the lightbulbs without a hub",
                      "score": 3,
                      "created_utc": 1750852222.0,
                      "replies": [
                        {
                          "id": "mzp56dk",
                          "author": "mookbrenner",
                          "body": "These are what I use.",
                          "score": 3,
                          "created_utc": 1750859840.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mzoiqli",
                      "author": "Jamie00003",
                      "body": "I’m fine with my Nanoleaf bulbs, using my HomePods as hubs. No chance of spying and it’s literally plug and play",
                      "score": -24,
                      "created_utc": 1750851850.0,
                      "replies": [
                        {
                          "id": "mzp3ce0",
                          "author": "horsewarming",
                          "body": "Whatever you wrote in this comment section about ZigBee is absolutely untrue. ZigBee and Thread are different protocols and unrelated. Nobody is spying on you if you use Hue bulbs with HomeAssistant. It's open source and anyone can audit the source code, in contrary to running a HomePod that's always listening to you and running a proprietary OS.",
                          "score": 6,
                          "created_utc": 1750859275.0,
                          "replies": [
                            {
                              "id": "mzp5b29",
                              "author": "Jamie00003",
                              "body": "Couldn’t be more wrong. The people that own zigbee literally developed thread that runs on the same 2.4ghz protocol",
                              "score": -11,
                              "created_utc": 1750859879.0,
                              "replies": [
                                {
                                  "id": "mzpanb8",
                                  "author": "horsewarming",
                                  "body": "Bro 2.4GHz is a frequency, not protocol. Coincidentally, it's the same band as wifi. Does that make it the same protocol? No.",
                                  "score": 7,
                                  "created_utc": 1750861453.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mzoj0s6",
                          "author": "David-Puddy",
                          "body": "....... Are you actually saying using an apple device is a smart way to avoid having your data spied on?",
                          "score": 23,
                          "created_utc": 1750851971.0,
                          "replies": [
                            {
                              "id": "mzoj87v",
                              "author": "Jamie00003",
                              "body": "Yes? Got any proof that says it’s not?",
                              "score": -21,
                              "created_utc": 1750852058.0,
                              "replies": [
                                {
                                  "id": "mzq7tbt",
                                  "author": "David-Puddy",
                                  "body": "As much as you have that Phillips is spying on people rofl",
                                  "score": 3,
                                  "created_utc": 1750870755.0,
                                  "replies": [
                                    {
                                      "id": "mzqf9k8",
                                      "author": "Jamie00003",
                                      "body": "Since when did Phillips base their entire business model on user privacy? The fact you can’t see the massive difference here is hilarious\n\nEDIT: not Phillips but….yeah….\n\nhttps://www.independent.co.uk/tech/philips-hue-smart-light-bulb-hack-cyber-security-a9317456.html",
                                      "score": -3,
                                      "created_utc": 1750872765.0,
                                      "replies": [
                                        {
                                          "id": "mzsagms",
                                          "author": "David-Puddy",
                                          "body": "Lol",
                                          "score": 1,
                                          "created_utc": 1750892421.0,
                                          "replies": [
                                            {
                                              "id": "mzscn1a",
                                              "author": "Jamie00003",
                                              "body": "Good argument 10/10",
                                              "score": 0,
                                              "created_utc": 1750893135.0,
                                              "replies": [
                                                {
                                                  "id": "mzuknhl",
                                                  "author": "hatrantator",
                                                  "body": "https://www.apple.com/newsroom/2023/12/report-2-point-6-billion-records-compromised-by-data-breaches-in-past-two-years/",
                                                  "score": 2,
                                                  "created_utc": 1750926538.0,
                                                  "replies": [
                                                    {
                                                      "id": "mzxgxmz",
                                                      "author": "Jamie00003",
                                                      "body": "Erm…..where are you going with this? Apple commissioned a study on data breaches? You do realise this is promoting apples privacy stance right? 😂",
                                                      "score": 0,
                                                      "created_utc": 1750962891.0,
                                                      "replies": [
                                                        {
                                                          "id": "mzxht0t",
                                                          "author": "hatrantator",
                                                          "body": "I am following your way of argumentation - saying nothing with value",
                                                          "score": 2,
                                                          "created_utc": 1750963139.0,
                                                          "replies": [
                                                            {
                                                              "id": "mzxuvxd",
                                                              "author": "Jamie00003",
                                                              "body": "Ah I see",
                                                              "score": 0,
                                                              "created_utc": 1750966937.0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mzp5lbc",
                  "author": "mookbrenner",
                  "body": "I use the switches that they sell.",
                  "score": 3,
                  "created_utc": 1750859965.0,
                  "replies": [
                    {
                      "id": "mzp5vxr",
                      "author": "Jamie00003",
                      "body": "Using a separate hub. It’s required",
                      "score": -3,
                      "created_utc": 1750860054.0,
                      "replies": [
                        {
                          "id": "mzpnoo9",
                          "author": "TotoCocoAndBeaks",
                          "body": "No idea why you keep saying this—it's wrong.",
                          "score": 3,
                          "created_utc": 1750865156.0,
                          "replies": [
                            {
                              "id": "mzpnsfs",
                              "author": "Jamie00003",
                              "body": "Erm, no it’s not. Zigbee requires a hub",
                              "score": -1,
                              "created_utc": 1750865186.0,
                              "replies": [
                                {
                                  "id": "mzpo37f",
                                  "author": "TotoCocoAndBeaks",
                                  "body": "You really ran yourself into a mental cul-de-sac here.",
                                  "score": 3,
                                  "created_utc": 1750865269.0,
                                  "replies": [
                                    {
                                      "id": "mzpo649",
                                      "author": "Jamie00003",
                                      "body": "What are you saying? Explain?",
                                      "score": -5,
                                      "created_utc": 1750865292.0,
                                      "replies": [
                                        {
                                          "id": "mzqwaj7",
                                          "author": "mookbrenner",
                                          "body": "The only way out is the same way you came in.",
                                          "score": 5,
                                          "created_utc": 1750877509.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mzr6jmn",
                  "author": "zkareface",
                  "body": "They added WiFi ability years ago afaik. ",
                  "score": 3,
                  "created_utc": 1750880455.0,
                  "replies": [
                    {
                      "id": "mzr6vh3",
                      "author": "Jamie00003",
                      "body": "WiFi bulbs are trash too….reliability sucks and if you have a lot can slow down your network",
                      "score": -2,
                      "created_utc": 1750880549.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzogj5j",
          "author": "DigitalStefan",
          "body": "Their hub is a pretty decent piece of hardware and will happily let you do hacky stuff with it if you want to and know how.",
          "score": 29,
          "created_utc": 1750850903.0,
          "replies": [
            {
              "id": "mzoh6b4",
              "author": "sioux612",
              "body": "The real rip off is hue sync \n\n\nThe hdmi box you need is like 150 bucks, their Samsung app is like 140 bucks, and that doesn't transfer from one TV to another \n\n\nBut man is it good, and no clunky camera or whatever needed ",
              "score": 16,
              "created_utc": 1750851182.0,
              "replies": [
                {
                  "id": "mzohzik",
                  "author": "JP_32",
                  "body": "At least Hue sync is free on PC though and works well, but yeah the sync box is expensive and apparently has ton of issues last time I read about it",
                  "score": 5,
                  "created_utc": 1750851532.0,
                  "replies": [
                    {
                      "id": "mzoibxc",
                      "author": "sioux612",
                      "body": "I have the syncbox and while it works pretty well like 90% of the time, it was a bit annoying with choosing the correct hdmi input to relay, and iirc it didn't come with a remote so I always had to grab my phone and change input in the app\n\n\nThe hue Programm for windows is great but unfortunately doesn't help with things like Chromecast etc ",
                      "score": 3,
                      "created_utc": 1750851679.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzomalc",
          "author": "rustyphish",
          "body": "Stupid hub? That’s like the one reason to get Phillips hue…\n\nThe reason standalone bulbs are cheaper is because they have to run off of Bluetooth or WiFi. If you do dozens of bulbs across your house then it can clog up those networks. \n\nCreating a Zigbee network through the Phillips hue hub is a great way to solve that problem",
          "score": 59,
          "created_utc": 1750853301.0,
          "replies": [
            {
              "id": "mzomf7j",
              "author": "Jamie00003",
              "body": "Thread does that already tho. And you can have an unlimited number of hubs (in my case my hubs are my Apple TV’s and HomePods)\n\nThread runs off the zigbee protocol, by the way. Maybe research it",
              "score": -29,
              "created_utc": 1750853352.0,
              "replies": [
                {
                  "id": "mzon3yb",
                  "author": "rustyphish",
                  "body": "I didn’t say there are no other solutions? Just that the hub itself is not “stupid”. Especially for the time it came out, it was a really intuitive way to set up a network like that for consumers who by and large had never heard of a Zigbee network, I bet the majority of users still don’t even know that’s what the hub does",
                  "score": 13,
                  "created_utc": 1750853621.0,
                  "replies": [
                    {
                      "id": "mzonank",
                      "author": "Jamie00003",
                      "body": "What I’m saying it’s stupid we have to use a hub with them. I would buy these bulbs if they have thread variants, especially considering how much they charge for them\n\nThread has been around for 5 years at this point, it’s not new",
                      "score": -19,
                      "created_utc": 1750853693.0,
                      "replies": [
                        {
                          "id": "mzoocrl",
                          "author": "rustyphish",
                          "body": "Neat!",
                          "score": 3,
                          "created_utc": 1750854103.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzonvci",
          "author": "JP_32",
          "body": "For one, hue stuff is widely available (and reliable, I tried some cheaper stuff before, and they all broke in less than a year). nanoleaf, yeelights etc are rarer and hard to find locally, I'd pretty much have to import them off Germans Amazon.\n\n  \nAnd secondly, Hue easily connects to my stream deck + Hue essentials has windows app (which is something thats super rare on other smart bulbs), so I dont have to use the mobile app ever (I use the physical remotes/motion sensors most), now you could use home assistant, but that's deep rabbit hole and requires a lot of tinkering. But with hue all I need to do is press button on the hub and then everything just works.",
          "score": 10,
          "created_utc": 1750853918.0,
          "replies": [
            {
              "id": "mzooket",
              "author": "Jamie00003",
              "body": "Same goes for thread devices? Your hub is an Apple TV or HomePod, in my case and you get redundancy if you have multiple. Plus thread bulbs are cheaper",
              "score": -1,
              "created_utc": 1750854183.0,
              "replies": [
                {
                  "id": "mzp7ucr",
                  "author": "IndianLawStudent",
                  "body": "Thread bulbs have not been around as long. \n\nA lot of people started on hue/zigbee and just continue with that because of the desire to make their zigbee network stronger.",
                  "score": 3,
                  "created_utc": 1750860641.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzp12yq",
          "author": "ApolloWasMurdered",
          "body": "I’ve never used a Philips hub, pair them all to my ConBee.  Mix of Philips, IKEA, and random other Zigbee brands.",
          "score": 3,
          "created_utc": 1750858543.0,
          "replies": []
        },
        {
          "id": "mzomcg9",
          "author": "wildgirl202",
          "body": "I have Philips hue which I installed in like 2018. Great lights and were not cheap but at the time the price made sense. Today with competitors offering the same quality light as hue but at a much lower price point, I’m not sure I’d choose hue.",
          "score": 6,
          "created_utc": 1750853322.0,
          "replies": [
            {
              "id": "mzp4j9p",
              "author": "jeffsterlive",
              "body": "What do you mean by the same quality? I have hue bulbs from 2017 still working. Can’t say the same for any other led bulb including “dumb” ones around the house (Ecosmart are trash). They all have transformer issues and blink or fail outright due to poor heat dissipation. LEDs are incredibly tricky to get correct. Hue also has great color modes and high lumen options. Guess I need to look around but hard to move on from such reliability and integration with Alexa routines.",
              "score": 7,
              "created_utc": 1750859645.0,
              "replies": []
            },
            {
              "id": "mzoohbz",
              "author": "Jamie00003",
              "body": "Exactly, and thread is superior",
              "score": -1,
              "created_utc": 1750854151.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mzos4ya",
          "author": "adgway",
          "body": "I have gen 1 bulbs that are going on ~15 years of daily use. While they are expensive, they are worth it when stacked up against competitors in my experience.",
          "score": 3,
          "created_utc": 1750855510.0,
          "replies": []
        },
        {
          "id": "mzofuko",
          "author": "Dhegxkeicfns",
          "body": ">My guess is they want to suck user data via the hubs\n\nDef",
          "score": -5,
          "created_utc": 1750850604.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzp0i71",
      "author": "skylinenick",
      "body": "I bought my first three hue lights in the starter kit in 2015, and literally all three are still in my home. I’m fine with the price",
      "score": 15,
      "created_utc": 1750858350.0,
      "replies": [
        {
          "id": "mzpgqb2",
          "author": "rumski",
          "body": "Yeah I saw some meme on instagram just this morning saying something like “remember how they tried to get us to believe LED bulbs would last 15 years and they expect us to just ignore that” and it struck me that I have Hue bulbs still rocking since 2012 😮‍💨 That’s a decent ROI I guess.",
          "score": 11,
          "created_utc": 1750863194.0,
          "replies": [
            {
              "id": "mzqdftg",
              "author": "skriefal",
              "body": "This isn't specifically about Hue bulbs, but... the early LED bulbs did seem to last and last.  They were heavy and had lots of heatsinking to draw heat away from the tiny emitter diodes.  And they cost about $20 each (for non-Hue bulbs).  I used a bunch of these - and some did last more than 10 years of heavy use (probably 24000+ hours of use).\n\nThe new bulbs seem to fail sooner - but last much longer than an incandescent bulb.  They're also much cheaper than they used to be, at around $2 each (again, non-Hue).\n\nThose who are opposed to change will rarely listen to reason.",
              "score": 3,
              "created_utc": 1750872273.0,
              "replies": [
                {
                  "id": "mzqxg9p",
                  "author": "skylinenick",
                  "body": "Early LEDs did suck, back when it was blue/white. Now that we can just make them yellow like the old incandescents, there is literally no reason to not switch",
                  "score": 1,
                  "created_utc": 1750877835.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzp2rby",
          "author": "PurplePopcornBalls",
          "body": "Same here.. early adopter and actually had to update the software in my bulbs once.  It took forever.  One bulb at a time. Have them turn on / off on a schedule.  Love them.",
          "score": 1,
          "created_utc": 1750859090.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzodrty",
      "author": "SpinTheWheeland",
      "body": "They do cost a premium but they’re the best smart bulbs / lighting you can buy, really. Anyone who has used them compared to say Govee knows how superior they are. Is it worth the premium? Only up to you, many people think so.",
      "score": 39,
      "created_utc": 1750849660.0,
      "replies": [
        {
          "id": "mzolyij",
          "author": "turgers",
          "body": "So expensive but so so so good. Quite literally my only piece of smart home tech that has had absolutely no issues. Everything else has been finicky as best.",
          "score": 21,
          "created_utc": 1750853167.0,
          "replies": []
        },
        {
          "id": "mzojw16",
          "author": "idkalan",
          "body": "I bought the 4pk starter kit 10 years ago and they're still kicking",
          "score": 10,
          "created_utc": 1750852332.0,
          "replies": [
            {
              "id": "mzompfz",
              "author": "ThatOneSalesGuy",
              "body": "I’ll do you one better, I have a 12 year old starter pack where they are all still kicking. I specifically remember at the time they advertised them as 15 years. \nGuess we will see, but they are the only bulb I use in my house these days.",
              "score": 9,
              "created_utc": 1750853464.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n01p9kd",
          "author": "Engineer9",
          "body": "Yeah, they are really great. I have hue right down my garden where WiFi is scared to go and it all works perfectly.",
          "score": 1,
          "created_utc": 1751023763.0,
          "replies": []
        },
        {
          "id": "mzogne3",
          "author": "DigitalStefan",
          "body": "I don’t know about “best” their RGB driver outputs a dreadful rendition of yellow.",
          "score": -8,
          "created_utc": 1750850954.0,
          "replies": [
            {
              "id": "mzoi48a",
              "author": "ZealousidealEntry870",
              "body": "They actually are the best as far as color and stability goes. There’s nothing else on the market that comes close stability wise, but I believe there are a few coming close color wise.",
              "score": 8,
              "created_utc": 1750851588.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0gphpm",
          "author": "drfsupercenter",
          "body": "I don't understand why you need smart bulbs when smart switches exist. I just use normal LED bulbs in my sockets.",
          "score": -1,
          "created_utc": 1751228375.0,
          "replies": [
            {
              "id": "n0gwa6d",
              "author": "SpinTheWheeland",
              "body": "Home automation? I almost never actually use any switches in my home. Mostly everything is set to either time based events, motion sensors, or I can use my phone.",
              "score": 1,
              "created_utc": 1751230514.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzqeuap",
      "author": "vanhalenbr",
      "body": "With Homdebrige I am switching to Govee, specially because Hue now requires to have an account and it's so complicated and annoying as other solutions\n\nI miss when Hue just works, the app would allow you to easily pair the base, not forcing user account, and other annoyances, it was so easy it woud worth the extra price, but now they are forcing accounts, password and so much stress to setup It just like any other cheaper option",
      "score": 4,
      "created_utc": 1750872650.0,
      "replies": []
    },
    {
      "id": "mzos56i",
      "author": "Tasty-Performer6669",
      "body": "You can really taste the freedom 🇺🇸 🦅",
      "score": 15,
      "created_utc": 1750855512.0,
      "replies": []
    },
    {
      "id": "mzqyl42",
      "author": "Wonderful_Sector_657",
      "body": "Mine just stopped working after a year",
      "score": 2,
      "created_utc": 1750878158.0,
      "replies": []
    },
    {
      "id": "mzz9tn4",
      "author": "None",
      "body": "oh no!",
      "score": 2,
      "created_utc": 1750983142.0,
      "replies": []
    },
    {
      "id": "mzpge8a",
      "author": "H16HP01N7",
      "body": "Sounds like them getting what they deserve, for voting Trump into power, a second time... with 4 years in between to think about it.\n\nOh well.",
      "score": 4,
      "created_utc": 1750863101.0,
      "replies": []
    },
    {
      "id": "mzoi9cr",
      "author": "CheeksMcGillicuddy",
      "body": "They are good, but not anywhere near the premium they cost over others",
      "score": 7,
      "created_utc": 1750851649.0,
      "replies": []
    },
    {
      "id": "mzoewt2",
      "author": "ebbiibbe",
      "body": "The Home Depot smart bulbs are good enough for 90% of the population",
      "score": 2,
      "created_utc": 1750850182.0,
      "replies": [
        {
          "id": "mzoienu",
          "author": "MiningDave",
          "body": "They are more $ BUT and this is just me they will replace them forever. Yes they have a 3 year warrany. But, I have had several that were 5+ years old replaced when they started to act up with no arguments from them. Can't speak to the how HD handles it, but Philips seems to have the attitude, at least with me, of \"whatever, here is a new bulb\"",
          "score": 5,
          "created_utc": 1750851711.0,
          "replies": [
            {
              "id": "mzoqded",
              "author": "ebbiibbe",
              "body": "I'll keep that in mind if I decide to upgrade these.  My needs were pretty simple. I wanted 100w bulbs for daylight in the winter but that I could dim or change the color as needed.",
              "score": 1,
              "created_utc": 1750854864.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mzqlo68",
      "author": "TheMountainLife",
      "body": "I'm not sure what they are capable of now but I'm still rocking some Hue bulbs and bridge from 2016 that meets my needs. In other parts of the house I use Goovee since they're dirt cheap and have them on a segmented network for obvious reasons",
      "score": 1,
      "created_utc": 1750874493.0,
      "replies": [
        {
          "id": "mzqsc54",
          "author": "shorthairs",
          "body": "I was going to post the same!  Standard led lamps burn out constantly and I don't by cheap chinese ones.  But I bought a set of 4 Hues forever ago and they are amazing!",
          "score": 2,
          "created_utc": 1750876377.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzqvi4b",
      "author": "b3nighted",
      "body": "Hue are really expensive, but damn if they haven't been reliable as fuck.\n\nI have bulbs and gear from hue to no-name aliexpress stuff in the house. The first ever were hue, the best ones are also hue.\n\nIkea bulbs have been good but they lost brightness over the years. Govee are not always reliable.\n\n\n\nIf it helps, I have put all other brands direcly via lan/zigbee in my home assistant server, but hue stays on their controller, they're just too good.\n\n\nThe prices are high though.",
      "score": 1,
      "created_utc": 1750877284.0,
      "replies": []
    },
    {
      "id": "mzr73an",
      "author": "johnryan433",
      "body": "What ones support home assistant",
      "score": 1,
      "created_utc": 1750880611.0,
      "replies": []
    },
    {
      "id": "mzrrrh2",
      "author": "FuzzyWuzzyHadNoBear",
      "body": "i use Govee lights. way cheaper and they do the same thing. govee has a lot more product offerings too",
      "score": 1,
      "created_utc": 1750886506.0,
      "replies": []
    },
    {
      "id": "mzs6ftp",
      "author": "KrackSmellin",
      "body": "Got it - overpriced solution I don’t want only gets more expensive.  Guess that happens when greed and a lack of demand happens…. Philips products suck on many levels - have for years.",
      "score": 1,
      "created_utc": 1750891100.0,
      "replies": []
    },
    {
      "id": "mzscxsu",
      "author": "po3smith",
      "body": "I mean I have bulbs finally not working after 10 years. I HATE HATE spending that much on a bulb but after trying many others and having been around when this trend started I have to admit . . . they are the best overall. That being said, that will only get you so far vs the price. \n\n![gif](giphy|ytwDCGKMd8fQfoeNva)",
      "score": 1,
      "created_utc": 1750893232.0,
      "replies": []
    },
    {
      "id": "mzse401",
      "author": "abluedinosaur",
      "body": "They're kind of overpriced, but they're also objectively the best. You're paying for a known premium. The Hue Sync is scam though.",
      "score": 1,
      "created_utc": 1750893614.0,
      "replies": []
    },
    {
      "id": "mzyqpbh",
      "author": "Ruttagger",
      "body": "I started switching to Govee after I did the outside of my entire house, saving myself 70%.",
      "score": 1,
      "created_utc": 1750976655.0,
      "replies": []
    },
    {
      "id": "n0g9car",
      "author": "noseshimself",
      "body": "There was a time when you really needed them as Friends of Hue gateways but these days Shelly is quite good at the Green Gateway stuff you need for the really low power Zigbee devices like buttons that harvest energy from pressing them.",
      "score": 1,
      "created_utc": 1751223181.0,
      "replies": []
    },
    {
      "id": "n0i9oqz",
      "author": "md24",
      "body": "Who tf cares about hue bulbs. Do a product that people actually use next time.",
      "score": 1,
      "created_utc": 1751248080.0,
      "replies": []
    },
    {
      "id": "n0w2511",
      "author": "notta_3d",
      "body": "I stopped buying them years ago because I was struggling with the thought of paying $90 for light bulbs.",
      "score": 1,
      "created_utc": 1751431733.0,
      "replies": []
    },
    {
      "id": "mzph1y5",
      "author": "Vesuvias",
      "body": "Yeah Hue bulbs are always insanely priced. I wait for them to drop 50-65% and pick them up when I need them at HD",
      "score": 1,
      "created_utc": 1750863285.0,
      "replies": []
    },
    {
      "id": "mzonm9i",
      "author": "claritycell",
      "body": "Costs $1 to make and increases probably amount to .25 cents. Better increase overall price by 25%! Every company taking advantage to profit since Covid…",
      "score": -4,
      "created_utc": 1750853820.0,
      "replies": [
        {
          "id": "mzp1kw6",
          "author": "diuturnal",
          "body": "I mean in this case the us is charging Phillips more to import them and that’s being passed to the consumer because that’s what tariffs do.",
          "score": 10,
          "created_utc": 1750858708.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzozo9n",
      "author": "MangoAtrocity",
      "body": "I already can’t justify the price. Doesn’t change much on my end",
      "score": 0,
      "created_utc": 1750858073.0,
      "replies": []
    },
    {
      "id": "mzpbrcj",
      "author": "Da_Stable_Genius",
      "body": "I always thought these were overpriced already. I would always see them advertised during Black Friday sales, and they were still to expensive for my taste.",
      "score": 0,
      "created_utc": 1750861775.0,
      "replies": []
    },
    {
      "id": "mzp0dzp",
      "author": "h1storyguy",
      "body": "Just tell me they put ads on every available place including the LED displays, I need more debt and want to watch more needless ads for landfill",
      "score": -2,
      "created_utc": 1750858312.0,
      "replies": []
    },
    {
      "id": "mzowm18",
      "author": "None",
      "body": "[deleted]",
      "score": -10,
      "created_utc": 1750857058.0,
      "replies": [
        {
          "id": "mzp29lp",
          "author": "xdyldo",
          "body": "You don't have to. You can just connect them to wifi and control through the app, albeit with some limited features.",
          "score": 1,
          "created_utc": 1750858931.0,
          "replies": [
            {
              "id": "mzp8fei",
              "author": "IndianLawStudent",
              "body": "It’s Bluetooth. The hue bulbs don’t rely on wifi (unless remotely accessing them)",
              "score": 2,
              "created_utc": 1750860810.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}