{
  "post": {
    "title": "First report of an Nvidia RTX 5080 power connector melting emerges | Gamers Nexus' Steve is on the case",
    "author": "chrisdh79",
    "id": "1iojtt6",
    "score": 2037,
    "created_utc": 1739455729.0,
    "selftext": "",
    "num_comments": 288,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1iojtt6/first_report_of_an_nvidia_rtx_5080_power/"
  },
  "comments": [
    {
      "id": "mck73cn",
      "author": "isairr",
      "body": "RTX 6080 will require direct plug into the wall at this rate.",
      "score": 600,
      "created_utc": 1739459774.0,
      "replies": [
        {
          "id": "mckhyho",
          "author": "Elios000",
          "body": "laughs in Voodoo5 6000",
          "score": 137,
          "created_utc": 1739462954.0,
          "replies": [
            {
              "id": "mcl9iux",
              "author": "spooooork",
              "body": "[The Voodoo5 6000](https://images.hothardware.com/contentimages/newsitem/54310/content/3dfx_voodoo_5_6000_original.jpg)",
              "score": 93,
              "created_utc": 1739470716.0,
              "replies": [
                {
                  "id": "mclhgjv",
                  "author": "Toiun",
                  "body": "and they made plenty of prototypes more powerful. Imagine 1024x768 unreal with x16 AA at 144 hz in the 90s / early 00s\n\nImagine the universe where 3dfx won the 2000s shader wars and was never bought up and ati stood alone and intel started there supposed gpu lime they planned in the 90s. Ati vs nvidia vs 3dfx vs intel",
                  "score": 53,
                  "created_utc": 1739472986.0,
                  "replies": [
                    {
                      "id": "mcltjqr",
                      "author": "Elios000",
                      "body": "almost did had they last another 6 to 12 months Rampage would murdered the GeForce3 and been the most powerful GPU till Geforce FX line. IRONY here what killed 3Dfx is what nVidia is doing now. making there own board at the cost of there board partners. only 3Dfx didnt have server sales to fall back on...",
                      "score": 27,
                      "created_utc": 1739476311.0,
                      "replies": [
                        {
                          "id": "mclva9g",
                          "author": "Toiun",
                          "body": "The worst part? They ignored all the rnd 3dfx already did because they assumed their line of chipset progression was superior. If they didnt outright archive the voodoo line, they could have progressed it so quickly. Imagine modern silicone sizes with their methodology.",
                          "score": 14,
                          "created_utc": 1739476788.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcmwnw5",
                      "author": "adiabaticgas",
                      "body": "Don’t forget the SoundBlaster audio card!",
                      "score": 9,
                      "created_utc": 1739487502.0,
                      "replies": [
                        {
                          "id": "mcowb9g",
                          "author": "StonebellyMD",
                          "body": "Now I'm curious. What was wrong with the SoundBlaster??",
                          "score": 3,
                          "created_utc": 1739514237.0,
                          "replies": []
                        },
                        {
                          "id": "mcofnsz",
                          "author": "Lost_the_weight",
                          "body": "Yes, setting IRQs and DMAs in autoexec.bat, and moving jumpers around so the boards didn’t conflict.",
                          "score": 2,
                          "created_utc": 1739506545.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mclyg4x",
                      "author": "ByteEater",
                      "body": "Ati vs nvidia vs 3dfx vs intel vs MATROX",
                      "score": 3,
                      "created_utc": 1739477668.0,
                      "replies": [
                        {
                          "id": "mcmfd1n",
                          "author": "hypothetician",
                          "body": " vs Creative Labs vs PowerVR vs S3\n\nMiss those days, they were some good times.",
                          "score": 6,
                          "created_utc": 1739482405.0,
                          "replies": [
                            {
                              "id": "mctgzse",
                              "author": "ByteEater",
                              "body": "Indeed, you had somewhat a choice, hopefully Intel will do some good",
                              "score": 1,
                              "created_utc": 1739576246.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mcoznxi",
                      "author": "Nyoteng",
                      "body": "I read words, but the more I read the less I understand.",
                      "score": 1,
                      "created_utc": 1739516051.0,
                      "replies": []
                    },
                    {
                      "id": "mdbkgyk",
                      "author": "NintendadSixtyFo",
                      "body": "This is why I support Intel. Although I don’t think they are super competitive right now, my hopes are that they will be a solid option once they get through their current roadmap. Choice helps customers. I really don’t want to live in a world where a good GPU is $1000-2000 MSRP and $2000-$4000 scalped to hell and back.",
                      "score": 1,
                      "created_utc": 1739828327.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcmwjas",
                  "author": "rrhunt28",
                  "body": "That is wild, I remember voodoo cards but I didn't remember one with its own plug.",
                  "score": 2,
                  "created_utc": 1739487463.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mck7r3a",
          "author": "sarhoshamiral",
          "body": "It really should. You can easily fit a 24v adapter plug on the back plate. These are desktops plugged to wall already, who cares about another adapter.\n\nThis way PSU inside the case can be smaller as well.",
          "score": 112,
          "created_utc": 1739459975.0,
          "replies": [
            {
              "id": "mckvgck",
              "author": "Esc777",
              "body": "Two separate power supplies with their own noise and frequency and ground sound like a nightmare for integrated electronics components. Especially one that has the most bandwidth on the PCIX bus. ",
              "score": 92,
              "created_utc": 1739466739.0,
              "replies": [
                {
                  "id": "mclk0n8",
                  "author": "Wakkit1988",
                  "body": "Trying to spread 50 amps evenly across 8 wires is a bigger nightmare. The reason they melt is because the power isn't transferred cleanly across all of them, and single wires will peak at over 20 amps of draw when only rated for 10.\n\nA standalone power supply would be no worse than the current situation, but stands to be an improvement.\n\nIn any case, one of the proposed solutions was to increase the output voltage on the GPU power output from the power supply to 36v or 48v, completely eliminating the problem. The excessive amperage draw would be completely eliminated since the peak individual draw across a wire would then be no more than 5-7 amps.\n\nThis is a problem that should've been solved a decade ago, but they've tried nothing and are all out of ideas.",
                  "score": 47,
                  "created_utc": 1739473696.0,
                  "replies": [
                    {
                      "id": "mcmor42",
                      "author": "17Beta18Carbons",
                      "body": "> Trying to spread 50 amps evenly across 8 wires is a bigger nightmare. The reason they melt is because the power isn't transferred cleanly across all of them, and single wires will peak at over 20 amps of draw when only rated for 10.\n\nTransferring 50 amps is not hard, this has been a solved problem in electrical engineering for over a century. You don't use more cables, you use thicker cables, which gives you a dramatically larger crosssection and avoids all the worries with load balancing. Tech companies are just trying to reinvent the wheel because apparently we'd rather risk electrical fires than build in an extra half-inch of clearance.\n\nXT60 connectors have been the gold standard in RC and more recently e-bikes for 30 years at this point. They're rated for 60 amps continuous, are significantly smaller than a 12VHPWR connector, and can handle thousands of connection and disconnection cycles just fine. The downside is that they use 2 relatively thick wires and therefore need a bit more room to have a 90-degree bend in the cable.\n\nMaybe instead of trying to fight physics, we should just accept that cases need to get a half-inch wider or that you need some clearance below the GPU so the cable connects in a different direction.\n\nedit: some folks are talking about higher voltage as an alternative solution, that's just not the limitation here. There are ebikes with these XT60 connectors pulling over 3,000 watts at 72v out of their battery with barely any measurable heat generation in the connector. That's double the wattage and triple the amperage you're even allowed to pull from a wall outlet with standard US wiring. The issue isn't the connector, it's the obsession with using tiny wires so they're easy to bend.",
                      "score": 46,
                      "created_utc": 1739485111.0,
                      "replies": [
                        {
                          "id": "mcmwgoi",
                          "author": "Jusanden",
                          "body": "I, for one, can’t wait for the advent of custom bus bar PC, with custom hardline cooling.",
                          "score": 7,
                          "created_utc": 1739487441.0,
                          "replies": [
                            {
                              "id": "mcmx6jp",
                              "author": "17Beta18Carbons",
                              "body": "Hey I mean we're only talking about 50 amps, an 8 AWG copper cable can handle that just fine. High end PSU already have 120-150 amp bus bars inside them. :D",
                              "score": 11,
                              "created_utc": 1739487663.0,
                              "replies": [
                                {
                                  "id": "mcmyfws",
                                  "author": "Jusanden",
                                  "body": "But where’s the fun in that? Zero risk of a dent in your pc case shorting out your power supply output? Bleh. \n\nBut in all seriousness you’re correct. They don’t even have to use larger connectors. Just use something that’s not a fucking molex ultra fit clone. I’d say it’d cost more but they have their own proprietary standard so I’m not even sure that’s true.",
                                  "score": 6,
                                  "created_utc": 1739488062.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mcodg3p",
                          "author": "Onphone_irl",
                          "body": "I read this and I'm like damn, sounds right, and then I see NVIDIA one of the biggest companies in the world and I don't get why there's a clean future proof answer here but not on the shelves",
                          "score": 1,
                          "created_utc": 1739505666.0,
                          "replies": [
                            {
                              "id": "mcopm1n",
                              "author": "17Beta18Carbons",
                              "body": "I've no doubt the engineers at Nvidia are perfectly aware of this and tearing their hair out saying \"we told you so\" in all of the emergency meetings that are undoubtedly going on there. Someone at Nvidia has made an executive decision to do a worse thing because it seems modern and cool.\n\nAlso you wouldn't actually want to use an XT60 connector inside a computer because there's no clip and you can just pull them apart, it was just an easy example because they're so ubiquitous. There are other similar off-the-shelf connector designs that would work just fine though.",
                              "score": 3,
                              "created_utc": 1739510902.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mcww852",
                          "author": "innociv",
                          "body": "> Maybe instead of trying to fight physics, we should just accept that cases need to get a half-inch wider or that you need some clearance below the GPU so the cable connects in a different direction.\n\nThey could also just have the connector facing 90 degrees outward from the front of the card or out the backplate. Some cards do do this.",
                          "score": 1,
                          "created_utc": 1739633468.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcplma0",
                      "author": "silon",
                      "body": "> 20 amps of draw when only rated for 10.\n\nThat seems like a huge difference, unless the cable/connector is really bad or maybe somewould be using a dual rail PSU, but I'm not sure that is still a common thing?",
                      "score": 1,
                      "created_utc": 1739529516.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcmvzw0",
                  "author": "Jusanden",
                  "body": "PCIE is differential, it’s not ground referenced. \n\nYour actual potential issues are congrats, now the tdp of your card went up another 10%, your size just ballooned by 3/4 of a PSU and congrats now you have a giant EMI emitting magnetics right next to your highly sensitive lines. Fun!",
                  "score": 8,
                  "created_utc": 1739487299.0,
                  "replies": []
                },
                {
                  "id": "mcmdmsh",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1739481918.0,
                  "replies": [
                    {
                      "id": "mcmke9d",
                      "author": "yashdes",
                      "body": "So do most servers. Yeah it would require some more protections and circuits, but it's definitely doable",
                      "score": 4,
                      "created_utc": 1739483837.0,
                      "replies": [
                        {
                          "id": "mcptdlt",
                          "author": "donce1991",
                          "body": ">most servers\n\ngenerally have identical (same power / voltage) psus, generally with only one voltage, like 12v, and those psus still have to connect to some sort of balancing/distribution board, its far cry from mixing diff power/voltages psus, like axt (12v, -12v, 5v, -5v, 3,3v) with some external psu with like 24v\n\n>require \n\n\"just\" adding whole additional conversion for power delivery on gpu to support both 12v from pcie socket and external psu higher voltages, OR isolating gpu power delivery from the rest of the system to only use power from external psu, OR by outright dropping or modifying atx standard even more and making new psus and connectors that are pretty much incompatible with old stuff, so much doable, very easy /s\n\n>doable \n\nwould be to use a connectors with huge safety margin that been proven to work, like PCIE 8 pin or EPS",
                          "score": 1,
                          "created_utc": 1739533915.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcpwc7e",
                      "author": "donce1991",
                      "body": ">have multiple power supplies\n\ngenerally for redundancy and not for each psu to power a diff component... they also are identical (same power / voltage), generally outputs only one voltage, and still have to be connected to some sort of balancing/distribution board, its far cry from mixing diff power/voltages psus, like axt (12v, -12v, 5v, -5v, 3,3v) with some external psu with like 24v",
                      "score": 1,
                      "created_utc": 1739535373.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcnu8ib",
                  "author": "kkjdroid",
                  "body": "If you're still using PCI-X in the 21st century, you don't need to worry about power requirements.",
                  "score": 1,
                  "created_utc": 1739498697.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcka15a",
              "author": "zz9plural",
              "body": "Why 24V?\nThe only advantage would be less copper needed for the wires that transport the power to the card, but those could already be much shorter with this solution.",
              "score": 7,
              "created_utc": 1739460657.0,
              "replies": [
                {
                  "id": "mckdp2j",
                  "author": "sarhoshamiral",
                  "body": "Less amps but your question is fair, I didn't really think much about the voltage part.\n\nI really like the idea of an external power supply though just for the GPU.",
                  "score": 13,
                  "created_utc": 1739461725.0,
                  "replies": [
                    {
                      "id": "mcl2fxh",
                      "author": "yepgeddon",
                      "body": "Sure if money is no object. This sounds like it could get expensive, as if GPUs weren't already wildly overpriced.",
                      "score": 2,
                      "created_utc": 1739468708.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mckl9na",
              "author": "None",
              "body": "I like this more the more I think about it. No need for more than 300W. Crappy power supplies in store bought PC's would be just fine.",
              "score": -1,
              "created_utc": 1739463902.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcopvna",
          "author": "repocin",
          "body": "I'd rather provide nvidia with 150W and they can use AI to imagine the rest.",
          "score": 6,
          "created_utc": 1739511028.0,
          "replies": []
        },
        {
          "id": "mcl3nra",
          "author": "Appropriate_Ask_5150",
          "body": "80% of the power goes directly to my GPU so why not",
          "score": 4,
          "created_utc": 1739469044.0,
          "replies": [
            {
              "id": "mclvs8l",
              "author": "mccoyn",
              "body": "Maybe the PC power supply should just plug into the GPU and the GPU plugs into the wall.",
              "score": 5,
              "created_utc": 1739476928.0,
              "replies": [
                {
                  "id": "mcodlxo",
                  "author": "Onphone_irl",
                  "body": "put the computer IN the gpu",
                  "score": -1,
                  "created_utc": 1739505730.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mclehpd",
          "author": "Xendrus",
          "body": "Why not? I would vastly prefer that.",
          "score": 5,
          "created_utc": 1739472146.0,
          "replies": []
        },
        {
          "id": "mclijb4",
          "author": "hyrumwhite",
          "body": "I’m down with this. A melted outlet is cheaper than a melted PSU",
          "score": 4,
          "created_utc": 1739473283.0,
          "replies": [
            {
              "id": "mclos6x",
              "author": "nonowords",
              "body": "only if you're down to, and allowed to, do home electrical work.",
              "score": 2,
              "created_utc": 1739475007.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcmdkog",
          "author": "GrumpyAlien",
          "body": "I'll buy it!",
          "score": 1,
          "created_utc": 1739481902.0,
          "replies": []
        },
        {
          "id": "mcnnwwn",
          "author": "edvek",
          "body": "So it can burn down my house? Eh I guess Nvidia can buy me a new house.",
          "score": 1,
          "created_utc": 1739496516.0,
          "replies": []
        },
        {
          "id": "mcnnx9f",
          "author": "Smear_Leader",
          "body": "GPU’s will have their own cooled case sooner than later",
          "score": 1,
          "created_utc": 1739496519.0,
          "replies": []
        },
        {
          "id": "mcnsfee",
          "author": "xxrazer505xx",
          "body": "Sounds like it'd be safer tbh",
          "score": 1,
          "created_utc": 1739498071.0,
          "replies": []
        },
        {
          "id": "mcpc976",
          "author": "steves_evil",
          "body": "Yes, but the cable that they provide will only be rated for 105% of the current that's going to flow through the cable and connectors under ideal condition and normal load. Transient spikes and non-perfect connections will still cause fires.",
          "score": 1,
          "created_utc": 1739523604.0,
          "replies": []
        },
        {
          "id": "mcq14us",
          "author": "tbone338",
          "body": "You have to make sure you limit TDP to 77% otherwise on factory settings it’ll draw too much power and melt the connector.",
          "score": 1,
          "created_utc": 1739537521.0,
          "replies": []
        },
        {
          "id": "mdv85sk",
          "author": "None",
          "body": "important toy alive snow six fear trees retire yam decide\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1740083762.0,
          "replies": []
        },
        {
          "id": "mcm91ht",
          "author": "Night_Inscryption",
          "body": "The RTX 7060 will require you to plug into a Nuclear Fusion Reactor",
          "score": 1,
          "created_utc": 1739480629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcjyr9r",
      "author": "sulivan1977",
      "body": "Its like maybe they should have stuck with multiple basic connectors and spread the load out more.",
      "score": 329,
      "created_utc": 1739457114.0,
      "replies": [
        {
          "id": "mck5krj",
          "author": "Samwellikki",
          "body": "Think the bigger issue is we are still using basic cables to connect and manage 600w on multiple wires, without intelligent load management being built in somewhere\n\nThis isn’t a 1500w microwave with one fat cord and 3 wires, or a washer/dryer hookup on a beefy cable\n\nThis is 600w going across spaghetti with “I sincerely hope each wire shares evenly”\n\n![gif](giphy|l0NwNrl4BtDD7JCx2)",
          "score": 253,
          "created_utc": 1739459308.0,
          "replies": [
            {
              "id": "mck6enm",
              "author": "manofth3match",
              "body": "I think the biggest issue is that this is simply an unsustainable power requirement for a component in a PC. \n\nThey are doing their base level architecture engineering with a focus on data center requirements and power requirements for graphics cards have become wholly unacceptable.",
              "score": 148,
              "created_utc": 1739459565.0,
              "replies": [
                {
                  "id": "mcl8dsr",
                  "author": "RikiWardOG",
                  "body": "this is exactly how I feel. the tdp on these cards is absolutely bananas. They've run our of ability to gain performance through new architectures, so they've resorted to just throwing more power at it.",
                  "score": 17,
                  "created_utc": 1739470386.0,
                  "replies": []
                },
                {
                  "id": "mck9ili",
                  "author": "Samwellikki",
                  "body": "Time for a dedicated wall plug, with a mandatory surge/conditioner between",
                  "score": 39,
                  "created_utc": 1739460503.0,
                  "replies": [
                    {
                      "id": "mckbgns",
                      "author": "manofth3match",
                      "body": "Or. And hear me out. Don’t purchase this shit. They will keep not giving a fuck if everyone keeps purchasing every chip they make regardless of fundamental issues with power consumption and insane pricing.",
                      "score": 77,
                      "created_utc": 1739461078.0,
                      "replies": [
                        {
                          "id": "mcke63w",
                          "author": "Protean_Protein",
                          "body": "They don’t care about consumer cards anyway. Not purchasing them will just cause them to focus even more on enterprise solutions. Catch-22 sucks.",
                          "score": 39,
                          "created_utc": 1739461863.0,
                          "replies": [
                            {
                              "id": "mclydwp",
                              "author": "ensignlee",
                              "body": "That's fine. We can just buy AMD cards. A 7900XTX competes with a 4080 Super. That covers gamers except for people who wants 4090s and 5090s, which let's be real - that's not THAT big a portion of all gamers.\n\nThere IS a solution here, right in front of our faces.",
                              "score": 9,
                              "created_utc": 1739477651.0,
                              "replies": [
                                {
                                  "id": "mclzl0u",
                                  "author": "Protean_Protein",
                                  "body": "Kind of. I buy AMD personally. But it’s just a fact that they’re not putting out cards that are competitive with Nvidia and aren’t even trying to do that. But given what Nvidia are doing, AMD doesn’t even have to price their cards all that competitively. There’s effectively a duopoly (ignoring Intel) that functions as a tiered monopoly. It’s bad.",
                                  "score": 17,
                                  "created_utc": 1739477984.0,
                                  "replies": [
                                    {
                                      "id": "mco0x03",
                                      "author": "Znuffie",
                                      "body": "Intel's Battlemage is actually quite decent of a card.",
                                      "score": 6,
                                      "created_utc": 1739501078.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mclktv7",
                          "author": "macciavelo",
                          "body": "I wish AMD would put out GPUs that are good for more than games. Nvidia is pretty much king in any utility program like 3D modelling software or editing.",
                          "score": 10,
                          "created_utc": 1739473921.0,
                          "replies": []
                        },
                        {
                          "id": "mcl9cqd",
                          "author": "Specialist-Rope-9760",
                          "body": "They have no competition.",
                          "score": 7,
                          "created_utc": 1739470666.0,
                          "replies": []
                        },
                        {
                          "id": "mclfg0t",
                          "author": "Xendrus",
                          "body": "25 people coming together to not purchase a shitty thing won't stop hordes from ripping them off the shelves or make the company stop doing it though.",
                          "score": 5,
                          "created_utc": 1739472420.0,
                          "replies": []
                        },
                        {
                          "id": "mckd6up",
                          "author": "Samwellikki",
                          "body": "Some of us need a new card, it’s been a decade\n\nWill roll the dice and do what we can to mitigate, but in the end this is a warranty issue that they’ll have to solve if truly widespread and not attributed to anything else\n\nThere should be a PSU-level solution, as I don’t think any sort of smart load balancing chip on the GPU side would fix it\n\nIt’s more than just monitoring and maintaining power level like a conditioner within a UPS, I think\n\nNot 100% sure though\n\nMaybe an add-on between PSU and GPU could fix it if installed at the PSU connector side\n\n\nProblem is, would have to be first party\n\nAfter cable mod debacle, I doubt any third party is going to provide a solution that makes them responsible",
                          "score": -13,
                          "created_utc": 1739461577.0,
                          "replies": [
                            {
                              "id": "mcke1rm",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -5,
                              "created_utc": 1739461827.0,
                              "replies": [
                                {
                                  "id": "mckfb7p",
                                  "author": "Samwellikki",
                                  "body": "Look, it’s Captain Semantics of the U.S.S. Nobody Asked\n\nOfc it isn’t a “need”\n\nYou don’t  NEED that 5000 calorie diet, oh unless you are a body builder, then I concede….. Christ on a cracker\n\nSome of us can’t AFFORD to upgrade yearly, so yeah, a “need” in that sense\n\nJust like you don’t NEED that car to replace the one you ran into the ground because you can’t afford a new one every 3 years… you could walk, bike, or take the bus the 50 miles\n\n\nIdiot",
                                  "score": 11,
                                  "created_utc": 1739462190.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mclfhri",
                              "author": "deano413",
                              "body": "I hear that but Intel and AMD are right there.  NVDA gpus are so overrated",
                              "score": -1,
                              "created_utc": 1739472434.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mcnl0nv",
                          "author": "droppinkn0wledge",
                          "body": "Idiotic take. “Imagine a world with no crime.” Are you 10?\n\nThere will always be a massive consumer base for cutting edge electronics. And there is plenty of market incentive to fix the overheating issue.",
                          "score": -1,
                          "created_utc": 1739495530.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcn4zsd",
                      "author": "Bowtie16bit",
                      "body": "Two pc towers: one for CPU and one for GPU. Motherboard for each. That's where it'll go. GPUs are getting so large anyway.",
                      "score": 0,
                      "created_utc": 1739490188.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mckicb2",
                  "author": "Esc777",
                  "body": "It’s exactly this. Unsustainable and mismanaged.  Conceptually as a box the computer is lopsided with another whole parallel computer crammed in there. \n\nWe’ve reached the end of the line. ",
                  "score": 12,
                  "created_utc": 1739463066.0,
                  "replies": [
                    {
                      "id": "mckr7gs",
                      "author": "suddenlyreddit",
                      "body": "> We’ve reached the end of the line. \n\nNot really. This is an engineerable fix. But that's part of the issue as well. What if the solution requires a different connector type and engineering for future PC PSUs? That's a whole lot of follow-on changes for other manufacturers, etc. What if the solution is an additional power lead from PSUs? Again, that affects more parts within the PC system currently, since there will be many left with not enough power outputs from currently deployed systems, etc. Overall, it's fixable, but will very likely require more than just effort from NVIDIA on a fix. But in the short term, this is very bad for them with the current manufacturing going on for the cards and sales thereof. \n\nThis is also a -great- time for a competitor to seize some market share if they can push additional GPU power and features and maintain better stability. \n\nI don't think we're at the end of the line yet. Certainly I remember very low wattage early PCs and lack of dedicated GPUs even. We've come a long way. Power requirements have grown but we aren't outside of being able to make it work. Not yet. \n\nI guess we'll see what happens here and how they handle things.",
                      "score": 8,
                      "created_utc": 1739465553.0,
                      "replies": [
                        {
                          "id": "mcl7xlu",
                          "author": "CamGoldenGun",
                          "body": "exactly. They just need to make a new standard of cable that can handle the load. 4 Gauge cable would handle it but there'd need to be new connectors unless you want to screw it in like a car's audio system.",
                          "score": 3,
                          "created_utc": 1739470257.0,
                          "replies": [
                            {
                              "id": "mclaxbj",
                              "author": "YouTee",
                              "body": "Literally a separate power adapter that plugs into mains and skips the psu entirely.\n\nIt can be surge protected, actively cooled, and you could probably have a much smaller psu in your computer (and thus smaller, lighter, and cheaper)",
                              "score": 6,
                              "created_utc": 1739471113.0,
                              "replies": [
                                {
                                  "id": "mcld2wg",
                                  "author": "CamGoldenGun",
                                  "body": "Power brick or a standard C13/14 universal power cord?",
                                  "score": 0,
                                  "created_utc": 1739471737.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mcpp6el",
                              "author": "shazarakk",
                              "body": "They could also just make the power delivery on the GPU side competently, instead.\nFor a single 50 amp wire, you'd need a total cross section of about 13,3mm² or 6 gauge. let's go with 4 gauge(21mm²), assuming the next card has an 800w limit.\n\nContra 6 cables with 16 gauge (1.3mm² cross section) (what Cablemod uses), which should, in theory, take 90 total amps.\n\nThey did that with the 3090, and 3090TI, which didn't exactly melt all that much.\nWhat happens is, when your load is balanced, and you're only pulling 8.5A per wire, no problems occur, excepting user error, or manufacturing mistake. But because of the power delivery system, the load ends up imbalanced, and one wire ends up delivering more current than the others: Note that it's usually one or two wires that have melted, not the entire connector (at first).",
                              "score": 0,
                              "created_utc": 1739531625.0,
                              "replies": [
                                {
                                  "id": "mcqqu0y",
                                  "author": "CamGoldenGun",
                                  "body": "yea to pass regulations they would have had to pass standards. Something's not right if the power isn't being distributed evenly.",
                                  "score": 2,
                                  "created_utc": 1739546642.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mckv19r",
                          "author": "Esc777",
                          "body": "End of the line without a dedicated fix from how PSUs GPUs and computers integrate. Mini Molex connectors are not cutting the mustard. ",
                          "score": 1,
                          "created_utc": 1739466622.0,
                          "replies": [
                            {
                              "id": "mcl0ph6",
                              "author": "suddenlyreddit",
                              "body": "For that connector I don't disagree. Or for a fix/engineering for how power is balanced across said connectors (or a new connector.)\n\nMy apologies, /u/Esc777 . I thought you meant end of the line for PC's and GPU's as a whole design together. I still think we have plenty to go there.",
                              "score": 3,
                              "created_utc": 1739468221.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mcnlbiz",
                      "author": "droppinkn0wledge",
                      "body": "People were literally saying this ten years ago. You’re just too young or ignorant to remember.",
                      "score": 1,
                      "created_utc": 1739495632.0,
                      "replies": [
                        {
                          "id": "mcnnc7u",
                          "author": "Esc777",
                          "body": "lol",
                          "score": 0,
                          "created_utc": 1739496319.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mcrf0bz",
                  "author": "sluuuurp",
                  "body": "It’s not unsustainable, it just requires innovation. You could make the same argument about how a microwave’s electrical power requirements are unsustainable for a kitchen appliance.",
                  "score": 1,
                  "created_utc": 1739553763.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcklcxb",
              "author": "Agouti",
              "body": "100% correct. I worked on some pretty high powered projects in my career and one of the big golden rules was *never run cables in parallel to meet current handling requirements*. You just cannot guarantee that you won't have a minor ohm mismatch in the connections or cables that would cause one to exceed its capacity.\n\nThere were so many ways to fix this. The absolute easiest would have been simply to go back to independent 12v rails on the PSU as a requirement for 12vHPWR. Or go higher voltage, up to 48V like power tools and USB-C did.",
              "score": 30,
              "created_utc": 1739463929.0,
              "replies": []
            },
            {
              "id": "mckxaga",
              "author": "k0c-",
              "body": "there is literally only 1 shunt resistor on the board of the 5080 and 5090FE, in previous generation there was 2 or 3. its literally just forcing all that power through",
              "score": 6,
              "created_utc": 1739467255.0,
              "replies": []
            },
            {
              "id": "mclf8ve",
              "author": "Xendrus",
              "body": "doesn't it spike up way higher than that?",
              "score": 1,
              "created_utc": 1739472364.0,
              "replies": []
            },
            {
              "id": "mcq1y0h",
              "author": "doctorcapslock",
              "body": "> without intelligent load management being built in somewhere\n\ni'm not sure load balancing would help in this case. say the load measures a higher contact resistance on one of the wires, but the power requested is still 600 W; if another wire is to pick up the slack when it's already at the limit, it will result in overheating in a different wire/pin or a reduction in performance\n\nthe only solution that both maintains performance and increases thermal overhead is a reduction the total contact resistance; i.e. the connector must be bigger and/or more must be connections must be made",
              "score": 1,
              "created_utc": 1739537864.0,
              "replies": []
            },
            {
              "id": "mctik03",
              "author": "dugg117",
              "body": "even worse they are going backwards. the 3090 didn't have hopes and dreams of the power being distributed evenly it actively did it.",
              "score": 1,
              "created_utc": 1739576799.0,
              "replies": []
            },
            {
              "id": "mcn6vmj",
              "author": "None",
              "body": "Tell me u know nothing about microwaves without telling me hmmmmm",
              "score": -7,
              "created_utc": 1739490814.0,
              "replies": [
                {
                  "id": "mcn74t3",
                  "author": "Samwellikki",
                  "body": "![gif](giphy|qvLt6NpOstLuVzLCL9)",
                  "score": 3,
                  "created_utc": 1739490898.0,
                  "replies": [
                    {
                      "id": "mcn9byj",
                      "author": "None",
                      "body": "Your mother",
                      "score": -5,
                      "created_utc": 1739491627.0,
                      "replies": [
                        {
                          "id": "mcn9f2p",
                          "author": "None",
                          "body": "Didn’t know I needed the slash s",
                          "score": 0,
                          "created_utc": 1739491656.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mckgly4",
          "author": "kniveshu",
          "body": "As someone who hasn't looked at graphics cards in a couple years I'm surprised they are down to one connector. Not surprised that connectors are melting if its relying on that one connector could be damaged, dirty, corroded.",
          "score": 22,
          "created_utc": 1739462560.0,
          "replies": [
            {
              "id": "mckoohf",
              "author": "drmirage809",
              "body": "Nvidia had the brilliant idea because their top end cards eat an absolutely staggering amount of power. The 5090 is almost 600 watts! And that’s stock. No boosts, no overclock, nothing. \n\nSo instead of sticking a bunch of the old 8 pin on there they instead came up with this small thing. It supposedly is good for 600 watts, but the cables have been melting since the 4090. \n\nAMD just said “fuck it” and stuck more old school 8 pins on their cards.",
              "score": 25,
              "created_utc": 1739464844.0,
              "replies": [
                {
                  "id": "mclmoly",
                  "author": "Wakkit1988",
                  "body": ">So instead of sticking a bunch of the old 8 pin on there they instead came up with this small thing. It supposedly is good for 600 watts, but the cables have been melting since the 4090. \n\nFun fact: The images of the prototype 50XX cards all have four 8-pin connectors on the card. They were literally engineered utilizing them. They cut back to the single connector for production.\n\nThey absolutely know this is a problem, but are passing the buck to consumers to save pennies on cards selling for thousands.",
                  "score": 11,
                  "created_utc": 1739474433.0,
                  "replies": []
                },
                {
                  "id": "mctiwkr",
                  "author": "dugg117",
                  "body": "kinda nuts that the 3090 solved this problem by treating the single connector like 3 and balancing the load. And that would likely have solved the issue for the 4090 and 5090/5080",
                  "score": 2,
                  "created_utc": 1739576923.0,
                  "replies": []
                },
                {
                  "id": "mcouak2",
                  "author": "hasuris",
                  "body": "When it's about costs and the environment nobody gives a shit about power draw. People make fun of us Europoors with our energy costs but when your GPU burns your house down, it's suddenly an issue.\n\n/s",
                  "score": 1,
                  "created_utc": 1739513194.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcmn5nc",
          "author": "soulsoda",
          "body": "It'd be fine if they load balance, but they don't. To the card the 6 wires may as well be one.",
          "score": 4,
          "created_utc": 1739484637.0,
          "replies": []
        },
        {
          "id": "mckoqs8",
          "author": "fvck_u_spez",
          "body": "Yep, I think AMD and Intel have the right mentality here",
          "score": 6,
          "created_utc": 1739464862.0,
          "replies": []
        },
        {
          "id": "mco8xbm",
          "author": "Twodogsonecouch",
          "body": "Or maybe just design whatever cable(s) you plan on using to idk have an upper safe limit that isn’t so close to the max power draw of the device…",
          "score": 2,
          "created_utc": 1739503959.0,
          "replies": []
        },
        {
          "id": "mclwiwh",
          "author": "MissusNesbitt",
          "body": "[Relevant XKCD](https://xkcd.com/927/)",
          "score": 1,
          "created_utc": 1739477137.0,
          "replies": []
        },
        {
          "id": "mckl419",
          "author": "IzekG",
          "body": "![gif](giphy|o1BNU1jKCih7tK4dwj)",
          "score": 0,
          "created_utc": 1739463859.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mck07i0",
      "author": "ArugulaElectronic478",
      "body": "The fan in the computer:\n\n![gif](giphy|nrXif9YExO9EI)",
      "score": 92,
      "created_utc": 1739457598.0,
      "replies": [
        {
          "id": "mclloj8",
          "author": "NegaDeath",
          "body": "The liquid coolers:\n\n![gif](giphy|hY3a4jYfZBQVq)",
          "score": 26,
          "created_utc": 1739474156.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcjvmt2",
      "author": "None",
      "body": "![gif](giphy|14fX2WQuOIVHBC)\n\nAh shit here we go again",
      "score": 214,
      "created_utc": 1739456065.0,
      "replies": [
        {
          "id": "mcnyqtn",
          "author": "J_elias95",
          "body": "At this rate, we’ll need a dedicated PSU just to power our GPUs… and maybe a fire extinguisher on standby. Can’t wait for the RTX 5090 Power Edition, bundled with a 1000W GPU-only power supply and optional active cooling for the 12VHPWR connector. 🔥",
          "score": 0,
          "created_utc": 1739500300.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mckn1sn",
      "author": "Maetharin",
      "body": "Friend of mine from Spain had his melted a few days ago.",
      "score": 23,
      "created_utc": 1739464403.0,
      "replies": [
        {
          "id": "mcop62b",
          "author": "pragmatick",
          "body": "I have a 5080 at home that I can't use yet. Seems to be better that way.",
          "score": 5,
          "created_utc": 1739510694.0,
          "replies": [
            {
              "id": "mcpnx5m",
              "author": "Maetharin",
              "body": "Ironically, the safest option seems to be the Nvidia 12v-2x6 to 8pin adapter that comes with the card.\n\nThe 50 series adapter's connector itself has way more mass than those on the PSU or aftermarket cables and the cables aren't as rigid as the ones that came with the 40 series.",
              "score": 4,
              "created_utc": 1739530883.0,
              "replies": [
                {
                  "id": "mcpqq1h",
                  "author": "pragmatick",
                  "body": "Thanks for the information. I just bought the newest Corsair RM1000x and was about to ask their support which cable I should use.",
                  "score": 1,
                  "created_utc": 1739532490.0,
                  "replies": [
                    {
                      "id": "mcq4rxq",
                      "author": "Maetharin",
                      "body": "Perhaps there will be changes now, but we‘ll have to see.",
                      "score": 1,
                      "created_utc": 1739539029.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcjvlvh",
      "author": "Genocode",
      "body": "I was thinking \"hey atleast the 5080's are safe\"\n\nGuess i'll wait on AMD before deciding anything.",
      "score": 145,
      "created_utc": 1739456056.0,
      "replies": [
        {
          "id": "mck4yox",
          "author": "aposi",
          "body": "There's two problems here, the safe limits of the cable and the uneven current distribution. The 5080 is within the safe limits of the cable while the 5090 has next to no safety margin. The uneven current distribution is a problem that can affect both because there's no load balancing on the GPU side of the connector. It could affect most 5000 series cards, the specific cause of the uneven load isn't clear yet but there's nothing in place to stop it.",
          "score": 61,
          "created_utc": 1739459117.0,
          "replies": [
            {
              "id": "mcms1by",
              "author": "soulsoda",
              "body": ">It could affect most 5000 series cards, the specific cause of the uneven load isn't clear yet but there's nothing in place to stop it\n\nIt will affect all 50 series cards that use 12Vhpwr or 12V-2x6 and use anything close to 400watts because that's simply how electricity works. Electricity follows the path of least resistance. Nvidia did load balancing on the card for the 3090, and we didn't hear anything about cables melting despite being 12vhpwr, because the worst case scenario is that any single wire of 6 had to deal with 200 watts. The worst case scenario for the 40/50 series is that a single wire could have to deal with 600 watts. This made improper contact a huge issue. Each improper contact means another wire not properly sharing the load, and that's a death sentence because the safety factor on the cable is only 1.1, you can't afford a single dud on the cable when your using over 500w. \n\nImproper contact aside, it's still an issue just running the card. Even if material and coating was identical, there's still going to be minute differences that's unnoticeable by any reasonable human measurement in the resistance that the majority of current will flow through a couple wires out of the available 6. Causing wires to have to deal with 20-30 amps instead of 9-10, all because Nvidia can't be arsed to balance their God damn load.",
              "score": 19,
              "created_utc": 1739486094.0,
              "replies": [
                {
                  "id": "mctsl3d",
                  "author": "yworker",
                  "body": "So, in basic terms, does this mean as long as 5080 stays below 400w it should be fairly safe?",
                  "score": 1,
                  "created_utc": 1739580378.0,
                  "replies": [
                    {
                      "id": "mctx4tw",
                      "author": "soulsoda",
                      "body": "It should be. A 5080 TDP is only 360 watts. You'd have to overclock it to get up to 450 watts. There's also might be cases where power draw might peak instantaneously above 400-450watts even if not OC'd, but you'd have to OC to have any sustained load.  \n\nThe wire is supposed to deliver a max of 9.5A x 12v x 6 pins = 684 watts. Specified for 600 watts and a safety factor of 1.1. Every bad connection removes ~114 watts from the safe power cap. If you had bad/faulty connection on say 2 of the 6 pins, you're already down to ~457 watts of safe delivery, and that's not accounting for the fact the load isn't balanced so there's no telling if you've got wires running way above spec unless you measure them. The cable will survive 20-30A for a few mins on an individual wire, but eventually the connectors are gonna melt and it'll be too late to save your card once you smell burning plastic. \n\nmy advice is to not OC this generation and rather set target power to 70-80%. It'll take some tweaking on clock speeds, but you'll probably lose ~5% performance, but the card efficiency will sky rocket and save you some $$$ on energy bills. I know like half of enthusiasts hate that type of advice (i paid for X i want it to do what its made for), but thats my personal opinion. \n\nmy other advice is to inspect the wire. gently, like barely any force at all, tug on each wire on your 12vHPWR/12v 2x6 cable, and see if the pins move. If there's a loose pin, you probably won't get good contact on it as it's lose and will get pushed out, or even slip out a bit if you ever finagle with your pc despite the connector being fully seated.\n\nAlso visually inspect the wire to ensure the pins are at the same level in the connector. \n\nstupid we have to do this, but thats where we are.\n\nEdit:typos grammar",
                      "score": 2,
                      "created_utc": 1739582034.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mcn92sj",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1739491542.0,
                  "replies": [
                    {
                      "id": "mcnhhja",
                      "author": "soulsoda",
                      "body": ">Not quite, if any of the power phases were out of whack, the card would not operate. This would happen long before 200W was sustained on a single connection -- the voltage mismatch as this happened would have shut the card down or prevented it from powering up.\n\n...? Thats not what i'm talking about.  \n\n6 wires deliver power in a 12vhpwr, 600W max. 3 shunts. 200 watts shared between 2 wires, on average they should be delivering 100W per wire under heavy load. In the worst case of improper connection, yes the card will suffer instability and not work properly, but it will probably attempt to draw power and so the worst case is 200W for a bit before the card says no mas. Which is why the 3090 never melted, but a 4090 had single shunt so it doesn't know if any wire wasn't properly connected... hence melted 4090s. \n\n>FFS can we just add a 48V rail already with a single 14 AWG wire pair\n\nThe short is the ATX standard is 12V. The long answer is because that would require the entire PC market to agree to change voltage, and its a kind of a waste of money, and potentially hazardous. Any efficiency gains switching to higher voltage is going to be largely lost because the of the gap in Vin vs Vout. Most of the core components gpu core/cpu use like 1V. 12V is also what alot of peripherals use. So if even if you switched to 24V thats still more conversion. if Nvidia forcibly switched the industry to 24-48V that'd be pretty arrogant and wasteful. Force a new mobo standard, more conversion, more cost. Also we're talking about the home DIY market here too. 48V is on the edge of dangerous for safety standards, and many people build pcs without knowing diddly squat about electrical safety.",
                      "score": 2,
                      "created_utc": 1739494341.0,
                      "replies": []
                    },
                    {
                      "id": "mcqsayg",
                      "author": "soulsoda",
                      "body": "https://www.youtube.com/watch?v=oB75fEt7tH0\n\n4 Wires cut in this video. Card still operates btw. Even i was shocked. If you own a 5090. i'd be lowering target power to like 70-75%.",
                      "score": 1,
                      "created_utc": 1739547088.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mckdv2p",
              "author": "CornWallacedaGeneral",
              "body": "The actual wires in the connector can handle the voltage...its the pins inside the coupler that can't handle the voltage and melt....big R&D failure for Nvidia",
              "score": -21,
              "created_utc": 1739461773.0,
              "replies": [
                {
                  "id": "mckiw8k",
                  "author": "jonboy999",
                  "body": "Current, not voltage.",
                  "score": 20,
                  "created_utc": 1739463225.0,
                  "replies": [
                    {
                      "id": "mckyq3k",
                      "author": "Uncommented-Code",
                      "body": "Semantics really,  since power is what decides how much heat is generated, which is a function of both current and voltage, and voltage drop-off is again influenced by resistance, which tends to be higher at connection points such as crimps and at connector contact points.",
                      "score": -16,
                      "created_utc": 1739467657.0,
                      "replies": [
                        {
                          "id": "mckz73t",
                          "author": "jonboy999",
                          "body": "Not really, since current is what dictates the cross sectional area of wire required, and power is not dissipated by the wire, but by the device itself.\n\nIncreasing the voltage of a device (and therefore reducing the current needed) is one way to reduce the size of wire required, while keeping the same power output.",
                          "score": 13,
                          "created_utc": 1739467790.0,
                          "replies": [
                            {
                              "id": "mcl79ie",
                              "author": "mortaneous",
                              "body": "To be pedantic, the wire does dissipate some power, which is why a lot of industrial wiring ratings will specify the rated current with an acceptable temperature rise or temperature limit (e.g. #14 copper with THHN insulation is rated for 25A at 90C).\n\nWith PC power supplies using aluminum wire and finer gauge, the ampacity is even lower, and they probably also use lower temperature rated TW or UF or worse.",
                              "score": 6,
                              "created_utc": 1739470065.0,
                              "replies": []
                            },
                            {
                              "id": "mcooi6q",
                              "author": "tardis0",
                              "body": "Forgive the stupid question, but if the higher the voltage, the thinner the wire, why isn't electricity transmitted at like 10000V in our houses, and use paper-thin wiring? Wouldn't it be cheaper?",
                              "score": 1,
                              "created_utc": 1739510387.0,
                              "replies": [
                                {
                                  "id": "mcpon72",
                                  "author": "jonboy999",
                                  "body": "I am in no way an expert, but the higher the voltage the more risk to life. High voltage can drive current through high resistance objects, like people. Also at very high voltage, arcing is more likely, so a higher fire risk.\n\nVery high voltage is used to save money for long distance transmission across country - but the wires are much more difficult to access so it's less of a safety risk.",
                                  "score": 1,
                                  "created_utc": 1739531314.0,
                                  "replies": [
                                    {
                                      "id": "mcu5tik",
                                      "author": "tardis0",
                                      "body": "Ah, interesting, thank you!",
                                      "score": 1,
                                      "created_utc": 1739585308.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mcl2ssv",
                          "author": "RobertLoblawAttorney",
                          "body": "Voltage doesn't take resistance into account while amperage is affected by voltage and resistance, so I wouldn't call it semantics.",
                          "score": 2,
                          "created_utc": 1739468808.0,
                          "replies": []
                        },
                        {
                          "id": "mcmupa1",
                          "author": "Jusanden",
                          "body": "Nope. Power dissipated by resistive components is determined by P=I^2 /R. \n\nVoltage is not a factor here. \n\nWhere voltage does come into play is determining I. 600W at 24V is a lot lower current than at 12V. Higher voltage is actually better* in this case. Doubling the voltage quarters the power dissipated on resistive components. \n\n*big asterisk\n\n-\tTo a degree\n-\tignoring voltage separation and arcing risks\n-\tignores leakage paths\n-\tignores difficulty of regulating at input to output voltage ratios. \n-\tand probably ignores half a dozen other things I can’t remember right now.",
                          "score": 2,
                          "created_utc": 1739486902.0,
                          "replies": [
                            {
                              "id": "mcpqg2c",
                              "author": "Spooplevel-Rattled",
                              "body": "I agree, there's really quite a well balanced list or pros vs cons of 12v vs 24 or 48v here.\n\n\"Safety\" rows have the issues at hand vs voltage danger for random humans mucking about with higher voltage items.",
                              "score": 1,
                              "created_utc": 1739532336.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mcmp0l9",
                  "author": "soulsoda",
                  "body": "That's not true, the pins simply have a lower safety factor but the cables can also still melt as well and it's already happened this generation.",
                  "score": 1,
                  "created_utc": 1739485191.0,
                  "replies": []
                },
                {
                  "id": "mckn5um",
                  "author": "Eokokok",
                  "body": "It is surprising how people claim 'it isn't clear', like messing up a wire is next to impossible. Garbage connector though, with added room for user error and 3rd party 'stylish accessories' spells trouble.",
                  "score": 0,
                  "created_utc": 1739464432.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mckdj2g",
          "author": "Gaeus_",
          "body": "The 70 has unironically become the sweet spot, not only in terms of fps-for-your-buck but also because it's the most powerful option that doesn't fucking melt.",
          "score": 24,
          "created_utc": 1739461676.0,
          "replies": [
            {
              "id": "mcltjaz",
              "author": "piratep2r",
              "body": "No pain, no gain, mr i'm-afraid-to-burn-my-house-down!\n\n(/s can you imagine fighting for the privilege to pay 2 to 3x what the card is worth for it to turn around and destroy your computer if not start a house fire?)",
              "score": 5,
              "created_utc": 1739476307.0,
              "replies": []
            },
            {
              "id": "mcods38",
              "author": "Onphone_irl",
              "body": "4070 as well? make me feel good with my purchase pls",
              "score": 1,
              "created_utc": 1739505797.0,
              "replies": [
                {
                  "id": "mcq7715",
                  "author": "skinlo",
                  "body": "4070 Super was the best card from the 4000 series, if you weren't a 1 percenter.",
                  "score": 2,
                  "created_utc": 1739539954.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcjzucr",
          "author": "acatterz",
          "body": "Don’t worry, the 5070 ti will be fine. They couldn’t fuck it up a third time… right?",
          "score": 23,
          "created_utc": 1739457477.0,
          "replies": [
            {
              "id": "mckzeno",
              "author": "Salty_Paroxysm",
              "body": "Sounds like a line from Airplane... there's no way the third one will blow up!\n\n\n\n\n\n\n*Cue distant explosion seen over the character's shoulder*",
              "score": 3,
              "created_utc": 1739467848.0,
              "replies": []
            },
            {
              "id": "mck02z0",
              "author": "Genocode",
              "body": "Not gonna buy a 5070 or 5070ti, the regular 5070 should've been what becomes the Ti to begin with and i have a 3070 right now, a 5070 wouldn't be big enough of a performance increase.",
              "score": 10,
              "created_utc": 1739457557.0,
              "replies": [
                {
                  "id": "mck7uo8",
                  "author": "glissandont",
                  "body": "I also have a 3070 and have been wondering if it's still a capable card. It can run older games at 4K60 no sweat but games circa 2022 I need to drop to 1440[ Medium to get solid 60. I honestly thought the 5070 might be a significant upgrade, I guess that's not the case?",
                  "score": 2,
                  "created_utc": 1739460004.0,
                  "replies": [
                    {
                      "id": "mck8bcs",
                      "author": "Genocode",
                      "body": "Maybe its big enough of a upgrade for you but not for me.",
                      "score": 1,
                      "created_utc": 1739460144.0,
                      "replies": [
                        {
                          "id": "mckc8is",
                          "author": "glissandont",
                          "body": "I mean if I don't need to upgrade I certainly would be happy saving the cash. If the 5070 really isn't big enough of a performance increase then I too don't see the point.",
                          "score": 1,
                          "created_utc": 1739461301.0,
                          "replies": [
                            {
                              "id": "mcliiij",
                              "author": "ScourJFul",
                              "body": "A 3070 is fine for modern gaming. Now, you are obviously running into modern games that are definitely pushing the 3070 to its limit, but if you can concede some of that stuff, it won't matter. If you really *needed* to upgrade, I wouldn't go the 5000 series due to their extremely high cost and extremely low availability. Especially considering how disappointing they are when they are basically only a 30% increase in power than their 4000s equivalents but at a ridiculous price point. \n\nThe best thing to do IMO is wait, or find a 4000 series card on sale or for cheap. Or alternatively, go to AMD which always will have better bang for you buck if you needed to upgrade from the 3000 series. For comparison, an NVIDIA card typically costs about $100 to even $300 more than an AMD card that performs similarly. Granted, if you care for the Ray Tracing, then NVIDIA is the better option. \n\nNVIDIA is rapidly becoming more of a \"luxury\" item due to their really fucked price to performance value on their cards. I will say for a 3070 upgrade, if you wanted to have more VRAM and better bang for your buck, look into AMD's 7800XT to 7900 XTX. Or the 9070XT which apparently will be priced \"aggressively\" which doesn't mean fuck all atm until we actually know the price and specs.\n\nBut most importantly, if you wanted to upgrade your 3070, you need to get something for cheap IMO. Paying full price or even higher than that for a card is not worth it cause your upgrade options aren't that much better to justify paying for it. You can likely find some deals right now on some 4000 cards (don't get a 4060) since people are selling their used cards for a 5000s card.",
                              "score": 3,
                              "created_utc": 1739473277.0,
                              "replies": [
                                {
                                  "id": "mclx8mm",
                                  "author": "glissandont",
                                  "body": "Thanks for your response! I've taken everything into consideration and will stick with my 3070 for the foreseeable future until I get a good deal on a 4000 series card. I don't mind having to play some current games at 1440p/Medium for a while if I can get solid 60fps gameplay.",
                                  "score": 2,
                                  "created_utc": 1739477333.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mckdmmm",
                  "author": "Zynbab",
                  "body": "Okay 👍",
                  "score": 0,
                  "created_utc": 1739461705.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mckds77",
              "author": "MrTubalcain",
              "body": "You know the saying…",
              "score": 1,
              "created_utc": 1739461750.0,
              "replies": []
            },
            {
              "id": "mck1gvu",
              "author": "noeagle77",
              "body": "4th* time \n\n4090s we’re catching flames before the 5090 was even born!",
              "score": 1,
              "created_utc": 1739458010.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mckpeei",
          "author": "fvck_u_spez",
          "body": "I have a 6800xt right now, but I am very interested in the 9070xt. I think I'll be making a trip to my local Microcenter in March, hoping that they have a good stock built up.",
          "score": 5,
          "created_utc": 1739465045.0,
          "replies": [
            {
              "id": "mckxniq",
              "author": "lack_of_reserves",
              "body": "Same. Fuck nvidia.",
              "score": 1,
              "created_utc": 1739467356.0,
              "replies": [
                {
                  "id": "mcl4tal",
                  "author": "fvck_u_spez",
                  "body": "For real. My 3070 was a garbage card in comparison to my 6800xt",
                  "score": -1,
                  "created_utc": 1739469367.0,
                  "replies": [
                    {
                      "id": "mcojdzw",
                      "author": "None",
                      "body": "🤓",
                      "score": 0,
                      "created_utc": 1739508094.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mck3vn8",
          "author": "Samwellikki",
          "body": "It’s just the FEs, right?",
          "score": 1,
          "created_utc": 1739458775.0,
          "replies": [
            {
              "id": "mck49t8",
              "author": "aposi",
              "body": "This isn't an FE.",
              "score": 9,
              "created_utc": 1739458900.0,
              "replies": [
                {
                  "id": "mck4irs",
                  "author": "Samwellikki",
                  "body": "Interesting\n\nI thought it was mainly FEs because of the stupid angled connector and people not being able to seat cables fully, or because of 3rd party cables on FE or otherwise",
                  "score": 1,
                  "created_utc": 1739458979.0,
                  "replies": [
                    {
                      "id": "mcka3j6",
                      "author": "Shitty_Human_Being",
                      "body": "It's more a case of balancing a lot of current (or the lack thereof) between several small wires.",
                      "score": 7,
                      "created_utc": 1739460676.0,
                      "replies": [
                        {
                          "id": "mckac0d",
                          "author": "Samwellikki",
                          "body": "Yeah, beginning to see that it’s more than just bad connections and more about random overload of 1-2 wires in the bundle",
                          "score": 2,
                          "created_utc": 1739460746.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mcm5mwk",
          "author": "matthkamis",
          "body": "Amd is great for cpus but don’t come close to nvidia for gpus",
          "score": 1,
          "created_utc": 1739479675.0,
          "replies": []
        },
        {
          "id": "mcjzeqy",
          "author": "Blindfire2",
          "body": "If they can fix fsr motion and frame gen from all the artifacting and ghosting, I'd take the risk on driver issues at this point. Having 5 to 12% better performance for 3x the cost just isn't worth it and if the design of the cable/cards are a fire hazard, fuck all this. \nI just can't STAND how ugly fsr (even 4 from digital foundry from what little I can see still had this issue, but they did make things like carpet SO MUCH BETTER that I'm on the edge to switching) is, it's too distracting for me to enjoy a game, and sadly newer games are being rushed and using ai to the point where optimization will be non existent (from my company at least).",
          "score": -14,
          "created_utc": 1739457333.0,
          "replies": [
            {
              "id": "mck39th",
              "author": "DeceptiveGold57",
              "body": "Good news! The “driver issues” you speak of haven’t been a thing for 5 years! That’s just lingering propaganda mindshare that topic is",
              "score": 12,
              "created_utc": 1739458586.0,
              "replies": [
                {
                  "id": "mcpn39p",
                  "author": "Eswcvlad",
                  "body": "Their Anti-Lag+ DLL injection embarrassment was just over a year ago. What are you talking about?",
                  "score": 1,
                  "created_utc": 1739530388.0,
                  "replies": []
                },
                {
                  "id": "mck4o1r",
                  "author": "Blindfire2",
                  "body": "Nah not for the cards my friends/family got from my recommendations. 2 amd cards got bricked from drivers and XFX even admitted it when we RMAd them. I get there's a lot of misinformation and any kind of problem people on the other side will jump on to make their side look better, but don't be the opposite of that where \"I haven't experienced it so it's just not true!\"\nBe fans of products, not fanboys of companies. I have no beef in this shit stew, it's no different than the annoying console wars, phone wars, apple vs windows, etc. They all have pros and cons to them.",
                  "score": -4,
                  "created_utc": 1739459024.0,
                  "replies": [
                    {
                      "id": "mck6355",
                      "author": "DeceptiveGold57",
                      "body": "While I’m sorry for your unfortunate experience, this is a prime example of the reverse of your comment. “I experience this issue! Therefore it must be true there are widespread issues!”\n\nStatistics and data don’t lie. And unfortunately your anecdotal evidence isn’t true evidence.",
                      "score": 5,
                      "created_utc": 1739459466.0,
                      "replies": [
                        {
                          "id": "mck8400",
                          "author": "Blindfire2",
                          "body": "Now I see your stand point, but let me raise you this...I didn't say \"I'll just deal with the driver issues\" or anything that gave off that I was saying \"its going to happen\"...I said \"I'll take the risk of it happening if they can fix...\" meaning I've seen it first hand, but I'll still risk it happening...you know like ALL THINGS they can have a moment where they just fuck up, a 1% risk is still a risk.\n\nNow put away your bias, I'm not attacking your ego or your choice of gpu, I really don't give a shit, I said what I said because I'm one foot into switching myself but am still not happy about the downsides of the other team's cards (which is a personal preference... I'm not happy about Nvidia's shit downsides either).",
                          "score": 0,
                          "created_utc": 1739460082.0,
                          "replies": [
                            {
                              "id": "mck8nn5",
                              "author": "DeceptiveGold57",
                              "body": "I wouldn’t say it’s bias when statistically speaking, AMD is actually having significantly fewer GPU and driver issues than Nvidia presently. On a very noticeable level. The CPU overhead is way way bigger on Nvidia currently as an example.",
                              "score": 2,
                              "created_utc": 1739460247.0,
                              "replies": [
                                {
                                  "id": "mckbtk3",
                                  "author": "Blindfire2",
                                  "body": "Yup definitely not a bias. Very not defensive",
                                  "score": -1,
                                  "created_utc": 1739461183.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mck4mgg",
                  "author": "tup1tsa_1337",
                  "body": "Yet dlss is basically unchallenged (especially with the transformer model being introduced)",
                  "score": -4,
                  "created_utc": 1739459010.0,
                  "replies": [
                    {
                      "id": "mck5t6w",
                      "author": "DeceptiveGold57",
                      "body": "Native rasterization or bust. I couldn’t care less about DLSS",
                      "score": 11,
                      "created_utc": 1739459382.0,
                      "replies": [
                        {
                          "id": "mck8t9e",
                          "author": "Serialtoon",
                          "body": "Big time agree. No good raster performance is just bad. If all the want to introduce is input lagged DLSS and frame gen then make the card single slot with those capabilities only and 40w usage. I hate modern gaming",
                          "score": 4,
                          "created_utc": 1739460293.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcklqec",
                      "author": "Fredasa",
                      "body": "Transformer has arguably worse artifacts than day-one, 2020-ass DLSS.  I literally could not stand it and went back to regular old DLSS.  They may sort things out eventually but it's not ready for primetime.",
                      "score": -1,
                      "created_utc": 1739464036.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mck7pg9",
      "author": "Ancient-Island-2495",
      "body": "I wanna build my first pc now that I can get all the top specs but man I’m afraid and shit like this scares me away",
      "score": 25,
      "created_utc": 1739459961.0,
      "replies": [
        {
          "id": "mclytyo",
          "author": "ensignlee",
          "body": "Get a 7900XTX if you still want a top of the line GPU, but don't want to worry about burning your house down.",
          "score": 8,
          "created_utc": 1739477774.0,
          "replies": []
        },
        {
          "id": "mckr2sf",
          "author": "Levester",
          "body": "I built a new PC for a 4090 less than a year ago, I use it for work related stuff & gaming. the fact that they're advertising 50 series around 4090 equivalence is so ridiculous to me. laughable nonsense imo.\n\nI could offer tips for parts but honestly the main thing you need to know is that no game actually requires a 4090 or anything close to it. \n\nFor purely gaming purposes, you don't need to even get close to the top of the line. You just need to spend 10-15 minutes playing with settings. It's the unfortunate truth about today's PC games.\n\nI can run games like Kingdom Come Deliverance 2 maxed out and get 170-180 fps at 1440p. beautiful game, lots of fun, highly recommend it. turning down just a couple settings shoots my fps up to a very very steady 240 which is my monitor limit and no matter how hard I look for it I honestly cannot spot the difference at all. Keep in mind that KCD2 is decently well optimized... but like 99% of games today, there're tiny graphical settings that will make near zero difference in fidelity and yet will cost you disproportionately in performance.",
          "score": 14,
          "created_utc": 1739465516.0,
          "replies": [
            {
              "id": "mclral0",
              "author": "r1kchartrand",
              "body": "Agreed I see posts of people raging about not being able to get a 5080 or 5090 for a mere upgrade from the previous gen. It's crazy to me. I'm still rocking my 3060ti and its perfectly fine for my needs.",
              "score": 3,
              "created_utc": 1739475698.0,
              "replies": []
            },
            {
              "id": "mclc7ml",
              "author": "Sw0rDz",
              "body": "Where does one even find a 4090 at a decent price?",
              "score": 2,
              "created_utc": 1739471484.0,
              "replies": [
                {
                  "id": "mcn05cs",
                  "author": "DRKZLNDR",
                  "body": "That's the neat part, you don't",
                  "score": 8,
                  "created_utc": 1739488603.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mcq0c4c",
              "author": "FriendshipGulag",
              "body": "Would you be able to list your specs?",
              "score": 1,
              "created_utc": 1739537181.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mcl8u1r",
      "author": "Buzzd-Lightyear",
      "body": ">Gamers Nexus’ Steve is on the case \n\nSomehow, it’s Linus’ fault.",
      "score": 45,
      "created_utc": 1739470517.0,
      "replies": [
        {
          "id": "mcmzz6c",
          "author": "beaurepair",
          "body": ">Hi I'm Steve from Gamers Nexus, and today we're talking about NVIDIA's latest cable melting woes and why Linus Sebastian didn't adequately inform the community",
          "score": 18,
          "created_utc": 1739488548.0,
          "replies": [
            {
              "id": "mcqzmth",
              "author": "2g4r_tofu",
              "body": "Thanks Steve",
              "score": 1,
              "created_utc": 1739549276.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mckv90o",
      "author": "koalaz218",
      "body": "Interesting both this and the 5090 melted cables have happened with ROG Loki PSU’s…",
      "score": 10,
      "created_utc": 1739466682.0,
      "replies": [
        {
          "id": "mcmkgpk",
          "author": "andynator1000",
          "body": "Made by Asus who also happens to produce the only 50 series with per pin resistors",
          "score": 1,
          "created_utc": 1739483856.0,
          "replies": []
        },
        {
          "id": "mcmic0r",
          "author": "haarschmuck",
          "body": "[Louis Rossman - Linus Always the victim, never to blame](https://www.youtube.com/watch?v=0Udn7WNOrvQ)",
          "score": -15,
          "created_utc": 1739483252.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mck2uzj",
      "author": "None",
      "body": "Man Im so glad Steve is on the case! /s\n\nWho the fuck wrote this article. Sounds like he's trying to gargle on Steve's nuts.",
      "score": 99,
      "created_utc": 1739458457.0,
      "replies": [
        {
          "id": "mclk5tc",
          "author": "kingrikk",
          "body": "I’m waiting for the “5080 power leads breaking due to Linus” video",
          "score": 57,
          "created_utc": 1739473736.0,
          "replies": [
            {
              "id": "mclsb85",
              "author": "Gregus1032",
              "body": "\"Linus was generally aware of this and he has yet to make a video about it. So I'm gonna make a video about him not making a video about it\"",
              "score": 46,
              "created_utc": 1739475975.0,
              "replies": [
                {
                  "id": "mcnuhmv",
                  "author": "DemIce",
                  "body": "\"But first, let me ignore the existing legal case and several others and launch my own, becoming an also-sues in a line of 'affiliate marketers' and 'influencers' more than a dozen long, rather than join as plaintiff in a first amended complaint.\"",
                  "score": 17,
                  "created_utc": 1739498785.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mclr6ua",
          "author": "Zuuple",
          "body": "I didn't know linus designed the connectors",
          "score": 30,
          "created_utc": 1739475669.0,
          "replies": [
            {
              "id": "mcmppav",
              "author": "ExoMonk",
              "body": "Given how much research and engineering goes into basic LTT merch, they'd probably do a better job on the connectors.",
              "score": 21,
              "created_utc": 1739485398.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcpwyya",
          "author": "VirginiaWillow",
          "body": "Nobody gargles nuts like LTT fans!",
          "score": 3,
          "created_utc": 1739535670.0,
          "replies": []
        },
        {
          "id": "mcq8jqx",
          "author": "DogmaticLaw",
          "body": "I can't wait for Steve's three hour long ramble fest of a video!",
          "score": 1,
          "created_utc": 1739540461.0,
          "replies": []
        },
        {
          "id": "mcmhgi5",
          "author": "JoostinOnline",
          "body": "It is technically relevant information, since GN bought the PSU and GPU to test.",
          "score": -2,
          "created_utc": 1739483003.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcmrupz",
      "author": "AzhdarianHomie",
      "body": "User error still the main copium?",
      "score": 7,
      "created_utc": 1739486037.0,
      "replies": [
        {
          "id": "mcmymq9",
          "author": "firedrakes",
          "body": "no.. only gn ref that ... no one else ever did",
          "score": 1,
          "created_utc": 1739488121.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcm5mts",
      "author": "Weareoutofmilkagain",
      "body": "Remove Steve from the case to improve airflow",
      "score": 18,
      "created_utc": 1739479674.0,
      "replies": [
        {
          "id": "mcwhaka",
          "author": "IObsessAlot",
          "body": "That got me. Thanks for a great chuckle to start the day!",
          "score": 1,
          "created_utc": 1739628310.0,
          "replies": []
        },
        {
          "id": "mcmyu5p",
          "author": "firedrakes",
          "body": "![gif](giphy|3oEjHAUOqG3lSS0f1C)",
          "score": 0,
          "created_utc": 1739488186.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mclmaib",
      "author": "MurderinAlgiers",
      "body": "Just buy AMD folks",
      "score": 4,
      "created_utc": 1739474324.0,
      "replies": []
    },
    {
      "id": "mclco65",
      "author": "BbyJ39",
      "body": "Ofc he is. Negative based drama content drives engagement and views which is always profitable for them.",
      "score": 9,
      "created_utc": 1739471618.0,
      "replies": []
    },
    {
      "id": "mcjxs89",
      "author": "None",
      "body": "I figured he’d be too busy obsessing over Linus Media Group",
      "score": 59,
      "created_utc": 1739456791.0,
      "replies": [
        {
          "id": "mckcvkj",
          "author": "thatrabbit",
          "body": "The internets fault for massaging Steve’s ego for years",
          "score": 39,
          "created_utc": 1739461485.0,
          "replies": [
            {
              "id": "mcoqo0s",
              "author": "FUTURE10S",
              "body": "We called him Tech Jesus because of the hair and because he had a good message, it's all on him for misunderstanding that we liked him, not that he can do no wrong.",
              "score": 0,
              "created_utc": 1739511401.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mckbis4",
          "author": "stellvia2016",
          "body": "And that's the rub with this whole stupid feud: Steve believes he's IT Jesus and Linus doesn't deserve his success and he's jealous of that.\n\nLinus is a flawed individual, but nobody is perfect. The important part is to try to do the right thing as much as possible, even if you do stumble from time to time. And Linus has admitted multiple times he realizes his personality flaws.\n\nI like content from both of them bc they have some overlap, but they're not aimed at the exact same audiences.",
          "score": 20,
          "created_utc": 1739461095.0,
          "replies": [
            {
              "id": "mckzx9f",
              "author": "Presently_Absent",
              "body": "What people don't seem to appreciate is that Linus has been 100% public since day one. He has nowhere to hide with anything he does. His track record is probably better than the majority of CEOs who all operate out of the public eye and have just as many (if not more) missteps and flaws.",
              "score": 20,
              "created_utc": 1739467997.0,
              "replies": [
                {
                  "id": "mcmidn1",
                  "author": "haarschmuck",
                  "body": "https://www.youtube.com/watch?v=0Udn7WNOrvQ",
                  "score": -9,
                  "created_utc": 1739483264.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mckcdg8",
              "author": "roiki11",
              "body": "Nothings better than internet epeen and bruised egos.",
              "score": 10,
              "created_utc": 1739461341.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mcka4au",
          "author": "snan101",
          "body": "he'll prolly find a way to blame Linus for this",
          "score": -2,
          "created_utc": 1739460682.0,
          "replies": [
            {
              "id": "mckqgbv",
              "author": "RainOfAshes",
              "body": "Oh no, poor Linus. Always so innocent. Nothing is ever his fault and there's always an excuse. :'( \n\nLinus really strikes me as the kind of guy who's all sunshine in front of the camera, but behind the scenes he constantly has his employees walking on their toes around him. I bet we'll hear more about that one day.",
              "score": -18,
              "created_utc": 1739465341.0,
              "replies": [
                {
                  "id": "mclhiaz",
                  "author": "snan101",
                  "body": "I see you're parroting the same old tired bullshit",
                  "score": 12,
                  "created_utc": 1739473000.0,
                  "replies": []
                },
                {
                  "id": "mcl6kjo",
                  "author": "No_1_OfConsequence",
                  "body": "You, you’re the problem.",
                  "score": 6,
                  "created_utc": 1739469865.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcotjkl",
      "author": "CucumberError",
      "body": "Thanks Steve!",
      "score": 5,
      "created_utc": 1739512815.0,
      "replies": []
    },
    {
      "id": "mcktjce",
      "author": "Living_Young1996",
      "body": "How much does yhe 5080 cost?",
      "score": 2,
      "created_utc": 1739466202.0,
      "replies": [
        {
          "id": "mcku5s3",
          "author": "AtTheGates",
          "body": "Lots of money.",
          "score": 3,
          "created_utc": 1739466377.0,
          "replies": [
            {
              "id": "mckunm3",
              "author": "Living_Young1996",
              "body": "I'm not a PC guy, so forgive my ignorance, but is the 5080 worth it, even if it wasn't catching on fire? How big of a difference is there between this and the last gen? \n\nI have a lot more questions because I'm truly interested, just not sure if this is the right forum",
              "score": 2,
              "created_utc": 1739466516.0,
              "replies": [
                {
                  "id": "mclxm54",
                  "author": "tartare4562",
                  "body": "10% uplift, give or take. Power consumption also went up by the same amount.",
                  "score": 3,
                  "created_utc": 1739477439.0,
                  "replies": []
                },
                {
                  "id": "mcl6dc1",
                  "author": "River41",
                  "body": "They're good cards don't listen to the drama queens on here. The 5080 runs cool and overclocks really well, it reaches stock 4090 performance. Depending where you are, it could be the best card you can get your hands on. The only notable thing to consider is the 16GB VRAM. People are upset because the relative leap to the last generation isn't as dramatic, but it's still a leap and I don't think we've seen the full potential of this generation yet.",
                  "score": 1,
                  "created_utc": 1739469808.0,
                  "replies": [
                    {
                      "id": "mcly1m8",
                      "author": "tartare4562",
                      "body": "> reports of 5080s melting their connector and being a fire hazard\n\n> \"It's all good guys. In fact, you should overclock them so they eat even more power!\"",
                      "score": 2,
                      "created_utc": 1739477557.0,
                      "replies": [
                        {
                          "id": "mcmzts3",
                          "author": "River41",
                          "body": "Seems to be isolated to them not being plugged in correctly or specific PSUs. Also the 5080 is at significantly lower risk than the 5090. I'm not worried about it. There should be a safety system in place to prevent it happening at all though.",
                          "score": 1,
                          "created_utc": 1739488500.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mckxb50",
                  "author": "AlannaAbhorsen",
                  "body": "I think Tom’s Hardware has done comparisons, but the 5080 isn’t performing as well as the 4080 Super for nearly double the cost.\n\nNvidia has been pricing their new cards for crypto mining not gaming for several years, and it’s generally considered wise to wait or go ‘last gen’ right now if you’re using them as intended.",
                  "score": 0,
                  "created_utc": 1739467260.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mcop9c7",
          "author": "pragmatick",
          "body": "I paid 1300€.",
          "score": 2,
          "created_utc": 1739510737.0,
          "replies": []
        },
        {
          "id": "mcllpmk",
          "author": "dupz88",
          "body": "Yes",
          "score": 1,
          "created_utc": 1739474164.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mclyhcc",
      "author": "paerius",
      "body": "I thought this has been reported for days/weeks now? I'm not buying this gen but these melting power connector posts  have been in my feed for a while now.",
      "score": 2,
      "created_utc": 1739477677.0,
      "replies": []
    },
    {
      "id": "mcnak8n",
      "author": "ratudio",
      "body": "So it basically poor design on the power delivery. They would just have two 8 pins. It is ugly but it won’t destroy gpu and psu",
      "score": 2,
      "created_utc": 1739492036.0,
      "replies": []
    },
    {
      "id": "mck777x",
      "author": "_ILP_",
      "body": "* laughs in 7900xtx *",
      "score": 7,
      "created_utc": 1739459806.0,
      "replies": []
    },
    {
      "id": "mck73iq",
      "author": "xnolmtsx",
      "body": "They don’t make anything like they used to.",
      "score": 3,
      "created_utc": 1739459775.0,
      "replies": [
        {
          "id": "mck7x0j",
          "author": "sarhoshamiral",
          "body": "They do. It is just older cards didn't require close to 600w power.",
          "score": -4,
          "created_utc": 1739460024.0,
          "replies": [
            {
              "id": "mck87g1",
              "author": "xnolmtsx",
              "body": "If they did they’d have tested and made sure cable pins aren’t melting. Seems like after the 40series had the issue they never upped their quality control",
              "score": 6,
              "created_utc": 1739460111.0,
              "replies": [
                {
                  "id": "mck90wg",
                  "author": "sarhoshamiral",
                  "body": "I am guessing they did. I am guessing they are also investigating these reports.\n\nYou can't really test for all the hardware, cable, PSU combinations out there especially for every card manufactured. Given that this is not happening widely (10 or so isn't wide), I would want to understand the root cause first.\n\nWe are all guessing here right now and so far one question I had multiple times remains unanswered. If I was using 2 x PCIe plugs which are rated for 300w each, shouldn't PSU have a circuit breaker or some limiter to ensure >300w doesn't flow on one such plug. If it does, then load balancing shldnt be an issue in that case. At worst the PSU would shutdown.",
                  "score": -3,
                  "created_utc": 1739460358.0,
                  "replies": [
                    {
                      "id": "mck9kqw",
                      "author": "xnolmtsx",
                      "body": "That’s also a fair point. Returning to my original statement and amending it, they don’t make anything like they should anymore haha. \n\nAlso people buying cheap aftermarket cables also will have more of an issue.",
                      "score": 4,
                      "created_utc": 1739460521.0,
                      "replies": []
                    },
                    {
                      "id": "mckcyab",
                      "author": "stellvia2016",
                      "body": "The problem is they keep trying to produce the least expensive connector that won't fail... and keep missing the mark.\n\nThey're putting 50-56A across 8 pins with no load balancing, which is 10% or less headroom, and just assuming it will spread out evenly. That's not nearly enough tolerance for something like this. The usual rule of thumb for critical things is at least 2-3x their rated load.\n\nThis is absolutely on Nvidia for cheaping out on cards they already charge an obscene amount of money for.",
                      "score": 3,
                      "created_utc": 1739461507.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mck5ep4",
      "author": "broman1228",
      "body": "Somehow the melted connections are going to be Linus’ fault",
      "score": 8,
      "created_utc": 1739459255.0,
      "replies": []
    },
    {
      "id": "mcjwuxl",
      "author": "Spideryote",
      "body": "Thanks Steve",
      "score": 9,
      "created_utc": 1739456482.0,
      "replies": []
    },
    {
      "id": "mcluwzj",
      "author": "rf97a",
      "body": "So now we get a new condescending video with poorly scripted “jokes” and jabs. Hurray",
      "score": 2,
      "created_utc": 1739476687.0,
      "replies": []
    },
    {
      "id": "mcpza87",
      "author": "SBR_AK_is_best_AK",
      "body": "Well if Steve is on it, at least we know it's all Linus's fault.",
      "score": 2,
      "created_utc": 1739536719.0,
      "replies": []
    },
    {
      "id": "mckd7hr",
      "author": "Gaeus_",
      "body": "Nvidia users up to generation 30\n\n\"Yeah the xw70 is the most affordable option to play everything in great condition\"\n\nNvidia users from generation 40 onward\n\n\"Yeah the xx70 is the most powerful variant on the market that doesn't have a probability to melt\"",
      "score": 1,
      "created_utc": 1739461582.0,
      "replies": [
        {
          "id": "mcldr25",
          "author": "Graekaris",
          "body": "I came here wondering if this would affect the 5070. Guess we have to wait and see.",
          "score": 1,
          "created_utc": 1739471932.0,
          "replies": [
            {
              "id": "mclinnm",
              "author": "Berkut22",
              "body": "It might.\n\nIt draws the same 250w as a 4080, and there were still some reports of the 4080 melting 12VHPWR connectors.",
              "score": 1,
              "created_utc": 1739473317.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mcky4s4",
      "author": "agentgerbil",
      "body": "I was gonna save for a 5070, but I think I'll get a 4070 super instead",
      "score": 1,
      "created_utc": 1739467490.0,
      "replies": []
    },
    {
      "id": "mckyh02",
      "author": "joaomisturini",
      "body": "For those who are interested, this video explains why the connectors are melting\n\nhttps://youtu.be/kb5YzMoVQyw",
      "score": 1,
      "created_utc": 1739467586.0,
      "replies": []
    },
    {
      "id": "mckzqrb",
      "author": "fkid123",
      "body": "Why would they fix it? Even if these cards could blow up your entire rig they would still be sold out and being scalped for 2-3x the price.\n\nThis issue might even be helping them sell more. \"oops, connector melted, let's order a new one asap\".",
      "score": 3,
      "created_utc": 1739467944.0,
      "replies": []
    },
    {
      "id": "mck2m3m",
      "author": "ashyjay",
      "body": "Ah crap, it's gonna end up being Linus's fault somehow.",
      "score": -7,
      "created_utc": 1739458378.0,
      "replies": []
    },
    {
      "id": "mcmf80r",
      "author": "4ha1",
      "body": "Nvidia GPUs are the new AAA games. Launching 40% ready for launch.",
      "score": 1,
      "created_utc": 1739482366.0,
      "replies": []
    },
    {
      "id": "mcmhhey",
      "author": "kadirkara07",
      "body": "So where’s NVidias response???",
      "score": 1,
      "created_utc": 1739483010.0,
      "replies": []
    },
    {
      "id": "mcmpjlj",
      "author": "4xel_dma",
      "body": "Owned.",
      "score": 1,
      "created_utc": 1739485349.0,
      "replies": []
    },
    {
      "id": "mcmpkvs",
      "author": "franker",
      "body": "So if I bought a computer with one of these things in them, and I have a 50-year-old house with the original electrical outlets meant to use landline phones and vinyl record players,  do I need to have an electrician check out my house or you can still plug in any modern thing like this beast?",
      "score": 1,
      "created_utc": 1739485360.0,
      "replies": [
        {
          "id": "mcwiift",
          "author": "IObsessAlot",
          "body": "Your fuse should blow well before your (house) wires are in any kind of danger. If your PC blows the fuse often, you could hire an electrician and look at upgrading- but more for practicality than safety.\n\n\nFor peace of mind you could also check that your current fuses were installed by a certified electrician. Sometimes amateurs \"upgrade them\" by installing larger fuses, removing point of fuses in the first place and creating a hazard.",
          "score": 2,
          "created_utc": 1739628762.0,
          "replies": []
        },
        {
          "id": "mcpkuo6",
          "author": "Tigerballs07",
          "body": "If it fails its not going to be because of your wiring. There's a power supply between the wall and that card.  It'll fail because of a cable or psu problem.",
          "score": 1,
          "created_utc": 1739529057.0,
          "replies": [
            {
              "id": "mcqf60j",
              "author": "franker",
              "body": "okay thanks, just wondering about that.",
              "score": 1,
              "created_utc": 1739542824.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mcn5lyr",
      "author": "hyteck9",
      "body": "Was this a 5080 FE??",
      "score": 1,
      "created_utc": 1739490395.0,
      "replies": []
    },
    {
      "id": "mco9ue7",
      "author": "markofthebeast143",
      "body": "Amd ain’t even jumped off the porch yet and we’re already crowning it king gpu for 2025.\n\nWild",
      "score": 1,
      "created_utc": 1739504301.0,
      "replies": []
    },
    {
      "id": "mcoh5ay",
      "author": "icy1007",
      "body": "Same PSU as first report. Is this cable a 3rd party cable or one that came with the PSU?",
      "score": 1,
      "created_utc": 1739507150.0,
      "replies": []
    },
    {
      "id": "mcpf6an",
      "author": "RandomFinnishPerson",
      "body": "![gif](giphy|vwI4mYEHP8k0w)\n\nOh shit fuckfuckfuck. Good thing is that I use the included adapter.",
      "score": 1,
      "created_utc": 1739525456.0,
      "replies": []
    },
    {
      "id": "mcl5qk5",
      "author": "No_1_OfConsequence",
      "body": "There’s drama? Ah yes, Steve our savior will be there.",
      "score": -2,
      "created_utc": 1739469628.0,
      "replies": []
    },
    {
      "id": "mclr1nh",
      "author": "TheRealChoob",
      "body": "Thanks steve",
      "score": 1,
      "created_utc": 1739475629.0,
      "replies": []
    },
    {
      "id": "mcly1vq",
      "author": "Pepparkakan",
      "body": "I’m so tired of this stupid ”new version pulls twice as much power for 20% improvement” brand of *innovation*. What happened to efficiency? What happened to tick-tock? Why is the new connector even 12V based when its fairly obvious that 24V would be more reasonable given the wattage (which again, stupid af)?\n\nIt’s all so dumb.",
      "score": 1,
      "created_utc": 1739477559.0,
      "replies": [
        {
          "id": "mcoso1o",
          "author": "rgrwilcocanuhearme",
          "body": "Isn't it closer to like a 5% improvement?",
          "score": 1,
          "created_utc": 1739512374.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mck9aw2",
      "author": "Lucade2210",
      "body": "Steve is a shit journalist who only wants drama and sensation.",
      "score": -8,
      "created_utc": 1739460440.0,
      "replies": []
    },
    {
      "id": "mck8ve6",
      "author": "BrokkelPiloot",
      "body": "In Tech Jesus we trust...",
      "score": -8,
      "created_utc": 1739460311.0,
      "replies": []
    },
    {
      "id": "mcm712k",
      "author": "klawUK",
      "body": "the cable is fine. its similar gauge to the PCI cable. It was fine on the 3090 where they had paired up cables so each pair had a separate load handling. If they’d done that on the 5090, you’d have 75w per cable, maximum 150w if one of the pair breaks. But they cheaped out or were obsessed with size so cut down to a single power management connection which means worst case the entire 600w could go down one cable. \n\nThe issue isn’t the cable\nthe issue isn’t the PSU\nthe issue is the GPU power management. Was fine with the 3090, they got worse with the 4090, and absolutely broke it with the 5090",
      "score": 1,
      "created_utc": 1739480062.0,
      "replies": [
        {
          "id": "mco2i0d",
          "author": "11BlahBlah11",
          "body": "But the connector part is poorly designed. The \"clip\" is mushy and doesn't always properly click when locking, and in a standard setup - horizontally mounted to the MB - over time due to the weight of the cable and small vibrations from fans, it eventually can start to become dislodged.\n\nIIRC, that was what was discussed in the communications between nvidia and pcisig.",
          "score": 3,
          "created_utc": 1739501654.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcvunne",
      "author": "Nightrunner2016",
      "body": "We seem to be in an age of unoptimized inefficiency. Processors are running hot, GPUs are running hot, and usually this is even on games or applications that do not require the power that needlessly generates heat. \n\nAs an example I was playing a game on a 7th Gen i5 and a GTX 1060. It run perfectly in near silence. Now, if I pay the same game on a 13th Gen i5 and RTX 3060 ti, I need a special cooling setup on my cpu and the GPU fans are busy, for ultimately the same performance in the game. It's like companies are chasing numbers and in so doing creating inefficiency.",
      "score": 1,
      "created_utc": 1739617211.0,
      "replies": []
    },
    {
      "id": "mck8jcc",
      "author": "hyperforms9988",
      "body": "Boy do I not regret it at all to sit here and wait for the Super edition of cards to come out... or if there weren't any of those, waiting maybe a year for this kind of thing to be sorted out in hardware revisions, drivers, etc.\n\nFor the power needs in general... I mean this is in theory only going to get worse as these things get more powerful, right?  Shouldn't this tell the industry that we're really in need of a real solution for this?  What they're doing now really can't continue on.  For me, it's already too late if problems like these are occurring, but I can't help but think about the next generation, or the one after that, still using these connections/connectors.  Does somebody have to have a full-on fire or an explosion first?",
      "score": 1,
      "created_utc": 1739460212.0,
      "replies": []
    },
    {
      "id": "mckl6z4",
      "author": "ovrlrd1377",
      "body": "*Insert inspector gadget theme*",
      "score": 1,
      "created_utc": 1739463882.0,
      "replies": []
    },
    {
      "id": "mckbhzs",
      "author": "Retro1989",
      "body": "Companies must shit themselves when Steve get's involved.",
      "score": -1,
      "created_utc": 1739461089.0,
      "replies": []
    },
    {
      "id": "mclsyho",
      "author": "Sethoria34",
      "body": "Thanks Steve",
      "score": 1,
      "created_utc": 1739476151.0,
      "replies": []
    },
    {
      "id": "mckjlp0",
      "author": "brokenbyanangel",
      "body": "Steve is such a tool.",
      "score": -5,
      "created_utc": 1739463428.0,
      "replies": []
    },
    {
      "id": "mckppju",
      "author": "a_rabid_buffalo",
      "body": "Fuck Gamers Nexus. Dude wants to think he’s above god when it comes to game journalism. Only problem is all he does is hit pieces. Once you get past the drama you start to realize his journalism is sub par, his ethics are shit, and he’s just doing it for views (something he claimed he isn’t doing) Their lucky LTT doesn’t want to sue.",
      "score": -12,
      "created_utc": 1739465132.0,
      "replies": [
        {
          "id": "mckshnl",
          "author": "kadinshino",
          "body": "I would love to watch how a international lawsuit would work vs some youtubers. that would be an amazing court case to watch",
          "score": -2,
          "created_utc": 1739465907.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mcnr9oz",
      "author": "throw123454321purple",
      "body": "If only they used strands of Steve’s omnipotent superconducting hair in the cables…alas.",
      "score": 0,
      "created_utc": 1739497672.0,
      "replies": []
    },
    {
      "id": "mckpa1k",
      "author": "firedrakes",
      "body": "Dude never took back the user error claim from last time.  When it was shown it was manf issue.",
      "score": -3,
      "created_utc": 1739465011.0,
      "replies": []
    },
    {
      "id": "mcmm9d0",
      "author": "Rrraou",
      "body": "Here we go again...\n\nYou'd think they would have figured it out after the first generation. I mean beyond shifting the blame onto user error. (Looking at Gamers nexus)",
      "score": -2,
      "created_utc": 1739484374.0,
      "replies": []
    },
    {
      "id": "mck6cx4",
      "author": "654456",
      "body": "Steve backing off his biased attacks now?",
      "score": -22,
      "created_utc": 1739459550.0,
      "replies": [
        {
          "id": "mck9vea",
          "author": "None",
          "body": "[deleted]",
          "score": -1,
          "created_utc": 1739460609.0,
          "replies": [
            {
              "id": "mco3ioy",
              "author": "11BlahBlah11",
              "body": "Derbauer - https://www.youtube.com/watch?v=Ndmoi1s0ZaY\n\nJay - https://youtu.be/6FJ_KSizDwM\n\nBitwit unfortunately lost his home in the recent Los Angeles fires.",
              "score": 2,
              "created_utc": 1739502017.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mckajlo",
      "author": "MSTK_Burns",
      "body": "At least half of these reports I have read the users have self admitted to mismatching power supply cables, which is a BIG no no. The other half I would assume are just not admitting to it.",
      "score": -10,
      "created_utc": 1739460808.0,
      "replies": [
        {
          "id": "mcl0v44",
          "author": "random_reddit_user31",
          "body": "People have done this for years with 8/6 pin PCI-E connectors and haven't melted their PC. Most people aren't aware that mixing cables is a risk and they shouldn't need an electrical degree on how to plug a GPU power connector in. While some of these cases are user error, the cable should be robust enough to factor in the user error like the prior connections did.\n\nAlso it's been looked at by electrical engineers and they are saying it's flawed. People need to stop blaming ourselves and blame the company that's charging high prices and who put more R&D in their coolers than the basics of \"safety first\".\n\nI'm checking my 4090 daily because I'm paranoid, even when using the PSUs 12VHPWR cable. We shouldn't be in this position at all, let alone when these GPUs cost over a grand. It's unacceptable.",
          "score": 4,
          "created_utc": 1739468265.0,
          "replies": [
            {
              "id": "mcl8mn0",
              "author": "MSTK_Burns",
              "body": "I don't think you understand what I'm saying. The EVGA power supply VGA cable has a different pin layout than a MSI one for example, and people are mixing the cables.\nSorry if I misunderstood what you were saying",
              "score": -1,
              "created_utc": 1739470457.0,
              "replies": [
                {
                  "id": "mclkrpk",
                  "author": "Berkut22",
                  "body": "12VHPWR cables all have the same pinout (finally).\n\nIt's not like the 8 pin PCIE cables where the pinouts vary from manufacturer to manufacturer.\n\nDerBauer's melted using the 12VHPWR cable/connector.",
                  "score": 5,
                  "created_utc": 1739473905.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mcleqwv",
      "author": "roshanpr",
      "body": "Soon we will need a 220v outlet",
      "score": 0,
      "created_utc": 1739472219.0,
      "replies": []
    },
    {
      "id": "mcm3bnr",
      "author": "Superseaslug",
      "body": "Just use an XT90 plug and a USBc for comms.",
      "score": 0,
      "created_utc": 1739479031.0,
      "replies": []
    },
    {
      "id": "mclp4rw",
      "author": "Aristotle_Wasp",
      "body": "The Steve hate and Linus blowing in the comment section are really funny.",
      "score": -8,
      "created_utc": 1739475103.0,
      "replies": []
    },
    {
      "id": "mck32gn",
      "author": "tylerlees777",
      "body": "This happened like a week ago",
      "score": -7,
      "created_utc": 1739458522.0,
      "replies": []
    },
    {
      "id": "mckiwq1",
      "author": "erichw23",
      "body": "Something about these videos are suss sometimes. Somehow he's the first person to make certain things happen. I feel a long YouTube video exposing gamer Nexus coming in the future.",
      "score": -17,
      "created_utc": 1739463229.0,
      "replies": []
    },
    {
      "id": "mcmbf6d",
      "author": "MiserableSkill4",
      "body": "I remember this with the 4080/90 and it always came out that they just didn't insert it right.",
      "score": -2,
      "created_utc": 1739481298.0,
      "replies": []
    },
    {
      "id": "mcozzgg",
      "author": "Fartville23",
      "body": "GN everywhere…as per usual.",
      "score": -3,
      "created_utc": 1739516229.0,
      "replies": []
    },
    {
      "id": "mcp0m4a",
      "author": "Knut79",
      "body": "Oh good the gamers tabloid investigations is on the case...",
      "score": -2,
      "created_utc": 1739516578.0,
      "replies": []
    },
    {
      "id": "mckip4q",
      "author": "None",
      "body": "[deleted]",
      "score": -6,
      "created_utc": 1739463169.0,
      "replies": [
        {
          "id": "mckqmzg",
          "author": "Raztax",
          "body": "Sure early adopters often run into issues that later users will not but a fucking fire hazard should not be one of them.",
          "score": 3,
          "created_utc": 1739465393.0,
          "replies": []
        },
        {
          "id": "mcklfnh",
          "author": "GarbageThrown",
          "body": "Blaming the victims. Classy.",
          "score": 3,
          "created_utc": 1739463950.0,
          "replies": []
        }
      ]
    }
  ]
}