{
  "post": {
    "title": "LG discontinues all UHD Blu-ray and Blu-ray players",
    "author": "diacewrb",
    "id": "1hchewf",
    "score": 1862,
    "created_utc": 1733995674.0,
    "selftext": "",
    "num_comments": 360,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hchewf/lg_discontinues_all_uhd_bluray_and_bluray_players/"
  },
  "comments": [
    {
      "id": "m1oinli",
      "author": "SpareFullback",
      "body": "Too bad. With the way streaming has been going the last few years I've started buying physical discs again.",
      "score": 974,
      "created_utc": 1734005349.0,
      "replies": [
        {
          "id": "m1ovi0q",
          "author": "ButtFullOfSemen",
          "body": "Their players were not well regarded. There have been plenty of signs that the 4k format may be the last physical film format, like Best Buy no longer carrying discs and Target massively downsizing, but LG has essentially been out of the player game for 5 years. If Panasonic or Sony stopped, that would be very troubling.",
          "score": 340,
          "created_utc": 1734011095.0,
          "replies": [
            {
              "id": "m1p6mdx",
              "author": "DreamHiker",
              "body": "I thought Sony only sells business to business now. I would be glad to be wrong though.",
              "score": 68,
              "created_utc": 1734015248.0,
              "replies": [
                {
                  "id": "m1paos5",
                  "author": "ButtFullOfSemen",
                  "body": "That news story was about Sony stopping sale of blank writeable Blu-Ray discs. They still sell players and their studio is still putting their movies on 4k and re-releasing restored old films in their collection.",
                  "score": 90,
                  "created_utc": 1734016652.0,
                  "replies": [
                    {
                      "id": "m1pi2hy",
                      "author": "drfsupercenter",
                      "body": "Yeah I was going to say, you can definitely still buy Sony Blu-ray players, even at Walmart they sell them.\n\nWhat baffles me, though is that Sony makes these DVD players with HDMI output/upscaling that are like $20 less than the same exact unit that can play Blu-rays.  Why? They own the patent so they're not paying royalties to themselves, and the laser can't be *that* expensive.  It's basically just making an inferior product for the sake of making it",
                      "score": 41,
                      "created_utc": 1734019059.0,
                      "replies": [
                        {
                          "id": "m1pvri3",
                          "author": "TURBOWANDS",
                          "body": "It has to do with how stupid the average consumer is. I need a DVD player to watch my dvds. Try explaining to grandma how a Blu-ray player can do both.",
                          "score": 44,
                          "created_utc": 1734023348.0,
                          "replies": [
                            {
                              "id": "m1py0cv",
                              "author": "drfsupercenter",
                              "body": "Yeah, this is one reason I wanted HD-DVD to win the format war, because the name is more logical and people know what it is lol\n\nJust yesterday I had a friend ask if Blu-ray was a type of DVD, and he was like \"well it's a digital video disc, right?\"",
                              "score": 29,
                              "created_utc": 1734024048.0,
                              "replies": [
                                {
                                  "id": "m1rro38",
                                  "author": "siobhanellis",
                                  "body": "Digital versatile disc",
                                  "score": 6,
                                  "created_utc": 1734044680.0,
                                  "replies": [
                                    {
                                      "id": "m1rte63",
                                      "author": "drfsupercenter",
                                      "body": "I've seen both used, not sure which one is the official acronym",
                                      "score": 1,
                                      "created_utc": 1734045298.0,
                                      "replies": [
                                        {
                                          "id": "m1rtkqh",
                                          "author": "siobhanellis",
                                          "body": "Versatile. It could do audio too.",
                                          "score": 4,
                                          "created_utc": 1734045365.0,
                                          "replies": [
                                            {
                                              "id": "m1s1fxw",
                                              "author": "drfsupercenter",
                                              "body": "They had such high hopes for the format, with photo discs and stuff supported too but none of them really took off besides the video format\n\nThere's a \"DVD Video\" logo, much like \"Compact Disc Digital Audio\" is different from CD-ROM, so I guess \"DVD Video\" is the video one I am thinking of\n\nRegardless, if you want to be pedantic, Blu-rays are a DVD, but they're also not.",
                                              "score": 2,
                                              "created_utc": 1734048209.0,
                                              "replies": [
                                                {
                                                  "id": "m1tmkao",
                                                  "author": "siobhanellis",
                                                  "body": "Sorry if I came across as pedantic. Wasn’t my intention. I used to think the V stood for Video until I learnt otherwise,\n. I meant to pass on my learning.",
                                                  "score": 2,
                                                  "created_utc": 1734071342.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "m1tgfyp",
                                          "author": "TDYDave2",
                                          "body": "Originally, it was video, but they later changed it to versatile when it started to be used for more than just videos.",
                                          "score": 1,
                                          "created_utc": 1734068040.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m1t6vpe",
                                  "author": "garry4321",
                                  "body": "You wanted a vastly inferior tech to win a tech battle because the name sounded closer to DVD? You’re exactly the kind of person who shouldn’t be involved in these decisions.",
                                  "score": -1,
                                  "created_utc": 1734063664.0,
                                  "replies": [
                                    {
                                      "id": "m1t7ys7",
                                      "author": "drfsupercenter",
                                      "body": "No, I said it's one reason.  The main reason is that I had a grudge against Sony after the rootkit scandal and HD-DVD was backed by more companies (Microsoft and Toshiba among others) rather than JUST Sony.\n\nI wouldn't call it \"vastly inferior\", it's the same exact tech with the blue laser, the only difference was capacity.  Blu-ray held more.  But who knows, maybe they would have made triple-layer HD-DVDs if that won.",
                                      "score": 6,
                                      "created_utc": 1734064113.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m1y61tg",
                                      "author": "teamswiftie",
                                      "body": "I mean VHS won due to porn. Betamax was far superior",
                                      "score": 2,
                                      "created_utc": 1734137666.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m1r6c4b",
                              "author": "No-Bother6856",
                              "body": "Add to that that plenty of folks don't understand that a better option even exists. \"Disc with movie on it\" is a DVD to them, they don't know what a bluray is so they buy the dvd player. Sony probably has higher margins on the dvd player so they are happy to sell you one.",
                              "score": 8,
                              "created_utc": 1734037734.0,
                              "replies": []
                            },
                            {
                              "id": "m1pz2s4",
                              "author": "warrensussex",
                              "body": "Iit does both like, the radio your car does am and fm",
                              "score": 4,
                              "created_utc": 1734024381.0,
                              "replies": [
                                {
                                  "id": "m1rhqxx",
                                  "author": "iaswob",
                                  "body": "\"How can I get movies through the radio?\"",
                                  "score": 3,
                                  "created_utc": 1734041321.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m1qbd2v",
                              "author": "billbixbyakahulk",
                              "body": "My dad is 83.\n\nYup.",
                              "score": 3,
                              "created_utc": 1734028153.0,
                              "replies": []
                            },
                            {
                              "id": "m1rd3q1",
                              "author": "the_simurgh",
                              "body": "I dont have to. Everyone i know trusts my word alone. Mostly because theve fucked yp so much and ive had to fix thier issues.",
                              "score": 1,
                              "created_utc": 1734039841.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1qk6le",
                      "author": "MachinaThatGoesBing",
                      "body": "And honestly, the writable Blu-ray situation isn't exactly a surprise. I own a ton of physical media , including a significant amount of obsolete media (Blu-rays in 2k and 4k, CDs, DVDs, vintage and new vinyl, even some tapes and a nice Panasonic tape deck from the 70s — not to mention quite a few CD-ROM games and altogether too many 5¼ and 3½ incy floppy disks and the equipment and software to read them over to modern systems), and even I don't own a Blu-ray burner. I don't think I've ever even seen a burned Blu-ray.\n\nAt this point, if most people want to transfer like 100GB of information in a compact package, they'll get a $20 microSD card. Even if you're just using it once, it's probably more economical (and greener, honestly) than buying the burner and a stack of discs.\n\nThe only way the Blu-ray writer makes sense is if you this a ***ton*** and don't want to ferry media back and forth or if you have a client who you need to transfer big data sets to who also demands deliveries on write-once, then read-only media. Though I can think of one pretty big customer who does demand the latter in specific situations.",
                      "score": 7,
                      "created_utc": 1734030863.0,
                      "replies": [
                        {
                          "id": "m1rlw1m",
                          "author": "moebiusdream",
                          "body": "I've got a Blu-ray burner from LG. :-) It supports M-Disc, so I bought it for offline back-ups.",
                          "score": 1,
                          "created_utc": 1734042705.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m1tju0n",
                      "author": "DreamHiker",
                      "body": "Oh that is great to hear! I must have misunderstood",
                      "score": 1,
                      "created_utc": 1734069813.0,
                      "replies": []
                    },
                    {
                      "id": "m6h3sla",
                      "author": "DarianYT",
                      "body": "They make the PS5 of course it's a player so we should see how the PS6 turns out. Japan still uses disc today so Sony and Panasonic definitely won't stop making players in that country.",
                      "score": 1,
                      "created_utc": 1736545588.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1p6vyw",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 9,
                  "created_utc": 1734015341.0,
                  "replies": [
                    {
                      "id": "m1p8stf",
                      "author": "makingmath",
                      "body": "I’m sure someone makes money off of designing a rich persons living room, maybe high end apartments or hotels that offer “quality” entertainment. Or a business could buy them to destroy them, imagine buying in bulk at a reduced price or only buying the outside of electronics, or buy their trash. Rage rooms.",
                      "score": 7,
                      "created_utc": 1734016009.0,
                      "replies": [
                        {
                          "id": "m1r8b7p",
                          "author": "nohpex",
                          "body": "Most people are fine with an AppleTV or Roku, but those that want high quality stuff get Kaleidescape.\n\nKaleidescape boxes & service are used to get access to the same files theaters use. As you can imagine, it's really expensive for us plebs.\n\nSource: Spent some time in that type of industry.",
                          "score": 4,
                          "created_utc": 1734038344.0,
                          "replies": [
                            {
                              "id": "m1tpuv1",
                              "author": "Kleanish",
                              "body": "Thanks. Something else I want I can’t afford",
                              "score": 1,
                              "created_utc": 1734073259.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1p8sv1",
                      "author": "nagi603",
                      "body": "Probably for in-store business displays, though memory card, hdd, cable or network playback is better.",
                      "score": 5,
                      "created_utc": 1734016009.0,
                      "replies": [
                        {
                          "id": "m1qvy1y",
                          "author": "Username928351",
                          "body": "I can't imagine that being a very lucrative market.",
                          "score": 1,
                          "created_utc": 1734034529.0,
                          "replies": [
                            {
                              "id": "m1r82fm",
                              "author": "nagi603",
                              "body": "Have you ever been to a shopping mall? A busy big city with dynamic advertising boards? Every display there.",
                              "score": 1,
                              "created_utc": 1734038268.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1snj9e",
                      "author": "Buttersaucewac",
                      "body": "The thing they only sell business to business now is blank Blu-Ray discs, not players. The blank discs never became widespread for everyday users the way CD-Rs and DVD-Rs did, but a decent number of businesses use them in large quantities for backups. So it’s not worth it for Sony to stock them in 1-50 packs in retail stores but it’s worth it to sell a 6000/year regular order to a business.",
                      "score": 2,
                      "created_utc": 1734056287.0,
                      "replies": []
                    },
                    {
                      "id": "m1qhxt0",
                      "author": "Plaid_Kaleidoscope",
                      "body": "The security shack in Casino Royale had a whole bank of Sony Blu-ray players/writers.\n\nI mean, I know it was a Sony film. But still. lol.",
                      "score": 3,
                      "created_utc": 1734030166.0,
                      "replies": [
                        {
                          "id": "m1r55jn",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 4,
                          "created_utc": 1734037369.0,
                          "replies": [
                            {
                              "id": "m1r5qcj",
                              "author": "Plaid_Kaleidoscope",
                              "body": "Right? And they WENT IN for those DVD players. That was like $100,000 in gear and cars alone. Who was buying all these hot DVD players? lol",
                              "score": 2,
                              "created_utc": 1734037550.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1plvbh",
                  "author": "fvck_u_spez",
                  "body": "Best Buy has 3 standard Sony Blu Ray players and 2 Sony 4k Blu Ray players for sale right now",
                  "score": 3,
                  "created_utc": 1734020267.0,
                  "replies": []
                },
                {
                  "id": "m1qluxh",
                  "author": "MachinaThatGoesBing",
                  "body": "Sony only stopped sale of *writable Blu-rays*. They still sell consumer Blu-ray players.\n\nhttps://electronics.sony.com/c/blu-ray",
                  "score": 1,
                  "created_utc": 1734031377.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1pn70o",
              "author": "theangryintern",
              "body": "Their computer drives are amongst the better ones, though.  Typically the most recommended one for ripping stuff for Plex servers is an LG one.",
              "score": 5,
              "created_utc": 1734020684.0,
              "replies": [
                {
                  "id": "m1pxhlz",
                  "author": "ButtFullOfSemen",
                  "body": "Ah, I didn't consider that. I have had my eye on one for a little while now to start ripping my collection.",
                  "score": 1,
                  "created_utc": 1734023886.0,
                  "replies": []
                },
                {
                  "id": "m1pyz9n",
                  "author": "BizzyM",
                  "body": "That's what I got.\n\nNow I need to get a better NAS that can do transcoding for Plex.   Or just reuse my really old Dell desktop.",
                  "score": 1,
                  "created_utc": 1734024351.0,
                  "replies": [
                    {
                      "id": "m1q0ukm",
                      "author": "theangryintern",
                      "body": "I have an Asustor NAS that probably should be OK at transcoding but I don't really have to do that much since 99% of my Plex viewing is Direct Play at home.  I typically don't watch anything outside my house.",
                      "score": 1,
                      "created_utc": 1734024933.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1qp29w",
                  "author": "MachinaThatGoesBing",
                  "body": "Any drive that functions and doesn't have a reputation for breaking down is going to be fine for that. I really cannot imagine that a drive from LG has any significant durability bonus over one from, say, Sony or another large name with a decent reputation.\n\nIt's not like a cassette deck or turntable where it's analog information and little details like wow and flutter and noise pickup matter.\n\nThis is all digital information, and any decently-made drive is going to work basically the same. The digital data is fixed; there is error correction built into the standard; and the \"quality\" of the reader isn't going to affect it.\n\nI have a now over a decade old Blu-ray drive from Asus that still works. It moved into an external 5¼\" USB3 drive bay and has since outlasted the computer I bought it for. Still rips disks to MKV for backup just fine.",
                  "score": 1,
                  "created_utc": 1734032366.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1sulsx",
              "author": "other_goblin",
              "body": "If the zombies come what am I supposed to throw then?",
              "score": 1,
              "created_utc": 1734058915.0,
              "replies": []
            },
            {
              "id": "m1pnxfu",
              "author": "HEX_BootyBootyBooty",
              "body": "Little nitpick, but BluRays are not a film format. They're discs. Plus, film has a scalable resolution greater than 4k.",
              "score": 2,
              "created_utc": 1734020915.0,
              "replies": [
                {
                  "id": "m1qm16c",
                  "author": "Patman128",
                  "body": "Nitpicking your nitpick: they're not a film (as in celluloid strip) format, but they are a film (as in motion picture) format, so they are still correct in the more obvious sense of \"film\".",
                  "score": 4,
                  "created_utc": 1734031430.0,
                  "replies": [
                    {
                      "id": "m1qnwip",
                      "author": "HEX_BootyBootyBooty",
                      "body": "Nah, it's a film on a BluRay, that doesn't make BluRay a \"film format\". [Film format is a technical term,](https://en.m.wikipedia.org/wiki/Film_format) and BluRay doesn't store a film in such a fashion (it stores formatted data).",
                      "score": -2,
                      "created_utc": 1734032010.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1pwb7x",
                  "author": "ButtFullOfSemen",
                  "body": "Nit-pick received! As far as UHD being the last physically released resolution, I was only speaking about there not being enough of a market to support 8k discs, not a lack of information in a 35mm frame of film. I hope there is a vinyl like resurgence but I think we are in for a drought of popular new movies released on disc and will only get boutique releases at some point in the near future. I hope I'm wrong.",
                  "score": 1,
                  "created_utc": 1734023519.0,
                  "replies": []
                },
                {
                  "id": "m1ppo73",
                  "author": "DryYogurt6878",
                  "body": "This guy films",
                  "score": -2,
                  "created_utc": 1734021459.0,
                  "replies": [
                    {
                      "id": "m1rcskp",
                      "author": "WhichExamination4623",
                      "body": "*discs",
                      "score": 1,
                      "created_utc": 1734039743.0,
                      "replies": [
                        {
                          "id": "m1tpe2r",
                          "author": "DryYogurt6878",
                          "body": "![gif](giphy|lEVZJzy4w15qE|downsized)",
                          "score": 1,
                          "created_utc": 1734072982.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1ouza6",
          "author": "TheyCallMeMrMaybe",
          "body": "Modern game consoles, thankfully, still support UHD Blu-Rays. (The Xbox One S & X, the Xbox Series X, and PS5 are all consoles that support UHD Blu-Ray video)",
          "score": 29,
          "created_utc": 1734010889.0,
          "replies": [
            {
              "id": "m1oz0h4",
              "author": "LurkerNoLonger_",
              "body": "None of the console players support Dolby Vision though, so they aren’t a true replacement for a competent player (although the work fine for most people).",
              "score": 40,
              "created_utc": 1734012455.0,
              "replies": [
                {
                  "id": "m1p1zpq",
                  "author": "liplander",
                  "body": "I’ve got Dolby vision logo that pops up on a bunch of my games. Will that not also work for the blu rays? Forgive me if this is common knowledge",
                  "score": 16,
                  "created_utc": 1734013576.0,
                  "replies": [
                    {
                      "id": "m1p5bvr",
                      "author": "mcortez16",
                      "body": "While Xbox Series X does support Dolby Vision for games it does not support Dolby Vision for UHD discs.  The Xbox will default to HDR10 for playback. It’s a hardware issue thing related to player-led vs tv-led Dolby Vision. It’s honestly quite baffling.",
                      "score": 30,
                      "created_utc": 1734014792.0,
                      "replies": [
                        {
                          "id": "m1pqset",
                          "author": "onestarv2",
                          "body": "Dolby Vision is also supported on streaming as well to make things even more confusing. There's the small part of me that wants to get a standalone player instead of using my series X, but I feel I also should get a proper OLED if I'm gonna do that... 🤔",
                          "score": 2,
                          "created_utc": 1734021803.0,
                          "replies": [
                            {
                              "id": "m1qckab",
                              "author": "mcortez16",
                              "body": "Right, which is the whole player-led vs tv-led Dolby Vison implementation. Just don’t get a Samsung OLED if you want DV because Samsung doesn’t support it. They support HDR10+ which is an open standard and comparable to DV, but not sure how similar it exactly is. I may finally buy a player as they might start to go away soon. LG just announced they’ve stopped manufacturing all UHD players.",
                              "score": 1,
                              "created_utc": 1734028520.0,
                              "replies": []
                            },
                            {
                              "id": "m1u10qc",
                              "author": "FartyPants69",
                              "body": "There are also non-OLED technologies that get pretty close and are way cheaper. I have a HiSense ULED that looks amazing and was only ~$350 for a 55\" about 2 years ago. Surely even cheaper now",
                              "score": 1,
                              "created_utc": 1734080534.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1p6fft",
                          "author": "liplander",
                          "body": "![gif](giphy|83QtfwKWdmSEo)",
                          "score": 1,
                          "created_utc": 1734015181.0,
                          "replies": []
                        },
                        {
                          "id": "m1p99rl",
                          "author": "nagi603",
                          "body": "With the problems on windows HDR playback / gaming, it's not that baffling to find their consoles too having a bad implementation.",
                          "score": 1,
                          "created_utc": 1734016171.0,
                          "replies": [
                            {
                              "id": "m1pdjn6",
                              "author": "I_Automate",
                              "body": "If no console supports it that also means Sony's playstation also does not support it....",
                              "score": 2,
                              "created_utc": 1734017596.0,
                              "replies": [
                                {
                                  "id": "m6h4d71",
                                  "author": "DarianYT",
                                  "body": "It does it just requires an update. I thought Xbox did but I guess not. I know Samsung won't they won't spend money to do it. ",
                                  "score": 1,
                                  "created_utc": 1736545760.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1pank0",
                      "author": "MasterInterface",
                      "body": "Dolby Vision for UHD requires a special chip along with additional license.",
                      "score": 6,
                      "created_utc": 1734016640.0,
                      "replies": [
                        {
                          "id": "m1pzy4f",
                          "author": "BizzyM",
                          "body": "Dolby: \"Why is no one supporting Dolby Vision??\"",
                          "score": 0,
                          "created_utc": 1734024650.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1qdjvt",
                  "author": "HGLatinBoy",
                  "body": "I don’t even know if they support the latest or any versions of HDR-10 and to add insult to injury they do support Dolby Vision via streaming and during gameplay. I would at least be given the option to pay for the Dolby vision license. I think we already have to pay for other things ",
                  "score": 1,
                  "created_utc": 1734028824.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1ovgsu",
              "author": "NotTooDistantFuture",
              "body": "Even that seems like it’s on its way out",
              "score": 12,
              "created_utc": 1734011082.0,
              "replies": [
                {
                  "id": "m1oyxbp",
                  "author": "TheyCallMeMrMaybe",
                  "body": "We're 4 years in to the console lifecycle so we probably have another 3 years tops before they go completely discless",
                  "score": 3,
                  "created_utc": 1734012422.0,
                  "replies": [
                    {
                      "id": "m1p23i3",
                      "author": "ob_knoxious",
                      "body": "The Xbox Series mid-cycle refresh was rumored to cut the optical disc, although some reports say that isn't coming as Xbox hardware sales have been... Lackluster. \n\nI don't think Sony will ever drop it, they might make it an optional attachment but the disc library of past PS games are too large to ignore and Sony is too closely ingrained with optical media.",
                      "score": 5,
                      "created_utc": 1734013614.0,
                      "replies": [
                        {
                          "id": "m1p6gne",
                          "author": "Dick_Lazer",
                          "body": "PS5 can’t play PS1-3 game discs though, only digital versions. There’s even a few PS4 games it won’t work with.",
                          "score": 6,
                          "created_utc": 1734015192.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1qd9h2",
                  "author": "billbixbyakahulk",
                  "body": "I'm really surprised consoles still have physical media. The last game I bought on media for PC was Mass Effect 2.",
                  "score": 0,
                  "created_utc": 1734028736.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1q07uf",
              "author": "AfraidOfAtttention",
              "body": "The PS5 does it with software emulation instead of having the actual hardware and the frame timing is so rough on panning shots",
              "score": 3,
              "created_utc": 1734024736.0,
              "replies": []
            },
            {
              "id": "m1p9jb2",
              "author": "AnOddSprout",
              "body": "Yeah, I don’t think next gen gonna be getting disc drives. This gen migtt get actually be the last",
              "score": 3,
              "created_utc": 1734016261.0,
              "replies": [
                {
                  "id": "m1pcosz",
                  "author": "Old-Rhubarb-97",
                  "body": "People have been saying that since the PS4 launch rumours.\n\nI think next gen is still too early, we will probably get an optional add on disc drive.",
                  "score": 3,
                  "created_utc": 1734017317.0,
                  "replies": [
                    {
                      "id": "m1peiw1",
                      "author": "AnOddSprout",
                      "body": "I mean look at the data. Majority of game sales are on digital. Xbox ain’t even a competition since they’re going focusing on games as a service. So Sony don’t have to worry about looking bad or losing customers to Xbox. They could essentially do what iPhone did with the headphones jack, remove it. And Sony could quite possibly get away with it coz who else are console players going to turn to? It always fella to early till the jump is made. I genuinely believe next could literally be it. And if video game companies also just stop with the physicals, what are the customers actually going to do? Not play them? That might work on some but on the big sellers, like final fantasy and Sony first person, it ain’t going to. Just my take anyway.",
                      "score": 2,
                      "created_utc": 1734017919.0,
                      "replies": [
                        {
                          "id": "m1piucb",
                          "author": "Old-Rhubarb-97",
                          "body": "There will be a breaking point for sure, where companies decide the lost sales from those who can't or won't go digital are not enough to justify a disc drive.\n\nI just think it's still too early with game sizes always increasing and many people still having slow internet. They could change pretty quickly though.\n\nThe pro has an add on disc drive, and companies love an add on. I think that's the move at least for next gen.",
                          "score": 1,
                          "created_utc": 1734019305.0,
                          "replies": []
                        },
                        {
                          "id": "m1r8ux5",
                          "author": "No-Bother6856",
                          "body": "Not that it necessarily means anything, but Sony is actually one of the only companies who still hasn't removed the headphone jack from their latest smartphones. Perhaps that may indicate a company that cares about not running off purists.",
                          "score": 1,
                          "created_utc": 1734038514.0,
                          "replies": [
                            {
                              "id": "m1rlg16",
                              "author": "AnOddSprout",
                              "body": "keeping the headphone jack is keeping a feature which other phones do not have. And for music enthusiasts its great too coz you can get a line connection. So from a business standpoint it makes sense. Sony offers customers something which other top brands do not. So let's also apply the business standpoint for the disc drive. Every game that is sold, sony gets a cut of it. If we have disc drive, they sell it to a customer once, and they get the profit of that one sale. But they can lose out on profit from game sales if people go second hand which is a key selling point of physical games. If i was sony, and game devs, i'd try and go fully digital as it means no second hand sales, so every person that plays it, would have to buy their own individual copy. They can also just pass it off as this is the way that technology is going and leave it at that. \n\nAnd at the end of the day, Sony is a business. They are not your friend. Everything which they do is for the sake of profit.",
                              "score": 1,
                              "created_utc": 1734042556.0,
                              "replies": [
                                {
                                  "id": "m1rnutm",
                                  "author": "No-Bother6856",
                                  "body": "I get that, but if either microsoft or sony pulls the disk drive first, the disc drive becomes that feature they have but the other one doesn't. It would absolutely benefit them to dump the disc drive, but neither side is likely to do so while they think it would lose them customers to the competition.",
                                  "score": 1,
                                  "created_utc": 1734043367.0,
                                  "replies": [
                                    {
                                      "id": "m1s0fhr",
                                      "author": "AnOddSprout",
                                      "body": "No. I mean you could argue that, but Xbox ain’t even  completion anymore. Its focus is games as a service. Heck their next Xbox might just be a streaming stick and a controller. And even if Xbox did push out an actual console. And “kept” the disc drive. Means nothing coz they literally have no games, that’s an actual Xbox exclusive. If Sony keeps pushing out their console sellers, it ain’t gonna mean much. Especially since the majority of video game sales are digital now and that’s just gonna increase. \n\nMy argument is that Xbox ain’t even worth looking at as completion anymore. Not only coz they ain’t focusing on the same thing, but also coz well, they just really ain’t. The only reason to pick up the series x is so I could play games from the 360/ps3 era on a modern console.",
                                      "score": 1,
                                      "created_utc": 1734047843.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1po5l5",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1734020985.0,
                      "replies": [
                        {
                          "id": "m1qoq2f",
                          "author": "Old-Rhubarb-97",
                          "body": "That was going on in the 7th generation as well, whether you realize it or not. \n\nPhysical discs will die when consumer demand drops below a certain threshold.",
                          "score": 0,
                          "created_utc": 1734032263.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1r8d4q",
                  "author": "No-Bother6856",
                  "body": "In a vacuum I would think this extremely likely, download only  has been proven viable and it lets the hardware become cheaper while cutting out the retailers for game distribution,  however, they aren't in a vacuum so what we have is a bit of a game of chicken. Whoever stops offering physical first risks losing customers to the other platform that still offers it. I suspect it will take more time for them to normalize digital purchases before they feel comfortable risking losing the folks who demand physical to their competitor. \n\nNot that it applies to a discussion about bluray, but for what its worth, nintendo has already confirmed backwards compatibility for switch games on their next console which means there will be a cartridge slot which probably means their next system will also distribute games that way.",
                  "score": 1,
                  "created_utc": 1734038360.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1oxkhl",
          "author": "mandrews03",
          "body": "This is Sony’s technology originally. As long as Sony is making them, we’ll all be alright. This article may as well be Mitsubishi getting out of making televisions.",
          "score": 11,
          "created_utc": 1734011899.0,
          "replies": [
            {
              "id": "m1x46yz",
              "author": "rip_heart",
              "body": "Well, turns out they did stop\n\n\nhttps://www.asahi.com/sp/ajw/articles/14473735#:~:text=It%20will%20stop%20selling%20its,rely%20on%20its%20brand%20products.",
              "score": 1,
              "created_utc": 1734124044.0,
              "replies": [
                {
                  "id": "m1ylsv0",
                  "author": "mandrews03",
                  "body": "[sony bluray player from Sony’s website](https://www.sony.ca/en/blu-ray-disc-dvd-players/gallery?cpint=blu-ray-disc-dvd-players_primary_tout-PrimaryTout-en_GB-responsivegrid_initial_primarytout_1) maybe it depends where you live? Can you imagine spending $300+ on a bluray player?",
                  "score": 1,
                  "created_utc": 1734144071.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1orik3",
          "author": "mimeycat",
          "body": "Same, I’ve built up a pretty decent library now, I mainly get DVDs from charity shops and boot fairs where they’re 5 for a £1 or something else crazy. Been quite fun picking up films and shows from childhood. Just a pain getting up to change the disc every 3 episodes!",
          "score": 27,
          "created_utc": 1734009480.0,
          "replies": [
            {
              "id": "m1owoy2",
              "author": "Aimhere2k",
              "body": "The local pawn shop used to have a pretty huge DVD/Blu-ray section.\n\nUsed to. Found out they no longer accept discs, so the selection is really dwindling and will probably disappear altogether soon.\n\nFortunately, there's a pre-owned store on the other side of town. The thrift stores probably have some too, though I haven't checked lately. Plus, there's always the public library.\n\nIt was kind of sad when Best Buy removed their disc section, I have to say. The only places left around here that still sell new discs are Walmart and Target, and Walmart doesn't maintain much of a selection of Blu-ray movies (if you miss out on new releases, they're gone after a month or two, never to return).",
              "score": 14,
              "created_utc": 1734011559.0,
              "replies": [
                {
                  "id": "m1p0kq9",
                  "author": "ScrewWinters",
                  "body": "Try Facebook Marketplace too.",
                  "score": 1,
                  "created_utc": 1734013050.0,
                  "replies": []
                },
                {
                  "id": "m1qs7ln",
                  "author": "GuerrillaRodeo",
                  "body": "Heh, same here. I suspect that our local op shop only still has its DVD/Blu-Ray section because of me and maybe a few other film nerds. Whenever I go there every few weeks there's DVDs that have been there for years (Who wouldn't want to buy Seasons 2, 4 and half of 7 of Californication?). Heaps of classic films and hidden gems for pennies, I hope that shop never goes away.",
                  "score": 1,
                  "created_utc": 1734033347.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1ovhre",
              "author": "Ltbest",
              "body": "Prime candidate to build themselves a Plex server.",
              "score": 9,
              "created_utc": 1734011092.0,
              "replies": []
            },
            {
              "id": "m1p9pil",
              "author": "d4nowar",
              "body": "Rip them thangs",
              "score": 1,
              "created_utc": 1734016320.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1pkws7",
          "author": "cat_prophecy",
          "body": "Not to mention that the quality of a UHD Blu-Ray is way better than anything I've seen on streaming. My biggest issue with the players is that they were so god damn expensive.",
          "score": 7,
          "created_utc": 1734019966.0,
          "replies": [
            {
              "id": "m1x4nlz",
              "author": "rip_heart",
              "body": "I have a Question:\n\n\n LOTR and other Blu-rays I play in my PS3 all look worst than streaming. is the reader on the PS3 just bad?",
              "score": 1,
              "created_utc": 1734124197.0,
              "replies": [
                {
                  "id": "m1xj5kq",
                  "author": "cat_prophecy",
                  "body": "PS3 is a regular Blu-Ray, and not a very high quality player. UHD Blu-Ray in addition to being 4K is usually played from a dedicated player. I bet if you played LOTR Blu-rays from a dedicated player, they would look a lot nicer.",
                  "score": 1,
                  "created_utc": 1734129069.0,
                  "replies": [
                    {
                      "id": "m1xnbzs",
                      "author": "rip_heart",
                      "body": "Didn't know that. Thanks!",
                      "score": 1,
                      "created_utc": 1734130553.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1q3bcf",
          "author": "stellvia2016",
          "body": "Not only the prices, but also the bitrate is nowhere near as high as 4K let alone UHD 4K. I believe AppleTV gets close to regular 4K bitrates last I heard (40mbps), but considering UHD can be upwards of 120-140mbps, that still isn't much.\n\nAnd you wonder why 8K TVs never caught on...",
          "score": 6,
          "created_utc": 1734025687.0,
          "replies": []
        },
        {
          "id": "m1pd69t",
          "author": "SirPancakesIII",
          "body": "Ya in the last year I have actively budgeted money to build up my 4k collection. With the way streaming is going I would like to own as much content as possible.",
          "score": 4,
          "created_utc": 1734017474.0,
          "replies": []
        },
        {
          "id": "m1q7t41",
          "author": "AnxietyAttack2013",
          "body": "Same here honestly. Places like Meijer by me doesn’t even carry physical media anymore. My wife and I have started going to antique malls and thrift shops looking for old DVDs and blu rays to keep things now while slowly phasing out streaming services that aren’t free or relatively inexpensive (like curiosity which is like $20 a year more or less).",
          "score": 2,
          "created_utc": 1734027067.0,
          "replies": []
        },
        {
          "id": "m1ortgr",
          "author": "corecenite",
          "body": "why not try sail the high seas?",
          "score": 3,
          "created_utc": 1734009607.0,
          "replies": [
            {
              "id": "m1osxdh",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1734010064.0,
              "replies": [
                {
                  "id": "m1ot8gn",
                  "author": "corecenite",
                  "body": "I can side you on the legal stance but not on morality. I just forgot that I'm in a different sub honestly. I thought most Reddit subs are basically ok with sailing since \"we\" hate the corporations.",
                  "score": 7,
                  "created_utc": 1734010189.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1phcj0",
              "author": "hipnotyq",
              "body": "YAAAR!!!\n\nA HARD DRIVE IS ALL YEEE NEED!!!",
              "score": 1,
              "created_utc": 1734018831.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1q4khw",
          "author": "Liarize",
          "body": "Meanwhile I’m starting to go all digital. I don’t simply want to carry physicals anymore.",
          "score": 2,
          "created_utc": 1734026072.0,
          "replies": []
        },
        {
          "id": "m1ovxcb",
          "author": "e136",
          "body": "Why? Cost?",
          "score": 1,
          "created_utc": 1734011260.0,
          "replies": []
        },
        {
          "id": "m1pe8tg",
          "author": "Newtons2ndLaw",
          "body": "It's been the biggest weird circle in my life with media. In the early aughts I embraced digital music, converted my several hundred CDs and only purchased digital.\n\n\nSeeing the writing on the wall by the end of that decade, instead of trying to upgrade my massive DVD collection to BR, I thought everything will just be on demand in the future. So I sold off my really great film collection for an average of 1$ per disk (those criterion special editions really hurt).\n\n\nAnd now I can't even find something as mundane as Perfect Stangers to watch online without paying absurd fees/prices.\n\n\nIn a world where corporations don't want you to own anything, I feel I no longer belong. 100 years from now they won't believe that people used to own copies of things like movies or albums.",
          "score": 1,
          "created_utc": 1734017827.0,
          "replies": [
            {
              "id": "m1puy1b",
              "author": "RDOCallToArms",
              "body": "There’s a few shows I like to re-watch once a year or specific movies I want to watch for the holidays (etc)\n\nPhysical media is so much easier and cheaper than having to find whatever streaming service has what I want to watch, subscribing, canceling and repeating the process next year\n\nYou can get an entire box set of a long running TV show for under $50. That’s like a couple months of Netflix\n\nLike if I want to watch ER or some long running show with 200+ episodes, it’s cheaper to buy the discs than pay for many months of streaming service \n\nPlus streamers are constantly dumping stuff out of their library. There will come a day sometime soon when shows like the original Quantum Leap, Macgvyer or niche shows like Tales from the Crypt, Black Mirror or Orhpan Black will basically be impossible to find streaming (maybe not those shows specifically but those types of shows)",
              "score": 3,
              "created_utc": 1734023091.0,
              "replies": [
                {
                  "id": "m1q18vg",
                  "author": "Newtons2ndLaw",
                  "body": "I wish I would have had the foresight to see that 14 years ago.",
                  "score": 1,
                  "created_utc": 1734025055.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1pg1rv",
              "author": "P00slinger",
              "body": "And vinyl outsold cd in 2023",
              "score": 1,
              "created_utc": 1734018417.0,
              "replies": []
            },
            {
              "id": "m1qhnwm",
              "author": "billbixbyakahulk",
              "body": "Dohn bay radikyouluss.",
              "score": 1,
              "created_utc": 1734030080.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1qqu6v",
          "author": "GuerrillaRodeo",
          "body": "I started to thrift discs for 0.50-2 € or so about a decade ago, I've got a sizable collection that fills about one and a half shelves now. Also got an LG Blu-Ray player for 10 € from the same shop.\n\nI don't care whether Netflix ditches Breaking Bad or anything else. Plus with thrifting you always find awesome stuff you wouldn't even have looked for otherwise. Can only recommend, I wouldn't even have heard of Still Game until I got the entire DVD box set for a fiver.",
          "score": 1,
          "created_utc": 1734032918.0,
          "replies": []
        },
        {
          "id": "m1qu496",
          "author": "SavannahInChicago",
          "body": "Me too.",
          "score": 1,
          "created_utc": 1734033950.0,
          "replies": []
        },
        {
          "id": "m1qvp33",
          "author": "challenja",
          "body": "Buy them for better sound and no black crushing from streaming. There is a huge difference in sound quality and volume",
          "score": 1,
          "created_utc": 1734034451.0,
          "replies": []
        },
        {
          "id": "m1r4t1o",
          "author": "UrToesRDelicious",
          "body": "Same, except they're more like platters than disks.\n\n🏴‍☠️",
          "score": 1,
          "created_utc": 1734037263.0,
          "replies": []
        },
        {
          "id": "m1tavys",
          "author": "nanapancakethusiast",
          "body": "This is exactly why they’re discontinuing physical media and ways to play it, btw. To keep you trapped.",
          "score": 1,
          "created_utc": 1734065397.0,
          "replies": []
        },
        {
          "id": "m1q7aq4",
          "author": "Vazhox",
          "body": "PlayStations",
          "score": 0,
          "created_utc": 1734026909.0,
          "replies": []
        },
        {
          "id": "m1p15n7",
          "author": "MxM111",
          "body": "What negative has happened with streaming in last few years? Why would you prefer physical media to virtual?",
          "score": -6,
          "created_utc": 1734013265.0,
          "replies": [
            {
              "id": "m1p29l4",
              "author": "liplander",
              "body": "Removal of content, not having access during an outage, wanting to have a thing to hold/collect, or maybe some others. Those were the reasons for me",
              "score": 10,
              "created_utc": 1734013677.0,
              "replies": [
                {
                  "id": "m1pa5vt",
                  "author": "MxM111",
                  "body": "Was purchased content removed from your virtual library? Did outrages increased in last few years?",
                  "score": 1,
                  "created_utc": 1734016474.0,
                  "replies": [
                    {
                      "id": "m1pcofc",
                      "author": "randomentity1",
                      "body": "Removal of content that they didn't purchase yet, so that they can't purchase or pay to watch it anymore.",
                      "score": 5,
                      "created_utc": 1734017314.0,
                      "replies": []
                    },
                    {
                      "id": "m1pbk3d",
                      "author": "emgem714",
                      "body": "Dude, relax lol. Some people like what they like",
                      "score": 0,
                      "created_utc": 1734016943.0,
                      "replies": [
                        {
                          "id": "m1pk89w",
                          "author": "MxM111",
                          "body": "I just want to understand what changed in last few years. I am totally OK with people preferences. I do not like changes in streaming services either, but before getting to physical media I would still compare it with virtual libraries. Did they become worse in last few years?",
                          "score": 2,
                          "created_utc": 1734019749.0,
                          "replies": [
                            {
                              "id": "m1polfn",
                              "author": "emgem714",
                              "body": "Okay, valid. I get you and actually, I can personally speak on this. I still continuously buy mostly used movies and I store them on a 12tb NAS running Plex. \n\nEverything gets ripped and then I share that with my friends. \n\nThe physical media, I either give to friends/family that want it or re-donate it for someone else to use. \n\nFor those that retain the physical media, there's a collection element to it. If you're on the younger side, us older folks used to be proud of our CD/DVD/VHS collections. That was the original \"I worked my ass off for this\" metric.",
                              "score": 1,
                              "created_utc": 1734021123.0,
                              "replies": [
                                {
                                  "id": "m1pqqga",
                                  "author": "MxM111",
                                  "body": "So, are you saying that in last few years it is cheaper or easier to store all your movies on NAS?",
                                  "score": 1,
                                  "created_utc": 1734021786.0,
                                  "replies": [
                                    {
                                      "id": "m1pw23f",
                                      "author": "emgem714",
                                      "body": "Easily. Including the cost of the media since usually the folks just give me the stacks they're getting rid of. Or a dollar bin at a thrift store. Double feature DVDs at Walmart etc. \n\nI can either pay $100/month for all of the streaming services...or I can spend $20 here and there and only store the movies/shows I'm interested in. \n\nThe cost of the NAS + drives aren't cheap (my setup was about $600 all in) but I'll be set for a long while and I can always expand as needed. \n\n+ Bonus points for no one in my household needing to pay for cloud storage, or waste precious PC hard drive space.",
                                      "score": 1,
                                      "created_utc": 1734023439.0,
                                      "replies": [
                                        {
                                          "id": "m1q2fzq",
                                          "author": "MxM111",
                                          "body": "The right comparison would be to purchasing digital movies to your online library.",
                                          "score": 1,
                                          "created_utc": 1734025425.0,
                                          "replies": [
                                            {
                                              "id": "m1q34bp",
                                              "author": "emgem714",
                                              "body": "Yes, that's my personal situation. But I also completely understand why people hang on to physical copies... Which is what you were asking about originally.\n\nThe collection + ownership factor",
                                              "score": 1,
                                              "created_utc": 1734025630.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m1r5ejg",
                                      "author": "UrToesRDelicious",
                                      "body": "You can get a 12tb HDD for like $100.",
                                      "score": 1,
                                      "created_utc": 1734037447.0,
                                      "replies": [
                                        {
                                          "id": "m1rfg0t",
                                          "author": "MxM111",
                                          "body": "And NAS itself? And redundancy?",
                                          "score": 1,
                                          "created_utc": 1734040576.0,
                                          "replies": [
                                            {
                                              "id": "m1rj2qv",
                                              "author": "UrToesRDelicious",
                                              "body": "A NAS is just a computer, you don't need any special hardware. Most people interested in a NAS have existing hardware they could use, and if not, you can get a raspberry pi for under $50.\n\nRedundancy is up to you. More redundancy means more drives which means more cost. But you can set up zfs or snapraid to allow for as many disk failures as you want.",
                                              "score": 2,
                                              "created_utc": 1734041761.0,
                                              "replies": [
                                                {
                                                  "id": "m1rry39",
                                                  "author": "MxM111",
                                                  "body": "You understand that for most people rasberry pi is not a solution (either no time, or will or technical capability). The top seller on Amazon is $399 for two drives (can't see point of NAS without redundancy), add $100 per drive, and we are talking about $600. Nah, I better buy movies and stream them from apple.",
                                                  "score": 1,
                                                  "created_utc": 1734044779.0,
                                                  "replies": [
                                                    {
                                                      "id": "m1rzquj",
                                                      "author": "UrToesRDelicious",
                                                      "body": "If you are someone who could use a NAS (meaning you are tech literate), and you can't be bothered to *save hundreds of dollars* by spending an hour of your time following a guide on setting up a raspberry pi NAS, then yeah get fucked I guess. Just don't act like getting fucked is your only option.\n\nThe average person doesn't need a NAS, and for that person I would recommend streaming 10/10 times. But for someone who needs to store lots of data, and apparently doesn't have a lot of money to spend, then there does exist an alternative. If you'd rather pay subscription fees to Apple every month rather than a one time cost and setup of a NAS then go right ahead.",
                                                      "score": 2,
                                                      "created_utc": 1734047596.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1p46b0",
              "author": "handsoffmydata",
              "body": "To add on to the other comment introducing ad tiers, playing trailers for other content at the beginning, content title cards replacing credit rolls, intrusive UI that lingers too long when you start a video or want to pause to see something but the UI obscures the original content.",
              "score": 5,
              "created_utc": 1734014376.0,
              "replies": [
                {
                  "id": "m1paj2u",
                  "author": "MxM111",
                  "body": "You are talking about streaming services, not virtual library which is direct competitor to physical library. Or at least I did not noticed anything about it.",
                  "score": -1,
                  "created_utc": 1734016598.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1paumh",
              "author": "None",
              "body": "The aggravation of: \n\nhaving content removed or migrated elsewhere\n\nHaving to pay extra for no commercials on platforms that previously didn’t have commercials \n\nThe annoying pop-ups while watching a steaming show\n\nHaving to outright pay to buy or rent a 30+ year old piece of media on a platform that originally had a huge library of things to watch for free if you paid for their “prime” service \n\nNot too mention how bored you would get if the internet goes out for any length of time (we got Covid at the same time that copper thieves took out the internet for a full week locally - watched every blu-ray we owned that week) \n\nEtc etc",
              "score": 4,
              "created_utc": 1734016706.0,
              "replies": []
            },
            {
              "id": "m1p63go",
              "author": "mcortez16",
              "body": "For one, with physical media you actually own it. Any digital media you “own” is really just a license to stream it on whichever platform you use. Second, the audio quality on disc is superior to that of streaming especially with Dolby Atmos. Granted that only becomes obvious when you have a home theater setup.",
              "score": 2,
              "created_utc": 1734015065.0,
              "replies": [
                {
                  "id": "m1pb1ke",
                  "author": "None",
                  "body": "Video quality is better on disc, too",
                  "score": 2,
                  "created_utc": 1734016771.0,
                  "replies": []
                },
                {
                  "id": "m1pamn7",
                  "author": "MxM111",
                  "body": "That did not change in last few years.",
                  "score": -1,
                  "created_utc": 1734016631.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1p6e6f",
              "author": "bschmidt25",
              "body": "You’re paying for something you won’t ever own on your own terms, subject to change at any time for any reason, and paying about the same price as physical media to do so in most cases.",
              "score": 2,
              "created_utc": 1734015169.0,
              "replies": [
                {
                  "id": "m1par0y",
                  "author": "MxM111",
                  "body": "This has not changed in last few years.",
                  "score": 0,
                  "created_utc": 1734016673.0,
                  "replies": [
                    {
                      "id": "m1pihau",
                      "author": "bschmidt25",
                      "body": "I was answering your second question",
                      "score": 1,
                      "created_utc": 1734019190.0,
                      "replies": [
                        {
                          "id": "m1pkmu6",
                          "author": "MxM111",
                          "body": "I see. I was not clear there. The question I was asking is why would you prefer physical media to virtual even more now than it was few years ago. I though it was obvious due to context, but may be not.",
                          "score": 1,
                          "created_utc": 1734019877.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1pfjgs",
              "author": "high_everyone",
              "body": "The difference in visual fidelity is vastly superior with physical media.\n\nIntrusive advertising has been one of the major things that i dislike.  \"pause ads\", skip gates (wait for one-two ads to play before skipping), ads with uneven volume levels, repetitive ads, etc...",
              "score": 2,
              "created_utc": 1734018251.0,
              "replies": []
            },
            {
              "id": "m1p8oqi",
              "author": "livewia",
              "body": "Bitrate",
              "score": 1,
              "created_utc": 1734015969.0,
              "replies": [
                {
                  "id": "m1paux8",
                  "author": "MxM111",
                  "body": "But rate did not decrease in last few years.",
                  "score": 0,
                  "created_utc": 1734016709.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1p9x8t",
              "author": "Fit-Ad8597",
              "body": "Though streaming may technically be 4K resolution, it is approx. 10mbps of highly compressed data, as opposed to a disc which may be over 100mbps. The difference between the two experiences is stark, especially when it comes to sound quality. If you haven’t made a direct comparison, I’d recommend you pick your favorite film and give it a try.",
              "score": 1,
              "created_utc": 1734016392.0,
              "replies": [
                {
                  "id": "m1pjuvs",
                  "author": "MxM111",
                  "body": "My question was only aimed on \"what changed in last few years\". Surely the internet speed did not go down...",
                  "score": 1,
                  "created_utc": 1734019631.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1pfxjy",
              "author": "MasterInterface",
              "body": "Even \"buying\" digital doesn't protect you from the platform taking away features from your library.\n\nAmazon now requires users to pay for DV, Dolby Atmos for movies that people bought.",
              "score": 1,
              "created_utc": 1734018379.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1ppgh2",
          "author": "DryYogurt6878",
          "body": "![gif](giphy|Ld77zD3fF3Run8olIt)",
          "score": -1,
          "created_utc": 1734021391.0,
          "replies": []
        },
        {
          "id": "m1psbhp",
          "author": "Necessary_Ad2005",
          "body": "Buy it now ... I bought a vcr player not too l9mg aho. Also just purchased 2 single barrel shot guns before we aren't allowed anymore to the poor or middle class. I put nothing past these idiots",
          "score": -1,
          "created_utc": 1734022278.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1o4wco",
      "author": "reallywhoelse",
      "body": "Blu-ray lost. HDDVD won!",
      "score": 354,
      "created_utc": 1733996812.0,
      "replies": [
        {
          "id": "m1oa9gp",
          "author": "ThePreciseClimber",
          "body": "Vengeance is Mine, and recompense;  \nTheir foot shall slip in *due* time;  \nFor the day of their calamity *is* at hand,  \nAnd the things to come hasten upon them",
          "score": 34,
          "created_utc": 1734000422.0,
          "replies": [
            {
              "id": "m23wd8a",
              "author": "djsizematters",
              "body": "Surprise Deuteronomy!",
              "score": 1,
              "created_utc": 1734228451.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1oaim1",
          "author": "rawrasaurgr",
          "body": "Blu-ray lost, .mkv won!",
          "score": 88,
          "created_utc": 1734000587.0,
          "replies": []
        },
        {
          "id": "m1q830r",
          "author": "MagicGiblet",
          "body": "… need to dust off my HDDVD drive add-on for my XB360 and find my 300 movie.",
          "score": 8,
          "created_utc": 1734027152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1o5dfi",
      "author": "wicktus",
      "body": "I mean, in addition to physical sales dropping, there are 62+m ps5 sold and millions of series X with disk reader ",
      "score": 167,
      "created_utc": 1733997139.0,
      "replies": [
        {
          "id": "m1oadzy",
          "author": "ThePreciseClimber",
          "body": "Wish PS5 had Dolby Vision, though. \n\nI'm even willing to pay an extra, one-time fee to unlock it.",
          "score": 77,
          "created_utc": 1734000505.0,
          "replies": [
            {
              "id": "m1ocp6t",
              "author": "CynetCrawler",
              "body": "Xbox Dolby Vision support is limited to games and streaming, though.",
              "score": 20,
              "created_utc": 1734001978.0,
              "replies": [
                {
                  "id": "m1od99u",
                  "author": "ThePreciseClimber",
                  "body": "Sure but I'm just saying there's nothing stopping the PS5 from being able to support Dolby Vision outside of Sony not wanting to pay the fees.",
                  "score": 29,
                  "created_utc": 1734002316.0,
                  "replies": [
                    {
                      "id": "m1pe1u6",
                      "author": "MasterInterface",
                      "body": "DV requires a special chip. So it's hardware and fees.\n\nThe DV for streaming is just a fee, and isn't anywhere near the quality of UHD.",
                      "score": 8,
                      "created_utc": 1734017762.0,
                      "replies": []
                    },
                    {
                      "id": "m1p9mwi",
                      "author": "pak9rabid",
                      "body": "DolbyVision requires special hardware to decode properly, which the PS5 lacks.",
                      "score": 5,
                      "created_utc": 1734016295.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1oidl2",
              "author": "fotomoose",
              "body": "Wish PS5 could play music CDs.",
              "score": 23,
              "created_utc": 1734005205.0,
              "replies": [
                {
                  "id": "m1oo8lk",
                  "author": "SOSpammy",
                  "body": "I wish it could play PS1-3 discs.",
                  "score": 44,
                  "created_utc": 1734008049.0,
                  "replies": [
                    {
                      "id": "m1oybqb",
                      "author": "FUTURE10S",
                      "body": "It really should be able to do PS1 and PS2 games at least. PS3 is fucky but equivalent PC hardware can emulate it now, shame Sony doesn't really care about their legacy other than \"mmm, money\"",
                      "score": 26,
                      "created_utc": 1734012190.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1ovll0",
                  "author": "andorraliechtenstein",
                  "body": "> Wish PS5 could play music CDs\n\nSome  of the PS1 were surprisingly good CD players !",
                  "score": 8,
                  "created_utc": 1734011133.0,
                  "replies": [
                    {
                      "id": "m1pg89g",
                      "author": "P00slinger",
                      "body": "The ps3 sure was",
                      "score": 4,
                      "created_utc": 1734018476.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1ptfga",
                  "author": "MrMcGibblets86",
                  "body": "Wait. What? I assumed my PS5 would play regular CDs. Now I need to test it.",
                  "score": 5,
                  "created_utc": 1734022621.0,
                  "replies": [
                    {
                      "id": "m1tnvx5",
                      "author": "fotomoose",
                      "body": "Prepare to be sad. My friend told me this and I was like U WOT MATE and ran all the way home and was devastated that I couldn't play CDs on the PS5. I have a rather nice sound system hooked up to PS5, so now need some separate CD player with what to play my CD collection on.",
                      "score": 2,
                      "created_utc": 1734072106.0,
                      "replies": [
                        {
                          "id": "m2dbyrs",
                          "author": "Beznia",
                          "body": "Man there was nothing quite like popping in Massacre by 50 Cent into your Xbox 360 in 2005 and [watching this for an hour.](https://www.youtube.com/watch?v=tjI4dYWsFbM)",
                          "score": 2,
                          "created_utc": 1734375138.0,
                          "replies": [
                            {
                              "id": "m2dfgyl",
                              "author": "fotomoose",
                              "body": "haha exactly",
                              "score": 1,
                              "created_utc": 1734376216.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1oh6i5",
              "author": "MSTK_Burns",
              "body": "Sony wasn't and that's the problem :) it's all licensing fees",
              "score": 2,
              "created_utc": 1734004574.0,
              "replies": []
            },
            {
              "id": "m1ok4tb",
              "author": "ab_90",
              "body": "1-time fee? Try monthly subscription.",
              "score": 1,
              "created_utc": 1734006096.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1pa8fy",
          "author": "ChafterMies",
          "body": "I’m using an Xbox One S as a 4k Blu-Ray player. At the time I bought it, it was the same price as a dedicated 4K Blu-Ray player. In today’s world, I wouldn’t recommend a $500 console over a much cheaper dedicated player.",
          "score": 7,
          "created_utc": 1734016499.0,
          "replies": [
            {
              "id": "m1polv5",
              "author": "wicktus",
              "body": "Xbox series S has no blu-ray player\n\nAre speaking maybe of the xbox one S or X ?\n\nIt’s more about people purchasing the console for gaming with the nice added bonus of having a blu-ray player rather than people purchasing one for blu-ray medias\n\nFor a primary use-case of reading 4k blu-ray you are right 500-550 is too high",
              "score": 1,
              "created_utc": 1734021127.0,
              "replies": [
                {
                  "id": "m1ppq9b",
                  "author": "ChafterMies",
                  "body": "Meant One S. Hate Microsoft’s confusing naming. Will edit.",
                  "score": 6,
                  "created_utc": 1734021477.0,
                  "replies": [
                    {
                      "id": "m1q307t",
                      "author": "wicktus",
                      "body": "Yes can’t be worse than wiiU but I agree, xbox as a whole is a little confusing: gamepass tiers, xcloud, console exclusivity but not really, xbox series X digital etc",
                      "score": 1,
                      "created_utc": 1734025595.0,
                      "replies": [
                        {
                          "id": "m1q586m",
                          "author": "ChafterMies",
                          "body": "I would have gone with Wiii.",
                          "score": 1,
                          "created_utc": 1734026272.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1okh3e",
          "author": "rawrasaurgr",
          "body": "270 million PS3,PS4,PS5 & 86million xbox one and series x",
          "score": 3,
          "created_utc": 1734006267.0,
          "replies": []
        },
        {
          "id": "m1o6uk3",
          "author": "firedrakes",
          "body": "kicker with ps5  is combine all 8 of top ever sold ps5 games does not even get to half the total ps5 sold console....  only 1 game did double digit in ps5 games sell and that was spider man 2 game... rest single digit  sub 5 million. then half of those only got a million sale mark when the version of game drop onto pc!\n\nI get ps5 fans hate how low  the sales are for the top most sold games for ps5... salty bunch they are.",
          "score": -30,
          "created_utc": 1733998152.0,
          "replies": [
            {
              "id": "m1om13q",
              "author": "am4os",
              "body": "Fuck that gotta do with anything we’re talking about",
              "score": 13,
              "created_utc": 1734007027.0,
              "replies": []
            },
            {
              "id": "m1p2qv4",
              "author": "Ekublai",
              "body": "NO ONE CARES",
              "score": 2,
              "created_utc": 1734013852.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1oyn1l",
      "author": "None",
      "body": "I bought the Panasonic UB420, ironically from Best Buy who doesn't sell Blu-Rays. If you want a guarantee you can watch your content, get your physical media now. It's in all of the media corp's interest to have you buying and resubscribing repeatedly and hold your favorite movies over your heads as time limited specials. Literally going back to pre-DVR cable TV.\n\nLG is the worst quality Blu-Ray manufacturer, and the OG Pioneer is still holding tight making quality UHD full height internal drives, but 2 years ago they changed the firmware so you can't rip a movie, only data. Their days are numbered. I'm guessing Panasonic is the last supplier left for the consoles.",
      "score": 52,
      "created_utc": 1734012312.0,
      "replies": [
        {
          "id": "m1p9dh1",
          "author": "modern_drift",
          "body": "Have lg drive, there are work arounds to getting them to work, again.  Just gotta take the firmware back to an earlier version.\n\nCurrently using it and makemkv to rip all of my 4Ks.",
          "score": 11,
          "created_utc": 1734016206.0,
          "replies": [
            {
              "id": "m1pab6m",
              "author": "None",
              "body": "I've heard stories of the rips being corrupted, is that overblown? I've heard \"Pioneer or bust\" but  enthusiasts tend to be purists.",
              "score": 6,
              "created_utc": 1734016525.0,
              "replies": [
                {
                  "id": "m1psbwo",
                  "author": "modern_drift",
                  "body": "I haven't had any issues with my files.",
                  "score": 5,
                  "created_utc": 1734022282.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1pmqim",
              "author": "fvck_u_spez",
              "body": "Out of curiosity, are you saying that you are somehow able to dump it using an LG player, or you have an LG UHD sata drive? I have a few UHD movies I would like to dump, convert, and host on Jellyfin since I no longer have a PS5",
              "score": 3,
              "created_utc": 1734020541.0,
              "replies": [
                {
                  "id": "m1pso9j",
                  "author": "modern_drift",
                  "body": "Sata drive.  \n\nI use Plex but don't really steam 4K files",
                  "score": 1,
                  "created_utc": 1734022389.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1py9k6",
              "author": "Gunfreak2217",
              "body": "How much space is a 2hour movie for instance? I have a lot of 4k Blu-ray’s but I only have a single full space 2tb drive.\n\nI mean I doubt I can’t even out my full GOT collection on it",
              "score": 2,
              "created_utc": 1734024129.0,
              "replies": [
                {
                  "id": "m1qkkwg",
                  "author": "modern_drift",
                  "body": "Think around fifty gigs.  Had a 2tb filled with 25 movies or so.",
                  "score": 1,
                  "created_utc": 1734030985.0,
                  "replies": [
                    {
                      "id": "m1qxtlv",
                      "author": "Gunfreak2217",
                      "body": "Have you ever tried handbrake encoding them? I’ve seen instruction videos on it but idk if like Nvenc would ruin the audio or video quality",
                      "score": 1,
                      "created_utc": 1734035121.0,
                      "replies": [
                        {
                          "id": "m1rxex4",
                          "author": "modern_drift",
                          "body": "No, have never done that",
                          "score": 1,
                          "created_utc": 1734046751.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1pgdco",
          "author": "P00slinger",
          "body": "Hipsters will bring it back like vinyl",
          "score": 2,
          "created_utc": 1734018521.0,
          "replies": [
            {
              "id": "m1ph9ua",
              "author": "None",
              "body": "I can only hope.",
              "score": 2,
              "created_utc": 1734018807.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1q1h5z",
          "author": "BizzyM",
          "body": ">  bought the Panasonic UB420\n\nI'm debating between this and the 820 for twice the price.   Talk me out of it.",
          "score": 1,
          "created_utc": 1734025126.0,
          "replies": [
            {
              "id": "m1qd7hj",
              "author": "Roseking",
              "body": "The main difference is the 820 has Dolby Vision. \n\nDoes your TV have Dolby Vision, and do you care enough about it? If yes, get the 820. Samsung TVs are notable for not having Dolby Vision. \n\nIt also has 7.1 RCA connections, but that likely isn't going to be a factor. Most people would likely have an AVR for a speaker setup. \n\nThe processing is the same, however. So if you don't have Dolby Vision and don't plan on getting it during the period you have the player, the picture will be the same.",
              "score": 3,
              "created_utc": 1734028719.0,
              "replies": [
                {
                  "id": "m1qibsy",
                  "author": "BizzyM",
                  "body": "Awesome.  Thanks.",
                  "score": 1,
                  "created_utc": 1734030286.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1scg1c",
          "author": "HFY_HFY_HFY",
          "body": "Literally just unboxed the same player ten minutes ago. Pooping now then watching mad Max.",
          "score": 1,
          "created_utc": 1734052218.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1ou7ga",
      "author": "Qwerty886",
      "body": "Pretty sad to think we’ll only get streaming quality movies from now on. BluRay was awesome but was always too expensive for my family to adopt. We didn’t have a game console that could run them either, nor a high enough quality TV to really notice even if we did. Now I buy up as many BluRay discs of classic movies as I can when I find them. Sure I like building my own media server, but having physical copies is pretty convenient too",
      "score": 13,
      "created_utc": 1734010582.0,
      "replies": [
        {
          "id": "m1qu94q",
          "author": "Shawnj2",
          "body": "We might get blu ray quality digital downloads through Eg iTunes, it seems like the real issue is that streaming is more convenient and convenience is king for most people",
          "score": 1,
          "created_utc": 1734033994.0,
          "replies": [
            {
              "id": "m1rshvf",
              "author": "bluesmudge",
              "body": "I don't think we are going to see 4k UHD quality downloads any time soon. A single 4k UHD movie often needs a BD100 disc (100GB of space). With the move away from HDD to flash memory, most regular people computer's/tablets/phones don't have much storage space and could only hold a handful of movies that big.",
              "score": 1,
              "created_utc": 1734044977.0,
              "replies": []
            },
            {
              "id": "m1sq9sv",
              "author": "the_nin_collector",
              "body": "VERY doubtful. \nMost blu ray movies with surround sound mix are around 60gb if not larger. \n\nGo to any pirate site and look up a remux rip of a blu ray. Its an uncompressed rip. \n\nthere is zero way any service is going to offer 50-100gb downloaded of movies unless for an affordable price.",
              "score": 1,
              "created_utc": 1734057298.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1s2q6h",
      "author": "None",
      "body": "[deleted]",
      "score": 10,
      "created_utc": 1734048672.0,
      "replies": [
        {
          "id": "m1u2ip3",
          "author": "masuski1969",
          "body": "Stock up!",
          "score": 2,
          "created_utc": 1734081585.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1o7ypj",
      "author": "I_R0M_I",
      "body": "For fidelity, UHD still wins.\n\nBut I think in general, most people are happy streaming now, rather than buying discs. Even if streaming quality isn't as good, the convenience if it is great.\nAnd for the price of 1 UHD, you can get 1/2 streaming services for a month.",
      "score": 77,
      "created_utc": 1733998907.0,
      "replies": [
        {
          "id": "m1ohq2r",
          "author": "wild_plums",
          "body": "Noooo dude. The sound tho. The sound is terribly compressed. You have to compare, it’s enraging how much detail and presence they cheat you out of worn the sound on streaming. And frankly, I can tell the quality difference too and it’s not the resolution, it’s the compression. Totally fucks with the TVs ability to render detail at any resolution.",
          "score": 65,
          "created_utc": 1734004862.0,
          "replies": [
            {
              "id": "m1olm3k",
              "author": "Deadly_Fire_Trap",
              "body": "Unfortunately most people don't have speakers or home theater rigs so it all sounds the same through their paper thin TV speakers.",
              "score": 50,
              "created_utc": 1734006822.0,
              "replies": []
            },
            {
              "id": "m1p4zes",
              "author": "Youthsonic",
              "body": "It's funny to hear people complain about quiet dialogue and too loud action when at least half the problem is the crappy audio quality from the major streamers. The other half is not investing in their sound setup when even a crappy soundbar will do a lot.",
              "score": 18,
              "created_utc": 1734014668.0,
              "replies": [
                {
                  "id": "m1p9ml2",
                  "author": "HellP1g",
                  "body": "Watched a  movie on 4k with someone the other night and they said “I just realized I watched a movie without subtitles for the first time in years” because Netflix sounds awful streaming on her TV",
                  "score": 13,
                  "created_utc": 1734016292.0,
                  "replies": []
                },
                {
                  "id": "m1r3mv1",
                  "author": "wild_plums",
                  "body": "Yeah I remember for a while I was assuming I had a wrong setting on my surround system, perhaps I needed a center channel speaker, so I added that. Maybe it helped? But then finally spoke with a relative who owns a studio and is very sensitive to sound quality and he explained how it’s the audio compression actually.",
                  "score": 2,
                  "created_utc": 1734036910.0,
                  "replies": []
                },
                {
                  "id": "m1rrx1u",
                  "author": "bluesmudge",
                  "body": "\"The dialogue in TV shows and movies is so hard to hear now\" - Person listening through the sound coming out the back of a 1/2\" thick screen and mentally comparing it to the sound they remember from the CRT TV that had massive front firing speakers and lots of depth to work with but who thinks the problem is the content, not their speakers.",
                  "score": 3,
                  "created_utc": 1734044768.0,
                  "replies": []
                },
                {
                  "id": "m1rbjzp",
                  "author": "No-Bother6856",
                  "body": "Thats part of it, but also it sounds like what you are describing is the audio being mixed for higher hynamic range than folks are used to. For the loud parts of the movie to be actually loud, they have to be substantially louder than the dialog which means anyone adjusting the volume for the loud parts to be comfortable will think the quiet parts are too quiet. The intent is generally to set the volume so the dialog sounds natural and the loud parts blow you away but the loud parts being that loud is uncomfortable for a lot of folks. \n\nIts sort of like how a lot of classical music requires really turning up the volume because most of the recording will be too quiet otherwise and the high volume is reserved for a few notable highs while most modern popular music is basically loud the whole time.",
                  "score": 1,
                  "created_utc": 1734039354.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1p9ycw",
              "author": "pak9rabid",
              "body": "Yep, Dolby Digital Plus (lossy) is no replacement for Dolby TrueHD (lossless).",
              "score": 3,
              "created_utc": 1734016402.0,
              "replies": []
            },
            {
              "id": "m1q1kyc",
              "author": "AfraidOfAtttention",
              "body": "Streamings been around long enough that you can identify which platform a clip is from just by the compression",
              "score": 2,
              "created_utc": 1734025159.0,
              "replies": [
                {
                  "id": "m1r46rv",
                  "author": "wild_plums",
                  "body": "Holy shit you’re like one of those geologists who’s able to understand where a sample of sand is from based off its grain pattern. Very interesting concept. And a related one (that I love) is how a meme can get so old and handed down so many times that it gets more and more compressed each time, like the digital version of receiving grandma’s 50 year old recipe card.",
                  "score": 1,
                  "created_utc": 1734037076.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1ob8pw",
          "author": "taez555",
          "body": "I buy physical movies that either aren’t streaming or are inconsistently streaming.   I have almost every streaming service and often find even when they are streaming, they’re pay to rent.  (I’m looking at you Amazon.)",
          "score": 19,
          "created_utc": 1734001052.0,
          "replies": [
            {
              "id": "m1oih4n",
              "author": "fotomoose",
              "body": "Be me. Get Apple TV. Discover all the films I want to watch cost extra. Be mad.",
              "score": 8,
              "created_utc": 1734005256.0,
              "replies": [
                {
                  "id": "m1omoqi",
                  "author": "taez555",
                  "body": "Ha!  I have Apple TV.   I think the only thing I've ever watched is Ted Lasso.",
                  "score": 4,
                  "created_utc": 1734007341.0,
                  "replies": [
                    {
                      "id": "m1opjo4",
                      "author": "Supposably",
                      "body": "For All Mankind and Severance are great. Haven't gotten around to Foundation yet, but that looks awesome as well.",
                      "score": 5,
                      "created_utc": 1734008631.0,
                      "replies": []
                    },
                    {
                      "id": "m1p7mtn",
                      "author": "rogue_giant",
                      "body": "Greyhound is pretty decent.",
                      "score": 1,
                      "created_utc": 1734015601.0,
                      "replies": []
                    },
                    {
                      "id": "m1tnm3m",
                      "author": "fotomoose",
                      "body": "For All Mankind was really good. And still is.",
                      "score": 1,
                      "created_utc": 1734071948.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1p71x4",
                  "author": "Dick_Lazer",
                  "body": "I’ve been building up my library on Apple and they have great deals though. I don’t pay more than $5 for a movie, and a lot have been less (some bundle deals where movies end up like $1 each). The quality is also noticeably better than something like Netflix, and a lot of the movies have the BluRay features like commentaries, etc.",
                  "score": 5,
                  "created_utc": 1734015399.0,
                  "replies": [
                    {
                      "id": "m1pa2wt",
                      "author": "HellP1g",
                      "body": "Apple TV is amazing. I picked up the 4k directors cut version of Midsommar for $5. It’s selling on 4k disc at Walmart for $50",
                      "score": 5,
                      "created_utc": 1734016446.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1ocgqb",
          "author": "flac_rules",
          "body": "Yeah, this is a bit sad news to be honest, sure streaming is convenient, but for the best quality UHD is still great to have.",
          "score": 17,
          "created_utc": 1734001833.0,
          "replies": []
        },
        {
          "id": "m1p1qt5",
          "author": "Aimhere2k",
          "body": "Streaming is so horribly over-compressed. What's the point of having an UHD TV (or even a FHD 1080 one) if the shows and movies you watch lose *so much detail* that they don't even meet broadcast 720p standards? \n\nI've seen streaming content purporting to be UHD or FHD, and compared to even broadcast TV, it looks like I'm viewing it through a layer of fogged glass. The contrast with Blu-ray is even greater.",
          "score": 9,
          "created_utc": 1734013486.0,
          "replies": []
        },
        {
          "id": "m1o90ud",
          "author": "STDsInAJuiceBoX",
          "body": "I know there are people that like to own physical copies of movies. But personally I just can’t justify purchasing a movie or tv show that I will probably only watch once then sit on a shelf collecting dust for eternity.",
          "score": 19,
          "created_utc": 1733999616.0,
          "replies": [
            {
              "id": "m1oajqk",
              "author": "I_R0M_I",
              "body": "I will buy a few that I loved, and know I'll rewatch at some point.\n\nBut gone are the days of a dvd collection 😂",
              "score": 15,
              "created_utc": 1734000608.0,
              "replies": []
            },
            {
              "id": "m1ohxzf",
              "author": "wild_plums",
              "body": "I just want a Red Box type service again. One with TV shows too. I used to easily walk over to my 7-11 and get discs and the quality was awesome and didn’t have to worry about my shitty connection doing all sorts of weird stuff when I just needed to pause.",
              "score": 5,
              "created_utc": 1734004976.0,
              "replies": [
                {
                  "id": "m1oqp7i",
                  "author": "jake3988",
                  "body": "Use the library.  That's what I started doing as red box kept jacking up their prices.\n\nThey generally only have newer movies like Red Box but... completely free.\n\nAs far as tv shows... library usually has a LOT of tv shows.",
                  "score": 9,
                  "created_utc": 1734009134.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1orndh",
          "author": "oshinbruce",
          "body": "On a big 4k tv you can see 4k streams are not 4k.\n\nTbh though the loss is physical media,  streaming services don't keep everything and if discs get retired the only legal route is to rely on them",
          "score": 4,
          "created_utc": 1734009536.0,
          "replies": []
        },
        {
          "id": "m1pctnb",
          "author": "sali_nyoro-n",
          "body": "Some day only studio executives and the very wealthy will be able to see newly-released media in higher quality than the sub-480p \"4K\" streaming quality on Netflix once it leaves cinemas.",
          "score": 2,
          "created_utc": 1734017360.0,
          "replies": []
        },
        {
          "id": "m1rae25",
          "author": "No-Bother6856",
          "body": "Yeah, the issue is people don't know or don't care. Its telling that DVDs are still hugely outselling bluray, let alone UHD bluray. That means it isn't just that streaming is more convenient, but also that even when convenience isn't a factor, people still don't care enough to pay for the higher quality option. If folks don't care about bluray over dvd, a huge quality gap, they are aren't going to care about uhd streaming vs uhd bluray where the gap is less obvious.",
          "score": 2,
          "created_utc": 1734038989.0,
          "replies": []
        },
        {
          "id": "m1pjw6t",
          "author": "stupid_horse",
          "body": "Streaming looks good enough except for in dark scenes, that's where the compression blows chunks. It also has a lot more color banding.\n\nAt full price UHD is too expensive for me but I look out for sales and can regularly find them for ~$10-$12. There's also regular blu-ray which is cheaper and still looks great. I pick up used blu-rays from thrift stores and second hand shops for $2-$3 all the time. \n\nI understand why most people don't want to bother with looking for a deal and would just scoff at like $30+ for a movie and at the same time don't want a bunch of plastic clutter in their house. For me I hate subscription models and not owning anything and I enjoy the hunt for a good deal so collecting movies is a fun hobby for me.",
          "score": 1,
          "created_utc": 1734019643.0,
          "replies": []
        },
        {
          "id": "m1rache",
          "author": "BigOldCar",
          "body": ">most people are happy streaming now\n\nPeople are still buying DVDs!  Standard definition DVDs!\n\nAdmittedly, I'm sometimes one of them, because I'm in a hotel for a couple of days and Walmart has a giant bin of $5 movies--or better still, $5 collections of 4 movies!",
          "score": 1,
          "created_utc": 1734038976.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1ov9q4",
      "author": "YamahaRyoko",
      "body": "Got one tucked away somewhere for the apocalypse; my wifes DVD and blue ray collection will shine\n\nPut the kid on a bike to generate electricity during the movie",
      "score": 9,
      "created_utc": 1734011004.0,
      "replies": []
    },
    {
      "id": "m1olbph",
      "author": "peppruss",
      "body": "This tracks with the rest of my interests; as soon as I am on board the whole thing is stamped vintage. I recently bought a Blu-ray writable drive for my PC so I had more places to play UHD discs. A PS5 along with a 55 inch 4K TV is such a beautiful place to watch UHD movies in full quality. If you have any interest in video production or seeing things as they were meant to be seen, it’s a sight to behold and better than streaming.",
      "score": 25,
      "created_utc": 1734006685.0,
      "replies": [
        {
          "id": "m1os7b4",
          "author": "guitarfreak2105",
          "body": "I recently learned that game consoles are a bad way to watch blu rays because they are RGB and not YCbCr. Still haven’t got a dedicated player but I’m on the lookout for a good deal.\n\nEdit: Okay maybe not bad just not the best.",
          "score": 3,
          "created_utc": 1734009768.0,
          "replies": [
            {
              "id": "m1osz0v",
              "author": "None",
              "body": "[deleted]",
              "score": 7,
              "created_utc": 1734010083.0,
              "replies": [
                {
                  "id": "m1otyh1",
                  "author": "guitarfreak2105",
                  "body": "It’s more the conversion process from my understanding.",
                  "score": -3,
                  "created_utc": 1734010480.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1ow1n4",
              "author": "peppruss",
              "body": "Maybe. Many of the films were shot on computer or converted on computer, edited on computer, and we’re watching it back on a computer: the game console with digital display. I’m a commercial broadcast director and I view my cameraman‘s footage on 10 bit 4K monitors, I edit on 10bit 4K monitors, and I watch on off the shelf smart TVs typically in HDR over HDMI. I know it’s not the same as film, but I’m thinking that there is a very narrow bit of loss these days.",
              "score": 5,
              "created_utc": 1734011309.0,
              "replies": [
                {
                  "id": "m1owc22",
                  "author": "guitarfreak2105",
                  "body": "Good to know and thanks for your insight here. \n\nMaybe “bad” was the wrong word and instead “not the absolute 100% best” would have been better wording lol",
                  "score": 1,
                  "created_utc": 1734011421.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1pn1pm",
          "author": "TenMinJoe",
          "body": "Disadvantage of the PS5 for this is that it doesn't support Dolby Vision on media playback, so it's not QUITE the best quality.",
          "score": 1,
          "created_utc": 1734020637.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pzq0f",
      "author": "doooplers",
      "body": "Most, if not all, of my streaming services do not stream movies with 5.1 Dolby digital.  Blu rays have it.  I got nice speakers.  I have been buying Blu rays instead of streaming movies for this reason",
      "score": 6,
      "created_utc": 1734024580.0,
      "replies": [
        {
          "id": "m1rv4zv",
          "author": "bluesmudge",
          "body": "Most do stream in 5.1, and more and more are even supporting Atmos. The problem is that its still highly compressed. Comparing streaming Atmos to the same movie's Atmos track on disc, it's like watching a different movie. There is so much more dynamic range, and nuance, and clarity to the blu-ray version.\n\nI don't even understand it...how much data are they actually saving by compressing the audio?",
          "score": 2,
          "created_utc": 1734045928.0,
          "replies": []
        },
        {
          "id": "m1rbxge",
          "author": "InvertedEyechart11",
          "body": "Agreed. 1000000000%.",
          "score": 1,
          "created_utc": 1734039472.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1o8y40",
      "author": "Noctew",
      "body": "So, Sony is basically what is left, right? The UBP-X800 Mark 2 has not yet officially been discontinued, has it?",
      "score": 22,
      "created_utc": 1733999564.0,
      "replies": [
        {
          "id": "m1oa7yr",
          "author": "rbp25",
          "body": "Panasonic, better than Sony players",
          "score": 40,
          "created_utc": 1734000396.0,
          "replies": [
            {
              "id": "m1ovytw",
              "author": "andorraliechtenstein",
              "body": "Correct. Buy a (premium) Panasonic DP-UB9000, you will not regret it.",
              "score": 5,
              "created_utc": 1734011277.0,
              "replies": [
                {
                  "id": "m1prdso",
                  "author": "TrauMedic",
                  "body": "UB820 4 lyfe! Just as good for 1/4 the price.",
                  "score": 1,
                  "created_utc": 1734021986.0,
                  "replies": [
                    {
                      "id": "m1rubfc",
                      "author": "bluesmudge",
                      "body": "The UB820 is missing the projector-focused HDR tone maps that the UB9000 has. I hate that Panasonic locks a software feature behind $500 of hardware, but if you have a 4k projector, that's just the reality.\n\nObviously, its also missing the build quality and balanced audio output of the UB9000 but you are correct that the image processing is the same (outside of the missing tone mapping options).",
                      "score": 2,
                      "created_utc": 1734045633.0,
                      "replies": []
                    },
                    {
                      "id": "m1q8i0t",
                      "author": "BizzyM",
                      "body": "1/2.\n\nThe 420 is 1/4",
                      "score": 1,
                      "created_utc": 1734027280.0,
                      "replies": [
                        {
                          "id": "m1qfj7o",
                          "author": "Robotic_Lamb",
                          "body": "The 450 is the sweet spot. Adds DV and switches to it automatically to boot",
                          "score": 1,
                          "created_utc": 1734029430.0,
                          "replies": []
                        },
                        {
                          "id": "m1qe82n",
                          "author": "TrauMedic",
                          "body": "You gotta look for better deals then!",
                          "score": 0,
                          "created_utc": 1734029028.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1ruiu3",
                  "author": "bluesmudge",
                  "body": "I kind of regret my purchase. The drive unit is already failing after just 5 years. Its a $250 replacement part. This was supposed to be my premium priced forever player, but now I know I can't trust the hardware and will have to stock up on a few backup players in case they ever stopped being sold. Imagine investing in a big 4k collection that you can't watch.",
                  "score": 1,
                  "created_utc": 1734045707.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1rtzyf",
              "author": "bluesmudge",
              "body": "And there is a new premium brand Magnetar (not Magnavox) in the market that is competing at Panasonic's UB9000 price point and above.",
              "score": 1,
              "created_utc": 1734045517.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1of8fc",
          "author": "corgi-king",
          "body": "I still using my Opponent 205. But mainly as media player for MKV.",
          "score": 4,
          "created_utc": 1734003494.0,
          "replies": []
        },
        {
          "id": "m1p5r1p",
          "author": "pacmanic",
          "body": "Pioneer still makes blu-ray for Windows PC’s.",
          "score": 1,
          "created_utc": 1734014942.0,
          "replies": []
        },
        {
          "id": "m1rh5xc",
          "author": "Robbbbbbbbb",
          "body": "Is the x800 worth it over the x700?\n\nI picked up the latter as a Christmas gift and wondering if I should splurge a bit more or not.\n\nI don't care about any of the streaming stuff (Apple ecosystem already), just want a nice 4k player.",
          "score": 1,
          "created_utc": 1734041129.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1odjya",
      "author": "RLewis8888",
      "body": "Whatever.  It doesn't play my VHS tapes anyway.",
      "score": 23,
      "created_utc": 1734002496.0,
      "replies": [
        {
          "id": "m1ofo8q",
          "author": "FlattenInnerTube",
          "body": "*shakes fist in Betamax*",
          "score": 14,
          "created_utc": 1734003744.0,
          "replies": [
            {
              "id": "m1ol667",
              "author": "TheCuriousGamer",
              "body": "You might want to clean your read heads and that shaking should disappear.",
              "score": 5,
              "created_utc": 1734006609.0,
              "replies": []
            },
            {
              "id": "m1otagy",
              "author": "jnmjnmjnm",
              "body": "[Rolls eyes in UMatic]",
              "score": 3,
              "created_utc": 1734010212.0,
              "replies": [
                {
                  "id": "m1p5x7g",
                  "author": "Aimhere2k",
                  "body": "*giggles in Quadraplex*",
                  "score": 3,
                  "created_utc": 1734015004.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1spf8j",
              "author": "I-seddit",
              "body": "Snickers in CED Video Disc.",
              "score": 2,
              "created_utc": 1734056985.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1oq2au",
          "author": "FixItDumas",
          "body": "Wake up - Laserdisc is the future man",
          "score": 2,
          "created_utc": 1734008859.0,
          "replies": []
        },
        {
          "id": "m1oyv3j",
          "author": "iCowboy",
          "body": "They won't accept my CED disks no matter how hard I try pushing them in the slot.",
          "score": 1,
          "created_utc": 1734012398.0,
          "replies": [
            {
              "id": "m1q8z6y",
              "author": "BizzyM",
              "body": "https://www.youtube.com/watch?v=Lq2ZFdR4GRs",
              "score": 1,
              "created_utc": 1734027424.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1p1rc2",
      "author": "TonyAtCodeleakers",
      "body": "I’m an avid collector of Blu-ray rips, that being said it’s not surprising. \n\nPhysical media is on its way out, I think the real opportunity is for some company to make a new codec that allows full fidelity in a smaller footprint and allow streamers to wait 30 seconds to a minute to pre-download the first 10 minutes of the film in full fidelity instead of instantly launching into the movie at a lower fidelity. \n\nAs far as media ownership goes, that ship has sailed and I don’t think there is a way back. Companies now know it’s more profitable to license media to you and make you buy it more than once.",
      "score": 14,
      "created_utc": 1734013491.0,
      "replies": [
        {
          "id": "m1plka0",
          "author": "stupid_horse",
          "body": "Streaming is actually a lot less profitable for the movie companies than when they were selling tons of DVDs in their heyday, but they've opened pandora's box and there's no way to put the toothpaste back in the tube.",
          "score": 8,
          "created_utc": 1734020172.0,
          "replies": [
            {
              "id": "m1pmv55",
              "author": "TonyAtCodeleakers",
              "body": "Fair, but the lemon hasn’t been squeezed yet \n\nThese companies are only just now figuring out how to make it profitable. I anticipate a “renaissance” in the next 5 years that changes how the streaming model works",
              "score": 5,
              "created_utc": 1734020582.0,
              "replies": [
                {
                  "id": "m1pqnda",
                  "author": "MasterInterface",
                  "body": "Ads, ads, and more ads. Disney CEO stated their most profitable tier is the ad tier. They've been raising prices on all the non-ads tier to drive more people towards their ad-tier.",
                  "score": 7,
                  "created_utc": 1734021760.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1qmthb",
              "author": "Aanar",
              "body": "I'm expecting streaming services to crank up their prices significantly over time.",
              "score": 2,
              "created_utc": 1734031675.0,
              "replies": []
            },
            {
              "id": "m1q4f3s",
              "author": "BizzyM",
              "body": "> but they've opened pandora's box and there's no way to put the toothpaste back in the tube.\n\nYahtzee",
              "score": 1,
              "created_utc": 1734026027.0,
              "replies": []
            },
            {
              "id": "m1qvxak",
              "author": "None",
              "body": "You don't have to stream anything, you can just keep using dvd and blu-ray players. I myself recently cancelled my spotify and bought a CD player instead",
              "score": 1,
              "created_utc": 1734034523.0,
              "replies": []
            },
            {
              "id": "m1rt41y",
              "author": "bluesmudge",
              "body": "DVD and Bluray sales are still a billion dollar industry. Not multi-billion like it used to be and I wouldn't be surprised if its drops into the 900 million range soon, but it's not too late for people to wise-up. There is still enough money involved for it to regain momentum. The toothpaste can be un-squoze",
              "score": 1,
              "created_utc": 1734045198.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1p59do",
          "author": "MasterInterface",
          "body": "Sony Core come close but obviously uses more bandwidth than say Netflix.",
          "score": 2,
          "created_utc": 1734014767.0,
          "replies": [
            {
              "id": "m1pomrt",
              "author": "nukedkaltak",
              "body": "For some reason they went all that way and still give you lossy audio. Makes no sense.\n\nIf blu ray truly bites the dust, I will have no choice but to murder my bank account for a Kaleidescape system.",
              "score": 2,
              "created_utc": 1734021134.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1phdz8",
      "author": "Zod5000",
      "body": "UHD is tough.  With the different HDR formats.  For regular bluray I was more than content to using my PS3 then PS4 as my bluray player.   With UHD, game consoles didn't support all the hdr formats via bluray (especially not the most popular one which is dolby vision).\n\nSo I had to buy a standalone, but finding a standalone that supported all the different HDR formats wasn't easy.  I ended buying a panasonic for a considerable amount of money.  Not like the old days where people could pick up a player for a hundred bucks.\n\nI think it's evolved out of the common persons realm, and into the realm of enthusiasts.\n\nI also find myself, who is physical media enthusiast, buying less and less UHD blurays due to the cost.   Especially here in Canada where sales and good prices are few and far between.",
      "score": 10,
      "created_utc": 1734018844.0,
      "replies": [
        {
          "id": "m1pxy41",
          "author": "TheBigLeMattSki",
          "body": ">I also find myself, who is physical media enthusiast, buying less and less UHD blurays due to the cost.   Especially here in Canada where sales and good prices are few and far between.\n\nThe prices have gotten absurd. I don't care if it's the best movie ever made, if you're selling it to me for $40 I'm not giving you any money.",
          "score": 4,
          "created_utc": 1734024029.0,
          "replies": [
            {
              "id": "m1rq276",
              "author": "Zod5000",
              "body": "Absolutely.  My goto for optical media used to be went it went below $20.  Maybe I extend that now to the low 20's.   I'm not paying $40 for a movie.  I'll either wait for a sale (if one ever shows up) or not buy it.",
              "score": 3,
              "created_utc": 1734044117.0,
              "replies": [
                {
                  "id": "m1rtse5",
                  "author": "TheBigLeMattSki",
                  "body": "I don't know if it's the same in Canada, but I periodically find decent deals on Gruv. A lot of times their sales aren't anything special, but you can occasionally find some gems. I got The Shining, Full Metal Jacket, and 2001 in a 4K box set for something like $28 a few months ago by combining a sale and a coupon. I'll also frequently see 4Ks in the $10-$15 range as well in the sales.\n\nr/4KBluRay is a good sub to keep an eye on. I've heard about a few good sales through them.",
                  "score": 1,
                  "created_utc": 1734045442.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1opbvs",
      "author": "AtsignAmpersat",
      "body": "Because no one is buying them.",
      "score": 6,
      "created_utc": 1734008535.0,
      "replies": []
    },
    {
      "id": "m1ow3r1",
      "author": "None",
      "body": "That basically leaves Panasonic, Sony, and Funai (which branches into Sanyo, Philips, Magnavox) for consumer models at least. Samsung kicked the bucket a few years ago. \n\nI have a Magnavox 4K Blu-ray player. It's seven years old. It works great!\n\nI also have a Sony BDP-S1, their first Blu-ray player. It's huge! I found it for $25 at a goodwill. I bought it because I knew I would never find another one. It's been three years since then.",
      "score": 4,
      "created_utc": 1734011332.0,
      "replies": []
    },
    {
      "id": "m1pd498",
      "author": "shadowCloudrift",
      "body": "Panasonic UB820 needs more competition.",
      "score": 4,
      "created_utc": 1734017456.0,
      "replies": []
    },
    {
      "id": "m1q1yvb",
      "author": "tucci007",
      "body": "if all media output goes to streaming then how will future civilizations be able to excavate our ruins and find the golden products of our advanced society",
      "score": 4,
      "created_utc": 1734025278.0,
      "replies": []
    },
    {
      "id": "m1r0vx0",
      "author": "bumbuff",
      "body": "Everyone in here saying physical media is dead, and I think you're hearing people contemplate going back to the way of physical media.\n\nI'm currently at the fence looking back over.",
      "score": 4,
      "created_utc": 1734036081.0,
      "replies": [
        {
          "id": "m1seu5r",
          "author": "peppruss",
          "body": "The other weekend I ripped all of my DVDs and Blu-rays and put them on a Plex server for easy playback. Now I can watch from any device in the house including PS5 without getting up and changing a disc. It was fun and felt good.",
          "score": 1,
          "created_utc": 1734053104.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pfx0j",
      "author": "Blueopus2",
      "body": "I dearly hope physical media or downloads of equal quality persist into the future - streaming is great for background content at a party or MASH episodes but it can’t stand up to the quality, especially audio, of physical media on well produced/modern content",
      "score": 3,
      "created_utc": 1734018374.0,
      "replies": [
        {
          "id": "m1pgw01",
          "author": "Zod5000",
          "body": "I feel like it's become like vinyl.  It's now a niche product sold to a niche audience at elevated prices.  \n\nI'm not sure it will go away in it's entirety.  Maybe it'll hang around to a small dedicated audience like Vinyl does (albeit Vinyl had a resurgence, but how much vinyl is sold is still a pale comparison to its hey dey).",
          "score": 3,
          "created_utc": 1734018685.0,
          "replies": [
            {
              "id": "m1phh2e",
              "author": "Blueopus2",
              "body": "That very well could be!  I’d be mostly fine if you could download the full file in advance such that buffering and compression are avoided, as long as you could still purchase the files rather than renting them",
              "score": 1,
              "created_utc": 1734018871.0,
              "replies": [
                {
                  "id": "m1rqqd5",
                  "author": "Zod5000",
                  "body": "yah, I'm not big on buying digital (except gaming).  I'll pay a few bucks to rent something, but paying optical media level pricing for a digital copy of something. I'm not there yet :)",
                  "score": 1,
                  "created_utc": 1734044351.0,
                  "replies": [
                    {
                      "id": "m1rqvu4",
                      "author": "Blueopus2",
                      "body": "Valid",
                      "score": 1,
                      "created_utc": 1734044404.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1ppvhp",
      "author": "Rom2814",
      "body": "It’s become annoying to get ahold of physical media - I never stopped buying it, but I worry it’s going to become a thing if the past.",
      "score": 3,
      "created_utc": 1734021522.0,
      "replies": []
    },
    {
      "id": "m1rjkog",
      "author": "ActionFigureCollects",
      "body": "LG used to be good, but their recent TV's are filled with pre-installed ad-ware where the OS barely functions.  \n\nAwful",
      "score": 3,
      "created_utc": 1734041928.0,
      "replies": []
    },
    {
      "id": "m1osmj5",
      "author": "KB_Sez",
      "body": "They are fools and servants of the dark forces…..\n\nThe Only True Religion Is Physical Media….",
      "score": 2,
      "created_utc": 1734009942.0,
      "replies": []
    },
    {
      "id": "m1ozdek",
      "author": "BenderDeLorean",
      "body": "Time to buy a 4K one",
      "score": 2,
      "created_utc": 1734012595.0,
      "replies": []
    },
    {
      "id": "m1rj0v5",
      "author": "strip_sack",
      "body": "Bòoooooòoooooo",
      "score": 2,
      "created_utc": 1734041744.0,
      "replies": []
    },
    {
      "id": "m1tq717",
      "author": "speculatrix",
      "body": "Having seen this trend, I bought a UHD Blu-ray player which has been modified to play all regions, as well as all DVD regions. We've got a lot of disks, many bought off eBay. If the supply dries up here, I can buy disks from other countries.",
      "score": 2,
      "created_utc": 1734073466.0,
      "replies": []
    },
    {
      "id": "m1vbjb3",
      "author": "robertomeyers",
      "body": " There seems to be a re-surgence of vinyl, hidef music streaming and OG movies on bluray. Sound is soooo much better. Glad to see this.\n\nI’m back to collecting blurays of the classics. Given that streamers are pushing the classics with A-list actors backwards to Rent/Buy only.",
      "score": 2,
      "created_utc": 1734103306.0,
      "replies": []
    },
    {
      "id": "m1owg1v",
      "author": "Magalahe",
      "body": "Funny how blu ray won the HD battle not too long ago.",
      "score": 2,
      "created_utc": 1734011464.0,
      "replies": [
        {
          "id": "m1p5mq5",
          "author": "MasterInterface",
          "body": "Blu-ray won the format war almost 17 years ago. That's nearly 2 decade.",
          "score": 3,
          "created_utc": 1734014899.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pe2tf",
      "author": "No_Animator_8599",
      "body": "No great loss, LG makes garbage now. I bought a big screen tv and it’s got tons of technical issues and the set up software was full of bugs.",
      "score": 2,
      "created_utc": 1734017771.0,
      "replies": []
    },
    {
      "id": "m1pnlr8",
      "author": "ensignlee",
      "body": "That's too bad. The LG UBKC90 was actually a great little player for its price.\n\nI \"upgraded\" to the Panasonic UB-820, and tbh, I can't really tell the difference, despite the Panasonic costing like 4x more.",
      "score": 1,
      "created_utc": 1734020812.0,
      "replies": [
        {
          "id": "m1pyfhh",
          "author": "MasterInterface",
          "body": "I don't think UB-820 is popular because it's so much better than other player when it comes to quality but more that it's consistent and reliable. It also does a good job with dynamic tone mapping on movies without DV/HDR10+ but often hear this is feature is very valuable to those using it on a projector. \n\nA lot of the UHD players also have freezing issues especially with triple layer disc which is not the case with Panasonic players. The Sony UHD players are plagued with freezing issues. When it works, it's great but when it doesn't then it's a headache and will be a persistent issue.",
          "score": 3,
          "created_utc": 1734024181.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pqaso",
      "author": "Immediate-Answer-184",
      "body": "I bought a 2nd hand PS4 for watching blu ray. But were I leave people only rent or buy DVD, making blu ray a rarity!",
      "score": 1,
      "created_utc": 1734021652.0,
      "replies": []
    },
    {
      "id": "m1rxi4z",
      "author": "Bluelegojet2018",
      "body": "Darn, guess I’ll have to pick up a ps3 after all.",
      "score": 1,
      "created_utc": 1734046784.0,
      "replies": []
    },
    {
      "id": "m1si6cj",
      "author": "raiderMoes",
      "body": "I love mine!",
      "score": 1,
      "created_utc": 1734054309.0,
      "replies": []
    },
    {
      "id": "m1ssvos",
      "author": "earnestlikehemingway",
      "body": "The end of an Era!",
      "score": 1,
      "created_utc": 1734058271.0,
      "replies": []
    },
    {
      "id": "m1st8zg",
      "author": "cx3psocial",
      "body": "Paid darn near $1,200 for one of the first ones back in the day 🤦🏽‍♂️",
      "score": 1,
      "created_utc": 1734058410.0,
      "replies": []
    },
    {
      "id": "m1tmgz1",
      "author": "AlwaysLateToThaParty",
      "body": "He's dead, Jim.",
      "score": 1,
      "created_utc": 1734071289.0,
      "replies": []
    },
    {
      "id": "m1ty8ef",
      "author": "DarkFate13",
      "body": "Just use ur game console for Blue ray",
      "score": 1,
      "created_utc": 1734078638.0,
      "replies": []
    },
    {
      "id": "m1ulfk5",
      "author": "cyberkite1",
      "body": "RIP",
      "score": 1,
      "created_utc": 1734093172.0,
      "replies": []
    },
    {
      "id": "m1z7iva",
      "author": "SabreSour",
      "body": "Does this include their computer disk drives??",
      "score": 1,
      "created_utc": 1734154277.0,
      "replies": []
    },
    {
      "id": "m210oxr",
      "author": "illusion121",
      "body": "Are companies still making those things?!",
      "score": 1,
      "created_utc": 1734191020.0,
      "replies": []
    },
    {
      "id": "m24nj1k",
      "author": "None",
      "body": "They still made those!!?",
      "score": 1,
      "created_utc": 1734240747.0,
      "replies": []
    },
    {
      "id": "m1ottfz",
      "author": "caged345",
      "body": "With disk rot being a thing its almost a waste of material knowing eventually the media will he unreadable. Obviously years and years in the making but still",
      "score": 0,
      "created_utc": 1734010425.0,
      "replies": [
        {
          "id": "m1p40gs",
          "author": "GeT_Tilted",
          "body": "The disc's content can be moved over to Hard Drive on your computer using software like MakeMKV",
          "score": 2,
          "created_utc": 1734014316.0,
          "replies": [
            {
              "id": "m1pfstd",
              "author": "caged345",
              "body": "Yeah definitely a good idea to consider but most people wouldnt know how or where to learn to do that",
              "score": 1,
              "created_utc": 1734018336.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1qthnm",
          "author": "GuerrillaRodeo",
          "body": "Yeah that's a thing but I've owned DVDs for more than 20 years and I've never experienced disc rot except one time, and that was probably a bootlegged Chinese one. If that happens I have no quarrels torrenting, I mean I already own the film, so...",
          "score": 1,
          "created_utc": 1734033749.0,
          "replies": [
            {
              "id": "m1r53w7",
              "author": "caged345",
              "body": "Yeah it's all environmental with disk rot if you keep them in the case and in a dry environment it should be fine. Thats why i said years and years. It's so rare if you take care of them.",
              "score": 1,
              "created_utc": 1734037355.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1om6ry",
      "author": "firedrakes",
      "body": "Even console sales are down and people are not use 4k disk platers in their console foe movies",
      "score": 1,
      "created_utc": 1734007103.0,
      "replies": [
        {
          "id": "m1phtgt",
          "author": "Zod5000",
          "body": "Yah, I think that was a missed opportunity, not having consoles support HDR formats like Dolby Vision.   It means for people to enter the realm of 4k and buy a player that supports most/all of the HDR formats, you need to plunk down a fair amount of cash on the panasonic player.",
          "score": 1,
          "created_utc": 1734018980.0,
          "replies": [
            {
              "id": "m1qik85",
              "author": "firedrakes",
              "body": "on xbox sx both are support....but ps5 no.",
              "score": 1,
              "created_utc": 1734030358.0,
              "replies": [
                {
                  "id": "m1rpvaq",
                  "author": "Zod5000",
                  "body": "I think Xbox only supports it on streaming content, they don't support DV when using optical media.  No idea why.",
                  "score": 1,
                  "created_utc": 1734044050.0,
                  "replies": [
                    {
                      "id": "m1sxkst",
                      "author": "firedrakes",
                      "body": "Incorrect.  Firmware patch awhile back fix that",
                      "score": 0,
                      "created_utc": 1734060045.0,
                      "replies": [
                        {
                          "id": "m1tn03w",
                          "author": "Zod5000",
                          "body": "Well Damn, that could of been a reason to buy one instead of the panasonic player.",
                          "score": 1,
                          "created_utc": 1734071595.0,
                          "replies": [
                            {
                              "id": "m1twd6i",
                              "author": "firedrakes",
                              "body": " ehh. more of i still trust Panasonic player thru for play back.\n\n xbox sx at times buggy and will de since from av receiver.\n\nalso it seems they pulled the blue ray app update they were testing.\n\nwhich i dl and do have it supported thru for my console.\n\nwhich is news to me. seeing they wanted a few of us to test the app.\n\nso i do stand corrected.",
                              "score": 1,
                              "created_utc": 1734077378.0,
                              "replies": [
                                {
                                  "id": "m1vf983",
                                  "author": "Zod5000",
                                  "body": "oh, they were testing DV on a test release, then opted not to release it, that sucks :(\n\nI would of rather bought a game console as a Bluray player due to the extra functionality, which I suppose is now moot as I bought the Panasonic a few years back.",
                                  "score": 1,
                                  "created_utc": 1734104533.0,
                                  "replies": [
                                    {
                                      "id": "m1vfzsm",
                                      "author": "firedrakes",
                                      "body": "it related to something with drm and handshakes.\n\nseeing ms could afford the fee. \n\nsony cheap out thru for the console fee for it  and also for  until the ps5 pro. not used a full spec hdmi port on their ps5. aka they where using spares from ps4 pro models for the ps5.\n\nthis gen console manf did odd stuff and cheap out as much as possible.",
                                      "score": 1,
                                      "created_utc": 1734104774.0,
                                      "replies": [
                                        {
                                          "id": "m1vh1t5",
                                          "author": "Zod5000",
                                          "body": "Wouldn't the HDMI still support it though?\n\nI do think what MS does is clever, which is you have to download the bluray player app to play bluray's.   I think that most likely means they don't pay the license unless someone's actually using it.\n\nEven if Sony charged $5 or $10 for an app in their online store, to cover the cost of a Dolby Vision license, I'd pay it.   Seems like a small price to pay to turn the console into a solid bluray player.",
                                          "score": 2,
                                          "created_utc": 1734105114.0,
                                          "replies": [
                                            {
                                              "id": "m1vhzcp",
                                              "author": "firedrakes",
                                              "body": "your not the only one that ref that idea.\n\nhdmi (ps5 due to vrr)  hell i know.(again till pro).\n\n Where all wondering that love 4k disc content and why for some reason neither console  did it this gen. i know xbox plan to but . for what ever reason did not at last min.\n\ni do know one thing is multi lvl 4k disc manf does have issue and it seems not all players support it or can be buggy with them.\n\nstandard blue ray even dual layers where fix and deploy in mass pretty fast.\n\nbut for some reason 4k manf of disc for some reason are un able to do it.",
                                              "score": 1,
                                              "created_utc": 1734105413.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m1ye65v",
                              "author": "50bucksback",
                              "body": "Other person is wrong. There wasn't a firmware update to add DV for discs",
                              "score": 1,
                              "created_utc": 1734140891.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1ydxy3",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1734140800.0,
                          "replies": [
                            {
                              "id": "m1ye1h6",
                              "author": "firedrakes",
                              "body": "Lazy not reading my later comments.",
                              "score": 1,
                              "created_utc": 1734140839.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1ye9px",
                          "author": "50bucksback",
                          "body": "A firmware patch to add DV support for discs?",
                          "score": 1,
                          "created_utc": 1734140932.0,
                          "replies": [
                            {
                              "id": "m1yednz",
                              "author": "firedrakes",
                              "body": "Yes. But ms pulled the updated we where testing. I was un aware they did it.",
                              "score": 1,
                              "created_utc": 1734140975.0,
                              "replies": [
                                {
                                  "id": "m1yf2i6",
                                  "author": "50bucksback",
                                  "body": "Damn. You'd think they could sell it like they do the Atmos license if it's an issue with cost.",
                                  "score": 1,
                                  "created_utc": 1734141251.0,
                                  "replies": [
                                    {
                                      "id": "m1yf5fq",
                                      "author": "firedrakes",
                                      "body": "Yeah we don't know why",
                                      "score": 1,
                                      "created_utc": 1734141284.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1rohxc",
      "author": "jkggwp",
      "body": "Bluray players will become to videophiles what vinyl and CD players are now to audiophiles",
      "score": 1,
      "created_utc": 1734043584.0,
      "replies": []
    },
    {
      "id": "m1rg6k2",
      "author": "waldoorfian",
      "body": "They should stop making TVs too. The one I bought 3 years ago is already burning in.",
      "score": 0,
      "created_utc": 1734040810.0,
      "replies": [
        {
          "id": "m1yeism",
          "author": "50bucksback",
          "body": "Don't buy an OLED if you keep static content on it all day long every day",
          "score": 1,
          "created_utc": 1734141032.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1pj8fo",
      "author": "Jiangcool9",
      "body": "I really don’t understand paying $400-600 for quality blue ray player when consoles basically do the same thing and much more.",
      "score": -1,
      "created_utc": 1734019431.0,
      "replies": [
        {
          "id": "m1ydokn",
          "author": "50bucksback",
          "body": "The market that wants these devices value features like Dolby Vision which the consoles don't do.",
          "score": 1,
          "created_utc": 1734140694.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1omf9f",
      "author": "PrimitiveThoughts",
      "body": "Do people still buy movies on a disc anymore?",
      "score": -9,
      "created_utc": 1734007216.0,
      "replies": [
        {
          "id": "m1ontw8",
          "author": "TheExile285",
          "body": "I do. Not everything but I buy the stuff I really like. \n\nEspecially after Disney and Warner Bros. have been deleting content for tax write offs.",
          "score": 8,
          "created_utc": 1734007865.0,
          "replies": []
        },
        {
          "id": "m1oqrko",
          "author": "Bmic31",
          "body": "Definitely niche. I have a dedicated theater room and my wife and I can absolutely hear the difference in compressed vs noncompressed audio.",
          "score": 5,
          "created_utc": 1734009163.0,
          "replies": []
        },
        {
          "id": "m1ot03i",
          "author": "NCSUGrad2012",
          "body": "In general?  No, their sales are declining year after year.  \n\nOn Reddit?   For some reason yes.  Everyone is apparently buying physical media here.   Just like “the I’m canceling my Netflix” it’s not reflective of real life",
          "score": 2,
          "created_utc": 1734010096.0,
          "replies": [
            {
              "id": "m1yee98",
              "author": "50bucksback",
              "body": "The people who care about it going away are going to comment more",
              "score": 2,
              "created_utc": 1734140982.0,
              "replies": []
            },
            {
              "id": "m1pe5p0",
              "author": "SirPancakesIII",
              "body": "Most people aren't buying physical media. But there is a group of us who manage\n\nEdit: accidentally sent lol. Group of us who manage plex servers and want to have a physical library of our favorite movies in the highest quality. If you have the setup to support it (4K OLED TV with surround sound) there is a noticeable improvement to sound quality",
              "score": 1,
              "created_utc": 1734017798.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1vtuzh",
          "author": "mynameisevan",
          "body": "There’s a ton of movies that aren’t available on any streaming service. Streaming in general is pretty awful for watching old movies.",
          "score": 1,
          "created_utc": 1734109196.0,
          "replies": []
        },
        {
          "id": "m1ora88",
          "author": "PrimitiveThoughts",
          "body": "Why are people downvoting a legit question as if I’m talking shit?\n\nI speak my mind, hence the name. So I’m not afraid to ask questions. If anything, this is an opportunity for you to chime in, I’m asking you to.",
          "score": -1,
          "created_utc": 1734009382.0,
          "replies": [
            {
              "id": "m1os1bh",
              "author": "corecenite",
              "body": "Probably because of how out of touch the question sounds.",
              "score": 1,
              "created_utc": 1734009698.0,
              "replies": [
                {
                  "id": "m1osksf",
                  "author": "PrimitiveThoughts",
                  "body": "How is that?\n\nEverything has moved to digital and streaming, not a lot of people buy discs anymore, that’s why they’ve stopped making CD, DVD, and now Blu Ray players. This is now a niche market.\n\nEven video games are available online and gaming consoles have disc players as an upgrade because they aren’t necessary as playing from a disc is slower than playing from a hard drive.",
                  "score": 1,
                  "created_utc": 1734009922.0,
                  "replies": [
                    {
                      "id": "m1tidc9",
                      "author": "silent--onomatopoeia",
                      "body": "I have a question..\n\nI'm ignorant on this. Isn't there a way to get legal digital downloads that you can keep where the file size is the same as the BluRay?",
                      "score": 1,
                      "created_utc": 1734069029.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1pwf8k",
      "author": "whewtang",
      "body": "Have a ps5 for that.",
      "score": -1,
      "created_utc": 1734023553.0,
      "replies": [
        {
          "id": "m1yeg1p",
          "author": "50bucksback",
          "body": "The real AV nerds want Dolby Vision",
          "score": 1,
          "created_utc": 1734141001.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1p3xi0",
      "author": "jack27nikkkk",
      "body": "They're are still people who r using them xD?",
      "score": -7,
      "created_utc": 1734014286.0,
      "replies": []
    },
    {
      "id": "m1or27q",
      "author": "SteelBandicoot",
      "body": "LG is Gretchen\n\n![gif](giphy|l2YWgOm7cak7P4Cly|downsized)",
      "score": -3,
      "created_utc": 1734009289.0,
      "replies": []
    }
  ]
}