{
  "post": {
    "title": "Framework Laptop 12 review: Doing the right thing comes at a cost",
    "author": "dapperlemon",
    "id": "1lf2ged",
    "score": 320,
    "created_utc": 1750309559.0,
    "selftext": "",
    "num_comments": 49,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lf2ged/framework_laptop_12_review_doing_the_right_thing/"
  },
  "comments": [
    {
      "id": "mylagpg",
      "author": "saposapot",
      "body": "Love the company and their goal and the price doesn’t seem too much but the economics are really though. When you can basically buy 2 laptops for the price of this one it makes very hard to justify the durability and repairability.\n\nThey need to have some quality redeeming features which they seem to have with the keyboard experience. Probably need to offer a better display, everything else seems to be more or less reasonable for this model goal.\n\nHopefully they get bigger and bigger and I can find it on my country",
      "score": 167,
      "created_utc": 1750316179.0,
      "replies": [
        {
          "id": "mylfbrl",
          "author": "StraY_WolF",
          "body": "It's chicken and egg problem, they can lower the cost once they got many orders, which they wouldn't get because currently their stuff is expensive.",
          "score": 106,
          "created_utc": 1750318956.0,
          "replies": [
            {
              "id": "mynt2c5",
              "author": "bebetterinsomething",
              "body": "Raise capital and try to scale operations?",
              "score": 18,
              "created_utc": 1750352235.0,
              "replies": [
                {
                  "id": "myot7vf",
                  "author": "StraY_WolF",
                  "body": "They did and it's only enough for their current operation.",
                  "score": 26,
                  "created_utc": 1750363326.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mymakgy",
          "author": "WFlumin8",
          "body": "At $800 it’s right in the crosshair of the MacBook Air which is sort of the antithesis to this laptop, a very NON repairable and NON modular laptop that has:\n\nBuild quality (100% aluminum + most rigid chassis of any laptop manufacturer)\n\nSpeaker quality (best sound quality of any laptop, period, unless you compare it to a MacBook Pro)\n\nKeyboard quality (best scissor style switch style keyboard of any laptop)\n\nBattery life (best battery life for any laptop in any price bracket) \n\nConsidering the MacBook Air exists for the same price, I think framework definitely needs to get the laptop to a price point just a tiny bit lower to avoid the comparison",
          "score": 69,
          "created_utc": 1750335257.0,
          "replies": [
            {
              "id": "mymkul4",
              "author": "VictoriaRose0",
              "body": "That’s my problem with laptops currently, Apple has been making strides with Macs and honestly if they release a new base MacBook that’s cheaper than the Air, they’ll probably get even more interest.\n\nI bought a $1000+ laptop that had terrible build quality, battery life, and screen, but was powerful enough to play games. Cool, but the M1 MacBook Air I got two years later felt like I could actually use it like a laptop, while still having enough power to run some stuff (while the current M-chips are way more powerful on Macs)\n\nAll I can think is that is that there has to be some way to get that experience at the same prices, it’s crazy that there’s still no 1-1 MacBook alternatives and I say that as someone that wants to have a Linux laptop, but can’t even find a decent windows one to just install over, I’m just waiting for OLED to upgrade to a new MacBook",
              "score": 24,
              "created_utc": 1750338982.0,
              "replies": [
                {
                  "id": "myoil04",
                  "author": "m0rogfar",
                  "body": "The rest of the laptop industry has always struggled to make a laptop experience that’s as nice as Apple’s, at the same price. That’s been true largely non-stop since the PowerBook 170 release in 1991. The laptop format just plays too much into Apple’s strengths of top-notch driver integration and needing the OEM to actually be competent.\n\nChoosing a non-Apple laptop has almost always been about either cost (non-Apple laptops have almost always started at far less, and while they’re compromised, saving the money could be worth it to you), wanting a fundamentally different feature mix (the most common being a laptop that’s okay-ish at games but terrible at being a laptop) or platform lock-in (if you need Windows-only software, you may have to settle for a worse product, even if you’re willing to pay more than Apple’s price).",
                  "score": 14,
                  "created_utc": 1750360165.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "myml46z",
              "author": "VictoriaRose0",
              "body": "That’s my problem with laptops currently, Apple has been making strides with Macs and honestly if they release a new base MacBook that’s cheaper than the Air, they’ll probably get even more interest.\n\nI bought a $1000+ laptop that had terrible build quality, battery life, and screen, but was powerful enough to play games. Cool, but the M1 MacBook Air I got two years later felt like I could actually use it like a laptop, while still having enough power to run some stuff (while the current M-chips are way more powerful on Macs)\n\nAll I can think is that is that there has to be some way to get that experience at the same prices, it’s crazy that there’s still no 1-1 MacBook alternatives and I say that as someone that wants to have a Linux laptop, but can’t even find a decent windows one to just install over, I’m just waiting for OLED to upgrade to a new MacBook",
              "score": -1,
              "created_utc": 1750339071.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mymbzs8",
          "author": "unematti",
          "body": "How I justified it was easy. Either I get a repairable thing like the fw13, or a cheap chromebook. Because it doesn't matter what any other company offers. I can do my gaming on GeForce now if I really want to. And browsing is fine on a chromebook. And they come in at 300 euro on sale sometimes. Right next week they opened the fw16 preorder... So yeah, I definitely am never gonna think about buying other brands, unless they can bring the same level of features.\n\nAnd if you use it for work, price really isn't the thing to look at.\n\nAbout the display... Yeee, on all 3, I hope there'll be a compatible oled. I'd pay another 1k or more for an oled/microled",
          "score": 10,
          "created_utc": 1750335805.0,
          "replies": [
            {
              "id": "mymebg3",
              "author": "VampyreLust",
              "body": "Question, my understanding of the framework laptops is that they're repairable in the sense that framework themselves offer specific parts that you can swap in and out to either repair or upgrade but these aren't standard parts so if the company goes under you're boned? \n\nI have an old laptop kicking around from around 2018 that is slow af but you can replace the ram, hd, wifi chip, battery, ssd, screen, fans, etc on if you have a torx set and the tiniest bit of knowledge. Since these are all standard parts it doesn't matter if the company goes out of business because the company doesn't make them. Is this not the better way to go about repairability, like it used to be when you could change out components at will and not have to rely on only one company to supply them? No shade meant, just asking the question to the community.",
              "score": 6,
              "created_utc": 1750336686.0,
              "replies": [
                {
                  "id": "mymjhcr",
                  "author": "unematti",
                  "body": "They use a screen that's originally was for another brand, so you can get a new screen from aliexpress. RAM is standard sodimm, ssd is nvme, wifi is also. Schematics are open, so if you start a company wanting to make input modules for the fw16, you can. The cards are also open, there's a project(I hope that isn't dead) that aims to make a dual type c card. I also have a pair of RGB input module matrices, that was made by a third party. (and to which the CEO themselves contributed by sending casings so the guy can build them easier)\n\nAnd all this with a factory supplied screwdriver, they ship with the laptop. I think even the boards are open sourced, so technically you could build one, but that's way outside my expertise to even think about... There's a RISC-V board for the fw13, which I think is third party technically",
                  "score": 19,
                  "created_utc": 1750338515.0,
                  "replies": [
                    {
                      "id": "mymkrib",
                      "author": "VampyreLust",
                      "body": "So to be clear, if you bought a framework laptop, you could upgrade it yourself by buying any compatible SSD or ram from your local computer store?",
                      "score": 6,
                      "created_utc": 1750338953.0,
                      "replies": [
                        {
                          "id": "mymn2kg",
                          "author": "CoolguyThePirate",
                          "body": "yes",
                          "score": 14,
                          "created_utc": 1750339727.0,
                          "replies": [
                            {
                              "id": "mymur53",
                              "author": "VampyreLust",
                              "body": "Oh ok, that's great, thank you for clearing that up.",
                              "score": 3,
                              "created_utc": 1750342232.0,
                              "replies": [
                                {
                                  "id": "mz60kxx",
                                  "author": "Careve",
                                  "body": "You can go even further - buy their laptop without ssd and ram and then use your own. I did that and saved around 100€.",
                                  "score": 1,
                                  "created_utc": 1750606117.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mymg3th",
                  "author": "ironmaiden1872",
                  "body": "No, they go a step further and make available the schematics, so you can actually fix the laptops with good ol' soldering.",
                  "score": 12,
                  "created_utc": 1750337334.0,
                  "replies": [
                    {
                      "id": "mymgqvh",
                      "author": "VampyreLust",
                      "body": "Ok, what are the percentages of normal people that will do that compared to ones that will just buy a new mobo?",
                      "score": -4,
                      "created_utc": 1750337563.0,
                      "replies": [
                        {
                          "id": "mymhvy6",
                          "author": "ironmaiden1872",
                          "body": "The schematics are available to third party vendors as well. That means you can also bring it to a shop and they can actually fix things.\n\nThis community is also very DIY, for the record.",
                          "score": 19,
                          "created_utc": 1750337960.0,
                          "replies": [
                            {
                              "id": "mymk9ij",
                              "author": "VampyreLust",
                              "body": "That's cool. When you say the community do you mean the community of people willing to solder or the community that is cross shopping it with an HP or Dell cuz that's the only way a company that makes laptops will be around in 10 years, if they can appeal to the masses.",
                              "score": -5,
                              "created_utc": 1750338783.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "myoetgi",
          "author": "lordraiden007",
          "body": "Being able to reduce future costs by easily switching in new motherboards is a pretty big sell for some. No need to buy another full laptop the next time, and the mainboards are usually less than half the cost of a full device (e.g. the Laptop 12 costs $799 for the base model, but the mainboard for same costs only $249). Basically you can switch to a new mainboard as long as it’s the same form factor I believe.",
          "score": 4,
          "created_utc": 1750358919.0,
          "replies": [
            {
              "id": "myozj78",
              "author": "saposapot",
              "body": "Problem is 799 plus 249 gives you 1050 which is more than enough to buy 2 maybe even 3 laptops with similar specs… the economics are really hard to justify.\n\nSure, in 10 years it will compensate but will they support it for 10 years? For 5 years for example doesn’t seem to justify",
              "score": 0,
              "created_utc": 1750365139.0,
              "replies": [
                {
                  "id": "myp5xud",
                  "author": "lordraiden007",
                  "body": "It’s a luxury brand, no one is denying that. You pay for the quality of the build, the high degree of customization, the open sourced part platform, the options for EOL hardware, etc. I can buy a framework laptop, upgrade the board 3-5 years later when it gets old, then 3D print a chassis to make the old board into a SFF server to run stuff on. I’ve even seen posts of people turning their old boards into a small NAS supporting up to 9 SATA drives. Name a single laptop brand that lets you do the same things. \n\nIt’s definitely niche, but it has value to the people it’s meant to cater towards.",
                  "score": 10,
                  "created_utc": 1750366993.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mysom44",
          "author": "tylerderped",
          "body": ">When you can basically buy 2 laptops for the price of this\n\nPeople say the same thing about Macs. Neither Framework nor Apple sell bottom tier crap tho.",
          "score": 5,
          "created_utc": 1750420318.0,
          "replies": []
        },
        {
          "id": "mynut9y",
          "author": "Heyitsthatdude69",
          "body": "In my experience, cheap laptops last the shortest amount of time possible. It's Boots Theory. Sure you can buy a $400 laptop twice, but their longevity (battery life, useability) is gonna be lackluster in comparison to a nicer laptop like the framework. It makes the economics make a lot more sense imo.\n\nAt the end of the day it is more (upfront) expensive to build a laptop this way. That's just something you have to swallow as a consumer if you want to support this type of manufacturing. But it will get cheaper and the dividends are there.",
          "score": 3,
          "created_utc": 1750352750.0,
          "replies": [
            {
              "id": "myozyqz",
              "author": "saposapot",
              "body": "That is true but this 12 is trying to get a different market of cheaper laptops (chromebooks). It’s harder to justify the higher quality for this market. \n\nFor me it can still justify because I just can’t use a bad keyboard or a bad LCD so I don’t mind paying extra but I’m not the target for this specific model",
              "score": 1,
              "created_utc": 1750365266.0,
              "replies": []
            }
          ]
        },
        {
          "id": "myq7a3d",
          "author": "nsaps",
          "body": "I love the idea of frameworks but here’s the thing: businesses buy a shit load of laptops then get rid of them after 3 or 5 years and you can get a quality computer for a few hundred dollars. It’s not as sustainable but until you get the businesses on board it’ll be hard for something like this to really take off.\n\nMy family that just needs an everyday YouTube and internet shopping laptop, I hook up with old thinkpads. $300 gets you a solid computer that will last a few more years with minimal upkeep, it’s hard to argue for something much more expensive that’s upgradable when they can just get another $300 leftover laptop in 3 years",
          "score": 1,
          "created_utc": 1750379269.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mym4pb3",
      "author": "TheStealthyPotato",
      "body": "JerryRigEverything did a \"teardown\" of one and it seems incredibly well thought-out.\n\nhttps://youtu.be/hJjstBT0bpw",
      "score": 52,
      "created_utc": 1750332846.0,
      "replies": [
        {
          "id": "myqka4h",
          "author": "safeness",
          "body": "The captive screws!!!",
          "score": 6,
          "created_utc": 1750383879.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myl6tcj",
      "author": "speculatrix",
      "body": "*Earlier this year, Framework announced it was making a smaller, 12-inch laptop and a beefy desktop to go alongside its 13- and 16-inch notebooks. A few months later, and the former has arrived, putting the same modular, repairable laptop into a slightly smaller body. Unlike its bigger siblings, the Laptop 12 is a 12.2-inch touchscreen convertible clad in brightly colored plastic. It’s aimed at students, with a focus on robustness and quality you won’t see in the usual machines you find at the top of the bargain list.*",
      "score": 32,
      "created_utc": 1750314202.0,
      "replies": []
    },
    {
      "id": "mymyyu9",
      "author": "Chanw11",
      "body": "I know this isnt a good conparison but i think its really interesting that the price comes around the same price as a new MacBook air. Wildly different objectives, but at the same price. The least repairable laptop vs the most repairable laptop. You can really see where they put the money at.",
      "score": 34,
      "created_utc": 1750343487.0,
      "replies": [
        {
          "id": "mysx3sl",
          "author": "Mathisbuilder75",
          "body": "The Framework also doubles as a tablet, so you could get a lot more value out of it, especially as a student.",
          "score": 13,
          "created_utc": 1750423584.0,
          "replies": []
        },
        {
          "id": "myswkbu",
          "author": "AccountNumeroThree",
          "body": "I’ll take the MBA for performance and durability. I’ve had Macs since 2005 and have only had to repair them twice, and both under warranty.",
          "score": 5,
          "created_utc": 1750423389.0,
          "replies": []
        }
      ]
    },
    {
      "id": "myss2uy",
      "author": "lwurl2",
      "body": "For me, it’s the principle of the company + knowing I can make my ~$800 last much longer. My FW13 also is more than other comparable devices, but having had to replace the keyboard deck, and another friend who just broke her display? \n\nWhen I said I’d replace the display for her for just the cost of the parts, she was like THIS IS AMAZING!",
      "score": 9,
      "created_utc": 1750421703.0,
      "replies": []
    },
    {
      "id": "myogizs",
      "author": "Gregsticles_",
      "body": "It was a good read until the actual specs came out. Charging 800 for something like that isn’t viable in any market. And the market is cutthroat af, this company needs to really figure out something fast.",
      "score": 16,
      "created_utc": 1750359484.0,
      "replies": [
        {
          "id": "mys4nrc",
          "author": "simon132",
          "body": "It depends, if your other computer has a battery problem, speaker dies, etc, there goes the \"value\" of a non-repairable laptop.\nWith the framework you can just pop it open and swap a part instead of buying a new laptop.\n\n\nYou can also just buy a new motherboard for your laptop two years later, which costs about 250$ instead of buying a whole new laptop so.....it's actually better in price and you can keep up with specs",
          "score": 14,
          "created_utc": 1750410208.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mytjmte",
      "author": "artguy55",
      "body": "OMG so short sighted . look at the total cost of ownership including the cost of being locked in to the apple or MS system. you have to include the cost of years of apple care and then the framework price is much better",
      "score": 5,
      "created_utc": 1750430800.0,
      "replies": [
        {
          "id": "myw07sl",
          "author": "sosthaboss",
          "body": "You don’t have to buy Apple care lmao",
          "score": 6,
          "created_utc": 1750456957.0,
          "replies": [
            {
              "id": "mywxxgg",
              "author": "artguy55",
              "body": "I guess you've never owned an apple laptop because then you would know the cost of any repair will be greater than the cost of apple care",
              "score": 2,
              "created_utc": 1750468928.0,
              "replies": [
                {
                  "id": "myx5add",
                  "author": "sosthaboss",
                  "body": "I haven’t had to pay a single cent in repair costs for my 2017 MacBook that I still use daily. \n\nThe one time the screen broke because I dropped it on a tile floor, they replaced it for free even though I didn’t have applecare because the tech appreciated me being honest about dropping it instead of trying to say “it just stopped working!”\n\nOtherwise it’s run perfectly without any breaks or issues. So, no clue what you’re really on about. Maybe try taking care of your electronics?",
                  "score": 3,
                  "created_utc": 1750471692.0,
                  "replies": [
                    {
                      "id": "myxaied",
                      "author": "artguy55",
                      "body": "ya that was apple care buddy",
                      "score": -1,
                      "created_utc": 1750473683.0,
                      "replies": [
                        {
                          "id": "myxwlah",
                          "author": "sosthaboss",
                          "body": "I didn’t have it, didn’t pay for it. It was years after I bought too, well after any built in warranty or care. You’re just wrong.",
                          "score": 3,
                          "created_utc": 1750483601.0,
                          "replies": [
                            {
                              "id": "myyi31t",
                              "author": "chriscwjd",
                              "body": "You wouldn't typically get a free repair for drop damage, I expect you would think differently had you been charged the market rate.\n\nAlso you lectured artguy55 on taking care their electronics having just told us you dropped yours on the floor, which is amusing.",
                              "score": 3,
                              "created_utc": 1750496120.0,
                              "replies": [
                                {
                                  "id": "mz0bd38",
                                  "author": "sosthaboss",
                                  "body": "One drop in 8 years is pretty good? \n\nAnd they were implying Apple laptops break easily on their own all the time, which they simply don’t. \n\nAnd I know I wouldn’t normally get it for free, my point is that even when the damage is the users fault Apple still doesn’t always charge you. So his point about high repair costs is stupid. They rarely break.",
                                  "score": 2,
                                  "created_utc": 1750523359.0,
                                  "replies": [
                                    {
                                      "id": "mzjjhed",
                                      "author": "BreakfastTypical1434",
                                      "body": "I have a friend who works at a middle school with macbooks. I think he would disagree. He is a always telling me how they break constantly from random hardware failures, to cracked screens, to issues with needing to be reset. I mean it sounds like you were the exception not the rule. Also use case varies, but apple is a top of the line product for a reason I think their apple care is a consistent thing most people pay for.",
                                      "score": 1,
                                      "created_utc": 1750784204.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mz0piyn",
                                      "author": "Coballz",
                                      "body": "Dropping your laptop is never \"pretty good\" lol",
                                      "score": -1,
                                      "created_utc": 1750527771.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "myu4122",
      "author": "vgamedude",
      "body": "One of the biggest things about these frameworks too is that upgrading the CPU is too pricey. The motherboard components are so expensive you start to just wonder if you can price out a brand new machine.\n\nI like their goals but realistically it just makes no sense for me to consider their product.",
      "score": 2,
      "created_utc": 1750436696.0,
      "replies": []
    },
    {
      "id": "mzqd7w3",
      "author": "boutell",
      "body": "I was excited until I got to \"don't use it in your lap\" and \"poor battery life.\" Well, shoot. I want to be an early adopter and support it, but using it in my lap without plugging in for hours on end is my whole jam.\n\nI will say though that the processor power is above average for the size. Probably also why it needs a fan and runs through the battery!\n\nI'm not the target audience. I'm a developer who prefers a tiny personal machine when he's not using the overpowered mac m3.",
      "score": 1,
      "created_utc": 1750872214.0,
      "replies": []
    }
  ]
}