{
  "post": {
    "title": "Nvidia announces end of GPU driver updates for GeForce 10-series, Windows 10 | Nvidia will cover gamers who take advantage of Windows 10's extended updates.",
    "author": "chrisdh79",
    "id": "1me9xak",
    "score": 559,
    "created_utc": 1753987730.0,
    "selftext": "",
    "num_comments": 82,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1me9xak/nvidia_announces_end_of_gpu_driver_updates_for/"
  },
  "comments": [
    {
      "id": "n67q5ly",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753987730.0,
      "replies": []
    },
    {
      "id": "n67tka8",
      "author": "CMDR_omnicognate",
      "body": "Eh, almost 10 years of support doesn’t seem all that surprising to me. Only really an issue because they don’t really have any compelling current GPU’s lol",
      "score": 240,
      "created_utc": 1753988697.0,
      "replies": [
        {
          "id": "n67y70b",
          "author": "imaginary_num6er",
          "body": "Better than AMD that killed driver support for Vega while launching new Vega APUs within the same year",
          "score": 67,
          "created_utc": 1753990048.0,
          "replies": [
            {
              "id": "n68fx04",
              "author": "Loeffellux",
              "body": "I know it's an incredibly unpopular sentiment but as someone who doesn't regularly upgrade it was incredibly frustrating to not be able to play certain games not because the card wasn't good enough but because it lacked the driver support. There were even man-made drivers from Russia that you could download if you were brave enough.\n\nEdit: *fan-made drivers",
              "score": 46,
              "created_utc": 1753995108.0,
              "replies": [
                {
                  "id": "n699vns",
                  "author": "ShinyGrezz",
                  "body": "“man-made drivers”\n\nDo AMD drivers usually arise in nature?",
                  "score": 51,
                  "created_utc": 1754004433.0,
                  "replies": [
                    {
                      "id": "n69lex8",
                      "author": "lew_rong",
                      "body": "Life, uh, finds a way.",
                      "score": 32,
                      "created_utc": 1754008412.0,
                      "replies": []
                    },
                    {
                      "id": "n6a9w6c",
                      "author": "dark_sylinc",
                      "body": "AMD (and Intel) publishes full manuals on how their HW functions with extensive documentation. On Linux, drivers are open source. For some of the driver flavours (there are several) some of that code is shared between Windows and Linux (the [PAL](https://github.com/GPUOpen-Drivers/pal))\n\nThis makes modifying their existing Windows drivers much easier since they're not a black box (although they're still binary blobs).\n\nThis is also why the SteamDeck works so well. Valve has made several contributions to AMD drivers on Linux to make it work flawlessly on their (battery-constrained) console.\n\nTo be honest, AMD Linux drivers are much better than Windows.",
                      "score": 11,
                      "created_utc": 1754017368.0,
                      "replies": [
                        {
                          "id": "n6aaw4n",
                          "author": "ShinyGrezz",
                          "body": "I do understand, I just found the premise of driver abiogenesis to be funny.",
                          "score": 14,
                          "created_utc": 1754017766.0,
                          "replies": [
                            {
                              "id": "n6ab713",
                              "author": "dark_sylinc",
                              "body": "Well, when an open source developer and an AMD employee love each other too much...",
                              "score": 7,
                              "created_utc": 1754017888.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n6er39p",
                          "author": "James-Cooper123",
                          "body": "So basically they said, \"heres the schematics for it, go figure\"",
                          "score": 1,
                          "created_utc": 1754078499.0,
                          "replies": [
                            {
                              "id": "n6eu26j",
                              "author": "dark_sylinc",
                              "body": "Better than \"we're not telling anything, figure it out blind\"\nAnd way much better than \"oh you figured out how it works? We're locking you out of that via encryption\" (which is what NV does).",
                              "score": -1,
                              "created_utc": 1754079387.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n69f839",
                      "author": "chellis",
                      "body": "Sometimes you hope so with the driver betas they release as official updates.",
                      "score": 1,
                      "created_utc": 1754006257.0,
                      "replies": []
                    },
                    {
                      "id": "n69oywk",
                      "author": "harmonicrain",
                      "body": "Just windows ones. the man made ones are Linux drivers /s",
                      "score": 1,
                      "created_utc": 1754009653.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n68skme",
          "author": "Brisslayer333",
          "body": "The apostrophe isn't possessive, you're just trying to pluralize ",
          "score": 10,
          "created_utc": 1753998883.0,
          "replies": [
            {
              "id": "n68yhb7",
              "author": "CMDR_omnicognate",
              "body": "it's the GPU's laugh, they're allowed to sometimes",
              "score": 9,
              "created_utc": 1754000693.0,
              "replies": [
                {
                  "id": "n68za53",
                  "author": "Brisslayer333",
                  "body": "Shit, my bad",
                  "score": 2,
                  "created_utc": 1754000945.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n67v8c5",
          "author": "kirsion",
          "body": "5070 and 5070 ti are selling at msrp, I got one it's good",
          "score": 2,
          "created_utc": 1753989183.0,
          "replies": [
            {
              "id": "n6czrdo",
              "author": "GrayDaysGoAway",
              "body": "They're good cards, yeah. Problem is even at MSRP the prices still fucking SUCK.",
              "score": 7,
              "created_utc": 1754060187.0,
              "replies": []
            },
            {
              "id": "n68g3em",
              "author": "imaginary_num6er",
              "body": "Even the 5060Ti 8GB that’s a polished turd is good compared to the competition",
              "score": -15,
              "created_utc": 1753995158.0,
              "replies": [
                {
                  "id": "n69gu8s",
                  "author": "Ok-Community-4673",
                  "body": "Anything below the 70 is e-waste. 70 for budget, 80 for normal, 90 for ballers. Anything else and you’re just buying something for the sake of buying something.",
                  "score": -2,
                  "created_utc": 1754006819.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n6fatkc",
          "author": "FuzzyWuzzyHadNoBear",
          "body": "idk man, my 4090 is doing pretty well",
          "score": 0,
          "created_utc": 1754084489.0,
          "replies": [
            {
              "id": "n6ietjj",
              "author": "CMDR_omnicognate",
              "body": "Damn, and it hasn't caught on fire yet?",
              "score": 0,
              "created_utc": 1754134565.0,
              "replies": [
                {
                  "id": "n6imq8x",
                  "author": "FuzzyWuzzyHadNoBear",
                  "body": "lol no? they fix that connector issue a long time ago, where you been bro",
                  "score": 1,
                  "created_utc": 1754137980.0,
                  "replies": [
                    {
                      "id": "n6iscn9",
                      "author": "CMDR_omnicognate",
                      "body": "\"fixed\" [lol](https://www.youtube.com/watch?v=Ndmoi1s0ZaY&t)",
                      "score": -1,
                      "created_utc": 1754140202.0,
                      "replies": [
                        {
                          "id": "n6jzvlf",
                          "author": "FuzzyWuzzyHadNoBear",
                          "body": "can you read? i said i have a 4090.",
                          "score": 1,
                          "created_utc": 1754154608.0,
                          "replies": [
                            {
                              "id": "n6k5t31",
                              "author": "CMDR_omnicognate",
                              "body": "\"fixed\" [lol](https://www.youtube.com/watch?v=8-Rmv2rEHc0)",
                              "score": -1,
                              "created_utc": 1754156422.0,
                              "replies": [
                                {
                                  "id": "n6k8ddl",
                                  "author": "FuzzyWuzzyHadNoBear",
                                  "body": "if you watch the video you’d know that he’s working on the older version of the 4090 without the elongated pins. i have the upgraded H++ and it’s in perfect condition for the past year. but that’s okay you can just cry “nvidia bad” and i’ll continue having a monster of a PC 😎",
                                  "score": 0,
                                  "created_utc": 1754157221.0,
                                  "replies": [
                                    {
                                      "id": "n6lx2vf",
                                      "author": "Gaeus_",
                                      "body": "Man what a sad world we live in to have someone being smug over a $2000 piece of electronic (hopefully) not being a fire hazard.",
                                      "score": 0,
                                      "created_utc": 1754177707.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n682f8f",
      "author": "spdrman8",
      "body": "Imma run my 1080TI and my windows 10 until one of them die.",
      "score": 92,
      "created_utc": 1753991293.0,
      "replies": [
        {
          "id": "n68f7mg",
          "author": "cattywampus42",
          "body": "Windows 11 is trash. I’d rather switch to Linux than update from 10",
          "score": 12,
          "created_utc": 1753994906.0,
          "replies": [
            {
              "id": "n68l13s",
              "author": "Doomchick",
              "body": "What makes it bad?",
              "score": 15,
              "created_utc": 1753996593.0,
              "replies": [
                {
                  "id": "n68p7rf",
                  "author": "kryst4line",
                  "body": "You could say bugs (lots of them), forced AI integration everywhere (notepad? paintbrush? gosh), ads integrated in the OS too, reduced customization and of course a classic for Windows: you don't ever know if you'll find a dialog from Windows 8, Vista or Windows 95/98. Free roulette!\n\nI'm mad there's no proper alternatives for my use case: Linux is a constant battle against itself (I've been using it for 15-20 years so I know what I'm talking about, not to talk about Nvidia drivers or software support for specialized applications) and can't install MacOS or justify getting one because I already have a very good PC. 💔",
                  "score": 37,
                  "created_utc": 1753997842.0,
                  "replies": [
                    {
                      "id": "n6b30ne",
                      "author": "Jimmy_cracked_corn",
                      "body": "You need to check out Chris Titus Tech on YT. He’s created a Powershell utility that debloats Windows and much more. \n\n[The Perfect Windows 11 Install](https://youtu.be/6UQZ5oQg8XA?si=Yk7ZDogIjeqmAcJK)\n\nSince learning about him, I’ve debloated and de-shittified a copy of my Win11 ISO and it’s been great",
                      "score": 9,
                      "created_utc": 1754031078.0,
                      "replies": [
                        {
                          "id": "n6d3dze",
                          "author": "Pauly_Amorous",
                          "body": "> He’s created a Powershell utility that debloats Windows and much more. \n\nJust a caveat to anyone who runs across this... be careful running scripts written by random assholes on the Internet, unless you know exactly what they're doing. Even assuming the person is trustworthy and the script does what it's supposed to, Microsoft has a way of breaking these things with Windows updates that could crater your system in unexpected ways.\n\nSource: Personal experience and learning the hard way.",
                          "score": 6,
                          "created_utc": 1754061221.0,
                          "replies": []
                        },
                        {
                          "id": "n6b3qwu",
                          "author": "kryst4line",
                          "body": "I know it! But Windows 11's issues are way more endemic than what can be trustfully fixed with a patch like this. 💔",
                          "score": 4,
                          "created_utc": 1754031474.0,
                          "replies": [
                            {
                              "id": "n6b4arx",
                              "author": "Jimmy_cracked_corn",
                              "body": "Well, this isn’t “a patch”, but if it doesn’t work for you, 👍🏼",
                              "score": 0,
                              "created_utc": 1754031774.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n68pvdv",
                      "author": "cattywampus42",
                      "body": "Right. I don’t want to move to Linux, I’ve used it plenty before and it’s a nightmare. But I can’t stand the enshitification of windows. And I just game on my home pc. Mac is no good. I’m almost at the point where’d I’d switch back to console",
                      "score": 13,
                      "created_utc": 1753998044.0,
                      "replies": [
                        {
                          "id": "n6amfpw",
                          "author": "super9mega",
                          "body": "If everyone switched to Linux today, then before the end of next year, every major game would either die or support it. Even 25% on Linux would basically be enough to make Linux support mandatory.\n\nBut 25% likely will never happen though",
                          "score": 4,
                          "created_utc": 1754022681.0,
                          "replies": [
                            {
                              "id": "n6b6um9",
                              "author": "Karsdegrote",
                              "body": "The problem for me is not games really. I run cad programs on my pc which are almost universally designed for windows. Its a faff to get it going on linux with all my scaffolding and duct tape i have bodged againt it.\n\n\nYou could argue \"switch to freecad/kicad\" but alass, this is what we use at work and switching all that infrastructure over is not done.",
                              "score": 8,
                              "created_utc": 1754033187.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "n68saot",
                          "author": "kryst4line",
                          "body": "I never was a only-console player, started on PC even before I had my gameboy and I appreciate my ultrawide high-res/fps setup unthinkable on console - and even though I'm with you about Windows' enshittification (if it only was Windows...) I still use my PC for video production (fuck adobe), programming and nerd stuff in general 💀💀",
                          "score": 3,
                          "created_utc": 1753998798.0,
                          "replies": [
                            {
                              "id": "n68tnq0",
                              "author": "cattywampus42",
                              "body": "There’s no good option anymore. Tech has just gotten worse. I don’t know if I can give up playing at 100+ fps on an ultra wide but nothing ever just *works*. Audio in discord won’t work, or there’s some stupid driver issue. It needs to update. Buddha said today is not a gaming day. Why can’t I just put a disc in and boot up the game. How did we let them get away with this. We had it all",
                              "score": 9,
                              "created_utc": 1753999208.0,
                              "replies": [
                                {
                                  "id": "n68w30q",
                                  "author": "kryst4line",
                                  "body": "Tell me about it, okay that Rocket League is broken to the bones, spaghetti code and nobody at the wheel (heh) currently, but I spent a whole week last year formatting daily (and reinstalling the whole work environment to work the next monday) trying to find why I had regular microstutters. W10, W11... It didn't matter. In the end I could notice an occassional usb disconnection sound and after using a tool to snipe usb connections it turned out to be fucking's Elgato Camlink having some kind of conflict with Windows. After disconnecting it, everything went back to normal. I was so damn furious when I discovered the cause HAHAHA but that's life nowadays, or you're a stubborn power user or you're fucked if there's any issue of this kind 🤡",
                                  "score": 3,
                                  "created_utc": 1753999942.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n6gurv7",
                  "author": "FaveDave85",
                  "body": "Can't move the task bar",
                  "score": 1,
                  "created_utc": 1754104650.0,
                  "replies": []
                },
                {
                  "id": "n6iw9wr",
                  "author": "TabaRafael",
                  "body": "Funny enough, apart from everything you will find people talking about, my killer feature is that the main menu search works\n\n\nYou can just type any setting or program and it will bring it to you instead of opening a fking browser search",
                  "score": 1,
                  "created_utc": 1754141663.0,
                  "replies": []
                },
                {
                  "id": "n68pj7f",
                  "author": "cattywampus42",
                  "body": "They moved the start button. \n\nInb4: yOu cAn cHanGe iT bAck",
                  "score": -15,
                  "created_utc": 1753997940.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n6ivtsy",
              "author": "TabaRafael",
              "body": "I switched to nobara earlier this year and the only issue I've had was these companion apps for my mouse and my gamepad, so I had to configure them in a windows VM. Also, there is no wallpaper engine 🥲\n\n\n\n\nOther than that, games are running much better on ge-proton, and everything in general runs much smoother\n\n\n\n\nGranted, I'm used to unix from working daily on a macbook, mostly on industrial linux distros like alpine. My windows pc was only for gaming.",
              "score": 2,
              "created_utc": 1754141500.0,
              "replies": [
                {
                  "id": "n6k5xs8",
                  "author": "cattywampus42",
                  "body": "Games really run smoother? That may me to get the jump. I’m pretty os agnostic.",
                  "score": 1,
                  "created_utc": 1754156462.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n68sqv1",
              "author": "Brisslayer333",
              "body": "Then do it. I'm switching to Linux next time AMD releases new cards. ",
              "score": 1,
              "created_utc": 1753998936.0,
              "replies": [
                {
                  "id": "n68uelh",
                  "author": "makemeking706",
                  "body": "Not op, but I am going to upgrade to Linux as soon as Windows forces my hand. I am still running a 1080ti, so I plan to hop on AMD just like you. ",
                  "score": 2,
                  "created_utc": 1753999427.0,
                  "replies": [
                    {
                      "id": "n68ym2b",
                      "author": "cattywampus42",
                      "body": "Gonna hold onto windows 10 as long as possible then make the jump",
                      "score": 1,
                      "created_utc": 1754000733.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n693y56",
          "author": "adaminc",
          "body": "Same here, except a 970!",
          "score": 1,
          "created_utc": 1754002461.0,
          "replies": []
        },
        {
          "id": "n68u1j8",
          "author": "makemeking706",
          "body": "My man. Same here. ",
          "score": 0,
          "created_utc": 1753999319.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n68i0c4",
      "author": "EXSource",
      "body": "That's an end of a era moment if there ever was one for graphics cards.\n\n10 series cards were amazing cards. 1080 bros in shambles right now.",
      "score": 29,
      "created_utc": 1753995701.0,
      "replies": []
    },
    {
      "id": "n6845pj",
      "author": "hipnotyq",
      "body": "My GFs PC has my old 1080 in it. She only plays the Sims 4 so this doesn't really bug me.",
      "score": 21,
      "created_utc": 1753991789.0,
      "replies": [
        {
          "id": "n6al20c",
          "author": "IM_OK_AMA",
          "body": "My wife's PC has a 1070 and I was astonished that not only does AC Shadows run... it runs pretty good???\n\nWe'll never have another generation like that.\n\nI guess I have to upgrade it now though.",
          "score": 7,
          "created_utc": 1754022058.0,
          "replies": [
            {
              "id": "n6azusk",
              "author": "Xendrus",
              "body": "I mean, no reason if the performance is okay, it's not like when they end support the gpu blows up, they just won't make any new drivers. Just keep using the last ones, should be fine.",
              "score": 6,
              "created_utc": 1754029350.0,
              "replies": []
            },
            {
              "id": "n6bmjg3",
              "author": "jayfactor",
              "body": "I got E33 as a joke thinking the 1080 couldn't run it, really impressed me",
              "score": 1,
              "created_utc": 1754042059.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n6c2qn4",
          "author": "CorruptPhoenix",
          "body": "The gtx1080 still runs most modern games at 1080p 60fps.",
          "score": 2,
          "created_utc": 1754049573.0,
          "replies": []
        },
        {
          "id": "n68brxt",
          "author": "lan-dog",
          "body": "haha i’m in the same situation",
          "score": 0,
          "created_utc": 1753993946.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6b42kt",
      "author": "LacusClyne",
      "body": "I can only speak for myself still running a 1080 but that's fine, I've long accepted that it has run its course even if it still performs admirably in a lot of usage cases... especially since I don't care about RTX, higher than 60fps or playing anything 'new'ish. The last time I updated my drivers was a long time ago and it's not like games will suddenly 'break' if I don't, everything I want use it for still works and that probably wont change... it has been a great card and at this point I expect I'll be using it until it breaks.",
      "score": 5,
      "created_utc": 1754031650.0,
      "replies": [
        {
          "id": "n6bmphx",
          "author": "jayfactor",
          "body": "Same, can't remember the last time I updated my drivers, ran E33 really well a few months back, and I don't expect any new graphically intense game capturing my attention any time soon so I'll be good for at least another 5 years lol",
          "score": 1,
          "created_utc": 1754042149.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n68kf9s",
      "author": "karateninjazombie",
      "body": "Well shit. \n\nShow I actually have to get something newer because this will force my hand at some point. Rip my bank acct.",
      "score": 3,
      "created_utc": 1753996413.0,
      "replies": [
        {
          "id": "n6913v3",
          "author": "Justwafflesisfine",
          "body": "Amd new 9000 series is pretty good.\n9060XT 16gb is fairly budget friendly.",
          "score": 8,
          "created_utc": 1754001534.0,
          "replies": []
        },
        {
          "id": "n6iqqrt",
          "author": "Noxious89123",
          "body": "The cards will still work just fine, you just won't get new driver updates.",
          "score": 1,
          "created_utc": 1754139579.0,
          "replies": []
        },
        {
          "id": "n6agisw",
          "author": "Riegel_Haribo",
          "body": "I finally got off Windows 7 on my primary system because the A-holes at Microsoft stopped signing any drivers for it. Then had to move thousands in hardware peripherals over to a cloned machine where the manufacturer dropped the ball on Windows 10 and even worse on Windows 11.\n\nWindows 11 is just a shit-serving platform where Microsoft has root.",
          "score": 2,
          "created_utc": 1754020095.0,
          "replies": [
            {
              "id": "n6ahg5g",
              "author": "karateninjazombie",
              "body": "You should have gotten off 7 when Microsoft stopped supporting it. \n\nAs for your vendor. Beat them with the legal stick till they fix it. \n\n10 is o.k now. But wasn't for years. You're not wrong on 11 however. This is why I now game off Linux. I also haven't worked in IT directly for a decade. So that shits someone else's problem now 😎",
              "score": 0,
              "created_utc": 1754020490.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n6hle39",
      "author": "itsref",
      "body": "Dang. My 1080 is still running strong since 2016.",
      "score": 2,
      "created_utc": 1754117713.0,
      "replies": []
    },
    {
      "id": "n6a0p6l",
      "author": "WildWeaselGT",
      "body": "Wait… so they’re still coding the updates but you can’t have them unless you pay… Microsoft??\n\nDo they get a cut of that money for providing support?",
      "score": 3,
      "created_utc": 1754013902.0,
      "replies": [
        {
          "id": "n6atoh1",
          "author": "Ghozer",
          "body": "No, you obv didn't read the article, it says right in there you can opt for an additional year of support FREE...\n\nsee : https://arstechnica.com/gadgets/2025/07/how-to-get-another-free-year-of-updates-for-your-windows-10-pc/",
          "score": 8,
          "created_utc": 1754026152.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6chevb",
      "author": "Memphisrexjr",
      "body": "Time to start writing a eulogy for my 1080ti.",
      "score": 1,
      "created_utc": 1754054710.0,
      "replies": []
    },
    {
      "id": "n6axbec",
      "author": "naman1901",
      "body": "End of support for my 2017 Dell Inspiron that's now my parents' home computer. Good run, old friend!",
      "score": 0,
      "created_utc": 1754028009.0,
      "replies": []
    },
    {
      "id": "n67s7j4",
      "author": "Pineapple_Assrape",
      "body": "Huh the greedy fucks. At their prices they should support this shit until the year 2800.",
      "score": -38,
      "created_utc": 1753988308.0,
      "replies": [
        {
          "id": "n67wwj1",
          "author": "yayitsdan",
          "body": "I think 10 years is pretty reasonable for support. It’s not like these gpus suddenly stop working.",
          "score": 25,
          "created_utc": 1753989672.0,
          "replies": []
        },
        {
          "id": "n67wayp",
          "author": "WFlumin8",
          "body": "Do you want them to personally patch Windows 10 as well since they have so much money?",
          "score": 7,
          "created_utc": 1753989498.0,
          "replies": [
            {
              "id": "n68sx62",
              "author": "Brisslayer333",
              "body": "I mean, since they have so much money... ",
              "score": 5,
              "created_utc": 1753998991.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n67u5tu",
          "author": "Moscato359",
          "body": "Are you going to pay them to do that?",
          "score": -1,
          "created_utc": 1753988872.0,
          "replies": []
        },
        {
          "id": "n69fp1x",
          "author": "Bluegatorator",
          "body": "i'll help you understand how a business works. There is little to no incentive for them to spend money supporting a product no one buys and doesnt work with the current graphical demands of the present. hope this helps",
          "score": 1,
          "created_utc": 1754006420.0,
          "replies": [
            {
              "id": "n6b03vw",
              "author": "Xendrus",
              "body": "The \"little\" is that I as a future customer see they provided 10 years of support when deciding which brand to buy. And 10 years seems really damn good to me. Who the hell uses the same PC for 10 years? That's insane unless you're someone's grandma playing solitare. dudes delusional lol",
              "score": 1,
              "created_utc": 1754029486.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n68tbn9",
          "author": "Immediate-Worry-1090",
          "body": "I think you annoyed some of nvidias fuck buddies",
          "score": 0,
          "created_utc": 1753999109.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n69vsgo",
      "author": "humanman42",
      "body": "damn. I can't afford to upgrade to a 20/30/40/50 series. anyone have a cheap used card? haha...fml",
      "score": -6,
      "created_utc": 1754012114.0,
      "replies": []
    }
  ]
}