{
  "post": {
    "title": "Apple Vision Pro 2 Reportedly Cheaper & Lighter, Mac-Tethered Headset Coming Too",
    "author": "DarthBuzzard",
    "id": "1jyxic1",
    "score": 1159,
    "created_utc": 1744633342.0,
    "selftext": "",
    "num_comments": 284,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jyxic1/apple_vision_pro_2_reportedly_cheaper_lighter/"
  },
  "comments": [
    {
      "id": "mn1tmjw",
      "author": "Tenchi2020",
      "body": "Cheaper... just in time for the tariffs",
      "score": 394,
      "created_utc": 1744633428.0,
      "replies": [
        {
          "id": "mn1u9gz",
          "author": "BearsGotKhalilMack",
          "body": "That is a really good point. I can't imagine someone strapped for cash justifying something as frivolous as a brand new VR device for themselves. Then again, though, I guess not everyone is poor through bad luck.",
          "score": 91,
          "created_utc": 1744633687.0,
          "replies": [
            {
              "id": "mn1zexs",
              "author": "What-a-Crock",
              "body": "Apple isn’t targeting the strapped for cash demographic",
              "score": 53,
              "created_utc": 1744635698.0,
              "replies": [
                {
                  "id": "mn40628",
                  "author": "Juswantedtono",
                  "body": "You can say that about something like the Mac Pro (with the $1,000 stand), but they absolutely want this headset to be a mainstream fixture",
                  "score": 8,
                  "created_utc": 1744658148.0,
                  "replies": []
                },
                {
                  "id": "mn29vy7",
                  "author": "CatPhysicist",
                  "body": "Not usually a good business strategy to target the strapped for cash demographic… unless you’re a payday lender or a bank.",
                  "score": 15,
                  "created_utc": 1744639382.0,
                  "replies": [
                    {
                      "id": "mn3q2oq",
                      "author": "antpile11",
                      "body": "It can be in that it lets you reach an otherwise untapped demographic, like that's how MVNOs operate. See /r/NoContract",
                      "score": 2,
                      "created_utc": 1744655092.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mn47gu6",
                  "author": "prigmutton",
                  "body": "But it's such a fast growing demo!",
                  "score": 7,
                  "created_utc": 1744660389.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn28uxa",
              "author": "FromTralfamadore",
              "body": "Gotta distract ourselves from reality somehow. Ready Player One?",
              "score": 3,
              "created_utc": 1744639044.0,
              "replies": []
            },
            {
              "id": "mn2p9ul",
              "author": "FlyingBishop",
              "body": "I mean, if $3000 is going to be a month's groceries in 5 years, why bother keeping $100k in savings when you could buy some really nice electronics that will probably still be useful in 5 years.",
              "score": 0,
              "created_utc": 1744644193.0,
              "replies": [
                {
                  "id": "mn30s54",
                  "author": "theincredible92",
                  "body": "Because you can’t eat metal and electronics ?",
                  "score": 11,
                  "created_utc": 1744647652.0,
                  "replies": [
                    {
                      "id": "mn3cp16",
                      "author": "FlyingBishop",
                      "body": "Because that headset will be worth more dollars adjusting for 1000% inflation. $3000 can probably buy you 5 years of groceries that won't spoil, so do that too but most of that $100k is just going to be worthless if you don't spend it now.",
                      "score": -2,
                      "created_utc": 1744651206.0,
                      "replies": [
                        {
                          "id": "mn7cu1l",
                          "author": "Warm_Wash5324",
                          "body": "You're a few credits short of an economics degree",
                          "score": 1,
                          "created_utc": 1744707578.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn4ul4h",
              "author": "alidan",
              "body": "Personally, I have monitor failure with the backlight, mine has around 60-70 dimming zones, and any number of them dim/turn off after 20 or so minutes of turning it on, still useable but very noticeable. I am having a hard time justifying a like for like side grade (800$) over just getting a big screen beyond 2.\n\nthis is one of those things people who haven't tried using vr as a display, or even modern vr in generally can't wrap their heads around, they are VERY capable of replacing monitors, in the case of bsb, it would hit around 100-150 nits at max, with a normal limit of 70~ nits, and reviewer's who didn't know ahead of time had no idea it wasn't hdr, for me to get the same class of monitor as that costs around 1500-3000$ and because it would be static instead of constantly shifting pixels (like with a hmd and you shifting your body slightly all the time) burn in will happen regardless of what you get, but it would take a hell of alot longer with a dim/far less heat producing oled in a light controlled environment.\n\nnow, keep i mind, if apple vision can math the quality of their reference monitor, at least image quality wise, they can produce it for cheaper, sell it cheaper, and expand the ecosystems.\n\nand this is the major thing people don't understand because of current vr reporting, the first company that gets mass adoption will add several trillion to their market cap, people with any amount of future vision see it for what it is, they just cant predict when, facebook is trying as hard as possible to brute force it, I would argue bsb is already there but the buy in cost is a hard swallow for someone who is new. \n\nI honestly believe the thing that would sell people on vr more than anything else, would be a 2 person demo, one person is across the store, and you are seated on a ok couch in an otherwise crappy apartment, put the vr on and you have 3 modes, full pass through, well furnished apartment, and theater mode, and your friend is right next to you. watch the same show, movie, or hell just play a game with each other, that would be what sells it for normal people to make it their everyday life thing. \n\nthink of it this way, at 1/3 or less the cost of a high end tv, you can get better than a high end tv, and that's just current pricing, realistically, we will hit a point where optics are at their peak and you can't really get better, we are already kind of there where people with access to pimax 8k and bsb2 choose bsb2 over pimax even though pimax is objectively better on all other specs, because how good the optics are in bsb2, at that point the panels are just a module, see pimax as an example of that, where the upgrade comes from a new module, and at that point you are talking about 2 1 inch displays, you may not know this but most of the cost for a display is all in the fact you can only get so many of them off one sheet of motherglass, you would get around 1300 displays, or 650 sets of vr displays in a sings 800$ 55 inch motherglass space. if we hit the point that vr is everywhere, the prices for certain aspects for them will become a 1 time cost, and then crashing for everything else to become a commodity.",
              "score": -1,
              "created_utc": 1744667559.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn2aaz6",
          "author": "BagNo2988",
          "body": "The first one was good but can’t really justify it over the quest",
          "score": 5,
          "created_utc": 1744639520.0,
          "replies": [
            {
              "id": "mn2gsgq",
              "author": "None",
              "body": "[removed]",
              "score": 11,
              "created_utc": 1744641590.0,
              "replies": [
                {
                  "id": "mn309o7",
                  "author": "BagNo2988",
                  "body": "Tried the vision on the demo. Other than the eye tracking and see though and hand gestures, couldn’t really see how anyone would prefer it over the quest considering the price. It could do almost everything the vision does.",
                  "score": 3,
                  "created_utc": 1744647497.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn3s6a3",
              "author": "IchBinMalade",
              "body": "I tried it and honestly I couldn't imagine using it for productivity, but for entertainment, holy shit, game changer. Too bad it's so expensive.",
              "score": 2,
              "created_utc": 1744655716.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn22qd6",
          "author": "Abigail716",
          "body": "It looks like electronics are going to be exempt from tariffs. So your iPhone won't face a tariff, but your pharmaceuticals will.",
          "score": -6,
          "created_utc": 1744636919.0,
          "replies": [
            {
              "id": "mn231cj",
              "author": "Tenchi2020",
              "body": "[They just backtrack on that](https://www.eurogamer.net/trump-appears-to-backtrack-on-us-electronics-tariff-exceptions-but-no-one-seems-to-know-exactly-whats-going-on)",
              "score": 32,
              "created_utc": 1744637030.0,
              "replies": [
                {
                  "id": "mn290vt",
                  "author": "flyingtiger188",
                  "body": "2nd half of 2025 release. With Trump manipulating the market with tariff flip flops on a daily basis, there's no way to predict the effect a week from now, let alone 6 months from now.",
                  "score": 8,
                  "created_utc": 1744639098.0,
                  "replies": [
                    {
                      "id": "mn2hfuv",
                      "author": "None",
                      "body": "[removed]",
                      "score": 3,
                      "created_utc": 1744641792.0,
                      "replies": [
                        {
                          "id": "mn2le4o",
                          "author": "SoapyMacNCheese",
                          "body": "> how tf are companies supposed to plan around this stuff lol\n\nThey can't. I work with some factories overseas regularly, tons of US companies have paused their production orders because they hope to wait out this tariff fight because no one wants to be left holding the bag when they import goods at +145% tariff just for the tariff to go away before they've sold them.\n\nExpect shortages on tons of goods in addition to the price hikes. And I'm sure tons of new gadgets in active development are getting delayed or shelved until the landscape is more predictable.",
                          "score": 5,
                          "created_utc": 1744643007.0,
                          "replies": []
                        },
                        {
                          "id": "mn3x0em",
                          "author": "murrtrip",
                          "body": "It's supposed to be chais. Trump wants all business \"deals\" to avoid tariffs to go through him, so he can personally prosper. He controls the taxes (tariffs) now and gives income tax breaks to the rich.",
                          "score": 2,
                          "created_utc": 1744657182.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn2a0vc",
              "author": "Kindness_of_cats",
              "body": "Apparently they’re just in a different tariff “bucket.”  Or there was no exemption made at all on Friday, according to Trump.\n\nWho fucking knows.  Besides that, Tariffs outside of China are currently only paused—not gone.  And 10% tariffs are still a thing.",
              "score": 2,
              "created_utc": 1744639427.0,
              "replies": []
            },
            {
              "id": "mn26tjk",
              "author": "ImjustANewSneaker",
              "body": "Even then the costs of everything else rising makes it even more frivolous",
              "score": 1,
              "created_utc": 1744638365.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn1w824",
      "author": "hopskipjumprun",
      "body": ">If Gurman's new reporting is accurate, it sounds like Tim Cook will stop at nothing to ensure that Apple, not Meta, will deliver the new \"iPhone moment\" that the introduction of appealing true AR glasses could be.\n\nCan this tech really have an \"iPhone moment\" that gets the masses on board? \n\nI can see some companies adopting it but what can it deliver to the average person in a more convenient form than they already have devices for? Genuinely curious about it because reviews of the first Vision Pro seemed neat but leaned closer to novelty, rather than something I could see myself using long term.",
      "score": 109,
      "created_utc": 1744634478.0,
      "replies": [
        {
          "id": "mn1wxpq",
          "author": "Cartire2",
          "body": "Need that killer app. It’s the one major issue with the first one. Novelty is the correct term. It’s neat, but nothing in my life is improved with it. No app is improved or better within the vision.",
          "score": 73,
          "created_utc": 1744634759.0,
          "replies": [
            {
              "id": "mn22ric",
              "author": "Dillweed999",
              "body": "I think the thing that everyone wants is just a giant AR screen they catch watch shows/movies or use in place of a second screen on a laptop.  Sort of headphones for your eyes.  Problem is the meta headsets do that at like a 1/3 of the cost of the gen1 Vision Pro.",
              "score": 35,
              "created_utc": 1744636931.0,
              "replies": [
                {
                  "id": "mn2ivm7",
                  "author": "Useful44723",
                  "body": "Its 1/5 of the cost vs the Quest 3\n\n$499 vs $3499\n\nEdit: I cant maff. It is 1/7 ofcourse.",
                  "score": 19,
                  "created_utc": 1744642235.0,
                  "replies": [
                    {
                      "id": "mn38fkd",
                      "author": "Calvin1991",
                      "body": "That is 1/7th",
                      "score": 8,
                      "created_utc": 1744649942.0,
                      "replies": [
                        {
                          "id": "mn7eeb4",
                          "author": "Useful44723",
                          "body": "Thx",
                          "score": 1,
                          "created_utc": 1744708614.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mn2kc65",
                      "author": "codywater",
                      "body": "But, seamless integration in the Mac ecosystem is a huge plus. More like a $100 plus, definitely not a $3,000 plus.",
                      "score": 6,
                      "created_utc": 1744642682.0,
                      "replies": [
                        {
                          "id": "mn2oojw",
                          "author": "Useful44723",
                          "body": "For some that probably can be cool for sure. \n\nBut that price is a thing of its own. Even if it had even more features I would not buy it. I know that I would drop it and the warranty would cover my $2000 repair bill.\n\nIt has happened before with other stuff.",
                          "score": 3,
                          "created_utc": 1744644011.0,
                          "replies": [
                            {
                              "id": "mn3rg8d",
                              "author": "Trixles",
                              "body": "Anything beyond $1000 is pretty much a no-starter for most Americans. And couple that with the fact that it doesn't really do anything you can't already accomplish for much cheaper. Pretty much dead in the water until they can get it <$1000.",
                              "score": 7,
                              "created_utc": 1744655499.0,
                              "replies": [
                                {
                                  "id": "mn7rmua",
                                  "author": "_RADIANTSUN_",
                                  "body": "Yeah, above a grand is where people start financing. Even the high end iPhone price points would not be possible without carrier contracts.",
                                  "score": 2,
                                  "created_utc": 1744716148.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mn6q3qi",
                          "author": "CosmicCreeperz",
                          "body": "Would be if the Mac ecosystem actually had a reasonable number of decent VR apps.",
                          "score": 3,
                          "created_utc": 1744693467.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn6pz5x",
                  "author": "CosmicCreeperz",
                  "body": "If that’s all you want, XReal and Viture are getting close.  They are just displays, no CPU or battery, so they are basically like largish sunglasses.",
                  "score": 2,
                  "created_utc": 1744693399.0,
                  "replies": [
                    {
                      "id": "mn7s1qe",
                      "author": "_RADIANTSUN_",
                      "body": "All they need is a wireless display \"relay\" system like Meta's \"Orion\" demo had to offboard computing to a pocketable \"puck\".\n\nI can't believe Samsung or someone hasn't already partnered with them to integrate wireless DeX or something.",
                      "score": 1,
                      "created_utc": 1744716342.0,
                      "replies": [
                        {
                          "id": "mn93am7",
                          "author": "CosmicCreeperz",
                          "body": "Apple has had internal versions of that for a decade.  But they decided not to productize it as it’s not a good mass market strategy compared to their ultimate goal of an iPhone being that “puck”.  At this point it’s mostly a power problem.\n\nThat’s what the XR glasses I mentioned do - you can plug it into your phone.  Their issue is that they are so lightweight and low power because they use a microOLED projected via waveguide so the FOV isn’t great (45-50 degrees) and it’s not capable of true AR/VR due to lack of good 6DoF tracking.\n\nI fully expect the solution in 15 years or so is a lightweight sunglasses-style HMD connected to a phone.  There are just a bunch of basic technical problems to solve first with power, wireless video bandwidth, FOV, etc.  Orion is a cool demo but a 70 degree FOV and 2 hour battery life at 720x540 res is a LONG way off from a successful product.",
                          "score": 2,
                          "created_utc": 1744732531.0,
                          "replies": [
                            {
                              "id": "mn9mfhw",
                              "author": "_RADIANTSUN_",
                              "body": "Everyone has had internal versions of this since the Google Glass reveal in like 2013...",
                              "score": 0,
                              "created_utc": 1744738172.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn2fq07",
              "author": "Kindness_of_cats",
              "body": "People have been trying to find mass market use cases for VR for a very, very long time.  I honestly don’t see it coming, VR just generally is one of those things that sounds amazing until you realize that your phone or tablet or laptop is more practical to use.  Even gaming, which is by far its most mainstream use, has struggled to get all that big in the scheme of things.\n\nI also honestly think it’s more than just needing a killer app. The technology itself has a lot of baked in inherent problems for average consumers:  \n\nIt’s *always* going to be isolating and require everyone have a headset on to share experiences; it’s *always* going to have battery issues; it’s *always* going to cause people to feel like the person wearing it is isolated from everyone around them; it’s *always* going to mess with your appearance; it’s *always* going to be less convenient to carry with you than a phone or a laptop/tablet; it’s *always* going to have input limitations.  \n\nThese are things which can’t simply be iterated away because they’re fundamental to how the technology works.  They can be improved, but not *removed.*\n\nPass through can help the person wearing it feel less isolated, but it won’t change the fact that people around them will want to see their actual eyes and know they have their attention when interacting.  Making them lighter and smaller can help with comfort and travel convenience, but battery packs will still have to be a thing and anything shaped like goggles or glasses will be harder to fit into a bag or your pocket than a laptop or phone.  \n\nBy the time you solve enough of these problems sufficiently to go mainstream, and basically come out with smart glasses, you have a a very different product that will be severely compromised in many of the things VR headsets try to accomplish.  I’m convinced VR is just a stepping stone to AR for mainstream consumers, and that it *will* remain a fairly niche technology.  \n\nAnd even then, I think they may well struggle to gain mass adoption.  People absolutely *loathe* wearing anything on their face, many will prefer sticking plastic lenses in their eyes over wearing glasses *to be able to fucking see.*  It’ll have to offer a lot for consumers to get over that inherent problem.",
              "score": 20,
              "created_utc": 1744641255.0,
              "replies": [
                {
                  "id": "mn51svm",
                  "author": "None",
                  "body": "Innovation needs 2 of 3 things to take mainstream hold.\n\nIt needs to be better in every way to the alternatives.\nIt needs to have an easy learning curve.\nIt needs to seamlessly fit in with how we interact with the world.\n\nI think VR is being over-sold by futurists and people who have seen one too many sci-fi movies. Talk to any normal person who has tried the tech, it’s interesting but in a world where people are using multiple screens at once, doing that while wearing a headset seems incredibly unnecessary.\n\nJust feels like people constantly trying to put a square peg in a round hole because the square peg is new and different.",
                  "score": 3,
                  "created_utc": 1744670034.0,
                  "replies": [
                    {
                      "id": "mn59uc8",
                      "author": "DarthBuzzard",
                      "body": "> Talk to any normal person who has tried the tech, it’s interesting but in a world where people are using multiple screens at once, doing that while wearing a headset seems incredibly unnecessary.\n\nThat's just one usecase though. The main appeal of VR is its ability to induce a sense of presence, which has a lot of applications in areas like education, entertainment, fitness, health, and social.",
                      "score": 2,
                      "created_utc": 1744672837.0,
                      "replies": [
                        {
                          "id": "mn5g5t9",
                          "author": "None",
                          "body": "But those usecases are so incredibly specific that they don’t create enough demand for total adoption. Most people don’t need one and aren’t going to spend insane money for the one feature that looks interesting to them.\n\nVR will always be a novelty device because it does certain things really well, but it doesn’t fix a problem we all have and it doesn’t directly tie into our way of living.\n\nLow profile AR has a better shot of being useful and fitting in but still, the battery break through needs to happen for it to really have a chance and no one is going to be wearing full Vision Pro headsets all day everyday. Will never happen.",
                          "score": 2,
                          "created_utc": 1744675020.0,
                          "replies": [
                            {
                              "id": "mn5h2dl",
                              "author": "DarthBuzzard",
                              "body": "VR fixes a constant need people have: travel. More specifically, it lets people go to places, events, and most importantly other people in a realistic and convincing way without the resources, time, and money needed for physical travel.\n\nMost people can attest to the many places and people in life that they can't physically reach on a frequent basis. VR therefore has huge usecases as a stand-in for this.",
                              "score": 1,
                              "created_utc": 1744675339.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn2icp0",
                  "author": "DarthBuzzard",
                  "body": "> It’s always going to be isolating and require everyone have a headset on to share experiences; it’s always going to have battery issues; it’s always going to cause people to feel like the person wearing it is isolated from everyone around them; it’s always going to mess with your appearance; it’s always going to be less convenient to carry with you than a phone or a laptop/tablet; it’s always going to have input limitations.\n\nAren't you just basing this off current technology, without thinking about how it will evolve?\n\nIsolation isn't even necessarily a barrier to mass adoption considering headphones can't be shared and are used by a billion+ users worldwide.\n\nBattery life could be solved with unforeseen breakthroughs in battery technology. \n\nFuture improvements to Vision Pro's EyeSight display can enable people to feel like the user is not isolated from them.\n\nMessing with appearance, perhaps with regards to eye makeup, but messing with the hair will be solved as they slim down.\n\nThere isn't much need to carry them with you like a phone - they are meant to be stationary devices.\n\nInput limitations exist for phones too. They are very slow and bad at productivity and multi-tasking. VR/AR combined with future EMG advancements has the potential to leapfrog all other forms of input in speed, multi-tasking, efficiency.",
                  "score": 0,
                  "created_utc": 1744642075.0,
                  "replies": [
                    {
                      "id": "mn3ig6w",
                      "author": "Kindness_of_cats",
                      "body": "> Aren't you just basing this off current technology, without thinking about how it will evolve?\n\nNot in any realistic way, no, that's kind of my point.  To go line by line:\n\n>Isolation isn't even necessarily a barrier to mass adoption considering headphones can't be shared and are used by a billion+ users worldwide.\n\nThe key difference is that you can easily just change audio sources to output sound through your speakers when you want to share music or video.  That is definitionally impossible with VR experiences, you either need to be wearing a headset yourself or hand your headset to someone else.\n\nYou can't iterate out of that problem, it's baked into the technology.\n\n>Battery life could be solved with unforeseen breakthroughs in battery technology. \n\n We **are** getting breakthroughs in battery technology all the time, and they are used to power devices that demand more power than ever. Battery iteration isn't isolated from all other product iteration.\n\n A breakthrough that is so large it makes sticking long-lasting batteries into something as necessarily power-hungry and lightweight as a headset is just shy of \"cold fusion\" territory. It's possible, but either so far away or so speculative that it's not really worth talking about.\n\n You're going to be dealing with a short battery life, and/or the need for wires/packs, for the foreseeable future.\n\n>Future improvements to Vision Pro's EyeSight display can enable people to feel like the user is not isolated from them.\n\nYou're dealing with deeply ingrained issues of instinct and cultural norms.  People *want to see your eyes,* not representations of them, and to know that they have your undivided attention.  This is not going to change anytime soon, and better feeds of your eyeballs projected onto a screen won't really fix that. \n\nYou're going to need to be taking them off whenever you interact with people unless you want to get the same reaction that you would when chatting while staring at your phone or computer screen.  Which is a pain in the fucking ass for something strapped to your head.  Speaking of...\n\n>Messing with appearance, perhaps with regards to eye makeup, but messing with the hair will be solved as they slim down.\n\nEye makeup, yes, but also foundation smudging off is going to be an issue after a while of use.  You're probably going to develop a ring around where the goggles rest.\n\nHair is the biggie, though, and it's not going to be solved by \"slimming down\" anything due to the need for a strap going around you head.  A lot of hairstyles will simply be a non-starter for use with headsets since it will just squish them down, and any time you have to put a strap around your head it's going to mess up your hair getting it off.\n\nThere's no iterating yourself out of that issue, it's a matter of physics.\n\n>There isn't much need to carry them with you like a phone - they are meant to be stationary devices.\n\nAre they, though?  Because certainly that's not how Apple has tried to sell their headset.  Use when traveling especially has been a major part of their pitch.  \n\n>Input limitations exist for phones too. They are very slow and bad at productivity and multi-tasking. \n\nLimitations, sure, but I just fundamentally do not agree that it's remotely comparable.  It's been clear since Blackberry fucking imploded in the late 2000s that digital keyboards aren't actually a real problem for most consumers, and large chunks of people at this point literally prefer to do as much of their computing on their phones/tablets. \n\nMeanwhile headsets just do not have any workable method of input other than physical accessories, or the holographic garbage that Apple tried to make work on the first Vision Pro. \n\n>VR/AR combined with future EMG advancements has the potential to leapfrog all other forms of input in speed, multi-tasking, efficiency.\n\nI'm sorry, but if you're expecting me to take \"EMG advancements\" seriously as a possible solution to this then we're back in \"cold fusion\" territory.  \n\nIt further solidifies my impression that people who think VR is going to take off are kind of stuck in a mindset that refuses to admit it hasn't turned out to be the magical wonder technology that Sci-Fi stories depicted.    \n\n(And once again, I think AR glasses are a different story and more likely to take off...but they're also different product entirely, that VR is a stepping stone towards)",
                      "score": 2,
                      "created_utc": 1744652858.0,
                      "replies": [
                        {
                          "id": "mn3okr7",
                          "author": "DarthBuzzard",
                          "body": "> The key difference is that you can easily just change audio sources to output sound through your speakers when you want to share music or video.\n\nI agree that you can't do this with VR, aside from screen sharing though that's not the same. However I really have a hard time imagining people changing the output to speakers often or caring all that much about that feature. Sounds like a very fringe thing to me as I would expect most people just use their headphones for themselves 24/7 outside a few rare exceptions.\n\n> You're going to be dealing with a short battery life, and/or the need for wires/packs, for the foreseeable future.\n\nI'll agree with you there.\n\n> You're dealing with deeply ingrained issues of instinct and cultural norms. People want to see your eyes, not representations of them, and to know that they have your undivided attention.\n\nIs it going to matter if it's visually indistinguishable from seeing the person's real eyes? \n\n> There's no iterating yourself out of that issue, it's a matter of physics.\n\nYou can definitely iterate yourself out of the hair issue by having really lightweight HMDs that have good weight balance without a top strap. How far off is that? Probably a long ways off, but it's physically possible.\n\n> and large chunks of people at this point literally prefer to do as much of their computing on their phones/tablets.\n\n> or the holographic garbage that Apple tried to make work on the first Vision Pro.\n\nFor their general leisure needs this is true, but it's rare that you see someone do actual work on a phone/tablet unless it's specialized for their job like digital artists. Desktops and laptops remain by a large margin the productivity device of choice.\n\nYou say Vision Pro's input is garbage, but a common sentiment among those that have tried Vision Pro is that it's the most personable personal computer they've used, to such a degree that people describe it almost like mind reading because of how seamless the eye-tracked interface is. The speed leaves a lot to be desired, and that's why I mentioned EMG. Time will tell how far EMG goes, but if the potential is fully realized then it would leapfrog over not just smartphones but the age-old mouse and keyboard that is considered the fastest input we've invented.\n\nIf it goes smoothly, EMG will allow a user to type with their hands in their pockets or resting behind their head while lying down in bed at faster speeds than a physical keyboard with much less effort than either physical or touchscreen typing since you'd barely be moving your hands and fingers, perhaps not even moving at all.\n\nThese things have been demonstrated. It's physically possible. The question is how can this generalize to the wider population, be affordable, be mass producible, and so on? That's the tough part.\n\n> And it further solidifies my impression that people who think VR is going to take off are kind of stuck in a mindset that refuses to admit it hasn't turned out to be the magical wonder technology that Sci-Fi stories depicted.\n\nI mean if you look at Ready Player One as a basis, then all of the hardware already exists in places like Meta and Apple's labs, usually relegated to separate prototypes. So it's physically possible to eventually get there. Funnily enough on the software side I've already experienced every experience and activity described in the Ready Player One book and movie - that's already happening today, just at a much lower fidelity and scale.",
                          "score": 2,
                          "created_utc": 1744654643.0,
                          "replies": []
                        },
                        {
                          "id": "mn3s4aw",
                          "author": "Trixles",
                          "body": "Well said. It's a pipe-dream for now. Call me in 10 years when they figure it all out xD",
                          "score": 1,
                          "created_utc": 1744655700.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn3klz2",
                  "author": "PhlegethonAcheron",
                  "body": "As somebody with a decent triple-monitor setup, I'd love to be able to take my laptop somewhere, throw on  apair of not-hideous glasses, and have the ability to spread the pdfs, code, report, and presentation out around me instead of being stuck to the same desk.",
                  "score": 0,
                  "created_utc": 1744653474.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn3ixwc",
              "author": "Nokomis34",
              "body": "I recently saw one where they were using the headset to project murals onto walls for tracing vs usually using a projector. That looked like a fantastic use of AR",
              "score": 2,
              "created_utc": 1744652997.0,
              "replies": []
            },
            {
              "id": "mn29zk7",
              "author": "boyyouguysaredumb",
              "body": "The spatial photos/video are supposedly good, but I’ve heard mixed things",
              "score": 4,
              "created_utc": 1744639415.0,
              "replies": []
            },
            {
              "id": "mn2zas6",
              "author": "kung-fu_hippy",
              "body": "What was the killer app of the iPad?\n\nI can watch a movie on my phone or my iPad, after all. Or edit photos. Or browse Reddit. But I’ll grab one over the other for different conditions. Laying on the sofa or traveling in an airplane calls for one, walking around or grabbing a cup of coffee and sitting for a minute calls for the other. \n\nI think the AVP fits similarly here. It will never really allow you to do anything you couldn’t do with a phone/ipad/macbook. It’s just a question of when and if you consume/create stuff through it will meet a price and form factor that has mass market appeal.",
              "score": 4,
              "created_utc": 1744647203.0,
              "replies": []
            },
            {
              "id": "mn2g01u",
              "author": "Clugaman",
              "body": "Not just the app, but it needs to come in at a price that is more accessible. Even if it’s a must have, no one’s going to buy it for the price of an old car",
              "score": 2,
              "created_utc": 1744641342.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn1wrkv",
          "author": "golddilockk",
          "body": "iphone moment relied on phones being present and important everywhere already.",
          "score": 17,
          "created_utc": 1744634692.0,
          "replies": [
            {
              "id": "mn3ac9q",
              "author": "Tolken",
              "body": "The iphone moment ALSO relied on almost every other manufacturer being caught flat footed as to where the tech was really headed.\n\nIt's easy to forget, but iOS pre-dates Android OS and blackberry misjudged what the market really wanted.\n\nIf Apple just sits back and waits for VR to \"be present and important everywhere already\" another party could already be in the correct position thereby not giving Apple a chance to jump in with a major improvement and take over.\n\nThis is a big reason why the Apple Car project failed...By the time Apple heavily spent R&D to try to jump in, There wasn't room to leapfrog as others were already successfully pushing the tech as far/fast as it could go.",
              "score": 4,
              "created_utc": 1744650513.0,
              "replies": [
                {
                  "id": "mn3bhkp",
                  "author": "Valance23322",
                  "body": "iOS also didn't ship with an app store to be fair. Apple added it in later when devs starting begging for it.",
                  "score": 1,
                  "created_utc": 1744650850.0,
                  "replies": [
                    {
                      "id": "mnjvtab",
                      "author": "gordandisto",
                      "body": "to add to your point, apple was also a challenger instead of a market leader today. they were suppose to have different market strategies.",
                      "score": 1,
                      "created_utc": 1744878451.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn2a2ko",
              "author": "dichron",
              "body": "I guess its moment would be if it provided most of the functionality of an iPhone, which is currently present and important everywhere, on your face.",
              "score": 1,
              "created_utc": 1744639443.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn1ymvc",
          "author": "UndulatingHedgehog",
          "body": "I just want an on-demand overlay in my field of view. Directions and that kind of thing. Unless the overlay displays advertisements.",
          "score": 9,
          "created_utc": 1744635408.0,
          "replies": [
            {
              "id": "mn24ed4",
              "author": "juniorspank",
              "body": "Ads will always come, don’t worry. Also navigation is all well and good but most distracted driving laws are worded in a way that would make AR glasses illegal to wear while driving.\n\nGive police another excuse to pull you over for no reason? That’s a no from me, dog.",
              "score": 4,
              "created_utc": 1744637517.0,
              "replies": []
            },
            {
              "id": "mn2f1xn",
              "author": "Dirty_Dragons",
              "body": "I really want this for driving.\n\nI tend to get left and right mixed up and if there is a tricky intersection with a lot of options I'll somehow pick the wrong one.\n\nA video game style navigation system with arrows would be amazing.",
              "score": 2,
              "created_utc": 1744641044.0,
              "replies": []
            },
            {
              "id": "mn56rvi",
              "author": "Digitlnoize",
              "body": "That’s stage 1. Stage 2 is stuff like AR decorations for your house or office. AR skins for your car or even your clothes and accessories. Yes, they’ll only be viewable if other people are also wearing AR glasses, but once everyone is, I expect this sort of AR art/fashion to take off. No more producing random shit to hang on your wall. You can just download it and “hang” it where you want it. No sweatshop needed.",
              "score": 1,
              "created_utc": 1744671779.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn1xe0o",
          "author": "guiltyofnothing",
          "body": "We have yet to solve the dork factor with headsets. There’s just something so unappealing to so many people about wearing them and being seen wearing them.",
          "score": 18,
          "created_utc": 1744634935.0,
          "replies": [
            {
              "id": "mn29dsl",
              "author": "FromTralfamadore",
              "body": "Someday this tech will be able to fit in a regular pair of glasses. We’ll still be called “four eyes” but not because of the ar glasses..🤓",
              "score": 9,
              "created_utc": 1744639214.0,
              "replies": [
                {
                  "id": "mn29woq",
                  "author": "guiltyofnothing",
                  "body": "Until they can get that done, you will never overcome the fact that you look like an absolute dope wearing a headset in public.",
                  "score": 2,
                  "created_utc": 1744639388.0,
                  "replies": [
                    {
                      "id": "mn2gg4n",
                      "author": "CamiloArturo",
                      "body": "Can’t think of anything which looks more stupid than the people with those Apple Vision Sets walking around in public. Yes, you want people to know you have money, but you end up making an “Elon” on trying so hard to",
                      "score": 3,
                      "created_utc": 1744641482.0,
                      "replies": []
                    },
                    {
                      "id": "mn2gwcx",
                      "author": "typo180",
                      "body": "Walking around on the street or interacting socially? Sure. Sitting on public transportation, at your desk, or in a coffee shop? Who cares? I'm not sure wearing one all day while you're out and about is the best use-case either. It's makes a neat tech demo to have the glasses tell you about the things you're looking at, but that's not necessarily how people are going to want to use it.",
                      "score": 1,
                      "created_utc": 1744641624.0,
                      "replies": [
                        {
                          "id": "mn2h9u0",
                          "author": "guiltyofnothing",
                          "body": "I can 100% guarantee you that most people do have a reaction to seeing someone wear a headset on public transportation or at a coffee shop. And it’s not favorable to the user.",
                          "score": 2,
                          "created_utc": 1744641741.0,
                          "replies": [
                            {
                              "id": "mn2iume",
                              "author": "typo180",
                              "body": "Ok, but who cares? It's novel now, but it at some point, it won't be and people won't think twice about it. If they're not disturbing anyone and it's a helpful tool, then it's fine. People are going to use it.",
                              "score": 3,
                              "created_utc": 1744642227.0,
                              "replies": [
                                {
                                  "id": "mn2jq2e",
                                  "author": "guiltyofnothing",
                                  "body": "Perception is absolutely a factor in consumer choices, even if we like to think it’s not. It factors into what kind of car you buy, what color you paint your house, what clothes you wear.\n\nAnd sure — while it may eventually change, this has been a constant problem going back to Google Glass over a decade ago.",
                                  "score": 2,
                                  "created_utc": 1744642495.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn2hfch",
              "author": "Kindness_of_cats",
              "body": "Yeah I feel like people underestimate severely the issues with how headsets affect your appearance.  First you just straight up look like a dork wearing them.  Second, they ruin your hair and your makeup because they’re literally strapped onto your head and face.  Third, they ask you to set aside tens of thousands of years of evolutionary instincts and be okay with not seeing people’s eyes; it’s the tech equivalent of wearing sunglasses indoors.  Also frankly most people just don’t like wearing things on their face.\n\nAnd I think this is an issue even AR glasses with struggle with breaking through.  People don’t like wearing glasses *when they need them to see anything,* and you’re expecting them to wear your product?  I think AR glasses are more likely to go mainstream, but even then I think there’s a good chance they just…don’t.  In part because of simply asking people to wear something on their face and which alters their appearance.",
              "score": 3,
              "created_utc": 1744641788.0,
              "replies": [
                {
                  "id": "mn2hxhh",
                  "author": "guiltyofnothing",
                  "body": "You’re 100% right and I think a lot of this can be overcome if there was just an overwhelming use case for headsets and AR, but there really just isn’t (yet) for the average consumer. \n\nAs it stands, it’s an expensive piece of hardware that lacks a clear purpose that makes you look like dumb and is borderline impractical to use.",
                  "score": 1,
                  "created_utc": 1744641946.0,
                  "replies": [
                    {
                      "id": "mn2lr9f",
                      "author": "DarthBuzzard",
                      "body": "The clear purpose of VR/AR is presence and audiovisual assistance.",
                      "score": 1,
                      "created_utc": 1744643120.0,
                      "replies": [
                        {
                          "id": "mn2ml55",
                          "author": "guiltyofnothing",
                          "body": "Ok, but that’s not shown itself to be such an overwhelming need that people are ready to strap in at the price point these wearables retail for and accept the (considerable) social stigma that comes with wearing them in public.",
                          "score": 1,
                          "created_utc": 1744643375.0,
                          "replies": [
                            {
                              "id": "mn2og25",
                              "author": "DarthBuzzard",
                              "body": "I agree that the price point and maturity level of the technology leaves much to be desired. I do however think that there is an overwhelming need for these usecases.",
                              "score": 1,
                              "created_utc": 1744643940.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn46x36",
                  "author": "mooseman99",
                  "body": "I have a pair of Meta Raybans and I use them way more often than I thought I would.\n\nMost people can’t even tell they are AR glasses\n\nThat said, they are sunglasses so I only really use them when I’m outside.",
                  "score": 1,
                  "created_utc": 1744660231.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mn1yih4",
          "author": "DarthBuzzard",
          "body": "That quote is referring to AR glasses rather than Vision Pro. \n\nMeta thinks of VR/MR headsets as a PC/Tablet level market and AR glasses as a smartphone level market. I expect it's the same for Apple.\n\nI personally expect both will have mass appeal in the 2030s as VR/MR headsets will be very capable computing devices for productivity and media as well as social, entertainment, and fitness devices with major advantages over TVs/Phones/Consoles. AR glasses will in theory eventually allow for people to do everything they already do on a phone in a more convenient and faster format and it would be an audiovisual AI assistant for almost any task, a navigator, and a capable computing and media device, and could potentially allow superhuman vision and hearing.",
          "score": 8,
          "created_utc": 1744635363.0,
          "replies": []
        },
        {
          "id": "mn27c5c",
          "author": "None",
          "body": "Yes as the computing and battery tech improves ar will eventually be the height of wearable tech. What we have currently is the novelty form factor that allows testing and market research. \n\nThey will, of course, gather data from you in its current form to help them develop it as well as fund it. \n\nEventually, Tony stark glasses will be a thing. Heads up displays with built in ai and speakers built in. That is probably 20 years away if not more. \n\nThe bigger issues in ar development will be an impending hot war if this trade war sparks off. 5-10 years of physical conflict will stall luxury item manufacturing",
          "score": 3,
          "created_utc": 1744638540.0,
          "replies": []
        },
        {
          "id": "mn2fy20",
          "author": "skrrtrr",
          "body": "One day, 100%. We will live in a dystopian world one day where tech like this will used 24/7 in our lifes.",
          "score": 3,
          "created_utc": 1744641325.0,
          "replies": []
        },
        {
          "id": "mn31kae",
          "author": "anivex",
          "body": "That will come with size and weight reduction, and the right software to power it. \n\nIt’s truly only a matter of time until AR replaces smartphones.  They’ve just got to get the tech right.\n\nApple knows what’s up.",
          "score": 1,
          "created_utc": 1744647890.0,
          "replies": []
        },
        {
          "id": "mn31rbm",
          "author": "Stupidstuff1001",
          "body": "Nope. \n\nSteve Jobs Apple would have made it a competitor to the iPhone and try to make everyone wearing iSee smart glasses that look like normal glasses. \n\nThe current leadership at Apple is just too safe and I feel are pulling a Kodak by holding back on technology in fear it will cannabalize their current profits.",
          "score": 1,
          "created_utc": 1744647948.0,
          "replies": [
            {
              "id": "mn3bq52",
              "author": "__theoneandonly",
              "body": "[There's a new article out today](https://www.bloomberg.com/news/newsletters/2025-04-13/apple-vision-pro-2-details-low-latency-headset-ar-glasses-ipados-19-details-m9flf1fd) saying that developing this AR glasses technology is currently priority 1 for Apple leadership, but that they know that they're years away from a product ready to be shipped. (Meta showed off a prototype recently, but they also say that they're years away from a consumer product. Apple, as a rule, doesn't show off prototypes. But if the rumors are to be believed, they are pretty much neck-and-neck with Meta in a development timeline.)",
              "score": 2,
              "created_utc": 1744650919.0,
              "replies": [
                {
                  "id": "mn3ef16",
                  "author": "Stupidstuff1001",
                  "body": "I hope so. It’s just no one needs a gawdy ve. Simple glasses that can do basic functions that you grow over time would be amazing",
                  "score": 1,
                  "created_utc": 1744651697.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mn364d7",
          "author": "gokarrt",
          "body": "not with the current technological limitations, no. \n\nheadsets will never be it, glasses might be.",
          "score": 1,
          "created_utc": 1744649265.0,
          "replies": []
        },
        {
          "id": "mn3at4o",
          "author": "Valance23322",
          "body": "If they actually get something that's closer to wearing a normal pair of glasses vs a bulky, hot headset then that would definitely convince way more people to use it.",
          "score": 1,
          "created_utc": 1744650653.0,
          "replies": []
        },
        {
          "id": "mn3pscx",
          "author": "vibrance9460",
          "body": "Apple takes the long view on this.  Just like the Apple Watch. It will take a few years to develop the product and find out how people want to use it.\n\nAnd it was always been Apple stated goal to create elegant stylish AR glasses that look like normal glasses. That’s still the goal",
          "score": 1,
          "created_utc": 1744655004.0,
          "replies": []
        },
        {
          "id": "mn3scpl",
          "author": "nazbot",
          "body": "The major disruptions in tech are UX centered. \n\nThe keyboard, the mouse and GUIs, multitouch, etc. Moores law matters but the big leaps generally center around some new for of human I/O. \n\nI don’t know exactly what it is but I suspect some form of AI + Glasses will be that next UX revolution. So for example basically wearing a computer via glasses and being able to have the computer see what you see and ask it questions from your POV could be very useful. And being able to talk to that computer using natural language.\n\nSaying ‘why bother making UX better’ is kind of what RIM said re: the iPhone ‘why would anyone want to use a touchscreen keyboard instead of a physical keyboard ‘.",
          "score": 1,
          "created_utc": 1744655770.0,
          "replies": []
        },
        {
          "id": "mn47pgw",
          "author": "writingNICE",
          "body": "If it was a simple pair of glasses / shades like the one Bose made with built in speaks for music, lasts a few hours, can listen to music, watch TV and shows, and had other iOS apps, social media etc, then maybe yes.",
          "score": 1,
          "created_utc": 1744660458.0,
          "replies": []
        },
        {
          "id": "mn4elk8",
          "author": "Presently_Absent",
          "body": ">Can this tech really have an \"iPhone moment\" that gets the masses on board? \n\npeople were saying the same about smartphones when the blackberry was dominant...",
          "score": 1,
          "created_utc": 1744662505.0,
          "replies": []
        },
        {
          "id": "mn5qvw8",
          "author": "TenderfootGungi",
          "body": "Need a killer app. I believe it is live sports. Imagine feeling like you are on the sideline, looking around and watching the game.\n\nEdit: And another market the size of iPhone likely does not exist in consumer electronics. At least not with current tech.",
          "score": 1,
          "created_utc": 1744678834.0,
          "replies": []
        },
        {
          "id": "mn6j22o",
          "author": "redditismylawyer",
          "body": "lol, no. The obvious answer is no. Remind yourself to come back and see the answer is still no. \n\nThis bullshit is a flying car you can make with a lawnmower.",
          "score": 1,
          "created_utc": 1744689961.0,
          "replies": []
        },
        {
          "id": "mn25hh8",
          "author": "2roK",
          "body": "Yes, that would be real, working AR and AI assistant integrated into normal glasses. \n\nAnything else, no.",
          "score": 1,
          "created_utc": 1744637903.0,
          "replies": []
        },
        {
          "id": "mn2al8u",
          "author": "AnalogWalrus",
          "body": "I can absolutely see it, at least for home use, but I feel the practical technology is still a few years away.\n\nIf they can solve the affordability, comfort, and eye strain issues, I could see it replacing people’s desktop/work computers. Like, if I could put those on and have a basically infinite sized desktop instead of my big desk with dual monitors and whatnot…that’d be amazing. But I don’t think we’re there yet tech-wise.",
          "score": 1,
          "created_utc": 1744639612.0,
          "replies": []
        },
        {
          "id": "mn22ojl",
          "author": "johnny_moist",
          "body": "if you’ve tried the demo and don’t see the world changing potential in this tech idk what to tell you.  this is only the very very beginning of humans living in two worlds, the real one and the virtual/augmented one.  wether or not apple is the company who will dominate that space remains to be seen but it will happen.",
          "score": -5,
          "created_utc": 1744636901.0,
          "replies": [
            {
              "id": "mn276z5",
              "author": "thelangosta",
              "body": "I think the problem is that it’s been at least 10 years already and it feels like we are not much closer than we were at the start of AR/VR/MR(yes I know they are different things). The screens have gotten better but the headsets are still large and dorky. I want glasses I can wear all day every day that help me remember things and search things while in on the go. I don’t need a new kind of computer screen/tv for while I’m at home",
              "score": 8,
              "created_utc": 1744638492.0,
              "replies": [
                {
                  "id": "mn436wg",
                  "author": "johnny_moist",
                  "body": "we are obviously still far away from that level of comfort and accessibility but i have to only laugh at people downvoting me.  Idk a single person who’s demo’s the AVPs and hasn’t had a similar holy shit reaction.  not because of how good they are now, which i think is still incredibly impressive - Quest isn’t anywhere in the same class - but because of clearly you can see future applications and progressions in the space.",
                  "score": 1,
                  "created_utc": 1744659093.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn1xd0f",
      "author": "mvallas1073",
      "body": "Hold up - didn’t they report it a few months ago that Apple dumped/abandoned A-VR development altogether (or something similar. Please correct me if I am wrong) due to poor sales of the VP?",
      "score": 69,
      "created_utc": 1744634924.0,
      "replies": [
        {
          "id": "mn1z2v4",
          "author": "DarthBuzzard",
          "body": "No, that was false reporting.",
          "score": 49,
          "created_utc": 1744635573.0,
          "replies": []
        },
        {
          "id": "mn5kod1",
          "author": "DiaDeLosMuebles",
          "body": "Yeah. Any news about upcoming Apple releases are always speculation. Unless a doofus leaves a phone at a bar.",
          "score": 2,
          "created_utc": 1744676624.0,
          "replies": []
        },
        {
          "id": "mnqna6f",
          "author": "malagic99",
          "body": "I think they just stopped developing the Pro model, so they can focus on a more budget friendly model",
          "score": 1,
          "created_utc": 1744974431.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn1vrr0",
      "author": "Jamie00003",
      "body": "Mac-tethered? I thought they gave up on that idea? Also iPhone-tethered makes a million times more sense",
      "score": 97,
      "created_utc": 1744634297.0,
      "replies": [
        {
          "id": "mn1yeic",
          "author": "w1n5t0nM1k3y",
          "body": "It really needs to connect to a PC if they want it to compete with the other VR options. A VR headset without the PC game library just doesn't make much sense.",
          "score": 69,
          "created_utc": 1744635323.0,
          "replies": [
            {
              "id": "mn1yuqx",
              "author": "Jamie00003",
              "body": "Also, other devices. I want it to replace my tv and monitors in my home, until it plays nice with other devices (ie my Nintendo switch, gaming pc and windows work laptop) it’s pointless to me\n\nA USB C / HDMI box that can beam devices to the headset could do this, but it’s Apple so will probably never happen, they want you to just use macs and iPhones\n\nEven using it just as a tv replacement would be enough of a draw even with the 3 grand price tag since this is cheaper than new monitors and a tv in a lot of cases",
              "score": 24,
              "created_utc": 1744635490.0,
              "replies": [
                {
                  "id": "mn6gbhr",
                  "author": "Spiral_Slowly",
                  "body": "A tv replacement? Do you never watch things with other people?",
                  "score": 6,
                  "created_utc": 1744688706.0,
                  "replies": [
                    {
                      "id": "mn6z9cx",
                      "author": "Jamie00003",
                      "body": "Some people in life are different to you, and live on their own",
                      "score": 2,
                      "created_utc": 1744698756.0,
                      "replies": [
                        {
                          "id": "mn8j7o1",
                          "author": "Spiral_Slowly",
                          "body": "So the answer is no. You can live on your own and still have need for a TV to watch things with people. Family or friends visiting for example.",
                          "score": 1,
                          "created_utc": 1744726488.0,
                          "replies": [
                            {
                              "id": "mn8zqvu",
                              "author": "Jamie00003",
                              "body": "Ok, well I don’t. When my family visit we talk to one another not watch tv",
                              "score": 1,
                              "created_utc": 1744731483.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mnkki7j",
                      "author": "Slightlydifficult",
                      "body": "I’d rather have one of those protectors where I can put up the screen as needed. I rarely have people over to watch tv and it takes up so much space as it is. I’m sure I’m in the minority though.",
                      "score": 1,
                      "created_utc": 1744891519.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mn3djfn",
                  "author": "Sasquatchjc45",
                  "body": ">cheaper than new monitors and a tv in a lot of cases\n\nWhere do you buy your TVs? You can get a 50 inch 4k HDTV for under $500 at Walmart. (And I'm sure other stores have similar prices, unless you're going for OLED or something obscene like 100\" or some shit TVs are very inexpensive these days)\n\nHell, i have an MSI ULWHD curved gaming monitor and it was 700 bucks. Not even over a grand... Apple vision is more expensive than all the TVs and monitors in my house combined at this point lol",
                  "score": 6,
                  "created_utc": 1744651449.0,
                  "replies": [
                    {
                      "id": "mn3e05z",
                      "author": "Jamie00003",
                      "body": "The Vision Pro is literally 2 8K OLED 90hz screens. You sure about that?",
                      "score": -2,
                      "created_utc": 1744651581.0,
                      "replies": [
                        {
                          "id": "mn3ep1b",
                          "author": "Sasquatchjc45",
                          "body": "Sure about what?? Exactly what I said in my comment that you can get a non-oled 4k HD 50\" TV for under $500 (16% the cost of an apple vision... but go off and wear your apple vision 24/7 for TV/PC/phone whatever entertainment lol)",
                          "score": 3,
                          "created_utc": 1744651776.0,
                          "replies": [
                            {
                              "id": "mn3eua0",
                              "author": "Jamie00003",
                              "body": "I’m not comparing it to that am I? If I’m buying a Vision Pro I want the best screens money can buy",
                              "score": -3,
                              "created_utc": 1744651818.0,
                              "replies": [
                                {
                                  "id": "mn3fg5v",
                                  "author": "Sasquatchjc45",
                                  "body": "So refer to the end of my last comment. Wear an apple vision 24/7 lmfao. Btw, there are better [physical TVs](https://www.samsung.com/us/televisions-home-theater/tvs/samsung-neo-qled-8k/85-class-samsung-neo-qled-8k-qn900d-qn85qn900dfxza/?cid=pla-ecomm-pfs-tv-us-google-na-02272025-340029-&ds_e=GOOGLE-cr:%25ecid!-pl:%25epid!-&ds_c=CN~TV+-+Premium+-+PLA_ID~n_PR~smtv_SB~tv_PH~on_KS~pla_MK~us_OB~con_FS~lo_FF~n_BS~ec_KM~na-&ds_ag=ID~n_AG~Premium+TV_AE~mul_AT~sepla_MD~h_PK~roah_PB~google_PL~sa360_CH~search_FF~n-&ds_k=PRODUCT_GROUP&gclsrc=aw.ds&gad_source=1&gclid=CjwKCAjw5PK_BhBBEiwAL7GTPTcpCTzR7D7daHFuOUc7NaQF9lJOVIZDjLjc0xE0d-7KD3PnVNU2CBoCCYYQAvD_BwE) money can buy if that's really your concern",
                                  "score": 2,
                                  "created_utc": 1744651993.0,
                                  "replies": [
                                    {
                                      "id": "mn3fjyo",
                                      "author": "Jamie00003",
                                      "body": "Jesus Christ lmao why are you getting nasty? Am I not allowed my opinion?\n\nThis is more than the Vision Pro and can’t be used as my living room tv as well as my computer monitors, so no. Don’t think it’s even an OLED is it?",
                                      "score": -1,
                                      "created_utc": 1744652024.0,
                                      "replies": [
                                        {
                                          "id": "mn3lfyo",
                                          "author": "Sasquatchjc45",
                                          "body": "Nice gaslighting when you started arguing with me first with your \"yOu sUrE aBOuT ThAt?\"\n\nOf course, spend your money however you choose on what you feel is best. My original comment was my opinion and still stands. If you wanted to just share yours instead of argue with me, you would have posted your own comment. Bye felicia",
                                          "score": 3,
                                          "created_utc": 1744653715.0,
                                          "replies": [
                                            {
                                              "id": "mn3ln0a",
                                              "author": "Jamie00003",
                                              "body": "I’m not gaslighting anyone lmao, I told you what my requirements are and you haven’t proved jack shit can replace the Vision Pro for that price point.\n\nTry again",
                                              "score": -2,
                                              "created_utc": 1744653772.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn6k7mi",
              "author": "TheDrGoo",
              "body": "Yeah its gonna have the expansive 3 game library of the mac ecosystem",
              "score": 4,
              "created_utc": 1744690514.0,
              "replies": []
            },
            {
              "id": "mn5sbxm",
              "author": "keeleon",
              "body": "But macs don't really come with the kind of video card to run high end vr so it's kind of pointless.",
              "score": 3,
              "created_utc": 1744679362.0,
              "replies": []
            },
            {
              "id": "mn5g82k",
              "author": "Fast-Bag-36842",
              "body": "It’s not a market they are interested in",
              "score": 1,
              "created_utc": 1744675041.0,
              "replies": [
                {
                  "id": "mn5oct8",
                  "author": "w1n5t0nM1k3y",
                  "body": "How big is the market of people who want a VR device but dont want to play games?",
                  "score": 1,
                  "created_utc": 1744677935.0,
                  "replies": [
                    {
                      "id": "mn5wjnb",
                      "author": "Fast-Bag-36842",
                      "body": "How big was the market for mp3 players prior to the iPod? How big was the market for tablets prior to the iPad? How big was the market for smartphones prior to the iPhone? \n\nApple has never been a first to market type company. They have always excelled at building a high quality product, at a premium price, and growing the market while capturing a dominant share of it.\n\nThey view the Vision Pro as a computing input device first and foremost. Of course time will tell if that works or not, but it doesn’t seem likely at all to me they will invest much at all at making it a gaming headset",
                      "score": -1,
                      "created_utc": 1744680890.0,
                      "replies": [
                        {
                          "id": "mn8akrm",
                          "author": "w1n5t0nM1k3y",
                          "body": "The market for MP3 players before the iPod was growing, and the market for portable music players was well established for decades.  The  iPod was simply one of the first MP3 players to hit the sweet spot for storage capacity, physical size, and nice user interface.\n\nA lot of people say that athe iPhone was the first smartphone, but even that isn't necessarily taking into account all the devices that came before it. There was devices like the Palm Treo incorporated things like a cell phone, PDA, and other functionality into a single device. The iPhone iterated on that and made it so much better, which is why it was so popular. But the demand was already there waiting for someone to have a clean interface.\n\nApple basically takes products that are well understood and creates better versions of them. But there is no existing device that's just a computing oriented VR headset. Even the market for VR headsets in general is rather small, and if you take out the gaming aspect, there just doesn't seem to be much of a use for them. Maybe in the professional market, for things like employee training or visualizing 3D environments but they don't seem to be focused on that too much either. Their entire focus seems to be a replacement for monitors while you are seated at your desk working on basic office applications and browsing the web.",
                          "score": 2,
                          "created_utc": 1744723634.0,
                          "replies": [
                            {
                              "id": "mn8mkjy",
                              "author": "DarthBuzzard",
                              "body": "> and if you take out the gaming aspect, there just doesn't seem to be much of a use for them.\n\nThe most active apps in VR are actually social apps. Then there is computing, media consumption, fitness, health, art/design, and more. Gaming is just the tip of the iceberg.",
                              "score": 1,
                              "created_utc": 1744727523.0,
                              "replies": [
                                {
                                  "id": "mn8n40m",
                                  "author": "w1n5t0nM1k3y",
                                  "body": "I've never heard of a single person who actually cares about the social apps on VR. It's almost always about gaming, and some of those games are fitness based, but the vast majority of people are either using the for gaming or media consumption.",
                                  "score": 2,
                                  "created_utc": 1744727688.0,
                                  "replies": [
                                    {
                                      "id": "mn8rqkt",
                                      "author": "DarthBuzzard",
                                      "body": "Anecdotal evidence shouldn't be used as a baseline. I mean Roblox has more users than PlayStation Network, Xbox Live, and Steam all combined yet you'll hardly ever hear about it on reddit and probably very few hardcore gamers talk about it.\n\nI've noticed in a lot of the VR subreddits and even tech subreddits, people mostly use VR for games, but that doesn't reflect the actual stats out there.",
                                      "score": 1,
                                      "created_utc": 1744729081.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn1zc4y",
          "author": "DarthBuzzard",
          "body": ">  Also iPhone-tethered makes a million times more sense\n\nThe battery would drain exceptionally fast unless Apple reworks their architecture for future iPhones.",
          "score": 12,
          "created_utc": 1744635669.0,
          "replies": [
            {
              "id": "mn2aw68",
              "author": "wkavinsky",
              "body": "It's also completely pointless.\n\nThe Vision Pro already contains a more powerful processor than the iPhone.",
              "score": 28,
              "created_utc": 1744639712.0,
              "replies": []
            },
            {
              "id": "mn23d0u",
              "author": "BarbequedYeti",
              "body": "Build in device id and throttle accordingly. Full beans when tethered to a mac then 'on the go' mode when tethered to Iphone. ",
              "score": -3,
              "created_utc": 1744637145.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnc8d84",
          "author": "AngryFace4",
          "body": "My guess is that it would be something similar to XReal, in that it can probably connect to any Apple platform. After all, Apple is all about the ecosystem.\n\nI think it’d be a good move. XReal is a really compelling product and Apple should definitely steal that idea. Tethering is good as it allows us to keep a very compact form factor.",
          "score": 1,
          "created_utc": 1744768356.0,
          "replies": [
            {
              "id": "mndrmo9",
              "author": "Jamie00003",
              "body": "Yeah I’m fine with that if it means the battery life improves and they can get rid of that god awful battery pack, for me though it’d need to be compatible with an iPhone",
              "score": 1,
              "created_utc": 1744796667.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn33irl",
          "author": "Nghtmare-Moon",
          "body": "IIRC Mac and iOS run on the same kernel core so a switch between one and the other should be no problem for Apple, for now you want the higher juice while testing then an easy transition",
          "score": 1,
          "created_utc": 1744648478.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn1yvfj",
      "author": "MrEvilFox",
      "body": "I hope Apple keeps iterating until they get it right. This is the company that can deliver a quality mass market solution with use cases IMHO.",
      "score": 215,
      "created_utc": 1744635496.0,
      "replies": [
        {
          "id": "mn2358x",
          "author": "midtown_museo",
          "body": "I agree. I don’t understand why people take so much glee in this project failing. I’d love to see them figure it out.",
          "score": 128,
          "created_utc": 1744637069.0,
          "replies": [
            {
              "id": "mn29dbv",
              "author": "randomIndividual21",
              "body": "It's the absurd asking price. I personally don't care which company，i hope VR continue to get develop",
              "score": 44,
              "created_utc": 1744639210.0,
              "replies": [
                {
                  "id": "mn2mrd4",
                  "author": "Mistrblank",
                  "body": "To be fair they over dialed the specs into a space that needed to be expensive but they’re competing with the “good enough” $300-400 stand alone headsets.",
                  "score": 23,
                  "created_utc": 1744643429.0,
                  "replies": []
                },
                {
                  "id": "mn4oecl",
                  "author": "greenappletree",
                  "body": "New tech is always expensive- first pc was not cheap lets just say.",
                  "score": 9,
                  "created_utc": 1744665542.0,
                  "replies": []
                },
                {
                  "id": "mn7imad",
                  "author": "None",
                  "body": "Have you tried the thing? Its insane and that’s coming from someone from a somewhat vr enthusiast, the specs and the clarity is so far apart and dont get me started on their intuitiveness. It needs more time and development. Meta have been at it for ages so ofc they will have advantage even the bigscreen and others dont come close and bigscreen with all its bells and whistles come close to 2k in Canada.",
                  "score": 3,
                  "created_utc": 1744711295.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn27c6l",
              "author": "veryverythrowaway",
              "body": "A lot of naysayers who actually try the thing tend to turn their opinion around, or at least curb their aggression toward the product. It really is cool tech, it’s just got a way to go.",
              "score": 19,
              "created_utc": 1744638541.0,
              "replies": [
                {
                  "id": "mn298yg",
                  "author": "None",
                  "body": "I was a huge detractor before I tried the demo on Vision Pro 1.\n\nIt absolutely blew my mind when I put it on.  Apple is ahead of the curve here, and it will take time before lots of VR content is developed, but I can absolutely see this being a major product for entertainment on a long time horizon. \n\nThe only scary thing is we are already way too immersed in our devices.",
                  "score": 18,
                  "created_utc": 1744639171.0,
                  "replies": [
                    {
                      "id": "mn3q789",
                      "author": "CocodaMonkey",
                      "body": "Have you tried other systems? To me they all have the same problem, they cost too much, too bulky to wear long term and too annoying to setup. Valve index, Hololens and Vision Pro all work and can do very impressive demos but actual long term use is hard to justify.\n\nTheir development woes are kinda similar to 3D movies which are now over 100 years old and still not wildly used. It's really impressive in small doses with a properly setup demo but the more common it becomes the less impressive it is and the more people complain about the annoyances of using it.",
                      "score": 5,
                      "created_utc": 1744655129.0,
                      "replies": [
                        {
                          "id": "mn61d6o",
                          "author": "swb1003",
                          "body": "I’ve been an almost daily PSVR2 user since launch day, it’s incredibly impressive stuff even to this day. My biggest gripes are \n- cable tether. It’s really not THAT big of a deal for me, vast majority of my use is in my sim rig for gt7 and as-is it’s almost perfect for stationary use. I also understand the necessity for the cable, if only for power. An on-board power source would add heft to a, let’s face it, already bulky hmd.\n- weight. Again, not REALLY an issue, for reasons I’ll get into below weight isn’t the most common factor for me coming out of headset and breaking immersion, but (I haven’t looked at specs, nor do I have any other hmd experience to reference) the PSVR2 isn’t exactly light. Even with the cable tether/lighter device it isn’t something I find myself wearing for 2-3 hours at a clip\n- lack of spatial awareness. I totally love strapping into my rig and flipping the headset down and completely losing myself in gran turismo, it’s so easy to lose myself in the game, which is good! Except sometimes I wish I could, like, see where a water bottle is or something. I envision a way to display some sort of marker in-headset to signify a specified location in the real world. It’d be cool to be able to, like, stick a small sensor or something on a water bottle so I could see where it is. Longer sessions of drunks rock and gt7 are often interrupted by trying to find something in the real world more often than anything else. And I get that’s a me problem, not a device/tech thing, but it’s my biggest complaint.\n\nThat turned out longer than I thought.",
                          "score": 1,
                          "created_utc": 1744682668.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn2hu9a",
                  "author": "notsurewhereireddit",
                  "body": "Right?  I use VR almost exclusively for meditation (Tripp app).  It is so immersive already and I’m excited to see where they take it.\n\nImmersive storytelling  is going to be incredible too.  Look at how cool Soda Island is even with the super basic graphics!",
                  "score": 1,
                  "created_utc": 1744641918.0,
                  "replies": []
                },
                {
                  "id": "mn27v6i",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1744638716.0,
                  "replies": [
                    {
                      "id": "mn28n86",
                      "author": "DaringDomino3s",
                      "body": "You have to request a demo, it’s guided usage with a bunch of different experiences. You control the headset but it’s under the guidance of an employee. \n\nEven as lame as that sounds the experience is pretty dope.",
                      "score": 12,
                      "created_utc": 1744638973.0,
                      "replies": [
                        {
                          "id": "mn2a409",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 2,
                          "created_utc": 1744639456.0,
                          "replies": [
                            {
                              "id": "mn2baaf",
                              "author": "DaringDomino3s",
                              "body": "That sucks, Maybe. My dad and I tried it out in our local mall, but it’s in a rich retiree area. I have a quest 3 and was still impressed by the demo.",
                              "score": 3,
                              "created_utc": 1744639840.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mn31fcs",
                          "author": "Appropriate-Farmer16",
                          "body": "I did the demo and it was very impressive, but $3,500 is just too much, especially with the Quest 3 bing “good enough “ at $500. I’d pay $1,000 or so for AVP, but not more.",
                          "score": 1,
                          "created_utc": 1744647847.0,
                          "replies": [
                            {
                              "id": "mn32jjm",
                              "author": "DaringDomino3s",
                              "body": "Yeah, I’m hoping this gen was just to get it into some hands and help lay the groundwork for a mass-market-friendly release.",
                              "score": 1,
                              "created_utc": 1744648183.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mn312ap",
                  "author": "QuadraticCowboy",
                  "body": "Eh it’s not really that cool.  \n\nWhat we’re learning is that HUDs look useful because they generate self-evident proof points that the AI is “assisting” the user.  They provide colorful, novel experiences that make the user happy.\n\nHowever their actual usefulness is minimal, because their use cases compete with smartphones, and a good device with sensors and AI outperforms a 3d goggle display because (1) better battery and mobility (2) easier interface.\n\nWe probably won’t get another killer portable device ever, at least for next 20 years.  The only consumer devices we’ll get will be (1) drones for last-mile deliveries (replacing cars) and (2) AI hubs for home use (ie PCs) acting as a privacy firewall so AI can operate in edge without sending raw private data to cloud servers. ",
                  "score": -1,
                  "created_utc": 1744647737.0,
                  "replies": [
                    {
                      "id": "mn33cvh",
                      "author": "veryverythrowaway",
                      "body": "I’m just saying that it’s one of the best products of its kind out there, because the tech is really cool. I made no assertions about usefulness, but I also disagree with your opinion. This is not a smartphone for your face, it feels like you’re using MacOS from the inside.",
                      "score": 2,
                      "created_utc": 1744648428.0,
                      "replies": [
                        {
                          "id": "mn3qmq5",
                          "author": "QuadraticCowboy",
                          "body": "Makes sense!  It’s definitely cool tech.  \n\nI’m just evaluating the “cool” factor vs market adoption.  I don’t think it’s cool enough for mass market.  ",
                          "score": 1,
                          "created_utc": 1744655256.0,
                          "replies": [
                            {
                              "id": "mn4g3r1",
                              "author": "veryverythrowaway",
                              "body": "Definitely not ready for mass adoption for several reasons, I agree. Future versions will be more and less compelling, but by a fourth-generation product, Apple is usually in the zone by then.",
                              "score": 1,
                              "created_utc": 1744662966.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn299ci",
              "author": "whopperlover17",
              "body": "I have an AVP and every time I put it on, it’s magic. It’s incredible. Higher FOV and lighter and you have a winner.",
              "score": 3,
              "created_utc": 1744639174.0,
              "replies": []
            },
            {
              "id": "mn2aa5f",
              "author": "Dude312FDoT",
              "body": "VR is old tech! And seeing how a conglomerate like apple is failing and even Meta shows the public has very little interest in these products, but for some reason they want to shove it out, and it’s not cheap either 3k for a headset ?? Very niche market for this junk…",
              "score": -6,
              "created_utc": 1744639512.0,
              "replies": [
                {
                  "id": "mn2hfu0",
                  "author": "DarthBuzzard",
                  "body": ">  and it’s not cheap either 3k for a headset \n\nWhy do you think it's not cheap? Because it's actually new tech, not old tech.",
                  "score": 3,
                  "created_utc": 1744641792.0,
                  "replies": [
                    {
                      "id": "mn32ylk",
                      "author": "LongBeakedSnipe",
                      "body": "You can label your product as new tech, but it doesn't really mean much if it does almost nothing novel compared with it's competition.\n\nThat said, the markup is expected on apple products, and if you add that markup onto the price of top end headsets the price does make sense.\n\nBut I think there is a certain amount of 'suspending disbelief' involved with convincing oneself that this was expensive because it was new tech. It was higher end with a whopping markup—that's all.",
                      "score": 0,
                      "created_utc": 1744648309.0,
                      "replies": [
                        {
                          "id": "mn3d73y",
                          "author": "DarthBuzzard",
                          "body": "> that this was expensive because it was new tech. It was higher end with a whopping markup—that's all.\n\nSourcing the displays alone costs about as much as the entire Quest 3 headset. I don't doubt they're making a decent profit per device sold, but Vision Pro uses a lot of expensive technology.",
                          "score": 1,
                          "created_utc": 1744651350.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn2jd3u",
              "author": "Hobbit1996",
              "body": "Because apple doesn't let people use the shit they buy? If buying an apple product means i have to buy all their shit and still be limited to features THEY think i want i'd rather see them fail than see adopt overpriced bullshit. Also a lot of ignorant people will look at it and think VR is still expensive af as it was 10+ years ago because they think only apple products are viable (because others don't work with other apple products they already have)",
              "score": -3,
              "created_utc": 1744642385.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn3c67v",
          "author": "SoSKatan",
          "body": "As an owner of one it has at least one really good use case, watching movies / shows.\n\nIt’s a better home theater than my home theater.  I prefer it over actual theater, and the fact that I can take it with me is wild.",
          "score": 4,
          "created_utc": 1744651050.0,
          "replies": [
            {
              "id": "mn3s8z4",
              "author": "Knut79",
              "body": "Tell me you're single without.....",
              "score": -8,
              "created_utc": 1744655739.0,
              "replies": [
                {
                  "id": "mn3skk9",
                  "author": "SoSKatan",
                  "body": "Not at all, but that’s an odd attempt at an attack for just saying the AVP has a use case.\n\nAm I supposed to say it sucks?",
                  "score": 3,
                  "created_utc": 1744655837.0,
                  "replies": [
                    {
                      "id": "mn3tdci",
                      "author": "VikingBorealis",
                      "body": "It's kinda weird to watch a movie on a vr headset surrounded by your family \n\nAlso kinda weird to call it an attack, also kinda weird to reply and the immediately block the other person...  That's how trolls operate.",
                      "score": -1,
                      "created_utc": 1744656084.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn3nlya",
          "author": "pixel_of_moral_decay",
          "body": "People forget this isn’t a new pattern. Just on a different scale.\n\nThe original iPod was seen as too expensive too. It sold, but not nearly how people hoped/expected. Those tiny hard drives weren’t even in high scale production at the time, so the amount they could produce was limited.\n\nThe cheaper models later on are what really gained traction and brought people into the ecosystem, and led to them eventually upgrading to the larger more expensive iPods.\n\nThen the iPhone was a shift of that platform again.\n\nI think this is the same. But on a different scale, it will take a few iterations, but cheaper models will hook people in, and then we’ll see wider adoption.\n\nStill not sure what the iPhone type use case will be that makes it ubiquitous.",
          "score": 4,
          "created_utc": 1744654353.0,
          "replies": []
        },
        {
          "id": "mn2gv30",
          "author": "Duosion",
          "body": "I got to try the first iteration and the eye tracking is suuuper neat!",
          "score": 2,
          "created_utc": 1744641613.0,
          "replies": []
        },
        {
          "id": "mnfhyjc",
          "author": "ssnoopy2222",
          "body": "This is false. The only product line apple has put out which didn't start great was the iPad. Everything else has been great from the start cuz they successfully copied the best parts of everyone else's products. Apple failed to solve the main problem of VR headsets which is the lack of support.",
          "score": 1,
          "created_utc": 1744819772.0,
          "replies": []
        },
        {
          "id": "mn4gkyh",
          "author": "SloanWarrior",
          "body": "Then they'll claim to have made all of the other tech that people have been using for years by calling it somethig else, then marketing it really well.\n\nI'm not an Apple hater, but they charge WAY too much money for anything but the most basic hardware and their determination to make their machines un-upgradeable is a big turnoff for me. I had a unibody itel macbook back in the day and I loved it. It was a bit more expensive but it was well-buillt. The prices these days for extra RAM ad so on are INSANE.",
          "score": 0,
          "created_utc": 1744663112.0,
          "replies": []
        },
        {
          "id": "mn7a5m0",
          "author": "redfacemonkey",
          "body": "It is on the backs of slave labor that they can innovate. Good job, humans.",
          "score": 0,
          "created_utc": 1744705785.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn2e67g",
      "author": "None",
      "body": "This was Apple plan all along. get everyone all excited about the vision knowing most people can’t afford it then release a cheaper one and watch the money flow in.",
      "score": 42,
      "created_utc": 1744640763.0,
      "replies": [
        {
          "id": "mn2n3cr",
          "author": "evilbarron2",
          "body": "Congratulations - you have just discovered the “Halo Effect” and the concept of “Flagship Products” in business strategy and marketing.\n\nIt’s why manufacturers run ads focused on their highest-end products even though most consumers will purchase their midrange or economy products.\n\nI guess I forget this isn’t obvious to everyone",
          "score": 26,
          "created_utc": 1744643531.0,
          "replies": [
            {
              "id": "mn3uth4",
              "author": "Witty-Restaurant-392",
              "body": "Like when the Apple Watch came out they had a 17k version",
              "score": 8,
              "created_utc": 1744656524.0,
              "replies": [
                {
                  "id": "mn4o11i",
                  "author": "evilbarron2",
                  "body": "Same basic concept, although the Watch is a bit of an odd duck in the Apple lineup, mainly because of high-end watch enthusiasts/collectors - they’re a weird group with some really specific wants.",
                  "score": 2,
                  "created_utc": 1744665423.0,
                  "replies": []
                },
                {
                  "id": "mn7eepx",
                  "author": "Sn0000py",
                  "body": "Oh yeh I remember that. What a waste that was.",
                  "score": 1,
                  "created_utc": 1744708621.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mn462nd",
              "author": "Public-Restaurant968",
              "body": "The problem isn’t solely on the pricing side. I could afford a Vision Pro, but the capabilities aren’t that exciting to me. Even at $1k not sure if I’d buy it unless there were more significant libraries of immersive videos or games or apps. \n\nWith flagship products you’re anchoring other differentiating feature as worth it or you’ll settle for the “inferior version”. But in this case, the core use cases aren’t exciting to the general consumer market.",
              "score": 5,
              "created_utc": 1744659985.0,
              "replies": [
                {
                  "id": "mn4nl89",
                  "author": "evilbarron2",
                  "body": "That’s a valid concern, but again - you’re really not the target market. The target market is your yuppie sister who knows nothing about MR, or your neighbor who’s always bringing over a new microbrew. Do you think those folks will look at a future Vision product and not buy it because the App Library isn’t as big as they expected? \n\nRemember that this exact complaint was repeated by tech commentators at the iPhone’s launch when explaining why it would never take off. I just don’t think that’s how the public’s mind works.",
                  "score": 1,
                  "created_utc": 1744665281.0,
                  "replies": [
                    {
                      "id": "mn4ohx2",
                      "author": "Public-Restaurant968",
                      "body": "It’s not about the future product. It’s about getting market fit for what you buy it for today. \n\nLet’s assume my sister is a prototypical persona you’re talking about, give me 3 use cases an AVP would deliver on usage at least 3-4 times a week? Yeah, not much. \n\nThis is about buying something and being let down once you realize you don’t get much value out of it. It’s like Apple and its intelligence pitch. Have you tried it? Massively underwhelming considering the alternatives. I’m a massive Apple fan, I tried the AVP for a week, so did my wife and friends. Outside of the initial cool factor, I didn’t have much reason to use it on a weekly basis.\n\nThat’s probably why Meta Ray Bans were such a hit and why Apple is desperate for to win that part of the market. Meta is building that entry level product that can upgrade into something more advanced (ie their Quest). You need people to try before you can convince them to buy (and not return).",
                      "score": 1,
                      "created_utc": 1744665573.0,
                      "replies": [
                        {
                          "id": "mn4rfsq",
                          "author": "evilbarron2",
                          "body": "Yes, I’ve tried it. I also own a Quest 3 which I try to use daily. I’m not a gamer - the only game I play is Demeo and occasionally the MR action games. I constantly *try* to use it for watching movies and work, but the UI is so user-hateful that I always give up after a short while. I *never* forget I’m wearing the headset.\n\nNow the AVP is also heavy. But in my one day of getting to use it (it’s nice to have rich geek friends), I did get into the zone multiple times while using it for work at my desk, on my couch, outside on the deck, even (apologies) on the toilet. The quality of the experience, including but not limited to the realism of digital objects placed IRL, *is* the killer app in my opinion. There wasn’t anything specific I did, but there wasn’t anything I couldn’t do that I wanted to, and it worked pretty smoothly. I definitely noticed when I took it off, but then I also notice pain in my back and wrists after spending hours at my laptop.\n\nI can’t tell you what any specific person will use a Vision product for, any more than I can tell you what your most important use-case for your laptop is. What I am comfortable saying is that whatever people want to use Vision products for, it will involve far less friction to access on an Apple Vision device than on any other current headset (it remains to be seen how smoothly Android XR works). This is what Apple is selling, and it is perennially undervalued by enthusiasts willing to put up with all sorts of hassles and roadblocks to do stuff with VR/MR.",
                          "score": 1,
                          "created_utc": 1744666527.0,
                          "replies": [
                            {
                              "id": "mn4sjgb",
                              "author": "Public-Restaurant968",
                              "body": "I’m enjoying this back and forth btw.\n\nI do think as computing device, the world has fundamentally changed where you can do a lot of things previously reserved for beefy CPUs or tons of memory, all can be done via the cloud now. \n\nAnd as for the larger screen, I think once they introduce their version of a foldable screen to where a big screen can fit in your pocket or backpack, then the debate would you prefer one form factor over another, at least for the turn being until the headset tech isn’t so bulky.\n\nNow if we get to the world where you can use a generative AI to generate a new immersive worlds and choose your own adventure and personalize every aspect of it, then the content library will become infinite and it’ll be about who has the best immersive headset.",
                              "score": 1,
                              "created_utc": 1744666885.0,
                              "replies": [
                                {
                                  "id": "mn4u5ji",
                                  "author": "evilbarron2",
                                  "body": "I’m enjoying this too - rare to be able to chat like adults on Reddit.\n\nIn re: laptops - I agree that laptops are changing. I use mine for “heavy” work like coding or graphics. More and more, I do my admin stuff on my iPad or phone. But I used that just as a comparative example - if I owned an AVP, I suspect I’d use it as a replacement for my laptop and not as a replacement for my phone or iPad. Basically for those times the tool/experience required it or I want to block out distractions. It’s more about focus than computing power I guess is what I’m trying to say.\n\nLet me ask: if I gave you an AVP for free right now, what do you think you’d use it for a week from now, once the novelty wore off? Or what would you *want* to se it for, even if the capability isn’t there yet?",
                                  "score": 1,
                                  "created_utc": 1744667414.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mn57j32",
              "author": "_Papagiorgio_",
              "body": "Dang dude you sound smart",
              "score": 2,
              "created_utc": 1744672043.0,
              "replies": [
                {
                  "id": "mn5q0gc",
                  "author": "evilbarron2",
                  "body": "I mean, we live in it man. How can you not notice how it works?",
                  "score": 2,
                  "created_utc": 1744678527.0,
                  "replies": [
                    {
                      "id": "mn6zw0w",
                      "author": "Montana_Gamer",
                      "body": "It is a lot of thought towards one specific kind of marketing. You are just lacking in self awareness. People have lives.",
                      "score": 1,
                      "created_utc": 1744699145.0,
                      "replies": [
                        {
                          "id": "mn7qe2x",
                          "author": "evilbarron2",
                          "body": "If they dont notice basic everyday shit like this, you really sure they have lives?",
                          "score": 0,
                          "created_utc": 1744715560.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn1xfi9",
      "author": "WheyTooMuchWeight",
      "body": "I know we’re all going to keep ripping on it - but I have way more faith in Apple to create a VR headset that the common man will actually want to use. \n\nEvery VR setup I’ve used, in one way or another, still feels kinda janky. The seamlessness that is required to make it appealing to someone who isn’t a nerd is a high bar to reach.\n\nSo imma keep cheering for it, just about the only hardware innovation Apple is doing these days anyways.",
      "score": 92,
      "created_utc": 1744634951.0,
      "replies": [
        {
          "id": "mn4j6s4",
          "author": "SolidOshawott",
          "body": "I was honestly blown away when I tried the Vision Pro at a store. It's by far the best experience of it's kind, it's just lacking... Well, either the software to justify its price, or a price to justify its software.",
          "score": 28,
          "created_utc": 1744663903.0,
          "replies": []
        },
        {
          "id": "mn244wd",
          "author": "thelionsmouth",
          "body": "Couldn’t agree more. I’ve dealt with so many different operating systems and Apple OS is just so reliably smooth. I would trust it with my wife haha\n\nLinux, even windows are usable but sometimes the lore is DEEP and not wife friendly.",
          "score": 8,
          "created_utc": 1744637423.0,
          "replies": [
            {
              "id": "mn2dysm",
              "author": "coffeesour",
              "body": "*Apple OS enters the chat*",
              "score": 2,
              "created_utc": 1744640698.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mn5g2wk",
          "author": "Gingerstachesupreme",
          "body": "Hey we almost have the same Snu.",
          "score": 1,
          "created_utc": 1744674991.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn1w0a8",
      "author": "None",
      "body": "[deleted]",
      "score": 10,
      "created_utc": 1744634392.0,
      "replies": [
        {
          "id": "mn6c3hm",
          "author": "spitechecker",
          "body": "Mac tethered. Yeah me too",
          "score": 3,
          "created_utc": 1744686875.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn2v19w",
      "author": "Ricothebuttonpusher",
      "body": "The concept of tethering it to any of my Apple devices is far better than it being its own OS.",
      "score": 3,
      "created_utc": 1744645921.0,
      "replies": []
    },
    {
      "id": "mn2cbxr",
      "author": "tacmac10",
      "body": "What? this is inconceivable the super genius redditers on r gadgets and r technology assured me that the Apple Vision Pro was a complete utter failure and Apple was never bring this product out again. LoL",
      "score": 4,
      "created_utc": 1744640176.0,
      "replies": []
    },
    {
      "id": "mn23sfq",
      "author": "Dildosmoke69",
      "body": "Speech to text still works like shit yet they want to continue to “innovate” \n\nHow about just making things work properly",
      "score": 9,
      "created_utc": 1744637299.0,
      "replies": [
        {
          "id": "mn2br8o",
          "author": "dsharm1724",
          "body": "Completely different fields. Apple has always struggled with software (Siri, AI), hardware is their strong suit.",
          "score": -3,
          "created_utc": 1744639992.0,
          "replies": [
            {
              "id": "mn2e0z3",
              "author": "watduhdamhell",
              "body": "Literally the opposite of what has always been the case? The iPod was a user interface dream. The iPhone \"just works.\" It's the software and user experience with Apple. *Only recently* have they made chips worth a fuck, and even then the snapdragon 8 gen 3 tied that up and the gen 4 is slated to surpass in some areas.\n\nIt's the software. People like the ease of use. If they can't get the ease of use in there, then it's not an apple product. It's a prototype.",
              "score": 2,
              "created_utc": 1744640717.0,
              "replies": [
                {
                  "id": "mnr8hch",
                  "author": "dsharm1724",
                  "body": "They are strong with UI and UX, not all forms of software. Take a look at Siri, voice to text, photo processing, and recently AI. They've always struggled with logical (Non UI) software. Watch the newest MKBHD video if you want more details.",
                  "score": 1,
                  "created_utc": 1744983107.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn3mezr",
      "author": "PhilConnersWPBH-TV",
      "body": "I don't want a headset. I want glasses with built in data.",
      "score": 2,
      "created_utc": 1744654002.0,
      "replies": []
    },
    {
      "id": "mn3njwr",
      "author": "bluefalcontrainer",
      "body": "I thought they stopped producing the AVP? Are they really going to keep this line of products?",
      "score": 2,
      "created_utc": 1744654336.0,
      "replies": []
    },
    {
      "id": "mn3nwlt",
      "author": "Impossible-Glove3926",
      "body": "I mean, everyone knew the first one was a prototype for tech enthusiasts and influencers and proof of concept. While probably going to still be more expensive than most the competitors, much like every other Apple device, it will probably do what it says better than its competition… much like every other Apple device.\n\nBut que the downvotes because Reddit is aggressively anti Apple.",
      "score": 2,
      "created_utc": 1744654443.0,
      "replies": []
    },
    {
      "id": "mn61pbt",
      "author": "yupidup",
      "body": "I love the Meta Quest in terms of hardware, ok on OS, but the obsession of putting me in virtual world community is annoying ; not mentioning the creepy relationship to my private datas. I would trust Apple to make something meant for work, not game and social. But gotta deal with the price though",
      "score": 2,
      "created_utc": 1744682793.0,
      "replies": []
    },
    {
      "id": "mn2yrev",
      "author": "MonkeySafari79",
      "body": "Tariffic",
      "score": 3,
      "created_utc": 1744647036.0,
      "replies": []
    },
    {
      "id": "mn1vxyj",
      "author": "matzoh_ball",
      "body": "They might as well fix their iPhone 16 Bluetooth issues before cranking out new stuff",
      "score": 2,
      "created_utc": 1744634366.0,
      "replies": [
        {
          "id": "mn2t3by",
          "author": "seanzy260",
          "body": "Probably on the table for future C chips to take over.",
          "score": 1,
          "created_utc": 1744645350.0,
          "replies": [
            {
              "id": "mn323az",
              "author": "matzoh_ball",
              "body": "?",
              "score": 1,
              "created_utc": 1744648049.0,
              "replies": [
                {
                  "id": "mn883cx",
                  "author": "HiddenTrampoline",
                  "body": "Apple now makes their own radio modem, called the C1. They will hopefully come out with newer versions and have BT included.",
                  "score": 1,
                  "created_utc": 1744722761.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn25zlv",
      "author": "Blapanda",
      "body": "No one is going to buy it. Their predatory limitation to their own store is not doing anything for the headset functionality at all.\nThe hacks via ALVR and others being able to stream SteamVR on the headset is one thing, but no official support from apple for it, then sitting on an expensive paperweight, nah, is not going to happen.",
      "score": 3,
      "created_utc": 1744638079.0,
      "replies": [
        {
          "id": "mn2qli2",
          "author": "evilbarron2",
          "body": "Apple is completely uninterested in selling to people who know what SteamVR or ALVR even are. The Vision products are simply not for them, any more than a MacBook is designed for someone who enjoys compiling their own Linux kernel.\n\nPlease try to evaluate the AVP in the context of all the other products they’ve ever created - Apple tries to build things that the average person uninterested in the guts of technology can just use. They charge a premium for that ease-of-use, and they actively try to create public desire for their products via pricing and the illusion of scarcity. \n\nAnd it’s working once again - in the public’s mind, the AVP is now positioned as crazily overpriced, but much higher-quality and desirable than the alternatives, like a Bentley SUV compared to Honda and Hyundai SUVs. If the price of a Bentley came down to 2x or 1.5x the price of a Honda CR-V, then a *lot* of people would be looking for a way to afford the Bentley. Apply this to consumer electronics and you have something that looks very much like what Apple’s done in computers, mp3 players, phones, watches, headphones, tablets, smart speakers, set-top boxes, and now MR headsets.\n\nGiven that Apple successfully follows this playbook time and time again, it’s kinda surprising to me that so few people seem to actually grasp this. Ive seen multiple generations of tech writers tie themselves in knots because they just can’t grasp this basic concept.",
          "score": 0,
          "created_utc": 1744644595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn2flsa",
      "author": "MRDfallout",
      "body": "It will $3,399 that is $100 cheaper than the last one, since everyone bought the last one, and to reduce e-waste strap, charger, front cover sold separately /s",
      "score": 1,
      "created_utc": 1744641218.0,
      "replies": []
    },
    {
      "id": "mn2lkog",
      "author": "Spare_Temporary_2964",
      "body": "1st Gen VP users are pretty much peasants now right?",
      "score": 1,
      "created_utc": 1744643063.0,
      "replies": []
    },
    {
      "id": "mn2o3uj",
      "author": "vermontnative",
      "body": "![gif](giphy|c3XhrmfoN5fOpjcl3z|downsized)",
      "score": 1,
      "created_utc": 1744643838.0,
      "replies": []
    },
    {
      "id": "mn2oukf",
      "author": "andreyugolnik",
      "body": "New iteration: cheaper, lighter, and even more useless.",
      "score": 1,
      "created_utc": 1744644063.0,
      "replies": []
    },
    {
      "id": "mn2vr7p",
      "author": "maxaz911",
      "body": "Trump's tariffs \"you said cheaper?? mmm\" :D :D",
      "score": 1,
      "created_utc": 1744646132.0,
      "replies": []
    },
    {
      "id": "mn2wm2x",
      "author": "rtrawitzki",
      "body": "Apple needs to stay in the game. Eventually AR is going to be the next big thing and the companies on the ground floor will become the household names . \n\nThey might lose money each generation but , continued development will lead to the break through product.",
      "score": 1,
      "created_utc": 1744646386.0,
      "replies": []
    },
    {
      "id": "mn2wpp5",
      "author": "butareyouthough",
      "body": "I though Apple gave up on the Vision Pro project",
      "score": 1,
      "created_utc": 1744646416.0,
      "replies": []
    },
    {
      "id": "mn310pj",
      "author": "None",
      "body": "Lighter I like, but cheaper worries me.",
      "score": 1,
      "created_utc": 1744647724.0,
      "replies": []
    },
    {
      "id": "mn3dgwx",
      "author": "BrokkelPiloot",
      "body": "No shit it's cheaper. It was way too expensive.",
      "score": 1,
      "created_utc": 1744651428.0,
      "replies": []
    },
    {
      "id": "mn3imya",
      "author": "SgtSchultz2112",
      "body": "And it will still suck",
      "score": 1,
      "created_utc": 1744652912.0,
      "replies": []
    },
    {
      "id": "mn3k9lr",
      "author": "lithiun",
      "body": "Here’s the thing I hate about VR/AR goggles these days. \n\nThey’re goggles. The computer, the battery, the display, and the cameras all sit in the most uncomfortable position on the front of the head on the face. \n\nWhy is the computing components and battery on the front piece to begin with? You won’t lose quality transmitting over a cable from your face to your ass. You can easily put all of the heavy components elsewhere on the head. Why does it even need to be in the form of goggles to begin with. Make it a mask similar to a face shield. You get less light bleeding through and the weight doesn’t sit on your cheek bones. \n\nThe alternative to that is a gadget the size of regular sunglasses that just isn’t going to have the same capability of a modern vr headset any time soon.",
      "score": 1,
      "created_utc": 1744653375.0,
      "replies": [
        {
          "id": "mn4u5vz",
          "author": "RustywantsYou",
          "body": "The apple one whatever it was called had a small battery on the back of the head like a counterweight and you could also attach to your belt.",
          "score": 1,
          "created_utc": 1744667417.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn3vh07",
      "author": "a_boo",
      "body": "I really hope they manage to land this thing.",
      "score": 1,
      "created_utc": 1744656720.0,
      "replies": []
    },
    {
      "id": "mn4eyyn",
      "author": "Presently_Absent",
      "body": "can't wait for critics to fall over themselves hailing the innovation of the tether. \"Vision users have macs *anyway*, so why not use that latent processing power to drive the display? Genius!!\"\n\nNext thing you know Apple will \"invent\" a headset that *uses your phone as the display and processing unit!!!*",
      "score": 1,
      "created_utc": 1744662619.0,
      "replies": []
    },
    {
      "id": "mn4vy4t",
      "author": "djphatjive",
      "body": "Not cheaper if you have to buy a Mac to use it.",
      "score": 1,
      "created_utc": 1744668013.0,
      "replies": []
    },
    {
      "id": "mn5ikru",
      "author": "dynamicappdesign",
      "body": "I think they need to cut the weight in half",
      "score": 1,
      "created_utc": 1744675877.0,
      "replies": []
    },
    {
      "id": "mn5lz2q",
      "author": "Sambo_the_Rambo",
      "body": "It’s still going to be way overpriced. No thanks.",
      "score": 1,
      "created_utc": 1744677088.0,
      "replies": []
    },
    {
      "id": "mn5qp0w",
      "author": "t3chguy1",
      "body": "Cheaper, but with tariffs it'll be still $3K, plus with dollar crashing today, they will sell 5 units",
      "score": 1,
      "created_utc": 1744678767.0,
      "replies": []
    },
    {
      "id": "mn5ss0s",
      "author": "PJTree",
      "body": "Meh I think if they’re going with the same type of design and functionality, they’re going the wrong way. For starters, it should be based on iOS and be a clone of your phone. That will get people started. Second, it’s too front heavy.",
      "score": 1,
      "created_utc": 1744679524.0,
      "replies": []
    },
    {
      "id": "mn7ah5y",
      "author": "Xenobsidian",
      "body": "Wait, does that mean it’s gonna be an actual product and not a marketing stunt?",
      "score": 1,
      "created_utc": 1744706003.0,
      "replies": []
    },
    {
      "id": "mn9myjo",
      "author": "Groundbreaking-Pea92",
      "body": "Way way behind in ai and robotics and gave up on self driving but still yting to make \"VR\" work",
      "score": 1,
      "created_utc": 1744738325.0,
      "replies": []
    },
    {
      "id": "mnakj1y",
      "author": "lovelife0011",
      "body": "👌",
      "score": 1,
      "created_utc": 1744748363.0,
      "replies": []
    },
    {
      "id": "mnf8cwi",
      "author": "MangoAtrocity",
      "body": "> Mac tethered\n\nI FUCKING CALLED IT. Oh my god if they sell a headset with the same displays, tracking, and pass through as AVP where the only difference is that my Mac does the processing around $1200, I’ll buy without even thinking about it.",
      "score": 1,
      "created_utc": 1744816935.0,
      "replies": []
    },
    {
      "id": "mng18ya",
      "author": "Kyosji",
      "body": "Honestly surprised this is coming out.  From what I understood, the sales of the original were so pore they were dropping it.",
      "score": 1,
      "created_utc": 1744825356.0,
      "replies": []
    },
    {
      "id": "mnhexf0",
      "author": "goldaxis",
      "body": "Remember the gaslighting fake viral social media blitz when this thing came out? They were trying so hard to make it look good and like everyone wanted one. ",
      "score": 1,
      "created_utc": 1744840385.0,
      "replies": []
    },
    {
      "id": "mn1zcgp",
      "author": "gendabenda",
      "body": "The reality is that no one wants to strap things to their face to use them. Apple will figure this out eventually and park the AVP2 next to 3dTVs.",
      "score": 0,
      "created_utc": 1744635673.0,
      "replies": [
        {
          "id": "mn20ma1",
          "author": "Anon44356",
          "body": "I strap a VR headset to my face for 8 hours every day I’m at work. I vastly prefer it to any other setup. There’s a market, it’s to be decided how big that market is",
          "score": 4,
          "created_utc": 1744636147.0,
          "replies": [
            {
              "id": "mn27vcn",
              "author": "BrewKazma",
              "body": "Id love to have a VR desktop instead of the 3 giant monitors I actually have taking up space on my desk.",
              "score": 2,
              "created_utc": 1744638718.0,
              "replies": [
                {
                  "id": "mn3qliw",
                  "author": "Anon44356",
                  "body": "I can properly recommend it. It’s not just the “as many monitors as you like, any size you like” but massively the shutting out the house and properly stepping into an office space without distraction. Worth every single penny.",
                  "score": 2,
                  "created_utc": 1744655246.0,
                  "replies": [
                    {
                      "id": "mn3slup",
                      "author": "BrewKazma",
                      "body": "Now if I could only convince my boss that I need it.",
                      "score": 1,
                      "created_utc": 1744655847.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn1zjhu",
          "author": "DarthBuzzard",
          "body": "VR is alive and doing fine. 3D TVs died out. There is no comparison.",
          "score": 1,
          "created_utc": 1744635746.0,
          "replies": [
            {
              "id": "mn22rqm",
              "author": "gendabenda",
              "body": "VR as a segment has been fighting to grow since the late 80s and still hasn't hit mass-adoption - but you're right, VR is still alive and will eventually hit practical application (I have a PSVR and Quest for example). \n\nBut this is about the AVP 1&2. About walking around with $5000 in Tech strapped to your face the entire time that weighs as much as wearing 30 pairs of sunglasses at the same time. It's just not practical, reasonable or feasible. \n\nApple preys on early tech adopters and trend-setting to sell devices (which works well with a proven device like the iphone) but the AVP has largely been heralded as a flop and missed projections across the board. Will the AVP2 be a hit? I don't see it happening. \n\nhttps://siliconangle.com/2025/01/01/apple-reportedly-ceases-vision-pro-production-amid-sluggish-sales/\n\nhttps://gizmodo.com/apple-vision-pro-u-s-sales-2000469302\n\nhttps://www.forbes.com/sites/jonathanreichental/2024/06/29/apples-vision-pro-is-amazing-but-no-one-wants-it/\n\nhttps://nypost.com/2024/11/12/tech/apples-vision-pro-flop-company-scales-back-production-of-3500-vr-headset-amid-lackluster-sales-customer-complaints/",
              "score": 2,
              "created_utc": 1744636933.0,
              "replies": [
                {
                  "id": "mn240wh",
                  "author": "DarthBuzzard",
                  "body": "I wouldn't take the word of tech journalists at face value for what is a flop and what isn't. What these journalists fail to realize is that Apple had only enough parts for around 500k units to be manufactured in its first year, and that was because the supply chain for MicroOLED displays is still very immature. \n\nVR only had its first consumer run in the 1990s, as the 1980s days was purely enterprise and arcade solutions. After the small 1990s run, no one attempted VR again until the 2010s. Investment over time rather than time by itself is how technology matures, so it's no surprise that VR hasn't taken off yet since it's immature technology with a lot of future advancements cooking behind the scenes.\n\nThere is no expectation at Apple that AVP2 will be a hit. Perhaps not even AVP3, because that's the Pro line. Apple intends to release a non-Pro line at some point, and they're well aware that it will take multiple iterations to be a hit because the path to maturity is quite long.",
                  "score": 0,
                  "created_utc": 1744637383.0,
                  "replies": [
                    {
                      "id": "mn36wob",
                      "author": "gendabenda",
                      "body": "I posted this on another comment, but I tried to ignore sensationalist views and focus on numbers: \n\nThere are approx 1.4 billion iphone users globally, whereas estimated total sales of AVP are ~500k. That is 0.04% adoption rate and declining.\n\nOn average, ~8% of iphone users buy a new iphone annually - this is the market they needed to penetrate. That equates to 112 million units. These are people willing to blow $1000+ just to have the latest thing with small incrememental upgrades and do-so annually. Yet only 0.45% of those super early adopters bothered with the AVP (500,000 AVP sales / 112 million iphone 16 upgrades).\n\nLess than 1% of people who blow thousands on Apple products annually bothered. That's a flop to me and everyone else. Get that 500,000 number to 11 million and we can talk (although I wouldn't be surprised if the AVP2 numbers were softer)",
                      "score": 1,
                      "created_utc": 1744649496.0,
                      "replies": [
                        {
                          "id": "mn3dhyo",
                          "author": "DarthBuzzard",
                          "body": "> That's a flop to me and everyone else\n\nYour definition of a flop isn't relevant though. A flop is only a flop if it falls behind a company's expectations. Apple Vision Pro was only meant to sell at maximum 500k units in its first year.",
                          "score": 0,
                          "created_utc": 1744651437.0,
                          "replies": [
                            {
                              "id": "mn3hwdu",
                              "author": "gendabenda",
                              "body": "> Apple Vision Pro was only meant to sell at maximum 500k units in its first year.\n\nSays who? This entire launch has been entirely surrounded by rumor-milling and speculation. You're simply taking the most common EOY rumor \"they sold around 500k units\" and comparing it to the low end of production rumors \"they've already assembled approx. 500-600k this year\" and saying \"well it's 1:1 so that's a success\". \n\nYou could also rumor-mill the 600k as well (a short of 100k units) and claim it missed projections by $350,000,000. \n\nShow some proof somewhere - I can show views all day of how it disappointed; give me some views where it's a success.",
                              "score": 1,
                              "created_utc": 1744652702.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn22b0f",
          "author": "cuacuacuac",
          "body": "Nobody?  ( ͡° ͜ʖ ͡°)",
          "score": 0,
          "created_utc": 1744636766.0,
          "replies": []
        },
        {
          "id": "mn222sp",
          "author": "WordplayWizard",
          "body": "People like you used to say “Ewww wireless headphones look stupid.”\n\nI love my Vision Pro.  I use it almost every day.  I throw my stock charts up around the room, to keep an eye on the markets, while I watch a video or movie.  Got my reminders and calendar up to glance at.  Timers in view if something is in the oven / BBQ.",
          "score": -2,
          "created_utc": 1744636683.0,
          "replies": [
            {
              "id": "mn34ee8",
              "author": "gendabenda",
              "body": "No one thought wireless headphones looked stupid - everyone immediately understood the value of removing the cord. The value-add far out-weighed the newly-created issues (largely losing them and needing to charge them) and they are now mainstream pretty much everywhere. \n\nThere are approx 1.4 billion iphone users globally, whereas estimated total sales of AVP are ~500k. That is 0.04% adoption rate and declining. \n\nOn average, ~8% of iphone users buy a new iphone annually - this is the market they needed to penetrate. That equates to 112 million units. These are people willing to blow $1000+ just to have the latest thing with small incrememental upgrades and do-so annually. Yet only 0.45% of those super early adopters bothered with the AVP (500,000 AVP sales / 112 million iphone 16 upgrades). \n\nLess than 1% of people who blow thousands on Apple products bothered. That's a flop to me and everyone else.",
              "score": 0,
              "created_utc": 1744648754.0,
              "replies": [
                {
                  "id": "mn399ro",
                  "author": "WordplayWizard",
                  "body": "WRONG.   There was an initial backlash against the original AirPods.  I am an early adopter of tech and I remember when people were complaining about the sound quality reduction due to the lossy Bluetooth spec at the time, aha a LOT of people said they looked ridiculous.  Now we don’t even think about it.  \nDon’t try to rewrite history.",
                  "score": 1,
                  "created_utc": 1744650189.0,
                  "replies": [
                    {
                      "id": "mn3d9bz",
                      "author": "gendabenda",
                      "body": "You said wireless headphones - not Airpods. People have always understood and eagerly awaited true lossless, comfortable wireless headphones. People complained about Airpods when they launched absolutely - but it wasn't because they didn't value the innovation or how they looked, it was entirely because they were insanely expensive with subpar sound, were lost constantly, had poor battery life and were essentially impossible to repair (cost was almost if not identical to replace at genius bars as it was to repair one).",
                      "score": 1,
                      "created_utc": 1744651368.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn2n0lt",
      "author": "No_Mercy_4_Potatoes",
      "body": "Cheaper meaning..... 2k instead of 3k? That's still way overpriced for what it is.",
      "score": 1,
      "created_utc": 1744643508.0,
      "replies": []
    },
    {
      "id": "mn2dutb",
      "author": "jspikeball123",
      "body": "The windows VR game library is not that large and osx's is even smaller. I do not see how adding tethering is going to save the vision ecosystem especially with apples hardware choices. There are just better solutions for less money from companies with way more experience.",
      "score": 1,
      "created_utc": 1744640663.0,
      "replies": [
        {
          "id": "mn2e2yz",
          "author": "BrewKazma",
          "body": "They arent aiming for the game market.",
          "score": 2,
          "created_utc": 1744640735.0,
          "replies": [
            {
              "id": "mn2ncy6",
              "author": "evilbarron2",
              "body": "I’m constantly amazed at how few people seem to grasp this simple, basic fact about the AVP",
              "score": 2,
              "created_utc": 1744643611.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn3s3yw",
      "author": "None",
      "body": "[removed]",
      "score": 1,
      "created_utc": 1744655697.0,
      "replies": [
        {
          "id": "mn401sf",
          "author": "Chronotaru",
          "body": "Meta subsidise their headsets into oblivion and they're twice that. No, probably sub-$1000 but definitely not that low.",
          "score": 2,
          "created_utc": 1744658111.0,
          "replies": [
            {
              "id": "mn6hflk",
              "author": "None",
              "body": "[removed]",
              "score": 1,
              "created_utc": 1744689207.0,
              "replies": [
                {
                  "id": "mn76mwn",
                  "author": "Chronotaru",
                  "body": "They can be and this is irrelevant. You can compare it to PSVR2 instead which is tethered to PC or PS5 and it's again twice that price, and the Mac one like all Apple products will be aimed more upmarket.",
                  "score": 1,
                  "created_utc": 1744703466.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mn1x3go",
      "author": "Hoserposerbro",
      "body": "Did you see the new ai project that can deliver any sporting event like a Yankees game (for example) in real time 3D, meaning you can view it from any location or viewing angle, putting yourself in the POV of the batter or any other player at any time? That is the type of technology that is going to make VR goggles an every household electronic\n\nEdit: the company behind it is called Arcturus",
      "score": 0,
      "created_utc": 1744634822.0,
      "replies": [
        {
          "id": "mn1z4qw",
          "author": "mittelwerk",
          "body": "Isn't the point of watching sporting events on TV the fact that whoever is broadcasting the event picks the best angles and also tells the viewer what's happening? As an example: if a player, say, scores a three-point shot, or gets a foul, the broadcasting team immediately cuts to the play or the player in question while the commentator explains what happened, while also replaying the scene. If I were to watch the game \"like I was there\", I would miss those plays. It would be great as a novelty but, after the novelty wears out, I can't see myself watching an sports event that way (not to mention, it still would have to deal with the limitations of modern VR, like narrow FOV and motion sickness. Imagine watching, say, a Formula 1 race from the driver's POV 🤢🤮)",
          "score": 4,
          "created_utc": 1744635593.0,
          "replies": [
            {
              "id": "mn20gkq",
              "author": "None",
              "body": "It depends on if you prefer to attend events or view on tv.",
              "score": 1,
              "created_utc": 1744636088.0,
              "replies": []
            },
            {
              "id": "mn2norj",
              "author": "Hoserposerbro",
              "body": "And the car will never replace the horse drawn buggy.\n\nEdit: you’re also for some reason assuming anything you said isn’t possible with this new technology?  The point is you can view it anyway you want to. And many people are going to enjoy feeling like they’re part of the game or reviewing a bad pitch from the catcher’s view behind the plate.",
              "score": 1,
              "created_utc": 1744643711.0,
              "replies": [
                {
                  "id": "mn2ort2",
                  "author": "mittelwerk",
                  "body": "Modern VR is not even close to the Ford T. I mean, do we have full-body immersion? Wide FOV? Complete, holodeck-style freedom to move in all directions like we move IRL i.e. by walking? And last, but not least: did we cure VR-induced motion sickness, something that [we don't even know what actually causes it](https://en.wikipedia.org/wiki/Motion_sickness#Pathophysiology)? Then, and only then, VR solves all those issues, we can talk about VR becoming mainstream.",
                  "score": 1,
                  "created_utc": 1744644040.0,
                  "replies": [
                    {
                      "id": "mn3aw6d",
                      "author": "Hoserposerbro",
                      "body": "I was comparing the AI tech to the advent of the automobile. Not VR. And I wasn’t saying it’s going to change the world, merely that specific medium of sports entertainment. But I see where my comment was not specifically clear to that so I understand your response. However, we’re talking about two different things.",
                      "score": 1,
                      "created_utc": 1744650677.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mn2045r",
          "author": "None",
          "body": "That’s right. Court side seats, immersive experience.  It will sell",
          "score": 1,
          "created_utc": 1744635960.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn1x1hz",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1744634800.0,
      "replies": [
        {
          "id": "mn1z12b",
          "author": "DarthBuzzard",
          "body": "> glad they listen\n\nIf Apple always listened, they wouldn't be a notable company. As Steve Jobs said: *\"Some people say give the customers what they want, but that's not my approach. Our job is to figure out what they're going to want before they do. I think Henry Ford once said: If I'd ask customers what they wanted, they would've told me a faster horse. People don't know what they want until you show it to them. That's why I never rely on market research. Our task is to read things that are not yet on the page.\"*\n\nApple began by jumpstarting the PC industry, something that consumers did not ask for.",
          "score": 4,
          "created_utc": 1744635554.0,
          "replies": [
            {
              "id": "mn24h08",
              "author": "None",
              "body": "So true… recently started using MacOS, and at first I was skeptical, but I actually prefer it now",
              "score": 1,
              "created_utc": 1744637543.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn293vj",
      "author": "NickMalo",
      "body": "The first went well /s\n\nLet’s see if they get rid of the separate battery you need to pocket",
      "score": 0,
      "created_utc": 1744639125.0,
      "replies": [
        {
          "id": "mn2e7hi",
          "author": "BrewKazma",
          "body": "A tethered headset will, but if you are going wireless, that is the ideal way to do it.",
          "score": 2,
          "created_utc": 1744640774.0,
          "replies": [
            {
              "id": "mn3q2kq",
              "author": "NickMalo",
              "body": "Dont get the wrong idea. I think it was very interesting as a headset, especially for multiscreen use.\n\nOther headsets have batteries built into them/into the headband. I understand its extra weight but its arguably more convenient than having that battery brick in my pocket. This, along with better battery life and a price drop, would make these sell extremely well.",
              "score": 1,
              "created_utc": 1744655090.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn2tqfh",
      "author": "nanapancakethusiast",
      "body": "Why? Who wants this?",
      "score": 0,
      "created_utc": 1744645539.0,
      "replies": []
    },
    {
      "id": "mn2y8oa",
      "author": "edogzilla",
      "body": "I thought they were giving up on this crap that nobody wants?",
      "score": 0,
      "created_utc": 1744646875.0,
      "replies": []
    },
    {
      "id": "mn3afcz",
      "author": "superheroninja",
      "body": "Earth to Apple, READ THE ROOM. \n\nno one wants this overpriced shit in a massive market downturn. This should have been out 4-5 years ago if you really wanted to compete, and you missed the boat.",
      "score": 0,
      "created_utc": 1744650539.0,
      "replies": [
        {
          "id": "mn3hd7z",
          "author": "DarthBuzzard",
          "body": "> This should have been out 4-5 years ago if you really wanted to compete\n\nHow was it supposed to magically release 4-5 years ago when the technology in this headset wasn't possible to be manufactured back then?",
          "score": 2,
          "created_utc": 1744652548.0,
          "replies": [
            {
              "id": "mn4egiq",
              "author": "superheroninja",
              "body": "VR headsets have been around for well over 10 years. My point is that Apple doesn’t innovate like they used to.",
              "score": 1,
              "created_utc": 1744662463.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn3afvw",
      "author": "superheroninja",
      "body": "Earth to Apple, READ THE ROOM. \n\nno one wants this overpriced shit in a massive market downturn. This should have been out 4-5 years ago if you really wanted to compete, and you missed the boat.",
      "score": 0,
      "created_utc": 1744650544.0,
      "replies": [
        {
          "id": "mn3ob3k",
          "author": "K1ngofnoth1ng",
          "body": "That is what everyone said when Apple started making computers. It is also what everyone said when Apple started making phones… maybe Apple might know what they are doing.",
          "score": 1,
          "created_utc": 1744654562.0,
          "replies": [
            {
              "id": "mn4e3c0",
              "author": "superheroninja",
              "body": "No they don’t. They used to when Steve was still alive, but Tim is not a visionary. VR/AR is not a household product. A gimmick yes, and not everyone needs it to get on with life.",
              "score": 0,
              "created_utc": 1744662354.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mn3cpky",
      "author": "darlin133",
      "body": "No one wants these. Honestly stop trying to make VR happen",
      "score": 0,
      "created_utc": 1744651211.0,
      "replies": [
        {
          "id": "mn3hl4x",
          "author": "DarthBuzzard",
          "body": "\"No one wants PCs. Stop trying to make PCs happen, Apple.\" (a lot of people said this back in the 1970s/1980s).\n\nAlternate future: Apple doesn't even exist because they never made the PC products that first got them recognition.",
          "score": 2,
          "created_utc": 1744652612.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mn249ta",
      "author": "None",
      "body": "If only we could tinker with this thing in the software. So we don’t have to rely on Apple for software updates",
      "score": -1,
      "created_utc": 1744637472.0,
      "replies": []
    },
    {
      "id": "mn2sf3x",
      "author": "cominghomelater",
      "body": "bro I'm tired of this shit, can we please just stop at smartphones? we really don't need to keep going.",
      "score": -1,
      "created_utc": 1744645149.0,
      "replies": [
        {
          "id": "mn2wzwv",
          "author": "rocket_beer",
          "body": "Hard disagree, I need ads on my face, louder than the YouTube video I am watching \n\nMy phone just isn’t enough\n\nYou don’t understand, I need more ads!",
          "score": 1,
          "created_utc": 1744646501.0,
          "replies": []
        }
      ]
    }
  ]
}