{
  "post": {
    "title": "Walmart Employees Now Wearing Body Cameras to Keep Them Safe",
    "author": "diacewrb",
    "id": "1hig1o5",
    "score": 4547,
    "created_utc": 1734686277.0,
    "selftext": "",
    "num_comments": 462,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hig1o5/walmart_employees_now_wearing_body_cameras_to/"
  },
  "comments": [
    {
      "id": "m2yjc0x",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1734686277.0,
      "replies": []
    },
    {
      "id": "m2yw1fj",
      "author": "scorpion_tail",
      "body": "I actually worked at a Walmart for about six months. \n\nPeople saying they want to use the cameras for workplace surveillance aren’t aware that your location and activity are already being monitored. Most employees opt-in to clock in and out using an app. Even if you don’t use the app for this, you still basically need the app anyway for their ongoing learning / training mandates. The app has location tracking and it’s pretty tight (I would test it to see how far from the door it would allow me to clock in—15 feet past the entrance inside.) \n\nEven if you don’t have a cell phone they will give you a device such as a company cell, or radio. As an employee, you are being constantly observed. \n\nThe store I worked in was packed with cameras. I’d guesstimate they numbered more than 300. These aren’t just cameras up above the aisles. They are above all the self-checkouts, behind counters, and in the staffing areas. \n\nThat store had a two-person security team who spent much of their shifts sitting in front of about a dozen monitors.\n\nOne very, very big concern for corporate is a mass shooting within the store. During training we went through three different segments focused on mass shootings. This included two computer-based segments and one store walk-through and drill to locate the best safer spaces during an emergency. \n\nI cannot stress enough how concerned they are about this. The only thing that worries them more are spills. \n\nWhat body cams can track better than any app is an employee who walks away from a spill. When you report to work they don’t give you any “spill time,” so a jug of milk busting during your shift can totally offset the rest of your day. I had one jar of salsa break on me, and the next 2.5 hours were spent dealing with that alone. There is the ideal Walmart that is presented in a training program, and there’s the real one you work in where you actually can’t find any of the bullshit you need to quickly clean a spill. \n\nThey say the cams are for safety, but they are really there for liability reasons. That’s it.",
      "score": 1061,
      "created_utc": 1734694889.0,
      "replies": [
        {
          "id": "m2z34r5",
          "author": "None",
          "body": "This is why when a job requires me to use a phone to do anything I say only if you are paying for a portion of my phone.  You don’t get to use my property for free as a cost of business.",
          "score": 462,
          "created_utc": 1734698680.0,
          "replies": [
            {
              "id": "m2z4ykb",
              "author": "Hail-Hydrate",
              "body": "And unfortunately, depending on who you're saying that to and when, they may simply tell you to find a job elsewhere. \n\nCheaper to hire another of the dozen people waiting than spend $50 on a cheap smartphone for an employee.",
              "score": 299,
              "created_utc": 1734699539.0,
              "replies": [
                {
                  "id": "m2z550z",
                  "author": "None",
                  "body": "And this is why unions are important",
                  "score": 311,
                  "created_utc": 1734699621.0,
                  "replies": [
                    {
                      "id": "m2zko91",
                      "author": "Mama_Skip",
                      "body": "Unions are one of those things that I legitimately have no idea what the counter argument is. \n\nI understand the real reasons are that corporate America has been seeding the media with anti union propaganda, but on paper?\n\nLike, no, workers *shouldn't* be able to defend themselves against predatory capitalists because... uh. get back to work, slave.",
                      "score": 202,
                      "created_utc": 1734705979.0,
                      "replies": [
                        {
                          "id": "m2zu91k",
                          "author": "HalYourPal9000",
                          "body": "Former long haul trucker here. Fellow drivers complained about unpaid time at docks, unpaid time for repairs, unsafe trucks, forced dispatch, etc. I would say, obviously, \"Organize.\" The only argument ever was \"mandatory union dues.\"  Then they went out and bought unreimbursed brooms to sweep out the company's trailers, phones to conduct the company's business, etc.",
                          "score": 119,
                          "created_utc": 1734709381.0,
                          "replies": [
                            {
                              "id": "m308u4i",
                              "author": "Blurgas",
                              "body": "Saw an anti-Union ad that was basically \"*You could buy all these toys/games/etc for your kids if you didn't have to pay Union dues!*\"  \nSo much anti-Union propaganda relies on people focusing on short-term gains instead of long-term returns",
                              "score": 112,
                              "created_utc": 1734714267.0,
                              "replies": [
                                {
                                  "id": "m30f3bi",
                                  "author": "justwalkingalonghere",
                                  "body": "I can't remember if that one was Delta or Amazon, but they both constantly falsely advertise about how unions work or try to make it look like they only exist to cost you money",
                                  "score": 46,
                                  "created_utc": 1734716340.0,
                                  "replies": [
                                    {
                                      "id": "m31hk13",
                                      "author": "ThePrussianGrippe",
                                      "body": "I think both did it, just different times and differently worded.",
                                      "score": 15,
                                      "created_utc": 1734729300.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m31ywzz",
                                      "author": "TheKappaOverlord",
                                      "body": "In certain cases this is actually kind of true. But in most major cases, it obviously isn't. my dad exclusively avoids joining the union for the company he works for exclusively because he has to pay them. Also because unless you are 10+ year seniority, you really don't actually benefit. The only benefits hes seen are people who get caught drinking or fucking on the bus, or causing minor accidents that would cost them the job, but they walk because the union.\n\nHes seniority enough now that he gets all the benefits of the Union, without having to actually pay any dues to them. Plus hes friends with the senior level guys in the Union, so they'd protect him anyways as a favor.\n\nIts cherry picking, and smearing the lie part of the white lie so it looks more factual.",
                                      "score": -2,
                                      "created_utc": 1734735539.0,
                                      "replies": [
                                        {
                                          "id": "m33um3q",
                                          "author": "Pixiepup",
                                          "body": "Needing seniority for any kind of anything is something I saw really bite an old roommate of mine getting eith the railroad. The other issue I've personally seen was a really good friend's mom when I was a kid who was pretty high up in the grocery store Union. There was a couple of years of turmoil before all the Union stores were bought out by non-union in our state and during the time of negotiations before then she was constantly being blocked from working. The Union paid some wages, but not enough to live on during that time. As a result, she nearly lost her home and I do remember discussions of filing bankruptcy, but I don't know if she did or not. Collective bargaining can do great things, but a large enough organization is always going to start acting in its own self interest regardless of the personal costs to individuals in that organization.",
                                          "score": 4,
                                          "created_utc": 1734766668.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m32t7h8",
                                  "author": "TheKingofHats007",
                                  "body": "A lot of propaganda in general that fucks people over seems to stem from people focusing on the short term instead of the long term.",
                                  "score": 13,
                                  "created_utc": 1734747773.0,
                                  "replies": [
                                    {
                                      "id": "m32vkr7",
                                      "author": "Blurgas",
                                      "body": "True.",
                                      "score": 3,
                                      "created_utc": 1734748763.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m32yd2i",
                                  "author": "hellosillypeopl",
                                  "body": "How hard is it to understand if the one who has a billion dollars says it’s bad then it’s probably bad for them and not everyone else? Every day of my life I lose a little more faith in humanity, and every day I wake up and am disappointed in a very short amount of time.",
                                  "score": 8,
                                  "created_utc": 1734749948.0,
                                  "replies": []
                                },
                                {
                                  "id": "m38b93g",
                                  "author": "Orange-Blur",
                                  "body": "Right? I am in a union and it’s not that much out of my check either.",
                                  "score": 1,
                                  "created_utc": 1734835451.0,
                                  "replies": []
                                },
                                {
                                  "id": "m37xtdc",
                                  "author": "Hatedpriest",
                                  "body": "A arguement I heard was \"they keep a good man down and a bad man working.\"\n\nIt's hard to fire union workers, and some come across as lazy, though they're following procedure: example, working on machines is a maintenance issue, and if a machine is down half a day, he's either sitting waiting, or something else is found for him to do.\n\nFurthermore, wage caps keep good employees from making more, though those caps are to ensure other benefits are paid, like a retirement fund or insurance.\n\nThat's what I've heard.",
                                  "score": -1,
                                  "created_utc": 1734829780.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m305taa",
                              "author": "ABetterKamahl1234",
                              "body": "> The only argument ever was \"mandatory union dues.\" \n\nAnd I love this argument, as while I can't speak for *all* unions obviously, the most expensive one I was in was 20$ per cheque, and I am too lazy to check my current but they're something like 0.0032% of pay and made the \"significant\" increase notice to raise by 0.001% roughly. \n\nRelatively significant yes, but still. It's often so little you'd both not notice it and the benefits far far *far* outweigh that cost.",
                              "score": 33,
                              "created_utc": 1734713272.0,
                              "replies": [
                                {
                                  "id": "m30oym1",
                                  "author": "Elendel19",
                                  "body": "My dues are about 900-1000 per year, but I get 5 weeks paid vacation, a good pension and at least $10/h more than I would without it. Union dues are less than 0.50 an hour",
                                  "score": 35,
                                  "created_utc": 1734719603.0,
                                  "replies": []
                                },
                                {
                                  "id": "m311w5e",
                                  "author": "yikes_why_do_i_exist",
                                  "body": "it genuinely baffles me how many people i’ve talked to don’t understand related rates. like bro if rate1/rate2 < 1 ur shit get smaller with time. if cost good if profit bad. \n\ncostUnion/costAlone << 1 for so many cases 🫠",
                                  "score": 6,
                                  "created_utc": 1734723946.0,
                                  "replies": []
                                },
                                {
                                  "id": "m37nmht",
                                  "author": "dorath20",
                                  "body": "How much do you make where 20/check is less than 1%?\n\n2000/check would make your 20 be 1%.\n\nI get that you're probably being a little loose with your numbers but if you made 500/check, that 20 is 4%.",
                                  "score": 1,
                                  "created_utc": 1734825603.0,
                                  "replies": []
                                },
                                {
                                  "id": "m3cb829",
                                  "author": "AggressiveToaster",
                                  "body": "You can also organize and become a union of workers that use their leverage as a collective to gain better pay / working conditions without paying dues. Nothing is stopping that. They will be less effective than a union that has a fund to pay workers during a strike, or pay lawyers, but they can still get good things done. Theres really no reason to not unionize.",
                                  "score": 1,
                                  "created_utc": 1734902651.0,
                                  "replies": []
                                },
                                {
                                  "id": "m31koz0",
                                  "author": "JCBQ01",
                                  "body": "Mines percentage based on pay bracket step (so like 15 max plus the 7 for garanteed Healthcare(or at least the illusion of one - <insert angry tirade>) and the possibility for political pull via donation) and it gets me SOOOOOOOO much more than that paltry hour of lost work wages. Like a GARANTEED PENSION as well as naturally higher wages",
                                  "score": 1,
                                  "created_utc": 1734730381.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m308p2o",
                              "author": "Mama_Skip",
                              "body": "This is weirdly parallel to the argument against universal healthcare. \"But you'll have to pay higher taxes.\"\n\nYou're already paying \"taxes\" for private healthcare. It's just that your company takes it out of your paycheck before they give it to you. And most people would pay much less in total costs.",
                              "score": 30,
                              "created_utc": 1734714220.0,
                              "replies": [
                                {
                                  "id": "m33bm20",
                                  "author": "SVXfiles",
                                  "body": "Adding on to that, it would save companies a shit ton of money since they wouldn't be managing and paying plan premiums for every employee. A lot of insurance plans are subsidized by your employer who pays a lot more than you think they do",
                                  "score": 7,
                                  "created_utc": 1734755870.0,
                                  "replies": []
                                },
                                {
                                  "id": "m313pfu",
                                  "author": "PhillAholic",
                                  "body": "There are other legitimate concerns like wait times or availability that might be true, but that's also like saying, I want others to suffer entirely so I don't have to wait which is uncomfortable to say the least.",
                                  "score": -3,
                                  "created_utc": 1734724562.0,
                                  "replies": [
                                    {
                                      "id": "m316p3q",
                                      "author": "Mama_Skip",
                                      "body": ">There are other legitimate concerns like wait times or availability that might be true\n\nThis is claimed exclusively by Americans about Canadian and Euro systems but if you look into it seems to be simply a claim made on social media and that wait times are similar or even less than Americans' on average.",
                                      "score": 10,
                                      "created_utc": 1734725576.0,
                                      "replies": [
                                        {
                                          "id": "m31bw8s",
                                          "author": "PhillAholic",
                                          "body": "I've only heard stories about Dual citizens living in Canada coming into the US for healthcare due to wait times and availability. Logically if we take the current US healthcare system, and add more people to it it'll slow down. It's unknown if access would be expanded if universal coverage happened.",
                                          "score": -1,
                                          "created_utc": 1734727366.0,
                                          "replies": [
                                            {
                                              "id": "m31gma0",
                                              "author": "Mama_Skip",
                                              "body": ">I've only heard stories\n\nSee\n\n>A claim on social media",
                                              "score": 1,
                                              "created_utc": 1734728978.0,
                                              "replies": [
                                                {
                                                  "id": "m31mooo",
                                                  "author": "PhillAholic",
                                                  "body": "I'm not talking about social media. Documentaries, Articles by Canadian media that aren't talking about the US at all. And I'm not against universal healthcare which my comments about only having access in the US because of others not having it should have shown.",
                                                  "score": -2,
                                                  "created_utc": 1734731072.0,
                                                  "replies": [
                                                    {
                                                      "id": "m31tbxu",
                                                      "author": "Mama_Skip",
                                                      "body": "No buddy, *you're the claim on social media*. You have wild claims with no source, I'm talking about you.",
                                                      "score": 4,
                                                      "created_utc": 1734733463.0,
                                                      "replies": [
                                                        {
                                                          "id": "m31vcml",
                                                          "author": "PhillAholic",
                                                          "body": "Well whatever, I'm not going to look it all back up for you, I wasn't even making this point, just referencing a possible argument that I've seen some evidence of. If you care Google it, if not don't.",
                                                          "score": 2,
                                                          "created_utc": 1734734207.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m30eawb",
                              "author": "showyerbewbs",
                              "body": "> The only argument ever was \"mandatory union dues.\" \n\nThey say it like union dues are 70% of your gross pay.  Brief searching shows union dues are typically 1-2% of gross earnings ( NOTE: This is a generalization and varies from union to union ).\n\nThat would have to be insanely lower than the wage theft by the company for unpaid time as listed by OP.  People, generically speaking, struggle with breaking down nuances.",
                              "score": 17,
                              "created_utc": 1734716082.0,
                              "replies": [
                                {
                                  "id": "m33cy2u",
                                  "author": "Kimura2triangle",
                                  "body": "I would add, yes it is often 1-2% of your gross pay…. Which is ~20% higher than it would be without a union. So still a massive net gain.",
                                  "score": 7,
                                  "created_utc": 1734756524.0,
                                  "replies": []
                                },
                                {
                                  "id": "m30gbn9",
                                  "author": "Joeness84",
                                  "body": "my fav was the in warehouse poster that was like \"Union dues could be 700 dollars a year - thats a new gaming console!!!\"   \n\nCompletely ignoring the oftentimes markable increase in pay once unionized...",
                                  "score": 13,
                                  "created_utc": 1734716744.0,
                                  "replies": [
                                    {
                                      "id": "m30humn",
                                      "author": "showyerbewbs",
                                      "body": "That's like what....2 bucks a fucking day?  And I'm counting EVERY day in the year.  You could manipulate people by cutting out time off to make it increase a bit.  \n\nPeople struggle with maths and conversion. They see BIG NUMBER and throw the baby out with the bath water.  It's why A&W restaurants introduced the 1/3 burger it failed.  Because people didn't clearly understand that one-fourth was less than one-third.  I even struggled with it until I was in my 20's",
                                      "score": 10,
                                      "created_utc": 1734717242.0,
                                      "replies": [
                                        {
                                          "id": "m31gaqc",
                                          "author": "Shenaniboozle",
                                          "body": "> It's why A&W restaurants introduced the 1/3 burger it failed. Because people didn't clearly understand that one-fourth was less than one-third. \n\nso what does that tell you?\n\nthat people are stupid? yeahyeah, but what does it *really* tell you?\n\nIt was a marketing failure, not a math failure.\n\nUnions have garbage marketing.",
                                          "score": 1,
                                          "created_utc": 1734728870.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m3112sl",
                              "author": "DaringPancakes",
                              "body": "Apparently if you make ANY issue about short term gains being better than any possible long term profits (that you conveniently don't explain), you'll get people on your side 100% of the time, and they'll fight RABIDLY to hold that position.\n\nYay 'murica",
                              "score": 6,
                              "created_utc": 1734723670.0,
                              "replies": []
                            },
                            {
                              "id": "m3171j9",
                              "author": "Mental_Medium3988",
                              "body": "At least for me union dues are very worth it for the benefits along with having an employment lawyer on staff at all times.",
                              "score": 1,
                              "created_utc": 1734725695.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m342f1k",
                          "author": "Ok_Ordinary_2472",
                          "body": "Look at Volkswagen in Germany. They are responsible for overhiring, not being able to fire people now when they don't need them and are patting themselves on the shoulder for now allowing any automation in the factories. \n\nSure the management is shit too, but they are not saints either.",
                          "score": 4,
                          "created_utc": 1734771807.0,
                          "replies": []
                        },
                        {
                          "id": "m31oud9",
                          "author": "None",
                          "body": "There are some legitimate reasons but they don’t really boil down to “union bad” — more like, “corrupt unions are really bad”.\n\nSome of the stuff that came out in 08-09 about the UAW (united auto workers union) was **insane**. GM had no money to their name. No cars to build. And they were paying $100s millions for UAW workers to sit in day-care like facilities doing **nothing**.\n\nPretty sure the head of the Chrysler workers union went to jail too.",
                          "score": 8,
                          "created_utc": 1734731830.0,
                          "replies": [
                            {
                              "id": "m32kutj",
                              "author": "eljefino",
                              "body": "Well that's due to a contract that both sides signed.  Sometimes they'll make a bunch of fleet cars, all white, no options, just to keep the lines running because it costs them the same paying the guys to work or to sit there.  I know if I had such a contract I'd put in \"you will have work (or pay) for me always\" as a condition.",
                              "score": -2,
                              "created_utc": 1734744301.0,
                              "replies": [
                                {
                                  "id": "m32l5lk",
                                  "author": "None",
                                  "body": "> I know if I had such a contract I'd put in \"you will have work (or pay) for me always\" as a condition.\n\nThere's a difference between worker protections and setting up US companies for failure on the world stage.\n\nThere's a reason that automakers (both domestic and foreign) are fleeing to southern states and Mexico/Canada. You can only eat your cake so long. There has to be a middle ground.\n\nUAW leaders got fat and greedy.",
                                  "score": 0,
                                  "created_utc": 1734744424.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m31xqk5",
                          "author": "Vlad_Yemerashev",
                          "body": "> no idea what the counter argument is.\n\nThe counter argument is lost productivity due to restrictions you would not otherwise see with at-will employees.",
                          "score": 7,
                          "created_utc": 1734735091.0,
                          "replies": []
                        },
                        {
                          "id": "m31ekl4",
                          "author": "MintyFreshBreathYo",
                          "body": "The only union job I worked had a horrible union. They never defended us to corporate. The whole factory would shut down without pay for 2 weeks during Christmas forcing us to either use our vacation days or go on unemployment. Meanwhile the union leaders would go to Vegas with their families on the unions dime during one of those weeks. I’m not anti union by any means, just anti that union, but I can understand how some people could be after having similar experiences.",
                          "score": 4,
                          "created_utc": 1734728278.0,
                          "replies": []
                        },
                        {
                          "id": "m2zlskq",
                          "author": "None",
                          "body": "Yup— Trump’s first term weakened a lot of unions by design… people never learn",
                          "score": 7,
                          "created_utc": 1734706391.0,
                          "replies": [
                            {
                              "id": "m301shf",
                              "author": "Future_Appeaser",
                              "body": "But but!1!1 cheaper gas will come back\n\n![gif](giphy|3o7btPCcdNniyf0ArS|downsized)",
                              "score": 1,
                              "created_utc": 1734711934.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m2ztbj8",
                          "author": "None",
                          "body": "This isn't an argument against unions per se, but an observation: I live in an area of the midwest with a lot of car manufacturing. Think of where the big 3 are located. The workers in manufacturing are a part of the UAW. All good. However, when it comes to discipline or reprimands, the unions are pretty soft on their own. I have heard of stories about workers showing up drunk, high, etc many, many many times. In any other job this would have you fired immediately. But because the unions fight for this employee, they stay on, and their quality of work suffers greatly. If someone shows up drunk to work 6 times, or you find them doing blow in the bathroom, there is a serious problem there. That employee is endangering themselves and their coworkers with their behavior. This is not an uncommon story in the UAW plants here. The unions literally refuse to have some of these really, really bad employees fired. So in this situation, unions are enabling the poor behavior by the employee.",
                          "score": 10,
                          "created_utc": 1734709060.0,
                          "replies": [
                            {
                              "id": "m2zxxsp",
                              "author": "KovolKenai",
                              "body": "I hear this is one of the main complaints, but I also wonder how often union members say to the union, \"hey this guy you're protecting is a danger to me, a fellow union member, can we figure this out please\". Problem with the union? Talk to them about it. I'm not saying it's not an issue, don't get me wrong, I just wonder how often people take the next step and confirming with the union that they're enabling dangerous behavior.",
                              "score": 6,
                              "created_utc": 1734710629.0,
                              "replies": [
                                {
                                  "id": "m300jt8",
                                  "author": "None",
                                  "body": "That turns into another conversation about how effective is union leadership. I have a story about a time when I was working for a retailer, and I joined a union during my time on that job. I reported some unsafe practices I witnessed a coworker engaging in (operating a forklift without being certified and rushing while moving pallets around), and the response I got? \"Well he's under a lot of stress with his home life, so cut him some slack. He's just trying to do his job.\" So employee continued to engage in unsafe practices, union leader didn't do anything, and the show went on. Like I said this was a retailer, so different industry. But I can imagine a similar conversation happening in other unions as well. Of course the conversation could go entirely different within different unions as well.",
                                  "score": 9,
                                  "created_utc": 1734711515.0,
                                  "replies": [
                                    {
                                      "id": "m3019u4",
                                      "author": "KovolKenai",
                                      "body": "Yeah that's pretty much what I expected, tbh. Like, don't get me wrong, on the spectrum of \"unions protecting bad workers\" and \"management abusing workers\" I definitely fall on the union side, but it would be so frustrating to be in your situation, so I get it. Wish it wasn't the case, but yeah.",
                                      "score": 0,
                                      "created_utc": 1734711761.0,
                                      "replies": [
                                        {
                                          "id": "m302257",
                                          "author": "None",
                                          "body": "Likewise I'm still strongly pro-union but I can't shake the sourness that interaction left me with.",
                                          "score": 3,
                                          "created_utc": 1734712025.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m2zyjzn",
                              "author": "SASSIESASSQUATCH",
                              "body": "Definitely not unheard of outside of unions. I worked in a non Union plant where they took lunch and pounded vodka. 22+ years experience were never fired, retired. \n\nProbably just falling for anti Union propaganda even though you sound like you should know better.",
                              "score": 4,
                              "created_utc": 1734710837.0,
                              "replies": [
                                {
                                  "id": "m2zyzyn",
                                  "author": "None",
                                  "body": "Where did I say I was anti union at all? Why are you inferring that I'm anti union for stating what is a well known problem? Unions are great, but that doesn't mean they aren't without their own problems. Maybe you should study more pros and cons of unions more closely before making assumptions.",
                                  "score": 0,
                                  "created_utc": 1734710988.0,
                                  "replies": [
                                    {
                                      "id": "m303bsl",
                                      "author": "firebolt_wt",
                                      "body": "\"I have multiple unproven anecdotes about why unions are bad I'm willing to share, and I'm not willing to explicitly state that the employers are much worse for workers than unions, but **why** are you saying I'm anti union?\"\n\n\nBecause you're spreading anti union propaganda for free. That's why.",
                                      "score": 4,
                                      "created_utc": 1734712450.0,
                                      "replies": [
                                        {
                                          "id": "m308j1x",
                                          "author": "None",
                                          "body": "I'm relaying my experience, and if you look at other comments, I literally state that I'm pro-union. But you along with reddit love to jump down everyone's throat as soon as someone *even suggests* that unions aren't perfect or that some people have poor experiences with them.",
                                          "score": 2,
                                          "created_utc": 1734714165.0,
                                          "replies": [
                                            {
                                              "id": "m3091nq",
                                              "author": "firebolt_wt",
                                              "body": "You yourself wrote that you're telling **stories you heard** (aka unfounded rumors).\n\n\nTrying to recount it as \"my experience\" after you said that doesn't make you any more trustworthy than before.\n\n\nEdit: lol, someone reported me to reddit care for this thread. Totally couldn't have been the guy who's also trying to pass of unfounded rumors as true stories and backpedaling when I call him out, right?",
                                              "score": 1,
                                              "created_utc": 1734714338.0,
                                              "replies": [
                                                {
                                                  "id": "m309jbj",
                                                  "author": "None",
                                                  "body": "[So you clearly decided to overlook this comment then](https://old.reddit.com/r/gadgets/comments/1hig1o5/walmart_employees_now_wearing_body_cameras_to/m300jt8/)",
                                                  "score": 1,
                                                  "created_utc": 1734714501.0,
                                                  "replies": [
                                                    {
                                                      "id": "m30a60z",
                                                      "author": "firebolt_wt",
                                                      "body": "Is that the comment I'm answering to, smart-ass? If I had a problem with that comment I'd have answered *there*  not *here*.",
                                                      "score": 1,
                                                      "created_utc": 1734714710.0,
                                                      "replies": [
                                                        {
                                                          "id": "m30qn2v",
                                                          "author": "KeberUggles",
                                                          "body": "Soooo, you’ve seen that comment then! And still jumped down his thirst on this one!",
                                                          "score": 3,
                                                          "created_utc": 1734720162.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m327n4k",
                          "author": "Onyxprimal",
                          "body": "“Unions are one of those things that I legitimately have no idea what the counter argument is.”\n\nMy Grandfather was part of United Mine Workers all his years on the job. They help put food on the table, we had health care, and his pension helped him live comfortably. I’ll never be down on unions because I saw what UMWA did for our family.",
                          "score": 3,
                          "created_utc": 1734738968.0,
                          "replies": []
                        },
                        {
                          "id": "m301avr",
                          "author": "omgfineillsignupjeez",
                          "body": ">Unions are one of those things that I legitimately have no idea what the counter argument is.\n\nThey can get too powerful and cripple the businesses they're a part of. If it's widespread, the crippling of businesses and the use of strikes, are both things that can result in a reduction of overall productivity. Additionally, can enable abuses of power / authority without the cost being felt by those conducting those actions and without the people who're feeling that cost being able to stop it.\n\nIn a more ideal world where labor relations is better enforced by society, they may well not be worth these costs.",
                          "score": 3,
                          "created_utc": 1734711771.0,
                          "replies": [
                            {
                              "id": "m307ryf",
                              "author": "None",
                              "body": "[removed]",
                              "score": 0,
                              "created_utc": 1734713916.0,
                              "replies": [
                                {
                                  "id": "m308hvi",
                                  "author": "omgfineillsignupjeez",
                                  "body": "Is there something in my post that you're disagreeing with? please do quote it if so",
                                  "score": 0,
                                  "created_utc": 1734714154.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m33e3tp",
                              "author": "Kimura2triangle",
                              "body": "What? Unions are bad because of “abuses of power”? Ah yes, because multi-billion dollar corporations and their executives *never* engage in abuses of power towards non-union employees. Let’s completely ignore things like wage theft, discriminatory hiring/firing practices, bullying, retaliation, etc that all routinely occur without the protection of unions. \n\n/s",
                              "score": -3,
                              "created_utc": 1734757103.0,
                              "replies": [
                                {
                                  "id": "m33href",
                                  "author": "omgfineillsignupjeez",
                                  "body": "I didn't say they were bad, lol.",
                                  "score": 4,
                                  "created_utc": 1734759035.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m318ev5",
                          "author": "Flat-Emergency4891",
                          "body": "There isn’t really a valid argument against unions. The best, broad stroke argument for unions that every working class person should support is the fact that unions are a check and balance to runaway corporate greed. Without them, we are left financially broke, physically broken, and alone without representation. It’s plain and simple. The wealthy have plenty of support representing their interests. How many of us can keep a team of attorneys on retainer?",
                          "score": 4,
                          "created_utc": 1734726166.0,
                          "replies": []
                        },
                        {
                          "id": "m3056yi",
                          "author": "PlayingDoomOnAGPS",
                          "body": ">Unions are one of those things that I legitimately have no idea what the counter argument is.\n\nI think police unions are the epitome of all the potential downsides of unions. I'm pro-union (in general, fuck the police unions) but, like everything else, they're not a magic solution that presents no problems of its own.",
                          "score": 3,
                          "created_utc": 1734713068.0,
                          "replies": [
                            {
                              "id": "m30cy0y",
                              "author": "Mama_Skip",
                              "body": "Weird that anti-union people are usually the same crowd as the blue lives matter guys. \n\nThe problem isn't the police union, the problem is there is no check and balance, no oversight, to the union of a non-private, gov't organization. And when your organization has the legal ability to enforce punishments, strip freedoms, and kill people - that's a problem. Oversight is important. \n\nNormal unions do have to, in some way, report to a higher power - they can strike, but if enough workers aren't paid by the company, they will eventually fall apart. So they have incentive to meet in the middle. \n\nThe cops aren't a normal union. They will never run the risk of not being paid, no matter how ridiculous their demands, because they're paid by the American tax payers.",
                              "score": 0,
                              "created_utc": 1734715633.0,
                              "replies": []
                            },
                            {
                              "id": "m30avad",
                              "author": "no12chere",
                              "body": "This is exactly the only union ‘bad’ argument. The corruption and power that union has makes it less a union and more a mafia.",
                              "score": -2,
                              "created_utc": 1734714942.0,
                              "replies": [
                                {
                                  "id": "m38gx1z",
                                  "author": "BonzBonzOnlyBonz",
                                  "body": "The Detroit auto union killed the Detroit auto industry and put tons of people out of work.\n\nThe actors union made it so that AI replication of voices is only allowed if they go through a specific company which is owned by a few members of the union board. It screws over the voice actors.\n\nThere have been a ton of minimum wage law increases where union members are exempt from the law and their minimum wage didn't increase.",
                                  "score": 2,
                                  "created_utc": 1734838040.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m30oux9",
                          "author": "KeberUggles",
                          "body": "I worked for an internet company that was unionized. I was falsely accused of time theft when I was actually working on the work computer - I was just slow at my job. Perfect! This will be easy to prove losers. Union didn’t think it was worth their effort. The last guy they went to bat for and pulled the computer tracking proved he was time thefting, so they wouldn’t do mine. And then if they were able to prove I was working, the company would just go through with a fine tooth comb to find something else - lost my job even though I am a truthful employee - not coffee or smoke breaks to flag. No recourse because what the union says goes you can’t go after the company yourself. And only after too much time had passed, did I learn you can file a complaint to the Goverment  about the union. No one tells you how to defend yourself against unions. \n\nI find unions do just as much fear mongering as companies. I was part of the initial push to unionize at a previous job. And I found their shtick to be very fear mongering, which they get all pissy about when the company does the same thing. They seem to cause a toxic relationship between the company and workers since they’re stance is the company is trying to screw you at every turn. Of all the unions I’ve been part of, I’ve never seen the actual benefit. And when I was finally going to benefit from one, nope, they didn’t wanna\n\nThat said, Amazon workers NEED to unionize.",
                          "score": 3,
                          "created_utc": 1734719568.0,
                          "replies": []
                        },
                        {
                          "id": "m34cb40",
                          "author": "Mela-Mercantile",
                          "body": "regular unions are fine but it's a balance a union thats too powerfull is problematic for all as they can be overbering and grind business to a alt for no reason",
                          "score": 1,
                          "created_utc": 1734778425.0,
                          "replies": []
                        },
                        {
                          "id": "m351jl4",
                          "author": "DragonRaptor",
                          "body": "Unions can be good, they can also be bad.\nthey protect workers who are actually bad at their job,  bad workers means other workers will often have to fix/clean up their mistakes, creates an unbalanced working environment that is stressful for those who actually want to do a good job.  and because it prevents their dismissal, the company may not be able to afford to hire more workers to help pick up there slack which means more difficult job for others.  if everyone does bad, then the company goes under and no more job. \nthe whole seniority thing doesn't always reward the best workers. \nthey can prevent growth by not allowing you to do work outside your mandate, ever heard the term do the job you want, not the job you have,   it's hard to learn new jobs and move into them when your not allowed to do them.   which means they have to hire based on chance then experience from seeing candidates attempt said work.   \nbeing on strike can mean lower or no wages which some people can't afford. \n\nnot all unions are like this, some are really good.   But some are bad.    there's more reasons then what I mentioned above.  point being is everything isn't black and white.",
                          "score": 1,
                          "created_utc": 1734791430.0,
                          "replies": []
                        },
                        {
                          "id": "m35fzf5",
                          "author": "alidan",
                          "body": "my dad was in a union, the union effectively screwed him out of around 15k in bonuses for the last years because they gave up fighting or really careign about who was in it, along with requiring dues and effectively requiring being in it to even work.\n\nwhen a union works, it helps, when it doesn't it's just something you have to pay into to be able to do a job that doesn't require the union.\n\nthen you have the corrupt ones that were controlled by crime.",
                          "score": 1,
                          "created_utc": 1734796897.0,
                          "replies": []
                        },
                        {
                          "id": "m3fn8l7",
                          "author": "andricathere",
                          "body": "They hurt profits by giving workers rights. That's the counter argument. If it's bad for profits, it could bring down society, as they know it.",
                          "score": 1,
                          "created_utc": 1734960856.0,
                          "replies": []
                        },
                        {
                          "id": "m2zuy5g",
                          "author": "NumberOneCombosFan",
                          "body": ">Unions are one of those things that I legitimately have no idea what the counter argument is. \n\n[Relevant Jon Bois quote](https://streamable.com/sgjqnv)",
                          "score": 1,
                          "created_utc": 1734709620.0,
                          "replies": []
                        },
                        {
                          "id": "m33ckkk",
                          "author": "Kimura2triangle",
                          "body": "A lot of people also buy into the ‘unions protect the bad employees from getting fired’ crap. I had an old coworker who tried to trot out that nonsense when we were talking about the idea of a union. I gestured generally around our workplace and said: “Kevin, look around you… the bad employees don’t get fired now!”",
                          "score": 1,
                          "created_utc": 1734756338.0,
                          "replies": []
                        },
                        {
                          "id": "m31t9h3",
                          "author": "Bravefan212",
                          "body": "The counter argument is always disappointing. It’s always just wanting to hold others down",
                          "score": -1,
                          "created_utc": 1734733438.0,
                          "replies": []
                        },
                        {
                          "id": "m383tzr",
                          "author": "ial4289",
                          "body": "I have a few reasons why unions aren’t the best for everyone. First and simply they cost money. Union fees were over $100/month out of my $900 paychecks, which was far too much at the time.\n\nAdditionally, as a hard worker seniority sucks, unions seem built around benefiting the employees who have stayed longer vs the ones starting out regardless of work effort. \n\nBy far my biggest complaint was the forced working hours. You HAD to work 5 days every week, which meant you could not get unpaid time off if it meant working less then that or you would get hit with a reprimand mark. Sure, after a year you can get a week long paid vacation or whatnot, but until then if you needed more then 3 days off for any reason in a week it was the equivalent of calling out. \n\nJust not a good experience all around. Costco by the way and I was maybe 23 at the time.",
                          "score": 0,
                          "created_utc": 1734832282.0,
                          "replies": []
                        },
                        {
                          "id": "m38bkx4",
                          "author": "lama579",
                          "body": "Some companies, or industries, won’t let you work for them unless you also join the union. Unions will argue that this is because you would get the benefits of being in a union without paying the dues.\n\nWhat if you don’t think the union provides a good enough (if any) benefit? What if you think the dues are too much? What if you don’t like that dues often go to donations to politicians that you don’t like?\n\nUnions will usually not let you negotiate your own wages either. If you’re the best widget maker, you can’t go to management and ask for a raise to reflect this. You’ll be paid the same as the worst widget maker.\n\nIt raises the floor for the lowest performers but lowers the ceiling for the highest. \n\nI don’t agree with everything there, but they are legitimate arguments.",
                          "score": 0,
                          "created_utc": 1734835593.0,
                          "replies": []
                        },
                        {
                          "id": "m38gfxy",
                          "author": "BonzBonzOnlyBonz",
                          "body": ">Unions are one of those things that I legitimately have no idea what the counter argument is. \n\nThe police union?\n\nAlso, you won't get anyone who actually will give you any real reasons for downsides of unions because Reddit will crucify you. There is no reason to spend anytime saying why unions are bad if you just get downvoted into oblivion and it gets ignored.",
                          "score": 0,
                          "created_utc": 1734837822.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m34dotw",
                      "author": "None",
                      "body": "President Musk will de-unionize first Tesla then others.",
                      "score": 1,
                      "created_utc": 1734779317.0,
                      "replies": []
                    },
                    {
                      "id": "m384fb2",
                      "author": "Stalvos",
                      "body": "It's the number one reason for the cameras.  Hard to have a chat with fellow employees about organizing when you're on audio and video.",
                      "score": 1,
                      "created_utc": 1734832527.0,
                      "replies": []
                    },
                    {
                      "id": "m30ox8k",
                      "author": "Situational_Hagun",
                      "body": "I was about to say, that's a core feature of my union. If they require you to have a cell phone for work purposes, like contacting you after hours or calling you because they don't want to walk all the way across the job site, they have to provide a company phone for you, or pay you a stipend.\n\nOr in the case of a foreman (who normally got a $45 phone use stipend) that had to work way out of our metro area, and his cell phone didn't get reception at the job site, they had to buy him a phone he could use down there.",
                      "score": 1,
                      "created_utc": 1734719590.0,
                      "replies": []
                    },
                    {
                      "id": "m307qmk",
                      "author": "SilentSpook",
                      "body": "Good luck getting a union in at Walmart, they're notoriously one of the most anti union corporations in the US.",
                      "score": -1,
                      "created_utc": 1734713904.0,
                      "replies": [
                        {
                          "id": "m31iq36",
                          "author": "None",
                          "body": "This is why people should stop giving money to them",
                          "score": -1,
                          "created_utc": 1734729701.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m31umdg",
                  "author": "No-Psychology3712",
                  "body": "lol most places just give you a phone if they want to do this. they get through hundreds. it's not really that much. your onboarding training time is more than a basic iPhone costs.",
                  "score": 7,
                  "created_utc": 1734733937.0,
                  "replies": []
                },
                {
                  "id": "m31o7sw",
                  "author": "None",
                  "body": "It is literally **not** cheaper to hire someone else rather than just issuing company phones. Recruiting is fucking expensive. Labor is **the** biggest line item on just about any companies balance sheet. \n\nReddit is full of so much trash it’s insane. Convinced nobody here works in corporate America.",
                  "score": 18,
                  "created_utc": 1734731606.0,
                  "replies": [
                    {
                      "id": "m327pkb",
                      "author": "HellP1g",
                      "body": "Yeah this is insanely fucking stupid lol. \n\nI’m a hiring manager and having to hire new people sucks ass and is insanely time consuming, and like you said it’s expensive.",
                      "score": 8,
                      "created_utc": 1734738995.0,
                      "replies": []
                    },
                    {
                      "id": "m33nshr",
                      "author": "idiot-prodigy",
                      "body": "This is true of white collar jobs, not true of being a Wal Mart drone.  \n\nWal Mart absolutely will just turn a potential drone away and wait for another high school dropout willing to install corporate spyware on their personal phone.",
                      "score": 3,
                      "created_utc": 1734762454.0,
                      "replies": []
                    },
                    {
                      "id": "m389cwl",
                      "author": "CatInAPottedPlant",
                      "body": "I mean, I worked as a software engineer at an absolutely huge company that rakes in obscene profit every year. \n\nI asked for a work phone so I didn't have to install teams and 2FA on my personal phone, and they told me to get fucked. my manager genuinely couldn't even comprehend my request, they made me feel like I was entitled for asking. it honestly seems like a huge security flaw to have 2FA and company work stuff on personal phones, but what do I know I guess. I had to enable a bunch of security features on the phone before it would let me activate 2FA, but still. \n\neven in corporate America, some places are such machines that they genuinely don't give a shit if you leave as long as they don't have to bend the rules or depart from their procedure. and yes it would cost them way more, but they're gambling on you just lowering your head and taking no for an answer. \n\nthe job market sucked, so that's what I did. I doubt I'm particularly special in that case.",
                      "score": 1,
                      "created_utc": 1734834614.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m32ya4n",
                  "author": "VexrisFXIV",
                  "body": "False, the work phone is NOT required, and you do NOT need to use it or even have one. It's right in the apps TOS. The walmart phone has nothing to do with you working at walmart. You can call ethics on that.",
                  "score": 2,
                  "created_utc": 1734749914.0,
                  "replies": []
                },
                {
                  "id": "m30mdes",
                  "author": "KeberUggles",
                  "body": "Are ppl lining up to work for Wally. I’m 99% sure they’re bringing in foreign workers to fill positions. “No one wants to use their personal phones, pls allow me to bring in foreign workers who will do what we tell them with no push back”",
                  "score": 3,
                  "created_utc": 1734718745.0,
                  "replies": []
                },
                {
                  "id": "m3ev2cj",
                  "author": "GGATHELMIL",
                  "body": "What's fun is when it's conflicting uses. Technically I'm not supposed to use my phone on the clock. But I also do work where sometimes I have to look at reference materials. And while I have access to a computer the thing is at least a decade old and a lot of times it's just quicker and easier to whip out my phone and look it up that way.\n\nDepending on the day and situation determines how I deal with it. If I need info right now I use my phone. If it's a slow day and I need to look busy I use the computer.",
                  "score": 1,
                  "created_utc": 1734943961.0,
                  "replies": []
                },
                {
                  "id": "m32vj16",
                  "author": "None",
                  "body": "Software engineer here. Where I work, they implemented 2 step authentication for our ERP, and they wanted us to use our phone. I said no because It's my personal phone and I'm not obligated by my contract to provide it. Boy, did I piss management with that.",
                  "score": 1,
                  "created_utc": 1734748745.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2zt5nv",
              "author": "Raztax",
              "body": "My employer doesn't get to force me to use my phone for anything. If they require me to have a work phone, they can provide it.",
              "score": 15,
              "created_utc": 1734709002.0,
              "replies": []
            },
            {
              "id": "m332ad7",
              "author": "-RadarRanger-",
              "body": "I'll be damned if I'm gonna let my employer have *any* kind of access to my phone.",
              "score": 4,
              "created_utc": 1734751641.0,
              "replies": []
            },
            {
              "id": "m2zuakq",
              "author": "Tranquil_Pure",
              "body": "They have work phones they give to employees who won't use their personal phones, and they've been pushing the scanning procedures into these phones rather than telzons etc. They will track everyone ",
              "score": 3,
              "created_utc": 1734709395.0,
              "replies": []
            },
            {
              "id": "m32cif0",
              "author": "optix_clear",
              "body": "Company phone no access to your personal property",
              "score": 5,
              "created_utc": 1734740907.0,
              "replies": []
            },
            {
              "id": "m33d8ea",
              "author": "Xeglor-The-Destroyer",
              "body": "Nah, dawg. You're going to issue me a company phone or I quit.  Some places might say \"Okay, there's the door.\" and if that's the case then fine, I'm never working for a company that demands that I install their software on my personal devices.  (Same would go for a company laptop or PC.)",
              "score": 4,
              "created_utc": 1734756668.0,
              "replies": []
            },
            {
              "id": "m30pjy0",
              "author": "YinzaJagoff",
              "body": "Have fun with MFA, where you’ll need a phone number or email registered to verify your identity. \n\nOR you’ll need to have access to an app like Authenticator which is also used to verification purposes.\n\nCan’t be verified? Then you’re not able to access the system and/or tools you need to get your job done.\n\nYes I’m in IT, for those who may ask.",
              "score": 10,
              "created_utc": 1734719800.0,
              "replies": [
                {
                  "id": "m312yy7",
                  "author": "Shawnj2",
                  "body": "IT at my job gives everyone a super locked down work phone for this purpose and I don’t understand why this isn’t the default. It’s way more secure too because I can leave it home if I go out or travel somewhere so there’s way less security risks",
                  "score": 17,
                  "created_utc": 1734724313.0,
                  "replies": [
                    {
                      "id": "m31c2cb",
                      "author": "YinzaJagoff",
                      "body": "I don’t have a work phone.\n\nWork phone = extra $$ to purchase and pay for it.\n\nNot saying it’s not a bad idea but yeah.",
                      "score": -3,
                      "created_utc": 1734727423.0,
                      "replies": [
                        {
                          "id": "m31e44g",
                          "author": "Shawnj2",
                          "body": "Sure but it’s a locked down device only to be used for work, cybersecurity wise it’s a massive improvement over any personal device. Easily worth the $200 or whatever for a basic phone for any company who can afford to pay their employees well",
                          "score": 6,
                          "created_utc": 1734728123.0,
                          "replies": []
                        },
                        {
                          "id": "m31i7x1",
                          "author": "None",
                          "body": "And this is why the plan that a company just assumes they can use employee’s equipment is thoughtless.  That’s my equipment, not the companies.",
                          "score": 5,
                          "created_utc": 1734729530.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m30s4k0",
                  "author": "None",
                  "body": "IT lad at my job said the same thing, I said not a problem I’ll explain the issue to my boss.  Landed on a 35% or $50 phone stipend.  \n\nThe IT lad was strangely butt hurt about it.  It’s none of your business if I can’t operate your MFA.  It’s silly you think I give a shit if I can’t operate your thoughtless system.  I get paid no matter what.",
                  "score": 1,
                  "created_utc": 1734720658.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m31zc5p",
              "author": "auiotour",
              "body": "Our company requires personal phones for MFA. Don't want it there's the door. I don't agree but cyber security insurance goes down if everything is protected by it.",
              "score": 2,
              "created_utc": 1734735700.0,
              "replies": []
            },
            {
              "id": "m33nkos",
              "author": "idiot-prodigy",
              "body": "> I say only if you are paying for a portion of my phone.   \n\nI say only if you are paying for a ~~portion of my~~ **work** phone.   \n\nFixed for you.  \n\nNever should you be required to a) use your personal phone for anything, much less b) have corporate spyware installed on your personal device that reports your fucking GPS location.",
              "score": 2,
              "created_utc": 1734762327.0,
              "replies": []
            },
            {
              "id": "m32uki5",
              "author": "Hydroxs",
              "body": "At my job we get deliveries that sometimes fall over in the truck. I was told to take pictures to document it and my response was \"with what\". My manager just sighed and took the pictures himself. Lol",
              "score": 2,
              "created_utc": 1734748341.0,
              "replies": []
            },
            {
              "id": "m2zvrvp",
              "author": "void_const",
              "body": "I say the same about any job that requires me to be in an office. Cars and gas cost money.",
              "score": 1,
              "created_utc": 1734709900.0,
              "replies": []
            },
            {
              "id": "m31nl3l",
              "author": "AutomateAway",
              "body": "i would not allow my personal phone to be used for company software at all, regardless if they are willing to pay for it or not. want me to use your apps? provide me a company phone that I can leave at work when i go home\n\nlol, i guess some manager type didn't like my comment",
              "score": 2,
              "created_utc": 1734731386.0,
              "replies": [
                {
                  "id": "m31zznf",
                  "author": "None",
                  "body": "Fair— though this typically skirts the 2 phone or shit andoid problem.",
                  "score": 1,
                  "created_utc": 1734735952.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m32l818",
              "author": "yanahq",
              "body": "In my country you can claim a portion of your phone on tax if you’re required to use it for work.",
              "score": 1,
              "created_utc": 1734744452.0,
              "replies": [
                {
                  "id": "m32lkid",
                  "author": "None",
                  "body": "In my country you can also deduct equipment purchased for a business… so these companies should fuckin do that instead of having me do it on my side.",
                  "score": 3,
                  "created_utc": 1734744595.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m35bikv",
              "author": "SiscoSquared",
              "body": "No way. They provide a seperate work phone or can kick rocks.",
              "score": 1,
              "created_utc": 1734795293.0,
              "replies": []
            },
            {
              "id": "m3b53ld",
              "author": "Egomaniac247",
              "body": "My workplace has gone away from using company cell phones and instead just gives us $120/mo to pay our cell bills and we use our own personal cell phone.\n\nWhich is fine but a couple years ago we terminated an employee and I was asked to hand over all text messages on my phone for any texts I sent that talk about or even reference that employee/\n\nI did so, had nothing to hide, and was always very professional, but still, it never sat well with me that because they pay my bill then they should have access to my text messages.  How far would it go?  Extend to pictures on my phone?\n\nSo needless to say I don't text about work anymore unless it is extremely factual (IE:  I'll meet you at the conference room at 2pm\")  .  I know some folk that went out and bought a separate cell phone specifically for work based on this policy.",
              "score": 1,
              "created_utc": 1734888732.0,
              "replies": [
                {
                  "id": "m3ba1nw",
                  "author": "None",
                  "body": "“I delete all my messages to ensure no company data remains on my phone for security”",
                  "score": 2,
                  "created_utc": 1734890401.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m3056n2",
              "author": "TheMacMan",
              "body": "As they said, businesses will give you a device if you don't have one. Most people don't want to deal with carrying around a second phone, especially some ancient brick they give you, deal with charging it, etc, so they opt to use their own. Sure, you don't have to use your own, but I'd take not carrying another piece of junk around all the time.",
              "score": 1,
              "created_utc": 1734713065.0,
              "replies": []
            },
            {
              "id": "m2zbhhk",
              "author": "Arkinats",
              "body": "We require that our end users install the Microsoft MFA application on their phones. If you can't MFA you can't login and if you can't login you can't work. The other apps are optional.",
              "score": -9,
              "created_utc": 1734702352.0,
              "replies": [
                {
                  "id": "m2zpxrg",
                  "author": "MultiFazed",
                  "body": ">We require that our end users install the Microsoft MFA application on their phones\n\nDo you hand out MFA keyfobs to employees who don't want work applications installed on their personal devices?",
                  "score": 4,
                  "created_utc": 1734707877.0,
                  "replies": [
                    {
                      "id": "m31xfe2",
                      "author": "BoxerguyT89",
                      "body": "That's what we do, most people usually end up installing the authenticator app after dealing with or losing their hardware tokens. \n\nThe option is there for them.",
                      "score": 2,
                      "created_utc": 1734734976.0,
                      "replies": []
                    },
                    {
                      "id": "m3e0lq0",
                      "author": "Arkinats",
                      "body": "Yes, it's an option but no one has opted to use it. Most users even install the optional O365 apps (namely Outlook), but not all and it's not required.",
                      "score": 1,
                      "created_utc": 1734926255.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2zkzml",
                  "author": "None",
                  "body": "And if you want to require me to install MFA on my phone, you are going to pay me more.\n\nIf you can’t handle this equation— your business model is fucked and I don’t want to work for you.",
                  "score": 3,
                  "created_utc": 1734706096.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2z50o4",
          "author": "perpetualpatzer",
          "body": "Spills are an interesting use case. My mind went to customer faces for sales attribution, but that probably isn't worth the cost of the camera.",
          "score": 22,
          "created_utc": 1734699566.0,
          "replies": [
            {
              "id": "m30bw8w",
              "author": "YoimAtlas",
              "body": "I’m in the industry and spills are an instant payout from insurance companies. They will not litigate a slip and fall and will opt to payout damages 99% of the time. It’s a huge liability.",
              "score": 22,
              "created_utc": 1734715283.0,
              "replies": [
                {
                  "id": "m35c98m",
                  "author": "Stock_Category",
                  "body": "I saw a video from a Walmart store where a woman came in with a squeeze bottle, doused the floor and fell down in the middle of the 'spill'. \n\nI understand that the company is liable for accidents revolving around spills if employees are aware of the spill and ignore it.",
                  "score": 1,
                  "created_utc": 1734795560.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2zyd7p",
              "author": "Leafhands",
              "body": "I work for a personal injury firm, the firm that I work for has won pretty big cases on slip and falls, caused by spills at stores such as.",
              "score": 15,
              "created_utc": 1734710774.0,
              "replies": [
                {
                  "id": "m332t8w",
                  "author": "zelda_reincarnated",
                  "body": "I worked on the other side for an attorney defending a big chain store on these things. It costs a lot of money whenever someone says they fell, regardless of how true it is. I would 100% believe this is a large reason for cameras. No one cares if Tommy hit the vape for 20 mins instead of 15 and then stole some lunch. But if Karen says she fell because of wet floor and has hundreds of thousands of medical bills? That's what matters. ",
                  "score": 7,
                  "created_utc": 1734751869.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m30qn0j",
          "author": "Chocolate_Bourbon",
          "body": "    The only thing that worries them more [than mass shootings] are spills.\n\nThis is the most American sentence I have ever read. This is the most American sentence I will ever read.",
          "score": 27,
          "created_utc": 1734720161.0,
          "replies": [
            {
              "id": "m3bmzam",
              "author": "Lari-Fari",
              "body": "Truly r/shitamericanssay",
              "score": 1,
              "created_utc": 1734894555.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m322sff",
          "author": "unassumingdink",
          "body": "> I cannot stress enough how concerned they are about this. The only thing that worries them more are spills.\n\nWell, unions. They've shut down entire stores for union organizing.",
          "score": 11,
          "created_utc": 1734737044.0,
          "replies": [
            {
              "id": "m328c3b",
              "author": "scorpion_tail",
              "body": "They actually prefer you call Onions “shallots” because Onion sounds too much like Union.",
              "score": 2,
              "created_utc": 1734739244.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2yzoo2",
          "author": "InAllThingsBalance",
          "body": "2.5 hours spent on a broken jar of salsa?  That must have been one huge jar.",
          "score": 42,
          "created_utc": 1734696926.0,
          "replies": [
            {
              "id": "m2z0sgx",
              "author": "scorpion_tail",
              "body": "lol no. It was an 8oz jar. \n\nBut you need to first put up a little tent near the spill to warn customers. Those aren’t always where they should be. \n\nThen you need their weird gritty absorbent to soak up liquid. Got to find that too. \n\nYou’ll also want gloves. Broken glass and all. Also, the floor of a Walmart might be one of the filthiest things ever made by human hands. \n\nAlso, where’s the broom? Oh snap, the one close by has no dustpan. \n\nBetter find a mop. Looks like that’s another thing that wasn’t left where it was supposed to be. And the last employee to use it didn’t wash it out. \n\nThen you need to report the lost merch to the team lead. \n\nAll of this inside a store the size of a football field (probably larger than that even.) \n\nAnd you will have customers approach you during cleanup to ask for help finding the Betty Crocker Double-Fudge Brownie Mix while complaining that Walmart is “always moving things around.” (Walmart is constantly shifting where they place certain merch….the shelves are a rental market.) \n\nSo yeah, 2.5 hours. One small jar.",
              "score": 108,
              "created_utc": 1734697508.0,
              "replies": [
                {
                  "id": "m308u5w",
                  "author": "Rusty_Red",
                  "body": "Wow, I appreciate the deep dive on those troubles of cleaning up a broken salsa jar...\n... but for real, where is the Betty Crocker Double-Fudge Brownie Mix??  It's not where I remember it being...",
                  "score": 27,
                  "created_utc": 1734714268.0,
                  "replies": []
                },
                {
                  "id": "m30b4ly",
                  "author": "Ass4ssinX",
                  "body": "Don't forget that you aren't supposed to leave a spill unattended. So you have to stand by it until you can get some help.",
                  "score": 18,
                  "created_utc": 1734715028.0,
                  "replies": []
                },
                {
                  "id": "m30e2c2",
                  "author": "HideMeFromNextFeb",
                  "body": "I worked at a grocery store and our spills were cleaned up fast. Like, 5 minutes fast and you're done. No big deal. If we put up a little velvet rope to keep customers away, they'd still find a way to slip on it.",
                  "score": 19,
                  "created_utc": 1734716003.0,
                  "replies": [
                    {
                      "id": "m30evm4",
                      "author": "scorpion_tail",
                      "body": "Never attribute to chance that which the general public could trip into by way of their total stupidity.",
                      "score": 8,
                      "created_utc": 1734716271.0,
                      "replies": [
                        {
                          "id": "m31hcdf",
                          "author": "Lower_Fan",
                          "body": "This is why it should take 5 minutes not 2.5 hours. \n\nThey should have multiple concierge rooms with multiple of the items he needed to fix this. Cleary a wallmart L if they care so much about spills but don't have a system to resolve them as fast as possible. ",
                          "score": 5,
                          "created_utc": 1734729226.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2zw1n1",
                  "author": "ScorpioPeter",
                  "body": "Holy shit, I’d go insane in a week lol",
                  "score": 5,
                  "created_utc": 1734709990.0,
                  "replies": [
                    {
                      "id": "m308ich",
                      "author": "ABetterKamahl1234",
                      "body": "Welcome to retail. It fuckin sucks. \n\nI've never worked at Walmart, but had similar experiences in another chain, only I didn't work in food, so spills weren't often my area and I had a union which luckily backed the \"don't have enough in X department, put more hours out, don't take from y department to back-fill\" as well as the \"absolutely no work not clocked in\" stuff. Which happily my direct lead also heavily backed and reminded the owner multiple times of. \n\nA GF worked at Walmart, night and day comparison. Though my store often had equipment not be properly tagged out or put back where it should have been. My dept wasn't too much better as stock carts were limited and unassigned, and my dept used a *lot* of them as we had no night shift. So at end of shift we'd often hide 6-8 of the things somewhere in a corner people rarely frequented from other depts, so we'd not be stuck hauling hundreds of boxes by hand. \n\nRetail is a weird mess.",
                      "score": 8,
                      "created_utc": 1734714159.0,
                      "replies": [
                        {
                          "id": "m30turv",
                          "author": "ScorpioPeter",
                          "body": "I’ve always heard retail was bonkers, but I never knew what made it so… I mean, I already hate my workplace’s shitty rules, but I can’t imagine handling all that.",
                          "score": 1,
                          "created_utc": 1734721229.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m30olnl",
                  "author": "dSaw99",
                  "body": "Sorry my man but if that takes you 2.5 hours something is wrong. I bet I can go to 4 different stores to buy all those items separately and clean up the spill in 2.5 hours. That’s a long ass time.",
                  "score": 5,
                  "created_utc": 1734719482.0,
                  "replies": [
                    {
                      "id": "m31got2",
                      "author": "diescheide",
                      "body": "It doesn't take this long, at all. They are seriously inept.",
                      "score": -4,
                      "created_utc": 1734729002.0,
                      "replies": [
                        {
                          "id": "m32e22m",
                          "author": "Small-Palpitation310",
                          "body": "more like hyperbole",
                          "score": -4,
                          "created_utc": 1734741531.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m30q6ug",
                  "author": "diescheide",
                  "body": "Bro, it does not take 2.5 hours to clean a small spill. You're heavily exaggerating. Even the worst stocked spill stations will have pocket pads and/or paper towels. Grab an empty box, scoop the mess into the box with pads/towels, and then go grab your broom and mop. Call maintenance if you need the scrubber. Report lost merch? There are reclamations bins for that. \n\nI cannot imagine being so incompetent that it takes more than 30 minutes, between finding supplies, potentially assisting customers, and dealing with the damaged product. Having to wait for maintenance takes longer than addressing it yourself, usually.",
                  "score": 5,
                  "created_utc": 1734720012.0,
                  "replies": [
                    {
                      "id": "m316daa",
                      "author": "scorpion_tail",
                      "body": "lol okay. I guess you have what it takes to succeed…\n\nAt Walmart. Go get em champ.",
                      "score": 7,
                      "created_utc": 1734725464.0,
                      "replies": [
                        {
                          "id": "m31g457",
                          "author": "diescheide",
                          "body": "I wouldn't call it success. It's being capable of basic skills and functions. Y'all can't clean up a little spill in a timely manner, I can't imagine how you got this far in life.",
                          "score": 2,
                          "created_utc": 1734728807.0,
                          "replies": [
                            {
                              "id": "m31v8fx",
                              "author": "TheMidGatsby",
                              "body": "> this far in life.\n\nMy brother in christ, they work at Walmart.",
                              "score": 9,
                              "created_utc": 1734734163.0,
                              "replies": [
                                {
                                  "id": "m3276ev",
                                  "author": "diescheide",
                                  "body": "Well fuck, so do I. I'm just not pathetic about it.",
                                  "score": 6,
                                  "created_utc": 1734738785.0,
                                  "replies": [
                                    {
                                      "id": "m32c8g5",
                                      "author": "TheMidGatsby",
                                      "body": "You are destined for greater things my friend.",
                                      "score": 3,
                                      "created_utc": 1734740797.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m38ve5l",
                  "author": "Terribletylenol",
                  "body": ">Also, the floor of a Walmart might be one of the filthiest things ever made by human hands.\n\nI guess you have never had to take out bloody tampons from a women's restroom or clean up shit out of a men's urinal or clean vomit off of a floor.\n\nI loled hard af at your comment, because you have no idea what disgusting is if you said that.\n\nEven dumping grease from taco Bueno is significantly more disgusting than grabbing glass off a Walmart floor.\n\nYou're so dramatic about such a simple process.\n\nI worked at Walmart and regularly stocking juice was much more annoying than what you dealt with considering how small I am and how short of a time period I was given to do the entire thing.\n\nI never would have been allowed to spend 2.5 hours cleaning a simple spill.\n\nI got less than half that to unload and stock the entire juice pallet.\n\nSounds nice to stand around and be allowed to focus on a spill for 2.5 hrs.\n\nJanitorial sucks btw.\n\nAnd you don't get 2 hours to clean up the shit, piss, tampons, or vomit either.\n\nBut yes, the floor of Walmart is the filthiest thing made by humans, lmaoooo\n\nGain some understanding of the kind of work other people have to do.",
                  "score": 0,
                  "created_utc": 1734845227.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2zc64h",
          "author": "ANAL_SHREDDER",
          "body": "Live in a particularly dangerous city and had someone get shot in a Walmart in a nice neighborhood the other day",
          "score": 10,
          "created_utc": 1734702632.0,
          "replies": [
            {
              "id": "m2ze0ua",
              "author": "scorpion_tail",
              "body": "I believe it. I lucked out and got work in one of the “nice” ones. It’s located in a fairly well-off neighborhood full of good, entitled Christian soldiers who could only muster the sinful spirit to be passive-aggressive. \n\n8 miles to my north, however, was another store with a totally different vibe and it was not the place to be.\n\nOmg…. “Anal shredder” 😂",
              "score": 9,
              "created_utc": 1734703389.0,
              "replies": []
            },
            {
              "id": "m2zmi1i",
              "author": "CalbotPimp",
              "body": "Not at all Walmart and not in a city with a ton of violent crime but a dude here was taking a leak in a store got mugged and stabbed literally with his dick in his hand",
              "score": 2,
              "created_utc": 1734706646.0,
              "replies": [
                {
                  "id": "m32ltk3",
                  "author": "jjayzx",
                  "body": "When I lived a short stint in Florida, at the local walmart a guy was caught jerkin in the toy aisle. They had to get biohazard over to clean it up. He said he saw some hot girls and couldn't help himself. He was also a teacher at the time.",
                  "score": 2,
                  "created_utc": 1734744697.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m30sor4",
          "author": "8yr0n",
          "body": "The requirements to get what used to be the kind of job that was used to scare people into going to college is mind blowing. This is what we get in the age of automation….fending over the few scraps left.",
          "score": 4,
          "created_utc": 1734720844.0,
          "replies": []
        },
        {
          "id": "m30nisb",
          "author": "Jtagz",
          "body": "There’s an episode of Superstore that focuses exactly on the app thing",
          "score": 5,
          "created_utc": 1734719127.0,
          "replies": []
        },
        {
          "id": "m32s86d",
          "author": "jbakes21",
          "body": "Yeah pretty crazy how they would tell me they had cameras absolutely everywhere when I worked there only for them “not to have a good angle” for all 5 of the seizures I ended up having on the job (got diagnosed that year never had a seizure before that)",
          "score": 3,
          "created_utc": 1734747364.0,
          "replies": []
        },
        {
          "id": "m30wesh",
          "author": "Redshadow40",
          "body": "Dang back when I worked at Walmarts garden center I had a little hideout behind BBQ boxes I used to nap in.  Guess that isn't an option anymore.",
          "score": 4,
          "created_utc": 1734722092.0,
          "replies": [
            {
              "id": "m33gdb4",
              "author": "Cheezewiz239",
              "body": "Na I still hide at times. Never been caught.",
              "score": 2,
              "created_utc": 1734758281.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m32erwh",
          "author": "AstariiFilms",
          "body": "I'm pretty sure most stores use Bluetooth beacons now so even if you don't use their app they can still track you by matching your phones mac address",
          "score": 2,
          "created_utc": 1734741823.0,
          "replies": []
        },
        {
          "id": "m3811za",
          "author": "CrimsonFox2370",
          "body": "Boy are you right about how easily spills can disrupt your whole day. I used to work maintenance at a WM and so I was the one that everyone called whenever they had a spill. One time one of the shift managers whipped his jack around and an entire case of Tostitos salsa fell off and broke. That spill took me like half the shift to clean up. \n\n\nAnother time some dumb kids shook up a sprite 2L and smashed it on the ground in the soda aisle, and it sprayed the WHOLE aisle. Another spill that took forever to clean. ",
          "score": 2,
          "created_utc": 1734831133.0,
          "replies": []
        },
        {
          "id": "m39acyr",
          "author": "Teddybomber87",
          "body": "Holy shit..thats why i would never work in the US. \nYou guys don't have any rights. \nIn germany we have cameras too but only to security. None of the camers are above register, because its forbidden to watch your employees like that. There aren't any cameras in our break room or in the warehouse only one to see the door. We have only walkie-talkies and thats it.",
          "score": 2,
          "created_utc": 1734854941.0,
          "replies": []
        },
        {
          "id": "m39mnke",
          "author": "None",
          "body": "Walmart suppliers are terrible at packaging too. Everything from them leaks.",
          "score": 2,
          "created_utc": 1734863927.0,
          "replies": []
        },
        {
          "id": "m302h2h",
          "author": "Ogediah",
          "body": "They’re for surveillance and they will only be used in their favor. Whether it’s general company liability or bird dogging for a reason to fire someone. Like I guarantee they won’t be used to self report OSHA violations and such. Point being, the cameras are not your friend and saying they are for “safety” seems a bit of a stretch.",
          "score": 2,
          "created_utc": 1734712164.0,
          "replies": []
        },
        {
          "id": "m309qdv",
          "author": "nosleepagain12",
          "body": "I believe this is more for loss prevention. People can't afford food now the Walton family can't be feeding people for free. How will they afford their 4 yachts.",
          "score": 2,
          "created_utc": 1734714567.0,
          "replies": [
            {
              "id": "m30f66x",
              "author": "scorpion_tail",
              "body": "They already have this taken care of. For a nominal fee you can get your payday advance through Walmart just in case you can’t make the stretch!",
              "score": 1,
              "created_utc": 1734716366.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m318xo7",
          "author": "ChesnaughtZ",
          "body": "Such an idiotic comment that somehow got upvotes. Tracking when you enter work and leave is not the same level as them monitoring every single thing you say and do lmao",
          "score": 2,
          "created_utc": 1734726347.0,
          "replies": [
            {
              "id": "m33gkps",
              "author": "Cheezewiz239",
              "body": "Yeah that guy's just wrong. There's a lot of \" things \" I do at work that would get me fired instantly but nobody is actually watching.",
              "score": 1,
              "created_utc": 1734758393.0,
              "replies": [
                {
                  "id": "m38dvpt",
                  "author": "DemonicPeas",
                  "body": "He's not wrong, I currently work at Walmart ant my co-workers have gotten shown recordings of themselves sitting down or using their phone and been told off for it.",
                  "score": 1,
                  "created_utc": 1734836625.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m307yu6",
          "author": "SilentSpook",
          "body": "This is taylorism's final form",
          "score": 1,
          "created_utc": 1734713980.0,
          "replies": []
        },
        {
          "id": "m30a1sw",
          "author": "Bustamonte6",
          "body": "Spill cams… I feel better now",
          "score": 1,
          "created_utc": 1734714672.0,
          "replies": []
        },
        {
          "id": "m30jslv",
          "author": "None",
          "body": "You know who DOESN'T know where any Walmart employees are? \n\nThe customers",
          "score": 1,
          "created_utc": 1734717887.0,
          "replies": []
        },
        {
          "id": "m31egh2",
          "author": "thanatossassin",
          "body": "I don't understand how Walmarts stay staffed...",
          "score": 1,
          "created_utc": 1734728240.0,
          "replies": []
        },
        {
          "id": "m339vjy",
          "author": "Zedrackis",
          "body": "I worked for Goodwill for two years. Goodwills are broken into regional franchises called 'charters' so others might not have the same experience. But one of the early stories I got from senior employees was 'don't talk to god'. All the stores in the franchise are wired for remote surveillance, with microphones and speakers in the ceiling. One day 'god' spoke to her, telling her not to do something. So naturally she just looked up at the ceiling and replied,\"Ok God, thanks.\"",
          "score": 1,
          "created_utc": 1734755055.0,
          "replies": []
        },
        {
          "id": "m33tzas",
          "author": "Syrik02",
          "body": "Yet as a scanned based vendor I still have to go in through the backdoor. Walmart has all this surveillance yet I can’t just walk into the front door make that make sense to me if I was trying to steal anything I should be caught instantly. From the way you make sound I stand out side for as the long as the receiver feels like it.  That sometimes being 45 minutes long for shits and giggles I guess.",
          "score": 1,
          "created_utc": 1734766255.0,
          "replies": []
        },
        {
          "id": "m33ygjz",
          "author": "Vagus10",
          "body": "Why not just have a dedicated cleaning team.\n\nSeems so much easier.",
          "score": 1,
          "created_utc": 1734769154.0,
          "replies": []
        },
        {
          "id": "m34pwu3",
          "author": "Disastrous-Ad1857",
          "body": "Also to prevent unionization, the body cams have mics and it would be easy for an AI to be trained to look for people trying to unionize their store. With unions making a comeback, companies like Walmart are scared they will be the next battleground for the employees to demand better pay, benefits, and treatment.",
          "score": 1,
          "created_utc": 1734786311.0,
          "replies": []
        },
        {
          "id": "m36vjs0",
          "author": "WiscoSippi",
          "body": "Without liability, businesses would still have 7 year olds running lumber mill equipment. They’ve never given a shit about people. When I read anything about corporate safety I immediately translate to liability but it also goes in reverse.  If a company is managing liability, people will be safer and better off for it, generally.",
          "score": 1,
          "created_utc": 1734814903.0,
          "replies": []
        },
        {
          "id": "m38b0l7",
          "author": "iTwango",
          "body": "Why are they so particularly worried about spills?",
          "score": 1,
          "created_utc": 1734835348.0,
          "replies": []
        },
        {
          "id": "m38m5h9",
          "author": "LivermoreP1",
          "body": "Side note - 90% of those cameras aren’t real. They’re just decoys to help prevent theft.",
          "score": 1,
          "created_utc": 1734840454.0,
          "replies": []
        },
        {
          "id": "m39wk2q",
          "author": "CaptainVerret",
          "body": "It took you 2.5 hours to clean up one jar of broken salsa? My guy are you missing arms?",
          "score": 1,
          "created_utc": 1734870662.0,
          "replies": []
        },
        {
          "id": "m3a0r90",
          "author": "I_wish_I_was_a_robot",
          "body": "Why does it take 2.5 hours to deal with a spill? ",
          "score": 1,
          "created_utc": 1734873015.0,
          "replies": []
        },
        {
          "id": "m3bnbt4",
          "author": "Lari-Fari",
          "body": "This just got worse and worse with every paragraph. What an absolute hell hole…",
          "score": 1,
          "created_utc": 1734894668.0,
          "replies": []
        },
        {
          "id": "m3f9wbh",
          "author": "Gosc101",
          "body": "Wait, you have to waste time for stuff that has broken down and your responsibilities are not offset by the that\n\nWhen I worked at supermarket and I didn't have enough time to do everything, I would do the more pressing thing  and simply not do things I didn't have time for. I gave up on trying to run around like madman trying to do everything.\n\nI guess, it depends on the location, but I knew they don't have enough workers so they won't fire me anyway.",
          "score": 1,
          "created_utc": 1734953929.0,
          "replies": []
        },
        {
          "id": "m3fo79a",
          "author": "Candytails",
          "body": "What ideal WalMart?  I knew from the day I was born that it’s a terrible place to work and shop at.  ",
          "score": 1,
          "created_utc": 1734961276.0,
          "replies": []
        },
        {
          "id": "me8b0f1",
          "author": "Retro_Gamer_74",
          "body": "The location tracking is super mid. They don't use GPS. They use wifi triangulation. I can clock in and out so long as I'm connected to the wifi",
          "score": 1,
          "created_utc": 1740258240.0,
          "replies": []
        },
        {
          "id": "m2zvax2",
          "author": "podcasthellp",
          "body": "Those cameras can also read the text on your phone",
          "score": 1,
          "created_utc": 1734709742.0,
          "replies": []
        },
        {
          "id": "m3198ht",
          "author": "Leather_Moment_1101",
          "body": "As a former Walmart employee, they care far more about petty theft than they care about safety!",
          "score": 1,
          "created_utc": 1734726451.0,
          "replies": [
            {
              "id": "m31mkk3",
              "author": "scorpion_tail",
              "body": "Did they assure you that you would not be charged for any merchandise used in self-defense during a mass shooting event? \n\nThey were really happy about sharing that info with me.",
              "score": 1,
              "created_utc": 1734731033.0,
              "replies": [
                {
                  "id": "m31rp1m",
                  "author": "Leather_Moment_1101",
                  "body": "No, but they threatened to arrest me for “stealing” food waste if I didn’t confess.",
                  "score": 2,
                  "created_utc": 1734732859.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2ykan2",
      "author": "Slodin",
      "body": "Hey bob, I see your graph of activity shows that you didn't move for 1 minute. That's a critical performance issue we are noticing. You are getting a warning as of now, please work like we paid you to. We might have to pursuit other actions if your performance doesn't get better. \n\nYours truly,\n\nManagement",
      "score": 425,
      "created_utc": 1734686977.0,
      "replies": [
        {
          "id": "m2yp974",
          "author": "yellowspaces",
          "body": "They’re about to automate one of the most irritating directions you can get from a manager: \n\n“Find something to do.”",
          "score": 127,
          "created_utc": 1734690483.0,
          "replies": [
            {
              "id": "m2z2sdr",
              "author": "None",
              "body": "Sadly, businesses still can't get the math right.\n\nYou only make money if the market buys the things you work on.  Busy workers aren't profitable just because they're busy.",
              "score": 91,
              "created_utc": 1734698514.0,
              "replies": [
                {
                  "id": "m301e2i",
                  "author": "Deranged_Kitsune",
                  "body": "But busy workers make management *feel* better.\n\nThat seems to be the true rationale behind so many return-to-office pushes. At least for places that aren't invested in commercial leases.",
                  "score": 40,
                  "created_utc": 1734711800.0,
                  "replies": [
                    {
                      "id": "m301q02",
                      "author": "None",
                      "body": "Emotional decisions almost always result in poor performance.  If the goal is to make money, it's always best to follow the data.",
                      "score": 9,
                      "created_utc": 1734711911.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m2z9dhg",
                  "author": "TornWonder",
                  "body": "You could help customers, clean, restock/rearrange goods, etc.\n\nJust because there's not a direct link to a transaction doesn't mean that improving customer's experiences in the store doesn't add value.\n\nEdit: I don't work in retail you weirdos.",
                  "score": -53,
                  "created_utc": 1734701470.0,
                  "replies": [
                    {
                      "id": "m2zjaw9",
                      "author": "Mama_Skip",
                      "body": ">Edit: I don't work in retail you weirdos.\n\nThen sit down.",
                      "score": 24,
                      "created_utc": 1734705465.0,
                      "replies": []
                    },
                    {
                      "id": "m2zk365",
                      "author": "Troker61",
                      "body": "Hahahahah that edit is killing me.  \n\nOh you don’t? Wow, no way.",
                      "score": 12,
                      "created_utc": 1734705761.0,
                      "replies": []
                    },
                    {
                      "id": "m2za05v",
                      "author": "TotoCocoAndBeaks",
                      "body": "Spoken as a true representative of the 'supervisors' who earn 10 cents an hour more than their pleb minimum wage colleagues.",
                      "score": 33,
                      "created_utc": 1734701735.0,
                      "replies": [
                        {
                          "id": "m2zb5zr",
                          "author": "cat_prophecy",
                          "body": "Yeah but someday he's going to be middle management and then people like him better watch their step!",
                          "score": 20,
                          "created_utc": 1734702221.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m2zqwfu",
                      "author": "Cool_Ranch_Dodrio",
                      "body": ">I don't work in retail you weirdos.\n\nIt shows.",
                      "score": 7,
                      "created_utc": 1734708217.0,
                      "replies": []
                    },
                    {
                      "id": "m2zkemt",
                      "author": "HeatherReadsReddit",
                      "body": "You can’t help customers if there are none, or they don’t want your help.  \n\nYou can’t restock if it’s not your job.  \n\nYou can’t rearrange goods unless the planogram changed.  \n\nAnd only certain jobs allow people to clean.  \n\nYou are correct that people could be facing the shelves, or straightening things in clothing departments. But there’s nothing to do if everything already looks good.",
                      "score": 5,
                      "created_utc": 1734705880.0,
                      "replies": []
                    },
                    {
                      "id": "m2z9puu",
                      "author": "weid_flex_but_OK",
                      "body": "I'll bet you tell your employees \"if there's time for leaning there's time for cleaning\"...",
                      "score": 24,
                      "created_utc": 1734701614.0,
                      "replies": []
                    },
                    {
                      "id": "m2zc0z2",
                      "author": "None",
                      "body": "I teach our supervisors to look for value in activities.  They commonly try to keep resources busy because they falsely believe idle resources are wasteful.\n\nThe reality is:  Over-use of unneeded resources is not only unprofitable; it's more costly.\n\nSimply moving stock around for the sake of staying busy costs more because it inherently introduces risk of loss.  If you have to move inventory, it's an indicator that you have too much inventory to begin with, which is also more costly.",
                      "score": 11,
                      "created_utc": 1734702573.0,
                      "replies": [
                        {
                          "id": "m2zuudx",
                          "author": "Serious-Excitement18",
                          "body": "Are you really calling human workers resources over and over? Just say worker, or person, or anything other than dehumanizing adjectives.rantdone.",
                          "score": -8,
                          "created_utc": 1734709583.0,
                          "replies": [
                            {
                              "id": "m2zx3fa",
                              "author": "None",
                              "body": "In all businesses, resources are defined as human, machine, or material.  That's how businesses work.\n\nThe term \"resource\" is standard across all industries.  That's why companies have a dedicated department called \"Human Resources\".",
                              "score": 7,
                              "created_utc": 1734710341.0,
                              "replies": [
                                {
                                  "id": "m452e2c",
                                  "author": "Serious-Excitement18",
                                  "body": "Maybe this isnt a good standard. Maybe people dont like this form of consumerism being driven into us. Maybe luigi has a better standard,",
                                  "score": 0,
                                  "created_utc": 1735356622.0,
                                  "replies": [
                                    {
                                      "id": "m45c00a",
                                      "author": "None",
                                      "body": "That's what innovation is for.  If you have a better way, make it happen.  Complaining isn't innovative, and it won't do anything to change the standard.",
                                      "score": 1,
                                      "created_utc": 1735360773.0,
                                      "replies": [
                                        {
                                          "id": "m4scdjq",
                                          "author": "Serious-Excitement18",
                                          "body": "Why do you think i a human even replied? Because of the easy way you made my labor become some product.",
                                          "score": 0,
                                          "created_utc": 1735695929.0,
                                          "replies": [
                                            {
                                              "id": "m4sswco",
                                              "author": "None",
                                              "body": "If you work for a living, you're paid for your labor.  Nobody is forcing you to do anything.",
                                              "score": 1,
                                              "created_utc": 1735702917.0,
                                              "replies": [
                                                {
                                                  "id": "m52zgwz",
                                                  "author": "Serious-Excitement18",
                                                  "body": "Yea way to change the subject. I responded to something that sounded like a robot describing a person. So either you are, or you dont recgnize that you are.",
                                                  "score": 0,
                                                  "created_utc": 1735856540.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m307g41",
                      "author": "MyLittleOso",
                      "body": "Shocker that the corporate bootlicker siding with management is MAGA. Shocking, I say.",
                      "score": 3,
                      "created_utc": 1734713808.0,
                      "replies": []
                    },
                    {
                      "id": "m2zhsj6",
                      "author": "kbb41222",
                      "body": "Ya we can tell you’ve never worked retail",
                      "score": 5,
                      "created_utc": 1734704881.0,
                      "replies": [
                        {
                          "id": "m39nj37",
                          "author": "TornWonder",
                          "body": "What a dumbass",
                          "score": -1,
                          "created_utc": 1734864571.0,
                          "replies": []
                        },
                        {
                          "id": "m2zhy6h",
                          "author": "None",
                          "body": "[removed]",
                          "score": -8,
                          "created_utc": 1734704942.0,
                          "replies": [
                            {
                              "id": "m2zjx24",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1734705697.0,
                              "replies": [
                                {
                                  "id": "m2znafn",
                                  "author": "Acrobatic_Rub_8218",
                                  "body": "“Don’t currently” is not mutually exclusive with “haven’t ever”.",
                                  "score": -4,
                                  "created_utc": 1734706932.0,
                                  "replies": [
                                    {
                                      "id": "m2znuev",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 3,
                                      "created_utc": 1734707135.0,
                                      "replies": [
                                        {
                                          "id": "m2ztlun",
                                          "author": "Acrobatic_Rub_8218",
                                          "body": "Dude, check usernames before you reply to people by being a disrespectful jerk.",
                                          "score": -6,
                                          "created_utc": 1734709159.0,
                                          "replies": [
                                            {
                                              "id": "m309qts",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": 2,
                                              "created_utc": 1734714571.0,
                                              "replies": [
                                                {
                                                  "id": "m30dtye",
                                                  "author": "Acrobatic_Rub_8218",
                                                  "body": "That’s fair. Not an alt though. I just really hate when people make assumptions.",
                                                  "score": 0,
                                                  "created_utc": 1734715925.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m306q0r",
              "author": "wjbc",
              "body": "“If you can lean, you can clean.”",
              "score": 10,
              "created_utc": 1734713572.0,
              "replies": [
                {
                  "id": "m30b2uh",
                  "author": "showyerbewbs",
                  "body": "I heard a comeback from one guy who was TRYING to get fired ( don't fucking know WHY though ) and he said \"If you got time to open your mouth, you got time to shut it\".\n\nI couldn't decide if it was a \"sick burn bro\" or an edgelord trying and failing to be witty.",
                  "score": 21,
                  "created_utc": 1734715012.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m30rlwk",
              "author": "taicrunch",
              "body": "\"Find something to manage.\"",
              "score": 6,
              "created_utc": 1734720485.0,
              "replies": [
                {
                  "id": "m335i3q",
                  "author": "rosecitytransit",
                  "body": "\"I've found something. You.\"",
                  "score": 2,
                  "created_utc": 1734753049.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2zcxt0",
          "author": "Feeling_Screen3979",
          "body": "You laugh at this but this is happening to letter carriers with the scanners they use to scan your packages. We get roasted for \"stationary events\" that last more than 30 seconds that are outside of our breaks",
          "score": 18,
          "created_utc": 1734702948.0,
          "replies": []
        },
        {
          "id": "m2zda47",
          "author": "embarrassedalien",
          "body": "They already do that, basically. It’s not movement, but for example, the place and location of your last scan on the work brick or zebra. Happened to me. The person who managed the online order fulfillment department was a meanie-bo-beanie and chose their favorites to bully due to a personal lack in self esteem. Self esteem issues I can be empathetic towards, but bullying someone to tears, fucking up their car, and borderline hazing; I cannot. Got coached for too much time in the back room after being told pickers were to stage their own chilled and frozen. And other shit that just made the back room time longer that was outside of my control.",
          "score": 14,
          "created_utc": 1734703088.0,
          "replies": []
        },
        {
          "id": "m2yyzix",
          "author": "hewkii2",
          "body": "They can already do that with the WiFi of the zebra device they give you",
          "score": 23,
          "created_utc": 1734696556.0,
          "replies": [
            {
              "id": "m2zc5qd",
              "author": "Inevitable-Lettuce99",
              "body": "This is correct, but not as detailed as you would think.",
              "score": 10,
              "created_utc": 1734702627.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m3036io",
          "author": "Possible-Tangelo9344",
          "body": "When I was in law enforcement my captain told us he got an email anytime our patrol car was stationary for 15 minutes and depending on the location he'd want justification for being still.",
          "score": 4,
          "created_utc": 1734712402.0,
          "replies": []
        },
        {
          "id": "m322hwu",
          "author": "badgirlmonkey",
          "body": "This isn’t an exaggeration. When I got sick and threw up, my manager yelled at me for not stocking fast enough. Then she pulled me to the side and told me I wasn’t doing a good job. My first week btw.",
          "score": 3,
          "created_utc": 1734736932.0,
          "replies": []
        },
        {
          "id": "m2zsxaf",
          "author": "TK_Games",
          "body": "\"Those who sacrifice liberty for security, forfeit both\" ~ Ben Franklin (paraphrased)",
          "score": 2,
          "created_utc": 1734708921.0,
          "replies": []
        },
        {
          "id": "m2zt2il",
          "author": "Capybara_Cheese",
          "body": "Amazon already does this. They're creating a more efficient workforce through surveillance.",
          "score": 1,
          "created_utc": 1734708972.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2yjovf",
      "author": "TheRocki",
      "body": "That's totally what it will be used for.",
      "score": 196,
      "created_utc": 1734686537.0,
      "replies": [
        {
          "id": "m2ytrs2",
          "author": "cubanesis",
          "body": "Totally. I’m sure this isn’t ever going to be used to protect Walmart from lawsuits. And it definitely won’t ever be used as evidence to punish employees for not going fast enough.",
          "score": 75,
          "created_utc": 1734693491.0,
          "replies": [
            {
              "id": "m2zfwaq",
              "author": "okram2k",
              "body": "the amount of worker's comp claim denials are going to go through the roof.",
              "score": 20,
              "created_utc": 1734704136.0,
              "replies": []
            },
            {
              "id": "m2zf50c",
              "author": "WeeklyBanEvasion",
              "body": "So the exact same thing reddit wants every cop wearing them for?\n\nSeems fair.",
              "score": -19,
              "created_utc": 1734703836.0,
              "replies": [
                {
                  "id": "m2zf98n",
                  "author": "fingernailchewer",
                  "body": "In what world are police officers and walmart employees held to the same standard lol",
                  "score": 22,
                  "created_utc": 1734703883.0,
                  "replies": [
                    {
                      "id": "m2zjukr",
                      "author": "Mama_Skip",
                      "body": "The one of bad faith argument. \n\nI love how much people simp for the elites that Walmart starts obviously predatory surveillance and someone comes to the comments to defend them.",
                      "score": 10,
                      "created_utc": 1734705671.0,
                      "replies": []
                    },
                    {
                      "id": "m31f4dl",
                      "author": "WeeklyBanEvasion",
                      "body": "Everyone should be expected to do their job regardless of how \"low\" the position is.",
                      "score": -7,
                      "created_utc": 1734728465.0,
                      "replies": [
                        {
                          "id": "m34it30",
                          "author": "Oldfolksboogie",
                          "body": "I don't really feel my life could be threatened by a Walmart employee who didn't have to worry about accountability, though.",
                          "score": 5,
                          "created_utc": 1734782498.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2zfpt5",
                  "author": "Infamous-Adeptness59",
                  "body": "What a terrible false equivalency to act like low-level private retail employees in a gigantic multi-national corporation should be held to the same standards as tax-payer funded positions of \"protecting and serving\" the public who have the power of determining citizens' freedom and/or continued life. Get a better argument.",
                  "score": 13,
                  "created_utc": 1734704065.0,
                  "replies": []
                },
                {
                  "id": "m308n6a",
                  "author": "Fit_Specific8276",
                  "body": "walmart employees aren’t cops, next",
                  "score": 4,
                  "created_utc": 1734714203.0,
                  "replies": [
                    {
                      "id": "m31er5j",
                      "author": "WeeklyBanEvasion",
                      "body": "Nobody cares, it's enforcement of job duties.",
                      "score": -6,
                      "created_utc": 1734728340.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m30nrum",
                  "author": "Gadetron",
                  "body": "Inb4 a Walmart worker turns off their body cam and shoots me with a price gun and gets a raise",
                  "score": 2,
                  "created_utc": 1734719210.0,
                  "replies": []
                },
                {
                  "id": "m32fgql",
                  "author": "jford16",
                  "body": "Yeah when Walmart employees start etching [\"You're fucked\"](https://www.aclu.org/news/criminal-law-reform/youre-fucked-acquittal-officer-brailsford-and) on the gun they shoot someone with, they absolutely should be held to the same standard as cops.",
                  "score": 2,
                  "created_utc": 1734742102.0,
                  "replies": [
                    {
                      "id": "m33ohyp",
                      "author": "WeeklyBanEvasion",
                      "body": "Wait until you see what soldiers write on their weapons and munitions. You'll have a fucking aneurysm.",
                      "score": -1,
                      "created_utc": 1734762870.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m30trlg",
                  "author": "TacoBelle2176",
                  "body": "It’s not a bad idea, but that’s kind of a stupid comparison \n\nBad cops can kill people. \n\nBad Walmart employees…",
                  "score": 1,
                  "created_utc": 1734721200.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2ztf5x",
          "author": "Capybara_Cheese",
          "body": "They use surveillance to create a more efficient workforce. There should bebe laws against it but we all know who the law really protects",
          "score": 2,
          "created_utc": 1734709095.0,
          "replies": [
            {
              "id": "m39556u",
              "author": "brentaltm",
              "body": "It’s funny because Walmart does not feel efficient at all. All of the employees look overworked, lethargic, and apathetic. The stores near me are a mess. I’ve heard Target has similarly oppressive policies but at least they actually feel like a well-oiled machine…",
              "score": 1,
              "created_utc": 1734851281.0,
              "replies": [
                {
                  "id": "m3a8avc",
                  "author": "Capybara_Cheese",
                  "body": "Why should Walmart care if we're inconvenienced? It's profitable to understaff their stores. They have taken more and more from us over time.",
                  "score": 1,
                  "created_utc": 1734876629.0,
                  "replies": [
                    {
                      "id": "m3e1bba",
                      "author": "brentaltm",
                      "body": "This is very true.",
                      "score": 1,
                      "created_utc": 1734926580.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m2zk7v0",
          "author": "catalyptic",
          "body": "Nah. It's for loss prevention. The workers won't get away with pilfering stuff if they're constantly on body cam. And, no pervy managers will dare review footage of their bathroom breaks.",
          "score": -1,
          "created_utc": 1734705810.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2z59an",
      "author": "Hail-Hydrate",
      "body": "I do like that nobody has actually read the article and discovered that these operate similar to some police bodycams - you have to actually switch them on in order to have them record, and training material specifically states not to switch them on unless a customer is escalating a situation (they don't have a lot of storage). \n\nFuck Walmart and how they operate, but these straight-up can't be used to actively monitor what employees are doing. The security cameras in the store do that already anyway.",
      "score": 67,
      "created_utc": 1734699674.0,
      "replies": [
        {
          "id": "m30di8w",
          "author": "digitek",
          "body": "sad this comment was so far down.  thanks for reading the article!",
          "score": 9,
          "created_utc": 1734715818.0,
          "replies": []
        },
        {
          "id": "m30pox0",
          "author": "brigadier_unusual",
          "body": "While you are right, don't think for a second that Walmart won't update the policy in the next few months or years to require them on during floor/ customer facing activities. Liability is huge, huge in the Walmart corporate culture. I learned a lot working in their stores for 6+years as a third-party vendor near the home office. \n\nIt's speculative, by my thought to this new body cam requirement is Walmart wants to put a pov recording device on employees at all times, that Walmart controls, to fight claims from frivolous lawsuits. Security cames miss things on the floor. Body cams can address some of these gaps and adds additional evidence to refute any claims made against Walmart.",
          "score": 10,
          "created_utc": 1734719847.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2ynrgm",
      "author": "DekuHHH",
      "body": "Honestly, Walmart’s explanation makes no sense. Why bodycams when their stores have security cameras in every corner of the buildings? They specifically state this is for loss prevention and employee safety. If a customer is already getting physical/violent in a store that puts Big Brother to shame, I doubt a body cam is going to be effective in deescalating the situation\n\nI have a feeling this is so Walmart can invasively monitor their employees at all times",
      "score": 105,
      "created_utc": 1734689447.0,
      "replies": [
        {
          "id": "m2yxin9",
          "author": "solidsnake1984",
          "body": "I can't speak for every single walmart, but the one where I live, the police constantly post photos from it where they are looking for a shop lifter.  The images look like they are taken with a potato.  You seriously have no way to even get facial features, etc....",
          "score": 45,
          "created_utc": 1734695743.0,
          "replies": [
            {
              "id": "m2z1npc",
              "author": "grammar_nazi_zombie",
              "body": "And yet their self checkouts build a profile on you based on facial recognition.",
              "score": 19,
              "created_utc": 1734697954.0,
              "replies": [
                {
                  "id": "m2zfbnx",
                  "author": "WeeklyBanEvasion",
                  "body": "Theifs don't use the checkout 🤦‍♂️",
                  "score": 6,
                  "created_utc": 1734703911.0,
                  "replies": [
                    {
                      "id": "m2zfera",
                      "author": "grammar_nazi_zombie",
                      "body": "You must be unaware of self checkout fraud",
                      "score": 10,
                      "created_utc": 1734703945.0,
                      "replies": []
                    },
                    {
                      "id": "m2zhy4c",
                      "author": "JayKay8787",
                      "body": "I do all time",
                      "score": 1,
                      "created_utc": 1734704942.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m2yzs2r",
              "author": "MountEndurance",
              "body": "This is my favorite description of a security camera photo.",
              "score": 8,
              "created_utc": 1734696977.0,
              "replies": [
                {
                  "id": "m2z15kx",
                  "author": "HippyGrrrl",
                  "body": "But potatoes have eyes.",
                  "score": 4,
                  "created_utc": 1734697698.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m2zh99r",
              "author": "okram2k",
              "body": "when I worked at Walmart decades ago as an assistant manager the security cameras were very much okay but the main purpose of them was not to record things to send to the authorities. it was for a couple people in loss preventing watching around the clock to look for customers doing suspicious things that was likely to be theft or vandalism and then contact the floor loss prevention associates to start tailing the suspected person. The eyes in the sky were really just to alert, and draw attention not to produce crystal clear evidence in court. for that you just have a couple employees watch someone stuff space jam DVDs down their pants in person. Then you ask them politely to come with you to the security room, show them the tape and ask them to sign a notice that they've been banned from Walmart. Repeat offender got the cops involved. ​",
              "score": 1,
              "created_utc": 1734704673.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2zdgsb",
          "author": "sixtyfivejaguar",
          "body": "They only have around 8 cameras going at any given time. But in the back where the employees grab products, that's a different story. These body cams are 100% to monitor employees. They don't trust them at all.",
          "score": 8,
          "created_utc": 1734703162.0,
          "replies": [
            {
              "id": "m2zfftd",
              "author": "WeeklyBanEvasion",
              "body": "Most loss comes from employees, so that's understandable",
              "score": 4,
              "created_utc": 1734703956.0,
              "replies": []
            },
            {
              "id": "m37pit5",
              "author": "None",
              "body": "Well when 90% of your work force is on a Visa from a different country…..You don't blame them",
              "score": 0,
              "created_utc": 1734826370.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m2yyvrm",
          "author": "hewkii2",
          "body": "Parking lot coverage is fairly poor so this would help significantly out there.",
          "score": 4,
          "created_utc": 1734696500.0,
          "replies": []
        },
        {
          "id": "m2z013n",
          "author": "MrsWhorehouse",
          "body": "Employees cannot steal when they are on camera.",
          "score": 4,
          "created_utc": 1734697108.0,
          "replies": []
        },
        {
          "id": "m2z825i",
          "author": "KotaIsBored",
          "body": "I worked overnight at a Walmart for years. A lot of the cameras are decoys and don’t actually record anything especially the ones that hang in the middle of the aisle with a big screen flashing “you are being recorded.”",
          "score": 5,
          "created_utc": 1734700910.0,
          "replies": []
        },
        {
          "id": "m2yoc5g",
          "author": "rrhunt28",
          "body": "Typically most cameras you see in the store are fake. The cameras over the cash registers are real before that is where a lot of theft happened. But out on the floor many of the pods are empty.",
          "score": 12,
          "created_utc": 1734689847.0,
          "replies": [
            {
              "id": "m2yzgzp",
              "author": "InAllThingsBalance",
              "body": "And those cameras are primarily to watch the employees.",
              "score": 7,
              "created_utc": 1734696813.0,
              "replies": [
                {
                  "id": "m2z037k",
                  "author": "MrsWhorehouse",
                  "body": "BINGO!",
                  "score": 4,
                  "created_utc": 1734697140.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m2zd2bh",
          "author": "kudles",
          "body": "Not even just the employees… but customers. Every customer will have their face scanned and analyzed for an increased government surveillance state. Government will have access to this information either through exclusive “business” partnership or existing legislation.\n\nSuper disgusting behavior",
          "score": -4,
          "created_utc": 1734702999.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m34gqtj",
      "author": "Hippy_Lynne",
      "body": "All of you commenting without reading the article. 🙄 Workers are instructed to only turn the body cam on if a situation with a customer escalates. They're not even telling them to turn them on if they think they witness shoplifting (trust me, they have enough cameras in the ceiling anyway.) Walmart is not going to spend the money to store 40 hours of footage a week per employee, much less on some kind of system that would be judging efficiency. You're thinking of Amazon.\n\nDealing with the public since the pandemic has been insane. All the stupid entitled \"You can't make me wear a mask!\" people have continued to show disrespect to customer facing employees. I drive for a living and have a dashcam and there is no way I would deal with the public without video recording. For the employees' sake, I'm glad Walmart is doing this. They are still a shitty company in a million other ways, but not this one.",
      "score": 8,
      "created_utc": 1734781252.0,
      "replies": []
    },
    {
      "id": "m301p8d",
      "author": "-Cherry-Wine",
      "body": "I wish Superstore was still on the air. I would love to see this episode.",
      "score": 6,
      "created_utc": 1734711904.0,
      "replies": []
    },
    {
      "id": "m2yjp0t",
      "author": "Ccwaterboy71",
      "body": "No, its to monitor employees like Amazon does",
      "score": 33,
      "created_utc": 1734686540.0,
      "replies": []
    },
    {
      "id": "m2ytwbg",
      "author": "Ancient_Tea_6990",
      "body": "Does the janitor wear the body camera into the bathroom when cleaning it.",
      "score": 5,
      "created_utc": 1734693572.0,
      "replies": []
    },
    {
      "id": "m2yy5mr",
      "author": "bl8ant",
      "body": "I want to see the riot gear and mecha suits they wear in the hostile shopping future of capitalist hellscape rollerbalmart! Enter the arena and save!!!",
      "score": 6,
      "created_utc": 1734696102.0,
      "replies": []
    },
    {
      "id": "m35q7li",
      "author": "Lsutigers202111",
      "body": "Not to keep them safe….  For megacorp liability protection",
      "score": 6,
      "created_utc": 1734800441.0,
      "replies": []
    },
    {
      "id": "m2yk6ib",
      "author": "ThomasPopp",
      "body": "Nope. I will never work for a company that requires me to be a physical recording medium.",
      "score": 23,
      "created_utc": 1734686893.0,
      "replies": [
        {
          "id": "m2yrxhx",
          "author": "GeorgeRRZimmerman",
          "body": "Right? Imagine knowing that your every movement, how long you're at a place, what your usual habits are, who you talk to more, even what kinds of things you talk about; if all of that was just something that was being monitored by a thing you willingly carry on you.\n\nWaitaminute...\n\nEdit: some people really don't see the irony. It's about privacy and cell phones.",
          "score": 6,
          "created_utc": 1734692300.0,
          "replies": [
            {
              "id": "m2zuf4r",
              "author": "snowyoda5150",
              "body": "My wife works in an emergency room. They wear tracking devices it tracks everything they do. She loves her job. Waitsminute.",
              "score": 3,
              "created_utc": 1734709438.0,
              "replies": []
            },
            {
              "id": "m2zeyxj",
              "author": "ElliotPagesMangina",
              "body": "Seriously dude, fuck that.\n\nIt’s so invasive on so many levels.",
              "score": 1,
              "created_utc": 1734703769.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2ypc5k",
      "author": "ChiefStrongbones",
      "body": "> Walmart Employees Now Wearing Body Cameras to Keep ~~Them~~ *Company* Safe",
      "score": 11,
      "created_utc": 1734690540.0,
      "replies": []
    },
    {
      "id": "m2yom2h",
      "author": "3Cheers4Apathy",
      "body": "Nothing like having someone else tell me what's best for my own safety.",
      "score": 5,
      "created_utc": 1734690037.0,
      "replies": []
    },
    {
      "id": "m2yomdo",
      "author": "Adventurous-Sky9359",
      "body": "I talk to myself constantly no way I could manage 5 hour shift with a camera on me.",
      "score": 6,
      "created_utc": 1734690043.0,
      "replies": [
        {
          "id": "m2yr5sm",
          "author": "_enesorek_",
          "body": "Yeah, they’d hear me mumbling all kinds of weird shit.",
          "score": 3,
          "created_utc": 1734691791.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m3052rm",
      "author": "blazze_eternal",
      "body": "Remember a few months back Walmart freaked out with the report of self checkout costing them millions in stolen items? All the stores around here closed most self checkouts and opened more staffed ones.  \nGuess what? It's back to business as usual. Typically only 2 staffed checkout lines and the rest self checkout.  \nNew trend is converting every isle to be locked cabinets.",
      "score": 5,
      "created_utc": 1734713030.0,
      "replies": [
        {
          "id": "m30pg4g",
          "author": "skriefal",
          "body": "> New trend is converting every isle to be locked cabinets.\n\nGuess they want to lose even more sales to Amazon.",
          "score": 4,
          "created_utc": 1734719765.0,
          "replies": [
            {
              "id": "m30vv9s",
              "author": "makraiz",
              "body": "Yeah the locked cabinet thing doesn't work when there's no employees in sight, and no one responds to the call button.  I've taken to shopping elsewhere for anything locked up.",
              "score": 3,
              "created_utc": 1734721910.0,
              "replies": [
                {
                  "id": "m3414ux",
                  "author": "jtotal",
                  "body": "The call button is a little announcement that goes off in the radios. Unless you're not already halfway across the store, not actively talking to a customer to where you'll actually hear it or be capable of helping, someone else already having the keys you need, or you're in my position where you moved up the same week the keybox stopped working to add new people to it so you can't do anything to help someone and it's been close to a year... \n\nWith that being said, yeah. I totally do the same thing. If I know it's gonna be locked up, I go elsewhere for it. When I'm off, I just want to be incredibly introverted and left alone.",
                  "score": 1,
                  "created_utc": 1734770944.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m34izby",
      "author": "Ok_Fox_1770",
      "body": "Glad my local Walmarts peaceful, besides all the open sneezing coughing pajama pants people wiping their nose on everything. That body vid would be great YouTube logs. Just human Pokémon collecting everyday dude. I might get a night job for fun.",
      "score": 3,
      "created_utc": 1734782600.0,
      "replies": []
    },
    {
      "id": "m36bqfc",
      "author": "sktzo",
      "body": "or so walmart can monitor efficency",
      "score": 4,
      "created_utc": 1734807864.0,
      "replies": []
    },
    {
      "id": "m38h6uw",
      "author": "ManateeGrooming",
      "body": "I would be willing bet this is more about training computer vision algorithms so robots can do their jobs than it is about employee safety. They don’t care about employee safety.",
      "score": 3,
      "created_utc": 1734838164.0,
      "replies": []
    },
    {
      "id": "m2yrzkt",
      "author": "FarhadTowfiq",
      "body": "Weird way to stay safe!",
      "score": 8,
      "created_utc": 1734692338.0,
      "replies": []
    },
    {
      "id": "m2yvin0",
      "author": "makashiII_93",
      "body": "“Safe”.",
      "score": 3,
      "created_utc": 1734694574.0,
      "replies": []
    },
    {
      "id": "m2zz4sp",
      "author": "Plurfectworld",
      "body": "Give them tasers",
      "score": 3,
      "created_utc": 1734711034.0,
      "replies": [
        {
          "id": "m33xoiq",
          "author": "xxBeatrixKiddoxx",
          "body": "Is it Axon brand? \nIf so then they kindaaaa got Tasers\n\nWell the co that started Tasers lol",
          "score": 1,
          "created_utc": 1734768638.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m305im6",
      "author": "painstream",
      "body": "Cameras don't keep you safe, just record the time of injury...",
      "score": 3,
      "created_utc": 1734713175.0,
      "replies": []
    },
    {
      "id": "m330hgw",
      "author": "michael3316030",
      "body": "Someone is going to win a nice lawsuit when someone forgets to turn their cam off before going in the bathroom",
      "score": 3,
      "created_utc": 1734750868.0,
      "replies": []
    },
    {
      "id": "m3344uu",
      "author": "realdonaldtrumpsucks",
      "body": "They’ll never have a workers comp claim again.",
      "score": 3,
      "created_utc": 1734752443.0,
      "replies": []
    },
    {
      "id": "m37i0yv",
      "author": "dragon_sushi",
      "body": "That's not security... That's gathering potential evidence.  Still good,wrong words in title.",
      "score": 3,
      "created_utc": 1734823364.0,
      "replies": []
    },
    {
      "id": "m37ixjr",
      "author": "syslolologist",
      "body": "America, a third-world country wearing a Gucci belt.",
      "score": 3,
      "created_utc": 1734823725.0,
      "replies": []
    },
    {
      "id": "m37p599",
      "author": "None",
      "body": "We have Walmart wearing body cams before Winnipeg Police service.\n\n  \nWhat a world we live in",
      "score": 3,
      "created_utc": 1734826218.0,
      "replies": []
    },
    {
      "id": "m38b0h3",
      "author": "Orange-Blur",
      "body": "They are kidding themselves if they say it’s anything but employee surveillance and more cameras to catch theft.",
      "score": 3,
      "created_utc": 1734835347.0,
      "replies": []
    },
    {
      "id": "m394wcd",
      "author": "None",
      "body": "It sounds like more of an excuse to spy on their workers.",
      "score": 3,
      "created_utc": 1734851115.0,
      "replies": []
    },
    {
      "id": "m399lv0",
      "author": "LetMePushTheButton",
      "body": "Imagine if Walmart employees start their own streaming channel to supplement their dog shit pay. I wish they could.",
      "score": 3,
      "created_utc": 1734854409.0,
      "replies": []
    },
    {
      "id": "m3a98t4",
      "author": "_Action_Bastard",
      "body": "The Walmart near me put normal people in “security” black vests at the doors. I do my best to fart every time I walk by them. I give them a deadeye stare and a polite GFY when they ask for my receipt. If they demand it, I drop the receipt and I don’t break my stride. Call the cops if you think I stole something, I’m not stopping for you. If you’re gonna be a stooge for a billion dollar corporation and harass people as they leave the store, you get the treatment you deserve. Downvote away, I don’t care.",
      "score": 3,
      "created_utc": 1734877048.0,
      "replies": []
    },
    {
      "id": "m2ylmrl",
      "author": "Absolarix",
      "body": "I wonder if this is related to the poor girl from Halifax who lost her life in October...",
      "score": 6,
      "created_utc": 1734687944.0,
      "replies": [
        {
          "id": "m2ytfoq",
          "author": "learnedsanity",
          "body": "Since this was brought up long before that event it's not.",
          "score": 1,
          "created_utc": 1734693275.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2yqiy0",
      "author": "huhwhatnogoaway",
      "body": "“To keep them safe” more like to like management see if you’re actually working…",
      "score": 4,
      "created_utc": 1734691358.0,
      "replies": []
    },
    {
      "id": "m32t335",
      "author": "pengy99",
      "body": "Ah yes, huge corporations spending lots of money to keep their employees safe without a law or fear of liability requiring them to do so....sure. I definitely believe this. It definitely has nothing to do with surveillance. It definitely has nothing to do with making sure they don't spend too long on break. It definitely has nothing to do with making sure they are being as productive as possible while on the clock.",
      "score": 5,
      "created_utc": 1734747723.0,
      "replies": [
        {
          "id": "m334807",
          "author": "realdonaldtrumpsucks",
          "body": "Workers comp claims\nDone.\n\nYou walked through the puddle. \n\nClaim\nDenied",
          "score": 2,
          "created_utc": 1734752481.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2yl1x1",
      "author": "javierich0",
      "body": "Is anyone actually dumb enough to believe them? They are just monitoring them.",
      "score": 5,
      "created_utc": 1734687528.0,
      "replies": []
    },
    {
      "id": "m2yyr0q",
      "author": "Itcouldberabies",
      "body": "I haven't been in a Walmart since COVID hit, and, surprisingly to me, I have yet to miss it.",
      "score": 2,
      "created_utc": 1734696429.0,
      "replies": []
    },
    {
      "id": "m2z3hau",
      "author": "rasz_pl",
      "body": "... to Keep Walmart Safe from potential lawsuits and to help police employees.",
      "score": 2,
      "created_utc": 1734698847.0,
      "replies": []
    },
    {
      "id": "m2z6fed",
      "author": "KrackSmellin",
      "body": "And cue more and more folks quitting and being fired over this because of being watched by “big brother”.  The only one making out on this deal is whomever sold Walmart on the storage systems to keep all that body cam footage somewhere.   Would have loved to be on the receiving end of that PO.",
      "score": 2,
      "created_utc": 1734700199.0,
      "replies": []
    },
    {
      "id": "m2zluzc",
      "author": "Adventurous-Depth984",
      "body": " lol It’s not for safety. At. All",
      "score": 2,
      "created_utc": 1734706415.0,
      "replies": []
    },
    {
      "id": "m30dfsi",
      "author": "AntOk4073",
      "body": "There's about to be a huge influx of Karen videos online.",
      "score": 2,
      "created_utc": 1734715796.0,
      "replies": [
        {
          "id": "m30io3l",
          "author": "Financial_Leopard_53",
          "body": "I did wonder - protection from whom - indeed Karens’ in the wild",
          "score": 1,
          "created_utc": 1734717511.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m30nn43",
      "author": "Lawls91",
      "body": "r/aboringdystopia",
      "score": 2,
      "created_utc": 1734719166.0,
      "replies": []
    },
    {
      "id": "m30peez",
      "author": "kaminari1",
      "body": "It’s not for safety. It’s to ensure that the workers are making the CEO a profit. \n\nI will quit if my store gets them.",
      "score": 2,
      "created_utc": 1734719749.0,
      "replies": []
    },
    {
      "id": "m318c30",
      "author": "_Soup_R_Man_",
      "body": "I'm all for it.  Maybe I'll be able to get some customer service in various departments.  They seem to all be hiding.  That or just way understaffed.  Lol",
      "score": 2,
      "created_utc": 1734726140.0,
      "replies": []
    },
    {
      "id": "m326oss",
      "author": "firedrakes",
      "body": "Some location",
      "score": 2,
      "created_utc": 1734738589.0,
      "replies": []
    },
    {
      "id": "m32rp1h",
      "author": "echo5milk",
      "body": "I like my local WMT associates. Great people trying to serve us customers and make a living.",
      "score": 2,
      "created_utc": 1734747140.0,
      "replies": []
    },
    {
      "id": "m34ai7f",
      "author": "None",
      "body": "Can we cameras don’t really keep anyone safe. They just record the act from the degenerate to be used later by the law. Safety would actually require proactive measures.\n\nSurveillance pretty much every where at this point it doesn’t really keep anyone safe.",
      "score": 2,
      "created_utc": 1734777234.0,
      "replies": []
    },
    {
      "id": "m34nkwp",
      "author": "None",
      "body": "Unlike the Rehoboth branch that is full of nazis. True story",
      "score": 2,
      "created_utc": 1734785138.0,
      "replies": []
    },
    {
      "id": "m36lqo5",
      "author": "Painboi",
      "body": "Wearing body cameras while on their cell or discussing non job activities basically snitching themselves out…Body cameras work for you and also against your depending how the employer decides to use them !",
      "score": 2,
      "created_utc": 1734811348.0,
      "replies": []
    },
    {
      "id": "m38j042",
      "author": "ASUS_USUS_WEALLSUS",
      "body": "We are in the dystopia. All employees should refuse this.",
      "score": 2,
      "created_utc": 1734838997.0,
      "replies": []
    },
    {
      "id": "m38jhut",
      "author": "None",
      "body": "They're wearing them to keep the company safe from litigation.",
      "score": 2,
      "created_utc": 1734839223.0,
      "replies": []
    },
    {
      "id": "m39c816",
      "author": "BrainwashedScapegoat",
      "body": "Its not for safety",
      "score": 2,
      "created_utc": 1734856287.0,
      "replies": []
    },
    {
      "id": "m39qjrm",
      "author": "MulleDK19",
      "body": "Of course Walmart tasks their employees with keeping their cameras safe.",
      "score": 2,
      "created_utc": 1734866723.0,
      "replies": []
    },
    {
      "id": "m3a06yj",
      "author": "vigilantesd",
      "body": "Are they putting donation boxes out for their employees again? Or teaching employees how to get welfare still? It’s  insane anyone gives this company a dime.",
      "score": 2,
      "created_utc": 1734872719.0,
      "replies": []
    },
    {
      "id": "m2yug9y",
      "author": "Maghorn_Mobile",
      "body": "\"To keep them safe.\" More like so management can nitpick their work and use it to fire anybody they don't like for any reason",
      "score": 3,
      "created_utc": 1734693922.0,
      "replies": []
    },
    {
      "id": "m315yu2",
      "author": "DotBitGaming",
      "body": "Safe from what? The bakery ovens? Gotta love them spending money like this when they're not keeping their employees safe from food insecurity.",
      "score": 3,
      "created_utc": 1734725328.0,
      "replies": []
    },
    {
      "id": "m2yl9bs",
      "author": "adamcoe",
      "body": "I think you misspelled \"to make sure the corporation isn't liable for anything\"",
      "score": 2,
      "created_utc": 1734687677.0,
      "replies": []
    },
    {
      "id": "m30nghv",
      "author": "None",
      "body": "body cameras aren't for their safety, this is to treat employees more like slaves",
      "score": 2,
      "created_utc": 1734719106.0,
      "replies": [
        {
          "id": "m31etyz",
          "author": "None",
          "body": "Can't it be both?",
          "score": 3,
          "created_utc": 1734728366.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m32lh21",
      "author": "FuzzyBadFeets",
      "body": "No more extended breaks…for your safety",
      "score": 2,
      "created_utc": 1734744555.0,
      "replies": []
    },
    {
      "id": "m3346ah",
      "author": "Odd-Garlic-4637",
      "body": "Union. This wouldn’t happen",
      "score": 2,
      "created_utc": 1734752461.0,
      "replies": []
    },
    {
      "id": "m2yx1hv",
      "author": "SevenJuicyBoxOfJoy",
      "body": "Placebo effect, a camera is not a barrier and theres already tons of camera in the stores.. this is just the sad state of society in full display",
      "score": 1,
      "created_utc": 1734695471.0,
      "replies": [
        {
          "id": "m2z3a3h",
          "author": "None",
          "body": "Licking that full boot I see",
          "score": -1,
          "created_utc": 1734698751.0,
          "replies": [
            {
              "id": "m2z4q70",
              "author": "SevenJuicyBoxOfJoy",
              "body": "Im 100% against cop. Relax",
              "score": 2,
              "created_utc": 1734699433.0,
              "replies": []
            },
            {
              "id": "m2z52rv",
              "author": "SevenJuicyBoxOfJoy",
              "body": "Im actually talking about how a bodycam does not lower violence and has nothing to do with pigs.\nWalmart should invest in more than one security guy, but big corps dont wanna waste money in more personal, in their mind, it's a loss of profit",
              "score": 2,
              "created_utc": 1734699593.0,
              "replies": [
                {
                  "id": "m2z5fze",
                  "author": "None",
                  "body": "The phrase licking the boot means to try very hard to please someone in authority— not specifically cops.",
                  "score": 0,
                  "created_utc": 1734699758.0,
                  "replies": [
                    {
                      "id": "m2z6s02",
                      "author": "SevenJuicyBoxOfJoy",
                      "body": "It was born out of hate for cops supporter, lmao learn your revolutionary lore son.",
                      "score": 2,
                      "created_utc": 1734700353.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m2ywgm5",
      "author": "Batman1384",
      "body": "“Keep them safe”…ok",
      "score": 1,
      "created_utc": 1734695138.0,
      "replies": []
    },
    {
      "id": "m2ywway",
      "author": "Plta-0-Plomo",
      "body": "So they don’t steal time!",
      "score": 1,
      "created_utc": 1734695389.0,
      "replies": []
    },
    {
      "id": "m2yx22o",
      "author": "ViktorTheWarlord",
      "body": "If I worked at Walmart I'd quit this instant.",
      "score": 1,
      "created_utc": 1734695479.0,
      "replies": []
    },
    {
      "id": "m2z3x1u",
      "author": "None",
      "body": "I should have or I wouldnt be blacklist from rehire.",
      "score": 1,
      "created_utc": 1734699056.0,
      "replies": []
    },
    {
      "id": "m2z4wgz",
      "author": "vertigeo",
      "body": "i love that businesses are getting more and more overt with the fact that they’re both spying on consumer and employee. i’d love to know the rules for these for breaks and if you have to piss for whatever reason. just another step to discourage taking a moment for yourself",
      "score": 1,
      "created_utc": 1734699512.0,
      "replies": [
        {
          "id": "m2zclfl",
          "author": "AnRealDinosaur",
          "body": "The article says an employee is to manually start the device recording if an interaction is going south, it's not recording all the time. They don't have a lot of storage.",
          "score": 2,
          "created_utc": 1734702808.0,
          "replies": [
            {
              "id": "m2zj5c7",
              "author": "vertigeo",
              "body": "for now. i’m also with all the people pointing out that walmart already has an extensive camrea system and apparently an app for tracking timeclocks. what happens if the employee doesn’t follow company script when dealing with an irate customer? i also don’t really like that a customer can’t expect some “privacy” when upset - so what, if i raise my voice because i’m having a bad experience, bad day, or whatever, it’s going to be recorded bc an employee feels i’m being threatening? \n\nit’s another erosion of privacy and i’m going to be honest, i really think employees and consumers should be speaking up about this, because this isn’t protection for the employee, it’s another way to make sure ur following company script when dealing with an upset customer. someone is going to be fired over what’s said on one of these.",
              "score": 0,
              "created_utc": 1734705407.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m2z6jz3",
      "author": "jasontronic",
      "body": "I wonder what they're training? They can monitor employees without body cams so the video is for something that needs that situation.",
      "score": 1,
      "created_utc": 1734700256.0,
      "replies": []
    },
    {
      "id": "m2z72qc",
      "author": "drempire",
      "body": "People who abuse min wage employees are the lowest of the low.   \n\nThe worst offender's in my experience is the Sunday Christian crowd, the people one would think would be the nicest are actually the worst people I have ever met while working min wage",
      "score": 1,
      "created_utc": 1734700483.0,
      "replies": []
    },
    {
      "id": "m2z7kbd",
      "author": "walrusbwalrus",
      "body": "The utility for walmart and for police in this is obvious and may be useful. The utility for the employees, gonna guess cost far outweighs benefit.",
      "score": 1,
      "created_utc": 1734700697.0,
      "replies": []
    },
    {
      "id": "m2z7nw6",
      "author": "jibbyjackjoe",
      "body": "Gonna be awkward at coffee poop time when they forget to turn off the camera",
      "score": 1,
      "created_utc": 1734700740.0,
      "replies": []
    },
    {
      "id": "m2z7ojf",
      "author": "PerNewton",
      "body": "Maybe they are getting into the Only Fans business.",
      "score": 1,
      "created_utc": 1734700748.0,
      "replies": []
    },
    {
      "id": "m2z83ed",
      "author": "LocustUprising",
      "body": "Wear body cams so that when you die, this time they have footage and can blame you for your death",
      "score": 1,
      "created_utc": 1734700926.0,
      "replies": []
    },
    {
      "id": "m2z9las",
      "author": "None",
      "body": "“Safe”",
      "score": 1,
      "created_utc": 1734701561.0,
      "replies": []
    },
    {
      "id": "m2zb6ve",
      "author": "Agrandaman",
      "body": "You can bet these employee cameras will “work” significantly better than police body cams.",
      "score": 1,
      "created_utc": 1734702231.0,
      "replies": []
    },
    {
      "id": "m2zc6cf",
      "author": "sgtpnkks",
      "body": "100% guarantee they will have audio recording as well...\n\nIf this comes true I urge every walmart associate to just start saying the word union as much as possible to find out if they throw in some kind of ai software to track key words... Like find ways to casually use the word without taking about forming a union\n\nLike get really into the union pacific railroad",
      "score": 1,
      "created_utc": 1734702634.0,
      "replies": []
    },
    {
      "id": "m2zdigy",
      "author": "UncleDuude",
      "body": "How the fuck is a camera being spun as some sort of safety device? So they can have a picture of the person beating you with a shovel? This is about liability and having a record of the incident, not safety.",
      "score": 1,
      "created_utc": 1734703181.0,
      "replies": []
    },
    {
      "id": "m2zfp50",
      "author": "rawrasaurgr",
      "body": "get dunked on\n\nhttps://www.reddit.com/r/ImTheMainCharacter/comments/wtkh6y/tiktoker_dunks_on_and_humiliates_a_walmart_worker/",
      "score": 1,
      "created_utc": 1734704058.0,
      "replies": []
    },
    {
      "id": "m2zgi1z",
      "author": "Own-Opinion-2494",
      "body": "“Keep them safe”.  Seems legit",
      "score": 1,
      "created_utc": 1734704376.0,
      "replies": []
    },
    {
      "id": "m2zhby9",
      "author": "kelleehh",
      "body": "My brother works in a pharmacy here in the uk and wears a body cam. The abuse he gets is unreal.",
      "score": 1,
      "created_utc": 1734704702.0,
      "replies": []
    },
    {
      "id": "m2zhtev",
      "author": "robexib",
      "body": "It ain't the guys and gals stocking shelves and running cash registers getting shot and stabbed.",
      "score": 1,
      "created_utc": 1734704890.0,
      "replies": [
        {
          "id": "m34fe0k",
          "author": "None",
          "body": "I have a dash cam when I drive, and wear a body cam when I bike.",
          "score": 1,
          "created_utc": 1734780404.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m2zo9k2",
      "author": "hertzdonut69",
      "body": "body cams don’t save you from wage-siphoning.",
      "score": 1,
      "created_utc": 1734707284.0,
      "replies": []
    },
    {
      "id": "m2zpibb",
      "author": "cosmos7",
      "body": "Nothing says safety like being able to review footage pulled from a corpse.",
      "score": 1,
      "created_utc": 1734707726.0,
      "replies": []
    },
    {
      "id": "m2zqjsn",
      "author": "milelongpipe",
      "body": "It just might make the self check out monitors do more than look at their phones. This could be positive.",
      "score": 1,
      "created_utc": 1734708093.0,
      "replies": []
    },
    {
      "id": "m2zqq3w",
      "author": "waterloograd",
      "body": "r/walmartbodycams",
      "score": 1,
      "created_utc": 1734708155.0,
      "replies": []
    },
    {
      "id": "m2zrnel",
      "author": "Rough_Championship_3",
      "body": "It shouldn’t have to be like this. What is this world coming to…",
      "score": 1,
      "created_utc": 1734708476.0,
      "replies": []
    },
    {
      "id": "m2zsriz",
      "author": "mrflavainyaear",
      "body": "All this is gonna do is stop me from buying certain things. If something’s locked up I’m just going to target across the street, & if it’s something I only Walmart has & I really need it I’ll just do their curbside thing/order online.I don’t wanna interact with them at all at this point, just in and out. \n\nAlso I’m not sure why people still use Walmart to change their oil, that who process takes hours & it’s just not worth it",
      "score": 1,
      "created_utc": 1734708866.0,
      "replies": []
    },
    {
      "id": "m2zsw2v",
      "author": "Capybara_Cheese",
      "body": "Isn't this what Amazon already does? That way you can't take a break or glance at your phone because your boss could be watching? I guess it's becoming a trend to create a more \"efficient\" workforce this way",
      "score": 1,
      "created_utc": 1734708910.0,
      "replies": []
    },
    {
      "id": "m2ztomd",
      "author": "Capybara_Cheese",
      "body": "Amazon already does this. The real reason is to create a more efficient workforce through surveillance. There should be laws against it but I think we all know who the law really protects.",
      "score": 1,
      "created_utc": 1734709185.0,
      "replies": []
    },
    {
      "id": "m2zv52a",
      "author": "podcasthellp",
      "body": "Everything but treat them like humans",
      "score": 1,
      "created_utc": 1734709686.0,
      "replies": []
    },
    {
      "id": "m2zysj3",
      "author": "StudyVisible275",
      "body": "Nah. Not to keep safe. Who’s going to look at all the video?  You’d need a huge team to do that.",
      "score": 1,
      "created_utc": 1734710918.0,
      "replies": []
    },
    {
      "id": "m2zza0h",
      "author": "bogusbuttakis",
      "body": "Right! Employees will not be safer. If anything it will get people fired for not following company policies.",
      "score": 1,
      "created_utc": 1734711082.0,
      "replies": []
    },
    {
      "id": "m3026h1",
      "author": "CellistOk3894",
      "body": "They will literally do everything but pay their employees a livable wage. Anyone that can’t see this as the canary in the coal mine that we are deep in the throes of late stage capitalism are either willfully ignorant or fucking dumb as hell.  ",
      "score": 1,
      "created_utc": 1734712066.0,
      "replies": []
    },
    {
      "id": "m306x19",
      "author": "wjbc",
      "body": "What did the union say about that… oh, right, no union. Walmart has a finely tuned anti-union propaganda machine. \n\nThey tell employees that unions are money-grubbing outfits caring little about workers’ welfare. And they strongly imply that they will find a way to punish anyone who tries to unionize.",
      "score": 1,
      "created_utc": 1734713635.0,
      "replies": []
    },
    {
      "id": "m30crzk",
      "author": "Ok-Jellyfish-5704",
      "body": "I’d love a law where surveillance like this on low level employees had to also apply to the shit middle management making these decisions",
      "score": 1,
      "created_utc": 1734715578.0,
      "replies": []
    },
    {
      "id": "m30fdmo",
      "author": "ernster96",
      "body": "Body camera projects some sort of shield to protect them from the customers?",
      "score": 1,
      "created_utc": 1734716435.0,
      "replies": []
    },
    {
      "id": "m30h1pg",
      "author": "feltsandwich",
      "body": "\"Keep them safe.\"",
      "score": 1,
      "created_utc": 1734716981.0,
      "replies": []
    },
    {
      "id": "m30lx0r",
      "author": "HabANahDa",
      "body": "Riiiight. It’s for safety. Sure the company isn’t spying on workers to make sure they aren’t goofing around.",
      "score": 1,
      "created_utc": 1734718592.0,
      "replies": []
    },
    {
      "id": "m30momf",
      "author": "To-To_Man",
      "body": "They will use it to teach AI how to stock, use the register, and other stuff",
      "score": 1,
      "created_utc": 1734718849.0,
      "replies": []
    },
    {
      "id": "m30oaff",
      "author": "Jugzrevenge",
      "body": "But my local PD and Sheriffs office can’t get them??????? They got those tanks tho!",
      "score": 1,
      "created_utc": 1734719379.0,
      "replies": []
    },
    {
      "id": "m30p9nm",
      "author": "ChelseaG12",
      "body": "To keep Walmart safe really.",
      "score": 1,
      "created_utc": 1734719705.0,
      "replies": []
    },
    {
      "id": "m3132ht",
      "author": "JH_Rockwell",
      "body": "Y'know what would REALLY keep them safe?",
      "score": 1,
      "created_utc": 1734724347.0,
      "replies": []
    },
    {
      "id": "m313dka",
      "author": "tp675",
      "body": "This is more about monitoring productivity under the guise of safety",
      "score": 1,
      "created_utc": 1734724451.0,
      "replies": []
    },
    {
      "id": "m31bvma",
      "author": "distelfink33",
      "body": "This is America",
      "score": 1,
      "created_utc": 1734727360.0,
      "replies": []
    },
    {
      "id": "m31c5qq",
      "author": "Master_Tape",
      "body": "Won't somebody think of the children!?",
      "score": 1,
      "created_utc": 1734727456.0,
      "replies": []
    },
    {
      "id": "m31chzb",
      "author": "Garbolove333",
      "body": "BOYCOTT WALMART",
      "score": 1,
      "created_utc": 1734727575.0,
      "replies": []
    },
    {
      "id": "m33sym3",
      "author": "Consistent_Heat_9201",
      "body": "Excellent idea.",
      "score": 1,
      "created_utc": 1734765603.0,
      "replies": []
    },
    {
      "id": "m340aq2",
      "author": "Herban_Myth",
      "body": "Dystopian?",
      "score": 1,
      "created_utc": 1734770378.0,
      "replies": []
    },
    {
      "id": "m35nvuf",
      "author": "ScientistArtistic917",
      "body": "It's been like that in the UK for a long time",
      "score": 1,
      "created_utc": 1734799624.0,
      "replies": []
    },
    {
      "id": "m389xxw",
      "author": "iveseensomethings82",
      "body": "r/nursing",
      "score": 1,
      "created_utc": 1734834870.0,
      "replies": []
    },
    {
      "id": "m38cfcq",
      "author": "SmoothFred",
      "body": "“Safety”",
      "score": 1,
      "created_utc": 1734835964.0,
      "replies": []
    },
    {
      "id": "m38dmm6",
      "author": "None",
      "body": "I would do it",
      "score": 1,
      "created_utc": 1734836512.0,
      "replies": []
    },
    {
      "id": "m38wmy0",
      "author": "Clint1027",
      "body": "Everyone needs to start leaving big retailers. Costco included.",
      "score": 1,
      "created_utc": 1734845926.0,
      "replies": []
    },
    {
      "id": "m3f17vo",
      "author": "Fourthtimecharm",
      "body": "I wear my meta ray bans for the same reason",
      "score": 1,
      "created_utc": 1734948198.0,
      "replies": []
    },
    {
      "id": "m3ffi86",
      "author": "TraitaPotata",
      "body": "Walmart Employees Now Wearing Body Cameras To Further Track And Penalize Workers That Don't Work Hard Enough.",
      "score": 1,
      "created_utc": 1734957148.0,
      "replies": []
    },
    {
      "id": "m3fhehx",
      "author": "oxfordcollar",
      "body": "Hey America, stop treating the symptoms. Y'all are playing whack a mole when you could just pull the plug on the machine and save yourself the trouble",
      "score": 1,
      "created_utc": 1734958132.0,
      "replies": []
    },
    {
      "id": "m3rctjb",
      "author": "mack180",
      "body": "For how long retail has been a thing why don't managers or ceos introduce stricter policy against customers who harass, threaten, assault or be violent against employees.\n\nOr the government needs to introduce stricter laws or punishment against customers who cause destruction to their lives.\n\nMore cameras is more beneficial for higher ups, yeah it'll save some employees for disgruntled customers but employees will be surveilled 24/7 and more customers aren't gonna feel at ease for this.\n\nThere's enough cameras already in the ceiling, checkout lane, before entering the store and exiting the store.\n\nThis just seems like every laziness on their just install more cameras and automate the process for us.\n\nWalmart can get away with this cause their have a massive customer base and gigantic profits.\n\nIf any place decides to do this that will be another factor of the demise of brick and mortar and pushing more people to do things online/virtual.",
      "score": 1,
      "created_utc": 1735148636.0,
      "replies": []
    },
    {
      "id": "m4lrpnn",
      "author": "nizhaabwii",
      "body": "sure... keeping walmart safe by keeping am eye on \"wasteful underpaid workers\"",
      "score": 1,
      "created_utc": 1735600946.0,
      "replies": []
    },
    {
      "id": "m51z2vf",
      "author": "snowyoda5150",
      "body": "I mean, give them guns just like the teachers won’t they keep everyone safe? /s",
      "score": 1,
      "created_utc": 1735845650.0,
      "replies": []
    },
    {
      "id": "m2ywixu",
      "author": "synthdrunk",
      "body": "These will be used as a cudgel against their employees and as valuable corpus to feed infernal ML.",
      "score": 1,
      "created_utc": 1734695175.0,
      "replies": []
    },
    {
      "id": "m2yzf6p",
      "author": "Mookeebrain",
      "body": "Spying on employees.",
      "score": 1,
      "created_utc": 1734696788.0,
      "replies": []
    },
    {
      "id": "m2zmduk",
      "author": "Brilliant_Chance_874",
      "body": "A good reason for customers not to enter that store",
      "score": 1,
      "created_utc": 1734706604.0,
      "replies": []
    },
    {
      "id": "m31dgwm",
      "author": "This_guy_works",
      "body": "Safe from what?  Why aren't they just mounting cameras by the entrance like normal places?",
      "score": 1,
      "created_utc": 1734727903.0,
      "replies": [
        {
          "id": "m33rjnt",
          "author": "Adeno",
          "body": "At my Walmart, there are a lot of cameras attached to the ceiling, above the cash registers, the self-checkouts, the entrances/exits. Problem is, there are very brazen criminals who don't care. I personally witnessed a bunch of criminals just rolling out their full carts without paying and the staff and even security guards couldn't do anything. \n\nI doubt body cams will be a deterrent to these criminals though. They don't even bother wearing hoodies anymore to conceal their face. The only thing that would scare criminals from attempting theft are actual consequences to shoplifting. \n\nRecently, there's been good change though. In California, criminals will now be arrested even if they only stole less than $950. For a few years, stealing stuff was just a misdemeanor as long as it's less than $950 and so criminals didn't care because there's really no real consequence for their actions. Now it's different, hopefully this will change things.",
          "score": 3,
          "created_utc": 1734764719.0,
          "replies": []
        },
        {
          "id": "m37kgcr",
          "author": "aol1044",
          "body": "I’m just gonna be real with you and anyone else who has a similar question: The places where this is going to be implemented will more than likely be areas that are lower income and/or high crime/drug trafficking areas. Also, areas with high levels of customer complaints/incidents/Karens.\n\nTL;DR: Some people don’t know how to treat customer service workers, and it got SOOO much worse over the pandemic, so we now have this shit.",
          "score": 2,
          "created_utc": 1734824330.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m31ogp8",
      "author": "KickinGa55",
      "body": "I'm going to get a job at WalMart and just spill shit all the time. Whoops, there goes another shift cleaning my spill.",
      "score": 1,
      "created_utc": 1734731693.0,
      "replies": []
    },
    {
      "id": "m32jyut",
      "author": "None",
      "body": "Has absolutely 0 to do with keeping anyone safe lmao. These corporations would install spyware on your phone and put cameras in your house if they could. This is just an excuse to monitor employees even more. As if the arent already over worked for their crummy wages.",
      "score": 1,
      "created_utc": 1734743944.0,
      "replies": []
    },
    {
      "id": "m33ik17",
      "author": "None",
      "body": "Maybe lower prices and people wouldn’t steal",
      "score": 1,
      "created_utc": 1734759481.0,
      "replies": []
    },
    {
      "id": "m2zia8y",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1734705074.0,
      "replies": [
        {
          "id": "m30x4be",
          "author": "None",
          "body": "[removed]",
          "score": 2,
          "created_utc": 1734722329.0,
          "replies": [
            {
              "id": "m317ide",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1734725855.0,
              "replies": [
                {
                  "id": "m31aqbh",
                  "author": "None",
                  "body": "[removed]",
                  "score": 2,
                  "created_utc": 1734726968.0,
                  "replies": [
                    {
                      "id": "m31d7u4",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1734727818.0,
                      "replies": [
                        {
                          "id": "m31gwtb",
                          "author": "None",
                          "body": "[removed]",
                          "score": 2,
                          "created_utc": 1734729079.0,
                          "replies": [
                            {
                              "id": "m31yg80",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1734735360.0,
                              "replies": [
                                {
                                  "id": "m330tvk",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 2,
                                  "created_utc": 1734751016.0,
                                  "replies": [
                                    {
                                      "id": "m331etb",
                                      "author": "Ps11889",
                                      "body": "Isn’t that what I said?",
                                      "score": 1,
                                      "created_utc": 1734751265.0,
                                      "replies": [
                                        {
                                          "id": "m334552",
                                          "author": "None",
                                          "body": "[removed]",
                                          "score": 1,
                                          "created_utc": 1734752447.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m32masb",
      "author": "TheOneAndOnlyJAC",
      "body": "Uh huh “Safety”. Lemme guess, they just want a better way to keep surveillance on their workers?",
      "score": 0,
      "created_utc": 1734744894.0,
      "replies": []
    },
    {
      "id": "m2yxszy",
      "author": "getfive",
      "body": "False",
      "score": 0,
      "created_utc": 1734695907.0,
      "replies": []
    },
    {
      "id": "m2yztf8",
      "author": "InAllThingsBalance",
      "body": "I wonder if we will start seeing an extra “security” fee on our receipts?  Or maybe just a simple price increase to cover the cost of them monitoring their own employees?",
      "score": 0,
      "created_utc": 1734696996.0,
      "replies": []
    },
    {
      "id": "m2zfi08",
      "author": "devingr33n",
      "body": "They will probably face stiffer penalties for turning them off than cops do",
      "score": 0,
      "created_utc": 1734703980.0,
      "replies": []
    },
    {
      "id": "m2zkrca",
      "author": "thereminDreams",
      "body": "Wearing a body camera doesn't keep you any safer than a restraining order. Someone can still come up to you and kill you.",
      "score": 0,
      "created_utc": 1734706011.0,
      "replies": []
    },
    {
      "id": "m32ezp6",
      "author": "BeastModeEnabled",
      "body": "This is not to protect the associate.  It’s to protect the company in the event of violence and/or robbery.  Walmart executives can feel warm and fuzzy when they can say we did this to protect them and video shows the company was not the shooter. \n\nTruth is analysts have told Walmart for years that they were too “fat”.  Too many employees and benefits.  It was not sustainable.  Walmart began “initiatives” every few months which always resulted in net reduction of store hours.  This was always presented to store managers with a positive spin of course.  We’re adding ie. 100 hours per week to e-commerce.  Followed by the mgmt only talking points for where all the hours were being cut from.  Everyone’s getting a raise meanwhile we’re cutting 25% of hourly supervisor positions. Here’s a robot floor scrubber that someone has to follow it around and fix it when it gets stuck.  Also you’re losing 3 maintenance associates a night.   Hey you can wear jeans now!   Mgmt must reapply for their jobs.  Rinse and repeat.  \n\nWalmart and tractor supply know where you are at all times.  Employees and customers.  Tsc says their new camera system will detect anyone over 4ft tall (allegedly to not record children) and track them.   They showed sm’s how it works.  Theatro’s for communication.  Hmmm…it’s literally a tracking device that can also be used for communication.\n\nI could go on…",
      "score": 0,
      "created_utc": 1734741910.0,
      "replies": [
        {
          "id": "m33r5aj",
          "author": "Adeno",
          "body": "Vertically challenged criminals start licking their lips...",
          "score": 2,
          "created_utc": 1734764470.0,
          "replies": []
        }
      ]
    }
  ]
}