{
  "post": {
    "title": "Leica Raises Prices in Canada Because of US Tariffs",
    "author": "diacewrb",
    "id": "1kc6fjo",
    "score": 1263,
    "created_utc": 1746099033.0,
    "selftext": "",
    "num_comments": 133,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1kc6fjo/leica_raises_prices_in_canada_because_of_us/"
  },
  "comments": [
    {
      "id": "mq0252h",
      "author": "diacewrb",
      "body": ">“They said they wanted price parity between Canada and the US which makes no sense. If an American purchased a Leica product anywhere in the world and brought it back to the US they would still be subject to the tariff. If they purchased in Canada, they would effectively end up paying the tariff twice.”\n\nAs bad as sony.",
      "score": 780,
      "created_utc": 1746099083.0,
      "replies": [
        {
          "id": "mq02qn7",
          "author": "4-3-4",
          "body": "(Illegal) Parallel imports risks.",
          "score": 100,
          "created_utc": 1746099349.0,
          "replies": [
            {
              "id": "mq0edww",
              "author": "etzel1200",
              "body": "But who cares? If it’s a genuine product being bought, won’t their profit be the same?",
              "score": 30,
              "created_utc": 1746104057.0,
              "replies": [
                {
                  "id": "mq7xxw0",
                  "author": "sioux612",
                  "body": "Don't worry, there will be a lobbyists for some monopoly camera dealer.\n\n\nJust like it was the US auto dealers who caused the 25 year import ban",
                  "score": 2,
                  "created_utc": 1746202794.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq0aq66",
          "author": "wsippel",
          "body": "It's a bit more complicated. Leica USA handles imports and distribution in North America. The way they explain it, they have to pay US import tariffs on cameras that end up in Canada, so what are they supposed to do? The obvious solution is to ship from the EU to Canada directly, but that has to be set up, and nobody knows how long the tariffs will stick around. Once again, the main issue is the uncertainty.",
          "score": 126,
          "created_utc": 1746102660.0,
          "replies": [
            {
              "id": "mq0eokw",
              "author": "etzel1200",
              "body": "They should get any tariffs back when they export the cameras again to Canada. Or they can go from a FTZ in the US directly to Canada. \n\nAre they just lazy, unaware, lying? Am I missing something?",
              "score": 63,
              "created_utc": 1746104165.0,
              "replies": [
                {
                  "id": "mq0s4lp",
                  "author": "peacefulhectarez",
                  "body": "Nope, you're not missing anything. They (or their customs broker and freight people) are lazy.\n\nThe duty rate on a lot of lab equipment was zero or nearly zero, so it was cheaper and easier just to import a bunch of stuff to the U.S. and then re-export it as needed. That gives you the freedom to sell it in the U.S. if you want.\n\nWith higher duty rates, you'd want to put it in an FTZ pending re-export, ship directly to Canada, or (as a last resort) file for drawback for re-exports.\n\nThis is Leica saying they don't give enough of a fuck about Canadian customers to set up a Canadian distrbution channel so they're going to keep supplying duty-paid stuff out of the U.S.\n\nSmart buyers in Canada will find suppliers in Europe willing to ship directly, which will piss Leica off but hopefully they're also too lazy to play games like cancelling warranties on grey-market equipment.",
                  "score": 82,
                  "created_utc": 1746108659.0,
                  "replies": [
                    {
                      "id": "mq14byk",
                      "author": "adjudicator",
                      "body": "Canceling warranties on grey market stuff odd illegal in much of Canada anyway, which they should care about if they want to continue doing business here.",
                      "score": 15,
                      "created_utc": 1746112307.0,
                      "replies": [
                        {
                          "id": "mq57jfi",
                          "author": "peacefulhectarez",
                          "body": "It can be worked around where the Canadian distributor is the “manufacturer” and won’t warranty anything they didn’t sell. Car and motorcycle manufacturers did a lot of it 15 years ago during dollar parity when no one would work on American-spec vehicles. I had to threaten to complain to Germany when BMW wouldn’t even sell me parts for my bike… and they only backed off because I l lived in California and was on a road trip.",
                          "score": 3,
                          "created_utc": 1746160250.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mq2gpzl",
                      "author": "JSteigs",
                      "body": "Further more, cameras probably aren’t a big part of their business.  Their survey gear is spendy.  A single gps setup can run $40k.  That’s a lot of cameras.  Large construction companies are moving to having one or two gps units per machine on big jobs.  Sounds like they make medical stuff too.  Seems like they might just lose market share in Canada to companies with a direct distributor setup.",
                      "score": 7,
                      "created_utc": 1746126446.0,
                      "replies": [
                        {
                          "id": "mq49op9",
                          "author": "creimer52",
                          "body": "Their LiDar scanners such as the RTC360 run at $100k+",
                          "score": 3,
                          "created_utc": 1746147140.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mq1sren",
                      "author": "Pikeman212a6c",
                      "body": "Shifting to a FTZ isn’t nothing. But not being willing to do the paperwork to file for drawback is just being too lazy to give a fuck about Canada.",
                      "score": 10,
                      "created_utc": 1746119485.0,
                      "replies": []
                    },
                    {
                      "id": "mq5gppo",
                      "author": "quotidianwoe",
                      "body": "Or, American authorized distributors whined to them how smarter customers would just go to Canada and buy one.",
                      "score": 0,
                      "created_utc": 1746164928.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mq0n60i",
                  "author": "0xF00DBABE",
                  "body": "That's not how it works AFAIK. Re-export doesn't mean you get tariffs back.",
                  "score": -5,
                  "created_utc": 1746107079.0,
                  "replies": [
                    {
                      "id": "mq0nk85",
                      "author": "etzel1200",
                      "body": "https://en.m.wikipedia.org/wiki/Duty_drawback",
                      "score": 15,
                      "created_utc": 1746107208.0,
                      "replies": []
                    },
                    {
                      "id": "mq0sv1e",
                      "author": "r0th3rj",
                      "body": "Not automatically. But as long as the product is not substantially transformed prior to export, you can certainly engage the duty drawback process to recoup that spend.",
                      "score": 16,
                      "created_utc": 1746108883.0,
                      "replies": []
                    },
                    {
                      "id": "mq1t7f5",
                      "author": "Pikeman212a6c",
                      "body": "CBP Officer here. You can get the money back. You need to do a bit of paperwork and keep track of everything. But this is a large company assumedly represented by a brokerage or 3PL. It’s really not that hard.",
                      "score": 9,
                      "created_utc": 1746119614.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mq354g1",
                  "author": "Shiva-",
                  "body": "FTZ aren't exactly free and I am certain the prices/demand for them have been going up. To the point it might not even available.",
                  "score": -1,
                  "created_utc": 1746133512.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq24qa3",
              "author": "a_cute_epic_axis",
              "body": ">  so what are they supposed to do? \n\nNot pay the tariff or get a refund, which is the legal, correct, and long standing way for such goods.",
              "score": 2,
              "created_utc": 1746122901.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq2avc8",
          "author": "bamboob",
          "body": "This is one of the things that I was expecting. Once companies realize that they have a greenlight to just start upping prices, they will do it, and I suspect those prices are never going to come down to the level that they were, even if the tariffs completely go away.",
          "score": 5,
          "created_utc": 1746124721.0,
          "replies": [
            {
              "id": "mq5tg8s",
              "author": "jeff_the_weatherman",
              "body": "Right. If people are willing to pay the higher price for your item, why would you ever drop it? Just becomes an excuse to squeeze out some more profit.",
              "score": 1,
              "created_utc": 1746172530.0,
              "replies": []
            },
            {
              "id": "mqbd1n8",
              "author": "Nope_______",
              "body": "Why didn't they raise their prices six months ago, then? They don't need an excuse. You're saying they didn't want to make more money back then?",
              "score": 1,
              "created_utc": 1746243028.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq0b6gt",
          "author": "aztec0000",
          "body": "If they want price parity, why not canadian at par? Worst is you buy something in canada and they charge you usd.",
          "score": 5,
          "created_utc": 1746102839.0,
          "replies": []
        },
        {
          "id": "mq05ike",
          "author": "justyannicc",
          "body": "Somebody asked that exact question for the flipper zero and I explained why in Europe the prices shouldn't increase this is pure greed and got down voted to all hell.\n\nHere is the link:\nhttps://www.reddit.com/r/flipperzero/s/aVr59ESna0",
          "score": 14,
          "created_utc": 1746100545.0,
          "replies": [
            {
              "id": "mq0906e",
              "author": "SniperTeamTango",
              "body": "The actual point you made had nothing to do with you getting downvoted into the ground",
              "score": 27,
              "created_utc": 1746101974.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq09ev3",
          "author": "ElephantElmer",
          "body": "What do you mean? Tourists bringing back stuff they buy abroad for personal use get taxed on it?",
          "score": 3,
          "created_utc": 1746102136.0,
          "replies": [
            {
              "id": "mq0c35n",
              "author": "orangejuicerooster",
              "body": "Yes. Customs asks if you have anything to declare for exactly this purpose. They determine what, if any, import taxes/fees are to be collected, and collect them before you enter the country.",
              "score": 16,
              "created_utc": 1746103192.0,
              "replies": []
            },
            {
              "id": "mq0fywz",
              "author": "b1gwheel",
              "body": "Yes, there are exemptions and depending on how long abroad you can bring back higher values; but everything coming into the country is subject to examination, duties, and taxes (sales, excise, tariffs, etc).",
              "score": 6,
              "created_utc": 1746104628.0,
              "replies": []
            },
            {
              "id": "mq2byi3",
              "author": "j4nkyst4nky",
              "body": "It's important to note you are allowed to bring back up to $800 in value without paying taxes on it.",
              "score": 3,
              "created_utc": 1746125039.0,
              "replies": []
            },
            {
              "id": "mq3d38n",
              "author": "No-Setting764",
              "body": "In Canada, they make you declare what you've purchased.  You are allowed to bring 2 cartons of cigarettes, any more you get charged the tariff. It's harder to prove with electronics and stuff, they'd have to go through your bags and be able to prove you bought it abroad. \n\nNext time you come home from another country, pay attention to the forms you sign at customs.",
              "score": 2,
              "created_utc": 1746135987.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq0oaj6",
          "author": "Silk_the_Absent1",
          "body": "I guess its part of the entry point",
          "score": 1,
          "created_utc": 1746107447.0,
          "replies": []
        },
        {
          "id": "mq2pyx5",
          "author": "Infarad",
          "body": "Mind elaborating on the Sony thing?  I’m thinking about buying a pretty pricey camera from Sony.",
          "score": 1,
          "created_utc": 1746129132.0,
          "replies": [
            {
              "id": "mq3x9gq",
              "author": "jimmyfknchoo",
              "body": "Maybe this?\nhttps://www.reddit.com/r/nintendo/s/LlYjcFFwKT",
              "score": 1,
              "created_utc": 1746142767.0,
              "replies": [
                {
                  "id": "mq46hdc",
                  "author": "Infarad",
                  "body": "Ahhh. I see. Greedy corpo being greedy.",
                  "score": 1,
                  "created_utc": 1746145996.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq08g5p",
      "author": "Edward_TH",
      "body": "The delusion of all these non US corporations suits that think they're gonna get the red carpet from now on instead of the projectile diarrhea they got till now (and that they've been warned they're gonna get again in the future) for some reason is really telling how detached they are from the world most people live in.\n\n\nTrying to save your largest market by announcing that your strategy is to fuck over all the other costumers or potential ones, especially in the light of said market being now openly manipulated by your competitors and getting poorer is really being blindly delusional.",
      "score": 120,
      "created_utc": 1746101750.0,
      "replies": [
        {
          "id": "mq100kt",
          "author": "IronVader501",
          "body": "Thats not why they are doing it.\n\nAs Leica explains, their entire distribution in North America runs over the US.\n\nEven if a Product is intended to be sold in Canada or Mexico at the end of the day, its still being shipped to their US-Subsidiary first and then distributed from there. So they have to pay the Tarriffs on them even if it isnt intended to be sold in the US.\n\nThe better solution here would be to set up seperate distribution-channels for Canada, but Leica evidently so far doesnt think thats worth it.",
          "score": 34,
          "created_utc": 1746111030.0,
          "replies": [
            {
              "id": "mq136sd",
              "author": "Edward_TH",
              "body": "And that's my point. Recent events have clearly demonstrated that following this pathway as a foreign company isn't a smart idea: at best, whatever you save by not investing into a safer distribution chain gets wiped by tariffs and poorer sales; at worst, political instability and outright rigged rules made by your competitors straight up destroy you because you lose other markets just by having your supply chain crippled.\n\n\nIt's just delusional of them to think the US is still a fair market for foreign companies. It was manipulated before, now it's straight up openly rigged against fair competition.",
              "score": 23,
              "created_utc": 1746111970.0,
              "replies": []
            },
            {
              "id": "mq1mfgu",
              "author": "bianary",
              "body": "They can request a refund of their tariffs if they're immediately exporting again - https://en.m.wikipedia.org/wiki/Duty_drawback",
              "score": 7,
              "created_utc": 1746117654.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq03x2k",
      "author": "sonicyouth99",
      "body": "Simple. Stop buying Leica!",
      "score": 263,
      "created_utc": 1746099865.0,
      "replies": [
        {
          "id": "mq06pr1",
          "author": "Skippypal",
          "body": "Serious working photographers, not just rich people cosplaying one, haven’t been buying Leica for a while.",
          "score": 103,
          "created_utc": 1746101046.0,
          "replies": [
            {
              "id": "mq0acz3",
              "author": "Helmdacil",
              "body": "Leica makes the most user friendly lab microscopes. Nikon, Zeiss, Olympus, Echo (vwr in house brand)... All are great, but Leica is the easiest. I can get undergrads to take publication quality images on a Leica with almost no training. The Nikon is not like that at all.\n\n\nThis is a poor move by Leica but they are the best game in town, in general. Imo. For biology scopes.",
              "score": 50,
              "created_utc": 1746102516.0,
              "replies": [
                {
                  "id": "mq0n4qg",
                  "author": "S_A_N_D_",
                  "body": "It's funny because I found Nikon to be the most user friendly, at least for high end confocal and super resolution systems (actually abberior was leagues more user friendly but they're less versatile unless all you want is peak resolution at which point they're better). \n\nThe downfall with Nikon IMO is their reliance on ai processing which is a black box and I feel like it just shows you what you want to see. The Stellaris systems had much better super res, nearly on the level of the abberior, and adding FLIM to STED was just black magic.\n\nWith all that said, we don't know if the research / commercial side uses the same import chain as the consumer camera division. They could easily be separate divisions using different supply chains given the lower volume and higher dollar value.",
                  "score": 2,
                  "created_utc": 1746107067.0,
                  "replies": []
                },
                {
                  "id": "mq0ckgg",
                  "author": "GangHou",
                  "body": "Their cellphone cameras slap too. I'm an absolute idiot when it comes to photography, understand less than nothing about it, but have been taking great picture with my Xiaomi 14 since I got it in April of last year.",
                  "score": -7,
                  "created_utc": 1746103374.0,
                  "replies": [
                    {
                      "id": "mq0gj5n",
                      "author": "baggos12345",
                      "body": "Literally nothing in a xiaomi 14 camera is associated with Leica. It's a Sony sensor (like almost all phones) with xiaomi software.. The only thing Leica does is tweak the processing algorithm a bit and most importantly slap their name on the back of the phone for advertisement / recognition",
                      "score": 20,
                      "created_utc": 1746104828.0,
                      "replies": [
                        {
                          "id": "mq0tn3v",
                          "author": "IntoxicatingVapors",
                          "body": "Who is making the glass?",
                          "score": 2,
                          "created_utc": 1746109120.0,
                          "replies": [
                            {
                              "id": "mq1z2ga",
                              "author": "darkapao",
                              "body": "Probably Panasonic. Since they have lots of Leica dupes. This is just speculation from me since they have Leica dupes.",
                              "score": 1,
                              "created_utc": 1746121276.0,
                              "replies": [
                                {
                                  "id": "mq2070c",
                                  "author": "IntoxicatingVapors",
                                  "body": "So you're not going to admit that Leica actually makes the lenses, you're just going to double down on talking out of your ass?",
                                  "score": 5,
                                  "created_utc": 1746121596.0,
                                  "replies": [
                                    {
                                      "id": "mq20ua1",
                                      "author": "darkapao",
                                      "body": "I'm just saying i owned a Panasonic LX100 which is the same as a Leica D-Lux 7. Soooo I'm basing it on that. \n\nIf you have a source that Leica makes the lenses then i would appreciate that.",
                                      "score": 2,
                                      "created_utc": 1746121780.0,
                                      "replies": [
                                        {
                                          "id": "mq217o4",
                                          "author": "IntoxicatingVapors",
                                          "body": "I have a DMC-LX5, Leica made the lenses for both, it's not a \"dupe\" or a conspiracy. Leica has a partnership to manufacture lenses for Panasonic, in return they sell a badge engineered variant of a Panasonic camera.",
                                          "score": 3,
                                          "created_utc": 1746121886.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mq5cd85",
                          "author": "GangHou",
                          "body": "Again, I know fuck all about photography, and by extension the details of who makes what.\n\n\nI didn't even know what Leica meant before I got this phone. I thought it was some form of tech. All I know is the camera says Leica and that it slaps.",
                          "score": 1,
                          "created_utc": 1746162608.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mq0crav",
              "author": "StaysAwakeAllWeek",
              "body": "Serious working photographers actually in the market for the experience Leica sell are buying Fujifilm and Hasselblad. You actually get something extra that the mainstream brands can't provide with those two.",
              "score": 10,
              "created_utc": 1746103448.0,
              "replies": []
            },
            {
              "id": "mq6b410",
              "author": "Capt-ChurchHouse",
              "body": "I’ve never worked with a Leica camera, but I’ve worked with a ton of their survey gear, they have some niche markets they have a good hold on.",
              "score": 2,
              "created_utc": 1746183107.0,
              "replies": []
            },
            {
              "id": "mqpz1aq",
              "author": "parisidiot",
              "body": "this isn't true at all, there are plenty of photojournalists who use Leica.",
              "score": 0,
              "created_utc": 1746458720.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mq07fkx",
          "author": "JadedFault702",
          "body": "They’re a major microscope producer, the majority of scientific images that get published were captured with some sort of Leica brand imaging tool. The admin will absolutely not give a shit about this because it will mostly hurt academic labs.",
          "score": 21,
          "created_utc": 1746101339.0,
          "replies": [
            {
              "id": "mq08pfa",
              "author": "vaska00762",
              "body": "Not just microscopes for laboratories, but also surgical microscopes, for which their biggest competitor is fellow German optics company, Karl Zeiss, also famous for camera lenses.\n\nThe other alternative is Olympus, but they're much more into laparoscopic and endoscopic surgical equipment. Olympus used to be in the camera business until they sold that business to the same company that took over Vaio laptops, as Olympus made way more money out of medical optics.\n\nThey're also one of the biggest suppliers of Laser Levels used for land surveying, a required vital aspect of infrastructure maintenance and construction planning - Leica is the odd one out in terms of them being the only optics company in the area, but they're dominant.",
              "score": 10,
              "created_utc": 1746101854.0,
              "replies": [
                {
                  "id": "mq0to2i",
                  "author": "JadedFault702",
                  "body": "Well since we’re all just going to eat clean food (not FDA tested) and exercise (by working multiple jobs), we won’t ever need medical care much less surgical microscopes! Thanks RFK Jr! \n\nBut totally spot on and thanks for the further information, I’d wondered what happened to Olympus.",
                  "score": 2,
                  "created_utc": 1746109128.0,
                  "replies": [
                    {
                      "id": "mq0x5ie",
                      "author": "vaska00762",
                      "body": "If you ever see pictures of operating theatres in hospitals, there's a very strong chance you'll see loads of Olympus branded equipment.\n\nThe medical imaging industry is big money, and the other big player with a photography heritage is Fujifilm, who are quite big on making digital X-Ray devices which are basically just really large X-Ray image sensors. Fujifilm also makes X-Ray film still, which is largely still in use in dental settings, as you can usually fit film inside someone's mouth, but not a digital image sensor.\n\nFujifilm is also rapidly expanding into the pharmaceutical market, though that's mostly from their background of photochemical industry, which has a niche, but isn't popular.\n\nEven Sony is big into the medical field. For a long time, Sony specifically made monitors which could be sterilised easily for operating rooms, as well as also making Blu Ray and Peter Solid State recording drives which could record 1080p and later 4k medical footage taken from a microscope, endoscope, laparoscope or other such equipment.\n\nAll the medical device stuff makes way, way more money than consumer products ever could.",
                      "score": 1,
                      "created_utc": 1746110179.0,
                      "replies": [
                        {
                          "id": "mqpzaga",
                          "author": "parisidiot",
                          "body": "> Fujifilm also makes X-Ray film still, which is largely still in use in dental settings, as you can usually fit film inside someone's mouth, but not a digital image sensor.\n\n? I haven't seen film used in dental settings since I was a kid like 20 - 30 years ago",
                          "score": 1,
                          "created_utc": 1746458796.0,
                          "replies": [
                            {
                              "id": "mqq0teh",
                              "author": "vaska00762",
                              "body": "It's still regularly in use at my local dental clinic. The film isn't very large, usually only about a couple of square centimetres wide, placed next to a molar that a dentist wants to look into, then the X-ray emitter is positioned appropriately and the exposure taken. \n\nThe film self-develops similar to Instax film, and can be placed onto a lightbox to see if there's a cavity.\n\nLarge, digital dental x-ray machines exist, but largely only see use in orthodontic settings, usually due to concerns around X-ray exposure.",
                              "score": 1,
                              "created_utc": 1746459247.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mq1rzhf",
                  "author": "Shadow647",
                  "body": "Coincidentally neither Zeiss nor Olympus are US-based, too",
                  "score": 1,
                  "created_utc": 1746119262.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mq0sxe7",
          "author": "UltraCynar",
          "body": "Or import directly from Europe and boycott the US/North America operations. Time to move to their Canadian operations to Canada.",
          "score": 6,
          "created_utc": 1746108903.0,
          "replies": []
        },
        {
          "id": "mq1l6le",
          "author": "Str0nglyW0rded",
          "body": "Used one once, loved it, but still can’t justify the cost. To have *less* and be told it’s **more**.\n\nLong live Fuji",
          "score": 1,
          "created_utc": 1746117289.0,
          "replies": []
        },
        {
          "id": "mq06sio",
          "author": "remiieddit",
          "body": "More simple , don't vote for trump",
          "score": -1,
          "created_utc": 1746101078.0,
          "replies": [
            {
              "id": "mq089eu",
              "author": "evmcdev",
              "body": "Canada didn't, unfortunately still being charged extra by greedy profiteers.",
              "score": 26,
              "created_utc": 1746101675.0,
              "replies": [
                {
                  "id": "mq9dvvb",
                  "author": "remiieddit",
                  "body": "Whole world does in one or other way unfortunately",
                  "score": 1,
                  "created_utc": 1746217857.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq08hzz",
              "author": "w1n5t0nM1k3y",
              "body": "People outside the US had no vote. Yet still have to pay higher prices.  Sounds like taxation without representation.",
              "score": 23,
              "created_utc": 1746101770.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq0984o",
      "author": "Rance_Mulliniks",
      "body": "That Canadian store should discontinue them. It's simple.",
      "score": 62,
      "created_utc": 1746102063.0,
      "replies": []
    },
    {
      "id": "mq03d1i",
      "author": "3dsplinter",
      "body": "So what happens if you order their products from Europe or Asia and get it shipped to Canada?",
      "score": 14,
      "created_utc": 1746099624.0,
      "replies": [
        {
          "id": "mq08rxs",
          "author": "w1n5t0nM1k3y",
          "body": "I have to do this all the time with cycling products anyway because they eiyher dont have a presence in Canada or they charge twice as much bim Canada for unknown reasons. This isnjust the way it has always been in the cycling industry in Canada.",
          "score": 11,
          "created_utc": 1746101882.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq05tc9",
      "author": "dustofdeath",
      "body": "Profiteering.",
      "score": 41,
      "created_utc": 1746100673.0,
      "replies": [
        {
          "id": "mq093o6",
          "author": "Pure_System9801",
          "body": "Id suggest this means and can spread the cost of tariffs over a wider net she therefore reduce the impact of tariffs in the US for their products resulting in higher revenue",
          "score": -15,
          "created_utc": 1746102013.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq0lc7v",
      "author": "hkvincentlee",
      "body": "wtf lol",
      "score": 11,
      "created_utc": 1746106475.0,
      "replies": []
    },
    {
      "id": "mq05ue3",
      "author": "ShinNL",
      "body": "I think something similar is happening to Keychron, but worse. I've been waiting for the M5 so I've been hawkeyeing the full release.\n\nWhat I saw was pretty interesting:\n\nUS store, priced stayed the same (69 dollars). Black was sold out, white wasn't initially. Now it is.\n\nDE store, price was 69 euro. Everything was sold out. Check out today, it's 85 euro.\n\nWhat. Are you kidding me?",
      "score": 17,
      "created_utc": 1746100685.0,
      "replies": []
    },
    {
      "id": "mq1k0mx",
      "author": "RiderLibertas",
      "body": "They figure if Americans will pay more so will Canadians.  Many companies will use this as an excuse to raise prices.  Once they go up the won't go back down.",
      "score": 9,
      "created_utc": 1746116942.0,
      "replies": [
        {
          "id": "mq7p9u3",
          "author": "god_peepee",
          "body": "The boycotts are just getting started 👉😎👉",
          "score": 1,
          "created_utc": 1746200338.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq06y0m",
      "author": "kingofwale",
      "body": "US tariff: Canadians will pay for it!!",
      "score": 14,
      "created_utc": 1746101140.0,
      "replies": []
    },
    {
      "id": "mq2u1bl",
      "author": "essaysmith",
      "body": "Seems relatively simple, don't buy their products until they change their policy.",
      "score": 6,
      "created_utc": 1746130306.0,
      "replies": []
    },
    {
      "id": "mqigb1v",
      "author": "Slacker_75",
      "body": "Tariffs have become the latest excuse for greed. Just like how companies used Covid for an excuse to raise prices and also profits. These “temporary” price increases never come back down. Pure Greed.",
      "score": 4,
      "created_utc": 1746352470.0,
      "replies": []
    },
    {
      "id": "mq0lbw6",
      "author": "NameCorrect",
      "body": "Enjoy the death of your company in North America.",
      "score": 11,
      "created_utc": 1746106473.0,
      "replies": []
    },
    {
      "id": "mq0w88h",
      "author": "Warlord68",
      "body": "Headline should be “Leica makes mistake and refuses to admit it!”",
      "score": 5,
      "created_utc": 1746109901.0,
      "replies": []
    },
    {
      "id": "mq2ur2d",
      "author": "None",
      "body": "I have started bringing stuff directly into Canada to avoid US tariffs when I can.",
      "score": 4,
      "created_utc": 1746130512.0,
      "replies": []
    },
    {
      "id": "mq2iawr",
      "author": "TulippeMTL",
      "body": "Aaaaaamerica blowwwwwws.",
      "score": 5,
      "created_utc": 1746126914.0,
      "replies": []
    },
    {
      "id": "mq27mpj",
      "author": "Aggravating-Loss3145",
      "body": "WTF Leica?",
      "score": 2,
      "created_utc": 1746123753.0,
      "replies": []
    },
    {
      "id": "mq0q6is",
      "author": "nhh",
      "body": "It's Leica. If you care about the price you are looking at the wrong company. ",
      "score": 4,
      "created_utc": 1746108048.0,
      "replies": []
    },
    {
      "id": "mq3b3zb",
      "author": "yulDD",
      "body": "How many can be sold in Canada in a year, it can’t that much. Those are high end cameras, no?",
      "score": 2,
      "created_utc": 1746135362.0,
      "replies": []
    },
    {
      "id": "mq4zlyh",
      "author": "acdameli",
      "body": "Sounds like someone needs to ship their stock into Canada to supply their North American market to make it make sense. And in the meantime I recommend Canada simply boycott.\n\nCanadians are not citizens of the United States and they should make it clear that they are not.",
      "score": 2,
      "created_utc": 1746156759.0,
      "replies": []
    },
    {
      "id": "mq2sfzu",
      "author": "astropolka",
      "body": "So raising prices from astronomical to even more astronomical. Makes sense.",
      "score": 1,
      "created_utc": 1746129845.0,
      "replies": []
    },
    {
      "id": "mq56huc",
      "author": "Nom_De_Plumber",
      "body": "I never thought I’d be saying fuck Leica but here we are.",
      "score": 1,
      "created_utc": 1746159764.0,
      "replies": []
    },
    {
      "id": "mq5ltyd",
      "author": "odebruku",
      "body": "If you can affront buy a Leica you wouldn’t blink an eye at the price increase.",
      "score": 1,
      "created_utc": 1746167864.0,
      "replies": [
        {
          "id": "mq5p2k6",
          "author": "aluminumnek",
          "body": "Just buy a Panasonic LUMIX as they make the digital Leica’s anyways. The only difference is the software and UI. My LUMIX can utilize Leica series M and R lens with an adapter",
          "score": 1,
          "created_utc": 1746169789.0,
          "replies": [
            {
              "id": "mq5qflr",
              "author": "odebruku",
              "body": "You really can’t compare.  VW Porsche and Audi same company so are you saying a VW Golf is the same as a 911 Turbo?",
              "score": 2,
              "created_utc": 1746170632.0,
              "replies": [
                {
                  "id": "mq5r5y8",
                  "author": "aluminumnek",
                  "body": "If they are both same under the hood like these cameras then yeah🤣",
                  "score": 1,
                  "created_utc": 1746171095.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq8b92n",
      "author": "Electrical_Height743",
      "body": "So basically now everyone is raising prices because of tariffs. Doesn't matter if they actually effect the specific product. Awesome. Capitalist oligarchs really want the giliotins to come back.",
      "score": 1,
      "created_utc": 1746206560.0,
      "replies": []
    },
    {
      "id": "mqbtk2o",
      "author": "bamboob",
      "body": "Nope",
      "score": 1,
      "created_utc": 1746251163.0,
      "replies": []
    },
    {
      "id": "mr7m92r",
      "author": "johnryan433",
      "body": "This is something people don’t usually understand, American is responsible for 30% of all global consumer spending. If the price of a product goes up 3x in America most companies will do exactly what Leica has done to maintain price parity. Otherwise there entire supply chain would collapse within the US as no one would buy in the US and just go on vacation to buy things in Canada or Mexico and bring it back in illegally undeclared. So if the tariffs remain most western brands will charge a similar amount everywhere at least for small items that can easily be brought back in that is.",
      "score": 1,
      "created_utc": 1746692210.0,
      "replies": []
    },
    {
      "id": "mq04k0l",
      "author": "Reesespeanuts",
      "body": "Who? ",
      "score": -3,
      "created_utc": 1746100136.0,
      "replies": [
        {
          "id": "mq05j1p",
          "author": "Spideryote",
          "body": "Google tells me they're a camera and optical lens company. Never heard of them myself",
          "score": 1,
          "created_utc": 1746100551.0,
          "replies": [
            {
              "id": "mq08vkj",
              "author": "madcatzplayer5",
              "body": "You two have obviously never seen Eurotrip (2004) before.",
              "score": 9,
              "created_utc": 1746101922.0,
              "replies": [
                {
                  "id": "mq2ng6b",
                  "author": "bonesnaps",
                  "body": "I recently watched it and I still never heard of Leica.\n\n\nHeard of many other photography brands but not them.",
                  "score": 1,
                  "created_utc": 1746128416.0,
                  "replies": []
                },
                {
                  "id": "mq09jys",
                  "author": "Spideryote",
                  "body": "I don't watch movies, sorry. Not stimulating enough",
                  "score": -16,
                  "created_utc": 1746102193.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq06pad",
              "author": "cpufreak101",
              "body": "Iirc they were the company that invented the first 35mm film camera, name still has prestige to this day as a result.",
              "score": 6,
              "created_utc": 1746101040.0,
              "replies": [
                {
                  "id": "mq092ic",
                  "author": "BartHarleyJarvis-",
                  "body": "They have a hand in semiconductor fab industry. Don't write them off so easily.",
                  "score": 11,
                  "created_utc": 1746102000.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq18i8z",
      "author": "Front-Cantaloupe6080",
      "body": "I've said it before and I'll say it again, there has NEVER been a better time for both Americans AND Canadians to support Canadian companies! Shop canadian brands at canadian retailers if you can.\n\n* **Baby**\n* \\--Quark Baby (baby bottles and feeding) [https://quarkbaby.com/](https://quarkbaby.com/)\n* \\--Clek (car seats) [https://clekinc.ca/](https://clekinc.ca/)\n\n* **Food:**\n\n* \\--Mid Day Squares (chocolate treats) [https://www.middaysquares.com/](https://www.middaysquares.com/)\n* \\--GoBio (organic foods) [https://gobiofood.com/](https://gobiofood.com/)\n\n* **Retail/D2C**\n\n* \\--Monos (luggage and accessories) [https://monos.com/](https://monos.com/)\n* \\--Vessi (shoes) [https://ca.vessi.com/](https://ca.vessi.com/)\n\n* **Clothing**\n\n* \\--Duer (athletic forward) [https://duer.ca/](https://duer.ca/)\n* \\--Aritzia (fashion forward) [https://www.aritzia.com/en/home](https://www.aritzia.com/en/home)\n\nYou can support many Canadian retailers who are doing the hard job of navigating this hardship for all of us.\n\n[Well.ca](http://Well.ca) \\- [https://well.ca/ ](https://ctrk.klclick.com/l/01JMJBTDQS2JQT6V5SQEQ238HZ_20)  \nLondon Drugs [https://londondrugs.ca](https://londondrugs.ca)",
      "score": 1,
      "created_utc": 1746113526.0,
      "replies": []
    },
    {
      "id": "mq22wcd",
      "author": "mtl_jim2",
      "body": "So basically they don’t want Americans to order from Canadian retailers to cannibalize sales from US retailers. Canadians get shafted 😔",
      "score": 2,
      "created_utc": 1746122366.0,
      "replies": [
        {
          "id": "mq2bbxx",
          "author": "nsomnac",
          "body": "RTFA. Not the reason whatsoever.  They ship all products intended for Canada via U.S. distribution, which makes them subject to tariffs. Yes they could recoup the tariff paid, however it probably costs more to do that than to just pass on the cost of the tariff. \n\nLong term solution is to establish or move North American distribution to Canada from U.S.  which would just be another slap on the face to U.S. as they not only lose access to international products not available in U.S., but also the U.S. based jobs for people that were responsible for handling distribution. \n\nAre we winning yet?",
          "score": 0,
          "created_utc": 1746124856.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mq09hzy",
      "author": "waloshin",
      "body": "Screw Leica and their overpriced rich man’s junk cameras anyway…",
      "score": 0,
      "created_utc": 1746102171.0,
      "replies": []
    },
    {
      "id": "mq43d2k",
      "author": "ariukidding",
      "body": "This is another element of the Tariffs. Manufacturers can also put a blanket price increase globally to offset tanking sales/higher costs on a heavily tariffed country. Personally i’d stay away from companies that would do this. If i had no business against US and China, why the fuck would i the consumer share their pain?",
      "score": 1,
      "created_utc": 1746144877.0,
      "replies": []
    },
    {
      "id": "mq12iis",
      "author": "Masrim",
      "body": "Never even heard of Leica, won't be hard to boycott.",
      "score": -1,
      "created_utc": 1746111770.0,
      "replies": [
        {
          "id": "mq1n6h7",
          "author": "Finwolven",
          "body": "You've never spent over $3000 on a single hand-actuated camera lens? \n\nOr $30 000 on a lens for a professional movie camera?\n\nWhat, are you poor? Do you not _crave_ the highest quality of optical products? /s",
          "score": 2,
          "created_utc": 1746117873.0,
          "replies": [
            {
              "id": "mq29zo2",
              "author": "nsomnac",
              "body": "They do manufacture more things than just cameras. They manufacture all kinds of products involving optics that are used throughout multiple industries like medical, space, defense, and manufacturing.",
              "score": 2,
              "created_utc": 1746124463.0,
              "replies": []
            },
            {
              "id": "mq1qsg7",
              "author": "Masrim",
              "body": "I have a nokia.",
              "score": 0,
              "created_utc": 1746118917.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq13rr2",
      "author": "FallenAngel7334",
      "body": "> “I can confirm that the tariff price adjustment will impact the Canadian market similarly to the US, as Leica Camera North America operates out of the US, with all imports managed through its US headquarters before reaching Canada,” Nathan Kellum-Pathe, Trade Marketing & Product Communications Manager at Leica Camera explains to PetaPixel.\n\nWhy is nobody reading the article???",
      "score": -3,
      "created_utc": 1746112142.0,
      "replies": [
        {
          "id": "mq1m4uv",
          "author": "bianary",
          "body": "They can request their tariffs be refunded if they're immediately exporting to Canada https://en.m.wikipedia.org/wiki/Duty_drawback",
          "score": 3,
          "created_utc": 1746117567.0,
          "replies": [
            {
              "id": "mq1mq3u",
              "author": "Finwolven",
              "body": "And they will, but also will add to the price. Because they can.",
              "score": 6,
              "created_utc": 1746117740.0,
              "replies": [
                {
                  "id": "mq1t5wc",
                  "author": "bianary",
                  "body": "I'm just answering why the defense of \"it's shipped through the US\" fails, not addressing the reality of corporate greed.",
                  "score": 2,
                  "created_utc": 1746119602.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mq29fbd",
              "author": "nsomnac",
              "body": "Sure. But that’s not a zero cost activity. Leica has to pay people to file and monitor all that paperwork. It’s not just one person either. It’s likely one person doing the main paperwork - but then any number of finance and lawyers involved in the process. That cost isn’t non-zero. It’s not unreasonable to believe that task alone adds significant cost to recoup those payments and pass through of the tariff may be the cheaper option at this time.",
              "score": 1,
              "created_utc": 1746124294.0,
              "replies": [
                {
                  "id": "mq2kkrz",
                  "author": "bianary",
                  "body": "The way to get companies to figure out how to efficiently do things is to not just shrug and pay them to gouge you.",
                  "score": 1,
                  "created_utc": 1746127586.0,
                  "replies": [
                    {
                      "id": "mq2uzdk",
                      "author": "nsomnac",
                      "body": "That’s all fine and dandy for a keyboard warrior who has zero insight into Leica’s internal business, costs, and financial position. \n\nI’m not claiming to know any - but using simple critical thinking skills, Leica sales into Canada is likely a very small fraction of sales in comparison to other regions globally. Moving or establishing a new Canadian port of entry may not just make sense if the historical sales in Canada don’t create enough revenue or profit to cover the operational costs for selling into Canada alone.  I don’t claim to know what 7% increase means in total revenue from Canadian sales, but given the population, I can’t imagine it’s a giant number overall. Buildings, people, insurance, etc are expensive - unless the tariffs adds many millions of dollars annually that could be circumvented by moving or recouping - it likely doesn’t make sense. But I’m only making SWAGs without knowing the real numbers. \n\nRealistically since we know baseline tariff is 10% - using algebra one can probably deduce what that markup on Leica imports actually are since the tariff is applied to the wholesale price not the retail price. If you know the old retail price and the current retail price changed by 7%, you know that should be equal to some base price + 10% + some amount of retail markup.  If there’s any published insight into historical sales in Canada - one might be able to figure out if this is price gouging or not. Until then my assumption is it doesn’t make financial sense to move operations to Canada or recoup the tariffs paid - or maybe the 7% does factor in the cost to recoup tariffs.",
                      "score": 1,
                      "created_utc": 1746130578.0,
                      "replies": [
                        {
                          "id": "mq2wb6h",
                          "author": "bianary",
                          "body": "So it's not fine and dandy to assume they can recover their financial losses through known mechanisms, but it is fine and dandy to assume that a business (And businesses are just _known_ for their honesty and transparency to customers about their costs) is being truthful about how they have to, just have to, pass the costs on?\n\nRight.  Pull the other one.",
                          "score": 2,
                          "created_utc": 1746130959.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mq2qps1",
      "author": "fakint",
      "body": "Lol as someone could ever afford a Leica.",
      "score": -1,
      "created_utc": 1746129347.0,
      "replies": []
    },
    {
      "id": "mq3optf",
      "author": "ajyahzee",
      "body": "51st state indeed",
      "score": -1,
      "created_utc": 1746139860.0,
      "replies": []
    },
    {
      "id": "mq2xu6p",
      "author": "NewDad907",
      "body": "Kind of like how big pharma jacks up prices in the USA to compensate for regulated pricing the rest of the world’s governments impose.\n\nYou’re welcome world. The USA is happy to subsidize big pharma’s profits so y’all can have low cost/free healthcare.",
      "score": -4,
      "created_utc": 1746131394.0,
      "replies": [
        {
          "id": "mq3rrcq",
          "author": "DylanRahl",
          "body": "Koolaid has a toxic effect, wean yourself",
          "score": 6,
          "created_utc": 1746140899.0,
          "replies": [
            {
              "id": "mq4kin7",
              "author": "NewDad907",
              "body": "lol as if I voted for a MAGA Republican piece of authoritarianism trash. You don’t know me, so your opinion is less than worthless. smh. \n\nGTFO of here, you’re intentionally being an obtuse contrarian with no intention of discussing the issue in good faith. \n\nDon’t bother replying, notifications for this post have been disabled.",
              "score": -2,
              "created_utc": 1746151013.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mq051mw",
      "author": "NouXouS",
      "body": "Never heard of it. Raise away",
      "score": -16,
      "created_utc": 1746100345.0,
      "replies": [
        {
          "id": "mq0mulk",
          "author": "SuicidalChair",
          "body": "Never watched Eurotrip I see",
          "score": 1,
          "created_utc": 1746106974.0,
          "replies": [
            {
              "id": "mq0n3ja",
              "author": "NouXouS",
              "body": "Prices of everything are rising in Canada. Buy local.",
              "score": -2,
              "created_utc": 1746107056.0,
              "replies": [
                {
                  "id": "mq0npkt",
                  "author": "SuicidalChair",
                  "body": "I'm not buying professional grade cameras or microscopes regardless of where they are made but thank you for the tip lol",
                  "score": 4,
                  "created_utc": 1746107257.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}