{
  "post": {
    "title": "Another Google Pixel 6a catches fire after battery-nerfing update | Google's Battery Performance Program update was supposed to stop this.",
    "author": "chrisdh79",
    "id": "1mbs41x",
    "score": 396,
    "created_utc": 1753736120.0,
    "selftext": "",
    "num_comments": 53,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mbs41x/another_google_pixel_6a_catches_fire_after/"
  },
  "comments": [
    {
      "id": "n5oen0l",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753736121.0,
      "replies": []
    },
    {
      "id": "n5ogec8",
      "author": "dropthemagic",
      "body": "They should just do a recall at this point. Eventually one of these is going to catch on fire on a plane. It’s not worth the lawsuits. Just recall the damn phones",
      "score": 133,
      "created_utc": 1753736637.0,
      "replies": [
        {
          "id": "n5okk7s",
          "author": "xGuru37",
          "body": "Agreed. I remember airlines actually banning Note7 phones for the same reason.",
          "score": 69,
          "created_utc": 1753737869.0,
          "replies": [
            {
              "id": "n5pntcx",
              "author": "jyeckled",
              "body": "They’re actually still banned!",
              "score": 34,
              "created_utc": 1753750684.0,
              "replies": [
                {
                  "id": "n5rqzby",
                  "author": "HeftyArgument",
                  "body": "I got in trouble at the airport because I excitedly took a photo of the notice saying note 7s were banned like 5 years after it happened; turns out it was a crime to take photos in there haha",
                  "score": 9,
                  "created_utc": 1753786019.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5pgkf2",
              "author": "70monocle",
              "body": "I still miss my note 7...",
              "score": 12,
              "created_utc": 1753748193.0,
              "replies": []
            },
            {
              "id": "n5ppx6p",
              "author": "Sivalon",
              "body": "They banned them twice. The originals, and then the “fixed” ones which weren’t as fixed as Samsung said they were.",
              "score": 11,
              "created_utc": 1753751405.0,
              "replies": [
                {
                  "id": "n5qrczq",
                  "author": "Emerald_Flame",
                  "body": "Samsung eventually pushed a firmware for them that literally stops them from charging. So for the people who didn't turn them in, if/when they got the firmware update, once the battery died and the phone turned off, that was it.",
                  "score": 12,
                  "created_utc": 1753766230.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5q8xve",
              "author": "BoolImAGhost",
              "body": "I worked at Best Buy during this ordeal. Such a mess",
              "score": 5,
              "created_utc": 1753758200.0,
              "replies": [
                {
                  "id": "n5qdw5k",
                  "author": "xGuru37",
                  "body": "I bet! It was hard to convince my cell provider at the time to let me swap to a completely different phone once the news first broke. I wasn't going to take chances.",
                  "score": 4,
                  "created_utc": 1753760177.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n5wpu0v",
              "author": "gilligvroom",
              "body": "I worked at Best Buy during that fiasco and our Samsung reps all looked like they were ready to take a flying leap off the building 😅 I was merrily avoiding all of that BS because I'd just moved out of Mobile to Digital Cameras and Geek Squad.",
              "score": 2,
              "created_utc": 1753841749.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5pg3gs",
          "author": "ResponsibleQuiet6611",
          "body": "That would set a precedence, and they would have to recall every #a phone from 4a onward (and maybe their non-a phones too). \n\n\nSo, not happening. Their plan is to render the affected phones useless via software updates in hopes that we all upgrade to other phones, until they can sweep this all under the rug. ",
          "score": 12,
          "created_utc": 1753748029.0,
          "replies": []
        },
        {
          "id": "n5piscz",
          "author": "BlueProcess",
          "body": "No one should have to give up their phone, which is almost impossible to scrub of their data. Either ship replacements or do the obvious thing and roll back the update.",
          "score": 3,
          "created_utc": 1753748954.0,
          "replies": [
            {
              "id": "n637wha",
              "author": "brrbles",
              "body": "There are plenty of reasons to be mad at Google, but this is an incoherent criticism. If the phone is at risk of starting on fire due to the battery a free battery replacement or a generous counter offer to get you to replace your battery or phone are reasonable responses, and it would be arguably worse for them to give you the YOLO button. There's no reason for them to give you a completely new phone to replace a 4 (or in the case of the 4a 6) year old device.\n\n\nI'm not sure why in this scenario you're worried about your phone getting spied on - you actually can factory reset the thing and it will be effectively scrubbed. In fact for the most part simply powering it off completely will be just as effective if you have a decent passcode. In fact, you even have another option that lets you keep the phone, restores functionality, and lets you maintain custody - take the cash option, buy a replacement battery and replace it yourself.",
              "score": -1,
              "created_utc": 1753926067.0,
              "replies": [
                {
                  "id": "n6390d5",
                  "author": "BlueProcess",
                  "body": "It is not incoherent criticism. If a software rollout broke it, a software rollback would fix it. Plain and simple. I think you are well aware of how easy it is to recover deleted data. It's not a risk one should be forced to take. Not even for the lure of free stuff.",
                  "score": -1,
                  "created_utc": 1753926470.0,
                  "replies": [
                    {
                      "id": "n65t41c",
                      "author": "brrbles",
                      "body": "The software update is not what is causing the risk of battery fires - it's the fucking batteries. Take or leave the software update, the battery is still at risk.\n\n\nAnd you are 100% wrong about data recovery on your phone. User data is stored encrypted and the only way to get it unencrypted is to use the security chip on the phone and feed it your unlock code. The unlock code then decrypts the decryption key for data on your phone. When you factory reset your phone it deletes that decryption key entirely and the memory chips store data that is indistinguishable from random bits.",
                      "score": 4,
                      "created_utc": 1753968194.0,
                      "replies": [
                        {
                          "id": "n662htg",
                          "author": "BlueProcess",
                          "body": "Weird how the batteries were fine until the software update",
                          "score": -2,
                          "created_utc": 1753971050.0,
                          "replies": [
                            {
                              "id": "n667coi",
                              "author": "brrbles",
                              "body": "They weren't, dude.",
                              "score": 5,
                              "created_utc": 1753972464.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n5p1eyz",
          "author": "Starfox-sf",
          "body": "I think there was a Note on that issue…",
          "score": 2,
          "created_utc": 1753743189.0,
          "replies": []
        },
        {
          "id": "n65thb9",
          "author": "brrbles",
          "body": "What is the difference between a recall and what they are already doing?",
          "score": 1,
          "created_utc": 1753968311.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n5oxf6w",
      "author": "SmallSunDown",
      "body": "Typed this on a Google Pixel 6a... I am doomed!",
      "score": 44,
      "created_utc": 1753741881.0,
      "replies": [
        {
          "id": "n5qblpz",
          "author": "ludocode",
          "body": "Read [this](https://support.google.com/pixelphone/answer/16340779?hl=en). It says only some devices are impacted. Click the button that says \"Check Pixel 6a eligibility\" and paste in your IMEI.\n\nI put in mine and it said my phone is not eligible for the free replacement. I'm hoping that means I don't have one of the defective batteries. 🤷 If it says your device is impacted they will supposedly let you take it to a repair shop to swap the battery for free.",
          "score": 15,
          "created_utc": 1753759250.0,
          "replies": [
            {
              "id": "n5qels6",
              "author": "CrunchitizeMeCaptn",
              "body": "I am impacted....but the only accredited stores in my area have been out of stock for a while",
              "score": 11,
              "created_utc": 1753760476.0,
              "replies": []
            },
            {
              "id": "n5qkoer",
              "author": "SmallSunDown",
              "body": "I'm impacted..  I'm gonna live dangerously.\n...But good information, thank you!!",
              "score": 3,
              "created_utc": 1753763080.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5p9r7m",
          "author": "Mean_Ass_Dumbledore",
          "body": "Just checking in. You burnt to a crisp yet?",
          "score": 2,
          "created_utc": 1753745910.0,
          "replies": [
            {
              "id": "n5pajqo",
              "author": "SmallSunDown",
              "body": "Nope! still here, just hoping to make it through my work day with my nerfed battery. Tonight is the scary time... It's the overnight charge that'll get ya!",
              "score": 5,
              "created_utc": 1753746168.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5pcinu",
      "author": "ElvisArcher",
      "body": "Someone at Google did the math and realized all those phones were going to suffer catastrophic battery failure rates ... soon.  And that by reducing the overall charge capacity, that failure rate could be significantly lowered.  But nothing will prevent it ... its just delaying the inevitable.",
      "score": 19,
      "created_utc": 1753746814.0,
      "replies": [
        {
          "id": "n5pguor",
          "author": "ResponsibleQuiet6611",
          "body": "I doubt in practice it affects the failure rate at all.\n\n\nThey can just publish some bullshit lies engineering reports indicating it will and never be held accountable. The real goal of the battery-gimping patches is to mitigate liability by pushing consumers with affected devices to upgrade by rendering their purchased good useless.\n\n\nThis is the beginning of hardware as a service. ",
          "score": 6,
          "created_utc": 1753748291.0,
          "replies": [
            {
              "id": "n5q0tjw",
              "author": "ElvisArcher",
              "body": "Yep.  For me it was an easy decision.  Moved cell phone carriers and picked up a pixel 9 for free.  Google Fi cut my cell bill in half.",
              "score": 2,
              "created_utc": 1753755205.0,
              "replies": [
                {
                  "id": "n5qi0kq",
                  "author": "FanceyPantalones",
                  "body": "Im already on Google fi. What do you suggest?",
                  "score": 2,
                  "created_utc": 1753761907.0,
                  "replies": [
                    {
                      "id": "n5r5nql",
                      "author": "ElvisArcher",
                      "body": "Fi was running a deal where you buy the Pixel 9 on credit, then get a monthly rebate that 100% covers the cost over a 2 year period.  This was about a year ago, so their offerings may have changed.",
                      "score": 2,
                      "created_utc": 1753773962.0,
                      "replies": [
                        {
                          "id": "n67q35y",
                          "author": "FanceyPantalones",
                          "body": "Thx. Sucks that this failure is encouraging me to buy another pixel before I wanted to. Wait a minute...",
                          "score": 3,
                          "created_utc": 1753987711.0,
                          "replies": [
                            {
                              "id": "n688pdf",
                              "author": "ElvisArcher",
                              "body": "The sad reality is that every device is designed to fail in an absurdly short period of time.  4 years isn't bad in today's ecosystem, but as long as we are toting devices with Li-Ion batteries, there is no escape.",
                              "score": 2,
                              "created_utc": 1753993087.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n5owora",
      "author": "Menarra",
      "body": "Hm well let me just check my phone model real qui-\n\nOh shit.",
      "score": 11,
      "created_utc": 1753741642.0,
      "replies": []
    },
    {
      "id": "n5okezr",
      "author": "xGuru37",
      "body": "It's the Samsung Note7 all over again.",
      "score": 20,
      "created_utc": 1753737827.0,
      "replies": []
    },
    {
      "id": "n5t0a6x",
      "author": "kclongest",
      "body": "Expecting a software update to fix an issue with batteries catching on fire is a pipe dream. Yeah I know, charging profiles, blah blah blah, but let’s get real here for a minute.",
      "score": 3,
      "created_utc": 1753801777.0,
      "replies": []
    },
    {
      "id": "n5s82gz",
      "author": "Dis_Nothus",
      "body": "Reading this on a Pixel 6, yeah the battery on this thing has gotten hot hot before. Didn't realize they've been blowing up, gonna try to change phones this week",
      "score": 2,
      "created_utc": 1753793064.0,
      "replies": []
    },
    {
      "id": "n5skwp7",
      "author": "naturist_rune",
      "body": "Google is self-destructing in all areas, huh?",
      "score": 2,
      "created_utc": 1753797298.0,
      "replies": []
    },
    {
      "id": "n5uhcym",
      "author": "Mr__Pleasant",
      "body": "My pixel 7a got pregnant a year after...",
      "score": 2,
      "created_utc": 1753816459.0,
      "replies": []
    },
    {
      "id": "n5ymr7d",
      "author": "Iucidium",
      "body": "A year or so ago, my pixel 6 was really hot. Didn't realise until I got it out the case that the battery was becoming a spicy pillow. Seems like bad battery management hardware or a shit batch of batteries are to play. Google replaced the phone for free and out of warranty so that was nice.",
      "score": 2,
      "created_utc": 1753875698.0,
      "replies": []
    },
    {
      "id": "n5t0afq",
      "author": "IlTossico",
      "body": "WHAT, that's why my phone just lost a ton of durability on the battery in the last few weeks?  \n\nI was doing 2 days and half just fine with my 6A and now it is a miracle if I finish the second day.",
      "score": 1,
      "created_utc": 1753801779.0,
      "replies": []
    },
    {
      "id": "n61og6r",
      "author": "Gnash_",
      "body": "The fact that Lithium batteries are absolutely everywhere and we are putting these ticking time-bombs in our pockets, on our laps, on our wrists, in our ears, etc. is absolutely crazy.\n\nEvery time one of these incidents happen, that thought crosses my mind and it gives me the chills for a little while.",
      "score": 1,
      "created_utc": 1753908158.0,
      "replies": []
    },
    {
      "id": "n62xyn1",
      "author": "zap_p25",
      "body": "My Pixel 6a has Graphene on it…so doesn’t receive the same updates.",
      "score": 1,
      "created_utc": 1753922516.0,
      "replies": []
    },
    {
      "id": "n5snsno",
      "author": "Uldronex",
      "body": "Damn, Google, what did you do this time? 😂",
      "score": 0,
      "created_utc": 1753798171.0,
      "replies": []
    },
    {
      "id": "n5tcenl",
      "author": "Mythun4523",
      "body": "Great. Can't buy pixels again. My sister is currently using a pixel 6a as well.",
      "score": 0,
      "created_utc": 1753805173.0,
      "replies": []
    },
    {
      "id": "n5oy3ds",
      "author": "nipsen",
      "body": "Ars is doing a propaganda-bit for another manufacturer who sees google as a competitor (read: Apple), and they're succeeding as well.\n\nThe pixel6a, like literally all phones on the market at this point, uses a lithium polymer battery. They will not catch on fire and burn your house down (the organic lithium ion batteries also do not do that any more, and haven't for a decade - unless you actually light them on fire and damage the cells). There's basically no way to bypass the regulator for the battery discharge effect without shorting it out. But Ars seem incabable of actually mentioning this in any of their several articles about this.\n\nI'm sure it is possible to make most phones, including the pixel, way too hot by charging it full effect as you discharge the battery by accident through inadvertently running some app forever, or an update hanging itself or something like that. Where the combined effect from the charging and the processor burn will end up torching something, which then in turn flashes and causes damage.\n\nBut the battery itself is not the problem. With this phone, or with any other phone on the market. But Ars just doesn't know, I guess, like a good mercenary.",
      "score": -27,
      "created_utc": 1753742103.0,
      "replies": [
        {
          "id": "n5p1rsy",
          "author": "Dan1elSan",
          "body": "This just isn’t correct, lithium batteries can and do catch fire.  There’s plenty of evidence of the Pixel 6a doing just that and that’s why Google is replacing the batteries presently for free.",
          "score": 17,
          "created_utc": 1753743305.0,
          "replies": [
            {
              "id": "n5p5vkj",
              "author": "nipsen",
              "body": "Lithium polymer batteries do not have a combustible electrolyte. To get these to catch fire requires a power source that would be bigger than the potential energy release. They do not simply \"catch on fire\", period.\n\nAnd like I said, with a regulator, the organic batteries also do not catch on fire any more unless they are physically damaged.\n\nThis entire ars series is complete bullshit.",
              "score": -12,
              "created_utc": 1753744645.0,
              "replies": [
                {
                  "id": "n5p8udf",
                  "author": "Dan1elSan",
                  "body": "Defective lithium batteries can overheat and catch fire, one specific battery manufacturer installed within the pixel 6a is targeted in the battery swap scheme.  \n\nIt can overheat and cause a fire, it’s not really up for debate.  They’re not doing a battery swap out of the goodness of their hearts it’s a safety risk due to possibility of overheating and causing a fire.  \n\nNobody is saying the phone is going to burst into flames but people charge their phones in all sorts of places and if your defective battery overheats it has the possibility of igniting its surroundings.",
                  "score": 15,
                  "created_utc": 1753745609.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n5qj4av",
          "author": "krigr",
          "body": "Lithium batteries work by moving lithium atoms from one electrode through a membrane to another electrode. Depending on the chemistry and manufacturing process, the lithium can deposit into spike shapes over time, and if the spikes grow through the membrane and make contact from both sides they'll act as a tiny short.\n\nIt might only be a very small short at first, with a tiny amount of current, but it reduces their effective capacity and causes the battery to drain over time on its own. This means the battery gets discharged and recharged faster, causing a feedback loop that grows a tiny wire to a more significant internal short that's fully capable of igniting the battery.\n\nDue to the microscopic engineering and precision metallurgy required, it's impossible to prevent this from happening 100% of the time. It's entirely possible that the Pixel 6a's battery happened to use a bad batch of electrodes/membranes/whatever. \n\nIt would take inspecting every crevice of every battery with an atomic microscope to prevent it, and that simply can't happen at scale, so we'll have to settle for 99.9%.\n\nMind you, my Pixel 6a has been running just fine. Fingers crossed it stays that way",
          "score": 3,
          "created_utc": 1753762390.0,
          "replies": [
            {
              "id": "n5qjjmb",
              "author": "nipsen",
              "body": "*sigh* ....no lithium salts in the electrolyte! What year is this again? 1974?",
              "score": -4,
              "created_utc": 1753762577.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}