{
  "post": {
    "title": "Nvidia and AMD rush to stockpile graphics cards ahead of Trump tariff that could raise prices by 40pct | A 2,500USD RTX 5090?",
    "author": "chrisdh79",
    "id": "1hndtp9",
    "score": 6926,
    "created_utc": 1735302417.0,
    "selftext": "",
    "num_comments": 670,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hndtp9/nvidia_and_amd_rush_to_stockpile_graphics_cards/"
  },
  "comments": [
    {
      "id": "m40ucjy",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735302418.0,
      "replies": []
    },
    {
      "id": "m40une8",
      "author": "foreveraloneasianmen",
      "body": "stockpile the GPU so they could sell more than 40% higher price",
      "score": 1924,
      "created_utc": 1735302582.0,
      "replies": [
        {
          "id": "m411oi3",
          "author": "SoapyMacNCheese",
          "body": "No doubt about it. Nvidia isn't going to launch the 5090 at $1,600, wait for inventory to run out, and then say it now costs $2,200. It's just going to cost $2,200 from day one. I'm sure that's what every industry is planning to do.\n\nEdit: and then of course the board partners are going to increase prices on top of Nvidia's MSRP and blame the tariffs.",
          "score": 488,
          "created_utc": 1735306016.0,
          "replies": [
            {
              "id": "m41pvsz",
              "author": "killerboy_belgium",
              "body": "Nope stockpile increase price blame tarrifs and then rise price again when tarrifs are active and blame it even more on tarrifs",
              "score": 251,
              "created_utc": 1735315143.0,
              "replies": [
                {
                  "id": "m41tgwj",
                  "author": "Better-Arugula",
                  "body": "This is exactly what’s gonna happen! People forget these corporations will exploit ANY opportunity to increase profits then shift the blame elsewhere. Just look at what happened during and after Covid even far past the supply chain issues. \n\nSad times for pc builders in the next few years. I’ll guess I’ll hold onto my 6800xt for awhile longer…",
                  "score": 155,
                  "created_utc": 1735316332.0,
                  "replies": [
                    {
                      "id": "m4209xa",
                      "author": "jjayzx",
                      "body": "I got a 4090 so I could sit on it for a long ass time. It was a hard pill to swallow cost-wise but I think long term it should pay off.",
                      "score": 29,
                      "created_utc": 1735318528.0,
                      "replies": [
                        {
                          "id": "m43otsc",
                          "author": "jeha4421",
                          "body": "Got a 4080 Super for the same reason. Consodering most AAA bloated games aremt worth playing though, I'm not sure I'll upgrade from here unless there is a massive price drop. I've had no issue running everything at 4k 80 fps+ on ultra. And most games i enjoy are AA or indie anyways.\n\nPersonally I don't see a 5090 selling to consumers for that price. Maybe crypto farms or AI systems. But there is literally no reason to get a 5090 when a 4090 will likely be fine for the next half decade.",
                          "score": 19,
                          "created_utc": 1735338060.0,
                          "replies": [
                            {
                              "id": "m44hfti",
                              "author": "Viper_Freak1",
                              "body": "Half decade?  I’m still running a 1070.  Just gotta reduce your expectations.  It saves a lot of money.",
                              "score": 24,
                              "created_utc": 1735348370.0,
                              "replies": [
                                {
                                  "id": "m4632xw",
                                  "author": "jib_reddit",
                                  "body": "People spend a lot of money on their hobbies, some will spend $50k-$100 on a 2nd car just to take to a race track once a month.",
                                  "score": 1,
                                  "created_utc": 1735375909.0,
                                  "replies": []
                                },
                                {
                                  "id": "m49v7a1",
                                  "author": "TheRealMrBreeze",
                                  "body": "Maybe? Lots of games struggle on 1070 and even 1080 at med-high details. I would say setting reasonable expectations are only a part of it. I have a couple friends who have Ryzen 7 and i7 9900k and 16GB with their ROG 1070's and maintaining 60fps even at 1080p in games like Warhammer Space Marine 2 on med-low settings is challenging at best.  \n  \n1070 is still a solid card for general 1080p gaming that's for sure, and as long as its not being bottlenecked by the rest of the components it is one of the cards that has held its place for longer than most. But even the 20x series cards are starting to show their age on newer games esp. at resolutions over 1080p. And lowering the resolution sucks on modern monitors as they look blurry AF outside of their native.  \n  \nGame developers have also gotten lazy and code is bloated. Faster hardware means they can just bury more dead bodies in their code and say its the norm. They are to blame as well.",
                                  "score": 1,
                                  "created_utc": 1735430496.0,
                                  "replies": []
                                },
                                {
                                  "id": "m44qw12",
                                  "author": "AlwaysLateToThaParty",
                                  "body": "Got my 2070 super and a 45\" 4K monitor the day I realised we were going to have covid lockdowns.  They were sold out within a week. The card never reduced in price to lower than what I bought for, before they stopped selling it. Even today I could sell it second hand for over 50% of what I paid.\n\nPlays Baldurs Gate 3 fine.",
                                  "score": 1,
                                  "created_utc": 1735352002.0,
                                  "replies": [
                                    {
                                      "id": "m44rdyr",
                                      "author": "Viper_Freak1",
                                      "body": "Awesome, should last another 10 years then.  Which is great for saving money!",
                                      "score": 3,
                                      "created_utc": 1735352200.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m444a6s",
                              "author": "jjayzx",
                              "body": "Yea I'm hoping for at least 5 years. Have it watercooled as well to help.",
                              "score": 3,
                              "created_utc": 1735343549.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m43ihpt",
                          "author": "SickOfUrShite",
                          "body": "The 5080 costs more than the 4090 sounds like you made the right choice",
                          "score": 1,
                          "created_utc": 1735335954.0,
                          "replies": []
                        },
                        {
                          "id": "m44nkrv",
                          "author": "None",
                          "body": "Hey, I got a 3090 TI and I’m in no rush to upgrade.",
                          "score": 1,
                          "created_utc": 1735350702.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m42ovkn",
                      "author": "Deranged_Kitsune",
                      "body": "Never let a good tragedy go to waste.",
                      "score": 1,
                      "created_utc": 1735326345.0,
                      "replies": []
                    },
                    {
                      "id": "m44aqb8",
                      "author": "Hambone429",
                      "body": "Yes! Prices have yet to return to normal levels and package volumes and weights has shrunk significantly.",
                      "score": 1,
                      "created_utc": 1735345905.0,
                      "replies": []
                    },
                    {
                      "id": "m44wsi4",
                      "author": "UnsealedLlama44",
                      "body": "I’m still on a 1080 lmao. Good thing I stopped playing anything graphically intensive.",
                      "score": 1,
                      "created_utc": 1735354366.0,
                      "replies": []
                    },
                    {
                      "id": "m45m4q0",
                      "author": "Queens113",
                      "body": "I just bought a 7800xt red devil... Maybe I made the right choice",
                      "score": 1,
                      "created_utc": 1735365683.0,
                      "replies": []
                    },
                    {
                      "id": "m4bosaj",
                      "author": "None",
                      "body": "“Supply Chain Factors”…",
                      "score": 1,
                      "created_utc": 1735458027.0,
                      "replies": []
                    },
                    {
                      "id": "m4p9wcx",
                      "author": "FireMaker125",
                      "body": "I’m not planning on upgrading my 7900XTX for at least 5 years. I do fear that developers will only optimise games for high end Nvidia cards though.",
                      "score": 1,
                      "created_utc": 1735658256.0,
                      "replies": []
                    },
                    {
                      "id": "m43vff9",
                      "author": "None",
                      "body": "Boy, all the anti-woke gamers are gonna be real mad when they find out they can't afford a machine to run the newest anime titty game.",
                      "score": -1,
                      "created_utc": 1735340332.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m43wo0u",
                  "author": "LadyFromTheMountain",
                  "body": "This right here. They can increase prices by 40%, lose 39% of their customer base and STILL turn more profit than last year. Of course, they’ll try it.",
                  "score": 7,
                  "created_utc": 1735340773.0,
                  "replies": []
                },
                {
                  "id": "m423hrn",
                  "author": "sllop",
                  "body": "Sounds like you should buy some Nvidia stock",
                  "score": 3,
                  "created_utc": 1735319561.0,
                  "replies": [
                    {
                      "id": "m44qw6l",
                      "author": "killerboy_belgium",
                      "body": "the gaming gpu's dont push the needle anymore for there stock, now the datacenter/ai tech is what pushes the needle. Because of this they can push the envolope so much with there gaming gpu prices because the end of the day if it backfire its not big a risk anymore \n\nso in terms of lack of competition especially at the high end, there dominant position and the fact its only a small part of there revenue at this point makes it a very bad spot for the gaming consumer to be in... \n\nbut i dont see intel or AMD breaking there massive lead. even intels lateste gpu that people are raving about is in the end of day being compared to a 2year+ gpu so enless NV shit completely the bed with 5060 i dont see intel being a better buy. So they better sell as many gpu's as they can before amd and NV bring out there next gen  \n\ni will say this intel timing for there gpu's was perfect seeing that amd and NV gpu's are probally atleast 6months out for this price segment",
                      "score": 1,
                      "created_utc": 1735352003.0,
                      "replies": []
                    },
                    {
                      "id": "m463awv",
                      "author": "jib_reddit",
                      "body": "I thought Nvidia stock had peaked near the start of the year and I had missed to gains, so didn't buy any, it have gone up 185% since then....",
                      "score": 1,
                      "created_utc": 1735376061.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m46qv7w",
                  "author": "formala-bonk",
                  "body": "Everyone could see that’s what’s happening except for orange cult. God those people are dumb",
                  "score": 1,
                  "created_utc": 1735391049.0,
                  "replies": []
                },
                {
                  "id": "m48innp",
                  "author": "None",
                  "body": "here, you dropped these:\n\n> . , , , .. ,.. ,. !",
                  "score": 1,
                  "created_utc": 1735414107.0,
                  "replies": []
                },
                {
                  "id": "m4d9cu8",
                  "author": "Souledex",
                  "body": "This is the actual problem with Tariffs. It raises the price of all domestic goods too assuming they even exist",
                  "score": 1,
                  "created_utc": 1735487694.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m42rbux",
              "author": "kpeng2",
              "body": "Just don't buy. It's not a necessity. My old GPU can last at least five more years",
              "score": 15,
              "created_utc": 1735327122.0,
              "replies": []
            },
            {
              "id": "m4415cy",
              "author": "CommonSensei8",
              "body": "Well NVIDIA can have its shitty sales number reflect that like the 4090a",
              "score": 1,
              "created_utc": 1735342399.0,
              "replies": []
            },
            {
              "id": "m44459g",
              "author": "murkwoodresidnt",
              "body": "Without a fucking doubt. I ordered new parts for my shit a few days ago because I already know it’s gonna be ridiculous for a while",
              "score": 1,
              "created_utc": 1735343499.0,
              "replies": []
            },
            {
              "id": "m44wl11",
              "author": "-Hyperactive-Sloth-",
              "body": "I camped out waiting for a 3080 on launch day and it seems like it will just keep plugging along at this rate",
              "score": 1,
              "created_utc": 1735354283.0,
              "replies": []
            },
            {
              "id": "m46z97x",
              "author": "rogan1990",
              "body": "Economists Pablo Fajgelbaum, Pinelopi Goldberg, Patrick Kennedy, and Amit Khandelwal examined the tariffs on washing machines, solar panels, aluminum, steel, and goods from the European Union and China imposed in 2018 and 2019. They found that US firms and final consumers bore the entire burden of tariffs [source](https://taxfoundation.org/blog/who-really-pays-tariffs/)",
              "score": 1,
              "created_utc": 1735394963.0,
              "replies": []
            },
            {
              "id": "m47oqvu",
              "author": "jobhand",
              "body": "It's insane to think that I'm gonna see a day where a (not even top tier) gpu is going to cost the same as my entire PC build that included a top tier gpu back in 2016.",
              "score": 1,
              "created_utc": 1735404372.0,
              "replies": []
            },
            {
              "id": "m4jwub6",
              "author": "TheRealMrBreeze",
              "body": "Corporate Greed at its best! I just picked up an MSI Ventus 3X 4070 Ti Super OC 16GB for $700 on Amazon flash sale before Thanksgiving. I had a bit of buyer remorse but now that they're going for $1000 on Amazon I think I made a good choice. Plus STALKER 2 was running like total 8$$ on my 3070 at 3440x1440 on med-low and now I can play at Epic. Such a huge uplift from the 30 to the 40 series. Wonder if the uplift to the 50 series will be worth it after any price hikes in 2025 (tariff driven or otherwise).",
              "score": 1,
              "created_utc": 1735580167.0,
              "replies": []
            },
            {
              "id": "m43dby1",
              "author": "None",
              "body": " Cool. Build them here in US",
              "score": -1,
              "created_utc": 1735334261.0,
              "replies": [
                {
                  "id": "m43k480",
                  "author": "SpellingPhailure",
                  "body": "We do not have the factories, workforce, immigration policies, supply chains, regulatory environment, or capital in place to do so. None of this can be spun up overnight, and especially not at a cost competitive with other countries. Even if we could get them built in the US, it is bound to be much more expensive than it is in other countries due to the higher costs, which is going to have second order effects on every industry that relies on them.\n\nAdditionally, why would you want to do so? Outside of national security concerns for the supply (Which is entirely valid) we are a much more skilled country that can exploit higher value added parts of the process of designing and building new chips, like actually designing the GPUs or the use of them in applications like AI.",
                  "score": 5,
                  "created_utc": 1735336483.0,
                  "replies": [
                    {
                      "id": "m47oq6t",
                      "author": "None",
                      "body": "Not yet. But we can change all that.",
                      "score": 1,
                      "created_utc": 1735404366.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m427p8r",
              "author": "volfin",
              "body": "4090 costs $2200 so what is your point. the flagship card has always been expensive.",
              "score": -8,
              "created_utc": 1735320906.0,
              "replies": [
                {
                  "id": "m42ykxn",
                  "author": "Quizzelbuck",
                  "body": "That's not normal. Nvidia changed the naming scheme and moved chips from the xx80 ti slot up to the 4090 moniker then charged a shit ton more money. That card you're talking about would have been some thing like a 1080 ti, or a 2080 ti, and after inflation the 4080 ti version in today's performance and price should be maybe... $1100 or $1200. Not $2200. They're playing games with names and gouging because they can.",
                  "score": 2,
                  "created_utc": 1735329460.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m40uzoq",
          "author": "b_a_t_m_4_n",
          "body": "That's more like it. Buy low, sell high.",
          "score": 310,
          "created_utc": 1735302768.0,
          "replies": [
            {
              "id": "m41n8sa",
              "author": "Cm_Punk_SE",
              "body": "Is Jensen Huang a mod for r/wallstreetbets?",
              "score": 32,
              "created_utc": 1735314257.0,
              "replies": [
                {
                  "id": "m43kkw6",
                  "author": "sCeege",
                  "body": "No, WSB is buy high sell low. 💎👏",
                  "score": 12,
                  "created_utc": 1735336635.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4322b3",
              "author": "None",
              "body": "Buy for a dollar, sell for teeyoo",
              "score": 1,
              "created_utc": 1735330593.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m410vdq",
          "author": "Ziograffiato",
          "body": "And blame the tariffs.\n\nThe tariffs will most certainly suck, but corporations will most certainly take advantage of them.",
          "score": 162,
          "created_utc": 1735305653.0,
          "replies": [
            {
              "id": "m412o2a",
              "author": "tastyratz",
              "body": "40% tarrif, 80% markup\n\"We are just passing along our costs! Blame the guv!\"",
              "score": 128,
              "created_utc": 1735306450.0,
              "replies": [
                {
                  "id": "m426sgs",
                  "author": "FortNightsAtPeelys",
                  "body": "Tarrif ends and price doesn't drop",
                  "score": 35,
                  "created_utc": 1735320616.0,
                  "replies": [
                    {
                      "id": "m428fvb",
                      "author": "SephYuyX",
                      "body": "Whaaaaat, don't be silly. When all the companies added a fuel surcharge two decades ago, they totally reversed that later on.",
                      "score": 23,
                      "created_utc": 1735321141.0,
                      "replies": [
                        {
                          "id": "m4ann6t",
                          "author": "Tough-Ability721",
                          "body": "They sure have gotten accustomed to having their cake AND their avocado toast, haven’t they?",
                          "score": 1,
                          "created_utc": 1735440667.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m42oig2",
                      "author": "korgothwashere",
                      "body": "Remember in 2009ish when gas prices went through the roof and all of the food companies cried, \"OH IT NOW COSTS SOOOOO MUCH TO SHIP GOODS!\"...so prices went up about 20-40% and sizes went down about 15-25%.  Yeah, after that short lived gas price bubble, costs did not go back down and sizes never got larger again.  That's why we have 16.9oz drinks now as standard and we lost the typical 20oz yet the 16.9oz bottles are nearly twice the price of the 20oz.",
                      "score": 19,
                      "created_utc": 1735326228.0,
                      "replies": [
                        {
                          "id": "m43panl",
                          "author": "jeha4421",
                          "body": "Unpopular opinion: we shouldn't be drinking 20 oz drinks amyways (unless you mean water)",
                          "score": 1,
                          "created_utc": 1735338221.0,
                          "replies": [
                            {
                              "id": "m43qwdh",
                              "author": "korgothwashere",
                              "body": "I mean, you're right.  However if you're going to say that you might as well say that soda on the whole is bad for you and you shouldn't drink them.\n\nMy point was on the economic side of the matter not the health side.",
                              "score": 7,
                              "created_utc": 1735338771.0,
                              "replies": [
                                {
                                  "id": "m43r012",
                                  "author": "jeha4421",
                                  "body": "I get that. I was being a bit too pedantic.",
                                  "score": 0,
                                  "created_utc": 1735338806.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m42vyqj",
                      "author": "FlyingBishop",
                      "body": "The cost is mostly set by supply/demand anyway. Not sure tariffs will actually raise prices that much on GPUs, Nvidia has a crazy margin here already and their margin has only been going up. It might raise the MSRP but it's not like you could ever actually get the current gen cards for MSRP anyway.",
                      "score": 1,
                      "created_utc": 1735328605.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41ija5",
              "author": "BytchYouThought",
              "body": "Companies almost never being prices back down either. Even if tariffs goes away. Just like CPU shortage lasting a very short while and yet 4 almost 5 years later prices still sky high despite that not being an issue for years now. Yall folks so short sighted voting this guy in.",
              "score": 31,
              "created_utc": 1735312656.0,
              "replies": [
                {
                  "id": "m42v9ci",
                  "author": "sirshura",
                  "body": "gpus did drop in price once Biden admin dropped the tariffs on gpus a few years ago. At some point 3090s that were at 2000+ dropped to 1600...",
                  "score": 5,
                  "created_utc": 1735328380.0,
                  "replies": [
                    {
                      "id": "m4305r3",
                      "author": "BytchYouThought",
                      "body": "Edit: Lmao, the downvotes just further prove my point. Folks mad they don't know the difference between a CPU and external GPU. Stay mad though because my comment remains the truth hence why no retort.\n\nYou do realize a CPU and external GPU aren't the same thing right? Yall are so eager to argue you aren't paying attention to what was even said. **CPU** shortage effected more than you realize apparently.",
                      "score": -6,
                      "created_utc": 1735329972.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m42hbvq",
                  "author": "kikimaru024",
                  "body": "What the fuck are you complaining about, CPUs did come down in pricing.",
                  "score": 0,
                  "created_utc": 1735323942.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m41nqrh",
              "author": "calcium",
              "body": "We’ll see prices rise worldwide, it won’t just be a US issue.",
              "score": 6,
              "created_utc": 1735314425.0,
              "replies": []
            },
            {
              "id": "m417rn3",
              "author": "kerbaal",
              "body": "Its hard to \"take advantage\" of a cost that you pay out. Nobody is taking advantage of them. Tariffs are self harm.",
              "score": -1,
              "created_utc": 1735308603.0,
              "replies": [
                {
                  "id": "m418l30",
                  "author": "Chandysauce",
                  "body": "You think companies are going to increase prices only enough to cover the extra that they have to pay in tariffs? Bless your soul.\n\nEvery company will take advantage of this to increase their profit margin and blame it all on the tariffs.",
                  "score": 69,
                  "created_utc": 1735308933.0,
                  "replies": [
                    {
                      "id": "m419am5",
                      "author": "the_bryce_is_right",
                      "body": "Yup they do the same thing with the carbon tax in Canada and everyone here falls for it and blames Trudeau for high grocery prices.",
                      "score": 13,
                      "created_utc": 1735309215.0,
                      "replies": [
                        {
                          "id": "m426ua0",
                          "author": "Proponentofthedevil",
                          "body": "Can we blame both/all? Trump is getting the blame here. So, can we blame the companies, Trump, and Trudeau?",
                          "score": 2,
                          "created_utc": 1735320632.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m42eri7",
                      "author": "LangyMD",
                      "body": "The price points that companies set should already theoretically be maximizing the profit that they receive by balancing how much people are willing to pay with how many people are willing to pay it. If everything is working correctly, then prices would go down when costs go down.\n\n\nOf course, that also requires that there be other companies available that will actually compete on those items, and unfortunately nVidia is utterly dominating the technology in the graphics card space. AMD is only barely competitive, and Intel even less so; there isn't enough competition to actually drive costs down as naive capitalist economics assumes it would.",
                      "score": 4,
                      "created_utc": 1735323131.0,
                      "replies": []
                    },
                    {
                      "id": "m41a1rr",
                      "author": "kerbaal",
                      "body": "I didn't say that. What I don't think is that simplistic \"conspiracy theory\" versions of economics make any sense. \n\nThey are taking a risk ordering more, stocking product has costs involved and they have to eat those costs while the product itself devalues on the shelf. \n\nPrices don't increase directly because of tariffs. Tarrifs drive up prices by affecting the cost of supply. Buying and stocking more puts a downward pressure on price as it puts pressure on the manufacturer to sell.",
                      "score": -9,
                      "created_utc": 1735309515.0,
                      "replies": [
                        {
                          "id": "m41izmq",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 8,
                          "created_utc": 1735312812.0,
                          "replies": [
                            {
                              "id": "m46qij7",
                              "author": "Glowing-Strelok-1986",
                              "body": "Then why didn't they increase their prices already? Are they stupid?",
                              "score": 0,
                              "created_utc": 1735390869.0,
                              "replies": []
                            },
                            {
                              "id": "m41j8f1",
                              "author": "kerbaal",
                              "body": "Cool story bro.",
                              "score": -17,
                              "created_utc": 1735312896.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m41pfpp",
                          "author": "LonePaladin",
                          "body": "Before I quit smoking, the city I lived in at the time passed a bill to levy a tax on all tobacco products. I believe the money was being used to fund quit-smoking programs and related medical services.\n\nThe day the bill was announced, prices on cigarettes went up about 70%, with signs going up blaming the increase on that bill. This was three months before the bill was going to be active. The day it started, prices went up *again* and they used the exact same signs to lay blame.",
                          "score": 3,
                          "created_utc": 1735314992.0,
                          "replies": [
                            {
                              "id": "m42byos",
                              "author": "kerbaal",
                              "body": "Sure but price is way more complicated than that. That is retail price of a product that is often one of the only consistently profitable products in the outlets that sell them. The manufacturers didn't see much of those initial price changes.\n\nIf you know the price of a product that you sell is necessarily going up, then obviously you are incentivized to try and get ahead of that change in your cash flow on a cash flow sensitive business. It is a dangerous gambit too as everyone else is doing the same thing and anyone secure enough in their cash flow can likely pick up new customers by having lower prices temporarily.\n\nMarkets always adjust to known information once it is known. That is just planning to continue to be in business when cash flows change.",
                              "score": 0,
                              "created_utc": 1735322251.0,
                              "replies": [
                                {
                                  "id": "m42e3lc",
                                  "author": "LonePaladin",
                                  "body": "The problem wasn't that they raised the price in response to that tax being levied -- it's that they did it *twice*.",
                                  "score": 3,
                                  "created_utc": 1735322921.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4273rn",
                              "author": "Proponentofthedevil",
                              "body": "But the bill would increase costs, yes?",
                              "score": -1,
                              "created_utc": 1735320716.0,
                              "replies": [
                                {
                                  "id": "m42dy6n",
                                  "author": "LonePaladin",
                                  "body": "Yes. But the stores raised their prices *twice*.",
                                  "score": 2,
                                  "created_utc": 1735322873.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m41x41k",
                      "author": "Plank_With_A_Nail_In",
                      "body": "In my country we have more than one company providing a service or making a similar product so if one raises prices too far its suicide for them. We don't have our own GFX business but they are important for our own industries so we do not put a tax on importing them. What happened in the USA did all your economists die during covid? This is like econ 101 stuff.\n\nThe AI revolution needs GFX cards but the servers aren't latency dependant so can be hosted anywhere in the world...do you guys really want to miss out on that?",
                      "score": 0,
                      "created_utc": 1735317513.0,
                      "replies": []
                    },
                    {
                      "id": "m4196mi",
                      "author": "None",
                      "body": "[removed]",
                      "score": -12,
                      "created_utc": 1735309171.0,
                      "replies": [
                        {
                          "id": "m419mb8",
                          "author": "Chandysauce",
                          "body": "Hyperbolic maybe, but I'd wager a significant amount of money that \"every\" is closer than \"none\" in terms of the amounts of companies that will take advantage(to any degree).",
                          "score": 16,
                          "created_utc": 1735309345.0,
                          "replies": []
                        },
                        {
                          "id": "m41beiz",
                          "author": "cactus22minus1",
                          "body": "70% of post covid inflation was found to be artificial and not based on material prices or shipping crisis etc. greedflation is real, and they’ll do it again.",
                          "score": 20,
                          "created_utc": 1735310042.0,
                          "replies": []
                        },
                        {
                          "id": "m419csx",
                          "author": "RephRayne",
                          "body": "Just the monopolies.",
                          "score": 5,
                          "created_utc": 1735309239.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m44jrwm",
              "author": "painedHacker",
              "body": "Just like corporations took advantage of inflation",
              "score": 1,
              "created_utc": 1735349254.0,
              "replies": []
            },
            {
              "id": "m4eo8jn",
              "author": "symbiotix",
              "body": "We have it happening right now in Canada. The government is giving a 2 month break on sales tax on a bunch of items (groceries, kids clothes, etc)... The day the 13% tax break went into affect retailers just raised their prices to negate the difference. Most notably on food prices.",
              "score": 1,
              "created_utc": 1735503449.0,
              "replies": []
            },
            {
              "id": "m44g3p5",
              "author": "mccainmw",
              "body": "It will be interesting to see how the tariffs work out.  The hope is that it will inspire both well-known companies and new-starts to restore some American manufacturing (and increase R&D).  If all goes well, prices will eventually come down...although no one should expect them to come down all the way.  China has been very effective at taking advantage of Western cultural differences and challenges...labor costs (e.g. QOL, unions, etc.), politics, regulations and legal system, and others.  They were successful in diverting manufacturing capability and capacity to the point where there is no more competition...only dependency.  They also know that tech (and especially the content it delivers) is an addiction to younger generations...i.e. there is no patience to suffer, even short-term, for new advanced games, social media, or even hardware benchmarks.  \n\nFor the same reason, and you're right, some corporations will take advantage.  Maybe the addicted can/should invest in them.",
              "score": 1,
              "created_utc": 1735347870.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41g467",
          "author": "EnigmaSpore",
          "body": "This guy gets it! AIB partners want their goods now, avoid the tariffs, but give us consumers the tariff price. \n\nCorporations never moss a chance to extract more profits. It’s the American way! 🦅",
          "score": 10,
          "created_utc": 1735311796.0,
          "replies": [
            {
              "id": "m438w2z",
              "author": "witheringsyncopation",
              "body": "I heard the eagle cry when I read this.",
              "score": 1,
              "created_utc": 1735332818.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m40vseg",
          "author": "PornstarVirgin",
          "body": "And get much more than a 40 percent reduction in purchases",
          "score": 4,
          "created_utc": 1735303188.0,
          "replies": [
            {
              "id": "m40xuh3",
              "author": "compound-interest",
              "body": "That would require people to shop for GPUs rationally",
              "score": 19,
              "created_utc": 1735304230.0,
              "replies": []
            },
            {
              "id": "m414q59",
              "author": "Nope_______",
              "body": "Only in angry redditors' wet dreams.",
              "score": 3,
              "created_utc": 1735307334.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41hbem",
          "author": "RocketsandBeer",
          "body": "Exactly. Raise prices when the tariff takes effect and have plenty of inventory at the lower delivered cost.",
          "score": 1,
          "created_utc": 1735312227.0,
          "replies": []
        },
        {
          "id": "m42e21c",
          "author": "CrunchyCondom",
          "body": "can't blame them it's exactly what a bunch dumbass scalpers are gonna do",
          "score": 1,
          "created_utc": 1735322907.0,
          "replies": []
        },
        {
          "id": "m4307yw",
          "author": "DudeNamedShawn",
          "body": "Import them now to avoid Tarrifs, then sell them at Tarrifed prices. Bonus profit margins.",
          "score": 1,
          "created_utc": 1735329992.0,
          "replies": []
        },
        {
          "id": "m44g4gi",
          "author": "PageVanDamme",
          "body": "Should I buy a pc now or later? I don’t need it but Ive had it for 4 years and I don’t want to change when the price is high",
          "score": 1,
          "created_utc": 1735347878.0,
          "replies": [
            {
              "id": "m47azhs",
              "author": "whitey-ofwgkta",
              "body": "ideally I would say just swap out and some parts but it also depends on what your specs are, I built a decent pc and 2020 and its still going strong",
              "score": 1,
              "created_utc": 1735399631.0,
              "replies": [
                {
                  "id": "m48fsd5",
                  "author": "PageVanDamme",
                  "body": "Yeah I don’t have any issue playing the games. So Im not in urgency. But the concern is I was already planning on replacing towards the end of 2025",
                  "score": 1,
                  "created_utc": 1735413169.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m45x0l2",
          "author": "pingpong_playa",
          "body": "Make America Great Again by increasing the price of goods for Americans by 40+%",
          "score": 1,
          "created_utc": 1735371927.0,
          "replies": []
        },
        {
          "id": "m46z31z",
          "author": "Racheakt",
          "body": "Who needs scalpers when the company does it themselves",
          "score": 1,
          "created_utc": 1735394889.0,
          "replies": []
        },
        {
          "id": "m41q62d",
          "author": "kurotech",
          "body": "Yea they will just sit on them for a couple months and take more money in than if they hadn't id bet there will be a shortage that clears up just in time for February",
          "score": 0,
          "created_utc": 1735315237.0,
          "replies": []
        },
        {
          "id": "m434g90",
          "author": "3D-Dreams",
          "body": "Came here to say this. Totally not to save us money but to make them more",
          "score": 0,
          "created_utc": 1735331366.0,
          "replies": []
        },
        {
          "id": "m41zgoh",
          "author": "Lone_Beagle",
          "body": "You, sir, are C-suite material!",
          "score": -1,
          "created_utc": 1735318270.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m40ve8c",
      "author": "baconandeggsandbacon",
      "body": "They will still jack the price regardless of the stockpiling.",
      "score": 723,
      "created_utc": 1735302983.0,
      "replies": [
        {
          "id": "m40zk6k",
          "author": "Corgi_Koala",
          "body": "I mean we've seen their behavior over the past few years. They're probably going to stockpile in order to avoid paying higher tariffs, but then they'll use the tears as an excused to Jack the price up another 30%.",
          "score": 183,
          "created_utc": 1735305052.0,
          "replies": [
            {
              "id": "m411ue4",
              "author": "baconandeggsandbacon",
              "body": "The frustrating thing to me is that it used to be every maybe 4, 5 or 6 years there'd be an event in the markets that would drive prices up a while.\n\nSince covid it's been something every year, these businesses are putting crazy price increases in, dropping no pricing and posting record profits year on year",
              "score": 93,
              "created_utc": 1735306089.0,
              "replies": [
                {
                  "id": "m4190c7",
                  "author": "Bill-O-Reilly-",
                  "body": "Covid really showed the American public how fucking greedy businesses have gotten. They used to at least hide it, since Covid it’s just been blatant and their attitude has become “what’re you gonna do about it?”",
                  "score": 77,
                  "created_utc": 1735309102.0,
                  "replies": [
                    {
                      "id": "m41em64",
                      "author": "Rdubya44",
                      "body": "Covid definitely slammed the gas pedal on late stage capitalism",
                      "score": 38,
                      "created_utc": 1735311253.0,
                      "replies": []
                    },
                    {
                      "id": "m41fl5l",
                      "author": "Corgi_Koala",
                      "body": "It really just emboldened them.",
                      "score": 10,
                      "created_utc": 1735311606.0,
                      "replies": []
                    },
                    {
                      "id": "m49528v",
                      "author": "zer00eyz",
                      "body": "\\> Covid really showed the American public how fucking greedy businesses have gotten. T\n\nCovid really showed businesses how fucking stupid the public have gotten.\n\nPrices go down when people stop buying.... The Auto Industry is seeing the result of their hubris. I suspect that 50 series is going to show a lot of the same things. Oddly NVIDIA doesn't need that market right now (AI boom)...",
                      "score": 3,
                      "created_utc": 1735421520.0,
                      "replies": []
                    },
                    {
                      "id": "m41wmv0",
                      "author": "Miragui",
                      "body": "Here in the Netherlands we have a term for those businesses that keep rising the prices. Graaiflatie, translated that would be like greedflation. Here it's also still happening.",
                      "score": 3,
                      "created_utc": 1735317360.0,
                      "replies": []
                    },
                    {
                      "id": "m43pkn3",
                      "author": "jeha4421",
                      "body": "Not buy?\n\nEveryone here can just choose not to buy the product. I hate corporations as well, and I do what I can to buy as little product as I can.",
                      "score": 3,
                      "created_utc": 1735338316.0,
                      "replies": [
                        {
                          "id": "m453juo",
                          "author": "Meat_Flapz",
                          "body": "You shouldn’t be getting downvoted, this is the answer, but not the answer people want to hear. People will buy and the trend will continue.",
                          "score": 2,
                          "created_utc": 1735357100.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m41z2ic",
                  "author": "DrDerpberg",
                  "body": "When it's \"optional\" goods we only have ourselves to blame. We don't have to buy new/upgrade PCs as often, or as high end GPUs. What's scary is that they're doing it to food and rent too.",
                  "score": 8,
                  "created_utc": 1735318143.0,
                  "replies": []
                },
                {
                  "id": "m43zf6k",
                  "author": "jmegaru",
                  "body": "COVID, Ukraine war, trump tariffs, shits a rollercoaster!",
                  "score": 1,
                  "created_utc": 1735341767.0,
                  "replies": []
                },
                {
                  "id": "m47vb8s",
                  "author": "DiaperFluid",
                  "body": "People keep paying, so they havent even found their upper limit lmao.",
                  "score": 1,
                  "created_utc": 1735406536.0,
                  "replies": []
                },
                {
                  "id": "m4139mx",
                  "author": "Corgi_Koala",
                  "body": "Yeah, it really does suck. It really doesn't help that there are only two other players in the GPU market but neither have done a good job of competing at the high end. So consumers don't have much choice to actually Drive the price down besides straight up not buying them.",
                  "score": 1,
                  "created_utc": 1735306707.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m41rf7h",
              "author": "None",
              "body": "[deleted]",
              "score": 18,
              "created_utc": 1735315656.0,
              "replies": [
                {
                  "id": "m42p7id",
                  "author": "Amiiboid",
                  "body": "> Miners buying all the cards caused artificial scarcity,\n\nHow is it artificial when the available supply is actually being decreased?",
                  "score": 5,
                  "created_utc": 1735326451.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m418i5b",
              "author": "cursedfan",
              "body": "Anything else would upset Wall Street",
              "score": 2,
              "created_utc": 1735308900.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m40wijq",
          "author": "Jonpg31",
          "body": "And people will still buy, it’s crazy.",
          "score": 7,
          "created_utc": 1735303564.0,
          "replies": [
            {
              "id": "m426jwj",
              "author": "InclinationCompass",
              "body": "In a free market, businesses will charge whatever people are willing to pay. The only way to drive prices down is to lower demand or increase supply.",
              "score": 4,
              "created_utc": 1735320542.0,
              "replies": [
                {
                  "id": "m42b4qo",
                  "author": "JacksAgain",
                  "body": "Sell me this pen...",
                  "score": 2,
                  "created_utc": 1735321991.0,
                  "replies": [
                    {
                      "id": "m42b7xu",
                      "author": "InclinationCompass",
                      "body": "Ive got nothing for sale",
                      "score": 1,
                      "created_utc": 1735322019.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41ur4x",
              "author": "real-bebsi",
              "body": "My PC is old, I want a top of the line card with lots of Vram. The 5090 is basically all I got and if they're the only company making high end products they're going to charge high end monopoly prices. \n\nAMD or Intel need to make competitive cards to fix the situation, you can't blame consumers for buying from a monopoly when it's, you know, a monopoly.",
              "score": 2,
              "created_utc": 1735316750.0,
              "replies": [
                {
                  "id": "m43pq4t",
                  "author": "jeha4421",
                  "body": "4080 Super or 4090 will be fine for the next 5 years.",
                  "score": 1,
                  "created_utc": 1735338368.0,
                  "replies": [
                    {
                      "id": "m43r5a2",
                      "author": "real-bebsi",
                      "body": "I wouldn't say sub-20GB vram is a guaranteed future proof",
                      "score": 0,
                      "created_utc": 1735338855.0,
                      "replies": [
                        {
                          "id": "m43rib7",
                          "author": "jeha4421",
                          "body": "I would.\n\nUnless you really must play every game on the highest ultra settings at the highest frame rate at the highest resolution. But tons of games have plateued their requiremenets, plus tons of AA and indie games that don't require more than a 30x series card.\n\nBlack Ops 6, for instance, says a 960 is the minimum specs and that is a card that came put 9 years ago.",
                          "score": 1,
                          "created_utc": 1735338979.0,
                          "replies": [
                            {
                              "id": "m43s7j4",
                              "author": "real-bebsi",
                              "body": "Spending the cash to get a XX90 series card to turn around and be forced to play games at medium or low settings within a year or so is like spending the money to buy a porsche with the expectation that you'll be limited to 30mph after a few years",
                              "score": 0,
                              "created_utc": 1735339218.0,
                              "replies": [
                                {
                                  "id": "m43sfqz",
                                  "author": "jeha4421",
                                  "body": "Your not going to be playing at low to medium settimgs in a year, that's wildly unrealistic.\n\nLook at games that come out recently and look at what cards can run them at ultra. Most cards are years old and still hold up.",
                                  "score": 3,
                                  "created_utc": 1735339297.0,
                                  "replies": [
                                    {
                                      "id": "m43tezm",
                                      "author": "real-bebsi",
                                      "body": "What's the Vram cost of newer games trending?",
                                      "score": 1,
                                      "created_utc": 1735339636.0,
                                      "replies": [
                                        {
                                          "id": "m43tk6f",
                                          "author": "jeha4421",
                                          "body": "Up, slowly.\n\nAnd that's only the top AAA games, which are becoming less and less worth it to buy.",
                                          "score": 3,
                                          "created_utc": 1735339686.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m6alpkg",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 0,
                          "created_utc": 1736458135.0,
                          "replies": [
                            {
                              "id": "m6anrnt",
                              "author": "real-bebsi",
                              "body": "But then I'd have a used computer part in my PC",
                              "score": 0,
                              "created_utc": 1736458742.0,
                              "replies": [
                                {
                                  "id": "m6ap2yn",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 0,
                                  "created_utc": 1736459129.0,
                                  "replies": [
                                    {
                                      "id": "m6auwz3",
                                      "author": "real-bebsi",
                                      "body": "I don't know what the people before me used that shit for. There's no PC part odometer. \n\nI'm not spending money on a part that's likely fried and has no warranties",
                                      "score": 0,
                                      "created_utc": 1736460882.0,
                                      "replies": [
                                        {
                                          "id": "m6b22cn",
                                          "author": "None",
                                          "body": "[deleted]",
                                          "score": 0,
                                          "created_utc": 1736463123.0,
                                          "replies": [
                                            {
                                              "id": "m6b2o8y",
                                              "author": "real-bebsi",
                                              "body": "Bro thinks PC parts don't experience wear and tear or degradation 💀",
                                              "score": 1,
                                              "created_utc": 1736463318.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m40xyce",
              "author": "Curse3242",
              "body": "Million Dollar PC builds night be the new YouTube trend",
              "score": -3,
              "created_utc": 1735304284.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m44u7yi",
          "author": "Jaerba",
          "body": "Just so people are aware, it does cost money to hold inventory like this so the price will go up regardless.  But they'll probably still increase it beyond that.",
          "score": 1,
          "created_utc": 1735353333.0,
          "replies": []
        },
        {
          "id": "m45n9lu",
          "author": "Eurynom0s",
          "body": "The second a single tariff goes through, every industry is going to start jacking up their prices and blaming tariffs, even if all of their inputs are purely domestic. It's going to be the new \"supply chain reasons\" but we're gonna skip past the part where it's actually initially mostly true.",
          "score": 1,
          "created_utc": 1735366286.0,
          "replies": []
        },
        {
          "id": "m4416zr",
          "author": "Iustis",
          "body": "I mean, that’s the point.  They are tying up capital now on a bet the tariffs go through.  If the bet pays off they make a profit—if the bet doesn’t they lose some amount + tied up capital they could have otherwise used",
          "score": 1,
          "created_utc": 1735342416.0,
          "replies": []
        },
        {
          "id": "m41ws2d",
          "author": "Firecracker048",
          "body": "They are just gonna use traffis as this generations high price excuse",
          "score": 0,
          "created_utc": 1735317406.0,
          "replies": []
        },
        {
          "id": "m419n5u",
          "author": "slight_digression",
          "body": "That is the idea. Buy at 100% of present price, tariffs of 40% hit, sell at (least at) 140% of present price and blame tariffs. Good profit.",
          "score": -1,
          "created_utc": 1735309354.0,
          "replies": []
        },
        {
          "id": "m41ulo5",
          "author": "ChafterMies",
          "body": "Of course. But instead of the government getting the 40% increase, Nvidia and AMD get it.",
          "score": -1,
          "created_utc": 1735316701.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m418l8i",
      "author": "AlphaTangoFoxtrt",
      "body": "Stockpile now, and sell after the tariffs hit at higher prices.",
      "score": 59,
      "created_utc": 1735308934.0,
      "replies": []
    },
    {
      "id": "m40ze1r",
      "author": "Madmandocv1",
      "body": "I checked with some wealthy people. They say they have a lot of money so they aren’t bothered by the increased costs due to tariffs. I just wanted you all to know, so you didn’t worry.",
      "score": 580,
      "created_utc": 1735304971.0,
      "replies": [
        {
          "id": "m41ghgn",
          "author": "franker",
          "body": "I just look at it like every PC is going to cost like one of those alienware gaming rigs you used to laugh at.",
          "score": 102,
          "created_utc": 1735311930.0,
          "replies": [
            {
              "id": "m42c5ok",
              "author": "Jbidz",
              "body": "$5000 gaming rig, equipped with a 4060 and 500w power supply, 1 stick of 16 gb ram",
              "score": 57,
              "created_utc": 1735322311.0,
              "replies": [
                {
                  "id": "m42ds0u",
                  "author": "franker",
                  "body": "yeah but those neon light thingies make it all worthwhile /s",
                  "score": 5,
                  "created_utc": 1735322819.0,
                  "replies": [
                    {
                      "id": "m43gl5y",
                      "author": "BipedalWurm",
                      "body": "They came with my case and the color coordinates with my cpu temp, it makes me feel clever!",
                      "score": 1,
                      "created_utc": 1735335329.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m42r62h",
                  "author": "Taki_Minase",
                  "body": "RAM is cheap in my country.  It's really only GPU that are rip-off",
                  "score": 1,
                  "created_utc": 1735327072.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m447ws2",
              "author": "Advanced-Blackberry",
              "body": "I got a decent Alienware deal for my golf sim. 14700, 4070ti super, 16gb ddr5. 1tb nvme. I’ll upgrade the ram when I need to but haven’t needed it yet .   A bit of a premium but $1699 last spring wasn’t that bad at all compared to others.  And I didnt feel like building my own again. ",
              "score": 8,
              "created_utc": 1735344882.0,
              "replies": [
                {
                  "id": "m448zkz",
                  "author": "franker",
                  "body": "I'm GenX so I remember a PC game called Golden Bear Challenge in the nineties.  You could download courses that other people made, and I had hundreds of them on floppy disks :)",
                  "score": 3,
                  "created_utc": 1735345270.0,
                  "replies": [
                    {
                      "id": "m44z34u",
                      "author": "Advanced-Blackberry",
                      "body": "I remember that. And I remember Jack Nicklaus golf on my 286. Had a decoder ring !",
                      "score": 2,
                      "created_utc": 1735355278.0,
                      "replies": [
                        {
                          "id": "m478tly",
                          "author": "franker",
                          "body": "I had Jack Nicklaus for the Commodore 64, and even bought one of the expansion floppy disks for extra courses.  I still have the box ;)  What golf sim do you play now?  Are there any good ones that let you design your own courses?",
                          "score": 1,
                          "created_utc": 1735398834.0,
                          "replies": [
                            {
                              "id": "m47e712",
                              "author": "Advanced-Blackberry",
                              "body": "I have a Uneekor launch monitor and mostly just hit the range in that. I have GSPro when I want to play a round (rarely) and there are ways to create a custom course but I haven’t messed with it, seems way too complicated. Mainly I just use it for practice unless friends are over ",
                              "score": 1,
                              "created_utc": 1735400784.0,
                              "replies": [
                                {
                                  "id": "m47fvcl",
                                  "author": "franker",
                                  "body": "Wow I'd never heard of that stuff.  Have you tried VR golf?",
                                  "score": 1,
                                  "created_utc": 1735401372.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4fmejw",
                  "author": "CreaminFreeman",
                  "body": "I would upgrade the RAM right now. If you’re really going to do at all I very much think now would be the time. Not unreasonably priced at the moment and you can bet they’re about to go way up.",
                  "score": 1,
                  "created_utc": 1735514202.0,
                  "replies": [
                    {
                      "id": "m4g7ice",
                      "author": "Advanced-Blackberry",
                      "body": "Thought about it but looking at resource utilization it’s never been over 60%",
                      "score": 2,
                      "created_utc": 1735521322.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m45byo2",
                  "author": "retro_slouch",
                  "body": "> I got a decent Alienware deal for my golf sim.\n\nChecked with one of the wealthy people, it's all good don't worry everyone.",
                  "score": 0,
                  "created_utc": 1735360756.0,
                  "replies": [
                    {
                      "id": "m45cc79",
                      "author": "Advanced-Blackberry",
                      "body": "What would your expected price be for a prebuilt computer with those specs in spring 2024?  Even today prices are around that , so yeah relatively speaking it was a good deal ",
                      "score": 1,
                      "created_utc": 1735360927.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m42mav1",
              "author": "None",
              "body": "A lot of people are no doubt gonna be driving to Mexico and Canada for some expensive ass shopping trips.",
              "score": 9,
              "created_utc": 1735325523.0,
              "replies": [
                {
                  "id": "m42p0ay",
                  "author": "agentfrogger",
                  "body": "PC parts are already way more expensive down here in Mexico, so idk if that'll actually help lol",
                  "score": 12,
                  "created_utc": 1735326387.0,
                  "replies": [
                    {
                      "id": "m42uhx6",
                      "author": "BaconatedGrapefruit",
                      "body": "Ditto for Canada, and we usually get allocated less stock.\n\nWith the strong American dollar it may be worth it if you live beside the border.\n\nThat being said, we won’t get hit with the tariffs but we will see a price increase to keep us in tandem with the American market.",
                      "score": 4,
                      "created_utc": 1735328137.0,
                      "replies": [
                        {
                          "id": "m44d97b",
                          "author": "Radulno",
                          "body": "Yeah here in Europe. 2000-2500 euros was the price of the XX90 since a few generations anyway. I wonder if it'll be the same or they'll still add the \"Europe price increase\" on top of the now higher US price.",
                          "score": 4,
                          "created_utc": 1735346820.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m42mmr9",
                  "author": "franker",
                  "body": "or financing computer purchases as if they're cars.",
                  "score": 1,
                  "created_utc": 1735325628.0,
                  "replies": [
                    {
                      "id": "m42o7ls",
                      "author": "None",
                      "body": "People definitely already do that, I've even heard of people using buy now pay later services for pizza delivery.",
                      "score": 3,
                      "created_utc": 1735326131.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m468c7l",
              "author": "IIlIIlIIlIlIIlIIlIIl",
              "body": "I remember the days that with some good allocation of funds you could buy a high-end PC with an i7 X700K (best at the time aside from the i9s) and an Nvidia XX80 for only $1,200.\n\nCPU prices have stayed reasonable, but  motherboards and PSUs have doubled in price, and GPUs have quadrupled.",
              "score": 1,
              "created_utc": 1735379462.0,
              "replies": [
                {
                  "id": "m474153",
                  "author": "franker",
                  "body": "I'm one of those people who just buys new and expensive, and then spends years running it into the ground before I buy a new version.  Currently I have a 15-year-old Windows 7 laptop that somehow keeps chugging along, backed up on flash drives, lol.  I figure it'll be fun going from that to one of those desktop computers that runs the 5000 AI card or whatever it's called ;)",
                  "score": 1,
                  "created_utc": 1735396974.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m41x14j",
          "author": "tbx5959",
          "body": "I checked with some poor people, paycheck to paycheck people and middle class folks and they said they have no money but they aren't bothered by the increased costs due to tariffs because bathrooms or something",
          "score": 32,
          "created_utc": 1735317488.0,
          "replies": [
            {
              "id": "m435h70",
              "author": "getoutofheretaffer",
              "body": "The cost will be offset by the money we save on surgeries for transgender illegal immigrant prisoners.",
              "score": 17,
              "created_utc": 1735331702.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4132vv",
          "author": "Shivaess",
          "body": "I also know people who are buying ahead this holiday season to try and mitigate the impact. The reality is that the tariffs (if enacted) will cause double digit inflation. That’ll hit everyone eventually.",
          "score": 31,
          "created_utc": 1735306628.0,
          "replies": [
            {
              "id": "m416szg",
              "author": "None",
              "body": "[removed]",
              "score": 67,
              "created_utc": 1735308206.0,
              "replies": [
                {
                  "id": "m41pqcn",
                  "author": "TymedOut",
                  "body": "The leopards are feasting, and my empathy well is still dry as a bone.",
                  "score": 33,
                  "created_utc": 1735315092.0,
                  "replies": []
                },
                {
                  "id": "m41pnv1",
                  "author": "I_just_made",
                  "body": "The problem is that there will be a lot of people who did NOT vote for him that will be highly impacted by these increases. It will not just be impoverished MAGA that will be affected.",
                  "score": 19,
                  "created_utc": 1735315069.0,
                  "replies": [
                    {
                      "id": "m41rojr",
                      "author": "Madmandocv1",
                      "body": "Definitely. I’m angry about what the Trump voters did to those people. But it’s a democracy an did you stay here then you get what the majority wants. Everyone is stuck in the same car. If 3 of the 5 passengers want to drive over a cliff, the rational two go down with them.",
                      "score": 24,
                      "created_utc": 1735315742.0,
                      "replies": [
                        {
                          "id": "m42ovlh",
                          "author": "blither86",
                          "body": "So many people didn't vote, hopefully his idiocy will make a few more people realise how important it is.",
                          "score": 9,
                          "created_utc": 1735326345.0,
                          "replies": []
                        },
                        {
                          "id": "m42d1qq",
                          "author": "Errant_coursir",
                          "body": "Yep. If they didn't want it then they should've voted",
                          "score": 8,
                          "created_utc": 1735322589.0,
                          "replies": [
                            {
                              "id": "m43qah0",
                              "author": "jeha4421",
                              "body": "His point is that even if the 2 voted, they are still overruled and off the cliff they go. That's the price of democracy.",
                              "score": 2,
                              "created_utc": 1735338562.0,
                              "replies": [
                                {
                                  "id": "m444qo3",
                                  "author": "Errant_coursir",
                                  "body": "That's when someone sane takes control of the wheel",
                                  "score": -1,
                                  "created_utc": 1735343716.0,
                                  "replies": [
                                    {
                                      "id": "m456ufr",
                                      "author": "theturban",
                                      "body": "Thats how you get a Jan 6th again",
                                      "score": 3,
                                      "created_utc": 1735358490.0,
                                      "replies": [
                                        {
                                          "id": "m48tt3j",
                                          "author": "Errant_coursir",
                                          "body": "Yeah, unfortunately",
                                          "score": 1,
                                          "created_utc": 1735417789.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m45njq1",
                  "author": "Eurynom0s",
                  "body": "The only place I ever saw $8-$9 dozens of eggs as the only options were the stores owned by the mega chains like Albertsons. Trader Joe's and Whole Foods always had at least one $3 option even in the worst of it. Availability of those were somewhat spotty but you could get them more often than not. It was so transparently greedflation.",
                  "score": 1,
                  "created_utc": 1735366433.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m430qyh",
              "author": "iowajosh",
              "body": "Tariffs would at least replace tax revenue compared to the  inflation of the last few years.",
              "score": -1,
              "created_utc": 1735330163.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41e8rh",
          "author": "noeagle77",
          "body": "I know some pretty broke people who are absolutely terrified of the tariffs and the next four years. \n\nIt’s me. I’m people. 😭",
          "score": 15,
          "created_utc": 1735311117.0,
          "replies": [
            {
              "id": "m42d4rf",
              "author": "Errant_coursir",
              "body": "Who'd you vote for",
              "score": -7,
              "created_utc": 1735322616.0,
              "replies": [
                {
                  "id": "m42qcqe",
                  "author": "Secure_Weird4244",
                  "body": "Probably not the tariff guy",
                  "score": 7,
                  "created_utc": 1735326814.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m416fn6",
          "author": "TehOwn",
          "body": "Are the billionaires okay?",
          "score": 7,
          "created_utc": 1735308052.0,
          "replies": [
            {
              "id": "m43wlp9",
              "author": "TotoCocoAndBeaks",
              "body": "Oh yeah, doing alright. We had to hire some guys to figure out the best way to exploit people during the threatened tariffs.",
              "score": 7,
              "created_utc": 1735340750.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m441cw4",
          "author": "projektako",
          "body": "Also they're going to make another mound of money from AI and cloud chips so again Nvidia will not lower their pricing for consumer class stuff.",
          "score": 1,
          "created_utc": 1735342476.0,
          "replies": []
        },
        {
          "id": "m44upuf",
          "author": "Jaerba",
          "body": "Hey, I'm a wealthy person.  I'm bothered about what's coming but I'm also tired of sticking my neck out for people who spit back in my face.\n\n\nWe told everyone what's coming.  I explained it using basic microeconomics 101 supply/demand curves.  My fellow Americans decided they didn't care to learn or understand, so now we're all fucked. \n\n\nAll I can do is protect my people, and hope that plurality of Americans who voted for this get fucked the hardest.",
          "score": 0,
          "created_utc": 1735353533.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m415x9u",
      "author": "thehardway71",
      "body": "God! I really wish I could’ve used my vote in a political election towards a candidate that didn’t *explicitly* say he would tariff every country we trade with and increase the price of nearly every product on the market for my country when we already are experiencing high prices…I just wish this was preventable.",
      "score": 118,
      "created_utc": 1735307839.0,
      "replies": [
        {
          "id": "m45k25i",
          "author": "DoorFacethe3rd",
          "body": " ..if only.. ¯\\\\_(ツ)_/¯",
          "score": 7,
          "created_utc": 1735364606.0,
          "replies": []
        },
        {
          "id": "m489k0o",
          "author": "gophergun",
          "body": "Same here, unfortunately my vote was in one of the 43 states that weren't relevant.",
          "score": 5,
          "created_utc": 1735411163.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41otvo",
      "author": "Original-Material301",
      "body": "Well, fucking hell.\n\nCovid, then mining, scalpers, then high prices became the norm anyway and now it's going to be even higher?\n\nFfs",
      "score": 20,
      "created_utc": 1735314791.0,
      "replies": []
    },
    {
      "id": "m40w09t",
      "author": "Macabre215",
      "body": "Spending that $800 on a 4070ti super earlier this year is looking like a good investment.",
      "score": 107,
      "created_utc": 1735303302.0,
      "replies": [
        {
          "id": "m40wg53",
          "author": "gg06civicsi",
          "body": "I did this but will probably regret not footing the extra $200 for a 4080 S",
          "score": 38,
          "created_utc": 1735303530.0,
          "replies": [
            {
              "id": "m40y5lh",
              "author": "Macabre215",
              "body": "I would have gone for that upgrade at the time, but the 4080S was all sold out and was being scalped like crazy.",
              "score": 12,
              "created_utc": 1735304382.0,
              "replies": [
                {
                  "id": "m4106xv",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1735305343.0,
                  "replies": [
                    {
                      "id": "m45nt5d",
                      "author": "Eurynom0s",
                      "body": "If these tariffs and people crying tariffs hit hard enough you'll probably be able to sell the 4080S for a profit while still selling below the new going rate.",
                      "score": 1,
                      "created_utc": 1735366572.0,
                      "replies": []
                    },
                    {
                      "id": "m49wmvv",
                      "author": "michiganbears",
                      "body": "Ive been waiting on the 4070ti super to get back in stock, is it worth getting the 4080s instead?",
                      "score": 1,
                      "created_utc": 1735430991.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4j27sf",
                  "author": "TheBroWhoLifts",
                  "body": "Still is. I had to end up going through a scalper to get my 4070ti Super White OC. However, I believe it will hold its value for a while even when (if?) next gen lines come out because I bet they'll be unavailable and expensive as fuck because of scalpers and tarrifs.",
                  "score": 1,
                  "created_utc": 1735570289.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m40xspu",
              "author": "smaguss",
              "body": "Bought a 4070ti and my plan is the same as it always is.\n\nAftermarket cooler and conservative overclocking as needed. \n\nOh well, this rig should last well over 4 years.",
              "score": 10,
              "created_utc": 1735304206.0,
              "replies": [
                {
                  "id": "m41rf2j",
                  "author": "elyv297",
                  "body": "my 1080ti is starting to show its age and its like 7 years old 4 years is nothing",
                  "score": 16,
                  "created_utc": 1735315655.0,
                  "replies": [
                    {
                      "id": "m42ewc0",
                      "author": "SpaceBoJangles",
                      "body": "Yes, but the 1080Ti was a once in a generation deal. Way more VRAM than it had any right having, ridiculous Raster performance, and power draw efficiency we wouldn’t see again for a long time. Truly one of the greatest pieces of electronics ever produced for consumers and unchallenged by anything since. This is coming from someone invested in a 4080 by the way, so I’m hoping my 4080 survives through GTA 6.",
                      "score": 7,
                      "created_utc": 1735323173.0,
                      "replies": [
                        {
                          "id": "m42q0k5",
                          "author": "Deranged_Kitsune",
                          "body": "Agreed. Probably the greatest gaming card of all time when measuring for lifetime as a top-performer. Still runs current-gen stuff very respectably, just without all the shiny bells and whistles like RTX.",
                          "score": 6,
                          "created_utc": 1735326706.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m41uy5e",
                      "author": "smaguss",
                      "body": "Of course, and so goes the tradition of stepping the old rigs down to some other use often things like a media center in my case.\n\n\nThe older rig with my 1080 was in my old rig that runs a lot of home automation and security cameras and storage.\nMedia storage however has been taken over by a large NAS rig and a Plex server.",
                      "score": 0,
                      "created_utc": 1735316814.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m45zyux",
              "author": "SoulOfTheDragon",
              "body": "Eh, so far amazing card and for me the memory bump was most important, of which 4080 S has the same amount of.",
              "score": 1,
              "created_utc": 1735373842.0,
              "replies": []
            },
            {
              "id": "m41a8ro",
              "author": "Mastermachetier",
              "body": "I bought the ti super and then returned it for the 4080 S cuz of fomo .. if you are not doing VR you’ll be fine in 99% of things 75% of things in VR !",
              "score": 1,
              "created_utc": 1735309591.0,
              "replies": [
                {
                  "id": "m42nuf9",
                  "author": "psychophant_",
                  "body": "The 4070 ti Super supports VR gaming tho?\n\nWhat do you know that i don’t?  I just bought one for $651 (taxes included!) on amazon. Only reason i went with that vs the 4080.",
                  "score": 1,
                  "created_utc": 1735326014.0,
                  "replies": [
                    {
                      "id": "m4306m9",
                      "author": "Mastermachetier",
                      "body": "Nothing wrong with it ! If you read my comment is that it can max 75% of things in VR.",
                      "score": 1,
                      "created_utc": 1735329980.0,
                      "replies": [
                        {
                          "id": "m4316yx",
                          "author": "psychophant_",
                          "body": "What would you reckon is the 25% of VR I won’t be able to enjoy?  I’ve never gamed in VR as this is my first good PC build, however i was looking forward to MAYBE playing around with it once i get a spare $500 for a headset (laughs in poor)",
                          "score": 1,
                          "created_utc": 1735330307.0,
                          "replies": [
                            {
                              "id": "m4333bj",
                              "author": "Mastermachetier",
                              "body": "I think you'll be able to enjoy everything pretty much , just at a \"compromised\" experience. Even the 4080s struggles with msfs2024 for instance, but I was able to run it on the 4070 super ti and still have fun.",
                              "score": 1,
                              "created_utc": 1735330923.0,
                              "replies": [
                                {
                                  "id": "m433bmi",
                                  "author": "psychophant_",
                                  "body": "Cool thanks for the information, I appreciate it!",
                                  "score": 1,
                                  "created_utc": 1735331000.0,
                                  "replies": [
                                    {
                                      "id": "m433idp",
                                      "author": "Mastermachetier",
                                      "body": "No worries have fun ! Play alyx",
                                      "score": 1,
                                      "created_utc": 1735331061.0,
                                      "replies": [
                                        {
                                          "id": "m433tr2",
                                          "author": "psychophant_",
                                          "body": "YES. Already on my steam wishlist ;)",
                                          "score": 1,
                                          "created_utc": 1735331162.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m41vkon",
          "author": "ChafterMies",
          "body": "I tell people that if they want to buy something in the next year, buy it before January 20th. Otherwise they should be prepared to wait until 2029.",
          "score": 4,
          "created_utc": 1735317017.0,
          "replies": []
        },
        {
          "id": "m40zhsr",
          "author": "Relikar",
          "body": "I paid $950 CAD for a LC 4080 last year, gonna ride that thing for a few years I think.",
          "score": 2,
          "created_utc": 1735305021.0,
          "replies": []
        },
        {
          "id": "m43790x",
          "author": "None",
          "body": "Found a great Black Friday deal for a 4070 ti super for $680. Upgraded the whole rig with this fear in mind.",
          "score": 1,
          "created_utc": 1735332284.0,
          "replies": []
        },
        {
          "id": "m43idj5",
          "author": "Gentleman-Bird",
          "body": "Got one yesterday, the computer store was selling out of everything because of holidays and tariffs",
          "score": 1,
          "created_utc": 1735335916.0,
          "replies": []
        },
        {
          "id": "m45sgpr",
          "author": "Nagemasu",
          "body": "That's painful to read. It's even more painful when you realise it's $800*usd* and not my local currency. Thinking I might go find a secondhand 3080 or 4060 to go along with my new 1440p monitor tbh even though I really don't want to upgrade.",
          "score": 1,
          "created_utc": 1735369147.0,
          "replies": []
        },
        {
          "id": "m4ezlcg",
          "author": "Tasera",
          "body": "I paid like $550. Guess that's even better.",
          "score": 1,
          "created_utc": 1735506917.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m40usy2",
      "author": "norse95",
      "body": "I bought a new pc a month ago for this reason. I needed an upgrade anyway",
      "score": 13,
      "created_utc": 1735302665.0,
      "replies": []
    },
    {
      "id": "m40ujxw",
      "author": "Superseaslug",
      "body": "Yeah we're basically gonna be SOL on new PCs for 4 years.",
      "score": 188,
      "created_utc": 1735302530.0,
      "replies": [
        {
          "id": "m40v6qu",
          "author": "Lari-Fari",
          "body": "Just 4?",
          "score": 78,
          "created_utc": 1735302873.0,
          "replies": [
            {
              "id": "m40vmgr",
              "author": "anengineerandacat",
              "body": "Easiest win the next candidate ever if they do actually decide to move forward with the tariffs.\n\n\"Hey, I am going to slash prices by 40% for the things you love and enjoy\".\n\nThere are intelligent ways to create and utilize tariffs but the plan laid out today isn't that.",
              "score": 108,
              "created_utc": 1735303102.0,
              "replies": [
                {
                  "id": "m419wt3",
                  "author": "Deceptiveideas",
                  "body": ">easiest win\n\nTrump was openly flaunting tariffs and people warned about price increases. There already was a choice that said tariffs are a bad idea and would hurt working americans.\n\nIn this modern political landscape, I wouldn’t be so sure.",
                  "score": 25,
                  "created_utc": 1735309461.0,
                  "replies": [
                    {
                      "id": "m45v3h3",
                      "author": "Nagemasu",
                      "body": "Trump took advantage of the fact most people had no idea how tariffs worked. They won't be so ignorant next election when someone is promoting tariffs.",
                      "score": 3,
                      "created_utc": 1735370719.0,
                      "replies": [
                        {
                          "id": "m471fkp",
                          "author": "DaSemicolon",
                          "body": "Think you underestimate our stupidity\n\nWe voted for this after the stupidity of his first term",
                          "score": 5,
                          "created_utc": 1735395897.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m40yxmd",
                  "author": "IpsoKinetikon",
                  "body": "Doubt it would be an easy win. Some people will vote right no matter what because of all the bullshit they hear online, some folks on the left simply won't vote because of one particular thing they don't like about dems, even if republicans are far worse on that same issue.",
                  "score": 102,
                  "created_utc": 1735304755.0,
                  "replies": [
                    {
                      "id": "m41ck7s",
                      "author": "Optimus_Prime_Day",
                      "body": "Yep, and remember that Trump didn't win because he got more votes than before. He won because the left didn't come out to vote. The campaign to make left voters uneasy or unsure about who they wanted to vote for worked in that people didn't want to vote for either, so they just didn't vote, and that got him in. It's likely the next vote, the right will get about the same again so it's up to the left to actually show up this time.",
                      "score": 19,
                      "created_utc": 1735310488.0,
                      "replies": [
                        {
                          "id": "m41umz7",
                          "author": "Haltheleon",
                          "body": "I say this as a leftist who voted for Kamala Harris: there aren't enough actual leftists in this country to swing an election that hard. Leftists weren't the ones who secured Joe Biden's win in 2020, and they weren't what made the difference in 2024. Unless by \"the left\" you just mean the usual Democratic base, which is primarily comprised of liberals. \n\nDems need to stop sprinting to the right during general elections. Harris somehow won over fewer registered Republican voters than Biden did in 2020. Her strategy of campaigning with people like Liz Cheney -- a person who is hated by the right for being a \"RINO\" and the left for being, well, Liz Cheney -- was evidently uninspiring to both Republican and Democratic voters.\n\nI'm not saying the Dems need to run a socialist, much as I personally would be for it, but they need to stop trying to pander to the cult of Donald Trump rather than appealing to their own base. Blaming voters for not showing up is only half the story. We have to focus on *why* people were unmotivated to turn out for Democrats this time around. \n\nThat lack of interest was probably a combination of A) people forgetting how bad Trump was the first time around, B) legitimate complaints about inflation and stagnating wages (which, to be fair, is not entirely Biden's fault, but the incumbent will suffer when the economy feels like shit even if GDP is fine), and C) a lack of any sort of inspiring message beyond \"I'll be better than that guy.\"\n\nAgain, I voted for her, don't shoot the messenger here. I'm just saying that running to the right inherently alienates part of the Dems' own base every election cycle, and it's clearly not a strategy that works anymore. They need to do a better job of appealing to their own base and working to get them to turn out and vote.",
                          "score": 18,
                          "created_utc": 1735316713.0,
                          "replies": [
                            {
                              "id": "m42qalu",
                              "author": "Amiiboid",
                              "body": "> a lack of any sort of inspiring message beyond \"I'll be better than that guy.\"\n\nShe actually had a really solid message and blanketed the airwaves in swing states. There are a lot of people who won’t even *consider* voting for a woman, and so never heard her message.",
                              "score": 13,
                              "created_utc": 1735326795.0,
                              "replies": [
                                {
                                  "id": "m42tia7",
                                  "author": "None",
                                  "body": "[removed]",
                                  "score": 0,
                                  "created_utc": 1735327819.0,
                                  "replies": [
                                    {
                                      "id": "m433269",
                                      "author": "Amiiboid",
                                      "body": "This is kind of a weird rebuttal since \"Nothing will fundamentally change\" was something Biden said in 2019, not something Harris said in 2024.\n\nShe articulated plenty of stuff to vote for. It's unfortunate that so many people were \"for some reason\" incapable of seeing it.",
                                      "score": 10,
                                      "created_utc": 1735330913.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m41x8ah",
                              "author": "Doctor4000",
                              "body": "Actually, Harris lost because she is a cackling dumbfuck. Voters \"didn't show up\" for her because it was obvious to literally everyone outside of the lost cause \"vote blue no matter who\" crowd that she would be a complete disaster (and as a side bonus plenty of people were angry that she was their forced candidate as she was never actually primaried).\n\n\nIts really not any more complicated than that.",
                              "score": -18,
                              "created_utc": 1735317552.0,
                              "replies": [
                                {
                                  "id": "m42111a",
                                  "author": "GEOFF224",
                                  "body": "A Trump supporter worried about the intelligence of a political candidate is certainly an interesting look.",
                                  "score": 14,
                                  "created_utc": 1735318770.0,
                                  "replies": [
                                    {
                                      "id": "m422vks",
                                      "author": "Doctor4000",
                                      "body": "Considering your side is literally too stupid to remember that Trump was already the President once and, prior to Covid, things were going pretty well you're really not in a position to speak.",
                                      "score": -18,
                                      "created_utc": 1735319364.0,
                                      "replies": [
                                        {
                                          "id": "m424kgc",
                                          "author": "GEOFF224",
                                          "body": "Well, for what it’s worth, this reply was about the quality level I was expecting. I have never claimed that Kamala was my first-choice candidate or that she has above-average intelligence. I just think anyone with a brain can see she is significantly smarter than Trump.",
                                          "score": 10,
                                          "created_utc": 1735319902.0,
                                          "replies": [
                                            {
                                              "id": "m4254gr",
                                              "author": "Doctor4000",
                                              "body": "You are literally incapable of interpreting reality correctly if you are unironically trying to claim that Kamala Harris is more intelligent than anyone.\n\n\nShe has been the Vice President for the last four years and has accomplished precisely dick. Any random idiot off of the street would have been a better Democratic candidate.",
                                              "score": -11,
                                              "created_utc": 1735320080.0,
                                              "replies": [
                                                {
                                                  "id": "m425l3p",
                                                  "author": "GEOFF224",
                                                  "body": "Once again, I am merely claiming that she is more intelligent than Trump. Unfortunately, it takes a baseline level of intelligence to accurately evaluate the intellect of others. Let’s leave it here, but I hope you have a good day :)",
                                                  "score": 7,
                                                  "created_utc": 1735320228.0,
                                                  "replies": [
                                                    {
                                                      "id": "m425ut2",
                                                      "author": "Doctor4000",
                                                      "body": "I'd agree with you, but then we'd both be wrong.",
                                                      "score": -5,
                                                      "created_utc": 1735320314.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m41sff2",
                          "author": "finalgear14",
                          "body": "The next vote? The what?",
                          "score": 0,
                          "created_utc": 1735315988.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m41hqjj",
                      "author": "Ezreol",
                      "body": "The amount of bullshit responses I hear when I drop studies and evidence and they go \"well that side has it too\" and I go show me if I don't know about it I wanna hear about it inform me like only one of us here can back up our points but I'm the one that's wrong or whatever.\n\n\nDem's want a perfect candidate and Republicans have too low a bar that I mean *gestures broadly* that those people aren't in the deepest darkest prisons. Why aren't we throwing the book at people that traffic children etc especially them who (it's bad regardless) should be held to a higher standard.",
                      "score": 8,
                      "created_utc": 1735312377.0,
                      "replies": []
                    },
                    {
                      "id": "m41d7cl",
                      "author": "VagueSomething",
                      "body": "Yep, they'll decide it is woke socialism or something to reduce prices so vote for worse conditions. And then lazy lefts will find a reason not to vote such as the candidate didn't acknowledge a tiny niche problem in the right way.\n\n\nThe damage will take much longer than 4 years to fix even if the next candidate is competent and doesn't belong in a nursing home. It could crash multiple industries and cause major stagnation in others. Even a blank cheque to support wouldn't be fast as a lot of the problems will become time to establish and restart lost productivity.",
                      "score": 3,
                      "created_utc": 1735310733.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4116hy",
                  "author": "American-Omar",
                  "body": "Prices never come down, the rule not the exception",
                  "score": 26,
                  "created_utc": 1735305792.0,
                  "replies": []
                },
                {
                  "id": "m414ve6",
                  "author": "alvenestthol",
                  "body": "Watch the next Republican promise that, and then still keep the tariffs anyway while lowering corporate taxes",
                  "score": 6,
                  "created_utc": 1735307395.0,
                  "replies": [
                    {
                      "id": "m418qtq",
                      "author": "anengineerandacat",
                      "body": "Anything is honestly possible nowadays based on the results of the last election; if you asked me if we would ever have a felon president I would have told you \"No way, no one is stupid enough to do that.\" yet here we are.",
                      "score": 2,
                      "created_utc": 1735308996.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m41942y",
                  "author": "AlphaTangoFoxtrt",
                  "body": "They'll come down like 20% and the companies will keep the extra margin.",
                  "score": 3,
                  "created_utc": 1735309144.0,
                  "replies": []
                },
                {
                  "id": "m40wlub",
                  "author": "ThisAfricanboy",
                  "body": "You must know something the vast majority of economists don't. Because they say that tarrifs are unabashedly bad.",
                  "score": 10,
                  "created_utc": 1735303611.0,
                  "replies": [
                    {
                      "id": "m40x9ct",
                      "author": "RocketMoped",
                      "body": "Unabashedly bad for the consumer*",
                      "score": 25,
                      "created_utc": 1735303938.0,
                      "replies": []
                    },
                    {
                      "id": "m40zpgk",
                      "author": "FunctionalFun",
                      "body": "Tariffs make things more expensive, that's a bad thing for the consumer.\n\nIf you're a nation that wants to ensure you have a permanent local supply of a specific essential good and your worker hours are \"worth\" more than foreign laborers, you have little option except to tariff imports or explicitly subsidize your own industries.\n\nOf course, this isn't the reason Trump is stanning tariffs, he believes a trade deficit is a bad thing in the same nature as the National deficit, he's actually clueless. Implementation of tariffs as Trump has talked about them would only help democrats win 2028.",
                      "score": 16,
                      "created_utc": 1735305119.0,
                      "replies": []
                    },
                    {
                      "id": "m40xkz0",
                      "author": "vau1tboy",
                      "body": "I think he said they are bad but would be good for whoever runs after Trump. That candidate says, \"I will cut prices by 40% on things you love,\" and that person would get elected. Easy win.",
                      "score": 1,
                      "created_utc": 1735304100.0,
                      "replies": [
                        {
                          "id": "m4140ks",
                          "author": "RABBLERABBLERABBI",
                          "body": "I am not an economist, but as I understand it tariffs are a very easy way to raise prices for the consumer, but bringing prices down requires trade deals and pacts, which is going to involve multilateral agreement between nations.\n\nIt's not as easy as just saying \"we're getting rid of these tariffs.\"",
                          "score": 1,
                          "created_utc": 1735307030.0,
                          "replies": []
                        },
                        {
                          "id": "m40xrfr",
                          "author": "Logical_Parameters",
                          "body": "It's cute that folks think Trump's leaving office while alive.",
                          "score": 0,
                          "created_utc": 1735304188.0,
                          "replies": [
                            {
                              "id": "m40yp1r",
                              "author": "IpsoKinetikon",
                              "body": "Doesn't matter to me if he leaves alive or in a body bag.",
                              "score": 7,
                              "created_utc": 1735304643.0,
                              "replies": [
                                {
                                  "id": "m40yup6",
                                  "author": "Logical_Parameters",
                                  "body": "It won't be a voluntary exit if 2021's any indication.",
                                  "score": 0,
                                  "created_utc": 1735304717.0,
                                  "replies": [
                                    {
                                      "id": "m40z6wf",
                                      "author": "IpsoKinetikon",
                                      "body": "It doesn't have to be voluntary. He'll be gone one way or another. \n\nActually I might enjoy seeing him resist and get dragged out, kicking and screaming about people eating the dogs.",
                                      "score": 1,
                                      "created_utc": 1735304878.0,
                                      "replies": [
                                        {
                                          "id": "m40zmqh",
                                          "author": "Logical_Parameters",
                                          "body": "By who? Who is going to drag him out when he refuses to allow a 2028 presidential election to be held?\n\nName the person/power in the GOP that has displayed an ability, courage and will to take The Don on head-first the past decade. Jeb Bush doesn't count.",
                                          "score": 10,
                                          "created_utc": 1735305084.0,
                                          "replies": [
                                            {
                                              "id": "m413zk8",
                                              "author": "TehOwn",
                                              "body": "Oh, he'll allow it to go ahead. He'll just copy Putin or Xi and have an \"election\" before declaring himself the winner with 120% of the vote. \n\nPretty easy to pull off considering that Project 2025 has a clearly stated goal of replacing every government position with republican loyalists.",
                                              "score": 4,
                                              "created_utc": 1735307017.0,
                                              "replies": [
                                                {
                                                  "id": "m4151u1",
                                                  "author": "Logical_Parameters",
                                                  "body": "\"President for Life, people are saying, lots of people are saying it.\"",
                                                  "score": 1,
                                                  "created_utc": 1735307471.0,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "m41000h",
                                              "author": "IpsoKinetikon",
                                              "body": "It doesn't need to be anyone from the GOP. The secret service has a duty to the constitution, not the president. \n\nI'll bet you a year's pay, he's not going to just refuse to leave office and actually get his way. That's absurd.",
                                              "score": -5,
                                              "created_utc": 1735305255.0,
                                              "replies": [
                                                {
                                                  "id": "m41040s",
                                                  "author": "Logical_Parameters",
                                                  "body": "The Secret Service that permanently deleted all cell phone communications from Jan. 6th, 2021, eh? The law and order that held The Don accountable the previous 4 years, eh?",
                                                  "score": 7,
                                                  "created_utc": 1735305306.0,
                                                  "replies": [
                                                    {
                                                      "id": "m4108ue",
                                                      "author": "IpsoKinetikon",
                                                      "body": "I'm not familiar with that conspiracy theory. I'm sure it's half true, but I'm also sure there's context you're leaving out, or not aware of.",
                                                      "score": -6,
                                                      "created_utc": 1735305367.0,
                                                      "replies": [
                                                        {
                                                          "id": "m410d67",
                                                          "author": "Logical_Parameters",
                                                          "body": "Or, did you ever consider that maybe your bias is clouding clear vision on this specific subject? Google \"1/6/21 and Secret Service\". Enjoy.\n\na simple nugget of truth in the chaos: [https://apnews.com/article/capitol-siege-technology-government-and-politics-e5ae94aff7544a7dc49b07ad21802d5a](https://apnews.com/article/capitol-siege-technology-government-and-politics-e5ae94aff7544a7dc49b07ad21802d5a)",
                                                          "score": 4,
                                                          "created_utc": 1735305423.0,
                                                          "replies": [
                                                            {
                                                              "id": "m411tjy",
                                                              "author": "IpsoKinetikon",
                                                              "body": "You didn't read your own link. Lol",
                                                              "score": 0,
                                                              "created_utc": 1735306078.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m4123bk",
                                                                  "author": "Logical_Parameters",
                                                                  "body": "You didn't research any further because the S.S. agents surrounding Trump in 1/6/21 deleted all text messages. Better to simply admit you don't care. Again, it's a bias issue. Have a nice one!",
                                                                  "score": 5,
                                                                  "created_utc": 1735306198.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "m412faw",
                                                                      "author": "IpsoKinetikon",
                                                                      "body": "Link says they were accused of it, but they deny it and there's no evidence provided. You're stressing yourself out with lies on the Internet. He's leaving office when the time comes, and when that happens I hope you'll remember this convo.",
                                                                      "score": 1,
                                                                      "created_utc": 1735306343.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "m412m0z",
                                                                          "author": "Logical_Parameters",
                                                                          "body": "You're not researching further for a reason. You condone the crooks entering office and don't want to admit it online. **No Secret Service text messages were ever produced for Jan. 5th-6th. 2021** to any of the committees and governing bodies requesting them -- an inconvenient truth you wish to dismiss.\n\n[https://www.reddit.com/r/Keep\\_Track/comments/w2t1zh/the\\_secret\\_service\\_deleted\\_jan\\_6\\_text\\_messages/](https://www.reddit.com/r/Keep_Track/comments/w2t1zh/the_secret_service_deleted_jan_6_text_messages/)",
                                                                          "score": 3,
                                                                          "created_utc": 1735306425.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "m41bc9d",
                                                                              "author": "13beano13",
                                                                              "body": "This is just he said she said stuff.  You’re one of those people who want others to provide sources to back up what they say, but don’t provide any thing to back up what you say.  It’s everyone else’s fault for not believing you because they refuse to do their own research.  Hypocritical it seems.  It seems logical the SS would wipe devices after each presidential term.  That would not automatically be proof there’s malicious intent and we don’t even know that’s what happened.",
                                                                              "score": -5,
                                                                              "created_utc": 1735310017.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "m41bn7l",
                                                                                  "author": "Logical_Parameters",
                                                                                  "body": "No, it isn't. The Secret Service failed to provide \\*required\\* official text message conversations from January 6th, 2021 to the OIG and House of Representatives committee investigating the sedition. ^(\\*Those are actions, not hearsay. Learn the difference or remain ignorant.) \n\nLong story short, it doesn't instill confidence they will remove Trump in January of 2029, capiche?",
                                                                                  "score": 3,
                                                                                  "created_utc": 1735310134.0,
                                                                                  "replies": []
                                                                                },
                                                                                {
                                                                                  "id": "m43tzb3",
                                                                                  "author": "IpsoKinetikon",
                                                                                  "body": "Ever since Traitor Trump won, The online left has been extra stupid. I saw just em in another thread screeching about someone eating too many eggs, and calling them a nazi. This is why we still lose elections to republicans.",
                                                                                  "score": 0,
                                                                                  "created_utc": 1735339829.0,
                                                                                  "replies": []
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            },
                                                            {
                                                              "id": "m41adlx",
                                                              "author": "13beano13",
                                                              "body": "Looks like your article contradicts your claim.",
                                                              "score": -3,
                                                              "created_utc": 1735309643.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m41anh7",
                                                                  "author": "Logical_Parameters",
                                                                  "body": "No text messages from 1/5 or 1/6 2021 were ever produced by the Secret Service. Care to explain?\n\n[https://www.reddit.com/r/Keep\\_Track/comments/w2t1zh/the\\_secret\\_service\\_deleted\\_jan\\_6\\_text\\_messages/](https://www.reddit.com/r/Keep_Track/comments/w2t1zh/the_secret_service_deleted_jan_6_text_messages/)",
                                                                  "score": 4,
                                                                  "created_utc": 1735309749.0,
                                                                  "replies": []
                                                                },
                                                                {
                                                                  "id": "m41hg1d",
                                                                  "author": "IpsoKinetikon",
                                                                  "body": "Yup, and the other one reads like a garden variety conspiracy theory. Buncha random factoids woven into an unproven narrative. Some people just work themselves up of nothing, when we've got real shit to worry about.",
                                                                  "score": -1,
                                                                  "created_utc": 1735312274.0,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m40z5me",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": -2,
                                      "created_utc": 1735304861.0,
                                      "replies": [
                                        {
                                          "id": "m40zbfo",
                                          "author": "Logical_Parameters",
                                          "body": "No, when he refused (still to this day) to concede losing the election and orchestrated a coup d'état against the U.S.\n\nWhen that same person serves a second term with no re-election campaign, why would he volunteer to leave? He controls the GOP via kompromat of their vices, too. They won't oppose him ruling as king until death.",
                                          "score": 2,
                                          "created_utc": 1735304938.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m414yaq",
                              "author": "Leopard__Messiah",
                              "body": "The GOP will have him declared Unfit as soon as they swap out Vance for whoever they want in the Oval Office. Just watch.",
                              "score": -1,
                              "created_utc": 1735307430.0,
                              "replies": [
                                {
                                  "id": "m41aupz",
                                  "author": "Logical_Parameters",
                                  "body": "Uh huh. Oh, I'll be watching *as it doesn't happen.* Teflon Don has chunks of guys like Vance in his stool samples.",
                                  "score": -1,
                                  "created_utc": 1735309827.0,
                                  "replies": [
                                    {
                                      "id": "m41eb5n",
                                      "author": "Leopard__Messiah",
                                      "body": "Sure. Fat old men with stressful jobs live forever.",
                                      "score": 1,
                                      "created_utc": 1735311141.0,
                                      "replies": [
                                        {
                                          "id": "m42ptfd",
                                          "author": "GhostReddit",
                                          "body": "It's only stressful if you're putting the work in. Trump didn't age much as president because he spent most of the time watching Fox News and tweeting.",
                                          "score": 2,
                                          "created_utc": 1735326643.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m41gqjc",
                                          "author": "Logical_Parameters",
                                          "body": "He's much much older and fatter than me and seems to have gotten by just fine since 2017 when assuming the toughest position in the world. If you read my comment history, I'm no fan of the man's, but the thought of JD Vance being a threat to his title is downright laughable. \n\nPrime Example #1:\n\n*Where's his previous VP?*  *Wonder what (almost) happened to that guy?*",
                                          "score": -2,
                                          "created_utc": 1735312021.0,
                                          "replies": [
                                            {
                                              "id": "m41lmli",
                                              "author": "Leopard__Messiah",
                                              "body": "Shocking no one, you entirely missed my point. \n\nVance isn't a threat. He's an opportunity to install the REAL candidate, who will take the office without ever having to run for it or receive a single vote. \n\nAnd it's been 7 years since it was 2017. Old people continue to get older, not better. Smarten up.",
                                              "score": 2,
                                              "created_utc": 1735313710.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m41efjn",
                      "author": "tomrichards8464",
                      "body": "Tariffs are sometimes good in the same way that it's sometimes good to defect in an iterated prisoner's dilemma. \n\n\nYes, we'd all be better off in dove world, but we don't live in dove world, so strategies which have suboptimal immediate outcomes are sometimes necessary to affect counterparty behaviour. \n\n\nFor a more obvious example of the same thing, wars are in a very meaningful sense always unabashedly bad, and from a global perspective military expenditure is pure deadweight loss. But it is in fact sometimes necessary to fight a war, and not spending any money on your military is unwise unless perhaps you have powerful, reliable allies who spend plenty on theirs, and a lot of distance between you and likely hostile actors.",
                      "score": 0,
                      "created_utc": 1735311185.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m41hpmy",
                  "author": "Sawses",
                  "body": "> There are intelligent ways to create and utilize tariffs but the plan laid out today isn't that.\n\nDid Trump provide details on that? I've been keeping an eye out but I haven't seen anything and Google is giving me a bunch of clickbait crap.",
                  "score": 1,
                  "created_utc": 1735312368.0,
                  "replies": []
                },
                {
                  "id": "m41n3l2",
                  "author": "Klaymen96",
                  "body": "You should know by now. Even if it's 100% a Republicans fault at least 80% of them will blame the dems",
                  "score": 1,
                  "created_utc": 1735314208.0,
                  "replies": []
                },
                {
                  "id": "m43czj5",
                  "author": "CalvinFragilistic",
                  "body": "That’s assuming we have an election",
                  "score": 1,
                  "created_utc": 1735334149.0,
                  "replies": []
                },
                {
                  "id": "m43gycx",
                  "author": "Deviathan",
                  "body": "Tariffs are sticky, definitely more than 4. Tariffs usually get counter-tariffed by the other country, meaning removal of Tariffs usually involves renegotiating trade deals entirely, they can last for far longer than the person who put them in.",
                  "score": 1,
                  "created_utc": 1735335449.0,
                  "replies": []
                },
                {
                  "id": "m43p55w",
                  "author": "red286",
                  "body": "haha \"next candidate\"",
                  "score": 1,
                  "created_utc": 1735338169.0,
                  "replies": []
                },
                {
                  "id": "m4j2jok",
                  "author": "TheBroWhoLifts",
                  "body": "Unfortunately, rescinding tarrifs ends up being far more complex and nuanced after they've been in effect for years. Markets will by then have stabilized and adjusted for the tarrifs (even though they're stupid, they still have to be adapted to), and it's not just a snap of the fingers and everything is cheaper again.",
                  "score": 1,
                  "created_utc": 1735570407.0,
                  "replies": []
                },
                {
                  "id": "m41r3y8",
                  "author": "None",
                  "body": "There is a significant portion of the electorate that thinks trans kids playing sports is a bigger problem than tariff induced inflation.",
                  "score": 1,
                  "created_utc": 1735315551.0,
                  "replies": []
                },
                {
                  "id": "m41abj3",
                  "author": "None",
                  "body": "[removed]",
                  "score": -3,
                  "created_utc": 1735309620.0,
                  "replies": [
                    {
                      "id": "m41e7zn",
                      "author": "JohnnyGFX",
                      "body": "A bunch of goods we already produce here…",
                      "score": 1,
                      "created_utc": 1735311109.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m40zis8",
          "author": "Pip54",
          "body": "Just did a full upgrade to my pc for this very reason. Definitely hurt monetarily, but won’t have to worry about buying new parts for a while.",
          "score": 18,
          "created_utc": 1735305033.0,
          "replies": [
            {
              "id": "m4396ii",
              "author": "Superseaslug",
              "body": "I'm still on a 12th gen i9 and a 3090 or I would as well",
              "score": 1,
              "created_utc": 1735332913.0,
              "replies": []
            },
            {
              "id": "m41383c",
              "author": "None",
              "body": "Same here. I spent 2 grand on mine lol.",
              "score": 1,
              "created_utc": 1735306689.0,
              "replies": [
                {
                  "id": "m41pc0s",
                  "author": "speculatrix",
                  "body": "What about consoles? Is it worth upgrading my PS4 now while the going's good?",
                  "score": 2,
                  "created_utc": 1735314957.0,
                  "replies": [
                    {
                      "id": "m420zb8",
                      "author": "None",
                      "body": "Yeah dude. Get a PS5 before it’s too late honestly.",
                      "score": 3,
                      "created_utc": 1735318754.0,
                      "replies": []
                    },
                    {
                      "id": "m42bnbl",
                      "author": "SarcasticOptimist",
                      "body": "Console prices are estimated to jump 40 percent. Do it and expand the m2.",
                      "score": 1,
                      "created_utc": 1735322152.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m41neqq",
                  "author": "Screamline",
                  "body": "I've been upgrading mine over time. Hot a new mobo last year, 5700x3D this year, larger nvme drives for os and games, 32gb ram and just did the RX 7900XT 2 week ago. I think I'm good for a while.",
                  "score": 1,
                  "created_utc": 1735314313.0,
                  "replies": [
                    {
                      "id": "m41nnfj",
                      "author": "None",
                      "body": "I got a 7800X3D & 4080 Super me too",
                      "score": 1,
                      "created_utc": 1735314394.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m40vukg",
          "author": "Exceed_SC2",
          "body": "Haha, wait until you learn how hard it is to remove tariffs. They’re not going away just because he leaves office, tariffs are some of the most permanent things, even if everyone opposes a current tariff, if the market has adjusted, you’re fucked, it stays.",
          "score": 3,
          "created_utc": 1735303220.0,
          "replies": [
            {
              "id": "m40wgis",
              "author": "DBeumont",
              "body": "Tariffs are placed and removed all the time. They're meant to be used as leverage.",
              "score": 23,
              "created_utc": 1735303535.0,
              "replies": [
                {
                  "id": "m40x9z6",
                  "author": "fallwind",
                  "body": "Oh, yes, but the price stays the same, it’s just the profits that go up",
                  "score": 33,
                  "created_utc": 1735303947.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4184df",
          "author": "Screamline",
          "body": "This is why I upgraded even though I didn't really need it  rtx 3070 to a RX 7900 xt. Figured the 3070 might not be that good in 4-5 years if prices level out by then so bought now cause of the idiots \"America\" decided to vote back in.",
          "score": 2,
          "created_utc": 1735308746.0,
          "replies": []
        },
        {
          "id": "m43pz4b",
          "author": "Hyperion1144",
          "body": ">Yeah we're basically gonna be SOL on new ~~PCs~~ *everything* for 4 years.\n\nI got a Google Pixel 9 Pro XL for exactly this reason. I wish I could have gotten another year out of my Pixel 7 Pro, but.... \n\nBut $8.33 per month for two years with a carrier I have no plans on leaving? \n\nAnd Trump tarrifs coming? \n\nYes please. \n\nYes, I know that the Pixel 10 is gonna have the pure TSMC silicon and is likely to be a huge jump in capabilities. \n\nOh well. \n\nTrump economy. Gotta do what we gotta do.",
          "score": 1,
          "created_utc": 1735338454.0,
          "replies": []
        },
        {
          "id": "m444yh6",
          "author": "CloudPeels",
          "body": "If you're in Europe yes. I think the US has plenty of used and new to go around",
          "score": 1,
          "created_utc": 1735343796.0,
          "replies": [
            {
              "id": "m44543n",
              "author": "Superseaslug",
              "body": "How would Europe be affected by trump tariffs to china",
              "score": 1,
              "created_utc": 1735343854.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m41zk1c",
          "author": "Cigaran",
          "body": "Much longer than that. People aren’t going to stop buying, even at the inflated prices. And if the customer is willing to pay those prices, then that will be the new price point going toward.",
          "score": 1,
          "created_utc": 1735318299.0,
          "replies": []
        },
        {
          "id": "m419rkk",
          "author": "easylite37",
          "body": "Why 4 years? I'm not sure if you will vote in 4 years again.",
          "score": 1,
          "created_utc": 1735309404.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m40x4dk",
      "author": "fallwind",
      "body": "You get what you vote for",
      "score": 137,
      "created_utc": 1735303870.0,
      "replies": [
        {
          "id": "m40zwo3",
          "author": "adsfew",
          "body": "And unfortunately, some of us get what others vote for",
          "score": 176,
          "created_utc": 1735305212.0,
          "replies": [
            {
              "id": "m412om0",
              "author": "twigboy",
              "body": "It's no joke when people are out there saying \"go vote\"\n\nMakes me glad Australia has compulsory voting",
              "score": 34,
              "created_utc": 1735306457.0,
              "replies": [
                {
                  "id": "m42f59k",
                  "author": "ThunderBobMajerle",
                  "body": "Still 24% of eligible Aus voters didn’t show up to vote in the 2022 election. I know many Aussies that take pride in not voting since the enforcement is toothless. Still far better than America’s turnout but every democracy seems to have a voter turnout issue.",
                  "score": 6,
                  "created_utc": 1735323251.0,
                  "replies": [
                    {
                      "id": "m437n72",
                      "author": "getoutofheretaffer",
                      "body": "Turnout was approximately 90%, and 97% of eligible Australians enrolled according to the Australian Electoral Commission. \n\nhttps://www.aec.gov.au/elections/federal_elections/voter-turnout.htm\n\nhttps://www.aec.gov.au/Elections/Federal_Elections/2022/downloads.htm",
                      "score": 13,
                      "created_utc": 1735332414.0,
                      "replies": [
                        {
                          "id": "m43d44t",
                          "author": "ThunderBobMajerle",
                          "body": "Ok, I’m basing it off this article for the 2022 election \n\nhttps://www.bbc.com/news/world-us-canada-63470826",
                          "score": 1,
                          "created_utc": 1735334191.0,
                          "replies": [
                            {
                              "id": "m43ggju",
                              "author": "twigboy",
                              "body": "The EAC links are for federal elections, but not quite sure exactly which elections the BBC article is pulling their data from.\n\nFederal and state elections have pretty high turnout rates (compared to by-elections or council ones), we have democracy sausages (BBQs) at the polling places which are great fun",
                              "score": 4,
                              "created_utc": 1735335288.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m438iaa",
                  "author": "getoutofheretaffer",
                  "body": "Imagine if the prime minister treated his colleagues the way Trump does. There’d be a leadership spill and that’d be the end of it.",
                  "score": -1,
                  "created_utc": 1735332695.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m456jjd",
              "author": "MovieGuyMike",
              "body": "They enrolled us all in the same pyramid scheme they fell for in 2016.",
              "score": 3,
              "created_utc": 1735358360.0,
              "replies": []
            },
            {
              "id": "m41byps",
              "author": "None",
              "body": "[deleted]",
              "score": -25,
              "created_utc": 1735310258.0,
              "replies": [
                {
                  "id": "m41kn66",
                  "author": "TooStrangeForWeird",
                  "body": "I can't agree with that at all. Not even close.",
                  "score": 9,
                  "created_utc": 1735313376.0,
                  "replies": [
                    {
                      "id": "m41p4uf",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -14,
                      "created_utc": 1735314892.0,
                      "replies": [
                        {
                          "id": "m42eqgt",
                          "author": "BrotherMain9119",
                          "body": "Ngl it sounds like you wanted to make some deep point about human psychology, but it’s so blatantly wrong and idiotic that now you’re just getting blasted for it. \n\nWhat did an infant do to deserve a corrupt government? Or do they not count as “everyone?” does everyone deserve to be damned to an atrocious government? Or are you just a boring nihilist trying to be cool?",
                          "score": 3,
                          "created_utc": 1735323122.0,
                          "replies": [
                            {
                              "id": "m42fe42",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -6,
                              "created_utc": 1735323329.0,
                              "replies": [
                                {
                                  "id": "m42fkrd",
                                  "author": "BrotherMain9119",
                                  "body": "Except it’s literally not lmao. It breaks at the lightest pressure. “Blasted” isnt a good term, “exposed for being an edgy dipshit” is more accurate.",
                                  "score": 1,
                                  "created_utc": 1735323387.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m42eysu",
                          "author": "ThunderBobMajerle",
                          "body": "How does a 21 year old have the government they deserve? They have yet to vote in a federal election",
                          "score": 1,
                          "created_utc": 1735323194.0,
                          "replies": []
                        },
                        {
                          "id": "m43sye7",
                          "author": "TooStrangeForWeird",
                          "body": "I don't think a newborn in a war torn country deserves their government. But you do apparently, and that's fucked up.",
                          "score": 0,
                          "created_utc": 1735339478.0,
                          "replies": [
                            {
                              "id": "m43tbxa",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1735339607.0,
                              "replies": [
                                {
                                  "id": "m4424uu",
                                  "author": "TooStrangeForWeird",
                                  "body": "Most Russians don't deserve the Russian government. That's definitely not an edge case.",
                                  "score": 0,
                                  "created_utc": 1735342761.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m43wts2",
          "author": "TotoCocoAndBeaks",
          "body": "You know, it wouldn't surprise me if UK/Europe etc has to pay the final USD to pound/euro conversion, maybe even rounded up. That has often been the case, especially since the exchange rate adjustments since Brexit, and in the decade before that.",
          "score": 1,
          "created_utc": 1735340830.0,
          "replies": [
            {
              "id": "m468yk9",
              "author": "IIlIIlIIlIlIIlIIlIIl",
              "body": "The EU and UK often don't even pay USD conversion rates, they pay 1:1. Sometimes the EU pays 1:1 and UK pays the EU:GBP conversion.\n\nI often buy a lot of tech when I'm in the US because I often find it insanely cheap. What costs £1,000 here costs $1,000 (£800) there, sometimes even less due to deals.",
              "score": 2,
              "created_utc": 1735379886.0,
              "replies": [
                {
                  "id": "m46fnst",
                  "author": "fallwind",
                  "body": "I think what they mean is that nvidia will jack up the worldwide price to match the increased USA price",
                  "score": 1,
                  "created_utc": 1735384384.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m412ehb",
          "author": "Corgiboom2",
          "body": "We get what 24% if eligible voters voted for",
          "score": -6,
          "created_utc": 1735306333.0,
          "replies": [
            {
              "id": "m415ld4",
              "author": "TehOwn",
              "body": "Deciding not to vote is a decision in itself. Anyone who doesn't bother to vote has no right to complain about who wins.",
              "score": 55,
              "created_utc": 1735307701.0,
              "replies": [
                {
                  "id": "m41gs03",
                  "author": "Rage_Like_Nic_Cage",
                  "body": "24% voting implies that the majority of americans dislike (and are unhappy with) both candidates. If people see the options for voting as either a 90% Turd Sandwich or a 100% Turd sandwich, you can’t exactly be surprised with people pick “neither”",
                  "score": -25,
                  "created_utc": 1735312036.0,
                  "replies": [
                    {
                      "id": "m426a74",
                      "author": "takeabow27",
                      "body": "You know we vote on more than one election at a time? My ballot was three pages long. Not voting at all isn’t just passing on turd sandwiches, it’s passing on local elections and ballot measures that impact your daily life far more than who is President.",
                      "score": 9,
                      "created_utc": 1735320450.0,
                      "replies": []
                    },
                    {
                      "id": "m41srpk",
                      "author": "TehOwn",
                      "body": "Then you should go out and either vote for a third party, an independent or spoil your ballot instead of showing your disinterest by doing fuck all. \n\nAnyone who didn't vote can shut the fuck up for 4 years.",
                      "score": 11,
                      "created_utc": 1735316100.0,
                      "replies": [
                        {
                          "id": "m41u5hc",
                          "author": "Rage_Like_Nic_Cage",
                          "body": "Telling people to “shut the fuck up” because they want the actual viable candidates to improve their posistions/stances isn’t exactly going to motivate them to go vote. But hey, if your point was to look down at (and feel superior to) other people, rather than get them to actually change their behavior, you definitely succeeded at that.",
                          "score": -13,
                          "created_utc": 1735316554.0,
                          "replies": [
                            {
                              "id": "m42dvkq",
                              "author": "Errant_coursir",
                              "body": "Idiots who didn't vote at all should shut the fuck up",
                              "score": 11,
                              "created_utc": 1735322851.0,
                              "replies": [
                                {
                                  "id": "m43vyne",
                                  "author": "roguedigit",
                                  "body": "Not voting is also a vote though.",
                                  "score": 1,
                                  "created_utc": 1735340521.0,
                                  "replies": []
                                },
                                {
                                  "id": "m42gjic",
                                  "author": "Rage_Like_Nic_Cage",
                                  "body": "I voted, as I always do. Again, I want more people to vote and telling them to “shut the fuck up” and calling them “idiots” is counter-productive in achieving that goal. \n\nDoing so solves absolutely nothing and only serves as a method for losers to feel morally and intellectually superior to people they refuse to understand or sympathize with.",
                                  "score": 2,
                                  "created_utc": 1735323692.0,
                                  "replies": [
                                    {
                                      "id": "m439aln",
                                      "author": "TehOwn",
                                      "body": ">Again, I want more people to vote and telling them to “shut the fuck up” and calling them “idiots” is counter-productive in achieving that goal. \n\nNo, it really isn't. It turns out that social pressure and shame really does achieve the desired result otherwise we wouldn't even have \"social etiquette\" at all.\n\nIf everyone is telling you to shut up if you didn't vote then maybe you'll think about voting next time so people stop telling you to shut the fuck up. \n\n\"No, I'll just double down even harder!\"\n\nSure, but that isn't what happens in real life, is it? Even just catching a few downvotes on Reddit is enough to influence how people choose to post or comment.\n\nI can't sympathise with people for a position they haven't bothered to take or make known. They have a platform and they refused to use it.",
                                      "score": 3,
                                      "created_utc": 1735332949.0,
                                      "replies": [
                                        {
                                          "id": "m43wjg6",
                                          "author": "roguedigit",
                                          "body": "Having your only 2 choices being limited to 2 right-wing candidates (and the more authentic right-wing candidate winning) should be enough shame for Americans as a whole to wake the fuck up and start doing better.",
                                          "score": 1,
                                          "created_utc": 1735340727.0,
                                          "replies": [
                                            {
                                              "id": "m43zaxa",
                                              "author": "TehOwn",
                                              "body": "The only reason it's 2 choices is because no-one ever bothers to vote for independent or third party candidates. Your votes are never \"wasted\" if they work towards legitimising the concept of a third choice.",
                                              "score": 3,
                                              "created_utc": 1735341723.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m43ortc",
                          "author": "None",
                          "body": "[deleted]",
                          "score": -8,
                          "created_utc": 1735338042.0,
                          "replies": [
                            {
                              "id": "m43zsj8",
                              "author": "TehOwn",
                              "body": "If you're going to choose not to voice your opinion when it matters most (voting) then I reserve the right to not listen to your opinions the rest of the time. No-one should forcibly shut you up but I reserve the right to tell you to shut the fuck up.\n\nYour analogy is so idiotic that I won't even respond to it.",
                              "score": 3,
                              "created_utc": 1735341901.0,
                              "replies": [
                                {
                                  "id": "m4416ya",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": -2,
                                  "created_utc": 1735342416.0,
                                  "replies": [
                                    {
                                      "id": "m448wo1",
                                      "author": "TehOwn",
                                      "body": ">Keep thinking your vote matters. Let me know the last time an election was decided by an individual vote.\n\nIt's amazing how much people can use this insane reasoning to justify anything. Absolving themselves of individual responsibility because the collective does everything and their contribution is meaningless. \n\nExcept it isn't. The collective is nothing more than a mass of individuals and if everyone thought like you then nothing would ever get done, we'd be living in a dictatorship if we even had a civilization at all.\n\nIgnoring all the other times when personal responsibility is important, voting matters because it communicates intentions. If you hate the system then by all means, spoil your ballot, it'll be recorded as such. But voting for a third party, an independent or even just the lesser of two evils will also communicate that intent, that preference. \n\nIf people see a third voice gaining votes, it not only emboldens them but it also emboldens the people behind those parties. \n\nBut if you refuse to vote, you are not counted and all that matters is the mandate of those who voted who said that Trump is what America wants. Trump is what America stands for. \n\nAnd if that is what you stand for then you should have voted for Trump. And if you stand against that then you should have voted for anyone who stands against that.\n\nBut if you don't even turn up to vote then you are very clearly saying that you don't care, you don't give a fuck. And if you don't give a fuck then just shut the fuck up already.",
                                      "score": 5,
                                      "created_utc": 1735345241.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m413ctn",
              "author": "Terribletylenol",
              "body": "And what less than 50% of people who voted wanted.\n\nHe didn't even technically win the majority.\n\nNot to mention incumbents lost everywhere in the world besides a couple countries.\n\nIt would have happened no matter what and has nothing to do with Americans or Trump specifically.\n\nLiterally any non-incumbent party candidate would have won. (And probably by more)",
              "score": -5,
              "created_utc": 1735306746.0,
              "replies": []
            },
            {
              "id": "m414bsj",
              "author": "None",
              "body": "This is what happened when there's no real competence in the country management. Botn party had lame candidate. In any case, disaster was on its way, no matter the sector",
              "score": -20,
              "created_utc": 1735307164.0,
              "replies": [
                {
                  "id": "m42e7e4",
                  "author": "Errant_coursir",
                  "body": "Yeah bro, kamalas 25k first time house purchase, 50k for small businesses, and child credit were all disasters. Especially compared to the buffoon ranting about tarrifs and people eating pets. Fucking idiots",
                  "score": 7,
                  "created_utc": 1735322954.0,
                  "replies": []
                },
                {
                  "id": "m41cao2",
                  "author": "cactus22minus1",
                  "body": "🤡",
                  "score": 8,
                  "created_utc": 1735310386.0,
                  "replies": []
                },
                {
                  "id": "m423s3v",
                  "author": "godplaysdice_",
                  "body": "Lazy, braindead take",
                  "score": 4,
                  "created_utc": 1735319652.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m40yqfw",
      "author": "shofmon88",
      "body": "Trump promised tariffs as part of his campaign. These price hikes are a direct result of his election. If you voted for Trump, and are mad about these prices, well, this is exactly what you wanted when you voted for Trump.",
      "score": 90,
      "created_utc": 1735304661.0,
      "replies": [
        {
          "id": "m416j9w",
          "author": "TehOwn",
          "body": "Also, all the Democrats who didn't bother / decided not to vote.",
          "score": 28,
          "created_utc": 1735308095.0,
          "replies": [
            {
              "id": "m41e46k",
              "author": "shofmon88",
              "body": "Indeed. Those who sat on their arses are just as culpable. ",
              "score": 16,
              "created_utc": 1735311070.0,
              "replies": []
            },
            {
              "id": "m41ryuz",
              "author": "Spider-Thwip",
              "body": "And the Democrats in charge who put Kamala forward knowing she'd never win.",
              "score": -16,
              "created_utc": 1735315838.0,
              "replies": [
                {
                  "id": "m42nes3",
                  "author": "Esteban-Jimenez",
                  "body": "When voting you'll never have someone who perfectly aligns with your worldviews, you vote for the least objectionable candidate. Especially when the alternative is so much worse.",
                  "score": 16,
                  "created_utc": 1735325874.0,
                  "replies": [
                    {
                      "id": "m433vkl",
                      "author": "Spider-Thwip",
                      "body": "Absolutely, but no party is entitled to your vote. \n\nIf they want it, they should act like they want it.",
                      "score": -8,
                      "created_utc": 1735331179.0,
                      "replies": [
                        {
                          "id": "m434wa0",
                          "author": "Esteban-Jimenez",
                          "body": "No party is entitled to your vote, but no one is entitled to be pandered to as well.\n\nIf you didn't want Trump, you should've acted like it and voted for the other candidate.",
                          "score": 11,
                          "created_utc": 1735331511.0,
                          "replies": [
                            {
                              "id": "m43qam4",
                              "author": "DavidBits",
                              "body": "Regardless of where voters decide to stand, its the party's responsibility to win over those voters, regardless of how much you view them as stubborn. If your goal is to win and key voting blocks aren't budging because of wanting you to have better policy positions... perhaps you should just pivot your policy to rally more voters instead of believing that they owe you a vote because \"mUh iNsTiTuTiOns\"? This is the exact same mistaken thought process as 2016. Y'all always gotta defend outdated neoliberal institutions, no matter how fucking stupid they are, eh?",
                              "score": 1,
                              "created_utc": 1735338563.0,
                              "replies": [
                                {
                                  "id": "m441otz",
                                  "author": "Esteban-Jimenez",
                                  "body": "The democrats didn't lose this election because they didn't move far enough to the left, quite the opposite. The democratic voter base is not composed of the leftists you see on reddit, Twitter, or bluesky, they are closer to the middle.\n\nA significant reason for the democrats' loss is that the left-wing media (both mainstream and alternative) is far more progressive and far left  than the average democratic or undecided voter. The left-wing media failed to rally around the Kamala and to provide her enough support during the elections.\n\nYou could argue that the media's role is to hold candidates accountable, and that's valid. However, once the candidate is chosen (primaries, anointed, or whatever ), the entire left-wing media should coalesce around that candidate to ensure victory. Criticizing or scrutinizing the candidate is appropriate during the primaries or after they've taken office, but during the campaign, the focus should be on pushing them forward.\n\nMost voters can't explain, in any amount of detail, Kamala's proposed economic policy or other any policies. Instead most voters vote based on vibes, and media portrayals play a huge role in shaping those perceptions. A big reason won is that right-wing media portrays him as infallible and to them he is the chosen one. While that kind of personality cult is not something the dems should to aspire to, the democrats could learn from how the right consistently supports their candidates.\n\nIn the future, if the democrats want any chance at winning an election, they must align with their key voter base, center-left liberals and not reddit socialists who don't vote anyways. They also need to work exclusively with media outlets willing to align with the party's messaging and rally behind their candidates.",
                                  "score": 1,
                                  "created_utc": 1735342598.0,
                                  "replies": [
                                    {
                                      "id": "m448r1j",
                                      "author": "DavidBits",
                                      "body": "With an entirely straight-faced tone you're seriously going to start your response by suggesting that, in order to win elections, the democratic party should ... (checks notes)... pursue *more* right-wing policy than it currently does through it's foreign and domestic policy? This is not a serious discussion lol",
                                      "score": 2,
                                      "created_utc": 1735345186.0,
                                      "replies": [
                                        {
                                          "id": "m44bac7",
                                          "author": "Esteban-Jimenez",
                                          "body": "Where did I say any of that? Since when center left liberals are right wing? \n\nNo, but they should also not alienated large parts of their voter base by going far left.\nAnd you also conveniently ignored my bigger critisizm of how scrutinized Kamala was by left wing media when Trump was only glorified by the right wing media.",
                                          "score": -1,
                                          "created_utc": 1735346105.0,
                                          "replies": []
                                        },
                                        {
                                          "id": "m44d8vv",
                                          "author": "plsfreeguccimane",
                                          "body": " The far left ideology of the democratic party alienated moderates. I guess there were more moderates than anticipated.",
                                          "score": -2,
                                          "created_utc": 1735346817.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m435xab",
                  "author": "powercow",
                  "body": "legally it was the easiest choice with the war chest and you are part of the problem. dems have to be perfect, republicans can be what ever.",
                  "score": 6,
                  "created_utc": 1735331849.0,
                  "replies": []
                },
                {
                  "id": "m44n7jx",
                  "author": "TehOwn",
                  "body": "I agree, actually. I don't know if Bernie could have won but I'd definitely have chosen him over Kamala.\n\nHe may be ancient but he's still as sharp as a tack and a reliable candidate who has always fought for the people and against the billionaire class.",
                  "score": 1,
                  "created_utc": 1735350561.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4d17i8",
          "author": "Dpek1234",
          "body": "Same thing jews that voted for hitler thought\n\n\nThey are just saying that to rile up supporters\n\n\nThey dont actualy mean it\n\n\nThey wont actualy do it to **me**\n\n\nBetter then *the communists*",
          "score": 2,
          "created_utc": 1735484868.0,
          "replies": []
        },
        {
          "id": "m41az93",
          "author": "Leaky_Asshole",
          "body": "Trump put tariffs at 25%, Biden doubled them to 50%. Both choices are fucked, neither side is against tariffs.",
          "score": -47,
          "created_utc": 1735309876.0,
          "replies": [
            {
              "id": "m41cwjs",
              "author": "JohnnyGFX",
              "body": "Biden raised tariffs on specific items that we already produce here in the states. Trump wants to raise tariffs on things we don’t… that’s the problem.",
              "score": 40,
              "created_utc": 1735310620.0,
              "replies": []
            },
            {
              "id": "m41f32a",
              "author": "shofmon88",
              "body": "Tariffs are a tactical economic tool used in specific situations, like when you have an existing industry that you want to prevent getting undercut by cheaper foreign imports (see: cars). Trump is applying tariffs on *everyone*, regardless of industry, trade agreements, etc. He’s using a sledgehammer to drive a finishing nail: wholly excessive and damaging to what you’re trying to build. ",
              "score": 16,
              "created_utc": 1735311424.0,
              "replies": [
                {
                  "id": "m41g7hh",
                  "author": "Leaky_Asshole",
                  "body": "So why did Biden not remove any of the Trump impossed tariffs? All he did is increase them.  The Biden tariffs apply to Chinese semiconductors but not if they are already on assemblies. Essentially forcing any us electronics to be assembled overseas to be competitive. This has had horrible effects on the US electronics assembly industry, which industry is he protecting here?",
                  "score": -22,
                  "created_utc": 1735311830.0,
                  "replies": [
                    {
                      "id": "m41hz6z",
                      "author": "shofmon88",
                      "body": "It’s not the past tariffs that are the problem; it’s the future ones. The US *is* trying to strangle China’s access to semiconductors while also encouraging the construction of US-based fabrication. This is the sort of situation you do want to use tariffs for. Once again, you’re ignoring that Trump will be *enacting tariffs on all trade*. That will only make inflation skyrocket and do nothing to protect any industry. ",
                      "score": 17,
                      "created_utc": 1735312463.0,
                      "replies": [
                        {
                          "id": "m42egef",
                          "author": "Errant_coursir",
                          "body": "He's not ignoring anything, he's unable to comprehend",
                          "score": 9,
                          "created_utc": 1735323032.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m41fu5w",
              "author": "shofmon88",
              "body": "Another comment to add that “both sides” is a disingenuous argument made by the ignorant and ill-informed. It takes a bare minimum of effort to look into actual policy to see that “both sides” are not anywhere even close to the same. ",
              "score": 15,
              "created_utc": 1735311696.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m414ini",
      "author": "lm28ness",
      "body": "People will still buy.  That is why the prices of everything remain so high.",
      "score": 9,
      "created_utc": 1735307244.0,
      "replies": []
    },
    {
      "id": "m41p7e5",
      "author": "Haboob_AZ",
      "body": "They'll stockpile, but they'll still up the price to get that sweet profit.",
      "score": 9,
      "created_utc": 1735314915.0,
      "replies": []
    },
    {
      "id": "m4282lf",
      "author": "WordNERD37",
      "body": "The cascading effect of these tariffs are going to be hilarious to watch.",
      "score": 7,
      "created_utc": 1735321024.0,
      "replies": [
        {
          "id": "m42b4qa",
          "author": "azmus",
          "body": "Single handedly saving the earth from the existential threat of climate change through tariffs. Like a divine intervention from God through Trump!",
          "score": -7,
          "created_utc": 1735321991.0,
          "replies": [
            {
              "id": "m42el56",
              "author": "KingKongDoom",
              "body": "Saying this while he implements Lee Zeldin to run the EPA is a level of delusion I can’t even begin to fathom. Seek help.",
              "score": 5,
              "created_utc": 1735323075.0,
              "replies": [
                {
                  "id": "m42xuk6",
                  "author": "ElDoRado1239",
                  "body": "Oh no I thought he's gonna put Led Zeppelin in charge and I got kinda hopeful because that would still be a win.",
                  "score": 0,
                  "created_utc": 1735329219.0,
                  "replies": []
                },
                {
                  "id": "m42hj9v",
                  "author": "azmus",
                  "body": "Mandating much less consumption will significantly help the environment regardless",
                  "score": -3,
                  "created_utc": 1735324007.0,
                  "replies": [
                    {
                      "id": "m42i2wg",
                      "author": "KingKongDoom",
                      "body": "https://cultrecovery101.com/recovery-links/",
                      "score": 4,
                      "created_utc": 1735324179.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m42fi38",
              "author": "WordNERD37",
              "body": "\"WHY ARE MY EGGS $3 EACH!!\"\n\n-You in like six months.\n\nLearn basic economics.",
              "score": 4,
              "created_utc": 1735323364.0,
              "replies": [
                {
                  "id": "m45ygjk",
                  "author": "Neo_Techni",
                  "body": "So you're saying Trump is going to do what Biden already did?",
                  "score": -1,
                  "created_utc": 1735372855.0,
                  "replies": []
                },
                {
                  "id": "m42hsle",
                  "author": "azmus",
                  "body": "Yes and higher prices reduce consumption of goods and services thereby saving the earth from climate change",
                  "score": -5,
                  "created_utc": 1735324089.0,
                  "replies": [
                    {
                      "id": "m42hygy",
                      "author": "WordNERD37",
                      "body": "I take that back, learn, basic, everything.",
                      "score": 7,
                      "created_utc": 1735324140.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4j80qv",
              "author": "TheBroWhoLifts",
              "body": "Wait wait what's the logic here (assuming you're serious)? Prices get so high that demand is destroyed, consumption and thus carbon emissions fall from the ensuing economic collapse (especially in the US where over 60% of our economy is consumer and not manufacturing driven)? Ahh so that's the four dimensional chess move! Got it.\n\n... But then the billionaires sweep in and snatch up all the depreciated assets for cheap and spin the system back up to funnel profits their way. Whoops.",
              "score": 1,
              "created_utc": 1735572309.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m40x279",
      "author": "prnalchemy",
      "body": "Is \"%\" now a problem?",
      "score": 15,
      "created_utc": 1735303840.0,
      "replies": [
        {
          "id": "m41ks7l",
          "author": "TooStrangeForWeird",
          "body": "Yeah, some bots don't sanitize their input. Also makes urls look funny.",
          "score": 10,
          "created_utc": 1735313424.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42w6ti",
      "author": "Quizzelbuck",
      "body": "Well well well. Suddenly Intel's GPU release cycle doesn't seem so insane",
      "score": 5,
      "created_utc": 1735328679.0,
      "replies": []
    },
    {
      "id": "m41vh3g",
      "author": "Madpup70",
      "body": "Companies are 100% buying now to then pump up the price by future tariffs + 5% - 10%. Tariffs are gonna burn us, and companies are gonna use the opportunity to pump prices over the tariff amount because tariffs give them an easy boogyman to blame. It's why I bit the bullet and built my new PC back in November. Dude at Microcenter made a comment about the price and how good of a PC it will be and I told him I was buying now instead of waiting to see 5000 series cards because of Trump's promised tariffs. Dude just scoffed and said, \"ya prices will go up for a few months but then we'll just start producing CPUs and GPUs in the US, and prices will go back down.\" Ya bud, sure they will. Even people who know the tariffs are coming are burying their heads in the sand about what it's gonna do.",
      "score": 8,
      "created_utc": 1735316985.0,
      "replies": [
        {
          "id": "m4j8jgn",
          "author": "TheBroWhoLifts",
          "body": "Meanwhile, the facilities planned to build those chips through the CHIPS act might get the axe simply because they were passed by the Biden administration.\n\nHey do me a favor and set a calendar event for one year so we can start asking these assholes, \"Hey where are those low prices you said would be here?\" (I know, they'll still find a way to blame Biden and the democrats, but it's worth a try...)",
          "score": 1,
          "created_utc": 1735572484.0,
          "replies": []
        },
        {
          "id": "m42yl0h",
          "author": "itchyouch",
          "body": "Lelz.  The TSMC plant in Arizona has the 4nm process while mainland Taiwan has the cutting edge 3nm process.  Pretty sure Apple has a lock on the latest processes to keep competitors out.\n\nIt might be possible for nvidia chips to be built at the AZ plant though.  Not sure about the rest of the boards though.",
          "score": -1,
          "created_utc": 1735329461.0,
          "replies": [
            {
              "id": "m43cw7h",
              "author": "iamcts",
              "body": "The chips might get made in Arizona, but they're still going to get shipped back overseas to get packaged. When they come back for sale they're going to get tariffed.",
              "score": 2,
              "created_utc": 1735334119.0,
              "replies": [
                {
                  "id": "m43s5c8",
                  "author": "itchyouch",
                  "body": "We’ll have to see if the tariffs have enough incentive to bring production to the states, but we will have to see…",
                  "score": 1,
                  "created_utc": 1735339198.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m42ay6a",
      "author": "LENuetralObserver",
      "body": "One of the biggest wastes in manufacturing is over producing.  Trump is literally incentivizing companies to over produce product and hope it sells.  Companies are front loading there manufacturing now so that when trump is inaugurated they will need to lay off people.",
      "score": 4,
      "created_utc": 1735321933.0,
      "replies": []
    },
    {
      "id": "m42h9ml",
      "author": "that1cooldude",
      "body": "Msrp for usa is $3,500.00 and scalpers will want $5,000.00-$5,600.00 ",
      "score": 4,
      "created_utc": 1735323923.0,
      "replies": []
    },
    {
      "id": "m42opmh",
      "author": "Deranged_Kitsune",
      "body": "If I can get a graphics card in Canada cheaper than in the US, I'll be surprised. Happy, but still surprised.",
      "score": 4,
      "created_utc": 1735326291.0,
      "replies": []
    },
    {
      "id": "m42yk05",
      "author": "DownShatCreek",
      "body": "Good work, crypto bros.",
      "score": 4,
      "created_utc": 1735329451.0,
      "replies": []
    },
    {
      "id": "m430xwh",
      "author": "Samout-",
      "body": "Seems that my trusty gtx 1080ti and 4790k will be with me until 6000 series is released",
      "score": 5,
      "created_utc": 1735330224.0,
      "replies": [
        {
          "id": "m44b5zs",
          "author": "AzazelsAdvocate",
          "body": "My trusty 1080ti is starting to not be so trusty anymore.",
          "score": 1,
          "created_utc": 1735346061.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41kmkq",
      "author": "patrickw234",
      "body": "I miss the days when businesses actually did a single thing that benefited the customer in any way, instead of just the bottom line.",
      "score": 8,
      "created_utc": 1735313371.0,
      "replies": []
    },
    {
      "id": "m40w17x",
      "author": "-Spatha",
      "body": "All the gamers thinking trumps win wasn't gonna affect yall.  You find out it will and all of a sudden, *shocked piccacu face*\n\nThis country is a shit show",
      "score": 44,
      "created_utc": 1735303316.0,
      "replies": [
        {
          "id": "m40wfsl",
          "author": "hasuris",
          "body": "Just buy local silly\n\n*Looks into US manufactured GPUs*\n\nOh...",
          "score": 43,
          "created_utc": 1735303525.0,
          "replies": [
            {
              "id": "m42b9tc",
              "author": "radome9",
              "body": "Are there any at all?",
              "score": 5,
              "created_utc": 1735322036.0,
              "replies": [
                {
                  "id": "m42ftfd",
                  "author": "hasuris",
                  "body": "No and I doubt there ever will be. TSMC is manufacturing the chips for Nvidia and although they have fabs outside of Taiwan, I believe their most advanced nodes are legally limited to their home fabs in Taiwan. Samsung has their advanced nodes in Korea. \n\nUnless this changes, you'll never see cutting edge GPUs made in the US. In the future hostile environment I don't see how any country would allow their tech to be transferred to the US.",
                  "score": 14,
                  "created_utc": 1735323465.0,
                  "replies": []
                },
                {
                  "id": "m42huwe",
                  "author": "Dt2_0",
                  "body": "I'm sure TI makes some sort of graphics processor that technically qualifies as a GPU, but that is a bit besides the point. Basically all GPU silicon for gaming and professional purposes is made at TMSC in Taiwan.",
                  "score": 6,
                  "created_utc": 1735324108.0,
                  "replies": [
                    {
                      "id": "m42msdy",
                      "author": "isjahammer",
                      "body": "Intel might be the winner in this. Don´t they have fabs in the US or at least in countrees that are not affected by these tariffs?",
                      "score": 1,
                      "created_utc": 1735325678.0,
                      "replies": [
                        {
                          "id": "m42pxrz",
                          "author": "Dt2_0",
                          "body": "Their fabs had so much trouble they had to turn to TMSC to build chips for them. Their last CEO was brought in to build up modern, quality fabs in the US, but they fired him because it was costing too much money to build fabs (dumb decision, the guy had barely any time to do anything and fabs take years to build. It was going to cost money for a while, and anyone who brough him in would have known that).",
                          "score": 3,
                          "created_utc": 1735326682.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m413e8u",
          "author": "stefanvape",
          "body": "All the dumb uneducated trump voters shitting their pants now. “But gAs WiLL bE CHeaPEr..” they say",
          "score": 23,
          "created_utc": 1735306763.0,
          "replies": [
            {
              "id": "m4366h4",
              "author": "powercow",
              "body": "i dodnt get the complaints on gas, gas has been the same price as 2019 for a while now, here. its not the same price as in middle of the first covid crash when it dropped absurdly low due to crashed demand.",
              "score": 5,
              "created_utc": 1735331934.0,
              "replies": []
            },
            {
              "id": "m414lou",
              "author": "None",
              "body": "It's just a proof how lame USA became. It's their choice to not developped their country hence why USA is starting to look like a 2nd rate country and a laughing joke on the worldwide scene. They got what they are",
              "score": 11,
              "created_utc": 1735307280.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4162m3",
          "author": "TehOwn",
          "body": "It will. He's going to save gaming from woke stuff like pronouns!\n\n#/s",
          "score": 8,
          "created_utc": 1735307902.0,
          "replies": [
            {
              "id": "m41nwwr",
              "author": "Screamline",
              "body": "Get those groomers out of my cyberpunk game /s",
              "score": 5,
              "created_utc": 1735314482.0,
              "replies": [
                {
                  "id": "m45tvdg",
                  "author": "2g4r_tofu",
                  "body": "*hands tablet with roblox to their whining kids to get them to quiet down*",
                  "score": 2,
                  "created_utc": 1735369972.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4113nl",
          "author": "WCWRingMatSound",
          "body": "They clearly don’t remember who tariffed GPUs the [first time](https://www.theverge.com/2021/1/7/22217206/nvidia-amd-gpu-trump-tax-china-tariff-exemption-expire)",
          "score": 10,
          "created_utc": 1735305756.0,
          "replies": [
            {
              "id": "m418g37",
              "author": "RedditCollabs",
              "body": "What are you saying, it literally says Trump in that one as well",
              "score": -7,
              "created_utc": 1735308876.0,
              "replies": [
                {
                  "id": "m418ptv",
                  "author": "WCWRingMatSound",
                  "body": "Yes.",
                  "score": 11,
                  "created_utc": 1735308985.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m42zfe8",
      "author": "MrBackBreaker586",
      "body": "Another graphics card I can't afford but if I could it wouldn't run right garunteeeeeed",
      "score": 3,
      "created_utc": 1735329735.0,
      "replies": []
    },
    {
      "id": "m443okm",
      "author": "MCGaming1991",
      "body": "Or just use the tariff as an excuse to mark up prices.",
      "score": 3,
      "created_utc": 1735343327.0,
      "replies": []
    },
    {
      "id": "m44ajpy",
      "author": "Hambone429",
      "body": "Scare tactics for profits. Don’t run out and buy everything up. They are not going to be that hard to get.",
      "score": 3,
      "created_utc": 1735345838.0,
      "replies": [
        {
          "id": "m4j9551",
          "author": "TheBroWhoLifts",
          "body": "RemindMe! 6 months",
          "score": 2,
          "created_utc": 1735572684.0,
          "replies": []
        },
        {
          "id": "n0llp74",
          "author": "TheBroWhoLifts",
          "body": "I set a remind me bot... Cards aren't hard to get, but they ARE more expensive than the headline predicted! 5090 is going for about $3,000 and up! Lol!",
          "score": 2,
          "created_utc": 1751300155.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m45raeq",
      "author": "Less_Party",
      "body": "I like how everyone's ignoring the part where this would also put the US economy into a recession that'd make the 1920s look fun so GPU prices will be the absolute least of your worries.",
      "score": 3,
      "created_utc": 1735368474.0,
      "replies": [
        {
          "id": "m47hbrj",
          "author": "Neat_Butterfly_7989",
          "body": "Yes, Maga and stupid fucks dont realize that by imposing tariffs with the rest of the globe you pretty much are isolating the united states. It would hurt the US more than the countries he is imposing those tariffs on.",
          "score": 2,
          "created_utc": 1735401879.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m424r69",
      "author": "Boggie135",
      "body": "That “pct” confused me for a bit",
      "score": 5,
      "created_utc": 1735319962.0,
      "replies": [
        {
          "id": "m425s1q",
          "author": "SephYuyX",
          "body": "Who takes more time and effort to use that, versus the sign.",
          "score": 3,
          "created_utc": 1735320289.0,
          "replies": [
            {
              "id": "m426rzx",
              "author": "Boggie135",
              "body": "I was wondering the same thing.",
              "score": 2,
              "created_utc": 1735320612.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m42tezf",
      "author": "MeeekSauce",
      "body": "I mean, that’s almost the price of a 4090 right now.",
      "score": 5,
      "created_utc": 1735327790.0,
      "replies": []
    },
    {
      "id": "m41crvt",
      "author": "Nervous_Classic4443",
      "body": "It's a classic case of companies using tariffs as a scapegoat to justify price hikes. They'll stockpile and then cry inflation while raking in profits. The cycle just keeps repeating.",
      "score": 4,
      "created_utc": 1735310570.0,
      "replies": []
    },
    {
      "id": "m42u8ni",
      "author": "Altruistic-Rice-5567",
      "body": "This damn tariff crap. If we don't have a domestically made competing product to what's being imported then tariffs are stupid. They will just raise the price of stuff we want to buy.\n\nNow... if we actually had decent leadership with half a brain cell then you'd start incentivizing domestic production. Then when you are actually making a domestic alternative available then tariffs could be good.",
      "score": 4,
      "created_utc": 1735328053.0,
      "replies": [
        {
          "id": "m44befy",
          "author": "AzazelsAdvocate",
          "body": "Do you think Americans will work for anywhere close to the same wages people in Taiwan will?",
          "score": 3,
          "created_utc": 1735346147.0,
          "replies": []
        },
        {
          "id": "m4j9p9t",
          "author": "TheBroWhoLifts",
          "body": "Even *when* we have a domestically available alternative, it's stupid. (And in this case, there are no domestic high end GPU alternatives because they aren't manufactured here.) \n\nTarrifs are implemented to promote domestic consumption, but ask yourself, \"Wait why does domestic consumption need to be boosted?\" Because it's more expensive. That's why the imported version is in higher demand. Now slap a tarrif on the import and the domestic alternative becomes the cheaper one but *is still more expensive than the import before the tarrif*... And that's just the beginning of why tarrifs are so dumb. Didn't these idiots who think tarrifs are so great watch Ferris Bueller? Ben Stein's character explained this all like almost 40 years ago.",
          "score": 1,
          "created_utc": 1735572870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m40wmcf",
      "author": "gg06civicsi",
      "body": "Sad thing is that it’s probably going to still sell out anyway.",
      "score": 2,
      "created_utc": 1735303618.0,
      "replies": []
    },
    {
      "id": "m411k13",
      "author": "awesomesonofabitch",
      "body": "Just when I thought I'd finally update my PC for the first time in a decade.😬👍",
      "score": 2,
      "created_utc": 1735305959.0,
      "replies": []
    },
    {
      "id": "m413mf6",
      "author": "Dizsmo",
      "body": "My 3700 ti will get me through years to come",
      "score": 2,
      "created_utc": 1735306859.0,
      "replies": [
        {
          "id": "m45xmct",
          "author": "kalirion",
          "body": "My 1050ti probably will not, and neither will my i7-920. I should've bought a new PC this Thanksgiving, but was too lazy. Ah well, if I have to spend $2k on a RTX 5060 build come September so be it.",
          "score": 2,
          "created_utc": 1735372311.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m414wcx",
      "author": "disgruntled_joe",
      "body": "This is why I just bought a 7800xt!",
      "score": 2,
      "created_utc": 1735307406.0,
      "replies": []
    },
    {
      "id": "m415eik",
      "author": "H3racIes",
      "body": "Because tariffs will make the prices of these products to up, does that mean their stock prices will too?",
      "score": 2,
      "created_utc": 1735307621.0,
      "replies": [
        {
          "id": "m419elu",
          "author": "TheJohnSB",
          "body": "No, because the company doesn't suddenly get this money the US government will basically collect a \"tax\" from its own people. What this will lead to is consumers going \"do I really need a 2500$ graphics card when my current card can play every game on the market well?\" Which will cause a loss in sales. But on top of that imagine building a top of the line computer for 5-6k and having to pay an extra 1500$ in tariff on top of that. No thanks, I'll wait.",
          "score": 8,
          "created_utc": 1735309259.0,
          "replies": []
        },
        {
          "id": "m417wrm",
          "author": "BitbyLite",
          "body": "yes as long as more money is printed",
          "score": -2,
          "created_utc": 1735308661.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m416453",
      "author": "whatlineisitanyway",
      "body": "I am building a new PC and Instead of waiting I'm going with the 4000 series because who knows how much the 5000s are going to cost but the time I can get a hold of one. 4080s are already getting scarce.",
      "score": 2,
      "created_utc": 1735307919.0,
      "replies": []
    },
    {
      "id": "m41689x",
      "author": "ECore",
      "body": "Remindme! 2 years",
      "score": 2,
      "created_utc": 1735307967.0,
      "replies": []
    },
    {
      "id": "m41hwya",
      "author": "woowoodoc",
      "body": "They may cost more, but at least they won’t be fabricated in America or benefit American workers.  \n\nWait a minute….",
      "score": 2,
      "created_utc": 1735312441.0,
      "replies": []
    },
    {
      "id": "m4564r3",
      "author": "MovieGuyMike",
      "body": "Spending an extra 40% to own the libs. The cult of action for actions sake really voted for more inflation because they were mad about inflation.",
      "score": 2,
      "created_utc": 1735358182.0,
      "replies": []
    },
    {
      "id": "m46jffl",
      "author": "goomyman",
      "body": "2500 rtx 5090 would be a steal the first year. \n\nShit is going to be scalped non stop for like 5k",
      "score": 2,
      "created_utc": 1735386813.0,
      "replies": []
    },
    {
      "id": "m46wi82",
      "author": "Thick-Broccoli-8317",
      "body": "It’s okay, once we get that “trickle down” that we were promised— we’ll be able to afford it. /s",
      "score": 2,
      "created_utc": 1735393734.0,
      "replies": []
    },
    {
      "id": "m47a8z2",
      "author": "TheDoctorAtReddit",
      "body": "Top of the Line gaming cards have not been $1,500 for five years now.",
      "score": 2,
      "created_utc": 1735399362.0,
      "replies": []
    },
    {
      "id": "m40zl19",
      "author": "Fr000m",
      "body": "Debeers called....",
      "score": 5,
      "created_utc": 1735305063.0,
      "replies": []
    },
    {
      "id": "m41u4pi",
      "author": "laughinglion77",
      "body": "Joke's on you, in South Africa we already pay $2500 for a 4090.",
      "score": 2,
      "created_utc": 1735316548.0,
      "replies": [
        {
          "id": "m44kpme",
          "author": "Wild_ColaPenguin",
          "body": "Same here in SEA. Now Americans can have the same GPU prices as the rest of the world. Price equality. Lol",
          "score": 0,
          "created_utc": 1735349608.0,
          "replies": []
        },
        {
          "id": "m4285a4",
          "author": "volfin",
          "body": "and in the USA.",
          "score": -1,
          "created_utc": 1735321048.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41xiat",
      "author": "RedLicoriceJunkie",
      "body": "“Oh dear me.  We have the raise the prices on these graphics cards.  Tariffs after all.”",
      "score": 3,
      "created_utc": 1735317642.0,
      "replies": []
    },
    {
      "id": "m42f3q3",
      "author": "Reasonable-Start1067",
      "body": "No offense to anyone but maybe they should stop bloating their prices and figure out a way to make it affordable. Most of these companies are adding waaaaay too much markup keeping the market cornered and robbing consumers.",
      "score": 3,
      "created_utc": 1735323238.0,
      "replies": [
        {
          "id": "m446ykk",
          "author": "ryosen",
          "body": "Are they robbing consumers when those same consumers have shown that they are more than happy to pay these sort of prices?",
          "score": 1,
          "created_utc": 1735344534.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m429tsp",
      "author": "Blown89",
      "body": "The sky is falling, the sky is falling!",
      "score": 4,
      "created_utc": 1735321581.0,
      "replies": []
    },
    {
      "id": "m40vu2x",
      "author": "blackdragonstory",
      "body": "Is this going to affect europe?  \nI have been on the fence about getting a new pc cuz I dont really game much but my current pc is from 2016.  \nIt still works decently although the only game I play on it rn is cs2.  \nIntel i3 6100,nvidia gtx 750ti,16gb ram.  \nAlso got ps5 where I play a bit more.",
      "score": 2,
      "created_utc": 1735303212.0,
      "replies": [
        {
          "id": "m4a94be",
          "author": "dustofdeath",
          "body": "EU brands get their chips directly from foundry, so we get the usual 2500€ 5090.",
          "score": 1,
          "created_utc": 1735435243.0,
          "replies": []
        },
        {
          "id": "m40wlw7",
          "author": "None",
          "body": "It will definitely effect Europe as well.",
          "score": -12,
          "created_utc": 1735303612.0,
          "replies": [
            {
              "id": "m40zisz",
              "author": "qtx",
              "body": "It won't really. Tariffs affect the local economy where the tariffs are imposed upon, it doesn't affect anyone else unless it's a two-way tariff war between two countries.\n\nEurope isn't involved in any of that.\n\nIf Nvidia or AMD decides to raise the price for European customers to make the loss in America more bearable they risk losing the European market as well which for them will make everything even more worse.",
              "score": 12,
              "created_utc": 1735305034.0,
              "replies": [
                {
                  "id": "m417jnd",
                  "author": "TehOwn",
                  "body": ">If Nvidia or AMD decides to raise the price for European customers to make the loss in America more bearable they risk losing the European market as well which for them will make everything even more worse.\n\nYou're forgetting the possibility of them both increasing prices because they have no organic competition and there's effectively a zero chance of any meaningful competition springing up in response.\n\nBut, yeah, we have 20% tax here in Europe and we simply pay more money. That's it.",
                  "score": 1,
                  "created_utc": 1735308512.0,
                  "replies": []
                },
                {
                  "id": "m41048w",
                  "author": "adsfew",
                  "body": "But if a company's profit decreases due to tariff-induced price hikes, then would they then increase the prices in other countries to try to recoup some of those losses?",
                  "score": 1,
                  "created_utc": 1735305309.0,
                  "replies": [
                    {
                      "id": "m410lo4",
                      "author": "MisterDonutTW",
                      "body": "No because they would just lose sales.  They have already chosen the price that they determined would make them the most money.  If they increase it then sales go down, and they would lose basically the entire market share if a competitor doesn't do it as well.",
                      "score": 2,
                      "created_utc": 1735305530.0,
                      "replies": [
                        {
                          "id": "m411bbw",
                          "author": "None",
                          "body": "Nvidia has raised priced in Europe at the same rate as they have in the states. Combined with European countries taxing electronics harder than anywhere else means that Europe will always pay more for them. They're not magically exempt from corporate bullshit.",
                          "score": -5,
                          "created_utc": 1735305852.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m41c89q",
                  "author": "Nope_______",
                  "body": "How are they going to lose the European market? Some Chinese company going to start making GPUs? There's no way they have lower prices in Europe than the US.",
                  "score": 0,
                  "created_utc": 1735310360.0,
                  "replies": []
                },
                {
                  "id": "m41953m",
                  "author": "Newbianz",
                  "body": "these days its too easy to import from eu stores and ppl can do that if their gpus are that much cheaper even after import fees till stock runs out and then those stores increase their prices to match other stores in the US too\n\nit just means more profit for them and nothing new really",
                  "score": -1,
                  "created_utc": 1735309155.0,
                  "replies": [
                    {
                      "id": "m4270qa",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1735320689.0,
                      "replies": [
                        {
                          "id": "m438ioh",
                          "author": "Newbianz",
                          "body": "not as high plus importing from different countries is a common tactic around tariffs as it costs more then regional prices with import and currency exchange fees but can still be cheaper in some cases",
                          "score": 1,
                          "created_utc": 1735332699.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m40x8ko",
          "author": "swiftninja_",
          "body": "No doubt it will, arguably even more.",
          "score": -12,
          "created_utc": 1735303928.0,
          "replies": [
            {
              "id": "m410wek",
              "author": "MisterDonutTW",
              "body": "No of course not",
              "score": 6,
              "created_utc": 1735305666.0,
              "replies": [
                {
                  "id": "m411vum",
                  "author": "swiftninja_",
                  "body": "Huh the demand for GPU is much larger in USA than Europe. All gpu manufacturers are American",
                  "score": -10,
                  "created_utc": 1735306107.0,
                  "replies": [
                    {
                      "id": "m4173x5",
                      "author": "TehOwn",
                      "body": "That's true but they're manufactured in China and shipped to Europe, so the tariffs won't be involved directly. \n\nThat said, stuff like this can absolutely have an impact on global sales and prices.\n\nThere's so many things involved that it's really impossible to predict. If you can reliably predict the market, get off Reddit and start investing.",
                      "score": 4,
                      "created_utc": 1735308331.0,
                      "replies": [
                        {
                          "id": "m419suv",
                          "author": "swiftninja_",
                          "body": "US companies make the cards",
                          "score": -5,
                          "created_utc": 1735309418.0,
                          "replies": [
                            {
                              "id": "m41tdv7",
                              "author": "TehOwn",
                              "body": "They're made in China. Chinese people make the cards. American companies OWN the cards but the vast majority of the manufacturing process takes place across Taiwan and China.\n\nThe tariffs will only apply to goods entering the US. Or, more realistically, those being sold in the US.",
                              "score": 5,
                              "created_utc": 1735316304.0,
                              "replies": []
                            },
                            {
                              "id": "m43x9rv",
                              "author": "higuy721",
                              "body": "Tell me you don’t know How tariffs work without telling me…",
                              "score": 1,
                              "created_utc": 1735340988.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m413hym",
                      "author": "MisterDonutTW",
                      "body": "Irrelevant because they aren't manufactured there and the demand is global.\n\nEuropeans play games and mine crypto too lol.",
                      "score": 2,
                      "created_utc": 1735306807.0,
                      "replies": []
                    },
                    {
                      "id": "m415j3u",
                      "author": "None",
                      "body": "Not that much, Demand is similar all around the world except maybe in China where the demand is much bigger",
                      "score": 1,
                      "created_utc": 1735307675.0,
                      "replies": []
                    },
                    {
                      "id": "m42o7wp",
                      "author": "cgesjix",
                      "body": "NVIDIA designs the GPUs but doesn't manufacture them. Manufacturers such as ASUS and ASROCK make the cards. The components on the cards are made in China and Taiwan.",
                      "score": 1,
                      "created_utc": 1735326134.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m433ttf",
      "author": "yuweilin",
      "body": "Thats why stock at all time high lol. Keep coming up with excuses to raise prices. Is gpu something you need like food? No",
      "score": 2,
      "created_utc": 1735331163.0,
      "replies": []
    },
    {
      "id": "m43k5fg",
      "author": "x925",
      "body": "Lets be honest, nvidia was planning a $2500 5090 when they started developing it. Itll probably be closer to $3800 /s",
      "score": 2,
      "created_utc": 1735336495.0,
      "replies": []
    },
    {
      "id": "m46wq1l",
      "author": "franchisedfeelings",
      "body": "The felon is trying hard to ruin America already.",
      "score": 2,
      "created_utc": 1735393833.0,
      "replies": []
    },
    {
      "id": "m4356wk",
      "author": "MaximumJunket486",
      "body": "I love seeing people panic because of trump. Shows how stupid they are.",
      "score": 2,
      "created_utc": 1735331608.0,
      "replies": []
    },
    {
      "id": "m4482wg",
      "author": "pfp61",
      "body": "5090 will be made outside of China mostly anyway. There is enough production capacity outside of China for US for most other products as well. Actually the part with the lowest production capacity outside of China is PC case, at least for PC components.",
      "score": 2,
      "created_utc": 1735344944.0,
      "replies": []
    },
    {
      "id": "m4113ur",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1735305759.0,
      "replies": [
        {
          "id": "m42yvmi",
          "author": "itchyouch",
          "body": "I’ve yet to see anyone beat the US as far as computer component prices go.  Everyone from EU seems to cry in euros.",
          "score": 1,
          "created_utc": 1735329558.0,
          "replies": [
            {
              "id": "m43kul4",
              "author": "None",
              "body": "Well shoot.",
              "score": 1,
              "created_utc": 1735336723.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m44dfpb",
          "author": "plsfreeguccimane",
          "body": "Everything in your life will be more expensive other than maybe pasta and wine.",
          "score": 1,
          "created_utc": 1735346886.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m411pcg",
      "author": "Noctew",
      "body": "We're happy to take all of them you can no longer afford to import to the US. Signed: EU.",
      "score": 1,
      "created_utc": 1735306026.0,
      "replies": []
    },
    {
      "id": "m417bc9",
      "author": "Miracle420",
      "body": "I have all my parts I need for my build besides MOBO so I'm mostly good. Guess I should buy that too soon just to be safe though. \n\nWill chinese sites like AliExpress get a lot more expensive as well? I dont see how they wouldn't but I like ordering from them and hope not! During Trump's first term goods were actually cheaper from China for me (albeit shipping took longer) so I'm remaining positive...",
      "score": 1,
      "created_utc": 1735308416.0,
      "replies": []
    },
    {
      "id": "m4180sg",
      "author": "hyperforms9988",
      "body": "Any hope of getting one of these at a non-tariff price point, **if** they are going to sell at that price at all, is going to be absolutely eaten up by scalpers anyway.  The gold rush on these would be incredible if that happened.",
      "score": 1,
      "created_utc": 1735308705.0,
      "replies": []
    },
    {
      "id": "m4182p2",
      "author": "RocketPowah",
      "body": "Bull or bear?",
      "score": 1,
      "created_utc": 1735308727.0,
      "replies": []
    },
    {
      "id": "m418xm2",
      "author": "CrashnServers",
      "body": "Scamming",
      "score": 1,
      "created_utc": 1735309072.0,
      "replies": []
    },
    {
      "id": "m41b3ca",
      "author": "sheldoncooper1701",
      "body": "Nvidia hooked Elon up with XAI, so i can see Elon letting them slide. But the rest...yea",
      "score": 1,
      "created_utc": 1735309921.0,
      "replies": []
    },
    {
      "id": "m41lme2",
      "author": "ConsiderationOk8642",
      "body": "just bought my 4070 that i been mulling over",
      "score": 1,
      "created_utc": 1735313708.0,
      "replies": []
    },
    {
      "id": "m41m2n5",
      "author": "Zefrem23",
      "body": "Someone should dig a tunnel between China and the US so they can claim everything is locally manufactured since it's all coming out of this here \"mine\"",
      "score": 1,
      "created_utc": 1735313861.0,
      "replies": []
    },
    {
      "id": "m41mz1v",
      "author": "Rustmonger",
      "body": "4090s are still going for two grand. What in the world makes you think you would ever get a $2500 5090?",
      "score": 1,
      "created_utc": 1735314166.0,
      "replies": []
    },
    {
      "id": "m41o97j",
      "author": "Modsda3",
      "body": "Bought an rx7800 xt for this very reason the other day, despite my rx6600 still running fine. Should be set for a few years",
      "score": 1,
      "created_utc": 1735314597.0,
      "replies": []
    },
    {
      "id": "m41szwy",
      "author": "RyuChamploo",
      "body": "I hate every asshole that voted for this maniac. Thank you for making my hobby unaffordable. \n\nDark times ahead, ya’ll.",
      "score": 1,
      "created_utc": 1735316175.0,
      "replies": []
    },
    {
      "id": "m41temc",
      "author": "luckrzz",
      "body": "They'll finally get to experience EU prices",
      "score": 1,
      "created_utc": 1735316311.0,
      "replies": []
    },
    {
      "id": "m41wd5s",
      "author": "trobsmonkey",
      "body": "Where? I'm trying to buy one and an't fucking find a 4070ti super",
      "score": 1,
      "created_utc": 1735317272.0,
      "replies": []
    },
    {
      "id": "m41wgzp",
      "author": "johnny-T1",
      "body": "Aren't these made in Taiwan? I don't understand.",
      "score": 1,
      "created_utc": 1735317307.0,
      "replies": [
        {
          "id": "m421i80",
          "author": "Spicywolff",
          "body": "As if the Fatman would know the difference of Taiwan and China. It’s all China to him",
          "score": 1,
          "created_utc": 1735318922.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41ww0f",
      "author": "TheJesusGuy",
      "body": "I will stick with my 2080TI for a while then",
      "score": 1,
      "created_utc": 1735317442.0,
      "replies": []
    },
    {
      "id": "m41zcsg",
      "author": "_GuybrushThreepw00d",
      "body": "I’m so happy I managed to snag a brand new 4080 Super before the lot ran out on black friday. Looking forward to see the ridicilous pricing on the new 50-series.",
      "score": 1,
      "created_utc": 1735318234.0,
      "replies": []
    },
    {
      "id": "m420dls",
      "author": "SerExcelsior",
      "body": "The price of these will rise due to the demand prior to the tariffs. Everyone is scared they won’t be able to afford one after the fact, so they’re upgrading now thereby increasing the demand on a line of products that’s already limited. “Big Graphics” will undoubtedly raise the price to meet this demand since they know people are willing to pay for it\n\nEdit: autocorrect",
      "score": 1,
      "created_utc": 1735318561.0,
      "replies": []
    },
    {
      "id": "m4233mk",
      "author": "dargonmike1",
      "body": "I’m buying it to power my 27inch OLED 4k 240hz 0.01ms response time monitor",
      "score": 1,
      "created_utc": 1735319435.0,
      "replies": []
    },
    {
      "id": "m42edr8",
      "author": "_Aaronstotle",
      "body": "So should I buy a 4080 now? I’m on a 1080",
      "score": 1,
      "created_utc": 1735323009.0,
      "replies": [
        {
          "id": "m42xji5",
          "author": "ElDoRado1239",
          "body": "If you know about the upcoming price jump, all sellers know about the upcoming price jump. Either buy a 4080 last year or just let it happen, we'll get through.\n\nI'm on a 660Ti.",
          "score": 1,
          "created_utc": 1735329120.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42ez69",
      "author": "TheBlackArrows",
      "body": "Already on it",
      "score": 1,
      "created_utc": 1735323197.0,
      "replies": []
    },
    {
      "id": "m42fwbo",
      "author": "FD4L",
      "body": "The last card I bought was a 1070.\n\nMaybe it's just time to quit computer games...",
      "score": 1,
      "created_utc": 1735323490.0,
      "replies": []
    },
    {
      "id": "m42kh8y",
      "author": "defcry",
      "body": "$2500 4090 is reality in the eu with way lower salaries in majority of the states.",
      "score": 1,
      "created_utc": 1735324941.0,
      "replies": []
    },
    {
      "id": "m42lev9",
      "author": "SatsquatchTheHun",
      "body": "Could get two computers with gpu for 2500",
      "score": 1,
      "created_utc": 1735325239.0,
      "replies": []
    },
    {
      "id": "m42lg6n",
      "author": "twotgobblen1",
      "body": "You should not care about the price of a 5090. The XX90 cards have always been for high end rendering and 3d work, not gaming. It's a card you get for your job. Getting a XX90 over an XX80 for gaming is like getting a 1st class plane ticket for a 2 hour ride.\n\nYou probably shouldn't be concerned about the price of the 5090...now the 5080, yeah",
      "score": 1,
      "created_utc": 1735325251.0,
      "replies": []
    },
    {
      "id": "m42nrsw",
      "author": "Spacebotzero",
      "body": "This is what the US voted for.",
      "score": 1,
      "created_utc": 1735325990.0,
      "replies": []
    },
    {
      "id": "m42xh7r",
      "author": "Foodspec",
      "body": "Good thing I **FINALLY** upgraded from dual 1070ti to a 4080. I have no intention of upgrading again anytime soon",
      "score": 1,
      "created_utc": 1735329099.0,
      "replies": []
    },
    {
      "id": "m4312kc",
      "author": "FrootLoop23",
      "body": "Forty percent on top of what stores will be gouging, on top of Nvidia’s inflated price. \n\nI’ll just sit this one out. There’s nothing I can’t already run.",
      "score": 1,
      "created_utc": 1735330267.0,
      "replies": []
    },
    {
      "id": "m436tw6",
      "author": "MonstersinHeat",
      "body": "I’m expecting dark days ahead for gaming hardware and I’ll be keeping my 7800xt and B580 for a while.",
      "score": 1,
      "created_utc": 1735332145.0,
      "replies": []
    },
    {
      "id": "m43bcty",
      "author": "Genoblade1394",
      "body": "Tus is a much needed boost to the Chinese economy and going to be a big bust for ours because some of these might not go into effect because they just don’t make sense",
      "score": 1,
      "created_utc": 1735333619.0,
      "replies": []
    },
    {
      "id": "m43emsp",
      "author": "Neo_Techni",
      "body": "Trudeau already did this to Canada over the last few years. We used to at parity with the USD just before Covid",
      "score": 1,
      "created_utc": 1735334691.0,
      "replies": []
    },
    {
      "id": "m43ex62",
      "author": "Thrawn4191",
      "body": "Think this affects console pricing too or just PCs?",
      "score": 1,
      "created_utc": 1735334785.0,
      "replies": [
        {
          "id": "m43ipcg",
          "author": "tagless1",
          "body": "Most of the console parts are made over seas, yes the tariffs should affect those prices as well.",
          "score": 1,
          "created_utc": 1735336023.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m43fmv8",
      "author": "CharminUltra_TP",
      "body": "I’m going to skip building a new PC. F these tariffs.",
      "score": 1,
      "created_utc": 1735335018.0,
      "replies": []
    },
    {
      "id": "m43r572",
      "author": "None",
      "body": "Gonna be 'supply chain issues' all over again.\n\nJack up the price. Give the CEO bonuses. Fleece the customers. \n\nBecause we have no choice as the whole industry is doing it.",
      "score": 1,
      "created_utc": 1735338855.0,
      "replies": []
    },
    {
      "id": "m43stbn",
      "author": "christiandb",
      "body": "Strange, I thought tech from specific companies weren’t gonna be affected.",
      "score": 1,
      "created_utc": 1735339428.0,
      "replies": []
    },
    {
      "id": "m43xgu9",
      "author": "DoomSayerNihilus",
      "body": "Welcome to European prices.",
      "score": 1,
      "created_utc": 1735341058.0,
      "replies": []
    },
    {
      "id": "m441l9j",
      "author": "Dp152578",
      "body": "The 5080 will cost $5080 on day one",
      "score": 1,
      "created_utc": 1735342562.0,
      "replies": []
    },
    {
      "id": "m446zlt",
      "author": "jfk_47",
      "body": "How will this affect the stock price?",
      "score": 1,
      "created_utc": 1735344545.0,
      "replies": []
    },
    {
      "id": "m4479xp",
      "author": "James-Cooper123",
      "body": "Me who bought a RX 6950XT for just 600 bucks a few years back: ok…….",
      "score": 1,
      "created_utc": 1735344650.0,
      "replies": []
    },
    {
      "id": "m447pxs",
      "author": "contrabang",
      "body": "I better start saving then.",
      "score": 1,
      "created_utc": 1735344812.0,
      "replies": []
    },
    {
      "id": "m448yse",
      "author": "deathtech00",
      "body": "Yes. \n\n\nThe answer is yes. \n\n\nThis is their new business model that appeals to robo-buyers and scalpers. This was the game plan all along.",
      "score": 1,
      "created_utc": 1735345262.0,
      "replies": []
    },
    {
      "id": "m44n85y",
      "author": "ThatGuyFromTheM0vie",
      "body": "Oh the $2500 5090 was going to be that much pre-tariff",
      "score": 1,
      "created_utc": 1735350567.0,
      "replies": []
    },
    {
      "id": "m44ov00",
      "author": "None",
      "body": "They're gonna scalp their own cards this time",
      "score": 1,
      "created_utc": 1735351202.0,
      "replies": []
    },
    {
      "id": "m452kgr",
      "author": "drakanarkis",
      "body": "I dont know. Im lucky im not a gamer or a person who needs these rigs. Im happy with my current rtx 2060, 1TB RAM, 512GB nvme.",
      "score": 1,
      "created_utc": 1735356695.0,
      "replies": []
    },
    {
      "id": "m45851m",
      "author": "Mycatspiss",
      "body": "Make them with intel :)",
      "score": 1,
      "created_utc": 1735359055.0,
      "replies": []
    },
    {
      "id": "m459v0f",
      "author": "idcenoughforthisname",
      "body": "They aren’t going to launch at MSRP #1 and increase it to MSRP #2 once tariff hits. They will price it at MSRP #2 at launch and then see how much tariff increase is. If it’s higher, then they’ll increase it to MSRP #3. If it’s lower, they’ll keep it at MSRP #2 and keep the difference as increased profit margin.",
      "score": 1,
      "created_utc": 1735359804.0,
      "replies": []
    },
    {
      "id": "m45a9nd",
      "author": "watchshoe",
      "body": "I want to buy one just to have it for my someday PC, at this point it’ll be like 6 years before I can afford everything",
      "score": 1,
      "created_utc": 1735359983.0,
      "replies": []
    },
    {
      "id": "m45i491",
      "author": "None",
      "body": "Neither is made in China.",
      "score": 1,
      "created_utc": 1735363647.0,
      "replies": []
    },
    {
      "id": "m45in4p",
      "author": "Azuljustinverday",
      "body": "I’ve impulse bought so much stuff recently to avoid tariffs",
      "score": 1,
      "created_utc": 1735363903.0,
      "replies": []
    },
    {
      "id": "m45ivl0",
      "author": "Chidorin1",
      "body": "4,500$ \n\np. s. just checked, 4090 is already 3000$-4000$ in my region 🤦‍♂️",
      "score": 1,
      "created_utc": 1735364018.0,
      "replies": []
    },
    {
      "id": "m45qeuc",
      "author": "DrKersh",
      "body": "how they will justify selling the cards for the same price in europe after the tariffs?",
      "score": 1,
      "created_utc": 1735367986.0,
      "replies": []
    },
    {
      "id": "m45wz8l",
      "author": "mrureaper",
      "body": "Consumers should simple choose to not open their wallets and let them find out they can't just keep getting away with those stupid prices that they arficially inflated themselves for more profit",
      "score": 1,
      "created_utc": 1735371903.0,
      "replies": [
        {
          "id": "m49cxca",
          "author": "Tsofuable",
          "body": "It's called tariffs, It's decided by your government - not the manufacturers. Trump wants you to find and buy American graphics cards instead.",
          "score": 1,
          "created_utc": 1735424150.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m45ylrk",
      "author": "MaximusMurkimus",
      "body": "I'm feeling vindicated about my 7900XTX now\n\nI don't think these tariffs will be as dramatic as everyone's making them out to be, but the potential schuenfreude kinda make me wish they are",
      "score": 1,
      "created_utc": 1735372949.0,
      "replies": []
    },
    {
      "id": "m461nq7",
      "author": "OasisRush",
      "body": "This is exactly why BTC miners are soaring next yr. Their equipment is pure gpus.  And their holdings are BTC. And tariffs. We're going to see a once in life time leap",
      "score": 1,
      "created_utc": 1735374962.0,
      "replies": []
    },
    {
      "id": "m46bfvm",
      "author": "vergorli",
      "body": "couldn't care less, my 2080 is so good, it will probably take another 5 years for me to need a better one. The times where I bought a new GPU every other year is definitvely over. \n\nWitcher 4 might make me reconsider it. But thats the only one and its probably years away from release.",
      "score": 1,
      "created_utc": 1735381570.0,
      "replies": [
        {
          "id": "m4r2vqf",
          "author": "themrgq",
          "body": "Geralt isn't the main character tho 😥",
          "score": 1,
          "created_utc": 1735679124.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m46nar4",
      "author": "anskyws",
      "body": "Over react much?",
      "score": 1,
      "created_utc": 1735389117.0,
      "replies": []
    },
    {
      "id": "m46zmgs",
      "author": "State_Dear",
      "body": "lol... Only to have it all crash when nothing happens,, \n\nBig sales coming up",
      "score": 1,
      "created_utc": 1735395123.0,
      "replies": []
    },
    {
      "id": "m470rn6",
      "author": "irishfro",
      "body": "Bought a 4080Ti 3 months ago. I'm happy",
      "score": 1,
      "created_utc": 1735395617.0,
      "replies": []
    },
    {
      "id": "m47ucs5",
      "author": "TheBrain511",
      "body": "More like 4000 dollars \n\nWe all know it won’t be sold at msrp people",
      "score": 1,
      "created_utc": 1735406223.0,
      "replies": []
    },
    {
      "id": "m48ikt7",
      "author": "XuX24",
      "body": "Man I thought things would get cheaper or I was told that.",
      "score": 1,
      "created_utc": 1735414082.0,
      "replies": []
    },
    {
      "id": "m491duh",
      "author": "ledoscreen",
      "body": "In other words, prices are already rising.",
      "score": 1,
      "created_utc": 1735420289.0,
      "replies": []
    },
    {
      "id": "m4a8mp6",
      "author": "dustofdeath",
      "body": "So US finally gets a taste of EU PC market.",
      "score": 1,
      "created_utc": 1735435064.0,
      "replies": []
    },
    {
      "id": "m4ag8ih",
      "author": "yabuslay",
      "body": "I got a PS5 as a stopgap gaming machine after my PC started performing worse. The PS5 has been great for that while I get finances straight and start to save up for it.\n\nNow even mid-tier cards are gonna be upwards 2x the price of a good console. With upcoming tariffs I doubt I’ll be able to build for the next 4-8 years. \n\nI miss the days where a $1500 build would outperform consoles so much that it was actually a justifiable investment.",
      "score": 1,
      "created_utc": 1735437860.0,
      "replies": []
    },
    {
      "id": "m4b9ixi",
      "author": "LonelySquad",
      "body": "That's not what will happen. People are crazy if they genuinely think it will.",
      "score": 1,
      "created_utc": 1735449774.0,
      "replies": []
    },
    {
      "id": "m4bcahr",
      "author": "arcaias",
      "body": "Hang in there a bit longer 3090 it's going to be a long 4 years...",
      "score": 1,
      "created_utc": 1735451116.0,
      "replies": []
    },
    {
      "id": "m4be6qr",
      "author": "jj_xl",
      "body": "Me and my 3080ti for $800 is gonna be juuuust fine",
      "score": 1,
      "created_utc": 1735452068.0,
      "replies": []
    },
    {
      "id": "m4bf364",
      "author": "foofyschmoofer8",
      "body": "Step 1. Stockpile GPUs before tariffs at the current price. \n\nStep 2. Sell GPUs for 40% markup anyway.",
      "score": 1,
      "created_utc": 1735452539.0,
      "replies": []
    },
    {
      "id": "m4bu4b0",
      "author": "Bgreen15",
      "body": "![gif](giphy|gLcUFh2TrdySKUnTHD)",
      "score": 1,
      "created_utc": 1735461384.0,
      "replies": []
    },
    {
      "id": "m4dhbwr",
      "author": "Thestickleman",
      "body": "I doubt it will. His tarrifs probably won't go through and if they do they won't be that severe",
      "score": 1,
      "created_utc": 1735490311.0,
      "replies": []
    },
    {
      "id": "m4du8la",
      "author": "N3rot0xin",
      "body": "So, prices are going to go up 40pct anyways just because now? Rip. 5000 series is over rated anyways.",
      "score": 1,
      "created_utc": 1735494354.0,
      "replies": []
    },
    {
      "id": "m4khnii",
      "author": "13Krytical",
      "body": "The great thing about the timing of the new series of card?\n\nThere are no PC games for anyone to give a shit about upgrading their cards for!\n\nAnything anyone wants to play, can play just fine for 90% of people on the previous 3 generations of graphics.\n\nIf you’re competitive?\nYou’re already likely on 40 series, but I find zero reason for a gamer to upgrade to this.",
      "score": 1,
      "created_utc": 1735586515.0,
      "replies": []
    },
    {
      "id": "m4m2aoh",
      "author": "HempusMaximus",
      "body": "I guess my GPU hoarding problem might pay off.",
      "score": 1,
      "created_utc": 1735604579.0,
      "replies": []
    },
    {
      "id": "m4ofm59",
      "author": "Lars_Fletcher",
      "body": "We can always dream of a better outcome. Tariffs are just for a show, and won’t actually be implemented. Gpus are being overproduced. So we might get them cheaper?",
      "score": 1,
      "created_utc": 1735644821.0,
      "replies": []
    },
    {
      "id": "m4qjswf",
      "author": "AlwaysAttack",
      "body": "yes....so they can gouge the extra money when they jack the prices anyway.",
      "score": 1,
      "created_utc": 1735672854.0,
      "replies": []
    },
    {
      "id": "m4r2ro7",
      "author": "themrgq",
      "body": "So should I wait to sell my 2080 super that's just collecting dust then...?",
      "score": 1,
      "created_utc": 1735679086.0,
      "replies": []
    },
    {
      "id": "m575o5u",
      "author": "Wittybiznis",
      "body": "Lol bullshit. Plus, they're coming out of Taiwan, not China. Even if they did impose tarrifs, they wouldn't sell for +40%",
      "score": 1,
      "created_utc": 1735919919.0,
      "replies": []
    },
    {
      "id": "m5ub3zf",
      "author": "Due-Rip-5860",
      "body": "Oh no , apparently all you have to do is donate to the Trump Inaugural fund to avoid tarrifs",
      "score": 1,
      "created_utc": 1736236871.0,
      "replies": []
    },
    {
      "id": "m40v3vv",
      "author": "None",
      "body": "FIFO?\n\nLIFO?\n\nActually it's FAFO.",
      "score": -2,
      "created_utc": 1735302831.0,
      "replies": []
    },
    {
      "id": "m42ehbd",
      "author": "IndyEleven11",
      "body": "Boycott.  Let Nvidia choke on them.",
      "score": 1,
      "created_utc": 1735323040.0,
      "replies": []
    },
    {
      "id": "m42esri",
      "author": "ToMorrowsEnd",
      "body": "Doesnt matter the Intel card is gonna kick the crap out of Nvidia.  considering they are selling a $250 card that destroys the 4060 right now, and the 40 series was just overall MEH over the 30 series.  I am betting the 50 series is not going to be worth buying.\n\nIntel needs to make a card with 24Gb ram for these damned texture hungry games to force Nvidia to give us decent ram sizes and focus on gamers and not the Crypto and AI bros.\n\nI see the crypto and AI bros are out in force down voting, all of us gamers hate you.",
      "score": 1,
      "created_utc": 1735323142.0,
      "replies": [
        {
          "id": "m44011k",
          "author": "higuy721",
          "body": "Will there be no tariffs imposed on Intel products then?",
          "score": 1,
          "created_utc": 1735341989.0,
          "replies": [
            {
              "id": "m44wgto",
              "author": "ToMorrowsEnd",
              "body": "American company and if they make them inside the USA they cant be tarriffed.  Or they simply make them in china and final assembly in the USA using the Harley Davidson trick to claim. \"made in the usa\"",
              "score": 0,
              "created_utc": 1735354237.0,
              "replies": [
                {
                  "id": "m46gwh0",
                  "author": "higuy721",
                  "body": "But then the components that are sent to the US are still being taxed with tariffs before assembly.",
                  "score": 0,
                  "created_utc": 1735385196.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m42mczx",
      "author": "Key_Pace_2496",
      "body": "Bro acts like Nvidia wasn't going to price the 5090 at that on their own anyway lmao.",
      "score": 1,
      "created_utc": 1735325542.0,
      "replies": []
    },
    {
      "id": "m426b7f",
      "author": "smackythefrog",
      "body": "If I were an asshole company, I'd stockpile what already exists. Raise it 20-40%. Blame tariffs. \n\nNew stuff comes out? Raise it another 20-30% from the already inflated cost. Blame tariffs and shrug shoulders and side-eye the government when asked about pricing. \n\nContinue to give to said government and profit.",
      "score": 1,
      "created_utc": 1735320459.0,
      "replies": []
    },
    {
      "id": "m42h695",
      "author": "ShoshiOpti",
      "body": "There's 0 percent chance trump is going to put tarrifs on chip parts. Stupidest thought ever.",
      "score": 1,
      "created_utc": 1735323893.0,
      "replies": [
        {
          "id": "m437i5q",
          "author": "pdhot65ton",
          "body": "Why is that?  Biden has the Chips act going, with a gial of bringing production back to the US, and companies like Intel are building plants as we speak.  Do you not think he would place tariffs on internationally produced chips to strengthen the domestically produced chips?  Honestly, it's one tariff that actually makes sense.   That said, he doesn't do anything that makes sense, or at least that is not self-serving, and since the CHIPS act is a Biden thing,  it makes sense he would undermine it.",
          "score": 1,
          "created_utc": 1735332368.0,
          "replies": [
            {
              "id": "m44az3o",
              "author": "ShoshiOpti",
              "body": "Cause taxing chips will fuck over Elon and Peter Theil the most, also it would slow down the AI race which is a national security issue. \n\nEven if we wanted 100% American chips it would take a decade to build out the facilities assuming TSMC gives us current gen specs. \n\nVolume is hard to scale. \n\nNot to mention divesting from taiwan is a massive security issue because you'd be dramatically increasing the chance of those chips getting to China (west taiwan)",
              "score": 1,
              "created_utc": 1735345993.0,
              "replies": []
            },
            {
              "id": "m4canv8",
              "author": "Suspicious_Surprise1",
              "body": "yeah the CHIPS act was a great idea on paper, but if you take a look at intels stock right now, you'll see how giving private companies free tax-payer money and a license to never go bankrupt so long as they're deemed \"necessary to national security,\" well, it doesn't always produce the results you are looking for.",
              "score": 1,
              "created_utc": 1735472168.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m42iyl8",
      "author": "gay_manta_ray",
      "body": "sincerely doubt these tariffs are going to end up being implemented. americans are not going to react well to the price of so many things increasing by such a substantial amount.",
      "score": 1,
      "created_utc": 1735324458.0,
      "replies": []
    },
    {
      "id": "m42qccj",
      "author": "Tay_Tay86",
      "body": "Pass. I am not paying 2500$ for one card that will be out dated in 2 years. \n\nI'll just play new games on PS5 pro",
      "score": 1,
      "created_utc": 1735326810.0,
      "replies": [
        {
          "id": "m42x4j8",
          "author": "ElDoRado1239",
          "body": ">I'll just play new games on PS5 pro\n\nWhich one of the two will you play?",
          "score": 2,
          "created_utc": 1735328989.0,
          "replies": [
            {
              "id": "m431hnf",
              "author": "Tay_Tay86",
              "body": "The remaster of mgs3. I never played it when it was first released. Tlou part 2.\n\n\nThere s more",
              "score": 3,
              "created_utc": 1735330404.0,
              "replies": [
                {
                  "id": "m435k5g",
                  "author": "ElDoRado1239",
                  "body": "My aspirations are quite lower. I'd like to play Reigns: Her Majesty, but for some reason the game only offers me a selection from 5 duplicate 4K resolutions, which fries my poor old 660Ti.",
                  "score": 1,
                  "created_utc": 1735331729.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m42tz8g",
      "author": "Kuli24",
      "body": "Consoles have never looked more attractive.",
      "score": 1,
      "created_utc": 1735327970.0,
      "replies": []
    },
    {
      "id": "m411wxs",
      "author": "DontNeedProtection",
      "body": "MAKE AMERICA GREAT AGAIN!😂",
      "score": -2,
      "created_utc": 1735306120.0,
      "replies": []
    },
    {
      "id": "m411ghk",
      "author": "tsukahara10",
      "body": "So would now be a good or a bad time to buy AMD and NVDA stock?",
      "score": 0,
      "created_utc": 1735305916.0,
      "replies": [
        {
          "id": "m414z6b",
          "author": "_femcelslayer",
          "body": "Announcement of a general tariff that does not exempt GPUs or at least datacenter GPUs would hurt not just both tickers but all of top tech and likely tank the market. That’s why I don’t think this will happen, he’ll exempt this. Elon does not want to pay 40% for G100s and Trump loves when the stock market goes up.",
          "score": 6,
          "created_utc": 1735307440.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m40z1w8",
      "author": "Homewra",
      "body": "What the fuck are you guys playing with a 2500USD GPU anyways? 8K unoptimized flop?",
      "score": -4,
      "created_utc": 1735304812.0,
      "replies": []
    },
    {
      "id": "m41gqoc",
      "author": "wornoutseed",
      "body": "Easy fix stop buying them at the prices they set. Wait a while and buy it for half.",
      "score": 0,
      "created_utc": 1735312022.0,
      "replies": []
    },
    {
      "id": "m41tun8",
      "author": "Erowidx",
      "body": "Nvidia worried about the price of their GPUs going up. LMAO right.",
      "score": 0,
      "created_utc": 1735316457.0,
      "replies": []
    },
    {
      "id": "m42wzwg",
      "author": "newellz",
      "body": "Unfortunately, once these MAGAt fuckos are in gear, expensive GPUs will be one of the lesser of our concerns. Nation-altering shit is about to take place, folks.",
      "score": 0,
      "created_utc": 1735328948.0,
      "replies": [
        {
          "id": "m43f22x",
          "author": "Neo_Techni",
          "body": "> Nation-altering shit is about to take place, folks.\n\nthat's why they voted for him. You couldn't survive another 4 years of Biden policies",
          "score": -1,
          "created_utc": 1735334829.0,
          "replies": [
            {
              "id": "m43i11z",
              "author": "newellz",
              "body": "I couldn’t?",
              "score": 1,
              "created_utc": 1735335802.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m40wsar",
      "author": "FixTheUSA2020",
      "body": "Where did Trump mention a tariff on Taiwan? Did I miss that?",
      "score": -9,
      "created_utc": 1735303702.0,
      "replies": [
        {
          "id": "m40yckp",
          "author": "shofmon88",
          "body": "10% tariffs for ALL trading partners, except China, which gets a 60% tariff.",
          "score": 12,
          "created_utc": 1735304476.0,
          "replies": [
            {
              "id": "m41ajo9",
              "author": "FixTheUSA2020",
              "body": "Then why is this saying a 40% increase in graphics cards?",
              "score": -3,
              "created_utc": 1735309708.0,
              "replies": [
                {
                  "id": "m41dyks",
                  "author": "shofmon88",
                  "body": "Because not all the components come from China. Averaging out the tariffs across the different sources gets you roughly 40% total price increase. ",
                  "score": 3,
                  "created_utc": 1735311013.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m40y0gq",
          "author": "vau1tboy",
          "body": "Trump wants a flat tariff on everything coming into the country. He also called the chips act bad. \n\nRead this: \n\nhttps://finance.yahoo.com/news/how-the-trump-tariffs-on-taiwan-chips-could-hurt-the-ai-trade--and-the-likes-of-nvidia-153010013.html",
          "score": 18,
          "created_utc": 1735304314.0,
          "replies": []
        },
        {
          "id": "m40yzfv",
          "author": "Professor_Nincompoop",
          "body": "He has talked about a 10-20% Tariff on ALL imported goods.  He has also floated a CPU/GPU specific Tariff as an alternative to the funding provided in the CHIPs Act.",
          "score": 9,
          "created_utc": 1735304779.0,
          "replies": []
        },
        {
          "id": "m40x1qy",
          "author": "None",
          "body": "[deleted]",
          "score": 5,
          "created_utc": 1735303834.0,
          "replies": [
            {
              "id": "m40y3t8",
              "author": "I_was_like_umm",
              "body": "Don't hate on someone asking for a source.  Reddit is not great at separating facts from propaganda.",
              "score": 5,
              "created_utc": 1735304359.0,
              "replies": []
            },
            {
              "id": "m40zupq",
              "author": "drae-",
              "body": "Nvidia stock is already up above its minor correction from trumps announcement.\n\nThe market doesn't seem to think it will be that impactful on Nvidia.\n\nTrump wants to cut deals. Nvidia, apple, amd, intel. Americas juggernaughts rely on tsmc, he will probably cut a deal.\n\nThis is his most standard tactic. He's haggling, and like when most people haggle they start high and end up somewhere in the middle.",
              "score": -5,
              "created_utc": 1735305186.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m410qla",
      "author": "UrbanFuturistic",
      "body": "The 5090 was gonna be $2500, tariffs or not.",
      "score": -5,
      "created_utc": 1735305592.0,
      "replies": []
    },
    {
      "id": "m40x0t9",
      "author": "Melliodass",
      "body": "I hope Europe will be oke.",
      "score": -1,
      "created_utc": 1735303820.0,
      "replies": [
        {
          "id": "m418dpu",
          "author": "drmirage809",
          "body": "We won’t be. There’s no way in hell GPUs get to be significantly cheaper here than they are across the big pond. \n\nBest we can hope for is the old farts in Brussels telling Nvidia to behave or get bend.",
          "score": 1,
          "created_utc": 1735308850.0,
          "replies": [
            {
              "id": "m41h61e",
              "author": "Rage_Like_Nic_Cage",
              "body": "also, if there is a significant price difference, Americans would just buy in europe and have it shipped over. The cost of shipping would be less than the tarrifs.",
              "score": 0,
              "created_utc": 1735312174.0,
              "replies": [
                {
                  "id": "m44mta8",
                  "author": "drmirage809",
                  "body": "Don’t even have to go to Europe. Canada is right there.",
                  "score": 1,
                  "created_utc": 1735350410.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m40zxlp",
      "author": "Talonzor",
      "body": "Welcome to the rest of the world.pricing",
      "score": -1,
      "created_utc": 1735305223.0,
      "replies": []
    },
    {
      "id": "m447yj7",
      "author": "5ergio79",
      "body": "Good. Hope the jackasses who stayed home playing games instead of voting enjoy the higher prices.",
      "score": -1,
      "created_utc": 1735344900.0,
      "replies": [
        {
          "id": "m44b9s2",
          "author": "tidder-la",
          "body": "Yup",
          "score": 0,
          "created_utc": 1735346099.0,
          "replies": []
        },
        {
          "id": "m44cuts",
          "author": "Fenrrr",
          "body": "Why are policies designed to encourage economic growth in your own country such a bad thing to you?",
          "score": -6,
          "created_utc": 1735346677.0,
          "replies": [
            {
              "id": "m44emy9",
              "author": "5ergio79",
              "body": "Tariffs don’t encourage economic growth. They tax the citizens.",
              "score": 4,
              "created_utc": 1735347328.0,
              "replies": [
                {
                  "id": "m45a5tf",
                  "author": "Fenrrr",
                  "body": "Uh? You're telling me that an industry that moves domestic and produces cheaper than a tarrif'd import is somehow a tax on citizens?\n\nBut hell, even barring that. You're telling me that you'd rather enjoy slightly cheaper products at the support of a country that encourages and conducts human rights abuses? Says a lot about you, friend.",
                  "score": -2,
                  "created_utc": 1735359937.0,
                  "replies": [
                    {
                      "id": "m468ynu",
                      "author": "5ergio79",
                      "body": "What you’re talking about is a best case scenario that almost certainly won’t happen. Also, you’re a fool if you think moving manufacturing here will bring costs down. You think these companies will just eat the costs? No part of this will make things cheaper. It’ll just avoid being exorbitantly more expensive. That is, until the scalpers get involved. But go ahead and do your virtue signaling dance to hide how much you don’t understand business.",
                      "score": 0,
                      "created_utc": 1735379888.0,
                      "replies": [
                        {
                          "id": "m46qvss",
                          "author": "Fenrrr",
                          "body": "Lmao, sure sure. All studies indicate at worst? It tends to be a fraction of a % in GDP losses over multiple years, truly that'll increase prices significantly! \n\nAnd sure, hide Human rights abuses and funding them as 'Virtue signalling'. Actually MAGA level logic right here.",
                          "score": 1,
                          "created_utc": 1735391058.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m40yxnj",
      "author": "atlasfailed11",
      "body": "A tarrif on one product makes other economic  sectors less competitive.\n\nFor example China will have more gpu's available to use for AI research. While us based companies will have to pay more for their hardware.",
      "score": -3,
      "created_utc": 1735304755.0,
      "replies": [
        {
          "id": "m418uzh",
          "author": "TehOwn",
          "body": "Proponents seem to think that Intel, AMD and NVIDIA will move all their production lines into the US where costs are higher and the capacity simply doesn't exist.",
          "score": 2,
          "created_utc": 1735309043.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m411qkg",
      "author": "Zippier92",
      "body": "Buy intc!",
      "score": 0,
      "created_utc": 1735306041.0,
      "replies": []
    },
    {
      "id": "m423bdp",
      "author": "None",
      "body": "Totally worth the extra 6 frames that my eyes can't even process",
      "score": 0,
      "created_utc": 1735319504.0,
      "replies": []
    },
    {
      "id": "m426fbf",
      "author": "radome9",
      "body": "Are there no GPUs manufactured in USA? Honest question. Isn't Intel an American company? I've heard good things about their latest GPU.",
      "score": 0,
      "created_utc": 1735320504.0,
      "replies": [
        {
          "id": "m428ijj",
          "author": "WordNERD37",
          "body": "Being an American company doesn't ever mean manufacturing happens on American soil. Even if it does, the materials are outsourced. \n\nThere are no good scenarios for these tariffs beyond running cover for rich assholes to raise prices to absurd levels. Tariffs now, it was inflation before and will again.",
          "score": 5,
          "created_utc": 1735321164.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m428pjl",
      "author": "Calphurnious",
      "body": "People will buy a 5090 regardless if there are tariffs or not.",
      "score": 0,
      "created_utc": 1735321225.0,
      "replies": []
    },
    {
      "id": "m42poz3",
      "author": "None",
      "body": "So buy calls?",
      "score": 0,
      "created_utc": 1735326605.0,
      "replies": []
    },
    {
      "id": "m42we5a",
      "author": "sali_nyoro-n",
      "body": "_Don't worry, the 5070 Ti will only be $1,600. The value GPU market is thriving._",
      "score": 0,
      "created_utc": 1735328743.0,
      "replies": []
    },
    {
      "id": "m432nhz",
      "author": "PornViewthrowaway",
      "body": "Is it possible we get cheaper hardware in other countries because of American tariffs?",
      "score": 0,
      "created_utc": 1735330782.0,
      "replies": []
    },
    {
      "id": "m433tcx",
      "author": "None",
      "body": "Cool, guess I'm done gaming once this PC dies",
      "score": 0,
      "created_utc": 1735331158.0,
      "replies": []
    },
    {
      "id": "m43jnzv",
      "author": "castellscl",
      "body": "All of you complaining just don't buy then, if the product doesn't sell they will lower prices to a point more inline where they should be.",
      "score": 0,
      "created_utc": 1735336338.0,
      "replies": []
    },
    {
      "id": "m43ldeo",
      "author": "unlimitedcode99",
      "body": "Trumpet PC parts prices is the least to worry of any normal American at this point. ALL CONSUMER GOODS PRICES WILL RISE. Only MAGAs that will be eating good this disastrous 4 years will be Muskrat tier ones.",
      "score": 0,
      "created_utc": 1735336896.0,
      "replies": []
    },
    {
      "id": "m43tfka",
      "author": "dissian",
      "body": "Honestly if this is the place it hurts I don't care.",
      "score": 0,
      "created_utc": 1735339642.0,
      "replies": []
    },
    {
      "id": "m43tvkc",
      "author": "None",
      "body": "Scalpers will ruin the launch just like last time anyway and guarantee noone will pay retail.",
      "score": 0,
      "created_utc": 1735339794.0,
      "replies": []
    },
    {
      "id": "m43zv4u",
      "author": "AphroditeExurge",
      "body": "honestly you guys keep your scalping and start bleeding. im gonna be happy playing my indie games that dont cost an arm and a leg while also being developed by soulless corrupt executives",
      "score": 0,
      "created_utc": 1735341927.0,
      "replies": []
    },
    {
      "id": "m44dzrh",
      "author": "RMJ1984",
      "body": "Move production to Europe and leave American. It's not like companies are forced to be there? unless it's something of dictatorship?.",
      "score": 0,
      "created_utc": 1735347093.0,
      "replies": []
    },
    {
      "id": "m45607w",
      "author": "tldnradhd",
      "body": "This is journalism? They'll get a news story out of this speculation, and they'll get another story out of the fact that prices increased or they didn't at some point in the future.\n\nBuy what you need when you need it. Don't put things your on your credit card because the price might go up. You'll pay your bank more in interest than the theoretical tariff. If you're buying a regular consumer graphics card in the neighborhood of $300-600, you make choices with your money. The pace of game development can only keep up with the player base. The 1% who opt for TOTL early adoption don't support the industry. Your self-worth isn't measured in FPS.",
      "score": 0,
      "created_utc": 1735358128.0,
      "replies": []
    },
    {
      "id": "m44nvkn",
      "author": "pseghers",
      "body": "Or they could just manufacture in the states and provide more jobs for the American people. There’s an idea.",
      "score": -2,
      "created_utc": 1735350819.0,
      "replies": [
        {
          "id": "m44prvq",
          "author": "kiriyaaoi",
          "body": "Anyone who thinks this will actually happen because of the tariffs is delusional",
          "score": 2,
          "created_utc": 1735351561.0,
          "replies": [
            {
              "id": "m49ugg2",
              "author": "pinkwar",
              "body": "It won't happen overnight but it's a step in that direction.\n\nNothing wrong with wanting to bring production to your own country.",
              "score": 2,
              "created_utc": 1735430237.0,
              "replies": []
            },
            {
              "id": "m44q7px",
              "author": "pseghers",
              "body": "I know it won’t. Never thought any company would. I’m making a statement. They would lose money that way. However I don’t think it’s a farfetched idea. A companies hand could become forced if it’s no longer lucrative to do business overseas. Nothing wrong with wanting what is best for the country I live in and the people in it. Go ahead and downvote again",
              "score": 0,
              "created_utc": 1735351735.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m420e9r",
      "author": "None",
      "body": "If they're doing that does that mean tariffs are going to happen? \n\nI think it's a bluff, but they know more than me",
      "score": -1,
      "created_utc": 1735318567.0,
      "replies": [
        {
          "id": "m42f7uz",
          "author": "Errant_coursir",
          "body": "Obviously tarrifs are happening, that was one of Trump's few campaign promises. Other than freezing Springfield from the pet eaters",
          "score": 2,
          "created_utc": 1735323274.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m42xj96",
      "author": "GenerationBop",
      "body": "This tariff BS is just an excuse to jack up prices across the board and not call it “inflation” that will come with this new term. It’s going to be a justified 2021-22 inflation on steroids.",
      "score": -1,
      "created_utc": 1735329118.0,
      "replies": []
    },
    {
      "id": "m430qyr",
      "author": "karateninjazombie",
      "body": "Ah. So there will be fuck all for the rest of the world markets while they scalp the yanks. Got it.",
      "score": -1,
      "created_utc": 1735330163.0,
      "replies": []
    },
    {
      "id": "m44g7h8",
      "author": "DQ11",
      "body": "Perfect time for American made chips and cards. Market for that just opened up",
      "score": -1,
      "created_utc": 1735347909.0,
      "replies": []
    },
    {
      "id": "m40xs5u",
      "author": "Phantasmalicious",
      "body": "2500 for 5090, hahaha, more like 7500 dollar card.",
      "score": -7,
      "created_utc": 1735304198.0,
      "replies": [
        {
          "id": "m415qf0",
          "author": "None",
          "body": "Any gamer buying such card is just stupid. The xx90 card entry are made for worstation, not gaming anyway but people are too dumb and think the higher the price, the better it will be. Then complain that games have problem",
          "score": 3,
          "created_utc": 1735307759.0,
          "replies": [
            {
              "id": "m418pwa",
              "author": "Phantasmalicious",
              "body": "If only it were so. I am going to rightfully assume that 5090 is the only card able to output 4k 144hz in most games (hopefully). I know it has to do with the optimisation of the games itself but it is what it is.",
              "score": 1,
              "created_utc": 1735308985.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m419ruf",
      "author": "blueblurspeedspin",
      "body": "I can live without modern games. Most have been really abysmal",
      "score": -2,
      "created_utc": 1735309407.0,
      "replies": []
    },
    {
      "id": "m42cvt3",
      "author": "DrNopeMD",
      "body": "Gamers can finally be the oppressed group they perceive themselves to be /s",
      "score": -2,
      "created_utc": 1735322538.0,
      "replies": []
    },
    {
      "id": "m44d8li",
      "author": "Lorenz99",
      "body": "The tariff has nothing to do with the insane price these companies will place on their cards. They will just be using the tariff as an excuse.",
      "score": -3,
      "created_utc": 1735346814.0,
      "replies": [
        {
          "id": "m44gs9b",
          "author": "LurkingRN",
          "body": "I mean… yeah they’re still going to charge an arm and a leg but don’t just ignore that the dumb ass proposed tariffs will raise the prices.",
          "score": 0,
          "created_utc": 1735348126.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m41vnd9",
      "author": "TYG06",
      "body": "The tariffs can’t be that bad, Redditors inform me why we are freaking out about this?",
      "score": -6,
      "created_utc": 1735317041.0,
      "replies": []
    },
    {
      "id": "m412wl6",
      "author": "Gunitsreject",
      "body": "All the people complaining about the tariffs. If we don’t buy at the inflated prices they will produce their products in the US to avoid the tariffs. Bringing production back to the US is the entire point. No company will give up the US market when it comes down to it.",
      "score": -19,
      "created_utc": 1735306552.0,
      "replies": [
        {
          "id": "m414pwb",
          "author": "njean777",
          "body": "And the people who actually believe that companies will return to manufacture in the US are delusional. It isn’t cost effective. Companies will charge the higher price and you will pay it.",
          "score": 13,
          "created_utc": 1735307331.0,
          "replies": [
            {
              "id": "m416g9f",
              "author": "Gunitsreject",
              "body": "I will not buy it and if you do you are the reason production won’t return. The US market still makes up a significant portion of all of these companies earnings. The cost of moving production to the US is nothing compared to the loss of earnings from the market.",
              "score": -12,
              "created_utc": 1735308059.0,
              "replies": [
                {
                  "id": "m41c2w1",
                  "author": "Lunaphase_Lasers",
                  "body": "The fact anyone believes these companies are gonna start investing in US fabs because Trump said so is hilarious.  Losing the NA market is definitely a loss, but moving production to NA would be the loss that keeps on losing.  \n\n5-8 years before you can even start producing anything, tens of billions sunk, and even then you're only at half your usual production capacity.  Labor is more expensive, regulations tighter, certifications more expensive, your supply chain is now fucked because it's subject to those same tarrifs, there is no world where it makes business sense.\n\nThey will charge the higher price, and you will pay it.  Or you simply won't have it.  End of.",
                  "score": 11,
                  "created_utc": 1735310303.0,
                  "replies": []
                },
                {
                  "id": "m41c6fi",
                  "author": "JohnnyGFX",
                  "body": "It takes years to set up production on these kinds of things. It isn’t just a matter of cost. And it isn’t just video cards that they will have an impact on price…",
                  "score": 3,
                  "created_utc": 1735310341.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m418ijb",
          "author": "TehOwn",
          "body": "Producing them in the US will increase prices anyway. Plus, it'll take ages to get the capacity up and running. And cost a huge amount. That money has to be paid by someone. That someone is the consumer.\n\nThe theory sounds great but it doesn't mean the consumer will ever be happy about being forced to pay more to benefit someone who isn't themselves.",
          "score": 5,
          "created_utc": 1735308904.0,
          "replies": []
        },
        {
          "id": "m418ds4",
          "author": "Chipmunks95",
          "body": "Manufacturing isn’t going to come back in any meaningful way to the USA ever, even with insanely high tariffs.  We lack the workforce to bring it back to be competitive with China in any sense.  Even with tariffs, it’s still cheaper for companies to produce their goods in places like China because the cost of the tariff is passed onto the consumer.  Biden has done a lot more for bringing manufacturing of computer parts to the US with the CHIPS Act while Trump has actually said he wants to get rid of the CHIPS Act.",
          "score": 2,
          "created_utc": 1735308851.0,
          "replies": []
        },
        {
          "id": "m417brq",
          "author": "KaosC57",
          "body": "Tariffs won’t bring more US manufacturing. Remember, you can pay a Chinese worker 1 USD/hr and not have any benefits, and they will happily make the same GPU that a USA worker would make for 20 USD/hr and have Healthcare benefits and days off and a retirement plan that all have to be paid for by the company.\n\nA USA worker costs significantly more than a Chinese worker. Which eats profit margins. So, when you have a USA made GPU, prepare to spend 2x the cost of the same GPU produced in China *even with Tariffs imposed*.",
          "score": 3,
          "created_utc": 1735308420.0,
          "replies": []
        },
        {
          "id": "m43dcfn",
          "author": "kinisonkhan",
          "body": "Or just wait for the next president to get elected, who will remove most of the tariffs. To plan, finance and build a factory in the USA would take much longer than 4 years, by that time the president, who's ass the company is kissing, will no longer be in office.\n\nEDIT: Also forgetting all the produce thats grown in Central America and imported into the USA.  You cant move this to the USA because we can only grow in season.  If your country is located near the equator, then you dont really have seasons and can grow all year round.   So hooray, an AMD CPU only cost $200 because its built in the USA, but bananas still cost $10 a bunch.",
          "score": 1,
          "created_utc": 1735334265.0,
          "replies": []
        }
      ]
    }
  ]
}