{
  "post": {
    "title": "Samsung is rolling out a smartphone subscription next month",
    "author": "TheMacMan",
    "id": "1hwst4n",
    "score": 0,
    "created_utc": 1736365018.0,
    "selftext": "",
    "num_comments": 53,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hwst4n/samsung_is_rolling_out_a_smartphone_subscription/"
  },
  "comments": [
    {
      "id": "m63mard",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736365019.0,
      "replies": []
    },
    {
      "id": "m63spur",
      "author": "DigitallyDetained",
      "body": "So now we pay a subscription to be on the mobile network and a subscription to the phone manufacturers as well? Cool cool cool.",
      "score": 79,
      "created_utc": 1736366884.0,
      "replies": [
        {
          "id": "m63vtru",
          "author": "diuturnal",
          "body": "The headline is slightly clickbait. You only pay to access cloud ai features. It's like google cloud, but worse in every way possible.",
          "score": 73,
          "created_utc": 1736367795.0,
          "replies": [
            {
              "id": "m647sue",
              "author": "None",
              "body": "Sounds like a win in my books. \n\nI don't want AI and it's all locked behind a paywall I don't want to pay? Winning!",
              "score": 47,
              "created_utc": 1736371267.0,
              "replies": [
                {
                  "id": "m64ammw",
                  "author": "Blue_Jays",
                  "body": "I have to pay for Bixby?  Yeah, ok.",
                  "score": 20,
                  "created_utc": 1736372086.0,
                  "replies": [
                    {
                      "id": "m64cfzo",
                      "author": "azlan194",
                      "body": "Oh no...  \nAnyway",
                      "score": 12,
                      "created_utc": 1736372615.0,
                      "replies": [
                        {
                          "id": "m6593ky",
                          "author": "Jesus_Is_My_Gardener",
                          "body": "I completely forgot my phone came with that on it. It was one of the first things I completely disabled.",
                          "score": 5,
                          "created_utc": 1736383039.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m6443gr",
              "author": "idontseecolors",
              "body": "Entirely click bait.",
              "score": 9,
              "created_utc": 1736370189.0,
              "replies": []
            },
            {
              "id": "m6505t1",
              "author": "DigitallyDetained",
              "body": "Yes, but I’m paying for a phone with hardware designed to handle AI tasks and don’t get access to AI features. They certainly wont be offering phones with CPUs that forego the neural cores for less money. \n\nOh well, I guess. I imagine it won’t be long before Apple et all start doing the same now.",
              "score": 1,
              "created_utc": 1736380030.0,
              "replies": []
            },
            {
              "id": "m64bmjh",
              "author": "TheSchlaf",
              "body": "Bixby bad or worse than that?",
              "score": 0,
              "created_utc": 1736372377.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m63u2b4",
          "author": "Nutchos",
          "body": "A lot of people finance their devices through carriers, this is not that different.",
          "score": -22,
          "created_utc": 1736367275.0,
          "replies": [
            {
              "id": "m63vn36",
              "author": "Djinnwrath",
              "body": "You end up owning the device at the end when financing. This is different in every way that matters",
              "score": 14,
              "created_utc": 1736367740.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m63vgth",
      "author": "dieselmiata",
      "body": "*\"AI-powered TVs, refrigerators, washing machines, and more\"*\n\nCan someone please explain just what the hell AI is doing washing machine? I really feel like AI is an answer to questions nobody asked.",
      "score": 28,
      "created_utc": 1736367688.0,
      "replies": [
        {
          "id": "m648gal",
          "author": "Kyvalmaezar",
          "body": "There's nothing actually AI about it. That's just a buzzword. It's all predetermined algorithms. \n\n\nIirc, it adds some water to the machine then times how long it takes to reach the bottom to determine the fabirc type. It determines load size based on a weight sensor, and soil level via a turbidity meter. After it has that info, it can set correct amount of detergent, water, wash cycle time. It's not the worst idea for a feature but nothing a chart and measurment lines couldnt solve (like how it's been done for decades).\n\n\n\nAll this could be easily baked into the machine itself but they likely offload it to their servers so they can use cheaper processors in the machines themselves and harvest data.",
          "score": 11,
          "created_utc": 1736371457.0,
          "replies": [
            {
              "id": "m655uor",
              "author": "CucumberError",
              "body": "My current, non smart washing machine does all this stuff, without AI or an internet connection. \n\nI plugged it into a smart plug. When the power usage drops below 5watts, it’s finished washing, and Alexa tells me to hang out the washing. \n\nCan’t really work out why you’d need it more smart than that.",
              "score": 2,
              "created_utc": 1736381949.0,
              "replies": [
                {
                  "id": "m65b1nj",
                  "author": "CatPhysicist",
                  "body": "> My current, non smart washing machine does all this stuff, without AI or an internet connection.\n\nWell, your next one may require an internet connection and require a subscription",
                  "score": 2,
                  "created_utc": 1736383689.0,
                  "replies": [
                    {
                      "id": "m66e3p9",
                      "author": "CucumberError",
                      "body": "Hah. Believe me, it won’t.",
                      "score": 2,
                      "created_utc": 1736398151.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m63zgx7",
          "author": "sweeney669",
          "body": "I mean this probably isn’t it at all, but I could make an argument for artificial intelligence in a washing machine. Being able to dump all your laundry in it and it can identify fabrics, colors, quantity, etc, to determine the best washing and drying settings so you don’t damage/shrink/bleed colors in your clothing.",
          "score": 2,
          "created_utc": 1736368863.0,
          "replies": [
            {
              "id": "m63zxgt",
              "author": "Schubert125",
              "body": "It's called \"normal\" and I have no idea what any of the other settings do.",
              "score": 20,
              "created_utc": 1736368997.0,
              "replies": [
                {
                  "id": "m6415fi",
                  "author": "sweeney669",
                  "body": "Couldn’t agree more, exactly what I do too. I’m not saying I’d want that kind of ai feature, just that I could see someone making the case for it.",
                  "score": 3,
                  "created_utc": 1736369346.0,
                  "replies": []
                },
                {
                  "id": "m654zxc",
                  "author": "Beardo88",
                  "body": "While we are at it, lets have a car without all sorts of touch screen junk i cant be bothered to learn how to use. Just give me a radio with old fashioned buttons. Dont want any of that factory bluetooth pairing either, I dont talk to people when im driving. Maybe a backup camera but fuck the rest of the techy crap.",
                  "score": 1,
                  "created_utc": 1736381663.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m6490nq",
              "author": "GapingFartLocker",
              "body": "I shove all my clothes in the washer and they come out clean.\n\nI don't need AI to do anything for that, I don't even need regular intelligence to do that.   There's nothing a washer can do to prevent colors from running and clothes shrink in the dryer not in the washer, again not something AI could determine.  Think of the sensors it would need to determine material, color etc.  and if you have a bunch of different materials in there how does it prioritize which ones get optimal settings?\n\nJust one more thing to break and need fixing.\n\nMy brand new washer has \"AI wash\".  I've never used it.",
              "score": 7,
              "created_utc": 1736371619.0,
              "replies": [
                {
                  "id": "m64e00r",
                  "author": "Cynical_Manatee",
                  "body": "You are not wrong about washing machines, but your answer is very reminiscent of people who said \"I just need my phone to be a phone, why does it have to be a computer\"\n\nLook where we are at now, for better or for worse.",
                  "score": 1,
                  "created_utc": 1736373059.0,
                  "replies": [
                    {
                      "id": "m64i9fp",
                      "author": "runningoutofnames01",
                      "body": "We put global information in everyone's pockets and a significant amount of people got dumber despite having access to damn near anything you want to know.",
                      "score": 3,
                      "created_utc": 1736374301.0,
                      "replies": [
                        {
                          "id": "m64mm5d",
                          "author": "Cynical_Manatee",
                          "body": "For better or for *worse* and a portion of the population definately went with for worse.",
                          "score": 1,
                          "created_utc": 1736375620.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m64h28x",
                      "author": "GapingFartLocker",
                      "body": "Haha yeah you've got a point there, maybe one day my washer will wash my clothes *and* give me therapy for depression or something wild like that",
                      "score": 2,
                      "created_utc": 1736373946.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m640isc",
              "author": "dieselmiata",
              "body": "Ya know, that's actually not a bad idea at all and would be pretty handy. \n\nI've just become so jaded and cynical that I actually have trouble fathoming a company using new tech to actually improve their product rather than just use it to harvest data and enshittify the world.",
              "score": -1,
              "created_utc": 1736369168.0,
              "replies": [
                {
                  "id": "m641ftr",
                  "author": "sweeney669",
                  "body": "Oh listen, I’m fully with you and totally see it and 99.999% of ai being used to enshittify the world. \n\nThat’s just the only logical use of ai in appliances like that imo.",
                  "score": -1,
                  "created_utc": 1736369429.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m659eoh",
          "author": "Jesus_Is_My_Gardener",
          "body": "Same reason everyone was throwing blockchain this and that a few years ago, hype train. They don't really care about delivering on the promise, they're just trying to take advantage of the buzz around the lingo.",
          "score": 1,
          "created_utc": 1736383142.0,
          "replies": [
            {
              "id": "m6852bo",
              "author": "dieselmiata",
              "body": "I forgot about blockchain, I think I still have some next to my \"3D\" toothpaste.",
              "score": 1,
              "created_utc": 1736431663.0,
              "replies": [
                {
                  "id": "m68dvro",
                  "author": "Jesus_Is_My_Gardener",
                  "body": "I'm so glad the hype over 3D TVs and monitors has died down. Don't get me wrong, for those who have and want to use 3D media, it's nice to have options, but I don't want to have the extra expense of a niche feature I will never use priced into my electronics, especially something that was obviously not going to become anything more than a novelty.",
                  "score": 1,
                  "created_utc": 1736434687.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m647idw",
          "author": "DaisyMa1",
          "body": "If AI will do my laundry, I'm all for it.",
          "score": 1,
          "created_utc": 1736371181.0,
          "replies": []
        },
        {
          "id": "m64dhjf",
          "author": "TheMacMan",
          "body": "Understand where items are placed in the dishwasher to adjust the cycle to make sure all items become clean. Spray more in one area than another or run an extra cycle if they find the dishes haven't come clean on the first cycle. Normal dishwashers run the heat drying for a set amount of time, which is likely longer than needed. AI could sense when they're actually dry and cut it short, saving electricity.\n\nNot sure if it does any of that but those are just a couple things they could address with it.",
          "score": 1,
          "created_utc": 1736372909.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m63mh03",
      "author": "ZellZoy",
      "body": "Wonder if it will end up like the Google pixel one",
      "score": 6,
      "created_utc": 1736365069.0,
      "replies": [
        {
          "id": "m63svtz",
          "author": "None",
          "body": "How did that work out?",
          "score": 2,
          "created_utc": 1736366932.0,
          "replies": [
            {
              "id": "m646pp9",
              "author": "ZellZoy",
              "body": "They canceled the program before the first free upgrade came due so a bunch of people paid extra for a single pixel phone",
              "score": 2,
              "created_utc": 1736370950.0,
              "replies": []
            },
            {
              "id": "m63tgw1",
              "author": "Im_eating_that",
              "body": "They made trillions more. There's a ton in your monitor and phone, you use them every day.",
              "score": 0,
              "created_utc": 1736367102.0,
              "replies": [
                {
                  "id": "m63tz0s",
                  "author": "None",
                  "body": "I’m so confused. Are you in the right thread?",
                  "score": 9,
                  "created_utc": 1736367248.0,
                  "replies": [
                    {
                      "id": "m63unri",
                      "author": "Ragnarock-n-Roll",
                      "body": "Pixel. It's a joke.",
                      "score": 8,
                      "created_utc": 1736367449.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m6441dr",
      "author": "idontseecolors",
      "body": "It's not a smartphone subscription.",
      "score": 2,
      "created_utc": 1736370173.0,
      "replies": [
        {
          "id": "m64iv65",
          "author": "runningoutofnames01",
          "body": "Piss poor title. It's subscription to a bunch of ai bullshit. I already avoid Bixby and Gemini and they're free.",
          "score": 3,
          "created_utc": 1736374480.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m64ohxe",
      "author": "mr_ji",
      "body": "1. It's only in Korea \n\n2. It offsets up front costs and is optional \n\n3. It's not on phones\n\n4. You can continue to use your phone the same way you have been, including AI\n\nGet this clickbait garbage out of here.\n\nThe rest of you, read before you start frothing at the mouth.",
      "score": 2,
      "created_utc": 1736376209.0,
      "replies": [
        {
          "id": "m653b57",
          "author": "TheAmateurletariat",
          "body": "Too late, I've decided Samsung is trying to murder my family",
          "score": 2,
          "created_utc": 1736381091.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m64ptjy",
      "author": "FamousFangs",
      "body": "Toss it in with Bixby as the things that'll never get used. \n\nI guess when you're the bulk of a country's GDP, you can make whatever dumb decisions you want.\n\n\nJust make smartphones cheaper again. \n\nSpend that money wisely, invest in people and hardware.\n\nAI is fuckin stupid and getting stupider, literally.",
      "score": 1,
      "created_utc": 1736376620.0,
      "replies": []
    },
    {
      "id": "m640s44",
      "author": "CrewMemberNumber6",
      "body": "I wonder if Apple was just messing with Samsung when they announced they were working on a subscription model for iPhones years ago. I think it was only last month Apple announced they were discontinuing the plan. Did Apple bait Samsung?",
      "score": 0,
      "created_utc": 1736369241.0,
      "replies": [
        {
          "id": "m64ccqo",
          "author": "TheMacMan",
          "body": "Apple's subscription was going to be similar to what service providers already have. T-Mobile, AT&T, and Verizon already offer the ability to upgrade whenever a new phone comes out and have accident coverage. That's what Apple was going to do too. And similar to what it sounds like Samsung wants to do. The article says it'll include repair coverage. Likely covers yearly upgrades too.",
          "score": 2,
          "created_utc": 1736372589.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m63xb8w",
      "author": "fire2day",
      "body": "The only people I can see benefiting from this is those who get a new phone every year or two, then trade in their old one to buy the next one.",
      "score": -7,
      "created_utc": 1736368234.0,
      "replies": [
        {
          "id": "m640i9e",
          "author": "BishopsBakery",
          "body": "It's cloud ai access, not hardware rental. Read more than a title bud.",
          "score": 6,
          "created_utc": 1736369164.0,
          "replies": [
            {
              "id": "m640mdp",
              "author": "fire2day",
              "body": "> Read more than a title\n\nYou must be new here.",
              "score": -6,
              "created_utc": 1736369197.0,
              "replies": [
                {
                  "id": "m64lbj4",
                  "author": "BishopsBakery",
                  "body": "Somebody eventually has to, poster should comment the text of it IMO",
                  "score": 1,
                  "created_utc": 1736375222.0,
                  "replies": [
                    {
                      "id": "m64mcxb",
                      "author": "fire2day",
                      "body": "The article's author should have titled it better. \"Samsung is rolling out a smartphone AI subscription next month\" would have fixed it with two letters.\n\nBut I also understand that they word these headlines *exactly* how they mean to.\n\nI guess I should read the articles as well, but that sounds like a lot of work.",
                      "score": 1,
                      "created_utc": 1736375541.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}