{
  "post": {
    "title": "iPhone SE 4 First to Get Apple-Designed 5G Modem, iPhone 17 Pro to Add Custom Wi-Fi 7 Chip",
    "author": "chrisdh79",
    "id": "1gh41pn",
    "score": 809,
    "created_utc": 1730463664.0,
    "selftext": "",
    "num_comments": 107,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gh41pn/iphone_se_4_first_to_get_appledesigned_5g_modem/"
  },
  "comments": [
    {
      "id": "luuykzj",
      "author": "con57621",
      "body": "I really hope it’s in the old mini form factor, I’d like to upgrade from the 13 mini in the future but I just can’t stand larger phones.",
      "score": 222,
      "created_utc": 1730470289.0,
      "replies": [
        {
          "id": "luv2ek0",
          "author": "millennialmonster755",
          "body": "I’ve only gotten SEs  for that same reason. I have tiny hands. The big phones feel horrible in my hands and are a pain to use.This iPad sized phone trend needs to end.",
          "score": 97,
          "created_utc": 1730471552.0,
          "replies": [
            {
              "id": "luv5ewu",
              "author": "Bunch_Busy",
              "body": "Completely agree. I'm a big guy with \"catcher's mitt's\" for hands as my friends say. And I kept my original se for as long as it was functional, it was almost silly small in my hands but Im 40, I grew up tapping away using T9 on a flip phone, the size was fine! Then had an XR, loved the phone,hated the size. And I absolutely loved the size of the mini when it came out! It just felt so much better in the pocket if nothing else!",
              "score": 27,
              "created_utc": 1730472531.0,
              "replies": []
            },
            {
              "id": "luv3v69",
              "author": "giocondasmiles",
              "body": "I have long hands but only like the SE/mini size as well.",
              "score": 21,
              "created_utc": 1730472030.0,
              "replies": [
                {
                  "id": "luv4i5s",
                  "author": "con57621",
                  "body": "I have pretty average hands, I can use bigger phone fine if i have to, but I just really like a small one handable phone.",
                  "score": 12,
                  "created_utc": 1730472238.0,
                  "replies": [
                    {
                      "id": "luykyqq",
                      "author": "flow_b",
                      "body": "I have two hands, they are roughly the same size.",
                      "score": 3,
                      "created_utc": 1730514260.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luvgyqt",
              "author": "None",
              "body": "[deleted]",
              "score": 19,
              "created_utc": 1730476213.0,
              "replies": [
                {
                  "id": "luw7ret",
                  "author": "None",
                  "body": "I mean it's true, no company believed in small phones more than Apple, but even Apple had to follow the market, because it's what the vast majority of people want.\n\nI'm a mini iPhone guy too, but sadly we're a small vocal minority, for example in 2022 the 13 Mini only sold around 3% of all iPhones. I hate it but it's the reality.",
                  "score": 13,
                  "created_utc": 1730484565.0,
                  "replies": [
                    {
                      "id": "luwhvss",
                      "author": "LBPPlayer7",
                      "body": "to be fair those who wanted a smaller phone just got an SE as it did the same thing at the same size but at a much cheaper price tag, and the tradeoffs were minimal",
                      "score": 13,
                      "created_utc": 1730487721.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luvy4qi",
                  "author": "Capital_Gap_5194",
                  "body": "If small phones sold better they would still be getting made, it’s pretty simple economics.",
                  "score": 8,
                  "created_utc": 1730481600.0,
                  "replies": []
                },
                {
                  "id": "luvl1fm",
                  "author": "WhatAmTrak",
                  "body": "Unfortunately most people like bigger screens.",
                  "score": 1,
                  "created_utc": 1730477493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luwaod4",
              "author": "LiedAboutKnowingMe",
              "body": "uppity alleged voracious bag dependent direful fearless pathetic dolls ancient\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 3,
              "created_utc": 1730485477.0,
              "replies": []
            },
            {
              "id": "luvgltz",
              "author": "jrgeek",
              "body": "100%",
              "score": 1,
              "created_utc": 1730476101.0,
              "replies": []
            },
            {
              "id": "luzc696",
              "author": "Initial_E",
              "body": "I have an SE. it’s really not small. The 4 is much smaller than that.",
              "score": 1,
              "created_utc": 1730528327.0,
              "replies": []
            },
            {
              "id": "luy3lkq",
              "author": "None",
              "body": "Im in the same yet opposite boat. I've got big sausage fingers and rather large palms, i would kill for the fablet days to come back.",
              "score": 0,
              "created_utc": 1730507369.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luvctsm",
          "author": "Evening_Clerk_8301",
          "body": "unfortunately from the case makers ive seen, its a 6.1\" screen :/",
          "score": 16,
          "created_utc": 1730474913.0,
          "replies": []
        },
        {
          "id": "luvdd44",
          "author": "calcium",
          "body": "I just used GSM Arena's phone finder and there are 10 phones that have so far been released in the year 2024 that have a screen size between 4.5\" and 6.1\".  One of those phones is a standard iPhone 16.  If I change the screen size to include all screens above the size of 6.1\" I find that there are 490 phones that were released this year.\n\nWhat I'm getting at here is that based on screen size, the iPhone 16 is one of the smallest screened phones being sold in 2024, so the chances of a smaller phone being sold by Apple is basically zero.",
          "score": 9,
          "created_utc": 1730475081.0,
          "replies": []
        },
        {
          "id": "luv6avc",
          "author": "ElectronHick",
          "body": "I hate calculator sized phones, I had an SE for the longest time, and then got the 13 mini. I love it. When I became eligible to upgrade I tried to get another 13 mini, but they were all gone. So now I have to make this phone last another 3 years until they have a decent powerhouse in a small form factor.",
          "score": 19,
          "created_utc": 1730472815.0,
          "replies": []
        },
        {
          "id": "luwkd90",
          "author": "snowpilgram",
          "body": "I am right with you.  I wish apple would do a full-feature mini.",
          "score": 7,
          "created_utc": 1730488510.0,
          "replies": []
        },
        {
          "id": "luv67g1",
          "author": "the_krc",
          "body": "[From the article: 6.1-inch display.](https://i.imgur.com/tsSSAtz.png)",
          "score": 13,
          "created_utc": 1730472784.0,
          "replies": [
            {
              "id": "luv6h4j",
              "author": "con57621",
              "body": "It’s still a rumour so I’m hoping it’s wrong",
              "score": 11,
              "created_utc": 1730472870.0,
              "replies": [
                {
                  "id": "luvy9rk",
                  "author": "Capital_Gap_5194",
                  "body": "It’s not a rumor, manufacturers of cases for the phone are showing the same thing.",
                  "score": 14,
                  "created_utc": 1730481643.0,
                  "replies": []
                },
                {
                  "id": "luvl5ei",
                  "author": "the_krc",
                  "body": "Same.",
                  "score": 4,
                  "created_utc": 1730477528.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luvp5yv",
          "author": "thisischemistry",
          "body": "Pretty much all the rumors say no. I hope they're wrong but they are probably correct. Too bad too, I went out and got a used 13 mini to replace my broken 12 mini. I'd have waited for the SE 4 if I had any hope of it being a mini.",
          "score": 6,
          "created_utc": 1730478804.0,
          "replies": []
        },
        {
          "id": "luv41z1",
          "author": "Realistic-Might4985",
          "body": "I had a 1st Gen SE up until last June.  My family was tired of listening to me complain about it not working with certain apps due to screen size.  I loved the size.  They got me a 15 for my birthday.  It’s not that much bigger than my SE in form but the screen is huge in comparison.",
          "score": 6,
          "created_utc": 1730472093.0,
          "replies": []
        },
        {
          "id": "luvr5dc",
          "author": "plexomaniac",
          "body": "And the plastic body. I loved the plastic one. I hate the ones with glass on the back.",
          "score": 3,
          "created_utc": 1730479428.0,
          "replies": []
        },
        {
          "id": "luxg646",
          "author": "jimbobdonut",
          "body": "I saw the rumor that it’s going to be 6.06” with Face ID so roughly the size of the iPhone 11.",
          "score": 3,
          "created_utc": 1730498892.0,
          "replies": []
        },
        {
          "id": "luwul6b",
          "author": "gskv",
          "body": "Preach",
          "score": 2,
          "created_utc": 1730491758.0,
          "replies": []
        },
        {
          "id": "luxyq3m",
          "author": "Dwarf_Vader",
          "body": "I’m in the same camp. Sadly, it’ll be a bigger phone. I upgraded from my 12 mini to 15 pro and I absolutely hate the new size. It’s been over a year yet I’m not used to it",
          "score": 2,
          "created_utc": 1730505570.0,
          "replies": []
        },
        {
          "id": "lva3si9",
          "author": "chickentataki99",
          "body": "It’d basically confirmed at this point that it will be using the old shell of the iPhone 14, so it will be bigger",
          "score": 1,
          "created_utc": 1730684276.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwc0t6",
      "author": "wichitaq",
      "body": "Wish the new SE was the size of the original SE!",
      "score": 24,
      "created_utc": 1730485895.0,
      "replies": []
    },
    {
      "id": "luwdsxn",
      "author": "Josh_The_Joker",
      "body": "I have the 13 pro currently and have no problems with it except battery life is not so great anymore. I like that the SE 4 will have OLED, but will it have the 120 hz screen? Pro motion I think they call it. It’s the reason I got the 13 pro over the 13.",
      "score": 6,
      "created_utc": 1730486452.0,
      "replies": [
        {
          "id": "luwlo0o",
          "author": "ca2mt",
          "body": "Highly unlikely the SE 4 gets 120hz. Rumors are the 17 lineup should all have 120hz, so I don’t think we’ll see it trickle down to the SE until 5 or 6. \n\nHow’s your battery health? Maybe swap out the battery on your 13P and see if it’ll hold you over until next fall, or the following fall and pick up a 17 Pro at a discount. Maybe Apple Intelligence will actually display some form of intelligence by then, too.",
          "score": 5,
          "created_utc": 1730488921.0,
          "replies": [
            {
              "id": "luwnjf3",
              "author": "Josh_The_Joker",
              "body": "Battery is currently at 82%. Most days it’s around 5-10% by the end of the day.",
              "score": 3,
              "created_utc": 1730489518.0,
              "replies": [
                {
                  "id": "luwpn1b",
                  "author": "ca2mt",
                  "body": "$89 for a battery replacement at Apple, might be worth it in your case. They may make you wait until it’s showing 80%, but you can probably force the issue and have em do it.",
                  "score": 5,
                  "created_utc": 1730490188.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luv7cky",
      "author": "vincentwallbanger",
      "body": "whats the benefit of the 5G modem and the wifi 7 chip?",
      "score": 31,
      "created_utc": 1730473149.0,
      "replies": [
        {
          "id": "luv8cmk",
          "author": "phl_fc",
          "body": "Communication speed. 5G is faster than 4G or LTE. WiFi 7 is faster than 6.\n\nNew iPhones already have 5G and wifi7. The news here is that they're going to start making the components themselves instead of buying them from a 3rd party manufacturer.",
          "score": 76,
          "created_utc": 1730473473.0,
          "replies": [
            {
              "id": "luvfzd4",
              "author": "Roboculon",
              "body": "To elaborate, most of the speeds you see advertised for like wifi 5 or 6 are misleading. It might say it’s 5 gigs per second (basically infinity), which makes it seem like any upgrade beyond that would be extraneous. But what they actually mean is that your router can give that speed *cumulatively* if it’s connecting to many separate devices simultaneously. \n\nThe actual single-device speed is generally far lower, so from the perspective of a single device (iPhone) there really is a significant benefit to using the newest technology.",
              "score": 17,
              "created_utc": 1730475905.0,
              "replies": [
                {
                  "id": "luvhcnd",
                  "author": "TooStrangeForWeird",
                  "body": "5Gbps across all devices is plenty, especially considering 1Gbps is the fastest almost anyone uses at home. \n\nThe actual advantage is in places like apartment buildings where there are lots of routers. Even then, the importance is still often overstated.",
                  "score": 8,
                  "created_utc": 1730476334.0,
                  "replies": [
                    {
                      "id": "luviho1",
                      "author": "Roboculon",
                      "body": "I agree wifi 6 is probably ample for any general use. My own example though is that I have wifi 5 at home, and 1 gig internet service. My iPhone can only access like 200Mb per second, so if I upgraded to wifi 6 that actually would give me a speed bump. \n\nOf course, 200Mb is still quite a lot, so this bump I’d get would almost never be noticeable.",
                      "score": 2,
                      "created_utc": 1730476690.0,
                      "replies": [
                        {
                          "id": "luvmyko",
                          "author": "_RADIANTSUN_",
                          "body": "Lots of people use roaming wifi while out and about with their mobile carrier or ISP programs, saved public WiFis, workplace wifi etc\n\nThe key thing is that these technologies will get faster and more reliable in an infrastructural way too, which will also affect the device to device experience, even if it's not a change in the speeds you get on each device at home for example.",
                          "score": 3,
                          "created_utc": 1730478103.0,
                          "replies": []
                        },
                        {
                          "id": "luw9zf9",
                          "author": "PM_UR_REPARATIONS",
                          "body": "You won’t see that much improvement on WiFi 6 over WiFi 5. 6E is there it’s at.",
                          "score": 2,
                          "created_utc": 1730485260.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "luwesio",
                  "author": "None",
                  "body": "If you are the only one home and not using internet on another device, you will get the full speed.",
                  "score": -3,
                  "created_utc": 1730486756.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luwxub5",
              "author": "junkie-xl",
              "body": "The iPhone 16s Wifi7 is limited and doesn't support 320hz and other features iirc, it's basically the same as 6e.",
              "score": 3,
              "created_utc": 1730492802.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luvazga",
          "author": "CO_PC_Parts",
          "body": "what they're saying is this phone is the test product for their new chips.  They normally buy these chips from broadcom/qualcomm but they're making their own now.  If there's massive problems with them then the risk is mitigated because it's in the phone that's cheapest to replace and has a smaller market share than the flagship phones.  \n\nSo if you buy this new phone there is a risk there will be issues/bugs with these devices.",
          "score": 12,
          "created_utc": 1730474321.0,
          "replies": [
            {
              "id": "luvep8k",
              "author": "Aphophyllite",
              "body": "I was wondering about this. I’m in the market for a new iPhone SE, but I’m not waiting to get the 4. I’m not paying to be a test subject.",
              "score": 5,
              "created_utc": 1730475504.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luvzyw6",
          "author": "AirFryerAreOverrated",
          "body": "Since it'll be Apple's own design, they will eventually be able integrate it into the SoC instead of having it as a separate chip like now with Qualcomm modems. It will be able to simplify the manufacturing process while also lowering energy usage, giving better battery life. I doubt it'll be integrated this time though since they'll use the same CPU on the SE as the iphone 16.",
          "score": 5,
          "created_utc": 1730482163.0,
          "replies": []
        },
        {
          "id": "luvzi3t",
          "author": "Ok_Minimum6419",
          "body": "Potentially cheaper phones as right now Qualcomm can charge apple a bunch of money for basically something they have a pseudo monopoly over. \n\nThe same thing happened with the Apple M1 chip and Apple being no longer reliant on Intel to set their prices. It’s how we’re getting a $499 M4 Mac Mini that blows everything in the mini PC space right now.",
          "score": 4,
          "created_utc": 1730482021.0,
          "replies": []
        },
        {
          "id": "luvoz6i",
          "author": "None",
          "body": "[deleted]",
          "score": 5,
          "created_utc": 1730478744.0,
          "replies": [
            {
              "id": "luvsc19",
              "author": "vincentwallbanger",
              "body": "the right answer I was expecting:)",
              "score": 5,
              "created_utc": 1730479798.0,
              "replies": []
            },
            {
              "id": "lux8984",
              "author": "None",
              "body": "Latency is a pretty good factor. If your WiFi is 20ms of latency, every time you make a request for something on a site your browser has to wait and they stack up. WiFi 7 is near 1ms latency and is on par with wired networking.",
              "score": 5,
              "created_utc": 1730496187.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luw9dgc",
          "author": "veryverythrowaway",
          "body": "Probably a space-saving measure. If Apple is engineering it, it’s likely due to the fact that they want to put more components in devices for other features, and they have a good track record of designing chips with good energy and thermal management. They’ll be able to design it in whatever size/shape fits their design, rather than having to design the iPhone around a third-party component.",
          "score": 2,
          "created_utc": 1730485071.0,
          "replies": []
        },
        {
          "id": "luwrs3k",
          "author": "Altruistic-Sir-3661",
          "body": "5G networks support a larger number of devices then 4G LTE or older Networks for the same number of nodes. So one is less likely to loose service do to network saturation. I haven’t confirmed this but for network subletting providers like Mint Mobile that increased capacity might make a bigger difference since they would have a lower network priority than a network’s retail customers.",
          "score": 1,
          "created_utc": 1730490862.0,
          "replies": []
        },
        {
          "id": "luxf4dd",
          "author": "happyjello",
          "body": "Not much. It’s a big step for Apple because they made it instead of Qualcomm. Not much benefit compared to existing phones",
          "score": 1,
          "created_utc": 1730498523.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luvyxae",
      "author": "Garconanokin",
      "body": "Another bloated SE. \n\nI would pay such good money for an iPhone 4 form factor with the modern tech.  Of course, I am not the market. Most people want basically an iPad in their pocket.",
      "score": 13,
      "created_utc": 1730481843.0,
      "replies": [
        {
          "id": "luwgs2y",
          "author": "with_MIND_BULLETS",
          "body": "Actually, based off of all of the comments from all of the posts like this one, it seems like we are very much the market. Now, whether Apple wants to acknowledge that…",
          "score": 3,
          "created_utc": 1730487374.0,
          "replies": [
            {
              "id": "luxigem",
              "author": "Garconanokin",
              "body": "I mean, I would love that to be the case, although I think that you and I are part of a very small and vocal minority, unfortunately.",
              "score": 4,
              "created_utc": 1730499703.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luwau2g",
      "author": "JerHat",
      "body": "Oh man, does this mean the SE4 is going to lose the thumb button? That's like the only reason I've been sticking with the SE line.",
      "score": 7,
      "created_utc": 1730485526.0,
      "replies": []
    },
    {
      "id": "luysqmp",
      "author": "img_tiff",
      "body": "1. y'all need to learn to give up the home button \n2. it sucks that the iPhone mini is dead\n\nboth of these things can be true at the same time",
      "score": 6,
      "created_utc": 1730517632.0,
      "replies": []
    },
    {
      "id": "lux1t9k",
      "author": "quinnsterr",
      "body": "I have a 13pro max and never thought of it as too big until my wife swapped hers for a 13 mini. Now i hate lugging this tablet around and also hoping the new SE will be as small as possible.",
      "score": 2,
      "created_utc": 1730494080.0,
      "replies": []
    },
    {
      "id": "luz0o65",
      "author": "Tokugawa",
      "body": "If there's not a home button, and it's a bigger screen, then it's not really an SE, is it?",
      "score": 2,
      "created_utc": 1730521457.0,
      "replies": []
    },
    {
      "id": "lv0lm5t",
      "author": "norcross",
      "body": "i’ve still got my SE2 and am planning on grabbing an SE3 soon. i don’t wanna give up the thumb unlocking. using thumb vs face is a way better user experience, all around. i don’t care if Apple agrees with me, i’ll die on that hill.",
      "score": 2,
      "created_utc": 1730555315.0,
      "replies": []
    },
    {
      "id": "luvy0wu",
      "author": "Trekintosh",
      "body": "But no home button ;-;",
      "score": 6,
      "created_utc": 1730481568.0,
      "replies": [
        {
          "id": "luw8teu",
          "author": "ptambrosetti",
          "body": "Going to buy 2 more SE before they run out of stock. I’m not giving up my home button for all that ridiculous swiping.",
          "score": 4,
          "created_utc": 1730484895.0,
          "replies": [
            {
              "id": "luw9xs2",
              "author": "Trekintosh",
              "body": "I went from an SE2 to a 13 Mini and while I like the flagship features and the size, I really miss the home button and especially touchID",
              "score": 8,
              "created_utc": 1730485246.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luymw0o",
      "author": "spaceraingame",
      "body": "No Home Button? No-go for me",
      "score": 2,
      "created_utc": 1730515063.0,
      "replies": []
    },
    {
      "id": "luwh32f",
      "author": "itsaride",
      "body": "> beta testers in the cheap seats",
      "score": 1,
      "created_utc": 1730487468.0,
      "replies": []
    },
    {
      "id": "lux6ujp",
      "author": "None",
      "body": "The 16 just came out two weeks ago",
      "score": 1,
      "created_utc": 1730495722.0,
      "replies": [
        {
          "id": "luxyvba",
          "author": "dramafan1",
          "body": "The SE hasn’t been updated since March 2022. It’s rumoured to finally be updated in March 2025.",
          "score": 3,
          "created_utc": 1730505623.0,
          "replies": [
            {
              "id": "luy3ngs",
              "author": "None",
              "body": "I meant they’re already talking about the 17. I coulda sworn Apple said they wouldn’t do yearly anymore. I might be mistaken",
              "score": 0,
              "created_utc": 1730507389.0,
              "replies": [
                {
                  "id": "luy4dwi",
                  "author": "dramafan1",
                  "body": ">I coulda sworn Apple said they wouldn’t do yearly anymore.\n\nRumoured for their other Apple products, not the iPhone which pretty much makes up half their sales.",
                  "score": 3,
                  "created_utc": 1730507664.0,
                  "replies": [
                    {
                      "id": "luy4q0y",
                      "author": "None",
                      "body": "Ahh makes sense",
                      "score": 1,
                      "created_utc": 1730507791.0,
                      "replies": [
                        {
                          "id": "luz8bzr",
                          "author": "didiboy",
                          "body": "It’s also a rumor, not an official press release. Apple basically never talks officially about the next iteration of a product. As far as we know from Apple, you should expect the 17 series to be released around September 2025.",
                          "score": 2,
                          "created_utc": 1730525817.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lux7uxv",
      "author": "whatabouteee",
      "body": "Has anyone seen any rumors about if the se4 will be Able to do satellite texting or not?",
      "score": 1,
      "created_utc": 1730496055.0,
      "replies": []
    },
    {
      "id": "lv09n6b",
      "author": "zandadoum",
      "body": "Size increase = no thx",
      "score": 1,
      "created_utc": 1730550290.0,
      "replies": []
    },
    {
      "id": "lv0wabb",
      "author": "Hawker96",
      "body": "All I want is an OLED screen without a gigantic camera tumor on the back. Please.",
      "score": 1,
      "created_utc": 1730559095.0,
      "replies": []
    },
    {
      "id": "luwtt90",
      "author": "GingerKitty26",
      "body": "hey apple, how bout actually waiting to release a phone until you have enough major changes TO WARRANT a new phone model.",
      "score": -2,
      "created_utc": 1730491509.0,
      "replies": [
        {
          "id": "lux1ipr",
          "author": "None",
          "body": "This is a huge upgrade compared to the current SE phone",
          "score": 10,
          "created_utc": 1730493986.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luuy1zx",
      "author": "None",
      "body": "[deleted]",
      "score": -8,
      "created_utc": 1730470113.0,
      "replies": [
        {
          "id": "luv0e8f",
          "author": "Usernametaken1121",
          "body": "What",
          "score": 10,
          "created_utc": 1730470890.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luuk0sq",
      "author": "None",
      "body": "[deleted]",
      "score": -4,
      "created_utc": 1730465032.0,
      "replies": [
        {
          "id": "luuol5u",
          "author": "None",
          "body": "The SE is expected to launch before the next major iPhone release, the last one was April. I think it's a case of \"it's ready now, and this model launches soonest\" (especially since the WiFi chip is launching with the major release instead of being tested in a lower end model first)",
          "score": 8,
          "created_utc": 1730466803.0,
          "replies": [
            {
              "id": "luuy10b",
              "author": "DaCamelJockey",
              "body": "Kind of crazy that the M4 processors they just dropped don't have wifi 7.",
              "score": 2,
              "created_utc": 1730470105.0,
              "replies": [
                {
                  "id": "luvje9f",
                  "author": "None",
                  "body": "Yeah agreed, I don't understand why they put it in the iPhone 16 but not the new M4 devices ",
                  "score": 2,
                  "created_utc": 1730476974.0,
                  "replies": []
                },
                {
                  "id": "luvqkie",
                  "author": "thisischemistry",
                  "body": "None of the processors have any wifi.",
                  "score": -1,
                  "created_utc": 1730479247.0,
                  "replies": [
                    {
                      "id": "luvyect",
                      "author": "None",
                      "body": "I think they meant M4 to group the new generation of Macs/iPads together into two characters (or at least that's how I read it)",
                      "score": 1,
                      "created_utc": 1730481682.0,
                      "replies": []
                    },
                    {
                      "id": "luvsl9s",
                      "author": "DaCamelJockey",
                      "body": "I know none of the processors have any wifi. It's a separate chip. I mean the entire new line of Macs they just dropped within the last 7 days. The new iMacs, Mac Minis, and MacBook Pros do not in any way have wifi 7 or even the option to select it as an upgrade. It's an odd choice.",
                      "score": 0,
                      "created_utc": 1730479876.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luumisu",
          "author": "TheModeratorWrangler",
          "body": "It could also mean that they’re intentionally seeing how it performs without sticking it into all of the high end devices, knowing a user on the lower price end of the spectrum probably won’t care so long as shit works.",
          "score": 3,
          "created_utc": 1730466020.0,
          "replies": [
            {
              "id": "luuowts",
              "author": "CamiloArturo",
              "body": "I believe that’s the case. “Let’s try it on a lower end phone before putting it in the high end in case something doesn’t go right we can just recall production and our flagship won’t suffer”",
              "score": 5,
              "created_utc": 1730466923.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luuq5wx",
          "author": "rabidbot",
          "body": "Nah just like putting new silicon in the mini",
          "score": 1,
          "created_utc": 1730467385.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luv0pql",
      "author": "linuxworks",
      "body": "It’s unfortunate that the new MacBook Pro lacks Wi-Fi 7 support. The inability to use the latest Wi-Fi 7 router on Mac is a significant inconvenience for early adopters.",
      "score": -18,
      "created_utc": 1730470995.0,
      "replies": [
        {
          "id": "luvbuqz",
          "author": "ultimately42",
          "body": "It's.. Not used anywhere yet.",
          "score": 19,
          "created_utc": 1730474601.0,
          "replies": [
            {
              "id": "luvcz8t",
              "author": "linuxworks",
              "body": "I’ve been using a WiFi 7-enabled router for the past year.",
              "score": 2,
              "created_utc": 1730474961.0,
              "replies": [
                {
                  "id": "luvdzm8",
                  "author": "Tianhech3n",
                  "body": "The standards of wifi7 are STILL changing. I'm not sure why you would adopt something that literally isn't finished yet.",
                  "score": 14,
                  "created_utc": 1730475279.0,
                  "replies": [
                    {
                      "id": "luwkhb4",
                      "author": "ca2mt",
                      "body": "They put Wi-Fi 7 on the iPhone, though?",
                      "score": 3,
                      "created_utc": 1730488546.0,
                      "replies": [
                        {
                          "id": "luxu8mp",
                          "author": "Tianhech3n",
                          "body": "Routers using wifi 7 are based on the initial draft specs from 2022. There are still revisions being made",
                          "score": 1,
                          "created_utc": 1730503947.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "luwiuuw",
                      "author": "LBPPlayer7",
                      "body": "tell that to LTE which was never finished, with 5G still lacking what LTE lacks",
                      "score": 0,
                      "created_utc": 1730488026.0,
                      "replies": []
                    },
                    {
                      "id": "luvgwzv",
                      "author": "linuxworks",
                      "body": "Early adopters syndrome",
                      "score": -3,
                      "created_utc": 1730476198.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luvep4s",
          "author": "Plank_With_A_Nail_In",
          "body": "Basically no one owns wifi routers above wifi 5. I have yet to see one in anyone's homes or out and about. Wifi 5 already offers much higher speeds than their internet connection could deliver. \n\nLack of Wi-Fi 7 is a made up problem and that's before you take into account that the standard hasn't even gone live yet.",
          "score": 4,
          "created_utc": 1730475503.0,
          "replies": [
            {
              "id": "luvgjp8",
              "author": "Ray-chan81194",
              "body": "Really? I live in a 3rd world country and almost everyone around here uses a Wifi 6 router.",
              "score": 3,
              "created_utc": 1730476082.0,
              "replies": []
            },
            {
              "id": "luwpqg9",
              "author": "neon5k",
              "body": "I had been struggling with WiFi 5. 6 is way better.",
              "score": 1,
              "created_utc": 1730490218.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luvdvkz",
          "author": "lerliplatu",
          "body": "I mean you can still connect to it. It will just be slower.",
          "score": 1,
          "created_utc": 1730475244.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luv4ede",
      "author": "alan-penrose",
      "body": "iPhone so ahead of the game it’s not even funny anymore",
      "score": -13,
      "created_utc": 1730472205.0,
      "replies": [
        {
          "id": "luvdd3b",
          "author": "Evening_Clerk_8301",
          "body": "by their own admission, they are never ahead of the game. They don't focus on being \"first\", they focus on being \"the best\". (source: Tim Cook [https://www.theverge.com/2024/10/21/24275578/not-first-but-best](https://www.theverge.com/2024/10/21/24275578/not-first-but-best) )",
          "score": 9,
          "created_utc": 1730475081.0,
          "replies": [
            {
              "id": "luvgwt8",
              "author": "Ray-chan81194",
              "body": "But their modem is not gonna be the best for sure.\nIt could be as bad as the Exynos modem in the pixel.",
              "score": -3,
              "created_utc": 1730476196.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luv6r80",
          "author": "None",
          "body": "[deleted]",
          "score": 6,
          "created_utc": 1730472960.0,
          "replies": [
            {
              "id": "luvn2we",
              "author": "bert93",
              "body": "It won't be free of licensing costs as there will be patent royalties to pay. Though it may be significantly cheaper.",
              "score": 1,
              "created_utc": 1730478141.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luvhyp7",
          "author": "TooStrangeForWeird",
          "body": "The M series processors were definitely a leap ahead, but they're not really ahead in anything anymore.",
          "score": 1,
          "created_utc": 1730476525.0,
          "replies": []
        },
        {
          "id": "luvcqhf",
          "author": "OtterishDreams",
          "body": "It’s really not it just has a fancier veneer. Apple justifies markups with metal",
          "score": -1,
          "created_utc": 1730474884.0,
          "replies": []
        }
      ]
    }
  ]
}