{
  "post": {
    "title": "Nvidia’s RTX 50-Series Cards Are Powerful, but Their Real Promise Hinges on ‘Fake’ Frames",
    "author": "a_Ninja_b0y",
    "id": "1i1y9op",
    "score": 856,
    "created_utc": 1736950439.0,
    "selftext": "",
    "num_comments": 435,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i1y9op/nvidias_rtx_50series_cards_are_powerful_but_their/"
  },
  "comments": [
    {
      "id": "m79vdy6",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1736950439.0,
      "replies": []
    },
    {
      "id": "m79x2fx",
      "author": "notred369",
      "body": ">These aren’t “fake frames” but aren’t rendered by the PC’s processors either. Multi-frame gen is a magic trick that requires misdirection. Users will be too busy playing the game and basking in the framerate ticker to notice any potential visual discrepancies when they—inevitably—appear. This takes time to parse out, something that can’t be done even with a few hours of demos. We’ll need to get our hands on these new cards to discover how this impacts our gaming experience.\n\nSo what's the point of the article then? Even the author says wait for benchmarks.",
      "score": 533,
      "created_utc": 1736951032.0,
      "replies": [
        {
          "id": "m7akfn0",
          "author": "GreenFox1505",
          "body": "\"take manufacturers for a grain of salt, wait for benchmarks\" is the splash of cold water every hardware release hype train needs. It might not be our first rodeo, but it's always someone's.",
          "score": 100,
          "created_utc": 1736958391.0,
          "replies": []
        },
        {
          "id": "m79xtme",
          "author": "Crintor",
          "body": "Generates clicks and money, like almost all articles these days.",
          "score": 189,
          "created_utc": 1736951296.0,
          "replies": [
            {
              "id": "m7ahlby",
              "author": "smulfragPL",
              "body": "unlike articles of old which were meant to not be clicked on and not make money",
              "score": 37,
              "created_utc": 1736957544.0,
              "replies": [
                {
                  "id": "m7avetl",
                  "author": "camatthew88",
                  "body": "Well you can't click on a physical newspaper",
                  "score": 17,
                  "created_utc": 1736961599.0,
                  "replies": [
                    {
                      "id": "m7aw6t4",
                      "author": "Starfox-sf",
                      "body": "You certainly could. With your tongue.",
                      "score": 2,
                      "created_utc": 1736961824.0,
                      "replies": [
                        {
                          "id": "m7b1qlw",
                          "author": "_Weyland_",
                          "body": "Nah. You slobber over your finger in order to easily turn the page. Indirect lick.",
                          "score": 6,
                          "created_utc": 1736963407.0,
                          "replies": []
                        },
                        {
                          "id": "m7fnlbo",
                          "author": "None",
                          "body": "Gentleman, what were all missing here is that pens also click. We can all have what we want. Bless us all!",
                          "score": 1,
                          "created_utc": 1737027133.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7bwuq9",
                      "author": "ambermage",
                      "body": "I'll fax you a hyperlink.",
                      "score": 1,
                      "created_utc": 1736972307.0,
                      "replies": []
                    },
                    {
                      "id": "m7egmx1",
                      "author": "willstr1",
                      "body": "Which was why it used to be called [yellow journalism ](https://en.wikipedia.org/wiki/Yellow_journalism?wprov=sfla1)",
                      "score": 1,
                      "created_utc": 1737002552.0,
                      "replies": []
                    },
                    {
                      "id": "m7hsfv8",
                      "author": "Bob_The_Bandit",
                      "body": "Yes it was all paywalled instead, you had to buy it. And even then, it had ads on it.",
                      "score": 1,
                      "created_utc": 1737052786.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7blggc",
                  "author": "Bloody_Sunday",
                  "body": "He is obviously talking about the shallow intent of this against the quality of the content itself. As usual nowadays, made with minimal effort (sometimes just by AI) to be a click trap instead of providing something well written and well researched, which in that case would keep you coming back for more instead of constantly trying to avoid it.",
                  "score": 1,
                  "created_utc": 1736969039.0,
                  "replies": []
                },
                {
                  "id": "m7fnh6m",
                  "author": "None",
                  "body": "Or back in the day when they wrote paper articles that weren't meant to be purchased and contained no ads.",
                  "score": 1,
                  "created_utc": 1737027070.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7abj7z",
          "author": "xShooK",
          "body": "This reads more like the benchmarks are pointless, and they want to visually test games for longer.",
          "score": 11,
          "created_utc": 1736955720.0,
          "replies": [
            {
              "id": "m7ifkxd",
              "author": "DFrostedWangsAccount",
              "body": "Benchmarks with frame gen on are pointless, because with frame gen the fps doesn't represent the \"feel\" of the gameplay anymore.",
              "score": 6,
              "created_utc": 1737059501.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a679l",
          "author": "DigitalSchism96",
          "body": "To report on what Nvidia is saying about their new cards? Author was invited to a closed door demo. Reported on what they saw. That's just... typical reporting. Not sure what you are confused about.",
          "score": 40,
          "created_utc": 1736954079.0,
          "replies": []
        },
        {
          "id": "m7bwq86",
          "author": "ambermage",
          "body": "A video review has already been posted for the 5090 using cyberpunk with pre-release drivers, and the DLSS frame rate was 260ish with 56ms latency, and with all software rendering disabled it was still 65ish with a latency of around 35ms.\n\nhttps://youtu.be/lA8DphutMsY?si=CJqsS0xLqKKeB46K\n\nThat's nice, but the $2,000 price tag is ... not for me.",
          "score": 6,
          "created_utc": 1736972271.0,
          "replies": [
            {
              "id": "m7dqvx0",
              "author": "None",
              "body": "Even then, I hate latency and frame gen is pointless to someone like me. It reminds me of the soap opera effect TVs can do when they add more fake frames to make the picture smoother. Both increase latency.",
              "score": 9,
              "created_utc": 1736992875.0,
              "replies": [
                {
                  "id": "m7eo3b8",
                  "author": "Exeeter702",
                  "body": "This doesn't make any sense. Games don't suffer from the soap opera effect because they are designed to run at higher frame rates.  That's like saying you prefer your games at 30 fps because 60 is a soap opera effect.\n\nFrame interpolation on tvs has that strange look to it because the source material is almost always sub 30.  You are unironically agreeing with the Sony exec that comically said 30 fps in games is more cinematic.....",
                  "score": -2,
                  "created_utc": 1737005998.0,
                  "replies": [
                    {
                      "id": "m7gqefa",
                      "author": "None",
                      "body": "Yeah it does. Frame interpolation and AI generated frames both are making fake frames that increase latency which increases input lag. They aren’t that dissimilar from each other.",
                      "score": 0,
                      "created_utc": 1737041822.0,
                      "replies": [
                        {
                          "id": "m7gxq1x",
                          "author": "Exeeter702",
                          "body": "I didn't say otherwise.... \n\nI'm telling you the \"soap opera\" effect, ie the hyper smooth strange image on tvs from frame interpolation does not exist with video games from a visual standpoint. Unless you think the soap opera effect involves artifacting and blurring which DOES exist with frame gen for games but is not what the soap opera effect is.\n\nThe reason it's called the soap opera effect is because the frame interpolation on tvs makes the source material look \"live on set like\" instead of movie film like since soap operas are shot that way. \n\nThere is no such thing as video game soap opera effect because games are commonly hyper smooth due to naturally running at frames above 60 on principle. Again artifacting and latency have nothing to do with the soap opera effect but also are effects of frame interpolation.",
                          "score": 2,
                          "created_utc": 1737043967.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7f8wb8",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1737018067.0,
              "replies": [
                {
                  "id": "m7fiekl",
                  "author": "TheRealGOOEY",
                  "body": "Just because you don’t like their pricing doesn’t mean it’s a scam.",
                  "score": 1,
                  "created_utc": 1737024147.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7aqz2u",
          "author": "Wpgaard",
          "body": ">These aren’t “fake frames” but aren’t rendered by the PC’s processors either.\n\nNvidia has apparently invented magic. Frames rendered through the Frame Generation pipeline doesn't require computation and just pop into existance out of thin air.",
          "score": 8,
          "created_utc": 1736960296.0,
          "replies": [
            {
              "id": "m7dgki2",
              "author": "Cuchullion",
              "body": "NVidia accidently invents interdimensional travel by tapping into other universes to steal their frames.",
              "score": 5,
              "created_utc": 1736989343.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7baniw",
          "author": "DYMAXIONman",
          "body": "Users will notice the increased input lag unless the game is already at like 100fps.",
          "score": 3,
          "created_utc": 1736965955.0,
          "replies": []
        },
        {
          "id": "m79yu90",
          "author": "GunAndAGrin",
          "body": "Maybe they thought they had to get in front of the 'fake frames' argument before it becomes a meme within the court of public opinion? Maybe its sponsored content?\n\nThough in general, I agree. Why even try to explain? \n\nThe people who are going to be reactionary, irrationally angry, are going to choose to be that way regardless of any clarification or reason. They want to be/think they are a part of the conversation. They want to be pissed, so they will find a way. \n\nThe rest of us will wait and see.",
          "score": 9,
          "created_utc": 1736951648.0,
          "replies": []
        },
        {
          "id": "m7a5pmb",
          "author": "Firecracker048",
          "body": "He said they are fake then describes them as tricks. Ywah they are fake frames",
          "score": 5,
          "created_utc": 1736953925.0,
          "replies": [
            {
              "id": "m7bn4na",
              "author": "Bubba89",
              "body": "It’s not a trick Michael, it’s an illusion!",
              "score": 4,
              "created_utc": 1736969516.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7apv6s",
          "author": "devilsdontcry",
          "body": "Ai written click bait. The way they describe “fake frames” is so fucking dumb it’s sad. Litterally some fucking writer trying to sound tech savvy while also needing to generate clicks.",
          "score": 7,
          "created_utc": 1736959974.0,
          "replies": [
            {
              "id": "m7ddvie",
              "author": "Catfood03",
              "body": "You've never tried frame-generation in a game where hardware latency matters and it shows...",
              "score": -1,
              "created_utc": 1736988433.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a7m90",
          "author": "iamnotexactlywhite",
          "body": "they get paid for it. wild concept, i know",
          "score": 2,
          "created_utc": 1736954522.0,
          "replies": []
        },
        {
          "id": "m7a6u6t",
          "author": "beleidigtewurst",
          "body": ">So what's the point \n\nFake frames are laregly pointless. \n\nThey increase, not reduce lag, and creating fake frames drops the number of real ones, inevitably.\n\nIt kinda sorta maybe makes sense in point and click games, but who cares about FPS in thos anyhow.",
          "score": 2,
          "created_utc": 1736954278.0,
          "replies": [
            {
              "id": "m7abwju",
              "author": "Prodigle",
              "body": "I think you're massively misunderstanding the range of people who play games. Tons of games and gamers benefit from DLSS",
              "score": 9,
              "created_utc": 1736955832.0,
              "replies": [
                {
                  "id": "m7ag2ym",
                  "author": "kayak83",
                  "body": "For clarity, DLSS itself is an AI resolution upscaler (with a few other added techniques, like Ray Reconstruction). Frame Generation is just that, a frame generator adding AI frames between real ones.  Although, Frame Generation became available on DLSS3 and above. A bit confusing.",
                  "score": 8,
                  "created_utc": 1736957085.0,
                  "replies": [
                    {
                      "id": "m7hovqf",
                      "author": "beleidigtewurst",
                      "body": "DLSS 1 was pure AI upscaler.\n\n2 and onwards are TAA derivatives with some AI activity (I bet it's mostly denoising)",
                      "score": 1,
                      "created_utc": 1737051770.0,
                      "replies": []
                    },
                    {
                      "id": "m7ah1gt",
                      "author": "Prodigle",
                      "body": "Frame Gen is still under the DLSS umbrella, but Reflex should heavily restrict any added latency, and should still perform better than no DLSS + no Reflex",
                      "score": 1,
                      "created_utc": 1736957377.0,
                      "replies": [
                        {
                          "id": "m7cl96x",
                          "author": "I_hate_all_of_ewe",
                          "body": "Once is super sampling, one is updating a frame.  They might both use some level of AI, but that's where the similarities end.  I wouldn't bucket them in the same umbrella unless you plan to bucket every AI feature that generated pixels, which just seems overly broad.",
                          "score": 2,
                          "created_utc": 1736979158.0,
                          "replies": [
                            {
                              "id": "m7clupx",
                              "author": "Prodigle",
                              "body": "? I think it's totally fine and normal to refer to Frame Gen & Super sampling as DLSS. They're both included in that term, Nvidia groups them together as DLSS, and its name is DLSS Frame Generation",
                              "score": 0,
                              "created_utc": 1736979335.0,
                              "replies": [
                                {
                                  "id": "m7cnhjc",
                                  "author": "I_hate_all_of_ewe",
                                  "body": "I stand corrected, then.",
                                  "score": 2,
                                  "created_utc": 1736979831.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7c1dgl",
                          "author": "ManiacalDane",
                          "body": "Reflex isn't necessarily that great, though. It increases latency in some games. >_<",
                          "score": 1,
                          "created_utc": 1736973576.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7cojnc",
              "author": "lxs0713",
              "body": "I see a point to frame gen for certain people. Let's say you bought a 360hz monitor because you like playing competitive games and want the extra smoothness and faster response time. \n\nWell, what if you also like to play single player games too. You already have a high refresh rate display and you've gotten used to the smoothness, but with these types of games you can't reach those fps numbers when you turn on all the bells and whistles. Well, using MFG you can now take that game that runs at 90fps without it and boom, you have 360fps now. Since it's not a competitive title, the response time isn't as important, especially if you play it on a controller. And with a baseline 90fps, you already have a decent starting point. \n\nSo for most people, MFG will be niche and irrelevant, but as more people buy higher refresh rate displays it'll start to become more useful. The thing about frame gen is that it works better when you already have a high enough starting fps. It shouldn't be seen as a tool to bump a 30fps game to 60fps because that will look and feel like crap.",
              "score": 2,
              "created_utc": 1736980149.0,
              "replies": [
                {
                  "id": "m7fa6sq",
                  "author": "Responsible-Win5849",
                  "body": "Don't most competitive games have super low requirements for that sort of reason? It's been a long time since I played cs/tf2 but I'd expect them to run at 400+fps on integrated graphics by this point. Can't see it helping for the dota knockoff either but never played that at any competitive level.",
                  "score": 1,
                  "created_utc": 1737018901.0,
                  "replies": [
                    {
                      "id": "m7fl4wz",
                      "author": "lxs0713",
                      "body": "Yeah they do. That's why I'm saying it's for the person who bought a high refresh rate monitor (240z and higher) to play esports games, but then also wants to play more demanding games on that same monitor. \n\nThey'll be able to run those esports games at super high fps no problem, but then when they decide they want to play some Cyberpunk or Alan Wake 2 with path tracing, they'll use the multi frame gen to make it look just as smooth, even if it means dealing with a bit of input lag",
                      "score": 1,
                      "created_utc": 1737025761.0,
                      "replies": [
                        {
                          "id": "m7hsdkv",
                          "author": "beleidigtewurst",
                          "body": "The person used to super low lag would be baffled with increased lag despite fake \"smoothness\" of the framerate.",
                          "score": 1,
                          "created_utc": 1737052769.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7bcxlw",
          "author": "paulerxx",
          "body": "[https://www.youtube.com/watch?v=lA8DphutMsY](https://www.youtube.com/watch?v=lA8DphutMsY)",
          "score": 1,
          "created_utc": 1736966606.0,
          "replies": []
        },
        {
          "id": "m7cizl0",
          "author": "cyrixlord",
          "body": "they article should call them 'sleight of hand' frames. it would sound better than the silly article, and we'd get the pleasure of finding out where all the other half-ass articles were using as their source because of the term",
          "score": 1,
          "created_utc": 1736978496.0,
          "replies": []
        },
        {
          "id": "m7czppe",
          "author": "LookAlderaanPlaces",
          "body": "Moneyyyyyyyy",
          "score": 1,
          "created_utc": 1736983676.0,
          "replies": []
        },
        {
          "id": "m7czx4h",
          "author": "Infinite_Somewhere96",
          "body": "multi-article generation technology, fake frames, fake articles, lez gooo",
          "score": 1,
          "created_utc": 1736983744.0,
          "replies": []
        },
        {
          "id": "m7e4j8e",
          "author": "aronmayo",
          "body": "Errr…yes they definitely are rendered by the processors, since the AI/ML is all run locally on the chips, not by external servers. Nothing about frame generation is “fake” or “not rendered”.",
          "score": 1,
          "created_utc": 1736997716.0,
          "replies": []
        },
        {
          "id": "m7ex1rb",
          "author": "ILove2Bacon",
          "body": "It's because they need to write an article about the hot new tech but don't actually have anything new to say.",
          "score": 1,
          "created_utc": 1737010800.0,
          "replies": []
        },
        {
          "id": "m7fbm2w",
          "author": "Curse3242",
          "body": "Exactly. Also if I was seriously thinking of buying a 5090, I'd wait as long as possible anyways because maybe their new DLSS4 tech works better on already released games but on newer games we still say crazy pixelization, jaggeds & input delay.",
          "score": 1,
          "created_utc": 1737019834.0,
          "replies": []
        },
        {
          "id": "m7gv06k",
          "author": "kevinbranch",
          "body": "there's a difference between benchmarks and evaluating real world use.",
          "score": 1,
          "created_utc": 1737043176.0,
          "replies": []
        },
        {
          "id": "m8b6h7h",
          "author": "SoftcoreEcchi",
          "body": "Well part of the “issue” is that this new frame generation tech can generate up to 3 or 4 frames for every 1 actually rendered by the hardware. We’ve already started to see games become less optimized and heavily reliant on frame generation to hit reasonable frame rates and it’s definitely possible this could get worse in the future is one of the concerns. Skews benchmarks results too between actual frames rendered and fake frames, might want to get a card that can play whatever your favorite game is at 120fps, so you go looking up benchmarks, only to find that the benchmarks were hitting 120 fps with 4 “fake” frames and 1 actual frame. Now thats a pretty extreme example admittedly but not out of the realm of possibility. So it would take 5 frames for an input you made to show up for you, as opposed to just 1 frame.",
          "score": 1,
          "created_utc": 1737442042.0,
          "replies": []
        },
        {
          "id": "m7c13er",
          "author": "ManiacalDane",
          "body": "We've... Already tried this whole fake-frame bullshit, it sucks ass. I don't see how \"magic AI frames\" are going to be much better tbh",
          "score": 0,
          "created_utc": 1736973498.0,
          "replies": []
        },
        {
          "id": "m7cvyk3",
          "author": "Arclite02",
          "body": "Sooo...  They're not \"fake\"...  But they're also not real??\n\nWell, WTF are they then?!?",
          "score": 0,
          "created_utc": 1736982454.0,
          "replies": []
        },
        {
          "id": "m7edmsd",
          "author": "catluvr37",
          "body": "Ad revenue",
          "score": 0,
          "created_utc": 1737001279.0,
          "replies": []
        },
        {
          "id": "m7axyhv",
          "author": "EducationallyRiced",
          "body": "It’s ai generated frames. So it is fake frames and is noticeable",
          "score": -1,
          "created_utc": 1736962331.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a4hav",
      "author": "TheRealPitabred",
      "body": "I'm not against frame generation. I'm against it being used disingenuously when compared against existing cards. It's apples and oranges, but it's being presented as apples to apples.",
      "score": 111,
      "created_utc": 1736953530.0,
      "replies": [
        {
          "id": "m7effao",
          "author": "Mr_SlimShady",
          "body": "I am against them being needed in a us$2,000 card. If it can’t perform well without these gimmicks, then perhaps it shouldn’t a. be marketed as if it did, and 2. cost this fucking much.\n\nIn a us$300 card? Sure. It’s great that the technology is there to help. On a card that costs as much as a car? Hell no. It shouldn’t be necessary. The card should achieve the advertised claims. Period. They are asking an insane amount of money for the card, so it should at least perform enough to warrant the cost.",
          "score": 20,
          "created_utc": 1737002023.0,
          "replies": [
            {
              "id": "m7f2ha4",
              "author": "Olde94",
              "body": "FSR has been the saviour of my 1660ti, but yeah, shouldn’t be the main selling point of a 2000$ card",
              "score": 10,
              "created_utc": 1737014050.0,
              "replies": [
                {
                  "id": "m7fg65u",
                  "author": "None",
                  "body": "I remember a while ago I was seeing the same thing said about upscaling",
                  "score": 3,
                  "created_utc": 1737022750.0,
                  "replies": [
                    {
                      "id": "m7fm2sj",
                      "author": "Olde94",
                      "body": "haha yeah i did too. \n\nI was actually about to say \"i'm okay with upscaling but not frame gen\" But the reality is that i'm just not happy with the \"current level of\" said technology. \n\nI do pre-rendered stuff and while we all agree a perfect ray traced render is better, boy oh boy is it not worth it, compared to using fewer ray samples and then adding a denoise. We are talking minutes vs seconds. It has allowed me to do animations that would previously not have been possible.   \n\nAt my last job i did a factory tour, 4 minutes long render so around 6000 frames. With denoise it took me what... 20 seconds per frame? previously that would easily have been 10 minutes. we are talking 1000 hours or 40 days full time rendering. i would only have been able to provide still frames from a few spots. \n\nI'm amazed at where we are, and perhaps framegen won't be bad when games are developed with this in mind from the ground up. \n\n...then again, i mainly play single player games soooooooo........",
                      "score": 4,
                      "created_utc": 1737026299.0,
                      "replies": [
                        {
                          "id": "m7mgzwa",
                          "author": "TheRealPitabred",
                          "body": "I'm also ok with upscaling. I just want the compressions to be like for like instead of this. Is implicitly misleading, because while installing works well I can still see a difference. Same with this. This is me as a relative expert... what does this dishonest marketing do for someone who doesn't know the tech realities?",
                          "score": 1,
                          "created_utc": 1737120309.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7ihqtk",
              "author": "fire2day",
              "body": "It’s not even so much that they’re using it to sell the 5090. That card will do fine, and should have a performance bump over the 4090. It’s that they’re trying to sell the 5070 as being better than the 4090 because of this tomfoolery.",
              "score": 2,
              "created_utc": 1737060133.0,
              "replies": []
            },
            {
              "id": "m7fgh02",
              "author": "sade1212",
              "body": "The 4090 was an extremely well-performing card without framegen turned on.",
              "score": 1,
              "created_utc": 1737022942.0,
              "replies": []
            },
            {
              "id": "m7fj9fk",
              "author": "TheRealGOOEY",
              "body": "Where do you think the processing power for frame gen comes from? lol",
              "score": 0,
              "created_utc": 1737024662.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7moowy",
          "author": "Soul-Burn",
          "body": "It's OK for getting 60 to 240, but you know devs will use it to even reach 60...",
          "score": 2,
          "created_utc": 1737123061.0,
          "replies": []
        },
        {
          "id": "m7ecl5w",
          "author": "Kriztauf",
          "body": "I drank apple cider vinegar earlier and wanted to puke",
          "score": -3,
          "created_utc": 1737000829.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a2t2l",
      "author": "VyseX",
      "body": "Honestly, if the end result looks good, is fluid and is responsive: what do I care how exactly the frame was generated. I don't really care whether or not anything was rendered via cuda or via rdna architecture either.\n\nIf it's laggy as hell, then sure, it sucks.",
      "score": 110,
      "created_utc": 1736952981.0,
      "replies": [
        {
          "id": "m7av1sh",
          "author": "Henry5321",
          "body": "I agree. The idea isn’t bad, but a poor execution can be distracting. We’ll have to wait for benchmarks. Get ready for input latency to be a regular metric.",
          "score": 28,
          "created_utc": 1736961492.0,
          "replies": [
            {
              "id": "m7co6ry",
              "author": "SillySin",
              "body": "I just watched (Pc centric) play CP 2077 and showed good (input latency) with +200 fps with frame gen on, but CP so demanding that without frame gen, 5090 was 80 fps.\n\nall settings in cp 2077 maxed out ofc\nhttps://youtu.be/lA8DphutMsY\n\n5080 is highest I can aim for and will probably wait a year to get it myself.",
              "score": 14,
              "created_utc": 1736980042.0,
              "replies": [
                {
                  "id": "m7di5l0",
                  "author": "kentonj",
                  "body": "I have a feeling most people with their nose up about fake frames wouldn’t notice the downsides but *would* enjoy the improvements. \n\nBut even if they couldn’t get past it, and decided not to make use of the feature at all… the 5090 is still more capable than any GPU on the market and will run games with more FPS than any competitor *without frame generation.* To a degree that is more or less commensurate with the price differential from the 4090.",
                  "score": 5,
                  "created_utc": 1736989880.0,
                  "replies": [
                    {
                      "id": "m7eudnp",
                      "author": "None",
                      "body": "It'll be game dependent. In an RPG where I am moving slow and cautiously exploring, It won't be noticeable, in a twitch shooter... it will be. As a 50 year old I no longer play twitch shooters. What do I care. No one who bought a 4090/4080 should ever have thought they should need to buy a 50xx. It was always going to be a refresh, and refreshes generally give a 15-20% improvement in real performance. Just like me about to buy the 5080 (mind you, I am upgrading from a *1080*) I don't care what the next generation brings because only an idiot or person with more money than sense upgrades every cycle.",
                      "score": 5,
                      "created_utc": 1737009293.0,
                      "replies": [
                        {
                          "id": "m7g9u66",
                          "author": "Henry5321",
                          "body": "I'm very latency sensitive. I was reading an article talking about human latency perception, and high end FPS gamers were able to notice a dip of a single frame at 300fps on a 300hz monitor. So if the game dipped down to 299 for even a brief moment, they could reliable indicate that \"something felt off\".\n\nBut consistency is important for perceived responsiveness. If the latency is \"low enough\" and more consistent, it could be an overall win to perception. \"Low enough\" can vary a lot. Generally below 100ms is considered instant, but highly trained people or just naturally skilled can notice all the way to around 40ms. If I remember correctly.",
                          "score": 2,
                          "created_utc": 1737036481.0,
                          "replies": []
                        },
                        {
                          "id": "m7k7lu8",
                          "author": "fesenvy",
                          "body": "Twitch shooters however run much much easier than single player RPGs, they're not demanding on the GPU, and you would turn off frame gen, like any other setting that could increase input latency, anyway.\n\nSo this sort of tech IS for very taxing single player exploration/whatever games where 30 ms of input latency would never be noticed.",
                          "score": 2,
                          "created_utc": 1737079811.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7de8ma",
          "author": "Catfood03",
          "body": "Based on the current implementation of frame-gen, it's less responsive. Noticeably so. I can only imagine how bad the new stuff will feel.",
          "score": 3,
          "created_utc": 1736988556.0,
          "replies": []
        },
        {
          "id": "m7d66s2",
          "author": "hushpuppi3",
          "body": "> If it's laggy as hell, then sure, it sucks.\n\nIt's not about lag, its about artifacting. if the DLSS implementation is bad, the generated frames can have very jarring visual artifacts around more difficult environments (or sometimes around anything that moves)",
          "score": 3,
          "created_utc": 1736985848.0,
          "replies": []
        },
        {
          "id": "m7avx4q",
          "author": "SirBreazy",
          "body": "Well what if the game does not support DLSS 4?",
          "score": 7,
          "created_utc": 1736961746.0,
          "replies": [
            {
              "id": "m7ayt7b",
              "author": "DookieShoez",
              "body": "Then its probably an older game with not all that demanding graphics or even if it is fairly demanding, this is a damn 5090, so you’ll probably be fine without any of that shit.",
              "score": 15,
              "created_utc": 1736962579.0,
              "replies": [
                {
                  "id": "m7dbnoj",
                  "author": "SirBreazy",
                  "body": "Some new games don’t support DLSS though like Helldivers 2, Starfield (at least at launch), Far Cry 6 and Resident Evil 4 Remake, and those are pretty demanding games.",
                  "score": 4,
                  "created_utc": 1736987688.0,
                  "replies": [
                    {
                      "id": "m7dg5z4",
                      "author": "BrunoEye",
                      "body": "Yeah, there are still quite a few games coming out without DLSS, or with outdated versions.\n\nIt also won't help with older games running demanding graphics mods.",
                      "score": 1,
                      "created_utc": 1736989205.0,
                      "replies": [
                        {
                          "id": "m7dig4n",
                          "author": "kentonj",
                          "body": "But will still run those better than any other existing GPU even without making use of the feature.",
                          "score": 2,
                          "created_utc": 1736989981.0,
                          "replies": [
                            {
                              "id": "m7diueb",
                              "author": "BrunoEye",
                              "body": "Yeah, but it means many 50 series cards will be poor value if you don't play many games that support it.",
                              "score": 0,
                              "created_utc": 1736990118.0,
                              "replies": [
                                {
                                  "id": "m7dk2mc",
                                  "author": "kentonj",
                                  "body": "I mean yeah, if you’re playing NES roms then a 5090 isn’t the way to go lol, but if you’re worried about graphically intensive games that don’t have DLSS native support, then it’s still going to do a better job of running it than anything else that exists and you would therefore have to worry a whole lot more about running this hypothetical game on something else.",
                                  "score": 1,
                                  "created_utc": 1736990537.0,
                                  "replies": [
                                    {
                                      "id": "m7ei1i4",
                                      "author": "bkral93",
                                      "body": "Who doesn’t love coil whine of a xx90 series GPU cranking out 2000fps Battletoads ROMs?",
                                      "score": 1,
                                      "created_utc": 1737003173.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m7dlsoh",
                                      "author": "BrunoEye",
                                      "body": "But if you're currently running your games at 144 FPS, upgrading to 50 series so you can run them at 165 FPS doesn't seem very necessary.",
                                      "score": 0,
                                      "created_utc": 1736991127.0,
                                      "replies": [
                                        {
                                          "id": "m7dmsde",
                                          "author": "kentonj",
                                          "body": "Right, if you don’t have a reason to upgrade don’t upgrade. If you’re happy with how your games run, and aren’t interested in other or future games or running them better, then obviously you wouldn’t upgrade. \n\nI was only responding to the idea that one would have to worry about graphically intensive games that don’t support DLSS. When in reality you would have to worry *the least* about the 5090 out of anything else that currently exists.",
                                          "score": 2,
                                          "created_utc": 1736991469.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7bb1dv",
              "author": "DYMAXIONman",
              "body": "Games will just need to support DLSS 3.5 and the new Nvidia app change it to a different version. The number of generated frames is adjusted in the Nvidia app, not the game.",
              "score": 0,
              "created_utc": 1736966065.0,
              "replies": [
                {
                  "id": "m7dbymd",
                  "author": "SirBreazy",
                  "body": "Still, not all of them supports DLSS like some more recent games like Helldivers 2.",
                  "score": 0,
                  "created_utc": 1736987790.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7cpze9",
          "author": "Basshead404",
          "body": "That’s the issue. Higher frame rate increases responsiveness, except DLSS frame generation frames. Basically if the game doesn’t update and fakes it, how can your controls update? Smooth video, but that’s it really.",
          "score": 2,
          "created_utc": 1736980583.0,
          "replies": [
            {
              "id": "m7mp63t",
              "author": "Soul-Burn",
              "body": "Supposedly they use techniques used in VR applications, where a frame with depth info can be transformed with your inputs to generate frames. Yes, the animations don't run, but it does make rotation and also movement feel smoother.\n\n\nIn VR it works fabulously, no idea if it works well in desktop games though.",
              "score": 1,
              "created_utc": 1737123225.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7c76i2",
          "author": "gokarrt",
          "body": "the whole idea of \"fake frames\" relies on the existence \"real frames\", what exactly is real about rendered graphics? mfers think gordon freeman is living in their PC. \n\nand before someone rolls up with \"well the game itself doesn't know about those frames\", they're generated and injected between conventionally rendered frames, so it doesn't need to, nor does it have any tangible effect on how the inputs are interpreted by the games. it's a distinction without a difference, as long as it feels and looks good.",
          "score": 1,
          "created_utc": 1736975171.0,
          "replies": [
            {
              "id": "m7cfcam",
              "author": "xxxradxxx",
              "body": "Real one generated then AI generates the next 3 based on the real one trying to predict what you are going to do but then you do something opposite, like do 180 turn, to simplify things.\n\nThat's where the delay and stuttering is going to come from. Granted, say you have 60 real frames, so it's hard to notice it in 1/60 of a second but I'd definitely feels like something is off for sure, best way  to describe it is despite you having 240fps it feels like stuttering, not like a pure 240 fps performance",
              "score": 6,
              "created_utc": 1736977472.0,
              "replies": [
                {
                  "id": "m7d34pb",
                  "author": "sinner_dingus",
                  "body": "That’s not how it works the start and end frame are rendered first, then the interpolated frames are inserted after the fact.  Frame gen can’t work without knowing the end state of a frame set in advance.  So essentially, you end up with the same latency as if you had a single frame in the frame buffer.  This is why nvidia advises to only use it on games where you can get at least 60 fps natively",
                  "score": 5,
                  "created_utc": 1736984815.0,
                  "replies": []
                },
                {
                  "id": "m7cgfr9",
                  "author": "gokarrt",
                  "body": "current frame gen only generates a single frame between conventional, so you're talking about the new version. \n\nit also doesn't attempt to predict, it holds the forward frame (hence the latency hit). \n\ni've used it plenty, although admittedly while gaming in my livingroom with a controller, so that likely masks any floatiness that occurs.",
                  "score": 2,
                  "created_utc": 1736977779.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7cyz6o",
              "author": "tartare4562",
              "body": "\"fake\" as in not based on current data (input from the player, triggered events, physic calculations etc) but just extrapolated from the previous state.\n\nAs to why extrapolation doesn't always return meaningful data, please see [relevant xkcd](https://xkcd.com/605/)",
              "score": 1,
              "created_utc": 1736983434.0,
              "replies": [
                {
                  "id": "m7d7e1j",
                  "author": "gokarrt",
                  "body": "love a good xkcd, but considering you know both the beginning and the end state before you generate the frame, it's not exactly accurate here. \n\ninput can be argued, but how much input you think can be missed in 16ms? even if you're pushing it at 40fps base framerate, that's still only 25ms. what do you think happens to your inputs between rendered frames when playing without frame gen?",
                  "score": 5,
                  "created_utc": 1736986254.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7c5f0y",
          "author": "dervu",
          "body": "Let's say you get couple of frames AI generated, but one is real. You shot during frame number 3 that is AI generated, does CPU still know you shot exactly where your crosshair was?",
          "score": 0,
          "created_utc": 1736974678.0,
          "replies": [
            {
              "id": "m7lasum",
              "author": "lainiwaku",
              "body": "Man does exaggerate like that though, I'm against fake frame but our brain does shoot at 1fps precision XD",
              "score": 1,
              "created_utc": 1737096429.0,
              "replies": [
                {
                  "id": "m7lduof",
                  "author": "dervu",
                  "body": "Doesnt matter as FG always gives real frame as last pushed one, thads where latency comes from.\nLike: real frame + AI frame + real frame them.pusj to display.",
                  "score": 1,
                  "created_utc": 1737098198.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7djzdz",
          "author": "elton_john_lennon",
          "body": "> Honestly, if the end result looks good, is fluid and is responsive:\n\nThat's the thing - it might not be. As previous DLSS, this one also comes with huge caveats, and the more aggresive setting you use the worse it will look, but that isn't the main problem and why you should care. \n\nnVidia wants those DLSS fake frames to be seen as equal to raw power frames, and advertises them as such, and in the end wants this to be the new normal when it comes to how we see generational jumps between GPU, where in reality like I said it isn't as good as raw power (even previous DLSS isn't and it was faking much less frames than this new gen) and what is more important - it is title based. So no dev DLSS implementation - no fake frame gains. \n\nAnd guess what, most of the world doesn't have 5000 series, so there isn't that much incentive for devs to spend money on this particular implementation where they could let's say make a paid DLC instead in that same time and potentially make money from every player that bought their game. It also doesn't work with VR.",
          "score": 0,
          "created_utc": 1736990506.0,
          "replies": []
        },
        {
          "id": "m7d0azp",
          "author": "Infinite_Somewhere96",
          "body": "How do you play the games which need high FPS? Do you, slowly walk through places, ever so slightly moving your mouse to look around?\n\nOr are you running around and driving things? taking sharp turns? going at fast speeds? Dodging things?\n\nIf its the first one, thats fine, you can be a special snowflake. but if its the later, then ask yourself why the fake frame demo's never show this",
          "score": -2,
          "created_utc": 1736983870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a1jsa",
      "author": "None",
      "body": "[removed]",
      "score": 134,
      "created_utc": 1736952567.0,
      "replies": [
        {
          "id": "m7a9t6n",
          "author": "squidgy617",
          "body": "> all frames are fake and every image you've ever seen on a display device is fake\n\n\nAgree with everything you said but also want to add that I think this argument is silly because, sure, all frames are fake, but what people mean when they say \"fake frame\" is that the card is not rendering the actual, precise image the software is telling it to render.\n\n\nIf I'm running a game at 120 FPS native, every frame there is an actual snapshot that the software is telling the hardware to render. It is 1:1 to the pixels the software is putting out.\n\n\nThat's not the case if I'm actually running at 60 FPS and generating the other 60 frames. Those frames are \"guesses\" based on the frames surrounding them, they aren't 1:1 to what the game would render natively.\n\n\nSo sure, all frames are fake, but native frames are what the game is actually trying to render, so even if ignoring input latency I still think there's a big difference.",
          "score": 43,
          "created_utc": 1736955197.0,
          "replies": [
            {
              "id": "m7adzjw",
              "author": "AMD718",
              "body": "True. Engine rendered frames are deterministic. \"Fake frames\" are interpolated approximations.",
              "score": 25,
              "created_utc": 1736956454.0,
              "replies": [
                {
                  "id": "m7cm5cq",
                  "author": "I_hate_all_of_ewe",
                  "body": "> ~~interpolated~~ extrapolated\n\n\nFTFY\n\n\nYou'd need to know the next frame for it to be an interpolation.  But if you knew that, that would defeat the purpose of this feature.",
                  "score": -3,
                  "created_utc": 1736979425.0,
                  "replies": [
                    {
                      "id": "m7cqacy",
                      "author": "AMD718",
                      "body": "They do know the next frame. Frame A and E are engine rendered and intermediate frames B C D are interpolated between. Unless I'm mistaken.",
                      "score": 7,
                      "created_utc": 1736980676.0,
                      "replies": [
                        {
                          "id": "m7cr7df",
                          "author": "I_hate_all_of_ewe",
                          "body": "That would introduce too much latency.  Frame E is unknown while B, C, and D are generated.",
                          "score": -9,
                          "created_utc": 1736980959.0,
                          "replies": [
                            {
                              "id": "m7csqxa",
                              "author": "AMD718",
                              "body": "They introduce latency equal to one rendered frame (the one that had to wait for the second rendered frame) plus frame generation overhead in order to perform the interpolation calculations. Then, they try to claw back some of that latency hit through reflex and anti-lag2 latency reduction technologies.",
                              "score": 7,
                              "created_utc": 1736981434.0,
                              "replies": [
                                {
                                  "id": "m7ctm4s",
                                  "author": "I_hate_all_of_ewe",
                                  "body": "You'd have latency equal to roughly 1.25 * non-ai fps.  If you were using this tech to render at 120fps from 30fps, you'd have 41ms latency.  That's egregious.",
                                  "score": 1,
                                  "created_utc": 1736981707.0,
                                  "replies": [
                                    {
                                      "id": "m7cuuhr",
                                      "author": "AMD718",
                                      "body": "Exactly right. 120fps would feel worse than 30 fps (maybe 25 fps equivalent per your statement above), which is egregious as you've said. However, two things. The technology is really meant to be used with base frame rates closer to 60 fps or above, which will necessitate displays of at least 240hz. Also, Nvidia is hoping to use frame warping in reflex 2 to claw back a couple more ms of latency lost to frame gen. It's not very appealing to me.",
                                      "score": 6,
                                      "created_utc": 1736982096.0,
                                      "replies": [
                                        {
                                          "id": "m7evhbf",
                                          "author": "Gamebird8",
                                          "body": ">However, two things. The technology is really meant to be used with base frame rates closer to 60 fps or above, which will necessitate displays of at least 240hz. \n\nThis is the part that just breaks it for me imo.  Like 60fps is solid.  You don't **need** to exceed 60 in a lot of games to be honest.  120Hz gaming is very nice QoL feature in non-competitive games, but these are also games where the pace is fine for 60fps.\n\n\nIt just doesn't seem *useful* for the types of FPS where it would actually be beneficial",
                                          "score": 5,
                                          "created_utc": 1737009907.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7fgxby",
                      "author": "sade1212",
                      "body": "Agonising - no, you didn't \"fix it\". DLSS frame gen IS interpolation. Your card renders the next frame, and then generates one or more intermediary frames to display before it. That's why there's a latency downside.",
                      "score": 4,
                      "created_utc": 1737023227.0,
                      "replies": [
                        {
                          "id": "m7h7lhr",
                          "author": "I_hate_all_of_ewe",
                          "body": "Got it. Thanks.  I assumed NVIDIA wouldn't use the dumbest implementation possible.",
                          "score": 1,
                          "created_utc": 1737046818.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7fk4g6",
                      "author": "Alfiewoodland",
                      "body": "It is 100% interpolation. This is how DLSS frame generation works. Two frames are rendered to buffer, then a third is calculated in between, then they are displayed.\n\nApparently it doesn't defeat the purpose.\n\nFrame extrapolation does exist (see: async time warp for Oculus VR headests and the new version of Nvidia Reflex) but this isn't that.",
                      "score": 3,
                      "created_utc": 1737025169.0,
                      "replies": [
                        {
                          "id": "m7h76l7",
                          "author": "I_hate_all_of_ewe",
                          "body": "Sorry, I assumed NVIDIA wouldn't use the dumbest implementation possible.",
                          "score": 1,
                          "created_utc": 1737046700.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7aro5k",
                  "author": "Wpgaard",
                  "body": "That is true. But isn't it dumb to dismiss something purely because its an \"approximation\"? If the approximation becomes indistinguishably or provide such a huge performance benefit that other aspects of the image can be improved dramatically (through path tracing or similar).\n\nEdit: please people, learn some statistic. If you want to know how many people who are overweight in your country, you dont go out and ask every single person. You make a high-quality dataset that is representative of the population. That data will give you a result that is almost indistiguishable from the \"true\" data at a fraction of the time cost.",
                  "score": -4,
                  "created_utc": 1736960498.0,
                  "replies": [
                    {
                      "id": "m7axdzm",
                      "author": "SeyJeez",
                      "body": "The problem is that based on current experience you can see it. I disable frame generation on ANY game so far as it always looks wrong it looks like getting drunk in GTA … not that bad okay but it doesn’t give a nice crisp image. And with those “guessed” frames it can always get stuff wrong it’s almost like those AI image removal tools that guess what the background behind an object is. It can be wrong and if there are wrong frames you can get weird flickering and other issues. I much rather have a nice image at 60 or 70 FPS than 200 FPS with weird artefacts, halos and blur. Also it only looks like 200 but feels like 60 from an input response perspective.",
                      "score": 7,
                      "created_utc": 1736962167.0,
                      "replies": [
                        {
                          "id": "m7az2dt",
                          "author": "Wpgaard",
                          "body": "Sure, there are games that doesn't have as good an implementation as other (see https://www.youtube.com/watch?v=2bteALBH2ew&)\n\nBut the idea of DLSS and FG is sound in their attempt at using the data redundancy of normal rendering to make rendering faster and more efficient.",
                          "score": 1,
                          "created_utc": 1736962653.0,
                          "replies": [
                            {
                              "id": "m7bn2f1",
                              "author": "SparroHawc",
                              "body": "If it were possible to use frame generation on geometry that isn't changing much, and then render in-engine anything that frame generation would have difficulty with?  Then I'd be interested.  As-is, however, that's not the case.  Frame generation knows absolutely nothing about actual in-game geometry.",
                              "score": 2,
                              "created_utc": 1736969497.0,
                              "replies": [
                                {
                                  "id": "m7c0oh1",
                                  "author": "Wpgaard",
                                  "body": "An ML image generator or protein structure predictor doesn't know anything about dogs or protein structures, but they are still more than capable of drawing a perfectly realistic dog or perfectly predict a protein structure, because they are fed enough data.\n\nThats the whole deal with extrapolation and statistics. As you get more and more high-quality data, getting even more data wont really make the result more accurate.",
                                  "score": 4,
                                  "created_utc": 1736973381.0,
                                  "replies": [
                                    {
                                      "id": "m7je89u",
                                      "author": "SparroHawc",
                                      "body": "Except that the extrapolation is, by necessity, going to be imperfect in many ways.  I want rendered geometry where the geometry is moving in ways that can't readily be interpolated, and I want lerping when lerping makes sense.  There are already ways to, for example, only apply anti-aliasing in places where aliasing is likely to show up - why not only apply AI scaling in places where the AI scaling works best, and let the renderer actually render higher res in the places where it doesn't?",
                                      "score": 1,
                                      "created_utc": 1737069847.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "m7cdndt",
                                      "author": "SeyJeez",
                                      "body": "But that needs a lot of processing power that could just be used for native rendering instead?!",
                                      "score": -1,
                                      "created_utc": 1736976991.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7mpoxf",
              "author": "Soul-Burn",
              "body": "Supposedly they use techniques used in VR applications, where a frame with depth info can be transformed with your inputs to generate frames. Yes, the animations don't run, but it does make rotation and also movement feel smoother.\n\n\nIn VR it works fabulously, no idea if it works well in desktop games though.\n\n\nSure, it's not as good as real frames, but it's not completely predicted.",
              "score": 1,
              "created_utc": 1737123405.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a4pxj",
          "author": "Ant1mat3r",
          "body": "This is the nail on the head IMO. \n\nAside from the negatives I've experienced - terrible screen tearing, increased CPU usage taxing my elder 9700k, there's no actual improvement in responsiveness. In fact, in the case of Stalker 2, I feel like it feels *more* sluggish than just dealing with the lower FPS. \n\n  \nI'm all for watching tech evolve and trying new stuff, and I think that anybody who rambles on about \"fake frames\" is an ignorant at best; I also think this tech isn't very useful in practice, at least now. Remember how Physx was supposed to revolutionize gaming by offloading all the physics processing and then it turned out to be a big nothingburger? \n\n  \nI feel that this is in the same vein.",
          "score": 30,
          "created_utc": 1736953608.0,
          "replies": [
            {
              "id": "m7fkwcm",
              "author": "TheRealGOOEY",
              "body": "PhysX did revolutionize gaming. It offloaded physics calculations to a dedicated card originally, and then nVidia acquired it and it instead was run on CUDA. There are just other physics APIs now and processors have improved so much that offloading those calculations is no longer that beneficial.",
              "score": 2,
              "created_utc": 1737025624.0,
              "replies": []
            },
            {
              "id": "m7a5wsg",
              "author": "404_GravitasNotFound",
              "body": "I don't understand how people can't see how noticeable the DLSS effect is...",
              "score": 2,
              "created_utc": 1736953987.0,
              "replies": [
                {
                  "id": "m7a9egg",
                  "author": "SJCKen",
                  "body": "DLSS isn’t frame gen if that’s what your getting at. DLSS renders the game as it normally would but at a lower resolution and then upscales it to a higher resolution to help with the load of playing something like a game at 4k. Render at 1080p -> upscale to 4k. The only thing involved is adding pixels to an image that already exists \n\nFrame gen in regards to the 50 series is literally generating pixels using a previous actually rendered frame as a map to where they most likely will be in the next frame. In the 50s case they are stating that it does 1:3(if I’m remembering correctly) so for every rendered frame, it’s guessing what the next 3 are. \n\nYou could kind of equate it to an artist looking at a movie frame and trying to draw the next 3 most likely frames of the movie, vs the upscaling being an artist looking at a lower quality version of a frame and trying to draw it bigger with more clarity and detail.",
                  "score": 20,
                  "created_utc": 1736955072.0,
                  "replies": [
                    {
                      "id": "m7agt59",
                      "author": "404_GravitasNotFound",
                      "body": "I know how both system work, DLSS causes serious glitches, most commonly an aura of diffraction around any character or moving object, similar to the high heat diffraction you see in real life.",
                      "score": 4,
                      "created_utc": 1736957306.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7arnys",
                  "author": "kvothe5688",
                  "body": "have you seen new transformer based dlss 4? ghosting is basically gone.",
                  "score": -2,
                  "created_utc": 1736960497.0,
                  "replies": [
                    {
                      "id": "m7awfx8",
                      "author": "SeyJeez",
                      "body": "Have you seen it live or a video?",
                      "score": 5,
                      "created_utc": 1736961896.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7aa24i",
                  "author": "smurficus103",
                  "body": "Not everyone is cracked... in 2017 everyone was saying \"the human eye cant see faster than 30 frames, anything past that is unnecessary",
                  "score": -7,
                  "created_utc": 1736955273.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7a5kfn",
          "author": "Trippy_Mexican",
          "body": "Exactly this. It’s not about the cosmetic aspect of this technology, it’s the false sense of better input responsiveness. Playing a game at 30fps and 165fps has drastic performance improvements, but a game running at 100fps in ai frames will still only perform at the 30fps level of input responsiveness",
          "score": 9,
          "created_utc": 1736953880.0,
          "replies": []
        },
        {
          "id": "m7akdsf",
          "author": "uniquelyavailable",
          "body": "the fun doesn't stop there. network frames are also capped and often variable, operating sometimes at a lower threshold than 60 samples per second. meaning the displacement of multiplayer entities is already interpolated before your computer makes fake frames from their movement.",
          "score": 9,
          "created_utc": 1736958376.0,
          "replies": [
            {
              "id": "m7cmtaj",
              "author": "I_hate_all_of_ewe",
              "body": "> ~~interpolated~~ extrapolated\n\n\nWhen you guess the value between two known points, that's an interpolation.  When you only know the previous points and you try to guess the next point, that's an extrapolation.",
              "score": -1,
              "created_utc": 1736979624.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7cbd7t",
          "author": "CompromisedToolchain",
          "body": "You can just call them fake. They are fake because they are disconnected from input.",
          "score": 2,
          "created_utc": 1736976343.0,
          "replies": []
        },
        {
          "id": "m7aosik",
          "author": "L4ZYKYLE",
          "body": "How does FG work with v-sync? If the monitor is capped at 120hz, does the game only run 30fps when using fgx4?",
          "score": 1,
          "created_utc": 1736959663.0,
          "replies": [
            {
              "id": "m7arnoa",
              "author": "AMD718",
              "body": "You would need to cap the frame rate (either the base frame rate or the aggregated fg frame rate, post frame generation) to avoid exceeding the monitors maximum refresh rate, otherwise you'll experience tearing just like with native fps that exceeds vrr range",
              "score": 1,
              "created_utc": 1736960495.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a7iur",
          "author": "beleidigtewurst",
          "body": "...",
          "score": 1,
          "created_utc": 1736954492.0,
          "replies": []
        },
        {
          "id": "m7akkhq",
          "author": "nguyenm",
          "body": "This conversation I emulates the 2010s era conversation regarding multi-GPU usage, particularly in how AFR or Alternate Frame Rendering was used. \n\nIf all frames takes 33.3ms to render at 30fps and assume 100% scaling to 60fps with SLI/Crossfire, each individual frame still takes 33.3ms to render but the it's buffered to allow for higher fps at the cost of latency. Nowadays, FG is utilizing a similar process but instead of a second GPU, it's fixed-fuction hardware that has nothing to do with GPU tasks.",
          "score": 1,
          "created_utc": 1736958431.0,
          "replies": []
        },
        {
          "id": "m7a760x",
          "author": "timmytissue",
          "body": "This is exactly what is meant by calling the frames fake and I agree with the description of the as fake exactly because a frame implies an instance of the game updating its state / game time moving forward. However you want to put it.",
          "score": 0,
          "created_utc": 1736954380.0,
          "replies": []
        },
        {
          "id": "m7d0fhz",
          "author": "Infinite_Somewhere96",
          "body": "wow dude, deep, thanks for your contribution, i bet you like trains and counting cars",
          "score": -1,
          "created_utc": 1736983913.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7bhz0k",
      "author": "TheTarasenkshow",
      "body": "In my opinion the games you’ll want higher frame rates in are the games input latency will be an issue. All these “fake” frames are going to cause input latency and doesn’t make sense to me",
      "score": 5,
      "created_utc": 1736968039.0,
      "replies": [
        {
          "id": "m7cjekl",
          "author": "cheezman22",
          "body": "Sure, but i don't think you're gonna need \"fake\" frames to be running counter strike at 240 fps. But if you have a 240hz monitor and want to play cyberpunk 4k ultra you will need the \"fake\" frames to get there.",
          "score": 0,
          "created_utc": 1736978616.0,
          "replies": []
        },
        {
          "id": "m7ilzkx",
          "author": "unskilledplay",
          "body": "Is that true?  You can already exceed a high end monitor's refresh rates in all of the competitive esports games with current hardware that you can buy today. Every esport game is intentionally designed around low latency with current hardware.\n\nThe list of games that cannot be rendered at high resolution **and** high frame rate **and** highest settings with current hardware is short. You have titles like Cyberpunk, MS Flight Simulator, Minecraft ray tracing and Alan Wake 2. In these titles, around 50-70ms latency is well within what is acceptable.\n\nThe problem I see is that a meaningful uplift can be seen in only 4-5 games that anyone who would consider buying one of these cards will have already played 3 or more years ago.",
          "score": 0,
          "created_utc": 1737061357.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m79w4gy",
      "author": "Seigmoraig",
      "body": "Haven't they been pushing this since the RTX 2000 series cards ?",
      "score": 27,
      "created_utc": 1736950702.0,
      "replies": [
        {
          "id": "m79xpsm",
          "author": "Crintor",
          "body": "Frame generation only began with the RTX 4000 series. The 2000 series introduced DLSS Super Resolution, which is AI upscaling.",
          "score": 72,
          "created_utc": 1736951259.0,
          "replies": [
            {
              "id": "m7a0w8y",
              "author": "mteir",
              "body": "Fake pixels vs. fake frames. You could argue it sort of started with the 2000, but the first full frame was with the 4000. With the potential \"fake\" to \"real\" pixels increasing with each generation.",
              "score": 11,
              "created_utc": 1736952349.0,
              "replies": [
                {
                  "id": "m7a25ju",
                  "author": "Crintor",
                  "body": "There is no downsides to DLSS as it continues to improve in quality, frame generation is the one that has an actual \"downside\".\n\nDLSS is the best thing to happen to gaming performance in a very long time in my opinion, the only thing that would make it better would be if they got a way to make it driver level implementation, especially with the new higher quality switch to Transformer based model(s).",
                  "score": 23,
                  "created_utc": 1736952768.0,
                  "replies": [
                    {
                      "id": "m7a4ibc",
                      "author": "drmirage809",
                      "body": "Oh yeah, of all the fancy upscaling techniques that we've been seeing enter the scene ever since RT and 4k screens entered the market DLSS is by far the cleanest looking. FSR has come a very long way since version 1 and XESS is no slouch either from what I've seen. But they're both more prone to ghosting and blurring compared to DLSS. \n\nI've never messed around with Nvidia's frame gen, but AMD's is okay. I used it to smooth out the framerate when I played The Last of Us and it did a good job there. Wouldn't dare use it in something that requires more twitch input however. It worked well in a slower paced game and that's probably where it's best.",
                      "score": 5,
                      "created_utc": 1736953539.0,
                      "replies": []
                    },
                    {
                      "id": "m7a3q7v",
                      "author": "sopsaare",
                      "body": "There are downsides to everything in the real world. DLSS too, it can create artifacting in certain situations.",
                      "score": 13,
                      "created_utc": 1736953281.0,
                      "replies": []
                    },
                    {
                      "id": "m7a5ng5",
                      "author": "404_GravitasNotFound",
                      "body": "Except the shimmering you get around characters, I can't stand any DLSS/FSR etc, I can continuously notice the area around objects and characters where the IA fails to extrapolate correctly, everything has that \"Heat distortion\" effect, it's particularly egregious in  VR...",
                      "score": 12,
                      "created_utc": 1736953906.0,
                      "replies": [
                        {
                          "id": "m7a9kxz",
                          "author": "smurficus103",
                          "body": "Also when you pan quickly around, the entire world goes compression lookin",
                          "score": 12,
                          "created_utc": 1736955127.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m7czelo",
                      "author": "Nihlathak_",
                      "body": "It has downsides tho. Developers are becoming lazy AF because they are promised almost unlimited performance from both nvidia and epic, yet a DLSS game with nanite and lumen becomes a ghosted, blurry mess and still running at sub-100 fps. Now we’re getting quad frame-gen on top of that. \n\nIMO, DLSS and framegen should be what enables an optimized game to run at 240 fps, and that shouldn’t require more than every other frame being generated. Instead devs will now look at framegen and think “oh boy, we can just disregard optimization even more because framegen let’s us hit 80 fps anyways”",
                      "score": 3,
                      "created_utc": 1736983575.0,
                      "replies": []
                    },
                    {
                      "id": "m7a899b",
                      "author": "beleidigtewurst",
                      "body": ">There is no downsides to DLSS as it continues to improve in quality\n\nPlease....",
                      "score": 13,
                      "created_utc": 1736954718.0,
                      "replies": []
                    },
                    {
                      "id": "m7a6l1y",
                      "author": "Shadowcam",
                      "body": "It's a shame that they're trying to move the goal-post to ai frames just as dlss and fsr are getting noticeable quality improvements.",
                      "score": 3,
                      "created_utc": 1736954200.0,
                      "replies": []
                    },
                    {
                      "id": "m7a9akt",
                      "author": "mteir",
                      "body": "Marketing aside, I think they are both good, as long as you can turn them on and off depending on the game you play.",
                      "score": 1,
                      "created_utc": 1736955039.0,
                      "replies": [
                        {
                          "id": "m7acoyt",
                          "author": "Crintor",
                          "body": "I agree. People lose their minds over frame generation but there is almost no reason to not turn it on, the only games that it isn't a no brainer for me are fast paced first person games, where you can really feel the lower internal framerate and input, especially with a mouse. \n\nAnything third person, anything on a controller, give me all the generated frames as long as they aren't artifacting all over the place.",
                          "score": 2,
                          "created_utc": 1736956067.0,
                          "replies": [
                            {
                              "id": "m7adryi",
                              "author": "Rhellic",
                              "body": "Yeah I don't understand what some people are so upset about. It's just one more tool.\n\nAnd I say that as someone whose usual attitude to anything labelled AI these days lies somewhere between meh and burn it down.",
                              "score": 1,
                              "created_utc": 1736956392.0,
                              "replies": [
                                {
                                  "id": "m7ajyz0",
                                  "author": "Inquisitor2195",
                                  "body": "Tbh, I think frame gen is a very mixed bag. The tech is new, hasn't had all the kinks worked and people are still learning how to implement it in games. Same with Ray Tracing tbh.",
                                  "score": 2,
                                  "created_utc": 1736958254.0,
                                  "replies": []
                                },
                                {
                                  "id": "m7arrcq",
                                  "author": "SovietMacguyver",
                                  "body": "The problem is systemic. Games are developed with a certain high standard by the developers to fulfil a vision for the player experience. NVIDIA has unilaterally decided it can cut corners on that experience with fancy tricks in order to win in fps charts and sell more GPUs, and the sad reality is that it's not just being eaten up, but actually defended by people here. It's madness. And NVIDIA has always cut corners like this. The difference now is how it markets it as a good thing.",
                                  "score": 2,
                                  "created_utc": 1736960524.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m7deqeq",
                      "author": "Catfood03",
                      "body": "DLSS doesn't look good, ghosting, dithering and blurriness make it a worse option than no AA at all for me.",
                      "score": 1,
                      "created_utc": 1736988723.0,
                      "replies": []
                    },
                    {
                      "id": "m7akocg",
                      "author": "dead_fritz",
                      "body": "While for the majority of situations, yeah frame generation and upscaling should perform okay there are plenty of situations and plenty of games where it just breaks down entirely. For example in Death Stranding upscaling creates weird ghosting with a lot of this sort of floating elements that exist in that game. And I've recently been playing Horizon Forbidden West which has a lot of swimming in it. The upscaling just completely breaks down when it's faced with large-scale water movement. To the point where I had to turn it off because it was actively giving me a headache.",
                      "score": 1,
                      "created_utc": 1736958462.0,
                      "replies": []
                    },
                    {
                      "id": "m7ak29t",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -5,
                      "created_utc": 1736958282.0,
                      "replies": [
                        {
                          "id": "m7anyb4",
                          "author": "Crintor",
                          "body": "It's funny the number of people who have commented, pointing out the few small quality issues with DLSS Super Resolution while completely ignoring the fact that I immediately said \"As it continues to improve in quality\"",
                          "score": 7,
                          "created_utc": 1736959421.0,
                          "replies": [
                            {
                              "id": "m7b6ytl",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1736964901.0,
                              "replies": [
                                {
                                  "id": "m7b7au7",
                                  "author": "Crintor",
                                  "body": "The downside is you aren't gaining a reduction in latency that \"real\" rendering provides. Which does matter, it's just not the end of the world in most games.",
                                  "score": 1,
                                  "created_utc": 1736964998.0,
                                  "replies": [
                                    {
                                      "id": "m7fn9lz",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 1,
                                      "created_utc": 1737026956.0,
                                      "replies": [
                                        {
                                          "id": "m7gi8ia",
                                          "author": "Crintor",
                                          "body": "I said it had a downside, not that it had no upside. Everyone who isn't a \"fake frames\" lemming knows it makes motion smoother and better.",
                                          "score": 1,
                                          "created_utc": 1737039300.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7a06d0",
              "author": "Seigmoraig",
              "body": "I stand corrected",
              "score": 6,
              "created_utc": 1736952105.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m79zioe",
          "author": "hyrumwhite",
          "body": "This is the first time they’ve presented frame generation as ‘performance’. It’s cool tech, but it should be treated as a bonus feature, imo",
          "score": 15,
          "created_utc": 1736951882.0,
          "replies": [
            {
              "id": "m7a14k2",
              "author": "Seigmoraig",
              "body": "I'm in for it, this is one of the good things AI does imo",
              "score": 4,
              "created_utc": 1736952427.0,
              "replies": [
                {
                  "id": "m7a7vv2",
                  "author": "timmytissue",
                  "body": "I don't see what frame gen really adds to the experience. Its only recommended for going from above 60 fps to higher anyway and anyone who cares about framerate above 60 fps cares about it because of responsiveness, not smoothness. Frame generation slightly reduces responsiveness so the game feels more laggy than without it. \n\nIt only makes sense in my mind for like racing games that you are playing on a controller at 50 fps and you want more smoothness.",
                  "score": 7,
                  "created_utc": 1736954603.0,
                  "replies": [
                    {
                      "id": "m7bebi4",
                      "author": "chronotrigs",
                      "body": "It might make it possible for me to play Elden Ring honestly, Im impaired and can only handle games with 90+ fps... And Elden Ring freaks out above 60fps because the engine is shit. Frame generation would allow Elden Ring to stick to 60fps but be visually Smooth ",
                      "score": 2,
                      "created_utc": 1736966995.0,
                      "replies": [
                        {
                          "id": "m7bommd",
                          "author": "SparroHawc",
                          "body": "Boy, you must have had a miserable time trying to play console games.",
                          "score": 2,
                          "created_utc": 1736969948.0,
                          "replies": []
                        },
                        {
                          "id": "m7brm67",
                          "author": "timmytissue",
                          "body": "That's an interesting use case. Can you watch movies?\n\nAlso you can unlock the fps with some mods quite easily and it works fine but you do need a nice cpu to run it above 90.",
                          "score": 1,
                          "created_utc": 1736970799.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7a8ds4",
              "author": "beleidigtewurst",
              "body": "It's so cool, you can buy software that does it no matter what your GPU is, on Steam:\n\nhttps://store.steampowered.com/news/app/993090/view/4145080305033108761",
              "score": 1,
              "created_utc": 1736954758.0,
              "replies": []
            },
            {
              "id": "m7a4k9c",
              "author": "Hans0000",
              "body": "It's not a bonus feature when there are multiple cuda units built into the cards just for this. \n\nNormal hardware generation has its performance limits and Nvidia is out here innovating with AI creating new high gains.\n\nInstead we're complaining about \"fake frames\" when everything is just pixels on the screen to begin with.",
              "score": -3,
              "created_utc": 1736953557.0,
              "replies": [
                {
                  "id": "m7a85xu",
                  "author": "timmytissue",
                  "body": "The generated frames can't have new information or updated mouse movement. They literally delay your frame by 1 frame to insert a frame before it. It adds latency, it's not more performance.",
                  "score": 4,
                  "created_utc": 1736954690.0,
                  "replies": []
                },
                {
                  "id": "m7a4rm3",
                  "author": "hyrumwhite",
                  "body": "It’s a bonus feature provided by hardware. Still not raw performance.",
                  "score": 5,
                  "created_utc": 1736953624.0,
                  "replies": [
                    {
                      "id": "m7a5rx3",
                      "author": "Hans0000",
                      "body": "It's not a bonus feature, it's a technology that cost billions of dollars and years to develop. And now they're using as a main marketing point to sell the cards.\n\nGoogle what \"bonus\" means cause this ain't it.\n\nIf you buy an expensive card just to play without its featured, you're the dumbass not them.",
                      "score": -9,
                      "created_utc": 1736953945.0,
                      "replies": [
                        {
                          "id": "m7a8q60",
                          "author": "vmsrii",
                          "body": "Listen. If the frame isn’t directly informed by my input as a player, it’s not a real frame. \n\nVideo games are interactive. If the machine is doing things without my input as the player, in a context where my input should be taken into account on a frame-by-frame basis, then the device has failed as a way to play video games. It’s as simple as that. \n\nFrame generation isn’t “real” because while it’s generating frames, it’s making guesses at what those frames should look like, independent of the rest of the system, and therefore without the input of the player.",
                          "score": 6,
                          "created_utc": 1736954865.0,
                          "replies": [
                            {
                              "id": "m7ae49i",
                              "author": "Rhellic",
                              "body": "That's really only relevant for certain games and even then often only if you play competitively.",
                              "score": -1,
                              "created_utc": 1736956493.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m7a72no",
                          "author": "hyrumwhite",
                          "body": "I’m not saying you shouldn’t use it. I’m saying it shouldn’t be used to present performance. And it certainly shouldn’t be used as a crutch by developers to deliver acceptable fps. ",
                          "score": 8,
                          "created_utc": 1736954352.0,
                          "replies": [
                            {
                              "id": "m7a862y",
                              "author": "Hans0000",
                              "body": "It's Nvidia's card, they can choose what represents the performance and what to sell.\n\nAnd you need to know that normal rasterization and in-engine rendering is reaching its mathematical limits and efficiencies. That technology will soon be unwinded in the coming decades.\n\nIf hardware rendering was good, scalable and efficient. These companies wouldn't poor trillions into developing other technologies.",
                              "score": -4,
                              "created_utc": 1736954691.0,
                              "replies": [
                                {
                                  "id": "m7a8uby",
                                  "author": "hyrumwhite",
                                  "body": "While rasterization is the way we render games, it’s disingenuous to present generation as valid performance. ",
                                  "score": 7,
                                  "created_utc": 1736954900.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7a8mrd",
                          "author": "beleidigtewurst",
                          "body": ">It's not a bonus feature, it's a technology that cost billions of dollars \n\nMy 15+ years old Samsung TV has it. Good to know it was so expesnive to develop this \"amazing technology\".\n\nHere is another \"multi billion\" project, right?\nhttps://store.steampowered.com/news/app/993090/view/4145080305033108761",
                          "score": 3,
                          "created_utc": 1736954834.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m79z8hu",
          "author": "None",
          "body": "Dlss gives you more real rendered frames. Frame gen does not",
          "score": 12,
          "created_utc": 1736951784.0,
          "replies": [
            {
              "id": "m7a0sfy",
              "author": "TehOwn",
              "body": "Sure but with DLSS, it's generating \"fake\" pixels.\n\nThe only difference with frame gen is that it's generating the entire frame rather than part (often most) of it.",
              "score": -9,
              "created_utc": 1736952313.0,
              "replies": [
                {
                  "id": "m7a1pd7",
                  "author": "None",
                  "body": "That’s still different. you are getting hung up on the fake term.\n\nThe frames from Dlss are actual frames rendered in the gpu, you can do this without upscaling by simply running the game at lower res. Frame gen is glorified motion smoothing.\n\nIdk why yall are so desperate to defend a tech company’s bullshit",
                  "score": 15,
                  "created_utc": 1736952618.0,
                  "replies": []
                },
                {
                  "id": "m7a2oz9",
                  "author": "2roK",
                  "body": "This is a massive difference",
                  "score": 5,
                  "created_utc": 1736952946.0,
                  "replies": [
                    {
                      "id": "m7a58yi",
                      "author": "TehOwn",
                      "body": "I don't know, man. If you're doing a 2x upscale (say 1080p to 4K) then 75% of the pixels are generated already.",
                      "score": -4,
                      "created_utc": 1736953778.0,
                      "replies": [
                        {
                          "id": "m7a8tc0",
                          "author": "timmytissue",
                          "body": "That's not how that works at all. It's temporal. It's taking image data from earlier frames not just upresing an image out of thin air.",
                          "score": 5,
                          "created_utc": 1736954892.0,
                          "replies": []
                        },
                        {
                          "id": "m7a8yd8",
                          "author": "None",
                          "body": "Like most people you are hung up on the “fake” term.\n\nUpscaling simply takes the image you have rendered and upscales it to a larger one, it is not generating an entirely new image and it is not “generating fake pixels” it is taking the pixels it has and splitting them into what they should be at a higher resolution.\n\nIt is entirely different from generating an entire frame.",
                          "score": 4,
                          "created_utc": 1736954934.0,
                          "replies": [
                            {
                              "id": "m7ad5pr",
                              "author": "TehOwn",
                              "body": ">it is not “generating fake pixels” it is taking the pixels it has and splitting them into what they should be at a higher resolution.\n\nIt really is generating fake pixels. It's filling in the gaps. We've always been able to non-generatively upscale images through simple interpolation methods. That's not what DLSS is doing.",
                              "score": -2,
                              "created_utc": 1736956205.0,
                              "replies": [
                                {
                                  "id": "m7ahxfq",
                                  "author": "None",
                                  "body": "Dlss is not generative. Frame gen is.",
                                  "score": 2,
                                  "created_utc": 1736957645.0,
                                  "replies": [
                                    {
                                      "id": "m7avejg",
                                      "author": "TehOwn",
                                      "body": "If it's not generative then where do the artifacts come from?\n\nIt's not simple interpolation, we've had that for decades and you could do that temporally for frame gen also.\n\nIt's literally taking a smaller image, scaling it up and filling in the gaps. If you're going from 1080 to 4K, you have literally 6.2 million (75%) missing pixels.\n\nHeck, my android phone can do 3x upscaling using interpolation. DLSS is a lot more than that. That's where the AI comes in.",
                                      "score": 1,
                                      "created_utc": 1736961597.0,
                                      "replies": [
                                        {
                                          "id": "m7b8kv3",
                                          "author": "None",
                                          "body": "All upscalers with or without AI cause artifacts due to algorithm mistakes.\n\nDo research on these concepts please because AI upscaling is not generative, it’s not completely black and white but it’s not considered generative ai.",
                                          "score": 0,
                                          "created_utc": 1736965364.0,
                                          "replies": [
                                            {
                                              "id": "m7b9vjk",
                                              "author": "TehOwn",
                                              "body": "A basic algorithm like an interpolator isn't going to make those kind of mistakes. It'd be single pixel errors, if anything, our CPUs and memory are remarkably low error rate. Interpolation-based upscalers essentially don't have artifacts, at all. I've used them a lot. What they do have, are limitations. They simply don't look as good as they could with generative AI.\n\nWhat you're thinking of is hallucination. Brought on by the fact that it uses a pre-trained neural network to generate the missing pixels.\n\nEven NVIDIA is pretty clear that it's generative:\n\n> DLSS Super Resolution boosts performance by using AI to output higher-resolution frames from a lower-resolution input. DLSS samples multiple lower-resolution images and uses motion data and feedback from prior frames to construct high-quality images.\n\n> DLSS 3 uses its Super Resolution AI to recreate three-quarters of an initial frame, roping in Frame Generation to complete the second frame.\n\nAnd I have done research and I've written my own AI, used both generative and non-generative AI, worked with both kinds of upscalers, written my own games, etc.\n\nWhat's your experience? Where are your sources?",
                                              "score": 1,
                                              "created_utc": 1736965733.0,
                                              "replies": [
                                                {
                                                  "id": "m7bbfg2",
                                                  "author": "None",
                                                  "body": "Just articles. Send me the links to your portfolio I’m glad you’re a successful AI guru.",
                                                  "score": 2,
                                                  "created_utc": 1736966177.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7a8idy",
                  "author": "timmytissue",
                  "body": "No because dlss allows for higher frame rates and responsiveness. Frame gen delays your real frame to add an intermediate frame, which means less responsiveness and therefore more lag. It just adds smoothness.",
                  "score": 5,
                  "created_utc": 1736954797.0,
                  "replies": [
                    {
                      "id": "m7adgrx",
                      "author": "TehOwn",
                      "body": "Is it smoothing or is it prediction? \n\nYou could do smoothing without AI, so why would this be new tech and rely on AI if it isn't prediction?",
                      "score": 1,
                      "created_utc": 1736956298.0,
                      "replies": [
                        {
                          "id": "m7ae6cf",
                          "author": "timmytissue",
                          "body": "Well it uses AI tech to make the smoothing better and it doesn't motion smooth text and UI elements. But yeah it's just smoothing. It doesn't increase the amount of frames the game engine is making.",
                          "score": 4,
                          "created_utc": 1736956510.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7ak86f",
          "author": "ChaseballBat",
          "body": "Yes, it isn't even a feature turned on. You have to activate it.",
          "score": 1,
          "created_utc": 1736958330.0,
          "replies": []
        },
        {
          "id": "m79wpp9",
          "author": "diuturnal",
          "body": "Was the 20 series main(and mostly only because ray tracing sucked) selling point over the 1080ti.",
          "score": -8,
          "created_utc": 1736950909.0,
          "replies": [
            {
              "id": "m79xkfu",
              "author": "Crintor",
              "body": "The 2000 series did not and cannot perform frame generation, try to limit misinformation.",
              "score": 11,
              "created_utc": 1736951206.0,
              "replies": [
                {
                  "id": "m79znfu",
                  "author": "nipsen",
                  "body": "It's still the case that Nvidia's sales-people have been using \"free\" post-processing filters -- supersampling, anti-aliasing and now eventually frame-generation -- as their main selling point since before the 1000-series.\n\nIf you actually look at the way the benchmarks have been set up as well, it's typically a comparison with the competition (and with their own competing products, for example on ARM) that favours post-processing filters heavily over real-time generated effects. \n\nEven the ray-tracing(read: raycast) modules, that really are just more complex simd-processors than the ones normally used, has been downplayed heavily - because it undercuts the sales-pitch of \"get post-processing for free\".\n\nSo it's not wrong to say that nvidia has focused on frame-generation for a very long time. Or that - in spite of their graphics cards having been at many points the best product - the main pitch never has been geared towards realtime contexts. \n\nWhich is curious when that's really what games are all about. Realtime-generated content.",
                  "score": 1,
                  "created_utc": 1736951927.0,
                  "replies": []
                },
                {
                  "id": "m7a1lza",
                  "author": "diuturnal",
                  "body": "The 2000 series did use dlss to increase frame rate artificially. So nvidia has hinged their promise on fake frames since the 2000 series.",
                  "score": -2,
                  "created_utc": 1736952587.0,
                  "replies": [
                    {
                      "id": "m7a8zul",
                      "author": "timmytissue",
                      "body": "Dlss is not fake frames. It's added resolution through temporal information from previous frames using AI.",
                      "score": 2,
                      "created_utc": 1736954947.0,
                      "replies": []
                    },
                    {
                      "id": "m7a2nan",
                      "author": "Crintor",
                      "body": "Nvidia has hinged their promise on fake frames since day one. All frames are fake, all pixels are fake. Every corner that can reasonably be cut is cut.\n\nGod you guys are so annoying about this.",
                      "score": 2,
                      "created_utc": 1736952931.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7a1sa1",
      "author": "modix",
      "body": "Will these run into the same issues as smoothing does on TVs?  It rarely looks good.  Perhaps at high frame rates it'll be unnoticeable as it's just a filler.",
      "score": 12,
      "created_utc": 1736952645.0,
      "replies": [
        {
          "id": "m7a3qtu",
          "author": "overdev",
          "body": "its more than just the smoothing on TVs since they use Motion vectors and a properly Trained AI \n\nbut yeah Im Not a Fan of predicting frames with AI",
          "score": 7,
          "created_utc": 1736953286.0,
          "replies": [
            {
              "id": "m7acyd1",
              "author": "timmytissue",
              "body": "It's not predicting frames, it delays your real frame and adds an intermediate frame. That's why it increases latency.",
              "score": 6,
              "created_utc": 1736956145.0,
              "replies": [
                {
                  "id": "m7adyge",
                  "author": "overdev",
                  "body": "It predicts how the frame in between will look",
                  "score": 6,
                  "created_utc": 1736956445.0,
                  "replies": [
                    {
                      "id": "m7aebsd",
                      "author": "timmytissue",
                      "body": "Ok sure but it's predicting from the previous to next frame. It's adding an in between. It's \"predicting\" the path of pixels but it knows where they end up. Prediction just kind of implies you don't know what's coming. I can hardly predict Trump wins the elections right now.",
                      "score": 0,
                      "created_utc": 1736956556.0,
                      "replies": [
                        {
                          "id": "m7b3lxe",
                          "author": "AlwaysThinkAhea2",
                          "body": "Does it wait for the entire second frame to finish or just some details of the second frame?",
                          "score": 2,
                          "created_utc": 1736963933.0,
                          "replies": [
                            {
                              "id": "m7bozka",
                              "author": "SparroHawc",
                              "body": "The whole frame.  The AI doesn't understand partially rendered frames.",
                              "score": 3,
                              "created_utc": 1736970052.0,
                              "replies": [
                                {
                                  "id": "m7csnuh",
                                  "author": "V1pArzZz",
                                  "body": "So it uses frame 1 and 3 to interpolate 2? I assumed they would use 1 and 2 to extrapolate 3 while 4 was being rendered. In that way it would at least not add input lag",
                                  "score": 2,
                                  "created_utc": 1736981408.0,
                                  "replies": [
                                    {
                                      "id": "m7jdowf",
                                      "author": "SparroHawc",
                                      "body": "That's one of the major complaints about it - since it can't actually predict future frames, it by necessity introduces interface lag.\n\nAnd it can't predict future frames because it doesn't know anything about level geometry, so it can't draw (for example) what's around a corner that you're moving past until there's another frame that reveals it.",
                                      "score": 1,
                                      "created_utc": 1737069669.0,
                                      "replies": [
                                        {
                                          "id": "m7lc80r",
                                          "author": "V1pArzZz",
                                          "body": "Isnt the whole point of AI that it can predict what will be around the corner before going around it?",
                                          "score": 1,
                                          "created_utc": 1737097240.0,
                                          "replies": [
                                            {
                                              "id": "m7pgx06",
                                              "author": "SparroHawc",
                                              "body": "Nope.  The only thing the AI has to work off of is the previous frame and the current frame.  It gets some extra stuff from the renderer, like what direction the pixels are moving and what depth they're rendered at, but it knows jack-all about what's around the corner.  That's why you'll see people complaining about weird auras around objects.  As the objects move around, the AI doesn't know what's being revealed around it.",
                                              "score": 1,
                                              "created_utc": 1737152885.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m7knlhj",
                                      "author": "QuaternionsRoll",
                                      "body": "For additional reference, that would be called extrapolation, not interpolation.",
                                      "score": 1,
                                      "created_utc": 1737085659.0,
                                      "replies": [
                                        {
                                          "id": "m7lbyp7",
                                          "author": "V1pArzZz",
                                          "body": "Yeah that’s true",
                                          "score": 1,
                                          "created_utc": 1737097090.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m7bsbwg",
                              "author": "timmytissue",
                              "body": "It needs the whole frame before it can make the preceding frame.",
                              "score": 1,
                              "created_utc": 1736971003.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7aslaw",
          "author": "Wpgaard",
          "body": "You be the judge:\n\n[https://www.youtube.com/watch?v=2bteALBH2ew&](https://www.youtube.com/watch?v=2bteALBH2ew&)",
          "score": 2,
          "created_utc": 1736960770.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7gl5qm",
      "author": "nipple_salad_69",
      "body": "The boneheads can't seem to comprehend that we can't make transistors any smaller than they are now lol\n\nBe happy there are people smart enough to make software that can compensate for Moore's Law being dead.",
      "score": 3,
      "created_utc": 1737040218.0,
      "replies": []
    },
    {
      "id": "m7btavv",
      "author": "newaccount47",
      "body": "Over a year ago Jensen Huang already said that “Every single pixel will be generated soon. Not rendered: generated” \n\nSo based on that why is everyone Pikachu surprised? Developing better algorithms instead of brute force pathtracing is the only way to get pathtraced images at 200fps in 4k. \n\nComplaining about \"fake frames\" makes about as much sense as complaining about \"fake lighting\" or \"fake physics\". If you want realtime pathtraced fully interactive worlds you need to figure out a whole new way of doing things. I've worked as a 3D artist since 2004 and i've seen what it takes to get \"real\" frames. \n\nIt wasn't until 2006 that Pixar used widely used ray tracing in a movie (Cars) and it took 10 years later for them to use pathtracing (Finding Dory in 2016).  \n\nCars was rendered on a renderfarm with about 10–20 TFLOPs of compute. \n\nFinding Dory was rendered with about 1 PFLOP of compute. \n\nA direct CPU/GPU comparison isn't 1:1 comparable but just for reference:\n\nA single RTX 4090 can do \\~80+ TFLOPs in FP32. That's more compute than the entire Cars renderfarm. Ok, amazing. \n\nYou’d need on the order of **12–15** RTX 4090 GPUs to match the *peak FLOP count* of that entire CPU farm for Finding Dory in 2016. Also amazing - millions of dollars worth of supercomputer renderfarm compute now achievable with $25k. \n\nThis is ignoring that path-tracing code would have to be re-optimized for GPUs, ignoring CPU vs. GPU memory architectures, network overhead, etc. It’s just a rough FLOP-based ratio.\n\nThe compute power of top GPUs are INSANE, but they are still no where close to what is needed to render a full quality fully pathtraced scene in realtime, much less 200fps. Pixar's renders would take **10–17 hours** per frame on average for Cars and **30–50 hours** per frame for Finding Dory. \n\nWe're now asking for that level of quality in 200fps in 4k and complaining about the advanced AI algorithms that make it achievable. This is insanity.",
      "score": 5,
      "created_utc": 1736971281.0,
      "replies": [
        {
          "id": "m7gj27i",
          "author": "Lord-Legatus",
          "body": "Thank you so so much for this.\nI'm already a bit older and work in a software world, not a technical function, il in charge of public relations. \n\n\nI see with sad eyes what a looney witch hunt is happening in pc communes that everythung is bad, wicked znd evil voodoo that is not real. \n\n\nWhile the only truth and reality is we are propelling and pushing innovations in leaps forward people not even apppreciating. The possibilities becoming crazier znd crazier. \n\n\nIt speaks  volumes why your very well founded comment does not take the top spot. \nPeople prefer the echo  chamber just parroting whats the popular narrative. Its so sad. \n\n\nLet them cry, the world will evolve regardless of their sentiments. \n\n\nThank you for your very very well explanation. People shoukd read this znd learn in stead of following the herd like sheep",
          "score": 3,
          "created_utc": 1737039560.0,
          "replies": []
        },
        {
          "id": "m7frccv",
          "author": "corut",
          "body": "If we can't do full path tracing now, then why are moving to it when it has minimal improvement over rasterised?\n\nThe big sticking point isn't really the generated frames, it's that the frames aren't tied to the game logic in any way, and don't respond to input, making them pretty useless for games",
          "score": -1,
          "created_utc": 1737029056.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7d0vxx",
      "author": "Infinite_Somewhere96",
      "body": "The same people who said \"5080 will be as fast as a 4090\" are now the same people in here saying autistic things like \"computer images are fake, whats wrong with fake frames, lighting is fake too, just embrace artifacts and jank that the developers and artists never accounted for\"\n\nThey never stop being wrong. its amazing to see.",
      "score": 6,
      "created_utc": 1736984066.0,
      "replies": [
        {
          "id": "m7frl1n",
          "author": "Rage_Like_Nic_Cage",
          "body": "We just gotta start calling frame gen “motion smoothing” and reddit will immediately be against it.",
          "score": 3,
          "created_utc": 1737029173.0,
          "replies": [
            {
              "id": "m7igdl3",
              "author": "Infinite_Somewhere96",
              "body": "Amazing, let’s do it",
              "score": 1,
              "created_utc": 1737059735.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m79yl7e",
      "author": "Hooligans_",
      "body": "The entire PC gaming community is getting dumber. Fake frames? Is anti-aliasing \"fake edges\"? Is displacement \"fake polygons\"? Where is the uproar about v-sync? Are we not upset about those frames?",
      "score": 29,
      "created_utc": 1736951560.0,
      "replies": [
        {
          "id": "m7ancw5",
          "author": "Dennma",
          "body": "Because for most users that aren't in a specialized subreddit for PC building, v-sync is still a very useful and easy solution that does deliver on what it says it will. The vast majority of people playing aren't going to be as focused on minute input delays because it's way less distracting than screen tearing.",
          "score": 10,
          "created_utc": 1736959248.0,
          "replies": []
        },
        {
          "id": "m79zp6j",
          "author": "powerhcm8",
          "body": "And if you follow the same logic, raster rendering uses \"fake light\" as opposed to path-tracing.",
          "score": 32,
          "created_utc": 1736951943.0,
          "replies": [
            {
              "id": "m7a1dr4",
              "author": "sylfy",
              "body": "I guess we should be angry about occlusion culling now too.",
              "score": 14,
              "created_utc": 1736952512.0,
              "replies": [
                {
                  "id": "m7a4x0h",
                  "author": "powerhcm8",
                  "body": "I am going to call that \"fake lack of object permanence\"",
                  "score": 4,
                  "created_utc": 1736953671.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7bzxm2",
              "author": "zach0011",
              "body": "Most modern tesselation also used \"fake triangles\" by this logic",
              "score": 1,
              "created_utc": 1736973175.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a8ywo",
          "author": "beleidigtewurst",
          "body": "You not getting what is fake about them does not make them \"just more frames\", I'm afraid.\n\nAlso, check [this](https://store.steampowered.com/news/app/993090/view/4145080305033108761) out, a faux fraem injector right from Steam.",
          "score": 6,
          "created_utc": 1736954938.0,
          "replies": [
            {
              "id": "m7a98u0",
              "author": "Hooligans_",
              "body": "I know that it interpolates the frames.",
              "score": 1,
              "created_utc": 1736955024.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a19gk",
          "author": "TehOwn",
          "body": ">Where is the uproar about v-sync? Are we not upset about those frames?\n\nWhat on earth are you talking about? All v-sync does is delay rendering to match up with the monitor's refresh rate.",
          "score": 13,
          "created_utc": 1736952472.0,
          "replies": [
            {
              "id": "m7a317x",
              "author": "Hooligans_",
              "body": "Why should my frames have to wait?  I want the frames when they're ready, not when AI decides it's time for me to see the frame.",
              "score": -15,
              "created_utc": 1736953055.0,
              "replies": [
                {
                  "id": "m7a4p4n",
                  "author": "TehOwn",
                  "body": "V-sync and AI have literally nothing to do with each other. The frames wait so that the monitor doesn't draw a fraction of a frame and end up with tearing. It only sends frame data when the monitor is ready for it.",
                  "score": 11,
                  "created_utc": 1736953601.0,
                  "replies": [
                    {
                      "id": "m7a54sy",
                      "author": "Hooligans_",
                      "body": "How do the frames know when to wait and send? Is there a human deciding every single frame? Or is it a computer program? An artificial intelligence, you might say?",
                      "score": -11,
                      "created_utc": 1736953741.0,
                      "replies": [
                        {
                          "id": "m7a6ei2",
                          "author": "TehOwn",
                          "body": "You think all computer code is AI? Damn, bro. \n\nI don't blame you because it's been pushed so hard that it has lost all meaning but by your logic, we had AI back in 1945.\n\nThe GPU knows when the monitor is ready in the same way that you know when your toast is ready. The toaster pops up the toast, alerting you to the fact that it has finished toasting your bread. The monitor sends an electrical signal to your GPU when it finishes displaying a frame (it's a little more complicated than that but that's the jist). It doesn't decide when to do it or how to do it any more than your toaster does.",
                          "score": 12,
                          "created_utc": 1736954143.0,
                          "replies": [
                            {
                              "id": "m7a6zf2",
                              "author": "Hooligans_",
                              "body": "A toaster popping when the temperature reaches a certain point is not the same as computer code running.",
                              "score": -6,
                              "created_utc": 1736954323.0,
                              "replies": [
                                {
                                  "id": "m7ai8ai",
                                  "author": "timmytissue",
                                  "body": "What's the line you are drawing? Do you know what a Turing machine is?",
                                  "score": 5,
                                  "created_utc": 1736957736.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7a6k3k",
                          "author": "404_GravitasNotFound",
                          "body": "Ok, the problem is not that OTHER people are getting dumber... Basic algorythms are not \"AI\"...",
                          "score": 8,
                          "created_utc": 1736954191.0,
                          "replies": [
                            {
                              "id": "m7a743g",
                              "author": "Hooligans_",
                              "body": "What's the difference then?",
                              "score": -1,
                              "created_utc": 1736954364.0,
                              "replies": [
                                {
                                  "id": "m7ah5rm",
                                  "author": "afurtivesquirrel",
                                  "body": "At a really basic level, the difference is that simple code does exactly what it's supposed to, every time. It has an entirely predictable output that has been decided by a human and will do it every time, given the same inputs. \n\nAI is a nebulous term, but the key difference is that the computer is \"taught\" with examples, and \"trained\" by giving feedback on how close it got to the desired output, but the intermediate steps from input to output are a mystery that has been entirely designed by the computer - no one has intentionally created or coded for them. \n\nTo use an analogy, Imagine me giving you incredibly detailed instructions on how to cook a pavlova. Right down to how many strawberries you should place on top. This would be normal computer code, like vsync. It doesn't matter if the pavlova is super super fancy and complicated. It also doesn't matter if there's some \"unpredictability\" in there, like telling you to \"use between 10 and 14 strawberries\". The key is that every stage of the instructions was intentionally written by a human. \n\n\"AI\" is like me telling you to \"make a pavlova\" with no additional context. *Maybe* I give you some photos of a finished pavlova, or even let you taste some, but that's it. The only feedback you get is by attempting to make one and me saying \"better\" or \"worse\". \n\nEventually, given enough tries, you might reach a point where you can make a tasty pavlova 9 times out of 10. Great! Mission accomplished!\n\nBut the difference is that I have no idea *how* you made the pavlova, or what steps you took to get there. I'll also never entirely know whether it's gonna come with kiwis or strawberries. Occasionally you might deliver it with tomatoes, or even with no fruit at all. Or on a dustbin lid. No one said you couldn't!\n\nMaybe you experimented with using a vat of liquid nitrogen to keep it cool, rather than a fridge, and it seemed to work. Maybe you use a barbecue to toast the merangue. Maybe all your fruit is sourced from the leftovers of the fancy restaurant next door. I'll never know! As long as it tastes like a pavlova when it gets to me, I don't care. Whatever works I guess.\n\nAnd when I think about it, I also actually have no idea even what you think \"a pavlova\" is. Do you think it's a generic name for any dessert including meringue and fruit? Your Pavlovas are super tasty, but they're also always square. Is that just because you find them easier, or because somewhere along the road I gave great feedback to an attempt that just happened to be square, and you got in your head that square was a requirement? Do you think they *have* to be served on a plate? Or that they have to be whole? If I showed you a photo of a pavlova after it had been dropped on the floor and smashed up, would you still know it was a pavlova?\n\nDoes that help at all?\n\nEdit:\n\n(A, perhaps apocryphal, example of never knowing *how* an AI reaches a conclusion is the story of NATO teaching an AI to differentiate between Russian and NATO artillery. The expected outcome was that the AI learn would recognise the difference in shapes from the air, and very quickly tag satellite photos with any examples of probable Russian artillery movements. The AI reached near-perfect identification accuracy in tests, but failed miserably when deployed on the battlefield. No one could work out why identification was failing so often, when seemingly nothing had changed with the quality of input photographs.\n\nEventually, someone realised that the difference was that the AI's training data was almost exclusively on photos of artillery in fixed, defensive, positions, whereas its real data often included equipment on the move. The AI had sifted through all the training data and skipped the part where it learned the different shapes, and found a foolproof shortcut instead: \"Russian artillery has its guns pointed west\".)",
                                  "score": 5,
                                  "created_utc": 1736957413.0,
                                  "replies": []
                                },
                                {
                                  "id": "m7aiosq",
                                  "author": "timmytissue",
                                  "body": "AI is training using specific methods that create a kind of neural network which is a bit of a black box. Meaning you can't easily just look into the code and figure out why it's doing one thing or another. Not all code is the same. A video editing program isn't the same as a video game. AI is a type of software and it's not the same as an algorithm.",
                                  "score": 2,
                                  "created_utc": 1736957873.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7d93to",
                  "author": "Fidodo",
                  "body": "You clearly have zero clue what you're talking about",
                  "score": 4,
                  "created_utc": 1736986834.0,
                  "replies": [
                    {
                      "id": "m7dcw4s",
                      "author": "Hooligans_",
                      "body": "Well it was a joke, so I hope you're not taking it too seriously.",
                      "score": 0,
                      "created_utc": 1736988101.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m7ahykm",
                  "author": "timmytissue",
                  "body": "Well you can't see a frame before your monitor is ready to render it anyway. V-sync stops tearing on monitors which can't adjust their refresh rate. You can always turn v-sync off and experience the most up to date info, that just will include screen tearing.",
                  "score": 2,
                  "created_utc": 1736957655.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m79z2fg",
          "author": "CharlieandtheRed",
          "body": "Some guy made a viral video a month ago about fake frames and now everyone is dropping their knowledge lol",
          "score": 14,
          "created_utc": 1736951727.0,
          "replies": [
            {
              "id": "m7a7sjv",
              "author": "LeCrushinator",
              "body": "As a game programmer I learned pretty quickly to ignore most of what the community says when it comes to technical things. I remember early in my career (around 15 years ago) trying to discuss, on a game enthusiast forum, how ray tracing was going to eventually replace rasterization for everything, but before that it would start to replace lighting and shadows. Nobody believed it even though I considered it fairly obvious. It was a wake up call how little most of the community actually knows about the technical details.\n\nAlso, most of the journalists that cover game tech aren't going to be much better.",
              "score": 20,
              "created_utc": 1736954575.0,
              "replies": [
                {
                  "id": "m7kkbwr",
                  "author": "zxyzyxz",
                  "body": "Gell-Mann Amnesia",
                  "score": 3,
                  "created_utc": 1737084433.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7ape5f",
          "author": "hotmilfenjoyer",
          "body": "lol yeah your GPU smoothing some pixels is the same as your GPU creating an entirely new image based on the last one it saw",
          "score": 4,
          "created_utc": 1736959837.0,
          "replies": [
            {
              "id": "m7awldp",
              "author": "Hooligans_",
              "body": "Correct.",
              "score": 1,
              "created_utc": 1736961940.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a0ewg",
          "author": "cactus22minus1",
          "body": "Someone made a meme the other day comparing tesselation to fake geometry, which is a pretty fair comparison. Yes, people are getting dumber- I worry about it a lot. Like, it’s not that we shouldn’t question new tech, but… fake frames? Real time graphics is all about squeezing out performance optimizations, always has been. It’s crazy that people are complaining about getting a shit ton of extra frames especially when you consider Nvidia paired it with new tech that mitigates the downside  (reflex 2 for reduced latency).",
          "score": 8,
          "created_utc": 1736952186.0,
          "replies": [
            {
              "id": "m7fpr57",
              "author": "anunknownmortal",
              "body": "People wouldn’t be complaining if triple AAA studios OPTIMIZED their damn games. But almost every release has terrible performance and looks awful unless you buy the top of the line / around the corner hardware release.",
              "score": 2,
              "created_utc": 1737028265.0,
              "replies": []
            },
            {
              "id": "m7a9077",
              "author": "smurficus103",
              "body": "Eh the extra frames look like dogshit when youre using mouse sens 1.8 inches per 360, id just as soon never buy nvidia",
              "score": -5,
              "created_utc": 1736954950.0,
              "replies": [
                {
                  "id": "m7afq72",
                  "author": "revolvingpresoak9640",
                  "body": "Good for you.",
                  "score": 1,
                  "created_utc": 1736956977.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7a0ytn",
          "author": "LiamTheHuman",
          "body": "It's seen as fake frames because they are not calculated the same way. As an extreme example, if I write a program to insert pure blue screens as 3 of 4 frames, I haven't really increased the processed framerate 4x. Ai generated frames exists somewhere between that and actually calculating the frames using the game engine. At some point the frames stop being 'fake' as the ai get's closer and I agree it's a misnomer even now since ai generated frames are pretty good, but they are of lower quality than normally rendered frames so it still doesn't make sense to consider pure framerate the same way.",
          "score": 10,
          "created_utc": 1736952372.0,
          "replies": [
            {
              "id": "m7a9ift",
              "author": "ohanse",
              "body": "I guess the real question is:\n\n* Will this affect my aim/tracking? How?\n* Will this affect any cinematic gameplay experiences? How?",
              "score": 6,
              "created_utc": 1736955105.0,
              "replies": [
                {
                  "id": "m7aizzx",
                  "author": "timmytissue",
                  "body": "It can only negatively impact your aim, because it's delaying when you see the most updated info from your mouse movement. Cinematic experience is up for debate.",
                  "score": 13,
                  "created_utc": 1736957965.0,
                  "replies": [
                    {
                      "id": "m7ajhyp",
                      "author": "ohanse",
                      "body": "Would it be worse than dropped frames?",
                      "score": 2,
                      "created_utc": 1736958113.0,
                      "replies": [
                        {
                          "id": "m7amgqw",
                          "author": "timmytissue",
                          "body": "Well if you have 50fps and you are doing 1 generated frame per real frame, you will get 100fps, but all of them will be delayed by 1/100 of a second. \n\nIf you instead are doing multi frame generation and 3 generated frames then per real frame. You would get 200fps and each frame would be delayed by 3/200 of a second. \n\nSo that's basically 1/66th of a second of added latency",
                          "score": 5,
                          "created_utc": 1736958985.0,
                          "replies": [
                            {
                              "id": "m7ax87h",
                              "author": "ohanse",
                              "body": "Which seems like an acceptable tradeoff if the alternative is stuttering",
                              "score": 4,
                              "created_utc": 1736962121.0,
                              "replies": [
                                {
                                  "id": "m7axnab",
                                  "author": "timmytissue",
                                  "body": "Any stuttering would also be preserved. It doesn't impact performance.",
                                  "score": 6,
                                  "created_utc": 1736962241.0,
                                  "replies": [
                                    {
                                      "id": "m7b0ru1",
                                      "author": "ohanse",
                                      "body": "I'm confused af now what is the purpose of this frame interpolation if it's not to smooth out framerates?\n\nAnd then the reading I've done says it's not actually rendering fake frames at all - it's basically AI upscaling a low-res frame. So there'd be no jitter or even framerate increases (outside of the ones you get from initially rendering at a low resolution).\n\nAKA it's not inserting pure blue screens. It's taking pixelated rendered frames and scaling them up.",
                                      "score": 1,
                                      "created_utc": 1736963134.0,
                                      "replies": [
                                        {
                                          "id": "m7b1o59",
                                          "author": "timmytissue",
                                          "body": "It creates smoothness but if you are dropping frames that would still happen because it doesn't make anything lighter on your GPU or cpu.\n\nThe rest of what you wrote looks like it's talking about dlss not frame gen.",
                                          "score": 5,
                                          "created_utc": 1736963388.0,
                                          "replies": [
                                            {
                                              "id": "m7b52ik",
                                              "author": "ohanse",
                                              "body": "Ohhh they’re different",
                                              "score": 1,
                                              "created_utc": 1736964357.0,
                                              "replies": [
                                                {
                                                  "id": "m7brz4c",
                                                  "author": "timmytissue",
                                                  "body": "Yeah the marketing is confusing. They are seperate technologies but frame gen is called dlss3. They are completely unrelated though it's just a marketing thing.\n\nThe thing people mean by dlss is dlss 1 and 2, which can be combined with frame gen (dlss3) which does in fact make you run games faster by running them at lower resolutions and upscaling them through temporal AI technology.",
                                                  "score": 1,
                                                  "created_utc": 1736970902.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7atfbh",
                  "author": "ThePretzul",
                  "body": "It can affect your aim if 3/4 of the displayed frames are AI guesses of where things - including your reticle - will be located in that frame. \n\nIt can also affect your aim because what you see on screen is not necessarily what the game says is happening. If there’s 3 frames generated for each 1 frame rendered it means you could be moving your aim in the wrong way to aim at a small target that changed direction before the stutters back into the correct location on your screen at the next rendered frame.",
                  "score": 2,
                  "created_utc": 1736961019.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7ajttx",
              "author": "ChaseballBat",
              "body": "It doesn't really matter. The 5070 will be able to get pretty much any frame rate you want, you'll just have to adjust the graphic quality. \n\nIf someone doesn't want to sacrifice quality they can use the DLSS, simple. It isn't a feature turned on natively (as far as I am aware).\n\nIf you're running a 5080 chances are you wouldn't even get to the point where you can get more native frames than what your screen can portray. And if you have a 200+ htz monitor you're in the .01% of gamers what will also want the cutting edge GPU which a 5090 will definitely get you enough native frames.\n\nThe only people this feature is really for are \"budget computers\" or in a decade when the baseline has shifted above what a 5080 can handle anymore.",
              "score": -1,
              "created_utc": 1736958212.0,
              "replies": [
                {
                  "id": "m7at5dn",
                  "author": "LiamTheHuman",
                  "body": "5090 is supposed to be up to 30% more powerful than a 4090. I can't hit top level frame rates (\\~144) on max settings in a decent amount of games or even 30% lower. For instance cyberpunk can only get close to 60 without DLSS. So it's absolutely relevant and as newer games come out could be even more relevant.",
                  "score": 1,
                  "created_utc": 1736960937.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7a10ni",
          "author": "ErsatzNihilist",
          "body": "Those things can look bad. Frame generation feels bad to play with. It’s a completely different kettle of fish.",
          "score": 8,
          "created_utc": 1736952390.0,
          "replies": [
            {
              "id": "m7a4ih2",
              "author": "TheGoldenKraken",
              "body": "Yea I saw plenty of weird bugs and artifacts playing Indiana Jones with regular frame gen. Don't know how 3 times the frame gen is gonna hold up.",
              "score": 0,
              "created_utc": 1736953541.0,
              "replies": [
                {
                  "id": "m7a85xj",
                  "author": "ErsatzNihilist",
                  "body": "It's not even the artefacts that pop up - honestly, I'm not even that sensitive to that sort of thing and forgive it easily; it's just the injection of *lag* which just feels intolerable. If I've got a choice between 60fps and no framegen and 120+fps *with* framegen, I'll go for the former every single time.\n\nI dunno. Maybe Nvidia have made it work and it'll be great and there will be no lag at all - but won't believe it until I play it. I just don't see how 3x AI frames for every 1x frame generated by the engine (which is the thing that reads what your inputs are) is even going to be enjoyable to play.",
                  "score": 4,
                  "created_utc": 1736954690.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7a2vea",
          "author": "2roK",
          "body": "What about vsync? Lmao\n\nNothing you named is comparable to frame gen.",
          "score": 3,
          "created_utc": 1736953002.0,
          "replies": [
            {
              "id": "m7avgai",
              "author": "Wpgaard",
              "body": "Well, frame gen works by holding back frames, just as Vsync. So the latency part is kinda compareable.",
              "score": -1,
              "created_utc": 1736961611.0,
              "replies": []
            },
            {
              "id": "m7a3jmu",
              "author": "Hooligans_",
              "body": "AI deciding when it shows me the next frame? That's not cause for a riot?",
              "score": -7,
              "created_utc": 1736953222.0,
              "replies": [
                {
                  "id": "m7aao0a",
                  "author": "timmytissue",
                  "body": "That's not what you think vsynch is is it?",
                  "score": 4,
                  "created_utc": 1736955458.0,
                  "replies": []
                },
                {
                  "id": "m7ac892",
                  "author": "ohanse",
                  "body": "Are you sure that’s what is happening?\n\nBecause my understanding is that AI wouldn’t drop a real frame, they’d replace a dropped frame with a fake one. So it’s not real vs. fake, it’s dropped vs. fake.",
                  "score": 3,
                  "created_utc": 1736955930.0,
                  "replies": []
                },
                {
                  "id": "m7aakij",
                  "author": "squidgy617",
                  "body": "Deciding when to show you the next frame is not the same as guessing what the next frame should look like ",
                  "score": 2,
                  "created_utc": 1736955429.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7aaig2",
          "author": "Borghal",
          "body": "I am not in a uproar about it, but it is true that they are \"fake\" in at least one sense - frames generated in such a way do not respond to player input.\n\nE.g. If you press a button on time after frame 64, and the next three frames are generated, then the first time your input is taken into account on screen will be frame 68. So you might be playing at 240 fps, but the controls will feel like playing 60 fps.\n\nIt's not an issue with a high enough framerate, but it does illustrate how it makes sense to call them \"fake\" in a sense.",
          "score": 2,
          "created_utc": 1736955412.0,
          "replies": [
            {
              "id": "m7dbl8u",
              "author": "Fidodo",
              "body": "It would be technically possibly for it to be based on player input if the AI model used partial information to inform it on how the next frame will be structured. The game needs to know where things will be positioned before they're rendered. That's a pre-requisite to rendering of course. So it would be possible for the game to prepare a representation of the next frames movement in a cheap way for the AI to have more information on what to generate. This could be movement vectors or a partially rendered frame for example.\n\n\nThe devil is all in the details though, and I can't make heads or tails of the marketing techno babble bullshit that Nvidia puts out and the tech illiterate tech writers of these magazines don't provide any insight into the implementation details either.",
              "score": 1,
              "created_utc": 1736987666.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7ar5ju",
          "author": "elheber",
          "body": "It'd be more accurate to call them \"synthetic\" frames. They're interpolated frames, not unlike the oft maligned *frame smoothing* feature that some TVs come with, except significantly more advanced. However advanced, they're still interpolated frames. If you don't like frame smoothing, you probably won't like frame generation.",
          "score": 2,
          "created_utc": 1736960347.0,
          "replies": []
        },
        {
          "id": "m7a41km",
          "author": "arguing_with_trauma",
          "body": "It is a frame not directly resolved from the games resources, it is fake in some legitimate sense. Yes people are dumb as well, but two things can be. Because of that, there are aberrations. Seems a bit extra to start contemplating the notion of frames, pixels and photons edges and polygons and whatnot",
          "score": 1,
          "created_utc": 1736953385.0,
          "replies": []
        },
        {
          "id": "m7bbhqp",
          "author": "DYMAXIONman",
          "body": "It is fake frames though and unless the framerate is already very hard you will notice visual issues",
          "score": 1,
          "created_utc": 1736966195.0,
          "replies": []
        },
        {
          "id": "m7btet0",
          "author": "YeOldeSandwichShoppe",
          "body": "This is explained elsewhere in this very thread. Frame gen IS different from traditional rendering because it is, in effect, a visual smoothing effect that isn't a 1 to 1 match to the underlying simulation. This can become a problem when the underlying latency is noticeably different from the visuals generated. Also graphical fidelity is affected in certain situations. If you don't care about these things thats fine, frame gen still has drawbacks and can be considered differently than traditional rendering.\n\nUpscaling too, can cause visual artifacts, and when used in marketing and benchmark shenanigans obfuscates relative performance of products.\n\nOf course this isn't black and white. Your example of AA is indeed a sort of post-processing that is applied to some reference image, if you will... but as a feature it is much more transparent. AA isn't used to imply that you can run a game at X fps while in fact parts of the game run much slower. It has a direct performance cost and a visual effect, so you more or less know what youre getting.\n\nVsync absolutely has problems and many avoid using it. In certain scenarios (like in situations where the hardware is generating frames just under the vsync rate) it introduces stuttering.\n\nMaybe the hyperbolic language (\"fake\") is a bit much, but it points to a real phenomenon. Not sure who the dumb one is for not being sensitive to this.",
          "score": 1,
          "created_utc": 1736971313.0,
          "replies": []
        },
        {
          "id": "m7d8usw",
          "author": "Fidodo",
          "body": "There's been many poor quality attempts at frame interpolation in the past, so it's natural to be wary. It's dumb to discount it entirely, but it's not dumb to request proof. Seems like a pretty easy thing to verify though. Just show examples of lossless screenshots of a AI generated frames side by side with what they would have looked like rendered so we can judge the accuracy ourselves.",
          "score": 1,
          "created_utc": 1736986749.0,
          "replies": []
        },
        {
          "id": "m7fbqnk",
          "author": "Curse3242",
          "body": "The problem is there's no MSAA of framg gen yet. Anti Aliasing is faking edges, but FXAA looks really really bad. That's with with 'fake frames', the experience gets worse even if it's a 1440p image at 240fps. It doesn't look or feel that good",
          "score": 1,
          "created_utc": 1737019920.0,
          "replies": []
        },
        {
          "id": "m7a9qsr",
          "author": "vmsrii",
          "body": "That’s a stupid comparison to make. None of those things directly remove the player’s ability to affect the game state, or alternatively, directly lie about how quickly internal computations based on said player’s affect on the game state. \n\nFrame gen does.",
          "score": 1,
          "created_utc": 1736955176.0,
          "replies": []
        },
        {
          "id": "m7a9gg4",
          "author": "timmytissue",
          "body": "I think you are missing the point. The frames are fake in the sense that they don't represent an update to the game state. They delay the frame with the most updated game state (eg, mouse movement) to add an intermediate frame. That intermediate frame has some of that most updated info because it's a half step towards it, but it still adds latency instead of improving it. This is not similar to anything else and I think it makes total sense to call the frames fake.",
          "score": 1,
          "created_utc": 1736955089.0,
          "replies": []
        },
        {
          "id": "m7ecqsf",
          "author": "Kriztauf",
          "body": "V-sync is woke",
          "score": 0,
          "created_utc": 1737000893.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a5y88",
      "author": "Nochnoii",
      "body": "Those “fake” frames will induce a lot more input lag I’m afraid, since they don’t respond to mnk/controller inputs.",
      "score": 6,
      "created_utc": 1736954000.0,
      "replies": []
    },
    {
      "id": "m7a02tm",
      "author": "randomIndividual21",
      "body": "They artificially limited 4x frame gen to 50 seires just so they can misrepresent 50 series",
      "score": 11,
      "created_utc": 1736952072.0,
      "replies": [
        {
          "id": "m7a31qh",
          "author": "TehOwn",
          "body": "If it works, it works. My main concern is artifacting.",
          "score": 2,
          "created_utc": 1736953059.0,
          "replies": [
            {
              "id": "m7bbpcg",
              "author": "DYMAXIONman",
              "body": "That is already an issue with single frame generation and this won't be any better.",
              "score": 4,
              "created_utc": 1736966256.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7a12mi",
      "author": "Boggie135",
      "body": "What does “fake frames” mean exactly?",
      "score": 2,
      "created_utc": 1736952408.0,
      "replies": [
        {
          "id": "m7a5pes",
          "author": "Nochnoii",
          "body": "These frames are generated to fill in the gaps and don’t respond to any input. This will generate more input lag, especially when multiple “fake” frames are generated in between real ones.",
          "score": 8,
          "created_utc": 1736953924.0,
          "replies": [
            {
              "id": "m7a8pej",
              "author": "Boggie135",
              "body": "Thank you",
              "score": 1,
              "created_utc": 1736954858.0,
              "replies": []
            },
            {
              "id": "m7ko21p",
              "author": "QuaternionsRoll",
              "body": "Not “especially”; the average input lag is the same no matter how many fake frames are generated. But yeah, frame generation inherently requires a 1 true/rendered frame delay.",
              "score": 1,
              "created_utc": 1737085835.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7act0l",
          "author": "timmytissue",
          "body": "It means the frames delay your real frame to insert an intermediate one. It adds some latency for smoothness of motion.",
          "score": 4,
          "created_utc": 1736956100.0,
          "replies": []
        },
        {
          "id": "m7a1agz",
          "author": "BrewKazma",
          "body": "AI generated.",
          "score": 1,
          "created_utc": 1736952481.0,
          "replies": []
        },
        {
          "id": "m7bbtc4",
          "author": "DYMAXIONman",
          "body": "frame generation",
          "score": 1,
          "created_utc": 1736966287.0,
          "replies": []
        },
        {
          "id": "m7abzzj",
          "author": "beleidigtewurst",
          "body": "Frames generated by interpolating between existing frames.\n\nTVs can do it (this TV is new, but they could do it 15 years earlier too):\n\nhttps://www.youtube.com/watch?v=tDgstPM2j1U\n\n\nCheapo Steam apps can do it:\n\nhttps://store.steampowered.com/news/app/993090/view/4145080305033108761\n\n\n\nBut what makes them \"fake\" you may wonder.\nWell, think what happens when you move  your mouse. Where are the \"fake\" frames and how do they \"improve\" your experience.",
          "score": 1,
          "created_utc": 1736955861.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7bajpx",
      "author": "DYMAXIONman",
      "body": "We already have \"fake frames\" and they're shit. Framegen is ONLY useful when you have a high framerate and have a CPU bottleneck (which is rare unless you have a 4090 and play at 1080p). \n\n  \nThe DLSS upscaling improvements are more exciting, but those improvements are coming to every RTX card that exists currently.",
      "score": 2,
      "created_utc": 1736965925.0,
      "replies": [
        {
          "id": "m7be80w",
          "author": "paulerxx",
          "body": "I agree, far more interested in the modelers + DLSS 4 upscaling.",
          "score": 2,
          "created_utc": 1736966969.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7d6g4n",
      "author": "Camderman106",
      "body": "The problem with frame gen is that none of these fake frames can give the player any new information that wasn’t already present in the last real frame. It may be “smooth” but that doesn’t make it “fast”",
      "score": 3,
      "created_utc": 1736985937.0,
      "replies": []
    },
    {
      "id": "m79xny5",
      "author": "drneeley",
      "body": "It all depends on how the final product looks. Does 1 of 2 or 1 of 4 real frames look and feel better to play than the native 1 frame alone? \n\nI can think of several games off the top of my head where upscaling in DLSS looks better than playing at native resolution.  Maybe the same can be true of more frames.\n\nPersonally, I'd prefer if studios just made graphical fidelity at a 2015 level and spend their studio's money on gameplay and content instead of graphics.",
      "score": 9,
      "created_utc": 1736951241.0,
      "replies": [
        {
          "id": "m79yb4a",
          "author": "Alienfreak",
          "body": "DLSS currently, even in their 4.0 promo videos, introduces graphical artifacts. Can I ask how you come to the conclusion that DLSS can make a picture look better?",
          "score": 6,
          "created_utc": 1736951462.0,
          "replies": [
            {
              "id": "m79z4cl",
              "author": "doctortrento",
              "body": "In some cases, DLSS running at a resolution a little below native can actually do a better job of anti-aliasing than native resolution + TAA, which can look muddy",
              "score": 21,
              "created_utc": 1736951745.0,
              "replies": [
                {
                  "id": "m7a26cf",
                  "author": "jupatoh",
                  "body": "This is how I feel about hunt showdown. The game looks far better with dlss than I can natively run it",
                  "score": 5,
                  "created_utc": 1736952776.0,
                  "replies": []
                },
                {
                  "id": "m7aaqsf",
                  "author": "beleidigtewurst",
                  "body": "\"in some cases\" is the key here.",
                  "score": 1,
                  "created_utc": 1736955481.0,
                  "replies": []
                },
                {
                  "id": "m7a0cje",
                  "author": "Alienfreak",
                  "body": "Can you show any picture of this happening? DLSS creates foggy pictures, especially with distant objects.",
                  "score": 0,
                  "created_utc": 1736952163.0,
                  "replies": [
                    {
                      "id": "m7a5gn8",
                      "author": "drmirage809",
                      "body": "Go look up Digital Foundry's PC breakdown of God of War 2018. That's using DLSS 2 and DLSS at the quality preset somehow ends up looking cleaner than native 4k with TAA.",
                      "score": 13,
                      "created_utc": 1736953846.0,
                      "replies": []
                    },
                    {
                      "id": "m7abto4",
                      "author": "timmytissue",
                      "body": "This isn't true. AI upscaling can look better than native after a few still frames. This is because it's using temporal info to give you more resolution. \n\nIt works kind of like how my camera can give me a 24mp images or if I put it on a tripod it can use the image stabilizing moter which moves the sensor to give me a 96mp image by slightly moving the sensor around and take a few pictures to essentially make those pixels be in more than one place at once and then merge the image. \n\nBy giving it info from multiple frames it can have more info than a higher res single frame could contain.",
                      "score": 4,
                      "created_utc": 1736955807.0,
                      "replies": []
                    },
                    {
                      "id": "m7a6sry",
                      "author": "404_GravitasNotFound",
                      "body": "And the \"Oasis\" effect you get on any moving object, that area similar to heat diffraction that everything has around it nowadays...",
                      "score": 1,
                      "created_utc": 1736954266.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7a01jj",
              "author": "Derendila",
              "body": "i mean in my experience DLSS has let me play 2K games on my monitor that look better (even with all the artifacts) than native 1080p, or use medium/high settings without compromising frame rate and making it unplayable",
              "score": 3,
              "created_utc": 1736952060.0,
              "replies": []
            },
            {
              "id": "m7a0q6f",
              "author": "cactus22minus1",
              "body": "It acts as a form of anti aliasing, and I agree, sometimes it actually looks better.",
              "score": 3,
              "created_utc": 1736952292.0,
              "replies": []
            },
            {
              "id": "m7aiotr",
              "author": "drneeley",
              "body": "Anti-aliasing with DLSS/DLAA, even on lower res than native does a better job than other AA techniques. \n\nOff the top of my head, currently playing Diablo 2 Resurrected and DLSS at quality looks better than no DLSS and SMAA on.",
              "score": 3,
              "created_utc": 1736957873.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7dcirn",
          "author": "Fidodo",
          "body": "It would be very easy to demonstrate. Just screenshot the generated frames and do a side by side comparison with the real frames that would have been rendered instead. If they're accurate that would put all this speculation to bed. So it makes me wonder why clear side by side comparisons haven't been shown to us.",
          "score": 1,
          "created_utc": 1736987977.0,
          "replies": [
            {
              "id": "m7encde",
              "author": "drneeley",
              "body": "For sure a single frame is going to look better native than the AI frames. Without question. The main thing that matters though is how it looks to our eyes while in motion.",
              "score": 1,
              "created_utc": 1737005625.0,
              "replies": [
                {
                  "id": "m7ew2ua",
                  "author": "Fidodo",
                  "body": "I actually think the AI frames would end up looking really good. My bigger concern is drift from where it should be in various scenarios.",
                  "score": 1,
                  "created_utc": 1737010242.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7fbx3f",
          "author": "Curse3242",
          "body": "I absolutely hate the new trend RTX brought on. Ray Tracing, Upscaling, Path Tracing \n\nMan baked in effects looked fantastic. The companies are just creating a problem that didn't exist to sell more stuff.",
          "score": 1,
          "created_utc": 1737020039.0,
          "replies": []
        },
        {
          "id": "m7aewih",
          "author": "dargonmike1",
          "body": "In what fantasy world does DLSS *improve* the graphics of the game. Makes absolutely no sense. DLSS degrades the quality for more fps no matter what",
          "score": -3,
          "created_utc": 1736956728.0,
          "replies": [
            {
              "id": "m7ctcxc",
              "author": "V1pArzZz",
              "body": "Same way as SSAA, upscaling anti aliasing is nice. I would guess 1080->4k DLSS -> 1080 could look better then 1080 native + regularAA.",
              "score": 2,
              "created_utc": 1736981626.0,
              "replies": []
            },
            {
              "id": "m7bbo5c",
              "author": "ThisFreakinGuyHere",
              "body": "They think the blurriness hides flaws like aliasing. They're kidding themselves. I can almost see it for that one argument, but there are other ways it'll look overall worse. The parlor trick just works on them so well that they think it's actually better. Let them delude themselves. Who cares.",
              "score": 2,
              "created_utc": 1736966246.0,
              "replies": []
            },
            {
              "id": "m7aiwps",
              "author": "drneeley",
              "body": "Do you talk to people in person this way? Someone else asked the same question, but like a normal person. I answered them.",
              "score": 0,
              "created_utc": 1736957939.0,
              "replies": [
                {
                  "id": "m7ayhdq",
                  "author": "Alienfreak",
                  "body": "He is is completely right. Using an AI on what an engine rendered will always degrade the picture. Maybe using TAA some other technique will degrade it, too.",
                  "score": 2,
                  "created_utc": 1736962484.0,
                  "replies": [
                    {
                      "id": "m7bvsq3",
                      "author": "drneeley",
                      "body": "In my experience since DLSS 2, the AI upscaling does a better job with aliasing and fewer annoying artifacts than TAA. Like everyone else I would prefer native rendering of course. DLSS is definitely better than TAA or even SMAA if forced to choose between the two.",
                      "score": 0,
                      "created_utc": 1736972005.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7a2bcj",
      "author": "karatekid430",
      "body": "\"We can't make something fast without using 600W so let's make it 600W and cut some corners anyway to hide the disappointment\"",
      "score": 4,
      "created_utc": 1736952822.0,
      "replies": []
    },
    {
      "id": "m7a3fyl",
      "author": "overdev",
      "body": "Its so sad that newer and even the most powerful cards need to rely on upscaling and frame Generation",
      "score": 3,
      "created_utc": 1736953189.0,
      "replies": [
        {
          "id": "m7aej7y",
          "author": "Aguero-Kun",
          "body": "Engines like UE5 partially to blame I believe",
          "score": 1,
          "created_utc": 1736956618.0,
          "replies": []
        },
        {
          "id": "m7bcii4",
          "author": "DYMAXIONman",
          "body": "Upscaling is fine, games have been doing that for a long time.  The issue is that people want both high resolutions and high framerates and to do that you'll need to use DLSS.",
          "score": 1,
          "created_utc": 1736966485.0,
          "replies": [
            {
              "id": "m7c8odh",
              "author": "overdev",
              "body": "yeah upscaling + TAA is sooo great.\n\nImagine companies would invest more in proper optimization and hardware instead of this AI BS.",
              "score": 0,
              "created_utc": 1736975593.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m79z2q6",
      "author": "Apostinggod",
      "body": "All frames are fake",
      "score": 3,
      "created_utc": 1736951729.0,
      "replies": [
        {
          "id": "m7a1xm4",
          "author": "jupatoh",
          "body": "Geralt isn’t outside my window right now???",
          "score": 8,
          "created_utc": 1736952695.0,
          "replies": []
        },
        {
          "id": "m7a9fez",
          "author": "beleidigtewurst",
          "body": "Oh, such a bright counter argument, amazing scheisse.",
          "score": -3,
          "created_utc": 1736955080.0,
          "replies": [
            {
              "id": "m7aaf90",
              "author": "None",
              "body": "[removed]",
              "score": 1,
              "created_utc": 1736955385.0,
              "replies": [
                {
                  "id": "m7ctkyq",
                  "author": "V1pArzZz",
                  "body": "All frames are fake frames 🤓",
                  "score": 2,
                  "created_utc": 1736981697.0,
                  "replies": []
                },
                {
                  "id": "m7fr2f0",
                  "author": "corut",
                  "body": "There are two levels of fake:\n\nFake that is based on game logic and rules and responds to input\n\nAnd fake that is none of this things",
                  "score": 1,
                  "created_utc": 1737028922.0,
                  "replies": []
                },
                {
                  "id": "m7hokn7",
                  "author": "beleidigtewurst",
                  "body": "All frames are manufactured does not mean they are all the same. \n\nIt ain't hard.\n\nNormal frames decrease lag and increase game responssivenes.\n\nFaux frames by FG incrase lag and DECREASE game responsiveness.",
                  "score": 0,
                  "created_utc": 1737051682.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m79xacd",
      "author": "NickMalo",
      "body": "Raw performance is still better than dlss or mfg. 6950xt holding strong at 1440p 144hz, couldn’t be happier.",
      "score": 4,
      "created_utc": 1736951108.0,
      "replies": [
        {
          "id": "m79xx8b",
          "author": "ANALHACKER_3000",
          "body": "I have a 6750xt. I got it as an upgrade for my 1070. \n\n\nI'm not gonna need another card for a while.",
          "score": 3,
          "created_utc": 1736951331.0,
          "replies": []
        },
        {
          "id": "m79yy8v",
          "author": "OneIShot",
          "body": "As someone who likes to use ray tracing though, AMD is just not an option.",
          "score": 10,
          "created_utc": 1736951687.0,
          "replies": [
            {
              "id": "m7a2v65",
              "author": "thedoc90",
              "body": "Depends on the implementation too though, Indiana Jones and the Great Circle is much more performant on AMD with ray tracing than many other titles. Not saying all the discrepancies are down to poor optimization, but it definitely seems like something the devs have a bit more control over than people seem to think.",
              "score": 4,
              "created_utc": 1736953000.0,
              "replies": [
                {
                  "id": "m7a7y9w",
                  "author": "OneIShot",
                  "body": "Possibly, but facts remain in most cases nvidia cards current run circles around AMD cards in RT.",
                  "score": 2,
                  "created_utc": 1736954623.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7ay3zh",
              "author": "NickMalo",
              "body": "Good thing i don’t care about ray tracing, then",
              "score": 2,
              "created_utc": 1736962375.0,
              "replies": [
                {
                  "id": "m7ayltt",
                  "author": "OneIShot",
                  "body": "Cool?",
                  "score": 0,
                  "created_utc": 1736962519.0,
                  "replies": [
                    {
                      "id": "m7ayv8k",
                      "author": "NickMalo",
                      "body": "… you replied to my comment about your personal taste??",
                      "score": 1,
                      "created_utc": 1736962595.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7a5pzu",
              "author": "drmirage809",
              "body": "Not to mention: we've now entered a world where turning off RT is just not an option anymore. Dial of Destiny straight up forces it on and forcibly turning it off just gets rid of all the lighting and shading.",
              "score": 1,
              "created_utc": 1736953928.0,
              "replies": []
            },
            {
              "id": "m7aau22",
              "author": "beleidigtewurst",
              "body": "What year is it, FFS...",
              "score": 1,
              "created_utc": 1736955509.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7a4ad9",
          "author": "alc4pwned",
          "body": "Idk, DLSS/FSR is basically free performance as far as I'm concerned. No reason to not use it.",
          "score": 2,
          "created_utc": 1736953466.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m79wh9j",
      "author": "Sorcerious",
      "body": "All frames are generated and fake, we've been cutting corners ever since computer graphics popped up.\n\nDLSS and FSR are just another of those tricks, not sure why people get angry.\n\nI get why the sheep are, but not those that are legitimately angry.\n\nOutrage generates clicks generates money is my vote.",
      "score": -3,
      "created_utc": 1736950825.0,
      "replies": [
        {
          "id": "m79xn47",
          "author": "Nebuli2",
          "body": "I think the complaints are around Nvidia's marketing of those frames as being just as good as normally generated frames, and around Jensen's outright lying about how the frames \"predict the future\" to eliminate latency. There's nothing inherently wrong with the tech, but it's not perfect, and it's a far cry from what their CEO wants people to believe it to be.",
          "score": 21,
          "created_utc": 1736951233.0,
          "replies": [
            {
              "id": "m79ynew",
              "author": "fiftyshadesofseth",
              "body": "nvidia said 5070 is 4090 performance for $549. we didnt want an increase in the GPUs ability to cut corners we want an increase of raw performance. these just feel like marketing gimmicks.",
              "score": 16,
              "created_utc": 1736951582.0,
              "replies": [
                {
                  "id": "m7a792m",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1736954407.0,
                  "replies": [
                    {
                      "id": "m7aagea",
                      "author": "fiftyshadesofseth",
                      "body": "the \"tech\" in question is DLSS and Multi Frame Gen. An example of this in action is Black Myth Wukong at max settings at 4k native, on the 5090 i think it gets like 20-30fps but with this DLSS and Frame gen in question in magically leaps to a 100+ frame rate, but how? DLSS is responsible for rendering the image at a lower resolution and then upscaling it to your output resolution. Multi Frame Gen is responsible for taking those 20-30 raw fps and inserting artificial frames in between them. Its the same concept as TVs that have a \"motion plus/fast motion\" setting.",
                      "score": 2,
                      "created_utc": 1736955394.0,
                      "replies": [
                        {
                          "id": "m7aec61",
                          "author": "Aguero-Kun",
                          "body": "For game like Wukong this isn't the end of the world but still annoying. Imagine trying to play a first person shooter with motion smoothing lmao what a mess",
                          "score": 2,
                          "created_utc": 1736956559.0,
                          "replies": [
                            {
                              "id": "m7afyvu",
                              "author": "fiftyshadesofseth",
                              "body": "That will be our future with all these new games being built on UE5, they might look nice but will require a crypto mining farm to run a stable native 4k.",
                              "score": 1,
                              "created_utc": 1736957050.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m7acv7p",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 1,
                          "created_utc": 1736956118.0,
                          "replies": [
                            {
                              "id": "m7aecad",
                              "author": "Nebuli2",
                              "body": "It can make things look smooth, sure, but the bigger issue that it still can't solve is high frame latency. If your base frame rate is low, then so is the input latency. Generated frames won't get you away from that.\n\nWith that being said, are high frame latencies always a problem? No, but in action games, it won't feel nearly as good as that high framerate would suggest.",
                              "score": 4,
                              "created_utc": 1736956560.0,
                              "replies": [
                                {
                                  "id": "m7afm6y",
                                  "author": "fiftyshadesofseth",
                                  "body": "Yup, I think a 20-30 fps getting boosted to a stable 60 wouldn’t be too bad but using those 20-30 to jump to 100+ would both look and feel terrible.",
                                  "score": 0,
                                  "created_utc": 1736956944.0,
                                  "replies": [
                                    {
                                      "id": "m7ahbt1",
                                      "author": "timmytissue",
                                      "body": "Well it might not be so bad because it first uses dlss to jump up to 50fps. So you will have a 100fps smoothness with the feel of 50fps (delayed by 1 frame to allow for the frame gen to add it's frame before the real frame. )",
                                      "score": 1,
                                      "created_utc": 1736957463.0,
                                      "replies": [
                                        {
                                          "id": "m7eh6qf",
                                          "author": "Nebuli2",
                                          "body": "FWIW frame generation does not typically reduce latency by a frame - that's a common misconception. Most games already use a system called triple buffered rendering, wherein they essentially store the last 3 frames rendered and show the oldest of those frames. This is done to avoid the major screen tearing that can come without at least double buffering. What this means for frame generation is that you already have multiple frames stored up before they're being rendered that you can use for interpolation.\n\nWith all that being said, frame generation _is_ still going to increase the input latency, but not for that reason. The real reason is far more simple (and usually less significant) - it's just more work for your GPU to do, so your un-boosted framerate will drop, and your latency will rise with that.\n\nFrom my own experience using frame generation, I feel like it really is nice at making things look super smooth when you have a higher refresh-rate monitor _and_ already have a decent base framerate of 60ish fps. If it's just boosting an already low framerate, you still really do feel that input latency, even if movement all looks fairly smooth.",
                                          "score": 1,
                                          "created_utc": 1737002795.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m7egn14",
                                      "author": "Nebuli2",
                                      "body": "20-30 fps boosted to 100 shouldn't really feel much worse than 60. The limiting factor in input latency is always going to be your base framerate, which is usually reduced a little bit by frame generation, since that's additional work for your GPU to do in addition rendering those 20-30 real fps.",
                                      "score": 1,
                                      "created_utc": 1737002553.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m7afpz7",
                              "author": "fiftyshadesofseth",
                              "body": "I think the actual benchmarks are gonna be disappointing once people start comparing raw performance.",
                              "score": 1,
                              "created_utc": 1736956975.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7a02vh",
              "author": "teajayyyy",
              "body": "Damn son, I’ve been out of the PC building world for a decade, but you just reminded how fun FarCry 3 was at the time  I built my first rig.",
              "score": 2,
              "created_utc": 1736952073.0,
              "replies": []
            },
            {
              "id": "m7a1441",
              "author": "CandyCrisis",
              "body": "If you have an image and motion vectors from a past frame, you really can predict a future frame. Just keep things moving in their known direction. That doesn't seem like a misrepresentation of the tech per se.\n\nEDIT: the tech is dumber than I thought it was",
              "score": -1,
              "created_utc": 1736952422.0,
              "replies": [
                {
                  "id": "m7aai8m",
                  "author": "Nebuli2",
                  "body": "A) That sort of prediction is not as good as you may think.\n\nB) That's also just straight up not what they're doing. The new frames are always meant to interpolate _between_ frames that have already been rendered. They can calculate accurate motion vectors this way precisely because they already know where everything starts and ends over the period for which they're interpolating frames. They _already know_ that those motion vectors are accurate, so the effect works reasonably well in this case. It would work less well if they tried extending those motion vectors into future frames for which they don't know end positions.",
                  "score": 2,
                  "created_utc": 1736955410.0,
                  "replies": []
                },
                {
                  "id": "m7agrni",
                  "author": "timmytissue",
                  "body": "Would be cool IF that was what it did. But it doesn't. It adds a frame in between two existing frames, thereby delaying the real frame by a frame and adding latency. If it actually 'predicted\" a new frame that might be interesting and useful. But that would require some impressive innovations.",
                  "score": 2,
                  "created_utc": 1736957294.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7a400s",
          "author": "TheGoldenKraken",
          "body": "DlSS is fine imo. The issue is frame gen. Frame gen on the 40 series already has some issues. I've seen plenty of artifacting and weird bugs playing through Indiana Jones personally on a 4070 super. If there are issues with one fake frame being generated I'm a bit worried about 3 frames being generated. Also this is less of an issue but not a fan of nvidias marketing showing of crazy numbers that won't be representative of all games.",
          "score": 2,
          "created_utc": 1736953371.0,
          "replies": []
        },
        {
          "id": "m7accsq",
          "author": "101m4n",
          "body": "People who like high FPS for latency reasons don't like it because it doesn't improve latency. If they marketed it as AI accelerated motion blur, these people wouldn't care.\n\nPeople who like GPGPU don't like it because it's used as a way to sell us less gpu for more $$.",
          "score": 2,
          "created_utc": 1736955967.0,
          "replies": []
        },
        {
          "id": "m79xyhi",
          "author": "DaEnderAssassin",
          "body": "Probably because of the various issues that still plague the tech.\n\nIMO engines/rendering needs to be altered to allow stuff like DLSS to occur before stuff like UI or weapon scope/sight markings are drawn",
          "score": 4,
          "created_utc": 1736951342.0,
          "replies": [
            {
              "id": "m7a6dij",
              "author": "drmirage809",
              "body": "In a good implementation that is exactly what happens. Upscaling happens first and the UI comes after that. Makes sure the text stays sharp and doesn't turn into a blurry mess. \n\nGod of War Ragnarok doesn't do this for the codex for some reason. You can scroll through the entries and the text just sorta smears before snapping back into sharpness.",
              "score": 1,
              "created_utc": 1736954135.0,
              "replies": []
            },
            {
              "id": "m7a2rx7",
              "author": "TehOwn",
              "body": "I've honestly never ever seen DLSS artifacting on any UI elements. Maybe it's only an issue in games that implement it poorly.",
              "score": 1,
              "created_utc": 1736952971.0,
              "replies": [
                {
                  "id": "m7brjr8",
                  "author": "SparroHawc",
                  "body": "It becomes much more apparent if you are using a low-persistence monitor.  I get perfectly smooth scrolling, but any sort of AI scaling or frame generation would cause smearing of text with a scrolling background unless the text is rendered completely separately from the AI-generated images.  If you're using a monitor that doesn't strobe the image like CRTs did back in the day, the blur you get from that hides a lot of sins.",
                  "score": 1,
                  "created_utc": 1736970780.0,
                  "replies": []
                },
                {
                  "id": "m7a7dt4",
                  "author": "404_GravitasNotFound",
                  "body": "They are present in all games that use DLSS, you might need to go to an optometrist if you can't see how badly DLSS artifacts pop up. Every moving object or character is surrounded by a \"field\" of diffraction that distorts the background around it. VR, Flatscreen, anything.",
                  "score": 0,
                  "created_utc": 1736954448.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m79xfzm",
          "author": "lukinhasb",
          "body": "\"AI\"",
          "score": 3,
          "created_utc": 1736951163.0,
          "replies": []
        },
        {
          "id": "m7a0yf9",
          "author": "theangryburrito",
          "body": "If fake frame outrage allows me to get my 5090 with ease on the 30th, then I am here for it.",
          "score": 2,
          "created_utc": 1736952369.0,
          "replies": [
            {
              "id": "m7abcei",
              "author": "beleidigtewurst",
              "body": "Wait, are you buying $2k card to enable faux frame bazinga on them, lol?\n\nThen I got more products to bost your frames, dude. Don't stop on NV's faux frames.\nAdd more. Here is samsung's:\n\nhttps://www.youtube.com/watch?v=tDgstPM2j1U\n\nAnd here is Steam's:\n\nhttps://store.steampowered.com/news/app/993090/view/4145080305033108761\n\n\nImagine the combined superpowers of what you'd get. \nDon't settle for anything below 500 frames per second!",
              "score": 0,
              "created_utc": 1736955664.0,
              "replies": [
                {
                  "id": "m7bog5r",
                  "author": "theangryburrito",
                  "body": "They are all fake frame, brent.",
                  "score": 0,
                  "created_utc": 1736969896.0,
                  "replies": [
                    {
                      "id": "m7hqp3n",
                      "author": "beleidigtewurst",
                      "body": "Yeah, like bothyou and, say, Bratt Pitt are humans.\n\nBut you <> Brett Pitt, see how it works?\n\nReal game \"fake frames\" decrease lag and improve game responsiveness.\n\nFG fakes INCREASE lag and decrease responsiveness.",
                      "score": 1,
                      "created_utc": 1737052284.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7a15jz",
          "author": "None",
          "body": "So if you watch a mulan and add an AI frame in between each real frame those frames are real parts of the movie??\n\nAccording to you it’s a cartoon and therefore none of it is real so those AI frames full of glitches are just as good as the hand drawn ones right?\n\nThe backlash is that nvidia are claiming their benchmarks should with multi frame gen despite the fact it makes your games look like shit",
          "score": 2,
          "created_utc": 1736952436.0,
          "replies": [
            {
              "id": "m7gfjh2",
              "author": "Sorcerious",
              "body": "Can't compare movies or cartoons to games, fundamentally different entertainment because you actively partake in the activity.",
              "score": 1,
              "created_utc": 1737038418.0,
              "replies": [
                {
                  "id": "m7gk6ni",
                  "author": "None",
                  "body": "The interactivity doesn’t change the fact any rendered image is “fake” right?? \n\nAccording to you handrawn is just fake images so it’s the same as AI doing it. You say my computer rendering images is fake the same why an AI generates and blurry mess of a frame.",
                  "score": 1,
                  "created_utc": 1737039914.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7acmoc",
          "author": "timmytissue",
          "body": "The real issue with frame gen is that it doesn't improve performance so it's not recommended below 60fps. Most people don't need to play above 60 fps unless they are playing a competitive game in which case you wouldn't want to use frame gen because of the 1 frame lag it introduces. \n\nSure I would like to be at 90fps even in a story driven game but that's still for the feel of it and frame gen won't help that. \n\nDlss and fsr can take a 30fps experience into a 50fps experience. Frame gen is not even usable in these cases. This is when you actually need the performance help. \n\nSo I struggle to see the use case for anyone who knows how it actually works.",
          "score": 1,
          "created_utc": 1736956047.0,
          "replies": []
        },
        {
          "id": "m7a1po1",
          "author": "MechaZain",
          "body": "The concern over the tech is dumb. Concern about the industry’s increasing reliance on DLSS is valid is though. If NVIDIA’s numbers are true the performance gap is so vast that I can’t imagine major releases going without DLSS a generation from now.",
          "score": 1,
          "created_utc": 1736952621.0,
          "replies": [
            {
              "id": "m7abjee",
              "author": "beleidigtewurst",
              "body": "DLSS is a form of TAA. What does \"going without\" even mean? Dropping actual rendering at 4k? You might be watching too much PF bazinga.",
              "score": 3,
              "created_utc": 1736955722.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7a3f4q",
      "author": "arabidkoala",
      "body": "I guess maximum frame rate ended up being a perverse incentive in the era of ai.",
      "score": 1,
      "created_utc": 1736953181.0,
      "replies": []
    },
    {
      "id": "m7a6i57",
      "author": "beleidigtewurst",
      "body": "It's he most mediocre release we've seen for years.\n\n\"But faux frames, don't you like them\" sping hyping will be heard beyond our solar system.\n\nTo compensate... :)))",
      "score": 1,
      "created_utc": 1736954175.0,
      "replies": []
    },
    {
      "id": "m7a777a",
      "author": "Geralt_Of_Philly",
      "body": "Should I get a 4090 or save up for the 50 series?",
      "score": 1,
      "created_utc": 1736954390.0,
      "replies": [
        {
          "id": "m7bc0v9",
          "author": "DYMAXIONman",
          "body": "You should get a 5070ti as it seems like it will be the best value 50 series card.",
          "score": 0,
          "created_utc": 1736966346.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7aghct",
      "author": "Glidepath22",
      "body": "I wonder if that make them better AI generation cards",
      "score": 1,
      "created_utc": 1736957207.0,
      "replies": []
    },
    {
      "id": "m7atrqe",
      "author": "dr_reverend",
      "body": "So can I just add in fake money in between my paychecks? If it’s good enough for Nvidia then it should be good enough for my bank right?",
      "score": 1,
      "created_utc": 1736961119.0,
      "replies": []
    },
    {
      "id": "m7azmcg",
      "author": "No-Cicada-7128",
      "body": "Feels bad in competitive games, ita fine in singe player stuff",
      "score": 1,
      "created_utc": 1736962808.0,
      "replies": []
    },
    {
      "id": "m7bd1jt",
      "author": "duckofdeath87",
      "body": "Is frame generation better on NVIDIA than AMD? I only have used it on Monster Hunter Wilds and it was like occasionally getting a 1-frame jump scare. It was pure nightmare fuel",
      "score": 1,
      "created_utc": 1736966636.0,
      "replies": []
    },
    {
      "id": "m7bopqw",
      "author": "bigjoe980",
      "body": "I don't have a horse in this race, but I still believe the people hyping up 50 series are the same ones that were shitting on the 4060 for being fake ai shit vs the 3060 - like I personally know content creators who I watched do EXACTLY that with the 4060 launch and now they're all in on framegen/dlss, after violently shitting on it.\n\n\nI genuinely think these are the people who took the bait, flipped after one gen and that's become their new normal because big number.\n\n\nI'm not saying that's a good or bad thing, it's just an observation.",
      "score": 1,
      "created_utc": 1736969973.0,
      "replies": []
    },
    {
      "id": "m7cpfoo",
      "author": "KrackSmellin",
      "body": "So they are like a v4 engine with a turbo replacing the v8 and expecting the same performance in regards to HP and torque…",
      "score": 1,
      "created_utc": 1736980419.0,
      "replies": []
    },
    {
      "id": "m7e0qhm",
      "author": "None",
      "body": "Yawn. This hoopla is hilarious. There is no real controversy here. \n\nThey showed the chart with a reference to both MFG and non-FG at CES.\n\nFor the 5090, what's offered is clear: \n\n20% - 30% raw performance increase. More with MFG, at some visual trade-off\n\n32gb new-gen vram\n\nMore/better encoders/decoders \n\nNew gen connectivity \n\nFor $1999\n\nDon't like any of these, no prob, don't buy. \n\nThat'll make it easier for me to get my hands on one 😂👍\n\nIn an alternate timeline, Nvidia just released a 1000w 4-slot behemoth that churns out 500% the performance of the 4000 series without AI assist..... it costs $10,000 lol. People in that timeline are also crying:\n\n \"why didn't Nvidia try using AI tech to save on costs.?!\" 🤣",
      "score": 1,
      "created_utc": 1736996337.0,
      "replies": []
    },
    {
      "id": "m7e3w8n",
      "author": "Duke55",
      "body": "More to the point. Why does this subject constantly get raised while we're waiting on said benchmarks? How many times a day must this topic be discussed, ffs..",
      "score": 1,
      "created_utc": 1736997478.0,
      "replies": []
    },
    {
      "id": "m7ebj6u",
      "author": "Kitakitakita",
      "body": "If you cant tell, does it matter?",
      "score": 1,
      "created_utc": 1737000400.0,
      "replies": [
        {
          "id": "m7l9kqy",
          "author": "lainiwaku",
          "body": "The fact is you can tell",
          "score": 1,
          "created_utc": 1737095748.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7eoqht",
      "author": "Musetrigger",
      "body": "Also that strange way they render faces on models.",
      "score": 1,
      "created_utc": 1737006320.0,
      "replies": []
    },
    {
      "id": "m7f2076",
      "author": "ohiocodernumerouno",
      "body": "Playing PUBG at 200fps on 2560x1080 because any higher drops my fps. EDIT: 4090",
      "score": 1,
      "created_utc": 1737013763.0,
      "replies": []
    },
    {
      "id": "m7fzyd5",
      "author": "GagOnMacaque",
      "body": "Honestly, we could double framerate if we went back to interlaced frames.",
      "score": 1,
      "created_utc": 1737032846.0,
      "replies": []
    },
    {
      "id": "m7g21ub",
      "author": "DocHolidayPhD",
      "body": "There's no such thing as fake frames. Frames are frames. You cannot dig half a hole.",
      "score": 1,
      "created_utc": 1737033651.0,
      "replies": []
    },
    {
      "id": "m7lbepb",
      "author": "lainiwaku",
      "body": "People be like \"but you will not notice it\" \nI have a 4070.... Every time I try fake frame I disable it after less than 2 minute... And I'm not a fast fps player I play  game like cp 2077 or stalker...\nIf I have to choose between dlss equilibrate or fake frame, I prefer the dlss \nThe fake frame, you really notice it",
      "score": 1,
      "created_utc": 1737096775.0,
      "replies": []
    },
    {
      "id": "m7lfm1g",
      "author": "None",
      "body": "the frame gen technology has allowed them to delay the overall progress of GPU even further, allowing them to have more releases with just enough \"performance increase\" to sell. Expect the same thing in the upcoming years. Even the leather jacket got upgraded to a more flashier but essentially the same jacket.",
      "score": 1,
      "created_utc": 1737099264.0,
      "replies": []
    },
    {
      "id": "m79yz8e",
      "author": "2hands10fingers",
      "body": "I don’t care about frames as much as I care about compute power. I like to make graphic simulations, and it’s super intensive.",
      "score": 1,
      "created_utc": 1736951696.0,
      "replies": []
    },
    {
      "id": "m7a2eyw",
      "author": "piscian19",
      "body": "As a 4090 holder I'm hoping to skip this one. It kinda looks like less of a leap forward and more like they just got more efficient and improved frame gen and DLSS. Well see.",
      "score": 1,
      "created_utc": 1736952855.0,
      "replies": [
        {
          "id": "m7b0h2q",
          "author": "Sarspazzard",
          "body": "I'll likely do the same. I can't justify plummeting that much cash into a half baked hardware improvement. It's said that the 5090 is like 30% faster in raw performance over the 4090...but that's only if you need it for $2000+ after already sinking $1600 into the older GPU. No thanks. I like this hobby, but the rose tinted (RT) glasses are OFF this generation. Waiting for more baseline performance uplifts.",
          "score": 1,
          "created_utc": 1736963049.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a4hz1",
      "author": "Sammoonryong",
      "body": "so glad I got my 4090 for like 1k.",
      "score": 1,
      "created_utc": 1736953537.0,
      "replies": [
        {
          "id": "m7b0ngf",
          "author": "Sarspazzard",
          "body": "Same here. Marketplace deals right?",
          "score": 1,
          "created_utc": 1736963100.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7csgtn",
      "author": "VRGIMP27",
      "body": "I think a better way to think of frame interpolation or frame generation is as a new form of motion blur reduction that is ideal for LCD and OLED displays.\n\nLCD and OLED displays draw the frame in a way that is called sample and hold. \n\nThat means the liquid crystals get an electrical signal and either open or close to let light pass through or block light, and they hold that position until the next refresh cycle.\n\nFor OLED it means the pixels switch once every refresh cycle and that's how you get the image on the screen.\n\nUnless you strobe the back light or you insert a black frame on an OLED, you get really crappy resolution in motion.\n\nYour 4K monitor or 1080p momitor without motion blur reduction only gives you 400 lines or 400 pixels per second in fast motion. That's about the resolution of a VHS tape.\n\nThis is really bad for motion resolution and smooth scrolling images unless you have a very high brute force frame rate.\n\nThink of motion blur like the shutter on a camera.\n\nA frame rate of 240 Hz means that a single frame is visible to your eye for 4.16 ms. That translates to 4.16 pixels of motion blur per 1000 pixels per second of motion.\n\nI have a 1080P monitor that I have over clocked to 180 frames per second. \n\n180 frames per second is 5.5 ms of frame visibility time. This means that in a fast moving image my 1080P panel is actually only resolving 1200 pixels per second in fast motion if and only if I can maintain a refresh rate of 180 frames per second.\n\nIn Laymans terms that means my 1080 P display is only showing me 720 P resolution in fast motion. And that's only true if the frame rate stays locked at 180 frames per second and never drops even one frame.\n\nThese fake frames from Nvidia mean your display is actually going to get closer to actually being able to show you a high definition image when the picture is moving, which if you ask me the monitor should be able to do on its own.\n\nMonitors have not been able to show us high resolution images in motion since the days of analog tube displays.\n\nDon't think of this as fake frames think of it as a way to actually make your monitor show you the resolution that it is claiming it is capable of.",
      "score": 1,
      "created_utc": 1736981348.0,
      "replies": []
    },
    {
      "id": "m7d6dxh",
      "author": "None",
      "body": "It’s possible that nvidia have focused purely on ai in recent years and without dlss the new 5 series isn’t much better than the 2 or 3 series.",
      "score": 1,
      "created_utc": 1736985916.0,
      "replies": []
    },
    {
      "id": "m7dk9of",
      "author": "Bob_the_peasant",
      "body": "Will they accept $250 for a 5090 if I tell them I can upscale it to $2000 using DLSS7?",
      "score": 1,
      "created_utc": 1736990604.0,
      "replies": []
    },
    {
      "id": "m7eefq0",
      "author": "haarschmuck",
      "body": "DLSS is nothing new, and calling them \"fake frames\" is a bit odd. It's really just math based interpolation where the AI model \"guesses\" where the polygons should be in each generated frame.\n\nSimilar to how video upscaling works. You're not increasing the detail, but you are increasing the resolution and sharpness.",
      "score": 1,
      "created_utc": 1737001602.0,
      "replies": [
        {
          "id": "m7l9imw",
          "author": "lainiwaku",
          "body": "Yeah it \"guess\" by making fake frame with artifact",
          "score": 1,
          "created_utc": 1737095715.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7fawmt",
      "author": "Auran82",
      "body": "It feels like a lot of modern games have stuff put into their “ultra” settings that are either not really feature complete or just not optimized because you’re not going to use the option unless you have a ridiculous amount of extra power. But in reality, the features don’t really do anything for picture quality unless you examine it with a microscope, all they do is tank the frame rate with questionable benefit.\n\nThen along comes the new cards with frame generation able to run these semi useless features at a higher frame rate while some people eat up the numbers like it’s the most amazing thing. It’s a pity there isn’t really an accepted standard for picture quality settings so we could have a proper comparison with an apples to apples comparison, then compare with the old gen up scaling on both cards, then show how much benefit the new features give with realistic settings, not just throwing broken stuff at the card and letting the frame generation make the numbers bigger.",
      "score": 1,
      "created_utc": 1737019372.0,
      "replies": []
    },
    {
      "id": "m7dayzl",
      "author": "Coldspark824",
      "body": "If the frames are fake, why do they look so real?",
      "score": 0,
      "created_utc": 1736987459.0,
      "replies": []
    },
    {
      "id": "m7efq8z",
      "author": "None",
      "body": "Aren't all frames fake? If there are visual artefacts they'll just be ironed out in following card generations.\n\nNot sure why how is so controversial to so many people.",
      "score": 0,
      "created_utc": 1737002155.0,
      "replies": []
    },
    {
      "id": "m7cwlfl",
      "author": "therinwhitten",
      "body": "Got to give credit where credit is due: the cost might be to cover the R&D just for the cooler. I watched the breakdown and thermal engineers gush over all the work they did on it and the board.",
      "score": 0,
      "created_utc": 1736982658.0,
      "replies": []
    },
    {
      "id": "m7kzlx3",
      "author": "ecktt",
      "body": "NVidia haters: \"It fake frames\"\n\nAMD Fanboys: \"NVidia is too expensive\"\n\nPeople who buy Intel: \"We actually got a reasonable video card for a reasonable price.\"\n\nObjective people: \"Fake frames or not; does anyone else make a better video card?\"",
      "score": 0,
      "created_utc": 1737090713.0,
      "replies": [
        {
          "id": "m7l94p6",
          "author": "lainiwaku",
          "body": "I honestly think and make better card for the price, my personal experience, avoid me to buy it though when I was kids my first computer was with an ati Radeon cards ,  and it was lagging like hell even on basic games when I brought an Nvidia card my first card I brought , it was just magic how performance increased, even if today and make good card, I just can't becaus of this memory",
          "score": 1,
          "created_utc": 1737095505.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a5b9n",
      "author": "Roykebab",
      "body": "If your end goal is to play games, I really think people are being nit picky for no reason. I love all these new features that NVIDIA has been pushing. The fact that I can play games in 4K with great frames at near max settings without having the insane power draw of relying on pure raster graphics is honestly amazing. \n\nI welcome this new tech with open arms because honestly it will only get better as time goes on. Hell even going from DLSS 2 to 3.8 on my 3060ti has significantly increased the quality and performance in games for me.",
      "score": -1,
      "created_utc": 1736953798.0,
      "replies": []
    },
    {
      "id": "m7a7pcq",
      "author": "None",
      "body": "[deleted]",
      "score": -1,
      "created_utc": 1736954548.0,
      "replies": [
        {
          "id": "m7agyys",
          "author": "godzukey55",
          "body": "I’d say that’s up to you! If you aren’t running crazy performance heavy stuff then no, I just got a 4070 super and it’s amazing so far! Maybe go for something like that so it doesn’t break the bank? But it’s truly up to you and your experience!",
          "score": 0,
          "created_utc": 1736957356.0,
          "replies": []
        },
        {
          "id": "m7beke8",
          "author": "Just-A-Regular-Fox",
          "body": "Yes. I am. You should too.",
          "score": -1,
          "created_utc": 1736967066.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7areys",
      "author": "Dinan328i",
      "body": "As someone coming from a 2080TI and planning to camp out at micro center on release for a 5080 this should still be a no brainer right?",
      "score": -1,
      "created_utc": 1736960423.0,
      "replies": [
        {
          "id": "m7bcaio",
          "author": "DYMAXIONman",
          "body": "Yeah, you'd get a pretty large uplift.",
          "score": 0,
          "created_utc": 1736966422.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7a969f",
      "author": "KingMob9",
      "body": "All frames are fake.",
      "score": -5,
      "created_utc": 1736955002.0,
      "replies": []
    },
    {
      "id": "m7bjv8l",
      "author": "Va1crist",
      "body": "Clickbait bull shit",
      "score": -2,
      "created_utc": 1736968583.0,
      "replies": []
    }
  ]
}