{
  "post": {
    "title": "Startup set to brick $800 kids robot is trying to open source it first",
    "author": "Sariel007",
    "id": "1hiyo90",
    "score": 1344,
    "created_utc": 1734743218.0,
    "selftext": "",
    "num_comments": 73,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hiyo90/startup_set_to_brick_800_kids_robot_is_trying_to/"
  },
  "comments": [
    {
      "id": "m32rly2",
      "author": "redcatmanfoo",
      "body": "It's cute. But I'm not surprised it is going to fail to be sustainable. Good on them for open sourcing. If they make something new that's the difference maker for if I'd buy it or not. Knowing I can trust them not to brick my purchase is huge.",
      "score": 378,
      "created_utc": 1734747103.0,
      "replies": []
    },
    {
      "id": "m33361f",
      "author": "yvrelna",
      "body": "An emotional support robot betraying kids that needs emotional support. \n\n\nOh boy, this is going to create a lot of trust issues with those kids.",
      "score": 154,
      "created_utc": 1734752022.0,
      "replies": [
        {
          "id": "m33y6vu",
          "author": "unassumingdink",
          "body": "Luckily they already had them from being the children of parents who subcontract their parenting duties out to robots.",
          "score": 72,
          "created_utc": 1734768977.0,
          "replies": [
            {
              "id": "m3cwhrg",
              "author": "Tryknj99",
              "body": "If it’s not this robot, it’s an iPad",
              "score": 7,
              "created_utc": 1734910193.0,
              "replies": [
                {
                  "id": "m3l4mqp",
                  "author": "corree",
                  "body": "Nah this is so much worse than an iPad lol. At least an iPad can be used for an insane variety of things, this thing would be better off at the end of a bowling lane",
                  "score": 2,
                  "created_utc": 1735044683.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m35es19",
          "author": "Killbot_Wants_Hug",
          "body": "An emotional support robot seems pretty dystopian to begin with. I feel like it's just going to breed maladjustments in children.",
          "score": 18,
          "created_utc": 1734796467.0,
          "replies": [
            {
              "id": "m3mxx7a",
              "author": "FlashInThePandemic",
              "body": "Reminds me of Leonard in Big Bang Theory, whose mother was so cold and unattached that, as a child, he built a robot to give himself hugs. He said the saddest part was when his father borrowed it.",
              "score": 2,
              "created_utc": 1735068773.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m3ebmcj",
          "author": "LevelWriting",
          "body": "There is a superb anime that no one watched  called time of eve that has an episode about that EXACT premise.",
          "score": 3,
          "created_utc": 1734931629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m32qro6",
      "author": "Aleyla",
      "body": "I wouldn’t expect them to finish this.  People like to get paid and if the company is going under then no one is getting paid.  Probably best if they just open source all their code and internal documentation.  Then if some kind soul happens to own one of these things AND has oodles of spare time AND the technical know how then maybe some people might get a little extra life out of it.  \n   \nBut, frankly,",
      "score": 295,
      "created_utc": 1734746743.0,
      "replies": [
        {
          "id": "m33v7na",
          "author": "HittingSmoke",
          "body": "> Probably best if they just open source all their code and internal documentation.\n\nThe problem is you don't \"just\" open source all your code. That's a legal minefield and you may not have the right to redistribute some dependencies.\n\nThe path of least resistance would just be releasing a detailed description of their API so someone can reverse engineer a server for it. That would make the work of building a community maintained open source server far less daunting.",
          "score": 181,
          "created_utc": 1734767055.0,
          "replies": [
            {
              "id": "m35chsg",
              "author": "NickCharlesYT",
              "body": "This is why licensing as a whole needs to be overhauled. If something gets licensed, it should apply in perpetuity to anything that is then part of a product sold to an end user. Music licenses, code libraries, all of it. That is what the user paid for in the first place. This is the same reason things like video games and TV shows get pulled from sale or have music replaced and it's a small in the face to society as a whole she things to just disappear as a result of \"licensing\"problems.",
              "score": 43,
              "created_utc": 1734795646.0,
              "replies": [
                {
                  "id": "m35hwqh",
                  "author": "HittingSmoke",
                  "body": "I don't disagree, but that doesn't really apply to this scenario. The problem is the \"live service\" side of things. The server-side software is engineered to be run by experienced devops, likely on a big cloud platform. It's not designed to be distributed to end users. What we need is some sort of precedent for liability when a company releases a product with an up-front cost that relies on a live service that the product is useless without. What is the expected reasonable legal minimum amount of time the service should be maintained to protect consumers?\n\nThere are a lot of approaches that could be taken for this but a good law would make companies think very hard about whether they want to tie expensive products to a live service so tightly that they can be considered useless without it, with no backup plan for when the live service shuts down.",
                  "score": 15,
                  "created_utc": 1734797572.0,
                  "replies": [
                    {
                      "id": "m35l1ka",
                      "author": "NickCharlesYT",
                      "body": "If licensing is overhauled then open sourcing live service code becomes much simpler. It also solves issues with abandonware.",
                      "score": 6,
                      "created_utc": 1734798654.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m381t67",
                  "author": "bizzaro321",
                  "body": "People would just charge more for whatever the new version of licensing is. Our entire economy needs to be restructured for consumers to see any benefit.",
                  "score": 1,
                  "created_utc": 1734831445.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m37y8hs",
              "author": "hotlavatube",
              "body": "Mmm, I’ve dealt with a little of that. I’ve developed code that used to use algorithms from certain numerical algorithm books that distributed the source code for free. We were fine to use code closed source but when we were pushed open source we had to replace all those algorithms with open source alternatives like Apache Math.     \n   \nSome of the other libraries we used had licenses or license keys. Either we couldn’t redistribute the library or the library might be worthless without a paid license key to unlock features.",
              "score": 3,
              "created_utc": 1734829959.0,
              "replies": []
            },
            {
              "id": "m354q7e",
              "author": "Aleyla",
              "body": "Whatever external dependencies exist, just document, then upload *their own* code to github.",
              "score": 8,
              "created_utc": 1734792703.0,
              "replies": [
                {
                  "id": "m35dry1",
                  "author": "HittingSmoke",
                  "body": "Sorry, but that's really just not how this works. Everyone likes to say \"Just open source it\" when a company shuts down when they clearly have no idea how much work that entails. The entire code base needs to be audited with a microscope for licensing issues. It's a massive amount of work with an extremely high risk to reward ratio. Even using open source code in other open source projects can have endless questions about the legality. See: ZFS in the Linux kernel. Releasing API documentation for reverse engineering is much less work and is completely legally safe as it will likely be re-implemented with the equivalent of clean room development.\n\nThere's a reason you basically never see this happen. Because it can very easily go like this: https://www.theregister.com/2024/10/16/opensourcing_of_winamp_goes_badly/",
                  "score": 14,
                  "created_utc": 1734796110.0,
                  "replies": [
                    {
                      "id": "m35fit2",
                      "author": "Aleyla",
                      "body": "> The entire code base needs to be audited with a microscope for licensing issues.    \n   \nNo, it really doesn’t.   The company is gone.  No longer exists.  There is no entity to sue if there is a licensing problem.   \n   \nAnyone who grab the code will need to make their own judgement.   \n   \nYou are seriously over thinking this.",
                      "score": -18,
                      "created_utc": 1734796732.0,
                      "replies": [
                        {
                          "id": "m35gb2y",
                          "author": "HittingSmoke",
                          "body": "That is:\n\n1. Now how civil litigation works.\n1. Not how software distribution works.",
                          "score": 23,
                          "created_utc": 1734797010.0,
                          "replies": [
                            {
                              "id": "m35gxpx",
                              "author": "Aleyla",
                              "body": "Whatever dude, continue on in your fantasy land.",
                              "score": -21,
                              "created_utc": 1734797233.0,
                              "replies": [
                                {
                                  "id": "m36kqu0",
                                  "author": "Imaginary_Apricot933",
                                  "body": "I know the real world seems scary, but it's not a fantasy land.",
                                  "score": 13,
                                  "created_utc": 1734810998.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m3elauk",
                      "author": "None",
                      "body": "[removed]",
                      "score": -2,
                      "created_utc": 1734937369.0,
                      "replies": [
                        {
                          "id": "m3gcfrf",
                          "author": "HittingSmoke",
                          "body": "I don't even know where to start in explaining how wrong this comment is.",
                          "score": 1,
                          "created_utc": 1734970282.0,
                          "replies": [
                            {
                              "id": "m3ggvt3",
                              "author": "None",
                              "body": "[removed]",
                              "score": -1,
                              "created_utc": 1734971762.0,
                              "replies": [
                                {
                                  "id": "m3ginxu",
                                  "author": "HittingSmoke",
                                  "body": "You can license the use of source code to distribute as a compiled binary while not having the rights to distribute the original or modified source. This is very common. Licensing is simply contract law. If it can be written into a legally enforceable contract, it can be done.",
                                  "score": 3,
                                  "created_utc": 1734972345.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m35g2tm",
                  "author": "Kichigai",
                  "body": "Chances are a decent number of them are open source already, just under different licenses. Like libjpeg, libvorbis, libpng. Like, seriously, go to your PlayStation or Xbox or any “smart” gizmo and go into the About page and open up licenses.\n\nNone of these companies want to reinvent the wheel, especially when they can easily, legally, and without malice, get the wheel for free.",
                  "score": 3,
                  "created_utc": 1734796931.0,
                  "replies": []
                },
                {
                  "id": "m35bm9a",
                  "author": "cmaldrich",
                  "body": "Right, doesn't seem like it has to be hard. It's not going to be (doesn't have to be) plug-n-play like some open source.",
                  "score": 2,
                  "created_utc": 1734795329.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m35j8pa",
              "author": "StormTGunner",
              "body": "What would they do, try to sue a bankrupted company?",
              "score": 2,
              "created_utc": 1734798034.0,
              "replies": [
                {
                  "id": "m35nerw",
                  "author": "HittingSmoke",
                  "body": "Corporate veils are not impenetrable. It would be unlikely, though not totally impossible, for someone to be held personally liable in a particularly egregious case of releasing something that could be considered another company's trade secrets.\n\nThat said, that's not the only issue. Let's say there's a scenario [where this happens](https://arstechnica.com/gadgets/2024/10/winamp-really-whips-open-source-coders-into-frenzy-with-its-source-release/), they dump their code to GitHub, and it's found to contain valuable code that is not licensed for distribution and the company who owns the copyright on that code is particularly litigious. It will get uploaded to a public repo, get quickly removed, cause a massive media shit storm, and anyone working on their own version of the software will be under intense scrutiny for spoilage. When reverse engineering software that has some dodgy licensing implication, you do what's called clean room development. Everyone contributing code to the project must be beyond reproach when the question arises of whether they've ever seen or been remotely adjacent to the restrictive code.\n\nBy releasing legally questionable code, you've actually made it more difficult to safely reverse engineer software. This has happened in live service game development before where there were server emulators reverse engineered in a clean room environment, then source code leaked and from then on all projects were tainted by questions of whether leaked source was even *referenced* when developing updates.\n\nThis is why the path of least resistance is just releasing API documentation. A developer wanting to take it on can just look at what the the endpoints consume and return. Decoding that is the most difficult part of reverse engineering. After that's it's straight-forward software engineering.",
                  "score": 8,
                  "created_utc": 1734799461.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4pd17g",
              "author": "livevicarious",
              "body": "This is why they are going to release a standalone app that runs on Windows. They won't be open sourcing anything but the downfall is they release the app and if it doesn't work or has bugs you're stuck with that for life of the product.",
              "score": 1,
              "created_utc": 1735659315.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m32pvqw",
      "author": "sgrams04",
      "body": "Someone will have this playing Doom in less than a week. ",
      "score": 49,
      "created_utc": 1734746374.0,
      "replies": [
        {
          "id": "m32qjma",
          "author": "ThinkExtension2328",
          "body": "Forget doom I’m going to play crysis in 4K",
          "score": 16,
          "created_utc": 1734746650.0,
          "replies": []
        },
        {
          "id": "m33lb1z",
          "author": "None",
          "body": "This is my emotional support DOOM port.",
          "score": 10,
          "created_utc": 1734761016.0,
          "replies": []
        },
        {
          "id": "m34q2nz",
          "author": "J3STERHOPPERPOT",
          "body": "Robot boots up and all you hear is “ah, you’re finally awake!”",
          "score": 3,
          "created_utc": 1734786390.0,
          "replies": []
        },
        {
          "id": "m34yp07",
          "author": "will_never_comment",
          "body": "Then Skyrim!",
          "score": 1,
          "created_utc": 1734790256.0,
          "replies": []
        },
        {
          "id": "m38b5c1",
          "author": "StaysAwakeAllWeek",
          "body": "Someone will have this hacked and harvesting data to sell in less than a week",
          "score": 1,
          "created_utc": 1734835407.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m32ud9m",
      "author": "MagicOrpheus310",
      "body": "Yeah I remember seeing this and the second they said subscription service was involved it's was like yep, that's fucked it!\n\nHaven't heard anything for a year or two and now this, oh dear, didn't see that coming! Hah!!",
      "score": 24,
      "created_utc": 1734748256.0,
      "replies": []
    },
    {
      "id": "m33b3iq",
      "author": "Mreeder16",
      "body": "This title hurts my brain",
      "score": 20,
      "created_utc": 1734755629.0,
      "replies": [
        {
          "id": "m3n9t9j",
          "author": "GandolfMagicFruits",
          "body": "How so? Seemed pretty clear",
          "score": 1,
          "created_utc": 1735073122.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m34fnul",
      "author": "highdiver_2000",
      "body": "Title gore",
      "score": 6,
      "created_utc": 1734780579.0,
      "replies": []
    },
    {
      "id": "m32ugd6",
      "author": "prateeksaraswat",
      "body": "They want someone to buy the rights off them. They aren’t trying to open source it very hard.",
      "score": 17,
      "created_utc": 1734748293.0,
      "replies": []
    },
    {
      "id": "m393jfa",
      "author": "idk_lets_try_this",
      "body": "And that’s why you don’t buy gadgets that need to talk to the owners servers to work.",
      "score": 5,
      "created_utc": 1734850207.0,
      "replies": []
    },
    {
      "id": "m3eca7v",
      "author": "SyCoCyS",
      "body": "Kill software as a service business models. They’re unethical and bad for consumers",
      "score": 3,
      "created_utc": 1734931994.0,
      "replies": []
    },
    {
      "id": "m35dci3",
      "author": "uxl",
      "body": "I just want my household chores robot, is that too much to ask??",
      "score": 4,
      "created_utc": 1734795956.0,
      "replies": []
    },
    {
      "id": "m35fri5",
      "author": "Texas12thMan",
      "body": "It’s like they saw the Black Mirror episode with the Ashley Too doll and were like “that’s a good idea!”.",
      "score": 4,
      "created_utc": 1734796818.0,
      "replies": []
    },
    {
      "id": "m37uu5x",
      "author": "ShakyIncision",
      "body": "I remember the ad for this being very heartwarming—but the more I think about giving parental duties to a thing, kind of gives me the ick.",
      "score": 4,
      "created_utc": 1734828523.0,
      "replies": []
    },
    {
      "id": "m39ryks",
      "author": "H0vis",
      "body": "I feel bad for all the parents who thought this might be like getting a dog but without the inevitable learning about death that comes with that.",
      "score": 3,
      "created_utc": 1734867698.0,
      "replies": []
    },
    {
      "id": "m32xvt6",
      "author": "Packolypse",
      "body": "This is kind of thing having a functioning FTC would have prevented from ever being a thing",
      "score": 9,
      "created_utc": 1734749743.0,
      "replies": []
    },
    {
      "id": "m331zv8",
      "author": "None",
      "body": "Here's hoping! Let's give them a few different LLMs and turn it into a tower of babel situation.",
      "score": 2,
      "created_utc": 1734751514.0,
      "replies": []
    },
    {
      "id": "m34tm4g",
      "author": "JoeDawson8",
      "body": "I saw the adult version of this in the ICU\nas my dad was leaving this world last week.  I\n Swear it said don’t cry to me. Kinda glad I took a video",
      "score": 2,
      "created_utc": 1734788045.0,
      "replies": []
    },
    {
      "id": "m35hji4",
      "author": "Tony___Montana__",
      "body": "Sunny…….",
      "score": 2,
      "created_utc": 1734797443.0,
      "replies": []
    },
    {
      "id": "m37r0c8",
      "author": "PYROxSYCO",
      "body": "They're going to fucking take the money and run like hell.",
      "score": 2,
      "created_utc": 1734826971.0,
      "replies": []
    },
    {
      "id": "m3cqvce",
      "author": "Mikeshaffer",
      "body": "“Trying to open source it” \n\nIt can’t be that hard to change out the api key and post the code on GitHub. It would be open sourced already if they were trying.",
      "score": 2,
      "created_utc": 1734908070.0,
      "replies": []
    },
    {
      "id": "m3f3idr",
      "author": "dirkvonshizzle",
      "body": "Open Sourcing should be mandatory for any company using closed sourced implementations that require said software/service to be running to enable a user to use the HW. I’m surprised the EU hasn’t made this a thing yet after debacles like the Van Moof electric bike, just to name something recent as an example.\n\nHave it ready at launch, maintain it, and make it a “flip of a switch” if things go south.",
      "score": 2,
      "created_utc": 1734949757.0,
      "replies": []
    },
    {
      "id": "m32vp0n",
      "author": "Dan-in-Va",
      "body": "That’s like a space Teletubby",
      "score": 1,
      "created_utc": 1734748814.0,
      "replies": []
    },
    {
      "id": "m34w66u",
      "author": "None",
      "body": "For kids? This is going on my desk at work!",
      "score": 1,
      "created_utc": 1734789188.0,
      "replies": []
    },
    {
      "id": "m353gnq",
      "author": "madisynreid",
      "body": "cooing screw butter gray pie squealing observation dazzling pathetic chase\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 1,
      "created_utc": 1734792205.0,
      "replies": []
    },
    {
      "id": "m3e2a1h",
      "author": "None",
      "body": "LOL",
      "score": 1,
      "created_utc": 1734927020.0,
      "replies": []
    },
    {
      "id": "m3e3f1w",
      "author": "wallyworld96",
      "body": "This was supposed to double as theft deterrent. Would patrol home for disturbances and make noise while video recording.  \nThe selling point was ability to check to see if stove was off while away.  \nI wonder why it didn't work out....",
      "score": 1,
      "created_utc": 1734927544.0,
      "replies": []
    },
    {
      "id": "m3g01n4",
      "author": "Jarmund5",
      "body": "peak late-stage capitalism literally a robot to do the reproductive labour for you. then politicians scratching their heads hard on how to make the population have more kids... just look at japan and south korea.",
      "score": 1,
      "created_utc": 1734966001.0,
      "replies": []
    },
    {
      "id": "m4otukq",
      "author": "TidePodsTasteFunny",
      "body": "Open sourcing a kids toy is pretty awesome until someone turns it into chucky",
      "score": 1,
      "created_utc": 1735652101.0,
      "replies": []
    },
    {
      "id": "m4pcorv",
      "author": "livevicarious",
      "body": "They should have released the PC app they are \"working on\" to begin with. Most PC's can handle the workload required for the AI to function, its more secure, and allows parents more control over the device as a whole. \n\nThey put all their eggs in the subscription based model to begin with and that's what screwed them. They couldn't keep up with the costs to run the servers for all the units. This is why subscription based services for things that DON'T need it are a terrible idea. \n\nI purchased Moxie for my child and I got lucky that mine was under warranty still and my bank allowed me to do a chargeback. Also poor planning on the companies part, they should have allocated funds properly. Sell x amount of units until x date and have x amount of funds to run servers for x amount of time. This company had poor money management, probably zero accounting department.",
      "score": 1,
      "created_utc": 1735659200.0,
      "replies": []
    },
    {
      "id": "m32t7bx",
      "author": "None",
      "body": "Do or do not. There is no try",
      "score": -1,
      "created_utc": 1734747771.0,
      "replies": [
        {
          "id": "m34b5e4",
          "author": "wasd876",
          "body": "So you won’t go sit on a toilet unless you know you’ll be able to squeeze out a turd? Don’t take life advice from a puppet",
          "score": -8,
          "created_utc": 1734777660.0,
          "replies": [
            {
              "id": "m34cndd",
              "author": "OddNothic",
              "body": "Eat more fiber.",
              "score": 6,
              "created_utc": 1734778643.0,
              "replies": []
            },
            {
              "id": "m34l6dq",
              "author": "xxjosephchristxx",
              "body": "How often do you not know?",
              "score": 3,
              "created_utc": 1734783845.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m32yd2c",
      "author": "adamcoe",
      "body": "I have zero sympathy for anyone who dropped 8 bills on a robot from a company no heard of 3 years ago. If anything, have sympathy for those kids, being raised by fools",
      "score": -9,
      "created_utc": 1734749948.0,
      "replies": []
    },
    {
      "id": "m3402m2",
      "author": "KarmicComic12334",
      "body": "There will be a few disappointed kid. Most of yhe spoiled brats who got it already were bored with it. \n\nBut theres one kid out there programing his own personal terminator bodyguard. He's fishing marketplace for parts and putting together an army.",
      "score": -3,
      "created_utc": 1734770225.0,
      "replies": []
    }
  ]
}