{
  "post": {
    "title": "The smaller Fairphone 6 introduces swappable accessories",
    "author": "Doug24",
    "id": "1lk2uys",
    "score": 259,
    "created_utc": 1750849928.0,
    "selftext": "",
    "num_comments": 36,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lk2uys/the_smaller_fairphone_6_introduces_swappable/"
  },
  "comments": [
    {
      "id": "mzp37tg",
      "author": "internetlad",
      "body": "Every time a fair phone comes out I go \"okay this is the time I get one because I love the idea\" then finding out that it's got specs that are half that or worse of phones at a competing price point and I go \"ehhhh maybe they'll figure it out on the next go round\"",
      "score": 149,
      "created_utc": 1750859235.0,
      "replies": [
        {
          "id": "mzppazb",
          "author": "terrytw",
          "body": "There is a price for being fair.",
          "score": 77,
          "created_utc": 1750865611.0,
          "replies": [
            {
              "id": "mzsulhi",
              "author": "MCA2142",
              "body": "Fair price",
              "score": 12,
              "created_utc": 1750899136.0,
              "replies": []
            },
            {
              "id": "n0mdltx",
              "author": "zzazzzz",
              "body": "doesnt mean they have to use severely outdated SoC's. at least offer an option with a current SoC. many ppl wouldnt mind the upcharge, but as it stands you buy a phone with such an outdated cpu that it will be a sluggish laggy mess way before it breaks. completely contradicting the mission of a repairable phone..",
              "score": 1,
              "created_utc": 1751307965.0,
              "replies": [
                {
                  "id": "n0n40p7",
                  "author": "terrytw",
                  "body": "I myself won't buy it. But SD 7 gen3s is from late 2024 so I don't know what you mean by outdated soc. Also the current mobile phone soc is redundantly overpowered, given that you don't game on it. The first problem with longevity comes with battery and storage degradation. I think you don't really understand a lot of the technical details.",
                  "score": 1,
                  "created_utc": 1751315692.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mzq8nvx",
          "author": "atascon",
          "body": "No such thing as a free lunch.\n\nAlso as a significantly smaller company with little to no buying power, the price point is honestly pretty impressive for what they are offering. \n\nTheir target audience is more than happy to sacrifice performance for repairability and sustainability. There are also people that just want a phone that can run a few apps reliably. I am typing this on an iPhone 8 that still does everything I need it to. If it wasn’t for the fact that there are basically no iOS updates anymore and app updates might stop at some point, I would just keep it and keep replacing the battery.",
          "score": 39,
          "created_utc": 1750870987.0,
          "replies": [
            {
              "id": "mzqsdhu",
              "author": "internetlad",
              "body": "It's just a real bummer they don't have a true flagship offering. I'm not saying I'd pay $1600 for a phone with great specs without thinking twice. I'm just saying I'm looking for one and the closest I can find is rooting a pixel 9 pro and installing 3rd party OS",
              "score": 9,
              "created_utc": 1750876388.0,
              "replies": []
            },
            {
              "id": "mzqzogf",
              "author": "iampuh",
              "body": "So people really do care if they have 8 or 12gb of ram on a phone, huh? Not a si for person will notice the difference. What are people doing on their phones which demands the power of the fastest Snapdragon? The answer is gaming and nothing else.",
              "score": -9,
              "created_utc": 1750878473.0,
              "replies": [
                {
                  "id": "mzrj0qv",
                  "author": "internetlad",
                  "body": "Waiting 15 seconds for my camera to open is not gaming. ",
                  "score": 19,
                  "created_utc": 1750884002.0,
                  "replies": [
                    {
                      "id": "mztguev",
                      "author": "pcdenjin",
                      "body": "It *could* be gaming, but I'm still waiting for the damn camera app!",
                      "score": 7,
                      "created_utc": 1750906909.0,
                      "replies": [
                        {
                          "id": "n0crnh5",
                          "author": "ban_Anna_split",
                          "body": "I double-tapped my power button on accident once, and I had to just accept that I had to drop whatever I was going to do that afternoon ",
                          "score": 3,
                          "created_utc": 1751169609.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mzwzq61",
          "author": "jcw99",
          "body": "Got a Fairphone 5 at the end of last year. Yes the specs are worse than a comparable pixel my partner has, but honestly? Specs are so good as a baseline at this point I don't really see a way in which my specs are holding me back. \n\nMaybe I could use slightly more battery life, but turns out a bunch of pixels had some flaws in their batteries anyway and after waiting ages for their warranty battery replacement my partner's phone with the \"fixed\" battery lasts about as long as mine anyway",
          "score": 4,
          "created_utc": 1750958149.0,
          "replies": []
        },
        {
          "id": "mzqbquq",
          "author": "billybobjoesee",
          "body": "Eh outside of a large battery and decent camera I don’t care about phone specs. Never felt my Iphone 10, nor the s7 edge it replaced were lacking power for what I do on a phone. Granted it seems like the camera is a step down than most phones it’s price which is a tough pill to swallow.\n\nThe bigger issue is carriers don’t take it and I have great deal with a non-T-Mobile carrier that saves me enough money to stop me from swapping even for a phone I think is really cool like this one.",
          "score": 4,
          "created_utc": 1750871823.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzqm80a",
      "author": "zeknife",
      "body": "How about letting me swap in a headphone jack",
      "score": 25,
      "created_utc": 1750874648.0,
      "replies": [
        {
          "id": "n07xhrm",
          "author": "0dieter0",
          "body": "https://www.berrybase.de/baseus-l41-audio-adapter-usb-c-stecker-3-5-mm-klinke-usb-c-buchse-schwarz?gad_source=1&gad_campaignid=22696911352&gbraid=0AAAAADSQJK44dAQXKk-lxdfFODElcC4b8&gclid=Cj0KCQjwpf7CBhCfARIsANIETVp4paVmej2LHSwl0yfv7Oti7YcIms212XQDWzAzMDswUCKaUAMuGsEaAl6qEALw_wcB",
          "score": 4,
          "created_utc": 1751106743.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mzofgs9",
      "author": "alexanderpas",
      "body": "Sad to see toolless battery swaps go.",
      "score": 30,
      "created_utc": 1750850433.0,
      "replies": [
        {
          "id": "mzokom8",
          "author": "gadao85",
          "body": "This was so convenient when a hard reboot was necessary. This feature was a must-have when looking for a new phone.",
          "score": 18,
          "created_utc": 1750852651.0,
          "replies": [
            {
              "id": "mzpmgou",
              "author": "SouthernTeuchter",
              "body": "Back in the day when I worked for BlackBerry, the battery compartment was deliberately designed so that, when the phone was dropped, the battery panel would fly off and battery would eject.  This helped reduce potential damage to the phone.",
              "score": 18,
              "created_utc": 1750864813.0,
              "replies": [
                {
                  "id": "mzqsots",
                  "author": "ready-redditor-6969",
                  "body": "My suspicion is finally confirmed, thanks!",
                  "score": 6,
                  "created_utc": 1750876481.0,
                  "replies": []
                },
                {
                  "id": "mzsjnfy",
                  "author": "juwanna-blomie",
                  "body": "Man I loved fixing Blackberry’s. Super easy to fix just about anything. Keyboard, trackpad/ball, the screen even. Even the iPhone 3GS wasn’t SUPER difficult to repair/swap the screen and/or difficult. I wasn’t even really good at stuff like that and I learned how to fix almost every Blackberry within about a year of starting.",
                  "score": 5,
                  "created_utc": 1750895415.0,
                  "replies": []
                },
                {
                  "id": "mzq6y3e",
                  "author": "Mistrblank",
                  "body": "Well that explains much.",
                  "score": 3,
                  "created_utc": 1750870518.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mzy9ll4",
      "author": "Kingstad",
      "body": "It looks like a lot of people arent aware that a good chunk of the point of fairphone is that the manufacturing of it is ethical. It will never be able to compete in price with competitors using slave labour and the like",
      "score": 7,
      "created_utc": 1750971342.0,
      "replies": []
    },
    {
      "id": "mzr6l0u",
      "author": "MarinatedPickachu",
      "body": "Isn't it the whole point of the fairphone to not have new versions and instead just replace components? Aside of the concept just not being well suited for mobile phones, why is there even a \"fairphone 6\"?",
      "score": 2,
      "created_utc": 1750880466.0,
      "replies": [
        {
          "id": "mzx8i1e",
          "author": "jcw99",
          "body": "I think you have misunderstood them, they encourage you to not upgrade to the latest generation and repair your phone for as long as practicable but they do not say that that will be forever.\n\nThey do this by keeping several generations of spare parts available and giving 7 years of guaranteed software support (most companies other than Google and apple give 2)\n\n\n However even if you wanted to keep making the same thing forever, the manufacturers of the basic passive components and ICs that go into a phone will also discontinue their production runs meaning that you have to make changes in turn.\n\nAdditionally very few people would a phone that has the specs from 12 years ago. (The age of a Fairphone 1 at this point) So they make a new version every 2 years with some fixes and improvements while still supporting the previous generations for as long as they have spare parts (they still have parts for the V2 on offer)",
          "score": 4,
          "created_utc": 1750960531.0,
          "replies": []
        },
        {
          "id": "mzroqmb",
          "author": "atascon",
          "body": "I've thought about this as well but ultimately if they want to compete at all and use Android, they have to participate in the arms race with other phones. I would agree it is a bit of a contradiction philosophically though.\n\nThere are other 'dumb phones' out there that do this a bit less but they tend to be a bit more limited",
          "score": 1,
          "created_utc": 1750885613.0,
          "replies": []
        },
        {
          "id": "mzt43hg",
          "author": "MetriccStarDestroyer",
          "body": "Ya that was my understanding as well.\n\nI was expecting a frame with upgradeable components.\n\nBut na, it's just for parts replacement. Bruh, I pay technicians either way. \n\nI'm not sacrificing performance for some repairability when other brands are accepting damaged unit trade ins",
          "score": 0,
          "created_utc": 1750902373.0,
          "replies": [
            {
              "id": "mzugh71",
              "author": "your_evil_ex",
              "body": "Seems like a similar situation with framework laptops and fairphone: a device that has repairable parts so that you can use it for decades--except the specs are already underpowered on day one, so by the time you actually need to repair a part, the device will be obsolete and you'll need a new one anywyay",
              "score": 1,
              "created_utc": 1750924060.0,
              "replies": [
                {
                  "id": "mzv9jgo",
                  "author": "Nacho_Dan677",
                  "body": "Expect the difference is that framework standardized the chassis on their laptops. Allowing a user to replace a main card with an upgrade easily. And also even create a mini PC out of the old main board. I thought faiphone was doing something similar, or maybe they are still trying to find a chassis design to settle with.",
                  "score": 3,
                  "created_utc": 1750939205.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mzwrl15",
              "author": "Gambodianistani",
              "body": "Sounds like you're not the target market.",
              "score": 0,
              "created_utc": 1750955876.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n09eus7",
      "author": "Flaurentiu26",
      "body": "It should come with graphene os",
      "score": 1,
      "created_utc": 1751127109.0,
      "replies": []
    },
    {
      "id": "n0iguny",
      "author": "richardanaya",
      "body": "Where do people buy this from the US?",
      "score": 1,
      "created_utc": 1751250846.0,
      "replies": []
    },
    {
      "id": "n031jwl",
      "author": "shalak001",
      "body": "Need tools for replacing a battery?! Wtf fairphone. First the headphone jack, now this. I guess I'm still stuck with XCover :/",
      "score": 1,
      "created_utc": 1751039487.0,
      "replies": []
    }
  ]
}