{
  "post": {
    "title": "US Senators Introduce Bill Mandating Geotracking for High End GPUs",
    "author": "a_Ninja_b0y",
    "id": "1km9jun",
    "score": 263,
    "created_utc": 1747209000.0,
    "selftext": "",
    "num_comments": 64,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1km9jun/us_senators_introduce_bill_mandating_geotracking/"
  },
  "comments": [
    {
      "id": "mscp5az",
      "author": "WelpSigh",
      "body": "It would be trivial to bypass this. Idiotic.",
      "score": 281,
      "created_utc": 1747262319.0,
      "replies": [
        {
          "id": "mscxgr7",
          "author": "redclawx",
          "body": "Firewall if on Ethernet.\n\nMetal roof, faraday cage if the card has a cellular chip.\n\nWallet to not pay for card from OEM that puts this shit into their cards.\n\nEdit: And if this is something that is embedded in the cards, then wouldn’t anybody (other governments, hackers, terrorist) also be able to track these cards? On government owned computers. And target them?",
          "score": 118,
          "created_utc": 1747265148.0,
          "replies": [
            {
              "id": "msetfj0",
              "author": "zekromNLR",
              "body": "Presumably they'd try to require manufacturers to brick the card if the tracking chip can't phone home",
              "score": 24,
              "created_utc": 1747293656.0,
              "replies": [
                {
                  "id": "mshu132",
                  "author": "veerKg_CSS_Geologist",
                  "body": "How do they brick the card if it can't phone home?",
                  "score": 12,
                  "created_utc": 1747334693.0,
                  "replies": [
                    {
                      "id": "msi9mht",
                      "author": "zekromNLR",
                      "body": "Simplest way I could think of doing it is try to phone home when the card is powered on, if that attempt fails the card doesn't turn on\n\nAssuming the tracking module is a fully self-contained unit that only relies on the computer the card is installed in for power.\n\nA somewhat more sophisticated way would store some vital firmware components for the card in the tracking chip, so you cannot just remove or bypass the tracking chip, it has to be functioning for the card to work.",
                      "score": 12,
                      "created_utc": 1747339322.0,
                      "replies": [
                        {
                          "id": "msj0afd",
                          "author": "sshwifty",
                          "body": "Ye ol Autodesk approach",
                          "score": 10,
                          "created_utc": 1747347383.0,
                          "replies": []
                        },
                        {
                          "id": "msko6kh",
                          "author": "CosmicCreeperz",
                          "body": "Yeah that’s likely how it would work which is horrible, as you literally couldn’t use it without an internet connection.\n\nIt’s like fucking Divx all over again.\n\nIt would just be the usual war of VPN workarounds, etc, just like with geo filtered streaming services.",
                          "score": 3,
                          "created_utc": 1747370308.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mseyzpa",
              "author": "ChaZcaTriX",
              "body": "When USA banned the export of cards performing similarly to Nvidia A100 to China, Nvidia made a special version with 1% slower performance.",
              "score": 31,
              "created_utc": 1747297168.0,
              "replies": [
                {
                  "id": "msfrqxn",
                  "author": "101_210",
                  "body": "…and it costed them a lot to develop, then the government ALSO banned the new card. Nvidia were pissed about that",
                  "score": 15,
                  "created_utc": 1747312019.0,
                  "replies": [
                    {
                      "id": "msh2u4l",
                      "author": "pinktieoptional",
                      "body": "Coming from the semiconductors industry it's actually pretty trivial to factory downclock a card. You just create a new product code and force units that would have met the higher product code into the lower product code. Then they get their fuse values updated and wham bam you have a slightly worse card. \n\nGranted I couldn't tell you how much bureaucratic red tape the C suite had to go through to think this was a remotely good idea, but the actual technical implementation would have easily been one two-week sprint. With due diligence of rolling out the change maybe a couple of months but again that's mainly just kind of watching the change propagate to make sure your company's engineers aren't dumb when they tweak one parameter. At least not any dumber than leadership.",
                      "score": 9,
                      "created_utc": 1747326810.0,
                      "replies": [
                        {
                          "id": "msjpwdt",
                          "author": "CoughRock",
                          "body": "so it's just a software downgrade ?",
                          "score": 1,
                          "created_utc": 1747356606.0,
                          "replies": [
                            {
                              "id": "mslak88",
                              "author": "pinktieoptional",
                              "body": "What the other commenter said, but in a more granular way we can also update the fuses that tell the part at a particular frequency what voltage to require. If we wanted to run slower all we do is fool the part into thinking it would need a higher voltage to run then it actually would and you will end up with a new performance ceiling set by your power and temperature limit. That's how one red company does it. Unrelated, that strategy actually comes with the fun implication that if you can cool that part enough it'll just keep climbing up that frequency curve which is why it is so easy and so much fun to do crazy stuff like liquid nitrogen cool parts made by that red company. You can have the fuses do anything you want though. You could literally tell it that no matter how good the cooling and power delivery is Thou Shalt Not run faster than X gigahertz.",
                              "score": 3,
                              "created_utc": 1747383050.0,
                              "replies": []
                            },
                            {
                              "id": "mskochm",
                              "author": "CosmicCreeperz",
                              "body": "No, they can literally burn one time programmable fuses to disable parts of the GPU chip.",
                              "score": 2,
                              "created_utc": 1747370387.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mshu9b7",
                      "author": "veerKg_CSS_Geologist",
                      "body": "No worries, if Nvidia doesn't do it someone else will. That's why Nvidia is doing it.",
                      "score": 1,
                      "created_utc": 1747334762.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "msgtfwq",
              "author": "Crenorz",
              "body": "cards yes - chip no\n\nChina only wants the chip - so total fail.",
              "score": 2,
              "created_utc": 1747324032.0,
              "replies": []
            }
          ]
        },
        {
          "id": "msh4wkq",
          "author": "Festering-Fecal",
          "body": "They are dinosaurs.",
          "score": 3,
          "created_utc": 1747327419.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mscru53",
      "author": "orbix42",
      "body": "Ah, the continuing joys of attempted regulation of tech by people that don't understand tech.",
      "score": 401,
      "created_utc": 1747263230.0,
      "replies": [
        {
          "id": "msd4srg",
          "author": "ProgRockin",
          "body": "Who also purportedly hate regulation and government overreach.",
          "score": 134,
          "created_utc": 1747267685.0,
          "replies": [
            {
              "id": "msfzumu",
              "author": "raccoonbrigade",
              "body": "They only hate it when it doesn't target their enemies",
              "score": 12,
              "created_utc": 1747314942.0,
              "replies": []
            },
            {
              "id": "mseulgf",
              "author": "scotishstriker",
              "body": "You should check out the book Abundance.",
              "score": 9,
              "created_utc": 1747294380.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mshoeu5",
          "author": "TheInfernalVortex",
          "body": "Party of small government and freedoms at work.",
          "score": 6,
          "created_utc": 1747333010.0,
          "replies": []
        },
        {
          "id": "msfn0w3",
          "author": "sgrams04",
          "body": "From the same people who talked openly about war plans in a text thread with a journalist.  ",
          "score": 11,
          "created_utc": 1747310150.0,
          "replies": []
        },
        {
          "id": "msh0dha",
          "author": "InsanityLurking",
          "body": "They don't want ai companies regulated, only the users.",
          "score": 3,
          "created_utc": 1747326073.0,
          "replies": []
        },
        {
          "id": "mscuhod",
          "author": "jawstrock",
          "body": "at least there's an attempt instead of trying to pass laws that nothing can be regulated for 10 years...",
          "score": -37,
          "created_utc": 1747264128.0,
          "replies": [
            {
              "id": "msdoou6",
              "author": "orbix42",
              "body": "Can’t say I agree with you there- both are terrible, and poor attempts to regulate just feed the “all regulations are terrible” assholes.",
              "score": 33,
              "created_utc": 1747274582.0,
              "replies": [
                {
                  "id": "msdq5va",
                  "author": "jawstrock",
                  "body": "Hmmm good point! You won this round for sure! ",
                  "score": -19,
                  "created_utc": 1747275114.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mse02ib",
      "author": "mine248",
      "body": "> US Senator Tom Cotton\n\nThat’s all you need to know. It’s that same guy who called TikTok’s CEO a CCP member when the CEO kept on saying that he’s Singaporean",
      "score": 169,
      "created_utc": 1747278903.0,
      "replies": [
        {
          "id": "mskcqk0",
          "author": "cookerz30",
          "body": "I didn't listen to that whole \"public discourse\" but the Americans looked like fucking dumbasses",
          "score": 9,
          "created_utc": 1747365242.0,
          "replies": []
        },
        {
          "id": "msmg4j9",
          "author": "Brutalcogna",
          "body": "And Hitler wasn’t German. Doesn’t mean shit",
          "score": -9,
          "created_utc": 1747402608.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mscijfz",
      "author": "xondk",
      "body": "How is that going to work? \n\nif they do it through software it can be spoofed in one way or another, even so with hardware, but lets say they use gps, cool, they do know that most datacenters block the gps signal simply by the nature of the kind of building they are?",
      "score": 63,
      "created_utc": 1747260105.0,
      "replies": [
        {
          "id": "mscu6g8",
          "author": "alexforencich",
          "body": "And GPS is not hard to spoof, especially where it's already blocked by the building.",
          "score": 21,
          "created_utc": 1747264021.0,
          "replies": [
            {
              "id": "mscvuh3",
              "author": "xondk",
              "body": "Exactly",
              "score": 4,
              "created_utc": 1747264591.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mskcbsg",
          "author": "PG908",
          "body": "And then the GPU gets powered on and reports it's in china through the great firewall (somehow). Then what?\n\nSend in seal team 6?",
          "score": 3,
          "created_utc": 1747365075.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mscwqu3",
      "author": "redclawx",
      "body": "These are probably the same people that want to outlaw encryption. You know, so they can see everything that you‘re uploading to the cloud, including backups; everything on your phone, etc. That way only the criminals would be using encryption. And then they use encryption to keep their secrets. I guess that makes the politicians criminals? /s kind of",
      "score": 64,
      "created_utc": 1747264899.0,
      "replies": [
        {
          "id": "msefyfp",
          "author": "drfsupercenter",
          "body": "So a different group than the ones wanting to remove regulations on crypto, right?",
          "score": -1,
          "created_utc": 1747286043.0,
          "replies": [
            {
              "id": "msegynv",
              "author": "CondescendingShitbag",
              "body": "What regulations?",
              "score": 12,
              "created_utc": 1747286559.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mseazaj",
      "author": "igby1",
      "body": "Tom Cotton is a MAGA clown",
      "score": 34,
      "created_utc": 1747283630.0,
      "replies": []
    },
    {
      "id": "msdxigm",
      "author": "HowlingWolven",
      "body": "Oh so GPUs just won’t be sold in the US anymore got it",
      "score": 18,
      "created_utc": 1747277875.0,
      "replies": [
        {
          "id": "mse6ymk",
          "author": "Weebber",
          "body": "No no, see there would be SKUs made in the US for twice the cost and sold for 3 times the price, then the exact same (or better) product made and sold as a different SKU in China without the tracking. Freedom and capitalism baby!",
          "score": 21,
          "created_utc": 1747281829.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mseph62",
      "author": "IHateSpamCalls",
      "body": "What a joke \n\n“The RTX 4090 is critical to national security”",
      "score": 8,
      "created_utc": 1747291301.0,
      "replies": [
        {
          "id": "msx9jd2",
          "author": "alidan",
          "body": "given how many are used for ai, yea... I can at least see where they are going with this idea, i'm not calling it good, but I can see where they are going, and with nvidia charging what 2000$ for them and seeing them go for upwards 5000$, I don't really care what they force nvidia to put in there. and scalper who got one now can't offload it as easy without getting a boot up their ass.",
          "score": 1,
          "created_utc": 1747556135.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mscuxw6",
      "author": "ptraugot",
      "body": "Luddites passing laws on tech again. Sigh.",
      "score": 25,
      "created_utc": 1747264281.0,
      "replies": []
    },
    {
      "id": "mseicik",
      "author": "khoavd83",
      "body": "How does this buffoon think it’ll be implemented? Like if the card doesn’t connect to the internet, it won’t work?",
      "score": 12,
      "created_utc": 1747287295.0,
      "replies": [
        {
          "id": "msfpk7h",
          "author": "ralphy1010",
          "body": "Sounds like a solution EA would come up with ",
          "score": 6,
          "created_utc": 1747311176.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msf765z",
      "author": "Vapur9",
      "body": "Search and seizure without probable cause.",
      "score": 8,
      "created_utc": 1747302364.0,
      "replies": []
    },
    {
      "id": "msfhcah",
      "author": "LinoleumFulcrum",
      "body": "“Small government” indeed",
      "score": 5,
      "created_utc": 1747307669.0,
      "replies": []
    },
    {
      "id": "msjbvn8",
      "author": "garry4321",
      "body": "What the fuck are Americans huffing that THESE are supposed to be their brightest people",
      "score": 4,
      "created_utc": 1747351449.0,
      "replies": [
        {
          "id": "mstzr6c",
          "author": "boykinsir",
          "body": "Politicians = smart?  Bwahahaha",
          "score": 1,
          "created_utc": 1747506736.0,
          "replies": []
        }
      ]
    },
    {
      "id": "msdadd4",
      "author": "galloway188",
      "body": "Why?\n\nTrump already gave Qatar high end gpus from nvidia",
      "score": 13,
      "created_utc": 1747269621.0,
      "replies": []
    },
    {
      "id": "msgm3pz",
      "author": "Strongit",
      "body": "Cue bad actors getting into the system and bricking video cards in the US",
      "score": 3,
      "created_utc": 1747321890.0,
      "replies": []
    },
    {
      "id": "msf8xaa",
      "author": "blueB0wser",
      "body": "If a computer is connected to the internet, it can already be geotracked, unless you use a VPN. I don't see why an additional mandate like this would be necessary.\n\nAlso, the GPU isn't the thing to geotrack. That's like geotracking an engine in a sports car.\n\nI traffic the article and it's an anti-China move. Thing is, Taiwan makes the GPUs. They can purchase them much easier than we can, and for cheaper. This is a weird bill.",
      "score": 4,
      "created_utc": 1747303382.0,
      "replies": []
    },
    {
      "id": "msebwzu",
      "author": "ChiAnndego",
      "body": "So like, they want processing centers just popping up like meth labs out in the woods so no one knows who they belong to?  Even if this was technologically feasible to enforce on the chips/processors, it's very stupid.",
      "score": 1,
      "created_utc": 1747284074.0,
      "replies": []
    },
    {
      "id": "msffwow",
      "author": "pcm2a",
      "body": "Y'all don't already put a little rolled up log paper in your graphics card and hide it in the bushes?",
      "score": 1,
      "created_utc": 1747307004.0,
      "replies": []
    },
    {
      "id": "msgtat6",
      "author": "Crenorz",
      "body": "how? what real life magic do they have that can do this?\n\nYou could do this for the WHOLE board - but they only want the chip. As the tracking stuff - requires it's own hardware (more than just a chip) and if you know anything - easy to spot.",
      "score": 1,
      "created_utc": 1747323992.0,
      "replies": []
    },
    {
      "id": "msjg3oh",
      "author": "dark_sylinc",
      "body": "What baffles me is that many components are done in China, some in neighbouring countries.\n\nThey know a lot more than most about how these cards work, making it easy to bypass. It's like asking a thief to install my high security door. I may design the locks, the hinges, everything. I may use encryption and tell him to just blindly build what I tell him.\n\nBut in the end the thief knows more about my door (and the rest of my house) because he's the one who built and installed it.",
      "score": 1,
      "created_utc": 1747352939.0,
      "replies": []
    },
    {
      "id": "msldm7g",
      "author": "getSome010",
      "body": "Coming for all facets of our lives. Even air eventually",
      "score": 1,
      "created_utc": 1747384996.0,
      "replies": []
    },
    {
      "id": "msn0r6r",
      "author": "heickelrrx",
      "body": "American Communist party lmao",
      "score": 1,
      "created_utc": 1747408880.0,
      "replies": []
    },
    {
      "id": "msqd4k9",
      "author": "gumboking",
      "body": "Waste of time. Like trying to stamp out viruses.",
      "score": 1,
      "created_utc": 1747448786.0,
      "replies": []
    },
    {
      "id": "msvz62c",
      "author": "Peter_Nincompoop",
      "body": "Highlight the invasiveness of government overreach, but chastise any effort to reduce the size of government and how invasive it is.",
      "score": 1,
      "created_utc": 1747532324.0,
      "replies": []
    },
    {
      "id": "msfwf6d",
      "author": "soundman32",
      "body": "This month's 'high end GPU' will only be able to run GTA6 at 10 FPS when it comes out.",
      "score": 0,
      "created_utc": 1747313743.0,
      "replies": []
    },
    {
      "id": "mseqmql",
      "author": "im_thatoneguy",
      "body": "This wouldn’t be simple but it also wouldn’t be impossible.\n\nYou would have to have something like an NTP server on site with a gps antenna. These are already sold to data centers to use gnss for time keeping/NTP. You run an antenna to the roof. \n\nYou would also need a Secure Enclave on the GPU. Again, difficult but not impossible. Apple does it all the time. Then you would need an NTP server with encryption of some kind to confirm it’s a legitimate Nvidia positioning server and all of the GPUs would sync up like once a week.  Relaying would be impossible based on speed of light and encryption. \n\nIt would inevitably be cracked but by then the chips would be obsolete. Is it a good idea? 🤷‍♂️ But it is technically possible.",
      "score": -1,
      "created_utc": 1747291977.0,
      "replies": []
    },
    {
      "id": "mscxm9e",
      "author": "HWTseng",
      "body": "Might work, depends on the manufacturing process, if they come out in batches right? Nobody gives a shit about people smuggling 5090 to play video games, but GPU user by AI is probably what this bill wants to target. Sure individually they can spoof a chip here and there, but if a couple of chips out of a batch shows up where they shouldn’t be, they have an indicator to start investigating and physically locate those chips",
      "score": -15,
      "created_utc": 1747265200.0,
      "replies": []
    }
  ]
}