{
  "post": {
    "title": "Nintendo Switch 2 pre-orders start April 24th and the price will not increase | The company delayed its original preorder date in the US.",
    "author": "chrisdh79",
    "id": "1k24mio",
    "score": 2231,
    "created_utc": 1744982008.0,
    "selftext": "",
    "num_comments": 317,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1k24mio/nintendo_switch_2_preorders_start_april_24th_and/"
  },
  "comments": [
    {
      "id": "mnr75eg",
      "author": "tyderian",
      "body": "Burying the lede by not pointing out that the price of accessories *will* increase.",
      "score": 743,
      "created_utc": 1744982647.0,
      "replies": [
        {
          "id": "mnrax1w",
          "author": "shifty_coder",
          "body": "Not surprised. The assumption is that part of their updating pricing strategy includes less revenue for each console sold, to maintain the originally promised MSRP, and hit their forecasted sales targets. They then try to spread that loss across their entire accessory line.",
          "score": 259,
          "created_utc": 1744983938.0,
          "replies": [
            {
              "id": "mnrf7az",
              "author": "BigCommieMachine",
              "body": "My guess is that the Mario Kart Bundle was created to cushion the blow of tariffs because they will say the $500 bundle includes $80 of software, which wouldn’t  face such tariffs.",
              "score": 112,
              "created_utc": 1744985343.0,
              "replies": [
                {
                  "id": "mnrr20w",
                  "author": "akibaboy65",
                  "body": "True. Also, Nintendo already launches brand new games day 1 at a ~$20 discount via the voucher, meaning their studios are managed and budgeted in a way that a $50 price tag at game’s launch is viable and profitable for all of their models… so it’s not like there’s an inherent need for Mario Kart or anything to be $80 other than just pricing elasticity.",
                  "score": 32,
                  "created_utc": 1744988973.0,
                  "replies": [
                    {
                      "id": "mns4wq0",
                      "author": "BloodandThunder98",
                      "body": "Voucher can't be used for Switch 2 exclusives last time I checked.",
                      "score": 20,
                      "created_utc": 1744993136.0,
                      "replies": [
                        {
                          "id": "mns656v",
                          "author": "akibaboy65",
                          "body": "Right. I’m just saying that Nintendo’s studios for years have been set up in a way that they can immediately discount games without any downside, otherwise they wouldn’t do it. I’d wager Mario Kart packed in at $50 is just to try and move consoles as much as possible and not due to any shenanigans with tariffs.",
                          "score": -7,
                          "created_utc": 1744993516.0,
                          "replies": [
                            {
                              "id": "mns9t2l",
                              "author": "nicholasjfury",
                              "body": "My point is nintendo does not really make less money via the voucher program because it cuts out the physical retailer, distribution and manufacturing out. Now why do gaming companies not just lower the price on all digital games is another discussion with a factor of greed and also not pissing off retail partners",
                              "score": 4,
                              "created_utc": 1744994625.0,
                              "replies": [
                                {
                                  "id": "mnvmvls",
                                  "author": "darkmacgf",
                                  "body": "Nintendo made all Wii U digital games 10% off for its first year of release. Short-lived but nice.",
                                  "score": 2,
                                  "created_utc": 1745037059.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mns0hxl",
                      "author": "nicholasjfury",
                      "body": "So the voucher is $99.99 for 2 games so it's $10 discount per game with the exception of tears of the kingdom. Plus, you need NSO  And it's digital only. I would wager that retail partners get ~8 to 12 dollars on a $60 game as their mark up not counting manufacturing cost, And switch cartridges cost more to manufacturer then disc games. I am also thinking nintendo raises the price $10 for games above 16GB that need the 32GB card because that is the real common factor between tears of the kingdom and Mario kart world. On switch there were only 4 games released on 32gb carts, Tears of the kingdom, Witcher 3, Final X/X2 (asia only), and dragon quest builders (Japan only). I would not be surprised if going up to 32gb adds another $3 to $5 ontop of the cost of the 8gb and 16gb carts nintendo normally used. And 3rd parties maybe just eat it because porting games like the Witcher 3 and Cyberpunk 2077 cost far less than developing new games for nintendo switch/switch 2.",
                      "score": 10,
                      "created_utc": 1744991790.0,
                      "replies": [
                        {
                          "id": "mns7690",
                          "author": "akibaboy65",
                          "body": "Yes. Bottom line is that Nintendo can sell their brand new games for $50 a piece on launch day and they aren’t folding studios and sending devs packing like their competitors - meaning their devs and budget are managed in a way that $50 games is a viable price point. I’m not complaining that they’re $60/70/80 (well, kinda on that last one), I’m saying that the grounds that they have to do pack ins and reductions due to tariff shenanigans probably isn’t the case. It’s likely just to move product and post sales, just like the purpose of the voucher is - get you to buy two games instead of one, even if you woulda bought both at $60-70 anyway.",
                          "score": 6,
                          "created_utc": 1744993831.0,
                          "replies": [
                            {
                              "id": "mnsl1my",
                              "author": "stellvia2016",
                              "body": "It's more nuanced than that: They expect a certain amount of the overall sales of those games to happen on launch day/week, but given the Switch1 sold 150M units, their games have a long tail of sales, so that isn't likely to be the lion's share of those games sales.\n\nThey almost certainly wouldn't take a $50 pricepoint for 100% of the sales of those games.",
                              "score": 2,
                              "created_utc": 1744997923.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mns967w",
                      "author": "PM_artsy_fartsy_nude",
                      "body": "$80 is for the physical copy. The vouchers just give you downloads which are console-locked and can't be resold.\n\nPhysical cartridges also cost money (it used to be a considerable amount of money, depending on the size of the ROM chip), and are subject to tariffs. \n\nThere's another reason, and that is simply that if you adjust for inflation Nintendo games have been consistently around $80 for roughly the last two decades. I imagine they just like that price point.",
                      "score": 1,
                      "created_utc": 1744994435.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mnsduv7",
                  "author": "dommmm9",
                  "body": "It was already created before tarriffs were in place lol",
                  "score": 1,
                  "created_utc": 1744995822.0,
                  "replies": [
                    {
                      "id": "mnsgvzf",
                      "author": "BigCommieMachine",
                      "body": "Software is different because every game is developed under multinational teams. Nintendo will just publish Mario Kart World under Nintendo Of America and they are gold.",
                      "score": 1,
                      "created_utc": 1744996712.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mnu5ufc",
                  "author": "adrian783",
                  "body": "mk bundle was announced on the same day as liberation day... so no.",
                  "score": 1,
                  "created_utc": 1745016152.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnrgazy",
              "author": "Jarsky2",
              "body": "Which honestly is probably the best way they could go about it.\n\nEdit: People downvoting me, you realize Nintendo is going to recoup the costs somehow right? Would you rather they have made the console or the games even more expensive?",
              "score": 30,
              "created_utc": 1744985696.0,
              "replies": [
                {
                  "id": "mnrkr19",
                  "author": "NuPNua",
                  "body": "Not being American, I did kind of want to see that to give the US a sharp shock lesson about their electoral decision.",
                  "score": 12,
                  "created_utc": 1744987079.0,
                  "replies": [
                    {
                      "id": "mnrpqdk",
                      "author": "heebeejeebeest",
                      "body": "Gonna go out on a limb and say anyone who voted for the current circus doesn’t play Nintendo games, read, or have the mental capacity for learning",
                      "score": 27,
                      "created_utc": 1744988579.0,
                      "replies": [
                        {
                          "id": "mnruoec",
                          "author": "germanthoughts",
                          "body": "I thibk you underestimate how many people voted for Trump. I bet there’s a ton of Nintendo players in there.",
                          "score": 26,
                          "created_utc": 1744990053.0,
                          "replies": []
                        },
                        {
                          "id": "mnrxhb1",
                          "author": "illegalcupcakes16",
                          "body": "Most Nintendo folks I know love Luigi and also love Luigi.",
                          "score": 13,
                          "created_utc": 1744990888.0,
                          "replies": [
                            {
                              "id": "mnt8txy",
                              "author": "whut-whut",
                              "body": "You'd be surprised how many Trumpers think that he's anti-corporation and how all his policy decisions so far are for the little guy.",
                              "score": 2,
                              "created_utc": 1745005264.0,
                              "replies": [
                                {
                                  "id": "mnue7hn",
                                  "author": "vc6vWHzrHvb2PY2LyP6b",
                                  "body": "It's because he takes just about every position imaginable on every issue before doing the shittiest one.\n\nHe'll say 10 different things so that 10 different audiences hear what they want to hear from him.",
                                  "score": 5,
                                  "created_utc": 1745019152.0,
                                  "replies": []
                                },
                                {
                                  "id": "mo0vhu2",
                                  "author": "lkn240",
                                  "body": "That's because they are fucking stupid",
                                  "score": 3,
                                  "created_utc": 1745113160.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mnrtonz",
                          "author": "Black_Metallic",
                          "body": "Was going to say that I was sure there were Nintendo players in that group, but those people would still be covered by your other two categories.",
                          "score": 2,
                          "created_utc": 1744989758.0,
                          "replies": []
                        },
                        {
                          "id": "mnt33om",
                          "author": "thatdudewithknees",
                          "body": "The young white male demographic? Are you sure about that?",
                          "score": 1,
                          "created_utc": 1745003428.0,
                          "replies": []
                        },
                        {
                          "id": "mnvwyzh",
                          "author": "Lied-",
                          "body": "Unfortunately I know quite a handful of PHDs and businessmen from Cambridge / Penn who very much do support Trump because it benefits them directly.",
                          "score": 1,
                          "created_utc": 1745042496.0,
                          "replies": []
                        },
                        {
                          "id": "mns6sgy",
                          "author": "ProfessorPetrus",
                          "body": "This is out of touch. So many Americans are out of touch with each other. There should be more discourse and less insults. From both sides.",
                          "score": -8,
                          "created_utc": 1744993713.0,
                          "replies": [
                            {
                              "id": "mntax8f",
                              "author": "heebeejeebeest",
                              "body": "The president is currently tanking the economy, again, dissolving longstanding and honored ties with allies, and his supporters are cheering him on. All while they hurl insults and act like libs are mentally ill for supporting basic human decency and being upset that he’s throwing this country in the trash in every imaginable way from the economy to education to health standards. Those aren’t insults, those are facts. I know his supporters find both of those things equally scary. I stand by the fact that they either: cannot learn, can’t read, and/or think playing games is for the devil",
                              "score": 3,
                              "created_utc": 1745005933.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mnrkz2q",
                      "author": "Jarsky2",
                      "body": "Eh well, as an American who voted against you-know-who, fair enough.",
                      "score": 2,
                      "created_utc": 1744987148.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mnvcs3e",
                  "author": "M-Noremac",
                  "body": "No, let's blame Nintendo, not the clown that's pulling all the tarrif bullshit...",
                  "score": 2,
                  "created_utc": 1745032451.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnrbcuq",
          "author": "LongBeakedSnipe",
          "body": "I mean hardly, that isn’t headline worthy compared with what was posted",
          "score": 52,
          "created_utc": 1744984083.0,
          "replies": [
            {
              "id": "mnstiwo",
              "author": "RhythmRobber",
              "body": "It is when you consider you only buy a console once, and accessories and everything else you buy many times over the next several years. Raising prices on accessories is going to hurt worse",
              "score": -5,
              "created_utc": 1745000458.0,
              "replies": [
                {
                  "id": "mnsznul",
                  "author": "LongBeakedSnipe",
                  "body": "Please don’t apply for chief headline writer at the newspaper factory",
                  "score": 6,
                  "created_utc": 1745002346.0,
                  "replies": [
                    {
                      "id": "mnt1hbt",
                      "author": "RhythmRobber",
                      "body": "Why would I? I make more as a data analyst, and in my job there is pride in presenting the complete picture of a situation, not cherry picking details to frame something more positively and maximize engagement.",
                      "score": -3,
                      "created_utc": 1745002911.0,
                      "replies": [
                        {
                          "id": "mnt8ehc",
                          "author": "LongBeakedSnipe",
                          "body": "Okay, you continue taking pride in being an extremely dense nobody who blurts out information that nobody asked for. \n\nEdit: cant see your reply and cant reply in this chain any more. Reply and block?\n\nEdit 2: this is some stalker level BS",
                          "score": 1,
                          "created_utc": 1745005125.0,
                          "replies": [
                            {
                              "id": "mntf3ym",
                              "author": "RhythmRobber",
                              "body": "Nope. Are you used to getting blocked for saying stupid shit? Or are you just trying to gaslight other people into thinking I blocked you? Either way... very pathetic. And hilarious that I got under your skin enough to be so bothered by a reddit glitch. Just sad.",
                              "score": 2,
                              "created_utc": 1745007260.0,
                              "replies": []
                            },
                            {
                              "id": "mntgmc6",
                              "author": "RhythmRobber",
                              "body": "Lol - \"coincidence\" huh? Thinking I unblocked you to reply? How absolutely insecure and pathetic. I'll prove it by blocking you now, something I COULDN'T do if I have just unblocked you. Bye Felicia",
                              "score": 1,
                              "created_utc": 1745007733.0,
                              "replies": []
                            },
                            {
                              "id": "mnt93ls",
                              "author": "RhythmRobber",
                              "body": "It was a direct reply to what *you said*, stupid, so you *literally asked for it*, lol. Clearly you're the dense one... or maybe you just don't know what the word means 🤔 I don't want to rule out any possibilities with you!\n\nAnd pride in my job is enough for me, thanks.",
                              "score": 0,
                              "created_utc": 1745005351.0,
                              "replies": [
                                {
                                  "id": "mntb4vd",
                                  "author": "TotoCocoAndBeaks",
                                  "body": "You boasted about earning more than a joke job in a joke comment.\n\nJust mull on that",
                                  "score": -1,
                                  "created_utc": 1745006002.0,
                                  "replies": [
                                    {
                                      "id": "mntdut9",
                                      "author": "RhythmRobber",
                                      "body": "Nah, the original comment was about how the headline didn't mention the important info that accessories weren't going up. Then he replied - seriously - that that isn't headline worthy. To which I replied - seriously - that it definitely was because it will have a greater impact. Then he replied - *stupidly -* with a bad joke insult, to which I simply shut him down hard by making his joke insult pointless by mentioning my job that values not cherry-picking details and reporting everything, unbiased. Mentioning my success was just to further shut down his pointless response.\n\nIf any of that bothered you enough to step in and take a side, then that weakness is something for you to deal with.",
                                      "score": 2,
                                      "created_utc": 1745006865.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mnrkeec",
          "author": "gman5852",
          "body": "No the main console and games are the lead. The extra controllers, while unfortunate, is not the most important bit of news.",
          "score": 21,
          "created_utc": 1744986971.0,
          "replies": []
        },
        {
          "id": "mnssimx",
          "author": "gramathy",
          "body": "If the regular switch 1 third party controllers still work, demand for the new accessories is going to be super low.",
          "score": 4,
          "created_utc": 1745000149.0,
          "replies": []
        },
        {
          "id": "mnrfnyx",
          "author": "texachusetts",
          "body": "How are digital purchases (apps and games) handled in terms of tariffs?",
          "score": 2,
          "created_utc": 1744985491.0,
          "replies": [
            {
              "id": "mnrh0h0",
              "author": "xyzqsrbo",
              "body": "digital purchases are currently not subject to tarrifs.",
              "score": 16,
              "created_utc": 1744985918.0,
              "replies": [
                {
                  "id": "mnssp7v",
                  "author": "gramathy",
                  "body": "Neither are service agreements (support) which is a large part of the US tech industry, which makes the trade imbalance seem much bigger than it actually is.",
                  "score": 2,
                  "created_utc": 1745000206.0,
                  "replies": []
                },
                {
                  "id": "mo5esrr",
                  "author": "Aleashed",
                  "body": "Shhh 🤫\n\nDon’t let them find out",
                  "score": 1,
                  "created_utc": 1745182254.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnsffgp",
          "author": "AintNobody-",
          "body": "Not by much but it still hurts. Nearly a hundred bucks for joy cons. Jeeze Louise.",
          "score": 1,
          "created_utc": 1744996285.0,
          "replies": []
        },
        {
          "id": "mnvqn79",
          "author": "None",
          "body": "This feels like a reasonable thing to do tbh",
          "score": 1,
          "created_utc": 1745038999.0,
          "replies": []
        },
        {
          "id": "mnyp5yr",
          "author": "Salty_Injury66",
          "body": "Yup. +$5 on everything besides the console & games",
          "score": 1,
          "created_utc": 1745086026.0,
          "replies": []
        },
        {
          "id": "mo6eym3",
          "author": "Gravelayer",
          "body": "Obligitory Fuck Nintendo",
          "score": 1,
          "created_utc": 1745195154.0,
          "replies": []
        },
        {
          "id": "mnxegtb",
          "author": "UrDeAdPuPpYbOnEr",
          "body": "What does “accessories” mean? Is it going iPhone and leaving out some essentials that it used to or should come with? I have two switches and I’ve never bought any accessories I don’t think?",
          "score": 1,
          "created_utc": 1745071113.0,
          "replies": []
        },
        {
          "id": "mnrbzcd",
          "author": "None",
          "body": "[deleted]",
          "score": -10,
          "created_utc": 1744984289.0,
          "replies": [
            {
              "id": "mns0xz1",
              "author": "IceSeeYou",
              "body": "Google \"burying the lede\" and get back to us",
              "score": 4,
              "created_utc": 1744991924.0,
              "replies": []
            },
            {
              "id": "mnrd5ws",
              "author": "Waterfish3333",
              "body": "Burying the lede is a common phrase meaning the most important / interesting part of an article isn’t in the headline.",
              "score": 13,
              "created_utc": 1744984677.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnu0ity",
          "author": "Jiangcool9",
          "body": "Sacrifice has to be made, and I’m glad it’s the accessories not the console",
          "score": 0,
          "created_utc": 1745014243.0,
          "replies": []
        },
        {
          "id": "mnvh8o4",
          "author": "Agent101g",
          "body": "As long as the new joy cons no longer need to be replaced every 8 months i'm fine paying more",
          "score": 0,
          "created_utc": 1745034432.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnsfnth",
      "author": "mgd09292007",
      "body": "“Don’t worry we will be able to get cheaper accessories from Amazon…oh wait”",
      "score": 17,
      "created_utc": 1744996353.0,
      "replies": []
    },
    {
      "id": "mnvvlw6",
      "author": "Whit3boy316",
      "body": "INCREASE THE PRICE!",
      "score": 9,
      "created_utc": 1745041724.0,
      "replies": [
        {
          "id": "mo3n4l0",
          "author": "Tryotrix",
          "body": "All the Dollars to our Entertainment Bros",
          "score": 1,
          "created_utc": 1745161668.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnrmcm1",
      "author": "tyderian",
      "body": "I got to see the console and play several games at a preview event over the weekend. I was pretty impressed, especially by the 1st party games. But not $500 impressed.",
      "score": 117,
      "created_utc": 1744987567.0,
      "replies": [
        {
          "id": "mntjtz4",
          "author": "TheGreatBenjie",
          "body": "Its the price of a modern console, not sure what you're expecting.",
          "score": 33,
          "created_utc": 1745008742.0,
          "replies": [
            {
              "id": "mntli4c",
              "author": "chronoswing",
              "body": "Try last gen console. You can't compare the switch 2 to a PS5.\n\nEdit: I would like to clarify I meant hardware wise it doesn't compete with current gen consoles. The price is right, though, if you look at comparable handheld APU systems that are currently on the market like the Steam Deck, although you are locked into Nintendos ecosystem.",
              "score": -20,
              "created_utc": 1745009270.0,
              "replies": [
                {
                  "id": "mntmh9e",
                  "author": "midsummernightstoker",
                  "body": "You're right. The PS5 needs a TV and an outlet to work. Doesn't come close to competing with a Switch.",
                  "score": 28,
                  "created_utc": 1745009575.0,
                  "replies": [
                    {
                      "id": "mnv4w60",
                      "author": "Mindereak",
                      "body": "The PS5 also came out 5 years ago.",
                      "score": 7,
                      "created_utc": 1745029187.0,
                      "replies": [
                        {
                          "id": "moaeaby",
                          "author": "midsummernightstoker",
                          "body": "And it can't compete with a Switch 1 which came out 8 years ago",
                          "score": 1,
                          "created_utc": 1745256840.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mnu1j5g",
                      "author": "chronoswing",
                      "body": "I was talking hardware. Pricewise, I think it's fine, comparable to other handheld PCs that are on the market right now.",
                      "score": -9,
                      "created_utc": 1745014602.0,
                      "replies": [
                        {
                          "id": "mnudfgw",
                          "author": "Xylamyla",
                          "body": "You’re talking power, not hardware. The Switch’s hardware allows it to be a hybrid console that can switch between TV play and handheld play, a feature which is completely absent in competing consoles. It’s the entire reason why the Switch is as popular as it is.\n\nIf all you care about is power, then yeah a Switch is a bad buy (so is a PS5). Clearly, many people do not place power as the only important factor.",
                          "score": 11,
                          "created_utc": 1745018873.0,
                          "replies": [
                            {
                              "id": "mnwba06",
                              "author": "None",
                              "body": "[deleted]",
                              "score": -1,
                              "created_utc": 1745051256.0,
                              "replies": [
                                {
                                  "id": "mnwne0n",
                                  "author": "Murtomies",
                                  "body": "My dude, it's way more complicated than that. PCs have more flexibility and upgradeability, cheaper games, a bigger library of available games and free online play. Playstation needs PS+ for online play. \n\nPCs can do countless other tasks too. If you were to compare with equivalent ability, you should add *at least* a cheap laptop's cost on the PS5 side. If you do productivity tasks as well, now you need a console *and* a powerful PC or Mac. And just building one powerful PC is WAAY cheaper.\n\nPCs can be upgraded down the line with significant savings, because you can upgrade for example only the CPU and/or the GPU, and keep everything else. With consoles you have to sell the whole unit at a massive loss and buy a whole new unit of the new generation. And this most likely includes all the peripherals as well. And also backwards compatibility eith games is not guaranteed. Only *most* of the PS4 games work with PS5, not all.\n\nPS5 itself is a loss leader, sold at a loss to gain profits with PS+, peripherals and overpriced games. So comparing a loss leader without the profit products against a group of products (PC components) that are all priced to generate profit, is definitely not fair. Especially because most buyers of the PS5 *will* buy those other things too. That's why I'd say it's fair to use the 2nd hand PC component prices to compare the two. But I'd go as far that the price to beat should include at least like 4 years of PS+.\n\nSo yeah, I'd say the bang for buck king is PC in the long run, when you account for everything.",
                                  "score": 3,
                                  "created_utc": 1745059002.0,
                                  "replies": [
                                    {
                                      "id": "mnx8sdw",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": -4,
                                      "created_utc": 1745069014.0,
                                      "replies": [
                                        {
                                          "id": "mnxig1h",
                                          "author": "Murtomies",
                                          "body": "Haha lmao [this is you](https://giphy.com/gifs/dumb-and-dumber-cover-ears-2dcW1Dlu2sZnW). You must be fun at parties \"I'm not listening to you, I'm right you're wrong conversation over\"\n\nYou can ignore facts all you want but it doesn't make your statement true.",
                                          "score": 2,
                                          "created_utc": 1745072488.0,
                                          "replies": [
                                            {
                                              "id": "mnxipis",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": -1,
                                              "created_utc": 1745072574.0,
                                              "replies": [
                                                {
                                                  "id": "mny0nzs",
                                                  "author": "Murtomies",
                                                  "body": "What are you talking about? [They did match it.](https://youtu.be/T4xAQGwpO10?si=FFST4WbDOHaYd0kV) And that's not even taking into account the points in my earlier comment. If they did, PC would obliterate the PS5 in cost to performance.",
                                                  "score": 2,
                                                  "created_utc": 1745078350.0,
                                                  "replies": [
                                                    {
                                                      "id": "mny1igd",
                                                      "author": "None",
                                                      "body": "[deleted]",
                                                      "score": 1,
                                                      "created_utc": 1745078623.0,
                                                      "replies": [
                                                        {
                                                          "id": "mny9zhe",
                                                          "author": "Murtomies",
                                                          "body": "Pretty useless to have this conversation if you just refuse to read any counterpoints and reinstate your opinions again and again. I don't think reddit is a suitable platform for you.",
                                                          "score": 2,
                                                          "created_utc": 1745081325.0,
                                                          "replies": [
                                                            {
                                                              "id": "mnyey1y",
                                                              "author": "None",
                                                              "body": "[deleted]",
                                                              "score": 0,
                                                              "created_utc": 1745082887.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mnyoem2",
                                                                  "author": "Murtomies",
                                                                  "body": "-said every flat earther, conspiracy theorist, maga cultist and religious extremist in the world. Literally one of the dumbest sentences a person can say. You have an opinion, that does not make it fact, especially when the issue is not black and white like that.",
                                                                  "score": 2,
                                                                  "created_utc": 1745085790.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mnyovs3",
                                                                      "author": "None",
                                                                      "body": "[deleted]",
                                                                      "score": 1,
                                                                      "created_utc": 1745085938.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mnz4id4",
                                                                          "author": "Murtomies",
                                                                          "body": "Doesn't sound like it. I think you gotta check your attitude. Bye",
                                                                          "score": 1,
                                                                          "created_utc": 1745091055.0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mntoahg",
                  "author": "TheGreatBenjie",
                  "body": "Actually I can. Pretty easily.",
                  "score": 8,
                  "created_utc": 1745010148.0,
                  "replies": [
                    {
                      "id": "mntp9yw",
                      "author": "OldeArrogantBastard",
                      "body": "Every generation there’s always complaints about pricing of things and yet those things sell in record numbers. \n\nLike the complaint of the games being $80 now whereas  they’ve been $50 since the 1990s, when in today’s dollars that would be about $95.",
                      "score": 0,
                      "created_utc": 1745010463.0,
                      "replies": []
                    },
                    {
                      "id": "mnu1chc",
                      "author": "chronoswing",
                      "body": "Hardware wise, you certainly cannot. It's more on par with a ps4. I don't really see a problem with the price, though. It's comparable to a steam deck (minus the pc features) in price and power.",
                      "score": -7,
                      "created_utc": 1745014536.0,
                      "replies": [
                        {
                          "id": "mnu3394",
                          "author": "TheGreatBenjie",
                          "body": "It runs Cyberpunk. Ps4 couldn't. That's enough for me.",
                          "score": 4,
                          "created_utc": 1745015162.0,
                          "replies": [
                            {
                              "id": "mnu8n2g",
                              "author": "chronoswing",
                              "body": "Thats just an outright lie though. Cyberpunk was on PS4.",
                              "score": 0,
                              "created_utc": 1745017160.0,
                              "replies": [
                                {
                                  "id": "mnu8svv",
                                  "author": "TheGreatBenjie",
                                  "body": "And it ran so bad it was removed from the store and never got the DLC...just gonna pretend that didn't happen?",
                                  "score": 5,
                                  "created_utc": 1745017216.0,
                                  "replies": [
                                    {
                                      "id": "mnupdzj",
                                      "author": "chronoswing",
                                      "body": "No, because after updates, it was playable. Either way, you claimed the PS4 couldn't play cyberpunk when it clearly can.",
                                      "score": 1,
                                      "created_utc": 1745023283.0,
                                      "replies": [
                                        {
                                          "id": "mnuso4m",
                                          "author": "TheGreatBenjie",
                                          "body": "It literally forced Sony to change their refund policy. They literally had to warn people not to buy it for base PS4. Also again it never got the DLC, because it could not handle it.\n\nIt's a Switch 2 launch title, all on the cartridge, with the DLC.\n\nThey are not the same.",
                                          "score": 3,
                                          "created_utc": 1745024530.0,
                                          "replies": [
                                            {
                                              "id": "mnuwqms",
                                              "author": "chronoswing",
                                              "body": "I didn't say they were, just refuting your lie that the PS4 can't play Cyberpunk. Plenty of people on /r/cyberpunk2077 who have put 100s of hours into the PS4 version. Don't expect the switch 2 to run it well either. 30-40fps in handheld mode is all you are gonna get. I can get that on my Steam Deck, and it's 3 years old. The switch 2 running cyberpunk isn't even impressive.",
                                              "score": -1,
                                              "created_utc": 1745026080.0,
                                              "replies": [
                                                {
                                                  "id": "mnuxwlz",
                                                  "author": "TheGreatBenjie",
                                                  "body": "People bought it and dealt with it sure, but when Sony needs to warn people not to buy it if they're just on base PS4 (which is what you claimed the Switch 2 should be compared to) then I think it's safe to say it can't run it, or at the very least it's not recommended.\n\nI guarantee most of the people on that sub would say the same, even the ones stubborn enough to keep playing themselves.\n\nYes quality mode is 30fps and performance mode is 40fps, but the base ps4 struggled to maintain 30 full stop and that's not even considering the DLC which is known to be more performance intensive.",
                                                  "score": 1,
                                                  "created_utc": 1745026516.0,
                                                  "replies": [
                                                    {
                                                      "id": "mnvzjw3",
                                                      "author": "420gamingpotato69",
                                                      "body": "It ran poorly because the game was seriously half baked for the first couple years (and stopped being updated in that said time). Now it's way more optimized, so making the switch 2 version run better than a two and a half year old ps4 port is obviously a given.",
                                                      "score": 0,
                                                      "created_utc": 1745044013.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnzxd83",
                  "author": "Pezotecom",
                  "body": "'hardware wise' is not nearly 10% of this product (or any gaming console for that matter)",
                  "score": 2,
                  "created_utc": 1745100808.0,
                  "replies": [
                    {
                      "id": "mo0bya9",
                      "author": "chronoswing",
                      "body": "So I'm paying $500 to be locked into Nintendos ecosystem? I swear Nintendo fan boys are as bad as Apple.",
                      "score": 2,
                      "created_utc": 1745105900.0,
                      "replies": [
                        {
                          "id": "mo0fyje",
                          "author": "Pezotecom",
                          "body": "I don't know what to say to you. Do you not understand why people pay the $500, or do you want me to convince you? I am not nintendo, if they didn't convince you bad for then ig.    \n\nI think it's pretty obvious why people buy nintendo, and that doesn't make them dumbasses as you think lol",
                          "score": 1,
                          "created_utc": 1745107342.0,
                          "replies": [
                            {
                              "id": "mo118nl",
                              "author": "chronoswing",
                              "body": "I never said buying Nintendo makes someone a dumbass. It’s the blind loyalty that does it, people who can’t admit when the company drops the ball. Nintendo’s been coasting on nostalgia and goodwill for years. The Switch 2 is already raising red flags: sticking with outdated tech, no sign they’re improving their online service or account system, and $80 games. But somehow, they keep getting a pass. It’s that refusal to call out obvious flaws that I’m talking about, same cult-like energy as Apple fanboys.",
                              "score": 1,
                              "created_utc": 1745115329.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mnr994y",
      "author": "theajharrison",
      "body": "$15 bucks for basic joycon straps???\n\nI suppose I shouldn't be surprised by a company thats now trying to charge $10 for a hardware tutorial \"game\" that should be a free pack-in. \n\nPeople saying all these prices make sense because inflation vs 1990s. \n\nBut watch when Nintendo hits record profits this year. It won't be because of *inflation* it'll be because of greedy pricing.",
      "score": 147,
      "created_utc": 1744983373.0,
      "replies": [
        {
          "id": "mnrdmfm",
          "author": "weeklygamingrecap",
          "body": "It was weird how they announced that the Welcome Tour is a paid game? Like the tutorial for your system costs extra?",
          "score": 62,
          "created_utc": 1744984827.0,
          "replies": [
            {
              "id": "mnroano",
              "author": "TheOtherWhiteCastle",
              "body": "To be fair, I don’t think it’s truly meant to be a “tutorial” for the console, as much as it is the tech demo game showing what the Switch 2 can do. Think Wii Sports, Nintendo land, 1-2 Switch, Astro’s Playroom, etc. Definitely should’ve still come bundled with the system (Nintendo is crazy if they think most people will pay money for that tiny-ass game, even at 10 bucks), but I think the intention is more to provide a gameplay experience that couldn’t be done on the previous system, rather than be a legitimate user guide.",
              "score": 12,
              "created_utc": 1744988150.0,
              "replies": [
                {
                  "id": "mnrr53p",
                  "author": "mhardegree",
                  "body": "It seems like everyone forgot 1-2 Switch cost $50 at launch. It definitely should’ve been a pack in as well. I never played it for that reason. Definitely wont be picking up a switch 2 for $500. Maybe i can get a used or discounted one in a couple years if they have enough games to make it worth it to me.",
                  "score": 11,
                  "created_utc": 1744988998.0,
                  "replies": []
                },
                {
                  "id": "mnsukhd",
                  "author": "Jaerba",
                  "body": "This is what I thought at first.  1-2 Switch seemed like a good comparison. \n\n\nBut what they've shown is absolutely bare bones and looks like a tutorial. \n\n\nThey showed the player character walking around an over world and pressing button prompts at signs that just show text bubbles.  The minigames weren't even games.\n\n\nI equate it to the loading screen in Assassin's Creed Shadows.  Just because it lets you run around on a black background doesn't make it a minigame.  ",
                  "score": 3,
                  "created_utc": 1745000776.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnrdagh",
          "author": "hatramroany",
          "body": "> $15 bucks for basic joycon straps???\n\nI’m surprised they’re even selling them. They’re included with the console and with extra joycons, I guess the Switch 1 versions sold enough.",
          "score": 21,
          "created_utc": 1744984719.0,
          "replies": [
            {
              "id": "mnrftts",
              "author": "theajharrison",
              "body": "But these are a different contact mechanism. \n\nThose old straps are compatible. \n\nIf you want straps now, you gotta fork out more money",
              "score": -15,
              "created_utc": 1744985543.0,
              "replies": [
                {
                  "id": "mnrgjyg",
                  "author": "hatramroany",
                  "body": "Not really sure what you’re trying to say? The new Switch 2 console will come with the new straps for its new Joy Cons and the new sold separately Joy Cons will also come with the new straps. The individual ones are just extras if you lose or break them.",
                  "score": 27,
                  "created_utc": 1744985773.0,
                  "replies": [
                    {
                      "id": "mnri9zz",
                      "author": "theajharrison",
                      "body": "Oh, dang, yep. You're correct. I really misunderstood that. \n\nOk, yeah that's reasonable then.",
                      "score": 3,
                      "created_utc": 1744986312.0,
                      "replies": [
                        {
                          "id": "mnrqi9n",
                          "author": "TheOtherWhiteCastle",
                          "body": "As an aside, I don’t know if I ever once used the Joycon straps for my OG Switch, despite regularly using the Wii Remote strap.",
                          "score": 4,
                          "created_utc": 1744988810.0,
                          "replies": [
                            {
                              "id": "mnrt1mh",
                              "author": "hatramroany",
                              "body": "I mainly used them for ARMS and Mario Odyssey but sideways the shoulder button extenders were annoying",
                              "score": 1,
                              "created_utc": 1744989566.0,
                              "replies": []
                            },
                            {
                              "id": "mnrwatn",
                              "author": "theajharrison",
                              "body": "Ok, well I always use them. \n\nAlso most people Ive played with in person also opt to use them. \n\nBut naturally it isn't everyone.",
                              "score": 1,
                              "created_utc": 1744990536.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mntfcji",
          "author": "nonowords",
          "body": "If you take a rolling average of their profit/earnings it's basically a flat line since the 80s. The wii u era saw them seeing losses, and the switch+covid popped it up to where it was at peak gameboy era. So record profits in terms of the total dollars is basically entirely because of *inflation* + more consumers.\n\nhttps://i.imgur.com/ikUjz0i.png",
          "score": 7,
          "created_utc": 1745007335.0,
          "replies": [
            {
              "id": "mnthd58",
              "author": "theajharrison",
              "body": "Oh, yeah, no, I meant profit margin. My bad. \n\nI'm saying they're trying to go for record profit margins by pricing disproportionately above what would be normal for the inflation of the last few years.\n\nSorry for the miscommunication.",
              "score": 0,
              "created_utc": 1745007964.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrazke",
          "author": "shifty_coder",
          "body": "Thank you, President Trump. Without you, this would not be possible.",
          "score": 33,
          "created_utc": 1744983961.0,
          "replies": [
            {
              "id": "mnrdq3t",
              "author": "KillerKowalski1",
              "body": "We're so great",
              "score": 20,
              "created_utc": 1744984860.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrc84u",
          "author": "bort_license_plates",
          "body": "I have a problem with this sort of tactic when it comes to necessities. Food, housing, utilities, energy.\n\nWhen it comes to luxury items, we can either choose to pay or not.",
          "score": 14,
          "created_utc": 1744984369.0,
          "replies": [
            {
              "id": "mnrdkq3",
              "author": "theajharrison",
              "body": "Game consoles aren't \"luxury\" goods. \n\nThey are discretionary ordinary goods.",
              "score": -21,
              "created_utc": 1744984811.0,
              "replies": [
                {
                  "id": "mntgyd8",
                  "author": "nonowords",
                  "body": "They are definitionally luxury goods.\n\nluxury goods doesn't just mean louis vitton or rolex. It refers to items with a specific pattern of consumption and use in economics.",
                  "score": 5,
                  "created_utc": 1745007838.0,
                  "replies": [
                    {
                      "id": "mnthol2",
                      "author": "theajharrison",
                      "body": "Yeah, idk what to tell. That's simply incorrect exactly by commonly used definitions in economics.",
                      "score": -5,
                      "created_utc": 1745008064.0,
                      "replies": [
                        {
                          "id": "mnthzjk",
                          "author": "nonowords",
                          "body": "Hope this helps.https://www.investopedia.com/terms/l/luxury-item.asp\n\nhttps://en.wikipedia.org/wiki/Luxury_goods\n\nFor some reason I see this a lot with tech/gaming related subs. People saying things like graphics cards for gaming, new generation consoles, peripherals etc. arent luxury goods. It's just unambiguously incorrect. They are. They aren't a need, and consumption increases drastically with income. Those are the main qualifiers for luxury goods.",
                          "score": 7,
                          "created_utc": 1745008160.0,
                          "replies": [
                            {
                              "id": "mntish7",
                              "author": "theajharrison",
                              "body": "How this helps \n\nhttps://www.investopedia.com/terms/c/consumer-discretionary.asp",
                              "score": -1,
                              "created_utc": 1745008414.0,
                              "replies": [
                                {
                                  "id": "mntjaw5",
                                  "author": "nonowords",
                                  "body": "Notice how I didn't say 'they aren't discretionary goods'? \n\nThey are, like all other luxury goods, also discretionary goods.",
                                  "score": 4,
                                  "created_utc": 1745008576.0,
                                  "replies": [
                                    {
                                      "id": "mntl4d6",
                                      "author": "theajharrison",
                                      "body": "Lol cute sneaky edit. \n\nSo it seems like my initial comment is partly correct. But also, yeah it seems, I was wrong in my initial correction to that other person by denying it be called a luxury good.\n\nHowever, as was you technically wrong in you initial correction. The actual correction to my comment should have been something like \"luxury goods are discretionary ordinary goods\". I suspect its because you didn't know either.\n\nI admit I was partly wrong. Can you? Or will you pretend you actually knew something all along?",
                                      "score": -2,
                                      "created_utc": 1745009148.0,
                                      "replies": [
                                        {
                                          "id": "mntn55s",
                                          "author": "nonowords",
                                          "body": "> They are definitionally luxury goods.\n\n>luxury goods doesn't just mean louis vitton or rolex. \n\nThis was my original comment. It still stands.\n\nI added the rest before you even replied, but again the comment still stands. I never said they weren't discretionary goods. So no I won't admit I was wrong. Because I wasn't.\n\n[Here](https://old.reddit.com/r/KitchenConfidential/comments/1i9dcws/i_think_i_am_witnessing_first_hand_stage_1/m92lkjm/?context=3)'s me talking about the exact same thing months ago. So your suspicion is incorrect. Props for admitting when you're wrong tho, even if you had to chain it to a random \"but you were probably wrong too\"",
                                          "score": 4,
                                          "created_utc": 1745009784.0,
                                          "replies": [
                                            {
                                              "id": "mntppo4",
                                              "author": "theajharrison",
                                              "body": ">It still stands.\n\nWell, mostly. It's partially correct. \n\nA fully accurate correction would be to point out luxury good is a discretionary ordinary good. \n\nHowever, you didn't. \n\nWhich means, you were either hasty in your response, or you didn't know. \n\nNo judgement either way. \n\n>me talking about the exact same thing months ago. So your suspicion is incorrect.\n\nWell, two things, first, nowhere in that comment do you demonstrate that understood that luxury goods is a sub category of discretionary ordinary goods. And besides, if you had, you've shown yourself willing to do sneaky edits, meaning your integrity is in slight question on comment history.",
                                              "score": 1,
                                              "created_utc": 1745010603.0,
                                              "replies": [
                                                {
                                                  "id": "mnts649",
                                                  "author": "nonowords",
                                                  "body": "Lmao, bro your ego is completely unearned and out of control\n\n>And besides, if you had, you've shown yourself willing to do sneaky edits, meaning your integrity is in slight question on comment history.\n\nfirst: edits show up as edits unles theyre made within 2 minutes, second my edit doesn't change anything about this interaction whatsoever. I added extra explaination. That's it. I did it well before you even replied.\n\n>Which means, you were either hasty in your response, or you didn't know. \n\nYes I was hasty in my response. Hence me immediately editing it. Great observation.\n\nIf it helps your fragile personality you can believe I was just making shit up and lucked into it. I don't care enough to argue about this anymore.\n\n\nEDIT! EDIT! THIS IS AN EDIT!!!!\n\n>A fully accurate correction would be to point out luxury good is a discretionary ordinary good. \n\nIts not a discretionary ordinary good. It's a discretionary good. discretionary ordinary good isn't even a term in economics.\n\nEDIT AGAIN\n\nsee that asterisk that shows I made this edit and the time of the edit?",
                                                  "score": 1,
                                                  "created_utc": 1745011405.0,
                                                  "replies": [
                                                    {
                                                      "id": "mntw7z0",
                                                      "author": "theajharrison",
                                                      "body": ">Lmao, bro...\n\nOk, seems like you might be loosing your cool now.\n\n>That's it. I did it well before you even replied\n\nOk, I'll trust you.\n\n>Yes I was hasty in my response. Hence me immediately editing it. Great observation.\n\nNo, not that recent edited response. I saying you could've been initially hasty in your initial reply. The one were you first corrected me about luxury goods. And I'm also saying if you weren't hasty in that response, than you were ignorant (like I was) to luxury goods being a subgroup of discretionary ordinary goods. \n\nGiven your defense posturing with faux admission, proclaiming your lack of care, and jibes at edits; it's more likely you're insecure about something brought up. \n\n>discretionary ordinary good isn't even a term in economics.\n\nSorry, they absolutely can be combined. It describes a good that has sensitivity to quantity demand to the good's own price while also demand responding to house hold income. \n\nHigher priced electronics exactly are in that category.",
                                                      "score": 1,
                                                      "created_utc": 1745012757.0,
                                                      "replies": [
                                                        {
                                                          "id": "mntzvo3",
                                                          "author": "nonowords",
                                                          "body": "you said:\n\n>A fully accurate correction would be to point out luxury good is a discretionary ordinary good. \n\nWhich is still not right. Luxury goods are discretionary goods. A lot of them are not ordinary goods. \n\n>Sorry, they absolutely can be combined. It describes a good that has sensitivity to quantity demand to the good's own price while also demand responding to house hold income. \n\nYou misread the google search my friend. Only the first half of this is correct. \"demand responding to house hold income\" Has to do with whether a good is normal, not ordinary.",
                                                          "score": 2,
                                                          "created_utc": 1745014017.0,
                                                          "replies": [
                                                            {
                                                              "id": "mnu2y8z",
                                                              "author": "theajharrison",
                                                              "body": ">Which is still not right. Luxury goods are discretionary goods. A lot of them are not ordinary goods. \n\nOh nice, yeah that right there is a good wholly accurate correction. \n\nAnd yet, you still struggle to admit in earnest that you weren't wholly accurate with your first correction claim that kicked this entire discussion off.\n\nPride is a tricky thing. I do feel like I must share, high intellectual humility has been shown to significantly correlate with learning.\n\n\n>You misread the google search my friend. Only the first half of this is correct. \"demand responding to house hold income\" Has to do with whether a good is normal, not ordinary.\n\nAlmost. Yes, that's the definition of a \"normal good\". However, I do specifically mean an ordinary good which is demand to its own price. \n\nTake as much time as you need to understand the difference.",
                                                              "score": 1,
                                                              "created_utc": 1745015112.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mnu3hai",
                                                                  "author": "nonowords",
                                                                  "body": ">Almost. Yes, that's the definition of a \"normal good\". However, I do specifically mean an ordinary good which is demand to its own price. \n\nYes. that's what I said. You said:\n\n> Sorry, they absolutely can be combined. It describes a good that has sensitivity to quantity demand to the good's own price while also demand responding to house hold income. \n\nWhich is not correct. \"ordinary\" has nothing to do with income. it also has nothing to do with luxury or not. so your 'correction' that 'luxury good is a discretionary ordinary good' [sic] is strictly false. Not just the amorphous  claim of \"you didn't overexplain to explicitly state which irrelevant parts of the comment you were replying to were also applicable\"\n\n>high intellectual humility has been shown to significantly correlate with learning.\n\nFuck the irony is so great with this one.",
                                                                  "score": 2,
                                                                  "created_utc": 1745015302.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mnu65fp",
                                                                      "author": "theajharrison",
                                                                      "body": ">Yes. that's what I said\n\nNo no, you are trying to say I mean \"demand to income\" (normal). \n\nI DO NOT. I am exactly saying what I mean, I mean \"demand to its own price\" (ordinary).\n\nDo you understand this? \n\nWe are not arguing about definition differences between \"normal\" and \"ordinary\". We agree on those. \n\nYou are trying to tell me my initial definition of discretionary ordinary goods was wrong because I included \"demand to its own price\" and you tried to correct it with \"demand to household income\" and that I should have said discretionary normal goods instead. \n\n**I deny that claim.**\n\nI meant what I meant and I also knew the correct definition.\n\nDo you understand? Are you actually following the argument?\n\n>Fuck the irony is so great with this one.\n\nI'm open, and am trying to be intellectually humble. I've admitted every time I found out I was mistaken.",
                                                                      "score": 1,
                                                                      "created_utc": 1745016264.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "mnwazay",
                                          "author": "Yankee831",
                                          "body": "A tortoise is a turtle but a turtle isn’t necessarily a tortoise…words can have meanings while being under the umbrella of a larger more expansive term. A discretionary good isn’t a much art good but a luxury good is also a discretionary good.",
                                          "score": 0,
                                          "created_utc": 1745051064.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnre41n",
                  "author": "bort_license_plates",
                  "body": "Potato potato. Either way, nobody NEEDS one.",
                  "score": 9,
                  "created_utc": 1744984987.0,
                  "replies": [
                    {
                      "id": "mnrqx11",
                      "author": "TheOtherWhiteCastle",
                      "body": "Fair enough. But just because nobody NEEDS something doesn’t mean it shouldn’t be made more financially accessible to them. It’s easier to stomach but that doesn’t make it okay.",
                      "score": -2,
                      "created_utc": 1744988931.0,
                      "replies": [
                        {
                          "id": "mns6g51",
                          "author": "bort_license_plates",
                          "body": "I think it’s fine to voice a complaint and be annoyed at the price of something. The outrage that I’ve seen over it in the past couple weeks is excessive though.\n\nUltimately, for a non-essential, people will vote with their wallets. If Nintendo sees that system and games sales are below projections, they’ll know they fucked up. But I bet they sell a boatload and they’ll know they didn’t leave money on the table.",
                          "score": 9,
                          "created_utc": 1744993608.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mnrg70w",
                      "author": "theajharrison",
                      "body": "K\n\nDoesn't mean it's not a shitty change from Nintendo.",
                      "score": -10,
                      "created_utc": 1744985661.0,
                      "replies": [
                        {
                          "id": "mnssgdl",
                          "author": "WeeWooPeePoo69420",
                          "body": "Name a single large market leader company that's very pro consumer",
                          "score": 1,
                          "created_utc": 1745000130.0,
                          "replies": [
                            {
                              "id": "mnstsve",
                              "author": "theajharrison",
                              "body": "Costco",
                              "score": 1,
                              "created_utc": 1745000541.0,
                              "replies": [
                                {
                                  "id": "mnsu5ng",
                                  "author": "WeeWooPeePoo69420",
                                  "body": "Okay I feel like *besides Costco should be a qualifier for many things, it's like the typical outlier example",
                                  "score": 1,
                                  "created_utc": 1745000648.0,
                                  "replies": [
                                    {
                                      "id": "mnsv142",
                                      "author": "theajharrison",
                                      "body": "Trader Joe's",
                                      "score": 1,
                                      "created_utc": 1745000917.0,
                                      "replies": [
                                        {
                                          "id": "mnsy0y7",
                                          "author": "WeeWooPeePoo69420",
                                          "body": "I mean kind of, some things can be well priced but it depends on the item and location. I think it's their product selection people love but idk if that's necessarily pro consumer.",
                                          "score": 1,
                                          "created_utc": 1745001841.0,
                                          "replies": [
                                            {
                                              "id": "mnsy684",
                                              "author": "theajharrison",
                                              "body": "South West Airlines",
                                              "score": -1,
                                              "created_utc": 1745001885.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnrs2be",
                  "author": "Specialist-Rope-9760",
                  "body": "If you lived in a country without proper water and limited food I expect you would change your take on what is a necessity and what is a relative luxury",
                  "score": 3,
                  "created_utc": 1744989272.0,
                  "replies": [
                    {
                      "id": "mnt0zup",
                      "author": "MercuryOrion",
                      "body": "Do you?",
                      "score": 2,
                      "created_utc": 1745002758.0,
                      "replies": []
                    },
                    {
                      "id": "mnrwj5v",
                      "author": "theajharrison",
                      "body": "Ok, nice strawman there. \n\nYou really kicked the shit out of it. \n\nWell done.",
                      "score": -1,
                      "created_utc": 1744990607.0,
                      "replies": [
                        {
                          "id": "mnrz1jp",
                          "author": "Specialist-Rope-9760",
                          "body": "Thanks mate",
                          "score": 1,
                          "created_utc": 1744991357.0,
                          "replies": [
                            {
                              "id": "mns1hkv",
                              "author": "theajharrison",
                              "body": "Np\n\nI got you",
                              "score": 2,
                              "created_utc": 1744992089.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mnslm7l",
          "author": "DjentRiffication",
          "body": "Yeah I roll my eyes whenever people try to use \"but with inflation vs X number of years ago..\" as an argument to defend price hikes. That one single variable doesn't account for countless other things that have changed in the past two decades. Back in the 90s the market for video games as entertainment was basically in it's early adopter phase, and profit margins needed to provide cushion because they didn't sell nearly as many games, or devices to play games, services, subscriptions, merch, and all the accompanying sources of revenue that exist now. Not to mention developers had significantly different amount and quality of resources, tools, and proven IP or gameplay elements to depend on.\n\nI completely understand some people are willing and happy to pay $70, $80, or even more on \"upgraded/deluxe\" versions of games, but it's seriously out of touch with reality to assume the more casual audience would be on board with that pricing. I know even with the $60 price tag of switch games I found myself passing on loads of first party titles because to \"try\" a game that I wasn't super into at that price point was not worth it.",
          "score": 2,
          "created_utc": 1744998091.0,
          "replies": [
            {
              "id": "mnsr3aj",
              "author": "My-Internet-Name",
              "body": "Lots of public libraries have games you can check out to “try” for free. May also be local groups around you where people trade or lend games. \n\nThat said, I’ve only paid $60 for a game about 5 times in the last decade (and I’ve bought 100s of games). All of them were Switch 1st party titles that never go on sale. It’s really stupid.",
              "score": 4,
              "created_utc": 1744999716.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mntzfrc",
          "author": "Silviecat44",
          "body": "Tired of winning yet? :)",
          "score": 2,
          "created_utc": 1745013861.0,
          "replies": [
            {
              "id": "mnu0ea6",
              "author": "theajharrison",
              "body": "Currently enjoying a lovely 70deg afternoon in one of best parks around me as I walk my dog and listen to Big-A discuss the Gold Card with DougDoug and Aiden on the most recent Lemonade Stand podcast \n\nSo, yeah, I suppose this is enough winning for the day. \n\nWhat about you?",
              "score": -4,
              "created_utc": 1745014199.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrjfzt",
          "author": "vonneguts_anus",
          "body": "So don’t buy it",
          "score": -5,
          "created_utc": 1744986676.0,
          "replies": [
            {
              "id": "mnrjj9c",
              "author": "theajharrison",
              "body": "I won't",
              "score": 6,
              "created_utc": 1744986703.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrbtjj",
          "author": "badger906",
          "body": "Why does record profits mean greed? they could just sell a lot more consoles and games. Companies shouldn’t have to cut their margins just because they are making more profit than year on year.",
          "score": -10,
          "created_utc": 1744984237.0,
          "replies": [
            {
              "id": "mnrfgcd",
              "author": "theajharrison",
              "body": "It contradicts this narrative some are pushing that this pricing is just about hedging inflation. \n\nIf Nintendo gets record profits in this inflationary environment, it's a clear indicator the pricing was about pushing the limit with consumers for the benefit of shareholders.",
              "score": 5,
              "created_utc": 1744985424.0,
              "replies": [
                {
                  "id": "mnrggf7",
                  "author": "badger906",
                  "body": "How? I’m trying to understand this as someone whose business is sales. I have a product that I purchased, that costs “A”, I add my mark up (which is many of factors and things combined), gives me my retail price “B”.  That’s what contributes to the price, cost and profit margin. If I have a record breaking year, but my raw costs are still higher, but I increase prices to keep the same margin. I’m not greedy.. I’m just keeping my margins the same. \n\nIt’s not a companies job to absorb external pressures to be nice to customers.. because when inflation goes down, will the customer be like “oh well they were nice when times were hard, so I’ll pay more now when I don’t have to”..\n\nIt’s a luxury item. You’re acting like everyone deserves one and should have one..",
                  "score": -2,
                  "created_utc": 1744985742.0,
                  "replies": [
                    {
                      "id": "mnrhctg",
                      "author": "theajharrison",
                      "body": ">but I increase prices to keep the same margin\n\nAhhh, yeah, here's the miscommunication. \n\nI'm saying it's not the same margin. I'm saying it's above and beyond the typical historical margin. \n\nEverything else I'm pretty sure we agree on.",
                      "score": 3,
                      "created_utc": 1744986026.0,
                      "replies": [
                        {
                          "id": "mnrjps7",
                          "author": "badger906",
                          "body": "How can you make this assumption? You know how much it cost to research and develop? You know how much marketing was, you know how much it cost them to ship, advertise and package the item? As well as many many other factors? Like projected sales. \n\nYou’ve given a strap as an example. Designing and tooling costs could be $60k. Testing $20k. Design and boxing $10k. Global shipping per unit $5. Projected sales then needs to be divided into these costs. As you can’t assume it’s a smash hit or a flop. \n\nYou can’t just look at an item that one similar a few years ago was $5 and now it’s $20.. and then say that’s higher than inflation so that’s greed. Inflation adds cost to every step of the process",
                          "score": -1,
                          "created_utc": 1744986759.0,
                          "replies": [
                            {
                              "id": "mnrkczh",
                              "author": "theajharrison",
                              "body": "I'm not making an assumption. I'm speculating. \n\nAs for your other questions, they can be flipped back onto you. \n\nYour example could also be flipped back with numbers supporting my position.",
                              "score": 6,
                              "created_utc": 1744986959.0,
                              "replies": [
                                {
                                  "id": "mnrlb8s",
                                  "author": "badger906",
                                  "body": "My numbers are fairly realistic for products that involve custom designed moulds. \n\nIt’s like Warhammer. You get a box of 10 models they’re like $70. The plastic itself probably cost games workshop 20c. The part people don’t see is the $30-40k mould they produced that needs replacing every 30k units made.  Not to mention the 3-6 months they paid designers to sculpt the model and plan the sprue. \n\nIf it was easy for every company to be greedy as you suggest, every company would have a huge cost to profit margin.",
                                  "score": 0,
                                  "created_utc": 1744987250.0,
                                  "replies": [
                                    {
                                      "id": "mnrng03",
                                      "author": "theajharrison",
                                      "body": ">My numbers are fairly realistic for products that involve custom designed moulds. \n\nI'm not suggesting they aren't realistic. \n\n>If it was easy for every company to be greedy as you suggest, every company would have a huge cost to profit margin.\n\nStrawman. I never was implying for *every* company. And it's certainly not easy to achieve the ultimate greed scenario you're suggesting. \n\nI am saying that I think despite these external economic and market forces on Nintendo, they are making greedy pricing choices at the detriment of their primary consumer audience.",
                                      "score": 4,
                                      "created_utc": 1744987898.0,
                                      "replies": [
                                        {
                                          "id": "mnt1drl",
                                          "author": "MercuryOrion",
                                          "body": "Do you have evidence to support that viewpoint or is it just an opinion?",
                                          "score": -1,
                                          "created_utc": 1745002879.0,
                                          "replies": [
                                            {
                                              "id": "mnt57fb",
                                              "author": "theajharrison",
                                              "body": "Did you miss that the answer to your question is in my parent comment just above the one you replied to and asking this in genuine curiosity?\n\nOr did you want to set up some bad faith strawman and intentionally ignore what I previously wrote in this thread branch?",
                                              "score": 2,
                                              "created_utc": 1745004095.0,
                                              "replies": [
                                                {
                                                  "id": "mnt5nin",
                                                  "author": "MercuryOrion",
                                                  "body": "I did actually miss that you said you were just speculating, apologies for that.\n\nAlthough bear in mind that makes any calls for \"evidence\" from you spurious at best; \"that which is presented without evidence, can be dismissed without evidence\".",
                                                  "score": -1,
                                                  "created_utc": 1745004239.0,
                                                  "replies": [
                                                    {
                                                      "id": "mnt70b1",
                                                      "author": "theajharrison",
                                                      "body": "Pithy. Yet cliche and droll.\n\nAnd evidence towards the suspicion I had that you were merely setting up a strawman instead of any good faith engagement.\n\nAlso I forgive your hastiness.",
                                                      "score": 1,
                                                      "created_utc": 1745004675.0,
                                                      "replies": [
                                                        {
                                                          "id": "mnt7g8c",
                                                          "author": "MercuryOrion",
                                                          "body": "Something can be cliche and droll but still true. \n\nYou are welcome to your suspicion; I started with genuine curiosity but I don't particularly feel like you've shown a lot of good faith yourself, what with instantly jumping to strawman accusations, so I haven't put much effort into remaining there myself.",
                                                          "score": 0,
                                                          "created_utc": 1745004819.0,
                                                          "replies": [
                                                            {
                                                              "id": "mnt843v",
                                                              "author": "theajharrison",
                                                              "body": ">Something can be cliche and droll but still true. \n\nYet again you state the obvious. \n\n>so I haven't put much effort into remaining there myself.\n\nK, well, it seems we agree you have nothing of value to communicate to me. So let's end it here. \n\nEnjoy your day.",
                                                              "score": 1,
                                                              "created_utc": 1745005031.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mnv8drr",
                                                                  "author": "zvii",
                                                                  "body": "That was fun.",
                                                                  "score": 2,
                                                                  "created_utc": 1745030604.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mnvbh3r",
                                                                      "author": "theajharrison",
                                                                      "body": "I'm glad you enjoyed it",
                                                                      "score": 1,
                                                                      "created_utc": 1745031891.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                },
                                                                {
                                                                  "id": "mntad48",
                                                                  "author": "MercuryOrion",
                                                                  "body": "You as well.",
                                                                  "score": 0,
                                                                  "created_utc": 1745005757.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mnv8cir",
                                                                      "author": "zvii",
                                                                      "body": "That was fun",
                                                                      "score": 2,
                                                                      "created_utc": 1745030589.0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mnrowoo",
                  "author": "stubble3417",
                  "body": "Increasing profit margin is literally the only safeguard for businesses operating in inflationary environments.",
                  "score": -5,
                  "created_utc": 1744988331.0,
                  "replies": [
                    {
                      "id": "mnrpnxl",
                      "author": "theajharrison",
                      "body": "It literally isn't. But pop off",
                      "score": 3,
                      "created_utc": 1744988557.0,
                      "replies": [
                        {
                          "id": "mnrpw9v",
                          "author": "stubble3417",
                          "body": "Okay, explain how decreasing profit margin helps businesses operate in an inflationary environment.",
                          "score": -3,
                          "created_utc": 1744988629.0,
                          "replies": [
                            {
                              "id": "mnrvwmz",
                              "author": "theajharrison",
                              "body": "That wasn't your claim. \n\nYour claim was that it's \"literally the only\" way.",
                              "score": 3,
                              "created_utc": 1744990418.0,
                              "replies": [
                                {
                                  "id": "mnrxfnc",
                                  "author": "stubble3417",
                                  "body": "It is. Profit margins can either increase or not increase. One of those options is a safeguard in inflationary environments. One is not. If you think that not increasing profit margins is the safer option, explain why.",
                                  "score": -1,
                                  "created_utc": 1744990874.0,
                                  "replies": [
                                    {
                                      "id": "mnrxz35",
                                      "author": "theajharrison",
                                      "body": ">It is.\n\nIt wasn't in your 2nd reply.\n\n>you think that not increasing profit margins is the safer option\n\nYep, that's not my claim.",
                                      "score": 2,
                                      "created_utc": 1744991036.0,
                                      "replies": [
                                        {
                                          "id": "mnrz2h5",
                                          "author": "stubble3417",
                                          "body": "Okay, if you think that not increasing profit margins isn't a safer option, you agree that increasing profit margins is the safer option.\n\nMaybe you think there's some third option like decreasing overhead. But that's just a different method of increasing profit margin. If you refuse to offer any alternatives, I'm not sure what we're discussing.",
                                          "score": 0,
                                          "created_utc": 1744991365.0,
                                          "replies": [
                                            {
                                              "id": "mnscj2v",
                                              "author": "theajharrison",
                                              "body": ">Maybe you think there's some third option like decreasing overhead. \n\nAyooo, look at you starting to figure things out\n\n>that's just a different method of increasing profit margin.\n\nUh-uhh-ahhh, don't try to weasel out of your initial claim with some pedantic technicality attempt. \n\nThis entire thread is clearly about Nintendo increasing profit and profit margin via large price jumps thus increasing revenue. You know that, or at least you should. \n\nNowhere has there been a discussion of:\n- reducing overhead costs\n- minimizing COGS\n- improving strategic stock reserves\n- supply-chain resilience measures\n- working capital squeezing\n- any other financial management tactics \n\nYour initial claim was:\n\n> Increasing profit margin is literally the only safeguard for businesses operating in inflationary environments.\n\nSo, if the entirety of this initial claim hinged on the obvious banal truth \"changing costs also impacts profit margin\"; then, thanks for saying nothing of apparent value to what was a nuanced discussion.\n\n\n>I'm not sure what we're discussing.\n\nEither do I. \n\nHave a great rest of your day",
                                              "score": 2,
                                              "created_utc": 1744995428.0,
                                              "replies": [
                                                {
                                                  "id": "mnsi212",
                                                  "author": "stubble3417",
                                                  "body": "It was never a nuanced discussion. This situation has no nuance. Companies all try to do all the things you mentioned all the time. Imagine telling Nintendo's CEO \"have you ever considered reducing your overhead? That could really help!\" Every company tries to minimize overhead every day. To increase profit margin.",
                                                  "score": 0,
                                                  "created_utc": 1744997052.0,
                                                  "replies": [
                                                    {
                                                      "id": "mnsioi9",
                                                      "author": "theajharrison",
                                                      "body": "Oh I already have the measure of your capabilities on this topic. No need to continue replying. It's clear your current knowledge doesn't add anything.\n\nThanks anyway.",
                                                      "score": 2,
                                                      "created_utc": 1744997235.0,
                                                      "replies": [
                                                        {
                                                          "id": "mnsl6tu",
                                                          "author": "stubble3417",
                                                          "body": "You're welcome, I'll stop replying when it stops being entertaining!",
                                                          "score": 0,
                                                          "created_utc": 1744997965.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mnron7y",
              "author": "stubble3417",
              "body": "I'm not sure why anyone would expect the biggest console launch in decades to NOT result in record profits. If they're not supposed to make record profits this year, when are they supposed to have profits? How do they think the game industry works, steady revenue every year? Nintendo has made plenty of questionable decisions but making record profits when their 8+ year hardware development cycle finally comes to fruition is not exactly negotiable. The alternative to making record profits on a console release year is the Wii u.",
              "score": -2,
              "created_utc": 1744988254.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrb49u",
          "author": "None",
          "body": "Inflation has always been caused by corporate greed. Nothing else. Profits can not go down or they lose shareholders. This is why capitalism is unsustainable.",
          "score": -10,
          "created_utc": 1744984004.0,
          "replies": []
        },
        {
          "id": "mnu67kz",
          "author": "adrian783",
          "body": "well good thing that you can buy cheap 3rd party straps from china 🤣",
          "score": 0,
          "created_utc": 1745016286.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnt3jwl",
      "author": "classless_classic",
      "body": "I’m guessing they will have a huge amount in the US before the tariffs hit.  At least enough for the presale price to be honored.",
      "score": 9,
      "created_utc": 1745003570.0,
      "replies": []
    },
    {
      "id": "mnra8jd",
      "author": "Ok-Criticism6874",
      "body": "500 dollars for the console and a game isn't a terrible price. It's not a deal but it's reasonable. 80 dollars for a game with no instructions and will likely never drop in price, is bananas.\n\nToo bad the console bundle will be snatched up in seconds by scalpers.",
      "score": 69,
      "created_utc": 1744983708.0,
      "replies": [
        {
          "id": "mnrks9e",
          "author": "Optimus_Prime_Day",
          "body": "Unless you order direct from Nintendo, but you need to have had their online service for 12 months at minimum as proof.",
          "score": 27,
          "created_utc": 1744987089.0,
          "replies": [
            {
              "id": "mnrpgio",
              "author": "Cute_Commission_8281",
              "body": "Do you know if that needs to be a recent 12 months? \n\nI had it for a long time back when Splatoon 2 was big but not for years now.",
              "score": 6,
              "created_utc": 1744988496.0,
              "replies": [
                {
                  "id": "mnsa9s0",
                  "author": "LionIV",
                  "body": "Nintendo says as long as at one point in time before they announced Switch 2 you had a 12 month online subscription and 50 hours of play time, you’re eligible to get an email. But I’ve read the fine print saying it’s on a *first come, first serve basis*, and have a sneaking suspicion they’re prioritizing active subscribers.",
                  "score": 10,
                  "created_utc": 1744994764.0,
                  "replies": []
                },
                {
                  "id": "mnrxk8b",
                  "author": "Optimus_Prime_Day",
                  "body": "I'm not sure. Like I cancelled mine last year, but had it for 4 years. It assume the reason is to prove you're not a scalper so I'm betting yes, if you had it for 12 months at some point on that email, it likely will count. But that's just my guess.",
                  "score": 7,
                  "created_utc": 1744990912.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnrxqlp",
              "author": "Arctiiq",
              "body": "Does it work if you’re part of a family membership?",
              "score": 2,
              "created_utc": 1744990966.0,
              "replies": [
                {
                  "id": "mns54if",
                  "author": "snuggiemclovin",
                  "body": "Only the family account holder gets credit for the 12 months. Check r/NintendoSwitch2",
                  "score": 1,
                  "created_utc": 1744993204.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnu6gn3",
              "author": "adrian783",
              "body": "this is awesome news for me",
              "score": 1,
              "created_utc": 1745016377.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrrs04",
          "author": "TheOtherWhiteCastle",
          "body": "For what it’s worth, Nintendo seems hellbent on trying to protect against scalpers this time around. As early as last year they were looking to [absolutely flood the market with Switch 2’s](https://www.cnet.com/tech/gaming/nintendo-wants-to-flood-stores-with-the-switch-2-console-to-stop-scalpers/) out of the gate to make it easier to find in stores at launch. They’re also requiring you to have had a Nintendo Online membership for x months in order to preorder the system.",
          "score": 13,
          "created_utc": 1744989186.0,
          "replies": [
            {
              "id": "mnrsuf7",
              "author": "Ok-Criticism6874",
              "body": "That's dumb. I want to trade in my old Switch for the Switch 2. I can't do that at GameStop?",
              "score": -7,
              "created_utc": 1744989508.0,
              "replies": [
                {
                  "id": "mnrtb66",
                  "author": "TheOtherWhiteCastle",
                  "body": "You likely can, i think the online membership is for preordering from Nintendo directly",
                  "score": 7,
                  "created_utc": 1744989646.0,
                  "replies": []
                },
                {
                  "id": "mns5ex4",
                  "author": "snuggiemclovin",
                  "body": "New consoles have been selling out at launch for years now. Did you follow the PS5 saga at all?",
                  "score": 6,
                  "created_utc": 1744993292.0,
                  "replies": [
                    {
                      "id": "mns6pe3",
                      "author": "Ok-Criticism6874",
                      "body": "Yeah, I got one in DEC 2020 because I bought it directly from Sony",
                      "score": -6,
                      "created_utc": 1744993687.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mnvh9c7",
          "author": "UnidentifiedRoot",
          "body": "To be clear, I completely agree with you, though I imagine $80 won't look so insane for a game in 2 years unfortunately, but also, \"with no instructions\" is a hilarious thing to put as a primary reason why a games price is too high in 2025. It sounds like something you'd see reddit getting pissed about in 2006, \"They've removed the instruction booklet but are upping the price to $60? how could they justify this?!?!\" lol.",
          "score": 3,
          "created_utc": 1745034440.0,
          "replies": []
        },
        {
          "id": "mnsgry9",
          "author": "AintNobody-",
          "body": "My question is if I'm going to let myself be driven by FOMO and tarriff anxiety, or let this thing ride for a little bit. There's one game I want to play at launch. And Mario Kart isn't really the kind of game I like to sit at for hours at a time like a new Mario platformer or Zelda game. So do I pay 500 to play Mario Kart once in a while and admire my expensive new dust catcher who knows how long for another game I want, or do I wait for the games and maybe it costs $800 next year.",
          "score": 2,
          "created_utc": 1744996679.0,
          "replies": [
            {
              "id": "mntj3ij",
              "author": "LionIV",
              "body": "For me, it’s more about playing the older games at better frame rates and resolutions. A lot like the PS5 launch, there aren’t many things to play that are BRAND NEW experiences specifically catered to the platform. But there’s a hell of a backlog I’d love to dive into. The new DK game is selling me on it though, being the first 3D DK game in literally 26 years.",
              "score": 3,
              "created_utc": 1745008511.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnsic25",
          "author": "red_the_room",
          "body": "If you run the inflation calculator from March 2017 to today you’ll see the $299 switch would cost almost $400 now. The hand wringing about the price is ridiculous.",
          "score": 0,
          "created_utc": 1744997134.0,
          "replies": [
            {
              "id": "mnsik5d",
              "author": "Ok-Criticism6874",
              "body": "Why do you love corporations so much?",
              "score": -10,
              "created_utc": 1744997199.0,
              "replies": [
                {
                  "id": "mnt299c",
                  "author": "MercuryOrion",
                  "body": "I see this fallacy a lot. \n\nPerson one: ~makes unsupported or incorrect argument attacking [thing]~\n\nPerson two: ~points out the argument is unsupported or incorrect~\n\nPerson one: \"Why do you love [thing] so much, huh?!?\"\n\nLike, if you say \"Nazis are bad because they killed 6 trillion Jews\", and I say \"it was 6 million, actually\", I'm not defending Nazis - I'm correcting your incorrect information!",
                  "score": 7,
                  "created_utc": 1745003158.0,
                  "replies": [
                    {
                      "id": "mnt2rsj",
                      "author": "Ok-Criticism6874",
                      "body": "You are so smart, you shouldn't be wasting your time on reddit, you should be commanding armies.",
                      "score": -7,
                      "created_utc": 1745003321.0,
                      "replies": [
                        {
                          "id": "mnt50ba",
                          "author": "MercuryOrion",
                          "body": "One day you are going to have the staggering realization that building your entire reasoning system around appeals to popularity and thought terminating cliches has left you woefully under equipped to actually express yourself meaningfully when it really matters. \n\nAnd I'm genuinely sorry for you for that.",
                          "score": 7,
                          "created_utc": 1745004033.0,
                          "replies": [
                            {
                              "id": "mnt5bsl",
                              "author": "Ok-Criticism6874",
                              "body": "I feel sorry that you'll never find a human being who loves you.",
                              "score": -4,
                              "created_utc": 1745004135.0,
                              "replies": [
                                {
                                  "id": "mnt6u49",
                                  "author": "MercuryOrion",
                                  "body": "Oh honey. XD Insults like that only work on people who are a) insecure, b) not sociopaths, and c) not currently in a loving relationship. \n\nIt's a dangerous insult to go for, because very few people hit a, b, and c, so you'll miss way more often than you hit. You are much better off going for insults about sexual dysfunction, intelligence, or perhaps body odor; at least you only need to get lucky once instead of three times for that to land. Insecurity is at least a common trait, so it's best to laser in on insults that aim for that specifically. \n\nAnd like, even Stalin had one wife who loved him, so yeah. Really risky insult to go for.",
                                  "score": 1,
                                  "created_utc": 1745004620.0,
                                  "replies": [
                                    {
                                      "id": "mnt88hp",
                                      "author": "Ok-Criticism6874",
                                      "body": "Risky? Sure. but 100% true.",
                                      "score": 1,
                                      "created_utc": 1745005071.0,
                                      "replies": [
                                        {
                                          "id": "mnta7cw",
                                          "author": "MercuryOrion",
                                          "body": "Well, staggering confidence without base is at least a consistent trait of yours, so points for that. XD",
                                          "score": 4,
                                          "created_utc": 1745005706.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mo0g019",
          "author": "TriangleBasketball",
          "body": "Plus it’ll no doubt have DLC.",
          "score": 1,
          "created_utc": 1745107358.0,
          "replies": []
        },
        {
          "id": "mnrkgfa",
          "author": "None",
          "body": "The copium for Nintendo fans is hilariously bad.",
          "score": -16,
          "created_utc": 1744986988.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnu54o3",
      "author": "chief_yETI",
      "body": "$90 controllers 😂\n\nliterally cheaper to buy a fightstick than a regular basic ass controller in 2025 SMH",
      "score": 9,
      "created_utc": 1745015895.0,
      "replies": [
        {
          "id": "mnukok4",
          "author": "bonesnaps",
          "body": "On PC those fight sticks will last through multiple generations of consoles and work for basically any game (I played through Dark Souls 1 with a fightstick once lol, though I switched to controller at Blight town since camera panning was tough there).",
          "score": 2,
          "created_utc": 1745021513.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnrnc0n",
      "author": "Sa0t0me",
      "body": "Laughs in Canadian …",
      "score": 12,
      "created_utc": 1744987864.0,
      "replies": [
        {
          "id": "mnukgi5",
          "author": "bonesnaps",
          "body": "$140 CAD games after tax.. yeah I think I'll buy like 8 quality games on a Steam sale instead.",
          "score": 7,
          "created_utc": 1745021431.0,
          "replies": [
            {
              "id": "mnw0wai",
              "author": "LeChief",
              "body": "Where in Canada do you live that 110 + sales tax costs 140? Check your math.",
              "score": 1,
              "created_utc": 1745044826.0,
              "replies": [
                {
                  "id": "mnzmxet",
                  "author": "beigs",
                  "body": "$110 is still crazy. I’m still shocked by $85 plus tax… I’ll be buying everything secondhand if the prices ever drop for physical games, or waiting for sales with downloads.",
                  "score": 1,
                  "created_utc": 1745097187.0,
                  "replies": [
                    {
                      "id": "mnzt11a",
                      "author": "LeChief",
                      "body": "Definitely. Seeing that sticker price would make me re evaluate my hobbies lol. Might take up golf instead.",
                      "score": 2,
                      "created_utc": 1745099301.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mnsayuf",
      "author": "CheesyFinster",
      "body": "If I was still a child, I couldn’t imagine the look my mom would give me asking for an $80 Kirby game or any game for that matter.\n\nJust absolute nonsense",
      "score": 13,
      "created_utc": 1744994968.0,
      "replies": [
        {
          "id": "mnuvhca",
          "author": "rafikiknowsdeway1",
          "body": "on the flip side when i was a child a copy of donkey kong country 2 was $80 in 1994 money",
          "score": 15,
          "created_utc": 1745025599.0,
          "replies": []
        },
        {
          "id": "mnvl8df",
          "author": "ttoma93",
          "body": "Yet as a kid I *did* ask my mom to get me an $80 or $90 N64 game—and that was in 1998 dollars. Adjusting for inflation that’s over $150.",
          "score": 5,
          "created_utc": 1745036290.0,
          "replies": [
            {
              "id": "mnx3vpc",
              "author": "CheesyFinster",
              "body": "Nintendo could get away with pricing things like that at first because they had no competition at the time. Until the PlayStation came out they were mainly competing with just Sega.\n\nWith the emergence of PlayStation, N64 ended up slashing fhe prices of most of their games to $60. PlayStation was able to sell cheaper games that looked better and they could price them cheaper since they were put on a disk.\n\nFast forward to 2000-2001. The PS2 and Xbox releases, making even more competition for Nintendo who just released GameCube. Now having to compete with TWO consoles, Nintendo slashes their prices AGAIN for brand new games to $40-$50\n\nSo all the talk of “inflation adjusted” is nonsense Because as time has gone on Nintendo has been able to lower their prices just to have a chance in the market. They can’t compete hardware wise but they’ve been able to hang around because of their price as well as their exclusives.\n\nNow they’re pricing their games at $80. Not just the brand new releases coming out but also the 10 year old games they’re re releasing for switch 2. \n\nAdjusted to inflation or not, any games costing $80+ at any time period is awful and the only way to fight it is with your wallets. Which has been proven to work in the past.",
              "score": 1,
              "created_utc": 1745067085.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mo12dad",
          "author": "Deceptiveideas",
          "body": "It was a different era back then. These days kids are getting $1000 iPhones. Back when I was a kid I was lucky to get a $100 Gameboy lmao.",
          "score": 1,
          "created_utc": 1745115758.0,
          "replies": []
        },
        {
          "id": "moa62sa",
          "author": "stellvia2016",
          "body": "You do realize that adjusted for inflation, games in the 90s cost $100+ USD, right?\n\nNES were 40-50. SNES were 50-60, with a handful at 40 and some as high as 80. 50 in 1992 dollars is ~114 today. I bought Final Fantasy 6 (called 3 back then) from Toys R Us with money I saved up and it was 79.99 plus tax...\n\nI'm not going to pretend 80 is cheap in today's economy, but overall we are spoiled for choice today. The original Mario Kart for SNES was $55-60 USD at release, which is around $120 USD today, for comparison.",
          "score": 1,
          "created_utc": 1745254483.0,
          "replies": [
            {
              "id": "moatrk1",
              "author": "CheesyFinster",
              "body": "Nintendo also had no competition until the PlayStation came out. Who started underselling Nintendo, while also having better graphics and hardware on their console.\n\nWhich is when Nintendo started making their games cheaper.\n\nThen Xbox came out and now all Nintendo have to their name are exclusives because they’re beat everywhere else in every other category by a mile.\n\n$60 then was $60, just like $60 today is $60. We aren’t talking about the cost of living or gas prices, we’re talking video games. \n\nJustifying todays price by saying “but due to inflation you would’ve paid XYZ back then” is silly because you wouldn’t pay that “adjusted inflation”price back then or today.\n\nAnd if you would RIP",
              "score": 1,
              "created_utc": 1745261343.0,
              "replies": [
                {
                  "id": "mod6kg6",
                  "author": "stellvia2016",
                  "body": "It had far more to do with the cost of manufacturing game cartridges at the time, than any sort of presumed monopoly by Nintendo. Especially since a number of games actually extended the capabilities of the consoles by including extra memory or auxiliary chips. Variable pricing was therefore the norm at the time.\n\neg: Super Mario Bros 3 isn't possible with only the base specs of the NES. It included extra memory etc. in the cartridge.\n\nSega Genesis was a very solid competitor to the SNES in the US, selling almost as many total units. Games were priced about the same as SNES ones as well, as shown in this 1993 ad:\n\nhttps://www.reddit.com/r/SEGAGENESIS/comments/1hlb8gs/pages_from_a_toys_r_us_catalog_1993/\n\nPlaystation \"won\" mostly on the back of their system being far easier to program for and including an onboard audio chip. (Though I'm sure CDs being much cheaper than cartridges helped) Therefore a lot more developers made games for the PSX  (Something like 10x more games...) The actual games had a tighter spread in price, but were still variable from 40-55 as seen here:\n\nhttps://www.reddit.com/r/n64/comments/yw5pmp/console_wars_ps1_had_a_lot_more_games_but_when_it/\n\nThe extreme high-end prices all died with the game cartridge, but the variable pricing remained to a degree, even into the PS2 era. Games for that were anywhere from 40-60 USD. It wasn't until PS3/360/Wii era that you really saw the overall market tighten up on pricing and really cement in that 59.99 msrp on consoles for AAA.\n\nIronically enough, PC is where prices were much more consistent over time: 49.99 for the vast majority of things until Diablo2 broke the psychological barrier by releasing at 59.99\n\n>$60 then was $60, just like $60 today is $60.\n\nWhat are you talking about? Your average fast food worker when the SNES came out made under $5/hr in the US and today the pay in most places is 15+ ... that is a huge difference.\n\nLets break that down into hours needed to work to buy a $60 game back then vs today: My first job was in fast food for 4.25/hr which would be a little over 14hrs to pay for a single $60 game. Fast food in my area is now offering 15-19/hr so lets say 15 -- that would be only 4hrs worked to earn enough for one $60 game.\n\nSo you were absolutely \"paying that price\" back then.",
                  "score": 1,
                  "created_utc": 1745288839.0,
                  "replies": [
                    {
                      "id": "mofd503",
                      "author": "CheesyFinster",
                      "body": "Wages have gone up because of the cost of living, food etc going up… not video games\n\n$15/hr today is not a livable wage today, just like $5/hr was not a livable wage back then lol\n\nYou have to work just as hard today, because you’re paying more for everything else.\n\nBut you’re right. As a kid with a job and no responsibilities what so ever, you would be able to buy that game quicker today than you could back then.",
                      "score": 0,
                      "created_utc": 1745328035.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mnu5f9p",
          "author": "chief_yETI",
          "body": "The whole reason I started off with Nintendo games when I was a kid was because my mom picked it since it was the cheapest option....\n\nSomehow it's cheaper to buy a PS5 than a Nintendo console with worse specs and less features? Make it make sense 🤯",
          "score": 0,
          "created_utc": 1745016001.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnywwt0",
      "author": "SilentSakura",
      "body": "And we still wont buy them",
      "score": 2,
      "created_utc": 1745088508.0,
      "replies": []
    },
    {
      "id": "mns0sag",
      "author": "Royal_Phrase_9598",
      "body": "Which means the price already accommodated the projected losses from tariffs. Very consumer friendly of Nintendo to hit us with the inflated prices from day one.",
      "score": 3,
      "created_utc": 1744991876.0,
      "replies": [
        {
          "id": "mnuylh2",
          "author": "ypeelS",
          "body": "are you saying Nintendo pays the tariffs?",
          "score": 1,
          "created_utc": 1745026768.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnr6o6d",
      "author": "av0w",
      "body": "Switch 2 is back on the menu boys!!",
      "score": 6,
      "created_utc": 1744982478.0,
      "replies": []
    },
    {
      "id": "mnrnbsb",
      "author": "GetFvckedHaha",
      "body": "The price won’t increase cause trump caved on tariffs.",
      "score": 3,
      "created_utc": 1744987862.0,
      "replies": []
    },
    {
      "id": "mnsxfsy",
      "author": "MarzMan",
      "body": "This is probably the best marketing ever, I have no need for a switch 2 at all but damn do I want one now. I feel like I NEED to get one.",
      "score": 1,
      "created_utc": 1745001660.0,
      "replies": [
        {
          "id": "mntt8nu",
          "author": "Aemort",
          "body": "... why?",
          "score": 6,
          "created_utc": 1745011762.0,
          "replies": [
            {
              "id": "mnu4jw4",
              "author": "ribbit43",
              "body": "FOMO. Nintendo's entire existence is based on FOMO",
              "score": 2,
              "created_utc": 1745015686.0,
              "replies": [
                {
                  "id": "mnwu3ur",
                  "author": "edvek",
                  "body": "Ya he's part of the problem. While no one \"needs\" this, the fact that he's being manipulated to feel that way is part of the problem. At least he can recognize it and only time will tell if he gives in.",
                  "score": 3,
                  "created_utc": 1745062683.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnzmnpy",
          "author": "akitash1ba",
          "body": "you live a sad, sad life",
          "score": 2,
          "created_utc": 1745097095.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mntvmek",
      "author": "Dropzone34",
      "body": "How does this not have an Oled screen. why go backwards from the switch one having an oled option but not this one.",
      "score": 2,
      "created_utc": 1745012557.0,
      "replies": [
        {
          "id": "mnul1um",
          "author": "bonesnaps",
          "body": "A mk2 version will release a year later to get people to double dip, simple greed tactics my guy.",
          "score": 7,
          "created_utc": 1745021649.0,
          "replies": []
        },
        {
          "id": "mnuycua",
          "author": "ypeelS",
          "body": "People are complaining about $450 being overpriced (it's not, its $62 more than OG Switch when adjusted for inflation) people would lose their minds if it launched at $500+ with an OLED",
          "score": 5,
          "created_utc": 1745026681.0,
          "replies": []
        },
        {
          "id": "mnuvqzp",
          "author": "rafikiknowsdeway1",
          "body": "you want it to be even more expensive? i mean, i'd pay more for an oled model, but having two models at launch would be even more of a logistic headache. plus it gets people to double dip",
          "score": 2,
          "created_utc": 1745025701.0,
          "replies": []
        },
        {
          "id": "mnwvfm4",
          "author": "None",
          "body": "They are catering to simpletons who think OLED are flashy lights on their controller.",
          "score": 1,
          "created_utc": 1745063338.0,
          "replies": []
        },
        {
          "id": "mnv0xd6",
          "author": "Ok_Bad_7061",
          "body": "I agree this is a silly decision. However, I personally play docked 99% of the time, so no major impact for me.",
          "score": 0,
          "created_utc": 1745027646.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnrirhu",
      "author": "DoubleSpook",
      "body": "Still not gonna buy it.",
      "score": 0,
      "created_utc": 1744986466.0,
      "replies": [
        {
          "id": "mntk59v",
          "author": "TheGreatBenjie",
          "body": "Good for you.",
          "score": 2,
          "created_utc": 1745008841.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnuf1xj",
      "author": "Nuggetzfan",
      "body": "Hard pass it’s over priced unfortunately.",
      "score": 2,
      "created_utc": 1745019456.0,
      "replies": []
    },
    {
      "id": "mnrhcam",
      "author": "ChafterMies",
      "body": "Trump added an exception to his liberation day tariffs for computers. Not sure if that also excludes a Switch 2, but if I were Nintendo, I’d argue that the web browser makes Switch 2 a computer and not a toy. That means the Trump tariffs applicable to Switch 2 are the extra 20% for goods from China. Not sure what margins Nintendo makes for Switch 2, but that extra 20% has to eat up a lot of it. I imagine Nintendo is going to do like Apple and fly in as much stock as they can before the tariff landscape changes.",
      "score": 2,
      "created_utc": 1744986022.0,
      "replies": [
        {
          "id": "mnrtdww",
          "author": "SoapyMacNCheese",
          "body": "I read that game consoles weren't included in that, but I got whiplash trying to follow that exemption so who knows at this point.",
          "score": 6,
          "created_utc": 1744989668.0,
          "replies": [
            {
              "id": "mnrunbf",
              "author": "ChafterMies",
              "body": "Keeping up with Trump’s tariffs has become a running joke at this point.",
              "score": 4,
              "created_utc": 1744990043.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mns2stc",
          "author": "rossisdead",
          "body": ">  I’d argue that the web browser makes Switch 2 a computer and not a toy\n\nI'd argue that it literally being a computer makes it a computer. Is there somewhere that explains what they're defining as a \"computer\" in this case? I can't find specifics.",
          "score": 3,
          "created_utc": 1744992487.0,
          "replies": [
            {
              "id": "mns5k3x",
              "author": "ChafterMies",
              "body": "Digging deeper, it looks like “video game consoles” aren’t included in the exceptions. These are classified with toys and not computers. The “radio remote control apparatus for video game consoles” is classified with computers but it ain’t included in the exceptions either.",
              "score": 3,
              "created_utc": 1744993336.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrk0qk",
          "author": "-Interceptor",
          "body": "wasn't US liberation suspended for 90 days?",
          "score": 6,
          "created_utc": 1744986854.0,
          "replies": [
            {
              "id": "mnrsvaj",
              "author": "SoapyMacNCheese",
              "body": "Sort of, but you can't plan your business around a 90 day delay (especially when that 90 days can be undone on a whim). China's didn't get delayed, and every other country on the list still got hit with 10% during the suspension.",
              "score": 5,
              "created_utc": 1744989515.0,
              "replies": []
            },
            {
              "id": "mnrlajd",
              "author": "ChafterMies",
              "body": "The 90 day suspension was on any Liberation Day tariff higher than 10%, except China. So unless covered by an exception, the cost of all goods for all countries is now 10% higher and 245% higher for China. The extra cost of 20% from goods from China came before Liberation Day, for a fentanyl emergency that Trump made up. And then there are the original China tariffs from Trump’s first term, but I think they had an exception for game consoles.",
              "score": 1,
              "created_utc": 1744987244.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mns4xf4",
      "author": "None",
      "body": "Not interested in reasons not to buy, because my son wants one for Christmas.\n\nThat said, Do i need order now or will it be available (maybe discounted?) around thanksgiving?",
      "score": 1,
      "created_utc": 1744993143.0,
      "replies": [
        {
          "id": "mns7f3i",
          "author": "first_timeSFV",
          "body": "Not to be rude, but look at the current presidents actions.\n\nIt's pretty foolish toe expect a cheaper price for the holidays with trump acting how he is and threatening nations, nintendos country included. \n\nIf anything, come holidays, expect $450 to be the holiday price.\n\nAs the price will probably end up increasing after launch thanks to trump. As nintendos own statement says \"For launch, price will be unchanged\".",
          "score": 12,
          "created_utc": 1744993905.0,
          "replies": [
            {
              "id": "mns7ztc",
              "author": "None",
              "body": "Yeah that makes sense. I guess I was really wondering if it will be sold out or difficult to get around the holidays. Maybe I should just get it now and not have to worry.",
              "score": 2,
              "created_utc": 1744994080.0,
              "replies": [
                {
                  "id": "mnsegll",
                  "author": "hindusoul",
                  "body": "Yes, most likely will be sold out",
                  "score": 3,
                  "created_utc": 1744995999.0,
                  "replies": []
                },
                {
                  "id": "mns8fha",
                  "author": "first_timeSFV",
                  "body": "I dont think it will be hard to get come holidays, since it seems they're trying to hurt scalpers by flooding the market with systems.\n\nBut to be on the safe side, and money's tight right now, I'd starting buying later September to early October before holiday shopping begins in November",
                  "score": 2,
                  "created_utc": 1744994213.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mo2f8yk",
          "author": "Prestigious_Cold_756",
          "body": "Don’t get one… It’s better to teach your son how disappointment feels like now, with something rather unimportant, then to hit him unprepared later with something he really cares about.",
          "score": 0,
          "created_utc": 1745142227.0,
          "replies": [
            {
              "id": "mo7eox1",
              "author": "None",
              "body": "Uh okay, thanks for the parenting advice",
              "score": 1,
              "created_utc": 1745208715.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mnrdu71",
      "author": "Robosnork",
      "body": "Seems reasonable. Potentially hundreds of hours of entertainment for 80 bucks after over a decade of no pricen increases, and a brand new system for 500 is not something to be upset over.",
      "score": -17,
      "created_utc": 1744984898.0,
      "replies": [
        {
          "id": "mnrgq4m",
          "author": "singlefate",
          "body": "$110 CAD before tax for a game is laughable and extremely justified to be upset over.",
          "score": 17,
          "created_utc": 1744985827.0,
          "replies": [
            {
              "id": "mnrk038",
              "author": "blood_vein",
              "body": "Is it? https://www.reddit.com/r/NintendoSwitch/s/NWmgGK9Wd\n\nAdjusted for inflation is not terrible. But I do agree game prices have come down over the last decade since its so cheap to produce the media nowadays. It's just arbitrary pricing",
              "score": -11,
              "created_utc": 1744986848.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrhe88",
          "author": "Garbage_Bear_USSR",
          "body": "Honestly, I expected much worse - like $550 - $600…this is definitely good news in context of the larger economic shitshow.",
          "score": -3,
          "created_utc": 1744986038.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mns252j",
      "author": "hiimbackagain",
      "body": "No story mode in MKW = no buy. Simple.",
      "score": -6,
      "created_utc": 1744992288.0,
      "replies": [
        {
          "id": "mntk0v6",
          "author": "TheGreatBenjie",
          "body": "What a dumb dealbreaker. MK has never had a story mode.",
          "score": 5,
          "created_utc": 1745008802.0,
          "replies": [
            {
              "id": "mq6twj6",
              "author": "hiimbackagain",
              "body": "MK also never had an open world. What a dumb thing! We hate new and fun stuff!",
              "score": 1,
              "created_utc": 1746190832.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mns59va",
          "author": "eccentricbananaman",
          "body": "Story mode? There's never been a story mode in Mario Kart. I was initially a bit disappointed that there weren't traditional races where you do laps on the same course, but apparently that option is available in vs mode. I'll have to see more of the courses to see how viable that is because it looked like a lot of the courses were designed as one straight path that doesn't loop.",
          "score": 5,
          "created_utc": 1744993250.0,
          "replies": [
            {
              "id": "mnsaj7w",
              "author": "neonlights326",
              "body": ">There's never been a story mode in Mario Kart.\n\n\nThere's never been an open world either.",
              "score": 4,
              "created_utc": 1744994842.0,
              "replies": [
                {
                  "id": "mnt4gk5",
                  "author": "That_One_Cool_Guy",
                  "body": "So your argument is that the game has more content than ever before, and because of that it needs to add another mode?\n\nThe story mode conversation is ridiculous IMO. This is the single biggest innovation of Mario Kart in 30+ years and people want more?",
                  "score": 5,
                  "created_utc": 1745003857.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mnsg37h",
              "author": "hiimbackagain",
              "body": "Yeah I forgrot Nintendo isn't creative and innovative. My mistake.\n\nThey should give us Diddy Kong Racing instead of this lame MKW stuff If they can't make a good open world cart racer.",
              "score": -5,
              "created_utc": 1744996477.0,
              "replies": [
                {
                  "id": "mnskkpy",
                  "author": "eccentricbananaman",
                  "body": "Oh yeah! Diddy Kong Racing would be sweet!",
                  "score": 1,
                  "created_utc": 1744997788.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mnrppim",
      "author": "Thoresus",
      "body": "I am one of the billions of people not from the USA, who also preordered. How does this affect me?",
      "score": -3,
      "created_utc": 1744988572.0,
      "replies": []
    },
    {
      "id": "mnuj238",
      "author": "tkhan456",
      "body": "The delay was never about the tariff. It was about the poor reception to the price and wanting to give people time to cool off and forgrt",
      "score": -4,
      "created_utc": 1745020912.0,
      "replies": [
        {
          "id": "mnuyp5h",
          "author": "ypeelS",
          "body": "except they increased the price of the accessories..?",
          "score": 4,
          "created_utc": 1745026804.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mns50aa",
      "author": "Real_Dotiko",
      "body": "\"The Company\"?\n \nYou mean Nintendo? The maker of Nintendo Switch? Now realesing the Nintendo Switch 2? \n \nThat company?",
      "score": -1,
      "created_utc": 1744993167.0,
      "replies": []
    },
    {
      "id": "mnsh1nc",
      "author": "jmaneater",
      "body": "The price is still going up. Because they left the price alone that mean tarrifs will still be applied and we will have to eat it. I can't believe that is not being talked about",
      "score": -4,
      "created_utc": 1744996758.0,
      "replies": []
    },
    {
      "id": "mnrd72s",
      "author": "pillbox_purgatory",
      "body": "The $500+ price for a console with a game….wasn’t gonna work pre-tariffs (inflation says hello), and it ain’t gone work today with all the chaos in the economy.\n\nThe product is grossly overpriced for an upgraded switch.",
      "score": -28,
      "created_utc": 1744984688.0,
      "replies": [
        {
          "id": "mnrpu7e",
          "author": "Mr_Festus",
          "body": "This comment won't age well.",
          "score": 4,
          "created_utc": 1744988611.0,
          "replies": [
            {
              "id": "mnrsee7",
              "author": "mhardegree",
              "body": "We’ll see in the coming months/years at what point inflation truly prices people out of things and how companies react when profits go up. Interesting times indeed",
              "score": 3,
              "created_utc": 1744989373.0,
              "replies": []
            },
            {
              "id": "mnrxz6q",
              "author": "pillbox_purgatory",
              "body": "Have you been around these last 5 years? The cost of living is astronomically high…and with all the instability being placed by the on-again/off-again tariffs, companies have already begun raising pricing on common goods and services.\n\nConsumers will have to make choices regarding what they purchase. A Switch 2 doesn’t feed families.",
              "score": 1,
              "created_utc": 1744991037.0,
              "replies": [
                {
                  "id": "mns92ss",
                  "author": "Mr_Festus",
                  "body": ">Have you been around these last 5 years? \n\nI have indeed!\n\n>A Switch 2 doesn’t feed families.\n\nNeither does the extra $100 or whatever you think it should cost less. But it buys hundreds of hours of entertainment for relatively little money. And people will be looking for affordable ways to keep their families having fun.",
                  "score": 2,
                  "created_utc": 1744994407.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mnrukf0",
          "author": "OcculusSniffed",
          "body": "You can say that all you want, but I venture I've gotten thousands of dollars worth of entertainment out of my switch, and I've been excited to buy this one from the get-go.  If I can get it at launch I will.  Just not from a scalper.",
          "score": -1,
          "created_utc": 1744990019.0,
          "replies": [
            {
              "id": "mnsdc6v",
              "author": "mcdougall57",
              "body": "If it's anything like our pre-orders in the UK have been then the 3rd party stores will be scalped. The pre-orders seem to come back regularly and it only took me a day of trying to get one using stock informers push notifications.",
              "score": 0,
              "created_utc": 1744995667.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mntw4al",
      "author": "Pudding_Hero",
      "body": "![gif](giphy|gaVqNvP1UkF0IIsQrT|downsized)",
      "score": 0,
      "created_utc": 1745012723.0,
      "replies": []
    },
    {
      "id": "mns0zxt",
      "author": "ZebbyD",
      "body": "Why anyone would spend the same price as a Series X or PS5 for a “console” that can barely play the equivalent games, that has half the library (should we even talk about quality? 15fps at 144p, such wow! Just look at Pokémon games, yikes), and those games NEVER go on sale… is beyond me.\n\nPeople who support Nintendo, or are even considering purchasing this, are living in some form of lah-lah land. 😂\n\nEdit: and just to head-off any of the mouth breathers, because I know you’re out there, I’ll leave this here,\n\n“Hyperbole is a figure of speech that uses exaggeration to emphasize a point or make a comparison.” - Merriam-Webster\n\nEdit 2: the fact that I get downvoted but NO ONE has anything to say in response kinda proves my point. Like, you’re mad at yourselves for this mess, but can’t articulate why, when you’ve only got yourselves to thank for all this. Y’all made your bed, now you gotta lie in it and you can’t stand that. So downvote away while tossing money at the greed machine! 🤷🏻‍♂️🤣",
      "score": -12,
      "created_utc": 1744991941.0,
      "replies": []
    },
    {
      "id": "mnut6h5",
      "author": "DazzJuggernaut",
      "body": "DROP THE PRICE",
      "score": -2,
      "created_utc": 1745024724.0,
      "replies": []
    },
    {
      "id": "mnsfacd",
      "author": "Spunndaze",
      "body": "Day one purchse for sure. You kids still whinging about the price ?",
      "score": -6,
      "created_utc": 1744996244.0,
      "replies": []
    },
    {
      "id": "mnrxvoj",
      "author": "Maserati777",
      "body": "Its kind of insane when you realize the system with 1 game and 5 games will cost 1000 dollars alone. Then any accessories will be in addition.\n\nIf you can only buy a couple games then I don’t think it will be worth it.\n\nMight be cheaper on Black Friday.",
      "score": -2,
      "created_utc": 1744991008.0,
      "replies": []
    },
    {
      "id": "mnr7ck6",
      "author": "SellaraAB",
      "body": "Nintendo has become a terrible company that is cancerous to the industry. Hope people let them fall flat on their face this time.\n\nTo the people asking why, [this video](https://youtu.be/iIYvvSLblHg?si=QbF2khe7_-4tNzzV) is a pretty good explanation. There’s a lot of writing on the topic, though, if you want to look into it. It’s just very bad for consumers.",
      "score": -52,
      "created_utc": 1744982716.0,
      "replies": [
        {
          "id": "mnrhggt",
          "author": "ChafterMies",
          "body": "How is Nintendo “cancerous to the industry”?",
          "score": 11,
          "created_utc": 1744986058.0,
          "replies": [
            {
              "id": "mnrps7w",
              "author": "stubble3417",
              "body": "Obviously Nintendo is not doing nearly enough to get kids in contact with predators or addicted to loot box gambling!",
              "score": 3,
              "created_utc": 1744988594.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnr93tt",
          "author": "gman5852",
          "body": "Nintendo is the only company that avoids crunch, mass layoffs, and delays games for quality control instead of releasing buggy garbage out the door.\n\nI guess those are good things in your eyes.",
          "score": 23,
          "created_utc": 1744983322.0,
          "replies": []
        },
        {
          "id": "mnr8lev",
          "author": "cobaltjacket",
          "body": "I hope you're not blaming the order/pricing issues on them. The issue is in Washington.",
          "score": 13,
          "created_utc": 1744983146.0,
          "replies": [
            {
              "id": "mnr9dpm",
              "author": "forte343",
              "body": "Nah probably the typical Nintendo won't let people profit off of fan games or put their games on PC type hate",
              "score": 9,
              "created_utc": 1744983418.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnr93po",
          "author": "sharpshooter999",
          "body": "Nintendo has this weird curse where they have one console be an absolute best seller, and then the next one an absolute flop. N64>GameCube, Wii>Wii U. Now we'll see what happens with the Switch 2. A lot of people got Switches for their kids because they're cheaper than Xbox and Playstation, not anymore",
          "score": -6,
          "created_utc": 1744983321.0,
          "replies": [
            {
              "id": "mnrcx3w",
              "author": "Critical_Method_2363",
              "body": "N64 was not a best seller it got dominated by Playstation that era.",
              "score": -1,
              "created_utc": 1744984597.0,
              "replies": [
                {
                  "id": "mnrgjaz",
                  "author": "sharpshooter999",
                  "body": "So SNES>N64?",
                  "score": 1,
                  "created_utc": 1744985767.0,
                  "replies": [
                    {
                      "id": "mnrtjei",
                      "author": "Critical_Method_2363",
                      "body": "It sold about 15 million more than the n64 did.",
                      "score": 2,
                      "created_utc": 1744989714.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mnr9krp",
          "author": "hardy_83",
          "body": "The only thing I think they are genuinely terrible and bad for the industry at is their treatment of fair use when people play their games online, or even just reporting on it.\nThey are AGGRESSIVE when people post even a second of footage of a Nintendo game.",
          "score": -4,
          "created_utc": 1744983485.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnr9zsy",
      "author": "54moreyears",
      "body": "Anyone who pre orders first gen anything is a tool.",
      "score": -29,
      "created_utc": 1744983627.0,
      "replies": [
        {
          "id": "mnrbtyp",
          "author": "None",
          "body": "Buddy, this is *by definition* the second generation.",
          "score": 21,
          "created_utc": 1744984241.0,
          "replies": [
            {
              "id": "mnrcfkd",
              "author": "bort_license_plates",
              "body": "And if you look at the overall history of Nintendo hardware, more like the 33rd generation.",
              "score": 8,
              "created_utc": 1744984437.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrbwzt",
          "author": "TheExile285",
          "body": "This doesn't make any sense? What about the people who legitimately want the system and plan to use it?",
          "score": 5,
          "created_utc": 1744984268.0,
          "replies": []
        },
        {
          "id": "mnrd5y3",
          "author": "christoskal",
          "body": "Are you talking about the first gen of Switch 2?\n\nWhat do you believe that 2 stands for?",
          "score": 4,
          "created_utc": 1744984677.0,
          "replies": [
            {
              "id": "mnrx8mq",
              "author": "eggrollking",
              "body": "2 mUcH mOnEy!1!!",
              "score": 2,
              "created_utc": 1744990816.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mnrap2w",
          "author": "a_snom_who_noms",
          "body": "I may not preorder it but I’ll probably buy it. I’ve been waiting for a sequel to Kirby Air Ride since I was 7. This is my time!",
          "score": 1,
          "created_utc": 1744983862.0,
          "replies": []
        },
        {
          "id": "mnrroz3",
          "author": "TheKingsPride",
          "body": "Unless it happens to be that years later the only version of the hardware that can be homebrewed is the first gen. But that would never happen, right?",
          "score": 1,
          "created_utc": 1744989161.0,
          "replies": []
        },
        {
          "id": "mnvnf5j",
          "author": "TMStage",
          "body": "I'm preordering it and it's gonna sit in my fucking closet until the inevitable day-one-patch-only exploit comes out for it.",
          "score": 1,
          "created_utc": 1745037326.0,
          "replies": []
        },
        {
          "id": "mpmbu42",
          "author": "54moreyears",
          "body": "Tools of the system. If you made them wait until people started buying and trying and finding issues but no preorder so we get broken shit. Dumbass nerds. Now they just get free money for often half completed shit.",
          "score": 1,
          "created_utc": 1745909569.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mns0838",
      "author": "reichjef",
      "body": "They probably have done enough analysis now and realized that the console can be a deeper loss leader as the software will be big profit runners. Nintendo always was able to take a bit more heat on the console because they have such solid first party development.",
      "score": -1,
      "created_utc": 1744991708.0,
      "replies": []
    },
    {
      "id": "mnsmvua",
      "author": "PsyJak",
      "body": "*24th April",
      "score": -1,
      "created_utc": 1744998464.0,
      "replies": []
    },
    {
      "id": "mnueuwz",
      "author": "None",
      "body": "[removed]",
      "score": -1,
      "created_utc": 1745019386.0,
      "replies": [
        {
          "id": "mnugw9v",
          "author": "branchoflight",
          "body": "You are a strange bot.",
          "score": 3,
          "created_utc": 1745020115.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mnr8fky",
      "author": "Greyboxer",
      "body": "The price, widely panned for being way too high, will not decrease",
      "score": -17,
      "created_utc": 1744983091.0,
      "replies": []
    },
    {
      "id": "mnr9kiq",
      "author": "None",
      "body": "[deleted]",
      "score": -15,
      "created_utc": 1744983482.0,
      "replies": [
        {
          "id": "mnrlus8",
          "author": "tyderian",
          "body": "I thought it was region-free except for Japan.",
          "score": 1,
          "created_utc": 1744987414.0,
          "replies": [
            {
              "id": "mnryg8c",
              "author": "Independent-Run-8315",
              "body": "I’ll just downvoted again but skillup video explains it: \n\nThe way we avoid the tariff on switch is coz the cooling system or something else is made in a place other than China while the others are made in china. Nintendo won’t be importing the china models to us to avoid overpriced consoles",
              "score": -4,
              "created_utc": 1744991179.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mnrc0s0",
      "author": "Fredasa",
      "body": "I still expect it to be region locked, and mostly expect the launch date in the US to be delayed, due to said unplanned region locking.  Will be waiting to spy that announcement.",
      "score": -23,
      "created_utc": 1744984303.0,
      "replies": [
        {
          "id": "mnrdfzc",
          "author": "hatramroany",
          "body": "There is only one Japanese exclusive region locked version. Nowhere else in the world are they region locked",
          "score": 9,
          "created_utc": 1744984769.0,
          "replies": [
            {
              "id": "mntdx8k",
              "author": "Fredasa",
              "body": "The existence of that version of the console reveals that Nintendo can easily afford to charge less, and only do not because they understand that scalpers will ensure that the rest of the world's supply will be scooped up even if it's not directly by consumers.  I am suggesting that Nintendo has the option of region locking other territories in their back pocket, and they can use it to counter, for example, how tariffs might otherwise affect their bottom line.",
              "score": -2,
              "created_utc": 1745006887.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}