{
  "post": {
    "title": "Surface Laptop 13-inch review: a little less for a little less",
    "author": "dapperlemon",
    "id": "1l0vacv",
    "score": 334,
    "created_utc": 1748800537.0,
    "selftext": "",
    "num_comments": 17,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l0vacv/surface_laptop_13inch_review_a_little_less_for_a/"
  },
  "comments": [
    {
      "id": "mvgp45c",
      "author": "OrganicKeynesianBean",
      "body": "“It’s got a little something less for everyone.”\n\n-IGN",
      "score": 96,
      "created_utc": 1748804960.0,
      "replies": [
        {
          "id": "mvhggi8",
          "author": "Egalitarian_Wish",
          "body": "The surface makes you FEEL like a laptop.",
          "score": 25,
          "created_utc": 1748813440.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvh9yy2",
      "author": "ScientiaProtestas",
      "body": "There are many users that are very happy with windows for arm, over on r/surface.  Not all of my usage is through a browser, so I got a Surface Laptop with Intel.  And many apps do have Arm versions.\n\nSo this might be a good deal for some.",
      "score": 30,
      "created_utc": 1748811351.0,
      "replies": [
        {
          "id": "mvjrhee",
          "author": "BenjiSBRK",
          "body": "My current laptop is a Surface Laptop Go 2, which is a bit underpowered, but my usage is mostly Chrome and a few other things. I've been on the lookout for a replacement but there are no alternatives with this form factor and build quality. The 13\" Surface Laptop might finally be it.",
          "score": 4,
          "created_utc": 1748847361.0,
          "replies": [
            {
              "id": "mvjuiyo",
              "author": "ScientiaProtestas",
              "body": "r/surface is a good place to post any questions you might have.  Most things will run under emulation if there isn't native support.  Battery life of the previous arm model was great.  \n\nI am sure people will post reviews on there.\n\nYou could also check out last years, Surface Laptop 7 SnapDragon, which starts at $999, and you can find it on sale.",
              "score": 2,
              "created_utc": 1748849173.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvi8oqa",
          "author": "IBJON",
          "body": "I have a surface pro with a Snapdragon chip. It can do literally everything my Intel laptop can do so I'm not sure what you mean in regards to not doing everything through a browser. The apps that don't have a dedicated ARM build can usually be emulated and Windows will do that automatically \n\nThe only app I haven't been able to run is software for my Camera, and that's a Sony issue ",
          "score": 7,
          "created_utc": 1748823202.0,
          "replies": [
            {
              "id": "mvirewy",
              "author": "ScientiaProtestas",
              "body": "Gaming is better on the Intel version.  I do coding, so things work better if I stick with Intel.  Last I checked, Ableton wasn't working.",
              "score": 17,
              "created_utc": 1748830260.0,
              "replies": [
                {
                  "id": "mvirm51",
                  "author": "IBJON",
                  "body": "I'm a developer as well and I've had no issues. \n\n\nI'm not gaming on a surface tablet though and I'm sure that goes for most people ",
                  "score": 0,
                  "created_utc": 1748830338.0,
                  "replies": [
                    {
                      "id": "mvjhbpb",
                      "author": "ScientiaProtestas",
                      "body": "I am glad you like yours.  As I said, many are happy with them.",
                      "score": 4,
                      "created_utc": 1748841741.0,
                      "replies": []
                    },
                    {
                      "id": "mvnd4b3",
                      "author": "sosthaboss",
                      "body": "It’s great that it works for you but boldly pronouncing “it can do literally everything intel can do” is just wrong. Lots of people use apps that can’t easily be emulated/ported, even if you don’t. \n\nFWIW I had an old arm surface 2 tablet back in the day so I’ve run into this personally. I’m sure it’s better now, though",
                      "score": 4,
                      "created_utc": 1748894926.0,
                      "replies": [
                        {
                          "id": "mvnhf3p",
                          "author": "IBJON",
                          "body": "> It’s great that it works for you but boldly pronouncing “it can do literally everything intel can do”\n\n\nIf you're going to quote me, get the quote right because I didn't say \"it can do everything Intel can do\" I said \"it can do everything my Intel *laptop* can do\", meaning everything I do on my laptop (which is quite a bit as I'm a software engineer and a grad student) can be done on my Surface Pro. Yes, there are issues with compatibility and emulation (which I acknowledged), but I was also clearly speaking anecdotally. ",
                          "score": -1,
                          "created_utc": 1748896144.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mvhz1il",
          "author": "linuxsoftware",
          "body": "This guys a bot for sure MacBook Air is the same price 💻",
          "score": -6,
          "created_utc": 1748819793.0,
          "replies": [
            {
              "id": "mvi11nh",
              "author": "Prince_Uncharming",
              "body": "label continue one alive attempt sink smile relieved spark subtract\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 17,
              "created_utc": 1748820488.0,
              "replies": [
                {
                  "id": "mvmzamf",
                  "author": "TheReverend5",
                  "body": "It’s not surprising if you’ve been paying attention since the M chips were released. Apple Laptops have been among the best options in their price segments since the M1 laptops. Depending on when in the lifecycle you were comparing, sometimes there was no other remotely comparable competition in terms of mobile computing for the money.",
                  "score": 2,
                  "created_utc": 1748890921.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mvirsbr",
              "author": "ScientiaProtestas",
              "body": "If you are talking to me, I needed a Windows computer.  So a MacBook would not be a good deal.",
              "score": 7,
              "created_utc": 1748830403.0,
              "replies": [
                {
                  "id": "mvved05",
                  "author": "linuxsoftware",
                  "body": "More like you need to stfu and get a MacBook 💻",
                  "score": 0,
                  "created_utc": 1748998702.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}