{
  "post": {
    "title": "Legion Go S With SteamOS Review: The Only Real Alternative to Steam Deck",
    "author": "dapperlemon",
    "id": "1lo1dt1",
    "score": 1123,
    "created_utc": 1751268604.0,
    "selftext": "",
    "num_comments": 225,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lo1dt1/legion_go_s_with_steamos_review_the_only_real/"
  },
  "comments": [
    {
      "id": "n0k3dda",
      "author": "ToMorrowsEnd",
      "body": "It also can have its SSD upgraded if you know how tools work.",
      "score": 160,
      "created_utc": 1751281708.0,
      "replies": [
        {
          "id": "n0ku1gj",
          "author": "lolheyaj",
          "body": "I'm only interested if I'm able to snap my SD card in half also. ",
          "score": 61,
          "created_utc": 1751291972.0,
          "replies": []
        },
        {
          "id": "n0mofun",
          "author": "BigSwagPoliwag",
          "body": "I know how hammers work, sign me up!",
          "score": 17,
          "created_utc": 1751311098.0,
          "replies": []
        },
        {
          "id": "n0nmlwg",
          "author": "NoPassage134",
          "body": "Steamdecks still better",
          "score": 1,
          "created_utc": 1751321268.0,
          "replies": [
            {
              "id": "n6gzxqq",
              "author": "No_Afternoon6748",
              "body": "Only for the extra trackspads and 2 more back buttons. Other that it doesnt do good for gaming like legion",
              "score": 1,
              "created_utc": 1754106847.0,
              "replies": [
                {
                  "id": "n6h2f5w",
                  "author": "NoPassage134",
                  "body": "You must be karma farming. My comment is from over a month ago...\n\nIt's the best handheld console ever. It's the most versatile as well.",
                  "score": 0,
                  "created_utc": 1754107945.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0kfl47",
      "author": "thekeffa",
      "body": "I have both of these devices.\n\nIgnore the other comments about the Legion not having a trackpad/mousepad. It absolutely does have one.\n\nThe SteamDeck is the superior device, but I don't think you would feel like you made an error if you bought the Legion as long as it is the SteamOS version.\n\nAlso, as something of a PSA, the SteamDeck supports wireless mice and keyboards. If you feel the game that you are playing is too difficult with the thumbsticks or trackpads.",
      "score": 73,
      "created_utc": 1751286964.0,
      "replies": [
        {
          "id": "n0m6uwu",
          "author": "jalerre",
          "body": "I don’t know that the Steamdeck is necessarily the superior device. The Legion Go S has a larger, higher refresh rate, higher resolution screen and a better processor (and potentially more RAM). It depends if you value that more than OLED and larger dual trackpads.",
          "score": 31,
          "created_utc": 1751306056.0,
          "replies": [
            {
              "id": "n0mok2y",
              "author": "thekeffa",
              "body": "It's always going to be subjective as it's not so clear cut between them, but with practical experience of both I can say the OLED and the smoothness/compatibility of the games wins it out for me, as well as the overall feel of just a better built product. That and the fact it supports bluetooth mice and keyboards as some games just do not make the transition well to thumb controllers.\n\nBut I did point out that the Legion Go S isn't something you would feel you made a mistake with if you bought it instead of a SteamDeck. If I had to have a Legion Go S instead of a SteamDeck, I wouldn't feel aggrieved about it.",
              "score": 10,
              "created_utc": 1751311131.0,
              "replies": [
                {
                  "id": "n0rquni",
                  "author": "GrayDaysGoAway",
                  "body": "I had an OLED Deck and sold it for an Ally X last year because OLED doesn't matter much when the resolution is only 800p. Modern games just straight up don't look good on the Deck imo. Plus compatibility sucks as it doesn't support things like gamepass or even basic anticheats.",
                  "score": 7,
                  "created_utc": 1751382494.0,
                  "replies": [
                    {
                      "id": "n0rva0z",
                      "author": "ThePandaKingdom",
                      "body": "I liked my steamdeck so much i bought an Ally. I put steam OS on it the other week, unsure of how i would feel about it and i can say that i am loving it over windows. It feels a lot better for a device with its use case",
                      "score": 3,
                      "created_utc": 1751383710.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0nk88w",
                  "author": "jalerre",
                  "body": "I don’t disagree, just pushing back against the idea that the Steamdeck is the definitively superior device.",
                  "score": 2,
                  "created_utc": 1751320510.0,
                  "replies": []
                },
                {
                  "id": "n1b5srh",
                  "author": "None",
                  "body": "[removed]",
                  "score": 1,
                  "created_utc": 1751638403.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0kzx1z",
          "author": "DeadButGrateful",
          "body": "From the article:\n\n\"What is missing from Lenovo’s design are the Steam Deck’s two trackpads. Those haptic trackpads add a surprising amount of versatility in some games, especially in CRPGs or strategy games like Tactical Breach Wizards. The minuscule trackpad on the Legion Go S didn’t even seem to work out of the box. I had such a bad experience with it on the Windows version—with it vibrating like a rabbit dipped into a freezing-cold lake—I wasn’t keen to fix it.\"",
          "score": 15,
          "created_utc": 1751293797.0,
          "replies": [
            {
              "id": "n0lgb6b",
              "author": "thekeffa",
              "body": "> The minuscule trackpad on the Legion Go S didn’t even seem to work out of the box\n\n> I had such a bad experience with it on the ***Windows*** version...\n\nMy emphasis.\n\nThe other comments are saying it does not have one at all. Yet it clearly does.\n\nThe one on the SteamOS version works fine for me. I won't deny its not quite as useful as having two (Hence my pointing out the SteamDeck is the superior device), but the Legion S *DOES* have a trackpad.\n\nAnd in my experience there was nothing wrong with it, outside of the trackpad being generally crap for controlling games, as all trackpads are in my opinion (Including the SteamDeck ones).",
              "score": 10,
              "created_utc": 1751298606.0,
              "replies": [
                {
                  "id": "n0oadkt",
                  "author": "BurantX40",
                  "body": "It's great for me. I use a trackpad mouse, so I'm more keyed into my thumb being very precise compared to a joystick in which I have to push and relieve pressure on to be accurate.",
                  "score": 2,
                  "created_utc": 1751329148.0,
                  "replies": []
                },
                {
                  "id": "n2wa36a",
                  "author": "CatProgrammer",
                  "body": "I thought that little thing was a fingerprint reader. ",
                  "score": 2,
                  "created_utc": 1752414042.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2ae1l7",
          "author": "Healthy_Wolverine_75",
          "body": "I am curious, since you have both devices. The Lenovo can run games at a higher resolution, with a higher refresh rate and more fps than the Steam Deck. Theoretically therefore, if you were willing to bring the fps down to whatever the steam deck gets per game, you could raise the graphical presets. \n\nSo strictly speaking in terms of graphics, to someone who has never seen either system in person - on two equal displays, the game with the higher resolution and higher graphical settings is going to look better. Is the Steam Deck’s OLED screen really that good that it can offset those disadvantages?",
          "score": 2,
          "created_utc": 1752111893.0,
          "replies": [
            {
              "id": "n2bqvuc",
              "author": "thekeffa",
              "body": "On the balance of just the screen and the screen alone being the deciding factor the Legion would probably edge it. The deeper colours of the OLED screen on the SteamDeck are nice but so is the higher resolution and higher FPS on the Legion. If it was just down to that I might pick the Legion. However one thing to remember is the Legion has a slightly bigger screen so that increased resolution spreads out over more screen estate. \n\nBut it’s not just the screen that is the deciding factor and that makes the difference.\n\nThis is likely subjective but the resolution is something that either bothers you or it doesn’t and if you have never seen the difference it doesn’t bother you. Also some games are a bit hard to see on the small screen so having a larger resolution doesn’t always help. Now this might also be subjective to the person but even if you do see the difference it’s not so great that you go “Oh wow I can never go back to the SteamDeck”. It’s just a bit better. Not game changing better. \n\nAnd here’s the thing. Some games don’t run well at that higher setting. They are both great devices but they aren’t gaming PC’s and sometimes a game doesn’t run quite as well on the Legion as the SteamDeck. And that is the real beauty of the SteamDeck. If Steam says it runs, it runs. No frame rate drops, no chug, no tinkering. The Legion performance and experience isn’t quite as smooth. Some games need a tinkering with to get them optimised.\n\nAdd to the fact the steam deck has better controls and options and it just feels like the better device. But as I said it’s close enough that if you bought the Legion you aren’t going to feel like you bought an inferior device in the slightest. I’d be happy with either device and would not regret buying one over the other no matter which one I went with.",
              "score": 2,
              "created_utc": 1752133648.0,
              "replies": []
            },
            {
              "id": "n3cvlnj",
              "author": "PartyDifficult",
              "body": "I have the Legion Go S SteamOS ($599) and I could tell you from experience that it struggles with fps on 1200p with most games. Sometimes even on 1080.\n\nI currently have that one and the Steam Deck OLED and been struggling for the last month on which one to keep.",
              "score": 1,
              "created_utc": 1752623617.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0khrod",
          "author": "Sick_Wave_",
          "body": "The Go s does not have a track pad",
          "score": -21,
          "created_utc": 1751287790.0,
          "replies": [
            {
              "id": "n0klj3v",
              "author": "thekeffa",
              "body": "Yes it does. I have one. Stop posting misinformation.\n\nTake a look at a photo of one. You can see it in the damn photo.",
              "score": 13,
              "created_utc": 1751289145.0,
              "replies": [
                {
                  "id": "n0kvj9d",
                  "author": "FullOnBeliever",
                  "body": "No it doesn’t! \n\nSorry, I don’t mean it, I just wanted to feel like a stupid asshole for a second. lol.",
                  "score": 9,
                  "created_utc": 1751292443.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0rk0zl",
              "author": "sammyfrosh",
              "body": "It does have a track pad. Just not as flexible as the one on the deck.",
              "score": 2,
              "created_utc": 1751380492.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0kx1wf",
      "author": "physeK",
      "body": "Just a callout that is purely anecdotal and might be worthless here… I’m an original Legion Go owner. I loaded Bazzite onto it and have been exceedingly happy with it — it’s basically SteamOS but with some extra customization options.\n\nLiterally last night, inspired by some other posts that I saw, I installed the official SteamOS release onto it instead. I know it’s not technically officially supported, but most folks were saying that it was functional.\n\nWell, it wasn’t. My FPS in the Steam interface (outside of any games) was pathetically poor, I was seeing consistent drops to less than 60FPS and brief hangs that brought me into the 10s. I tried to play one game — Sworn, which is similar to Hades — and it was holding a steady 20FPS at 720p.\n\nI loaded Bazzite back onto it. Consistent 144hz in the OS, 55-60FPS at 1600x900 resolution while on the “Balanced” TDP profile. Night and day difference.\n\nNow I noticed while poking the BIOS to disable secure boot that my Legion Go was set to the “quiet” hardware mode, which is an 8W TDP. (I don’t recall setting that myself, but I might’ve done so a year ago or more.) I didn’t see anywhere to customize TDP draw in SteamOS like I did with Bazzite, and that well may have accounted for the performance dip. But without a quick way to customize, forced to go into the BIOS, it would be annoying. I’m guessing there are things that one could install to allow for this control, but that’s an extra step!\n\nTl;dr, original Legion Go is great especially with Bazzite. My experience with SteamOS was subpar, but might’ve been my own fault.",
      "score": 42,
      "created_utc": 1751292920.0,
      "replies": [
        {
          "id": "n0roskc",
          "author": "SSD84",
          "body": "Thanks for your input. The original legion go was on sale for $500 on Amazon so I was wondering how it worked with steam OS. I also wonder if Valve will work on it as much as they are working on with ROG Ally. Considering that lenovo just released the legion go with same exact specs",
          "score": 3,
          "created_utc": 1751381895.0,
          "replies": [
            {
              "id": "n0rs4ce",
              "author": "physeK",
              "body": "The Legion Go S is supposed to have “official” support for SteamOS, so they’re working with Lenovo for sure. The original Legion, perhaps not. I’ve seen other reports of it working well. I suspect that if my TDP wasn’t set for 8W the experience may have been better, and I believe that there are tools available to allow for TDP switching in SteamOS as well.\n\nFrom my experience, the SteamOS installation was smooth and seamless, definitely the quickest OS install I’ve ever done. But, while it’s a tad bit more complex, I returned to Bazzite for 99% of the same experience with some additional stuff built-in. I’m not sure if they have an image specifically for the Legion Go but it’s available in the “device” dropdown menu, so it’s definitely tested, at a minimum. I’ve been very happy with it for my Steam games, which is 99% of my Steam library.\n\nOnce Windows releases their “improved handheld experience” or whatever alongside the Xbox Ally (or whatever it’s called) I’ll probably give Windows a shot again, because rumor is that as part of the project they’re cutting way down on bloat, boosting performance, and suppressing a lot of the annoyances… While maintaining full Windows compatibility, including all launchers and Xbox Gamepass.",
              "score": 1,
              "created_utc": 1751382849.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0kgfph",
      "author": "MassLuca007",
      "body": "I don't see why no one talks about the rog Ally and only the Steam deck. Do people really not like handheld windows? I don't really find it that bad",
      "score": 91,
      "created_utc": 1751287288.0,
      "replies": [
        {
          "id": "n0kvgg3",
          "author": "Neriya",
          "body": "> Do people really not like handheld windows?\n\nExactly this.",
          "score": 172,
          "created_utc": 1751292418.0,
          "replies": [
            {
              "id": "n0nqjl8",
              "author": "QueezyF",
              "body": "I’m not gonna buy one, but I’m interested how the one with Xbox integration performs.",
              "score": 9,
              "created_utc": 1751322542.0,
              "replies": []
            },
            {
              "id": "n0rsckq",
              "author": "GrayDaysGoAway",
              "body": "I like it because it's compatible with everything. With SteamOS you can't even use basic stuff like gamepass or popular streaming apps without jumping through a bunch of hoops. It was a massive pain in the ass for me and contributed greatly to my decision to sell my Deck.",
              "score": 5,
              "created_utc": 1751382912.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0l5f7r",
          "author": "augustocdias",
          "body": "I don’t like windows anywhere. Not only handhelds",
          "score": 100,
          "created_utc": 1751295433.0,
          "replies": [
            {
              "id": "n0mbpcq",
              "author": "Darkhoof",
              "body": "I don't know. I like them in my walls to let the light in.",
              "score": 17,
              "created_utc": 1751307418.0,
              "replies": []
            },
            {
              "id": "n0lh2qt",
              "author": "MOOshooooo",
              "body": "![gif](giphy|Rhbi2mluusqxq)\n\nWere you raised by Buffalo Bill?",
              "score": 13,
              "created_utc": 1751298822.0,
              "replies": [
                {
                  "id": "n0lvdnp",
                  "author": "WondyBorger",
                  "body": "This got me",
                  "score": 4,
                  "created_utc": 1751302926.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0ko3yx",
          "author": "BleuTime",
          "body": "im dual booting on this exact handheld, and I'm not really having issues with windows",
          "score": 18,
          "created_utc": 1751290037.0,
          "replies": []
        },
        {
          "id": "n0kye4p",
          "author": "mackandelius",
          "body": "If it wasn't for the fact that I like dabbling with Linux then my Steam Deck would have felt like a console.\n\nWindows on a handheld is not even close to being that seamless, it just isn't made for screens that small or the controls available on a handheld.",
          "score": 34,
          "created_utc": 1751293333.0,
          "replies": [
            {
              "id": "n0ms1m0",
              "author": "SexyOctagon",
              "body": "The UI is terrible for handhelds, but also the OS is shit at power management.",
              "score": 11,
              "created_utc": 1751312166.0,
              "replies": [
                {
                  "id": "n0rkg4z",
                  "author": "sammyfrosh",
                  "body": "It’s also very bloated.",
                  "score": 2,
                  "created_utc": 1751380616.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0kytaw",
          "author": "KasseanaTheGreat",
          "body": "No track pads. Once you've used the track pads on the Steam Deck no device without them is a genuine competitor to the Deck",
          "score": 35,
          "created_utc": 1751293462.0,
          "replies": [
            {
              "id": "n0l77ui",
              "author": "BrunoEye",
              "body": "Yeah, the controller aspect of the steam deck is significantly above the competition.",
              "score": 14,
              "created_utc": 1751295959.0,
              "replies": []
            },
            {
              "id": "n0lrzna",
              "author": "Persian2PTConversion",
              "body": "Yeah, not having a decent sized track pad is a deal breaker. Have fun playing Rimworld on an analog stick, or a track pad the size of your pinky. The Steam Deck configuration is the clear winner, nothing comes close. Now if only it was a bit faster..",
              "score": 11,
              "created_utc": 1751301970.0,
              "replies": [
                {
                  "id": "n0mjf2x",
                  "author": "jay227ify",
                  "body": "All they'd need to do for the deck 2 is just increase the chips speed and keep the same battery life, keeping everything the same and people would be extremely happy.\n\nObv QOL stuff like 16:9 for seamless docking, including a dock, detachable controllers, anti cheat, resolution bump, less small glitches would all be great but the deck is already so close to perfection where it matters.",
                  "score": 5,
                  "created_utc": 1751309664.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0otz1d",
              "author": "tyrantcv",
              "body": "I keep seeing people mention how amazing the track pads are but I barely use them, I've tried in a few games to replace a mouse and I feel like I have more control using the joystick, what am I doing wrong lol",
              "score": 4,
              "created_utc": 1751336098.0,
              "replies": []
            },
            {
              "id": "n0rrenz",
              "author": "GrayDaysGoAway",
              "body": "Hard disagree. I owned a Deck, got rid of it last year and got an Ally X, and haven't for one second missed the trackpads. I found them extremely awkward to game with and only used ever them because the touchscreen on the Deck is comically bad.",
              "score": 2,
              "created_utc": 1751382651.0,
              "replies": [
                {
                  "id": "n0rxq3k",
                  "author": "KasseanaTheGreat",
                  "body": "What types of games do you tend to play on your handhelds? Just from experience I'm not sure if I could play something like Crusader Kings 3 or Civ 6 as much as I have on the Deck without the trackpads.",
                  "score": 2,
                  "created_utc": 1751384376.0,
                  "replies": [
                    {
                      "id": "n0ryrjh",
                      "author": "GrayDaysGoAway",
                      "body": "That's fair, strategy would be a different beast. But I wouldn't want to play those on such a small screen tbh. I mostly stick to action adventure games, fighters, RPGs, puzzle games, etc on handheld. For more involved games I play on my regular PC.",
                      "score": 2,
                      "created_utc": 1751384661.0,
                      "replies": [
                        {
                          "id": "n0rzmej",
                          "author": "KasseanaTheGreat",
                          "body": "They're a lot better on the handhelds than most people give them credit for (CK3 I'm pretty sure I've put more hours in on the Deck than on a proper PC). CK3 in particular gives you a lot of control to scale up the UI to make it feel more specifically designed for a handheld screen.",
                          "score": 1,
                          "created_utc": 1751384893.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0mtndv",
          "author": "punIn10ded",
          "body": "As it currently stands is a sub par experience. Navigating the desktop is such a subpar experience.\n\nBut for me personally it's the lack of instant pause and resume. IMHO a portable device without that is pointless. Steamdeck and the Switch have it. Windows portables do not.",
          "score": 4,
          "created_utc": 1751312652.0,
          "replies": []
        },
        {
          "id": "n0mu8gf",
          "author": "Oops_I_Cracked",
          "body": "Absolutely people do not like windows on a handheld. Even Microsoft knows this, that’s why they’ve given the Xbox team broad power to customize windows in ways they’ve never been allowed to before on the new Xbox branded handheld",
          "score": 3,
          "created_utc": 1751312825.0,
          "replies": []
        },
        {
          "id": "n0li1n3",
          "author": "ultratorrent",
          "body": "I'm running an Ally X and have been hating windows more every day since Windows 11 came out.",
          "score": 10,
          "created_utc": 1751299098.0,
          "replies": []
        },
        {
          "id": "n0kjm7f",
          "author": "User9705",
          "body": "It’s because your use to it. I have the Legion Go with steam and works perfectly. No bloat and ready to go in under 10 seconds. Since it runs Linux also, the desktop mode runs great without all the Windows updates and telemetry software.",
          "score": 10,
          "created_utc": 1751288467.0,
          "replies": []
        },
        {
          "id": "n0l4oqv",
          "author": "GhormanFront",
          "body": "I have the rog ally and I've loved it so far, haven't had any issues with windows personally. \n\nPeople seem to think track pads are an absolute necessity but I don't",
          "score": 7,
          "created_utc": 1751295218.0,
          "replies": [
            {
              "id": "n0l6aw2",
              "author": "Fairtex_",
              "body": "I had a steam deck for 6 months and used the track pads…. Let me see……\nZero times.",
              "score": 6,
              "created_utc": 1751295690.0,
              "replies": [
                {
                  "id": "n0lpwhd",
                  "author": "hotshot0123",
                  "body": "Depends on what games you play. \n\nCRPG, RPG with a lot of crafting menus, Visual novels will need a trackpad.",
                  "score": 8,
                  "created_utc": 1751301366.0,
                  "replies": []
                },
                {
                  "id": "n0ouvyv",
                  "author": "Alienhaslanded",
                  "body": "That's normal amongst console players. The trackpads are very useful when you're more familiar with PC in general.",
                  "score": 1,
                  "created_utc": 1751336424.0,
                  "replies": []
                },
                {
                  "id": "n0mojij",
                  "author": "Cheezewiz239",
                  "body": "1 year and I've used It pretty much zero times. It was too underpowered for me so I sold it for something else.",
                  "score": 1,
                  "created_utc": 1751311127.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0npldx",
              "author": "Cheesewiz-99",
              "body": "I love my rog ally too. Windows really isn't an issue, and I have steam,  epic and gamepass all on it. Best of all 3 worlds.  Plus it's easy to play other games not on one of the big store fronts.",
              "score": 1,
              "created_utc": 1751322230.0,
              "replies": []
            },
            {
              "id": "n0owcj4",
              "author": "Cbeckstrand",
              "body": "Yeah, I don't get all the windows hate. I moved from the SD to the Ally and have enjoyed it. All the Win11 vs SteamOS benchmarks I have seen on the Ally show the difference is negligable.",
              "score": 1,
              "created_utc": 1751336960.0,
              "replies": [
                {
                  "id": "n0oxiu4",
                  "author": "LiftSleepRepeat123",
                  "body": "> Yeah, I don't get all the windows hate.\n\nYou're either not a poweruser, or you've only learned how how to be a poweruser within the Microsoft ecosystem.",
                  "score": 1,
                  "created_utc": 1751337398.0,
                  "replies": [
                    {
                      "id": "n0oyafv",
                      "author": "Cbeckstrand",
                      "body": "Guilty of the latter. I have also used MacOS and Linux but they have never clicked.",
                      "score": 1,
                      "created_utc": 1751337687.0,
                      "replies": [
                        {
                          "id": "n0oz21v",
                          "author": "LiftSleepRepeat123",
                          "body": "My prejudice comes from being a Linux and Mac poweruser who has been able to configure my system exactly for my needs. Chief among these are keyboard shortcuts (superior on Mac keyboard) and mouse shortcuts for moving and resizing windows (an option in any Unix-based operating system). You may not care about these things, but I do, and I don't spend all that much of my computer use gaming, so it takes secondary consideration (I just buy a separate PC just for gaming at this point though).\n\nThe fact is that Windows is more of a walled garden, has less customizability, and continues to push some of the most ridiculous sales tricks on people, and yet the gaming community which normally opposes large corps for their greed, seem to think that simply using older Microsoft IP (ie Windows 7 when 10 was out, or 10 when 11 came out) is somehow sticking it to the man.",
                          "score": 1,
                          "created_utc": 1751337975.0,
                          "replies": [
                            {
                              "id": "n0p1ezz",
                              "author": "Cbeckstrand",
                              "body": "I should have phrased my comment better. I do understand some of the hate for windows on a handheld since it is very clunky and not well optimized for gaming with all the junk running in the background. For someone expecting a console experiance I can absolutely see the appeal of SteamOS.\n\nThe problem is that so many people think SteamOS is the solution for eveything. I had far more frustration with my SteamDeck why I tried to do anything outside of Steam and I have enjoyed the Ally so much more , even with all windows quirks. I know this is largely because of my lack of Linux knowledge but I don't see how anyone non-technical would have any better experiance if they venture outside of the Steam wall garden.",
                              "score": 1,
                              "created_utc": 1751338866.0,
                              "replies": [
                                {
                                  "id": "n0p2kjo",
                                  "author": "LiftSleepRepeat123",
                                  "body": "Until today, I had never heard of people trying to use SteamOS as a real OS.",
                                  "score": 1,
                                  "created_utc": 1751339315.0,
                                  "replies": [
                                    {
                                      "id": "n0p9u9c",
                                      "author": "Cbeckstrand",
                                      "body": "I had to boot into the desktop mode all the time to install apps outside of Steam like game launchers, EmuDeck, ect.",
                                      "score": 1,
                                      "created_utc": 1751342230.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0m8756",
          "author": "gokarrt",
          "body": "it's bad enough that microsoft themselves are very publicly trying to unfuck it",
          "score": 3,
          "created_utc": 1751306423.0,
          "replies": []
        },
        {
          "id": "n0lxy2n",
          "author": "Proud_Tie",
          "body": "Good thing steamOS is out for the Ally, it's a game changer.",
          "score": 2,
          "created_utc": 1751303634.0,
          "replies": []
        },
        {
          "id": "n0n7krv",
          "author": "throwaway54345753",
          "body": "I don't like any windows. Period. Its inferior shitware.",
          "score": 1,
          "created_utc": 1751316725.0,
          "replies": [
            {
              "id": "n6lqiup",
              "author": "TimeConversation55",
              "body": "Linux users\nVegans \nCyclists \nEV drivers\nAntivaxxers ",
              "score": 1,
              "created_utc": 1754175389.0,
              "replies": [
                {
                  "id": "n6lsw1u",
                  "author": "throwaway54345753",
                  "body": "Lol I'm none of those things except a Linux user. And when you really get into the deep tech career fields, Linux becomes a necessary skillset.",
                  "score": 1,
                  "created_utc": 1754176236.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0nxhfz",
          "author": "BlastMyLoad",
          "body": "It kind of sucks but I think the hate is overblown. I hope the upcoming changes that Microsoft’s Xbox team is doing for Ally devices helps a lot",
          "score": 1,
          "created_utc": 1751324855.0,
          "replies": []
        },
        {
          "id": "n0oq6vr",
          "author": "To-Far-Away-Times",
          "body": "I used a rog Ally for a few minutes and the menus were super slow, it stutters, and it decided to update on me while I was browsing games. I was not impressed.",
          "score": 1,
          "created_utc": 1751334750.0,
          "replies": []
        },
        {
          "id": "n0p1djz",
          "author": "Niconame",
          "body": "It's ok, but I definitely find it affecting battery life and performance, I'm dualbooting bazzite-Gnome and windows.\n\nSimple things like a touch keyboard is 100x better on windows, but I get twice battery life running moonlight and remoting into my desktop.",
          "score": 1,
          "created_utc": 1751338851.0,
          "replies": []
        },
        {
          "id": "n0p2r84",
          "author": "Xero_id",
          "body": "I hate the price Asus continues to push, $899 for a handheld console is fucked.",
          "score": 1,
          "created_utc": 1751339387.0,
          "replies": []
        },
        {
          "id": "n0pbzvd",
          "author": "Recent-Blackberry317",
          "body": "I’ve owned all three and the steam deck is far and away the best. And that was just an LCD steam deck, I ordered an OLED last week when they restocked.",
          "score": 1,
          "created_utc": 1751343149.0,
          "replies": []
        },
        {
          "id": "n0pq9qv",
          "author": "alidan",
          "body": "windows eats around 30% of the performance on a handheld, and barely functions with a controller. windows is fine if you have the hardware to spare, but ever since vista windows barely works if you are using borderline minimum hardware. \n\nthe rog ally is also damn near 1000$ and is over 1000$ depending on tax",
          "score": 1,
          "created_utc": 1751350165.0,
          "replies": []
        },
        {
          "id": "n0qx14k",
          "author": "Letthepumpkincumflow",
          "body": "I have the MSI Claw 7 and love it, got a good deal on it. I was going to get the Ally originally.",
          "score": 1,
          "created_utc": 1751372916.0,
          "replies": []
        },
        {
          "id": "n0ys2je",
          "author": "probablymark",
          "body": "I got one three months ago and dual boot setup bazzite and windows and have been into windows twice then and only to test expedition 33 to see if it's any faster. \nSince then it's basically just steamos and amazing. I love it.",
          "score": 1,
          "created_utc": 1751472808.0,
          "replies": []
        },
        {
          "id": "n5lm2qp",
          "author": "Fabulous_Comb1830",
          "body": "Thought I'd like Windows handhelds more due to the freedom it provides but ended up liking the Deck more. \n\nOne look at the desktop interface on a handheld makes it feel like a hobby project you know? Like getting to run Windows on something it shouldn't, like DOOM on a fridge.\n\nThings will change when Xbox PC OS comes around I hope.",
          "score": 1,
          "created_utc": 1753706985.0,
          "replies": []
        },
        {
          "id": "n0l5w81",
          "author": "Fairtex_",
          "body": "I have the ally x and love widows. Why would anyone have a handheld device WITHOUT game pass?  And half the time epic is cheaper than steam. Huge fail.",
          "score": -3,
          "created_utc": 1751295571.0,
          "replies": [
            {
              "id": "n0nfw19",
              "author": "BipedalWurm",
              "body": "hope you never need epic customer support",
              "score": 4,
              "created_utc": 1751319165.0,
              "replies": [
                {
                  "id": "n0pnnoy",
                  "author": "Its_Broken",
                  "body": "or ASUS customer support for that matter",
                  "score": 2,
                  "created_utc": 1751348774.0,
                  "replies": []
                },
                {
                  "id": "n0yhd1m",
                  "author": "Fairtex_",
                  "body": "I’ve been a gamer my whole life and only needed customer support once (refund for battlefield 2042). Based on that track record I think I’ll be fine and take the cheaper games.",
                  "score": 0,
                  "created_utc": 1751469831.0,
                  "replies": [
                    {
                      "id": "n0zqgjh",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1751482668.0,
                      "replies": [
                        {
                          "id": "n121ere",
                          "author": "Fairtex_",
                          "body": "Da fuck?",
                          "score": 0,
                          "created_utc": 1751508726.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0lvnbh",
          "author": "TheRealSeeThruHead",
          "body": "Because it’s horrible",
          "score": -1,
          "created_utc": 1751303000.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0ly388",
      "author": "gldoorii",
      "body": "I'm curious to try it, but haven't seen one in stores yet. I absolutely LOVE my Z1E Ally and have 0 issues with it, I don't really understand the hate of handheld Windows since it allows me to install anything I want and works great as a docked PC. Still, I'm curious about the ergonomics of this device since I found the original Legion Go incredibly uncomfortable.",
      "score": 6,
      "created_utc": 1751303672.0,
      "replies": [
        {
          "id": "n0mud75",
          "author": "SexyOctagon",
          "body": "Every review I’ve seen praises the ergonomics.",
          "score": 3,
          "created_utc": 1751312864.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0prhsg",
      "author": "crymachine",
      "body": "None of the top comments said the device was 600 dollars so I'm just gonna throw that out there for anyone else who was hoping to find out quickly.",
      "score": 6,
      "created_utc": 1751350833.0,
      "replies": [
        {
          "id": "n6847gy",
          "author": "NotMarksII",
          "body": "Doing the lords work",
          "score": 1,
          "created_utc": 1753991803.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0jhneh",
      "author": "NuPNua",
      "body": "No mouse pads seems like a huge oversight that stops this competing with the deck to my mind.",
      "score": 168,
      "created_utc": 1751269046.0,
      "replies": [
        {
          "id": "n0jzquw",
          "author": "MadeByHideoForHideo",
          "body": "How the heck does your comment get so many up votes for spreading misinformation? It literally has a track pad?  \n  \nEdit: all you people trying to twist words and meanings to justify for an objective falsehood is pretty hilarious.",
          "score": 110,
          "created_utc": 1751279883.0,
          "replies": [
            {
              "id": "n0k7gca",
              "author": "sozuoka",
              "body": "Yeah lmao, seems like no one even bothers to click the article",
              "score": 47,
              "created_utc": 1751283604.0,
              "replies": [
                {
                  "id": "n0knnzd",
                  "author": "brickmaster32000",
                  "body": "The article that says that the tiny trackpad was practically unusable?",
                  "score": 15,
                  "created_utc": 1751289885.0,
                  "replies": [
                    {
                      "id": "n0kqbed",
                      "author": "sozuoka",
                      "body": "Original comment said nothing about quality of trackpad. He says \"no mouse pads\" (obviously meant to say touchpad/trackpad), which is absolutely incorrect",
                      "score": 20,
                      "created_utc": 1751290787.0,
                      "replies": [
                        {
                          "id": "n0krpkp",
                          "author": "brickmaster32000",
                          "body": "> He says \"no mouse pads\" (obviously meant to say touchpad/trackpad),\n\nThey also obviously meant a useable trackpad. So if you are nitpicking the literal statement they are right as there is no mouse pad, and if you are addressing the intended message they are correct as there is no actually useful trackpad.",
                          "score": -18,
                          "created_utc": 1751291243.0,
                          "replies": [
                            {
                              "id": "n0kwjb1",
                              "author": "Russlet",
                              "body": "> they are correct as there is no actually useful trackpad.\n\nThere is a trackpad on the device which can be used.",
                              "score": 19,
                              "created_utc": 1751292759.0,
                              "replies": [
                                {
                                  "id": "n0m2l5n",
                                  "author": "brickmaster32000",
                                  "body": "Not in a useful manner for gaming. The reviewer actually noted it simply didn't work to begin with.",
                                  "score": -4,
                                  "created_utc": 1751304896.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "n1m8k8s",
                              "author": "_RADIANTSUN_",
                              "body": "There a huge existential difference between \"no\" and \"not great\"",
                              "score": 1,
                              "created_utc": 1751800593.0,
                              "replies": [
                                {
                                  "id": "n1nllqm",
                                  "author": "brickmaster32000",
                                  "body": "Not in this case. A trackpad that is never useful provides basically the same utility as no trackpad. And as pointed out in the review. The one the reviewer got, the trackpad didn't actually work out of the box. So in effect it was shipped with no working trackpad.",
                                  "score": 1,
                                  "created_utc": 1751818357.0,
                                  "replies": [
                                    {
                                      "id": "n1q5n86",
                                      "author": "_RADIANTSUN_",
                                      "body": "Yes even in this case. The trackpad literally exists. The reviewer could have gotten a faulty unit or maybe it does require some work to get working (and well). But then it would be working and available. Vs having no trackpad where that's not a possibility at all.",
                                      "score": 1,
                                      "created_utc": 1751847871.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n0kbtwd",
                  "author": "jamesick",
                  "body": "probably because mouse pad and mouse pads are different things. and yes the go s has mouse pad but the steam deck has mouse pad**s**",
                  "score": -2,
                  "created_utc": 1751285477.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0kehvg",
              "author": "g0ndsman",
              "body": "Yeah but it's impossibly tiny. It could be ok for navigating a UI, but you won't be playing a game with it. The ones on the steam deck are already a bit too small.",
              "score": 15,
              "created_utc": 1751286544.0,
              "replies": []
            },
            {
              "id": "n0kgfyc",
              "author": "AltairLeoran",
              "body": "There's only one track pad and it's super tiny.",
              "score": 8,
              "created_utc": 1751287291.0,
              "replies": []
            },
            {
              "id": "n0m6pdm",
              "author": "Upper_Brilliant_105",
              "body": "The track pad is no wider than a thumb which makes it pretty much useless for gaming. Perhaps that’s more what they were meaning. At first glance i was like “wait there no pad…”",
              "score": 4,
              "created_utc": 1751306013.0,
              "replies": []
            },
            {
              "id": "n0qcmx3",
              "author": "itchipod",
              "body": "It's barely an excuse for a trackpad anyway",
              "score": 1,
              "created_utc": 1751363403.0,
              "replies": []
            },
            {
              "id": "n0qiqyi",
              "author": "binklfoot",
              "body": "That small tiny square is the same as the red thing in the middle of thinkpad laptops. Useless and small",
              "score": 1,
              "created_utc": 1751366715.0,
              "replies": []
            },
            {
              "id": "n0v4o4c",
              "author": "duhh33",
              "body": "Seems factually accurate to me. 1 tiny touchpad, not plural touchpads.",
              "score": 1,
              "created_utc": 1751418840.0,
              "replies": []
            },
            {
              "id": "n0mbmhl",
              "author": "architect___",
              "body": "How the heck does your comment get so many up votes for spreading misinformation? It literally only has one trackpad smaller than my pinky toe, which the article states is unusable:\n\n> What is missing from Lenovo’s design are the Steam Deck’s two trackpads. Those haptic trackpads add a surprising amount of versatility in some games, especially in CRPGs or strategy games like Tactical Breach Wizards. The minuscule trackpad on the Legion Go S didn’t even seem to work out of the box. I had such a bad experience with it on the Windows version—with it vibrating like a rabbit dipped into a freezing-cold lake—I wasn’t keen to fix it.\n\nObviously homeboy meant trackpads when he said \"mouse pads\", and the Deck has two large ones that can be used for gaming, like mice.",
              "score": 1,
              "created_utc": 1751307395.0,
              "replies": []
            },
            {
              "id": "n0kv69k",
              "author": "gummyworm21_",
              "body": "Steam deck fanboys wanting to feel validated. ",
              "score": -6,
              "created_utc": 1751292329.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0ji5d9",
          "author": "brokenmessiah",
          "body": "Idk no one seems to do the trackpad but Steam",
          "score": 139,
          "created_utc": 1751269357.0,
          "replies": [
            {
              "id": "n0jiky2",
              "author": "papu16",
              "body": "And this is sad. I like them so much, especially in the FPS games without an aim assist.",
              "score": 68,
              "created_utc": 1751269624.0,
              "replies": [
                {
                  "id": "n0jizsn",
                  "author": "Noobochok",
                  "body": "Even for just the virtual menus they allow to create trackpads are godsent.",
                  "score": 46,
                  "created_utc": 1751269874.0,
                  "replies": []
                },
                {
                  "id": "n0jxhcu",
                  "author": "BaldEagleNor",
                  "body": "Twin stick shooters feel amazing with the trackpads",
                  "score": 9,
                  "created_utc": 1751278640.0,
                  "replies": []
                },
                {
                  "id": "n0jppiy",
                  "author": "WhatThePann",
                  "body": "Does the steam deck have gyro? I played Turok on the switch and it felt so good to use for smaller movements.",
                  "score": 9,
                  "created_utc": 1751274020.0,
                  "replies": [
                    {
                      "id": "n0jpzi9",
                      "author": "papu16",
                      "body": "As I remember - It has.",
                      "score": 18,
                      "created_utc": 1751274190.0,
                      "replies": []
                    },
                    {
                      "id": "n0jrerh",
                      "author": "vezwyx",
                      "body": "Sure does",
                      "score": 14,
                      "created_utc": 1751275066.0,
                      "replies": []
                    },
                    {
                      "id": "n0kmsvn",
                      "author": "billdasmacks",
                      "body": "Yes it does and I keep it turned off.",
                      "score": 3,
                      "created_utc": 1751289588.0,
                      "replies": []
                    },
                    {
                      "id": "n0ncp4j",
                      "author": "echeese",
                      "body": "Yeah, the thumb sticks are actually touch sensitive for this reason, you can have gyros only active when you’re you’re touching them, for instance",
                      "score": 3,
                      "created_utc": 1751318213.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n0jnbkg",
                  "author": "randomIndividual21",
                  "body": "Does it work? Using mouse pad on steam deck in fps sound miserable",
                  "score": 5,
                  "created_utc": 1751272551.0,
                  "replies": [
                    {
                      "id": "n0jojsn",
                      "author": "m0bw0w",
                      "body": "It significantly better than aiming with a joystick.",
                      "score": 17,
                      "created_utc": 1751273316.0,
                      "replies": [
                        {
                          "id": "n0k34tx",
                          "author": "AreYouOKAni",
                          "body": "Eh. It's a matter of how used to it you are. You also have gyro to help you out, so that's not that bad either.",
                          "score": 11,
                          "created_utc": 1751281592.0,
                          "replies": [
                            {
                              "id": "n0kr6nd",
                              "author": "brickmaster32000",
                              "body": "Even without gyro it is better. Fundamentally it is a trackball and, while trackballs weird people out, even the worst trackball is better in an FPS than a joystick.",
                              "score": 1,
                              "created_utc": 1751291073.0,
                              "replies": [
                                {
                                  "id": "n0lryyl",
                                  "author": "AreYouOKAni",
                                  "body": "Nah. I've used trackballs before, including expensive ones. I'll take my thumbstick+gyro for aiming over any one of them. Same goes for trackpads.",
                                  "score": 4,
                                  "created_utc": 1751301965.0,
                                  "replies": [
                                    {
                                      "id": "n1m900n",
                                      "author": "_RADIANTSUN_",
                                      "body": "It doesn't matter that you prefer the worse option, that doesn't change anything: analogue sticks can only control the placcelerstion of the pointer, trackpad/trackballs/mice control the **position** of the pointer directly. There's no cope around this, analogues are a fundamentally worse pointer control technology.\n\nMaybe if they figured how to put a real IBM style TrackPoint on it, those things rule.",
                                      "score": 1,
                                      "created_utc": 1751800819.0,
                                      "replies": [
                                        {
                                          "id": "n1m97rl",
                                          "author": "AreYouOKAni",
                                          "body": "> trackpad/trackballs/mice control the position of the pointer directly\n\nWhen you have the room, sure. On a thumb-sized area? There's precisely zero difference, lol. In fact, it is worse, since you have to constantly lift up your thumb since you run out of space.",
                                          "score": 1,
                                          "created_utc": 1751800928.0,
                                          "replies": [
                                            {
                                              "id": "n1mp07x",
                                              "author": "_RADIANTSUN_",
                                              "body": "No on a thumb size area the fundamental input technology of an analogue sticks is still inferior. E.g the trackpads. on the original steam controller are just overwhelmingly superior to analogue sticks to the point where they can even emulate analogue sticks.",
                                              "score": 1,
                                              "created_utc": 1751807834.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n0lc69t",
                          "author": "Moses015",
                          "body": "See I've tried to use them as a mouse replacement but they always seem far less accurate than the joysticks. It almost makes me wonder if I've got something configured incorrectly. Fine movements seem to always jump over what I actually want to aim at.",
                          "score": 1,
                          "created_utc": 1751297404.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n0kg6xs",
                      "author": "thekeffa",
                      "body": "PSA: SteamDeck supports Bluetooth mice and keyboards if you prefer to use one of those.",
                      "score": 1,
                      "created_utc": 1751287196.0,
                      "replies": []
                    },
                    {
                      "id": "n0kn3f6",
                      "author": "billdasmacks",
                      "body": "It works but I find it is not very easy to use. I've tried to get used to using it many times and I just can't.",
                      "score": 1,
                      "created_utc": 1751289688.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0jzph3",
              "author": "TotoCocoAndBeaks",
              "body": "Its extremely useful, renders many games playable that would otherwise be unplayable",
              "score": 14,
              "created_utc": 1751279863.0,
              "replies": []
            },
            {
              "id": "n0k1cwd",
              "author": "Taviii",
              "body": "I use the trackpad on the steam deck and wouldn’t consider a device that doesn’t have it.\n\nAdmittedly, the trackpad on the deck sucks and needs significant improvement, which i am hoping for in the Deck 2. but i have a higher expectation of them dropping it altogether unfortunately.",
              "score": 9,
              "created_utc": 1751280713.0,
              "replies": [
                {
                  "id": "n0kj4q0",
                  "author": "qualitypi",
                  "body": "I sorta wish there was a mod to change the pad to a trackball lol. The pads are a great compromise and ever since the steam controller felt like it's the missing link between M/KB and analog sticks. They have felt just a hair underwhelming to an actual trackball though lol. I know they couldn't and wouldn't ship a handheld device with a small easily lose-able piece for the masses but man I'd like to have one on mine.",
                  "score": 4,
                  "created_utc": 1751288292.0,
                  "replies": []
                },
                {
                  "id": "n0l1ba8",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1751294219.0,
                  "replies": [
                    {
                      "id": "n0lm7yo",
                      "author": "Taviii",
                      "body": "I meant they’d likely drop the trackpad in the new version… if they follow the trend set by other manufacturers and i would assume data from current steam deck use cases would show that the majority of users don’t use them much",
                      "score": 2,
                      "created_utc": 1751300306.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0klz2w",
              "author": "BigCommieMachine",
              "body": "Valve is 100% waiting for Strix Halo on a mobile chip.",
              "score": 2,
              "created_utc": 1751289300.0,
              "replies": []
            },
            {
              "id": "n0kae3f",
              "author": "DarkMatterM4",
              "body": "Zotac has trackpads.",
              "score": 1,
              "created_utc": 1751284878.0,
              "replies": []
            },
            {
              "id": "n0lt7ex",
              "author": "homer_3",
              "body": "The Deck's trackpad sucks though. A touch screen is all you need anyway.",
              "score": -1,
              "created_utc": 1751302319.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0jyptj",
          "author": "geoelectric",
          "body": "The square under the right stick is an extremely small touchpad. Might still be good enough for basic navigation.",
          "score": 9,
          "created_utc": 1751279326.0,
          "replies": []
        },
        {
          "id": "n0joac1",
          "author": "Blarzgh",
          "body": "I've never cared for the trackpads on my Steam Deck. Kinda nifty for typing, but I prefer to use the sticks in games.",
          "score": 13,
          "created_utc": 1751273154.0,
          "replies": [
            {
              "id": "n0juv5a",
              "author": "The_Cat_Commando",
              "body": "> I've never cared for the trackpads on my Steam Deck. \n\nyou probably have not explored their other uses much then.\n\nyou can make them like a weapon wheel of custom hotkey selections, macro combos for specials, or maybe like a basic 3x3 grid of extra buttons. theres all kinds of good things your probably sleeping on tbh. games that let you change vision/fire modes or maybe even just have a quicksave button. people have done full MMO hotbars of like 30+ buttons done with layer shifting on just the touchpads. you can map flight sims entire keyboard layouts if you wanted.\n\nits crazy useful if you like to customize it. [its another reason why everyone wants a steam controller 2 thats just a deck button layout without a screen.](https://tech.yahoo.com/gaming/articles/one-gamer-got-tired-waiting-022744598.html)",
              "score": 23,
              "created_utc": 1751277146.0,
              "replies": [
                {
                  "id": "n0ldbrh",
                  "author": "vingt-2",
                  "body": "I wasn't interested in them, and they kept firing some action Everytime I played a new game because my thumb would somehow touch it I had to actively disable their bindings in steam input every time. to each their own!",
                  "score": 7,
                  "created_utc": 1751297741.0,
                  "replies": []
                },
                {
                  "id": "n0k8z53",
                  "author": "trickman01",
                  "body": "Because the steam controller one, which had the trackpads, sold so well. Oh wait, they were practically giving them away to clear their warehouse.",
                  "score": -10,
                  "created_utc": 1751284275.0,
                  "replies": [
                    {
                      "id": "n0ko3xa",
                      "author": "AintNobody-",
                      "body": "Yes, very good, the Steam Controller was exactly the same layout as the Steam Deck.",
                      "score": 1,
                      "created_utc": 1751290036.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n0khx5q",
              "author": "Conscious_Angle_3521",
              "body": "So you've never played a game on the Steam Deck that only supports mouse and keyboard.",
              "score": 1,
              "created_utc": 1751287846.0,
              "replies": [
                {
                  "id": "n0kx1kb",
                  "author": "Russlet",
                  "body": "I prefer to play those types of game with an actual mouse and keyboard",
                  "score": 12,
                  "created_utc": 1751292917.0,
                  "replies": []
                },
                {
                  "id": "n0pxqwz",
                  "author": "Swing_Right",
                  "body": "Seriously. The trackpads are goated for Factorio which I can’t imagine playing with a stick. The people saying “I use an actual mouse and keyboard” and completely ignoring the fact that the steam deck isn’t the perfect solution for gaming but specifically for gaming on the go or away from your computer. Playing a game that requires a mouse is so easy on the trackpads and they’re so much better than your run of the mill laptop trackpad because of the physical feedback and the floating nature of them that lets you swing your thumbs to move your cursor. \n\nFactorio on Steam deck is a dream because of the trackpads and I wouldn’t be playing it without them.",
                  "score": 2,
                  "created_utc": 1751354421.0,
                  "replies": []
                },
                {
                  "id": "n0ldh0h",
                  "author": "vingt-2",
                  "body": "Played many FPS with no controller support on sticks and gyro.",
                  "score": 1,
                  "created_utc": 1751297783.0,
                  "replies": []
                },
                {
                  "id": "n0nnyyh",
                  "author": "Blarzgh",
                  "body": "I play those on my PC tbh",
                  "score": 1,
                  "created_utc": 1751321708.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0jnl3k",
          "author": "nobd2",
          "body": "The Xbox Rog Ally X tempts me because it looks like I could download gamepass games that I already pay for, but yeah, no trackpads is the one thing holding me back.",
          "score": 4,
          "created_utc": 1751272719.0,
          "replies": []
        },
        {
          "id": "n0k4s2l",
          "author": "CollinsCouldveDucked",
          "body": "What's the little square under the right analog stick? Is that like a mini track pad?\n\n\nBecause that's kinda more annoying than no track pad.",
          "score": 4,
          "created_utc": 1751282384.0,
          "replies": [
            {
              "id": "n0k4vjd",
              "author": "NuPNua",
              "body": "I thought it was a home button or the like, maybe it's like the old netbook mouse nubs?",
              "score": 1,
              "created_utc": 1751282429.0,
              "replies": [
                {
                  "id": "n0k58je",
                  "author": "CollinsCouldveDucked",
                  "body": "Looking it up, it's marked as a \"touchpad\"",
                  "score": 3,
                  "created_utc": 1751282594.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0kjsvj",
          "author": "User9705",
          "body": "It has one. It’s right under the joystick in the picture. I have the device and love it.",
          "score": 2,
          "created_utc": 1751288534.0,
          "replies": []
        },
        {
          "id": "n0jqsid",
          "author": "CoLDxFiRE",
          "body": "I honestly don't understand this obsession with having trackpads in handhelds.\n\nI have used the trackpads on the Steamdeck and they suck as much as any shitty laptop trackpads. For me, the analog sticks work better for emulating mouse controls and they don't need to take extra space on a handheld, as they're already there and can be used for both games and the occasional desktop navigation if needed (or if you're really that weird and must play your RTS games on a handheld).",
          "score": 15,
          "created_utc": 1751274687.0,
          "replies": [
            {
              "id": "n0l9hc0",
              "author": "Blazr5402",
              "body": "Not a huge trackpad fan either. My (completely unfounded) theory is it's mostly folks who mostly played games on PC prefer the trackpads, while console gamers aren't a huge fan of them. Also, the default settings on Steam Deck's trackpads tend to be a little weird in shooters.",
              "score": 4,
              "created_utc": 1751296621.0,
              "replies": [
                {
                  "id": "n0lj5wi",
                  "author": "Velgus",
                  "body": "I'm a long-time PC gamer, and am not a fan of the trackpads. At least not for actually controlling in-game movement of any sort - their other features like custom input menus with SteamInput and typing are alright, but losing them wouldn't necessarily be a dealbreaker when considering handhelds, just a bonus to factor into a decision.\n\nIf I'm playing a game on Deck, I'm not going to be playing it \"competitively\" anyways, so I don't care if sticks are technically inferior for precise control or whatever (which I won't deny - just like with mice, movement-to-movement definitely has a higher capacity for speed and precision than tilt-to-movement, ignoring the fact that some games have substantially overtuned auto-aim if using controllers). \n\nI'm playing on Deck to sit back (or lie down) and relax, and analog sticks are substantially more comfortable for that (eg. if you have to make a continuous leftward movement, you just tilt left, not repeatedly have to move your thumb, lift it, move it again, etc.).\n\nThe only games I wouldn't mind playing as much with the trackpads are ones that are M&KB-only, and also very slow paced such that there's never any need to quickly select anything (like Disco Elysium). Even then, analog-to-mouse works fine for those too. If a game is M&KB-only and required fast pace movement and precise clicking, or a large variety of keyboard inputs, I wouldn't play it on the Deck in the first place.",
                  "score": 3,
                  "created_utc": 1751299420.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0kjlrm",
              "author": "DuckyBertDuck",
              "body": "I like to use them in mouse region mode in games like Noita or ROUNDS for more precise aiming. And in games like Caves of Qud, I put all my abilities into the mouse pad menus. (15+ abilities in sub-menus)\n\n& in some first person shooter games, the trackpads can be a lot better than joystick aiming, if set up properly. [This channel has some demonstration videos, IIRC.](https://youtu.be/R4q5XfVdSY8?si=TOsfzGvyLoBuTGmC)",
              "score": 2,
              "created_utc": 1751288462.0,
              "replies": []
            },
            {
              "id": "n0kf9su",
              "author": "g0ndsman",
              "body": "> For me, the analog sticks work better for emulating mouse controls\n\nI get that it's a personal preference, but I have troubles understanding how anyone could come to this conclusion. After getting used to move the camera with the trackpad in a third person game (e.g. dark souls), using a stick feels genuinely medieval.",
              "score": -1,
              "created_utc": 1751286846.0,
              "replies": [
                {
                  "id": "n0pjqli",
                  "author": "Userybx2",
                  "body": "After getting used to real body movement in VR and controlling the camera like in real life, using a mouse to control my view feels really medieval. But you have to use what's available. Playing VR games on the couch or in a train doesn't make much sense, so I use a gamepad.",
                  "score": 2,
                  "created_utc": 1751346778.0,
                  "replies": [
                    {
                      "id": "n0ppcg2",
                      "author": "g0ndsman",
                      "body": "This is a ridiculous comparison because a touchpad is barely larger than an analog stick and fits on the same kind of controller. VR is a completely different input method with completely different games.",
                      "score": 1,
                      "created_utc": 1751349663.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n0l6cz5",
          "author": "Fairtex_",
          "body": "They’re useless",
          "score": 1,
          "created_utc": 1751295707.0,
          "replies": []
        },
        {
          "id": "n0lkpa7",
          "author": "sweetcinnamonpunch",
          "body": "I don't know how many people are using them, I don't think it's really necessary.",
          "score": 1,
          "created_utc": 1751299868.0,
          "replies": []
        },
        {
          "id": "n0k5oox",
          "author": "internetlad",
          "body": "100%. I could see a handheld getting away with only one right mouse pad but I've got sooooo used to playing management and strategy games with the thumb touchpad that not having it would *literally keep me from playing entire genres of games* and that's a nonstarter. ",
          "score": 1,
          "created_utc": 1751282801.0,
          "replies": []
        },
        {
          "id": "n0kfw9n",
          "author": "thekeffa",
          "body": "The Legion Go S does have a trackpad. I have one, as well as a SteamDeck.\n\nThe SteamDeck is the better device still, but it doesn't change the fact your comment is misinformation.",
          "score": 1,
          "created_utc": 1751287083.0,
          "replies": [
            {
              "id": "n0kfzbq",
              "author": "NuPNua",
              "body": "It's not very obvious in the image to be fair.",
              "score": -4,
              "created_utc": 1751287116.0,
              "replies": [
                {
                  "id": "n0kgnd5",
                  "author": "wildfangzx",
                  "body": "That's why you read the article, Instead of wasting data posting a comment so other people can like it.\n\nTo be fair",
                  "score": 5,
                  "created_utc": 1751287369.0,
                  "replies": [
                    {
                      "id": "n0khtuw",
                      "author": "NuPNua",
                      "body": "I'm on my WiFi at home, there is no wasted data it's an infinite supply.",
                      "score": -2,
                      "created_utc": 1751287813.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0l9aa7",
      "author": "erickgps",
      "body": "I think Microsoft will make a custom windows for the new Xbox handheld with all the bloat removed and only focused on gaming. \nIf that is the case then we might see the comparison. \nBut at this point it's kind hard beat the Steam OS.",
      "score": 3,
      "created_utc": 1751296564.0,
      "replies": [
        {
          "id": "n0pdpnh",
          "author": "Hot-Software-9396",
          "body": "It's already being done and shown off:\n\nhttps://www.theverge.com/news/682011/microsoft-windows-xbox-pc-combination-features-rog-xbox-ally-devices",
          "score": 2,
          "created_utc": 1751343915.0,
          "replies": []
        },
        {
          "id": "n0nc0r2",
          "author": "oshatokujah",
          "body": "It’s already been announced that it will use Windows 11 Home edition, that came out the day they revealed it. Not getting anything fancy out of the windows team",
          "score": 1,
          "created_utc": 1751318012.0,
          "replies": [
            {
              "id": "n0pdm54",
              "author": "Hot-Software-9396",
              "body": "It's also been annouced and shown off to people in the gaming industry that the Xbox Ally will have a special full screen mode that doesn't load in things like the Windows desktop and other processes to save upwards of 2GB of memory. \n\n\"“This isn’t surface-level changes, we’ve made significant improvements,” says Potvin. “Some of our early testing with the components we’ve turned off in Windows, we get about 2GB of memory going back to the games while running in the full-screen experience.”\"\n\nhttps://www.theverge.com/news/682011/microsoft-windows-xbox-pc-combination-features-rog-xbox-ally-devices",
              "score": 2,
              "created_utc": 1751343871.0,
              "replies": []
            },
            {
              "id": "n0nrny9",
              "author": "erickgps",
              "body": "Well that just sucks then, I know there is a project from some guys of a windows without all the bloat but there is still too many bugs, but if Microsoft won't do it then that seems to be the only option.",
              "score": 1,
              "created_utc": 1751322909.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0jwph3",
      "author": "Fredasa",
      "body": "I like how they had an opportunity to go with the \"both analog pads on the bottom\" layout and differentiate themselves in that way, but nobody's pretending anymore.  Not even Nintendo.  Primary analog stick -> underneath left thumb at rest; primary buttons -> underneath right thumb at rest.  Sony is kinda stuck because they know they'd be flayed alive if they dared to walk back the Dualshock layout, even though the only reason it was like that was because there was nowhere else to put the pads.",
      "score": 22,
      "created_utc": 1751278201.0,
      "replies": [
        {
          "id": "n0m0t8f",
          "author": "None",
          "body": "I've used both Xbox and Sony for years. The dual sense position is just better.",
          "score": 6,
          "created_utc": 1751304410.0,
          "replies": [
            {
              "id": "n0n6c3u",
              "author": "Fredasa",
              "body": "Then it could be worth it to petition Nintendo, Valve, Microsoft, Lenovo etc. to get their control scheme in order.  Sony is sort of the last man standing when it comes to that layout.",
              "score": 0,
              "created_utc": 1751316367.0,
              "replies": [
                {
                  "id": "n0nh13v",
                  "author": "calciferBurningBacon",
                  "body": "Valve is using a symmetrical layout already for the Steam Deck, and it is glorious.",
                  "score": 2,
                  "created_utc": 1751319511.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0k3kkm",
          "author": "AreYouOKAni",
          "body": "This layout is superior when you can not add full-size thumbsticks. But if you have a full-size controller? Dualshock reigns supreme. Especially if you have buttons on the back.",
          "score": 7,
          "created_utc": 1751281805.0,
          "replies": [
            {
              "id": "n0kfu0p",
              "author": "Fredasa",
              "body": "Are full-size thumbsticks and a full-size controller options that don't exist as part of a first-party control pad by default?",
              "score": 2,
              "created_utc": 1751287059.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0k3s7v",
          "author": "VagueSomething",
          "body": "It is definitely the superior layout for the majority of people despite a small group insisting Sony has it right. Honestly as iconic as it is, I think overall people would appreciate Sony fixing their controller. Their layout between the bumpers and sticks is only good if you use claw grip. Most people are not the Butler from Scary Movie though.",
          "score": 12,
          "created_utc": 1751281909.0,
          "replies": [
            {
              "id": "n0ki4ob",
              "author": "Alugar",
              "body": "I am in the small group.  First modern console controller to only hand was a PlayStation so that layout feels right. \n\nEven order my 8bit controller to match the format.",
              "score": 13,
              "created_utc": 1751287924.0,
              "replies": []
            },
            {
              "id": "n0ke6cf",
              "author": "Fredasa",
              "body": "> Honestly as iconic as it is, I think overall people would appreciate Sony fixing their controller.\n\nIt's not impossible.  As of the PS4, they finally ditched the ergonomically-challenged housing they'd been on since 1994, and they seem to have lived to tell the tale.  And with the PS5 pad, they edge kind of shamelessly in the direction of the Xbox form factor (as did Nintendo).  Grips are still a touch too vertical but I'm sure they'll get there.\n\nMy guess?  They have a portable PS5 coming.  They really _can't_ get away with keeping the primary analog stick at such an inconvenient spot on a Steamdeck clone... so they may just go ahead and use that as their excuse and say their hands were tied.",
              "score": 9,
              "created_utc": 1751286419.0,
              "replies": []
            },
            {
              "id": "n0k9774",
              "author": "yelsamarani",
              "body": "My brain just can't accept the thumbsticks not symmetrical lol. And I think that colors my entire experience with controllers where the thumbsticks in different vertical locations.\n\n I'm already predisposed to dislike them as soon as I hold them and my brain just refuses to learn to use them as it screams \"this fucking thing is not symmetrical!\"",
              "score": 11,
              "created_utc": 1751284372.0,
              "replies": [
                {
                  "id": "n0kbo69",
                  "author": "VagueSomething",
                  "body": "Nature finds symmetry to be ugly but it pleases the human brain, especially for neuro divergent individuals.\n\n\nPersonally function over form is my preference, the left stick being higher makes moving forward easier as the thumb rests ready to go with the shape of the hand so long sessions cause less strain. The right stick has the thumb under tension as looking is a rapid movement but the constant walking in games doesn't need the left thumb under such stress.",
                  "score": 2,
                  "created_utc": 1751285412.0,
                  "replies": []
                },
                {
                  "id": "n0kekej",
                  "author": "Fredasa",
                  "body": "> My brain just can't accept the thumbsticks not symmetrical lol.\n\nThis was Nintendo's hangup, too.  They tried the Playstation layout (for the Wii Pro Controller).  Realized having the main analog stick on the bottom kinda sucked.  Then they tried having both analog sticks on the _top_ (Wii-U Pro Controller), and realized that having the primary buttons that 99% of games use on the bottom also kind of sucked.  Then they finally threw in the towel on their precious symmetry.\n\nBut we got a glorious and idealized Robotron control pad out of it.",
                  "score": 0,
                  "created_utc": 1751286571.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0le17f",
              "author": "cabalavatar",
              "body": "It is _not_ definitely the superior layout. That's hogwash from bias. Sony does not need to fix the analogs on its controller, because they are as they _should_ be: symmetrical. That was a big reason why I got a Steamdeck over a Lenovo or Asus: Properly symmetrical joysticks.\n\nIdk about the rest of your hands, but my left hand and that of every other human I've met are not mangled claws with a thumb that points upwards.",
              "score": 6,
              "created_utc": 1751297947.0,
              "replies": [
                {
                  "id": "n0ls0m7",
                  "author": "VagueSomething",
                  "body": "Buddy, you cannot talk about claw hands when Sony controllers only work optimally if you're Hanson the Butler.",
                  "score": -4,
                  "created_utc": 1751301978.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n0kjdgq",
              "author": "UncaringNonchalance",
              "body": "Update the controller but keep icons with the old design and/or integrate the classic PS controller look into some other sort of signage as an homage.\n\nIt may not be the best setup, but it’s undeniably an iconic design in the gaming world.",
              "score": 1,
              "created_utc": 1751288379.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n0m0pvj",
          "author": "TechNickL",
          "body": "My one largest complaint with my GPD win max is that the buttons and sticks are all in one row and they went with Xbox layout.\n\nThe problem is that since they're all in one row, using the right stick or the dpad feels awkward. Because you have to bring your thumb inwards instead of down. So natural positions that aren't awkwardly asymmetrical are left stick and face buttons works or right stick and dpad, but you're almost never using the dpad and the right stick at the same time.\n\nA lot of modern games use both sticks and the triggers, so in that form factor PS layout actually kind of makes sense. I guess it depends but most games I play that mostly use face buttons are 2d and don't mind using the dpad.",
          "score": 2,
          "created_utc": 1751304385.0,
          "replies": [
            {
              "id": "n0n7teg",
              "author": "Fredasa",
              "body": "> Because you have to bring your thumb inwards instead of down.\n\nYeah that's braindead.\n\nThe reason the Xbox layout works on a pad is because the thing 99% of games need you to control is sitting directly underneath your thumb at rest.  The scenario you've outlined completely violates that design advantage.\n\n> A lot of modern games use both sticks and the triggers, so in that form factor PS layout actually kind of makes sense.\n\nSure, there's no one size fits all.  There's only one size fits most.  Realistically speaking, though, the games you're talking about are almost certainly better to play with KB+M.\n\nI will say that the Xbox _controller_ as an entire package is far from perfect.  (Especially if we're talking about XB1.)  It's the layout that wins.  There's nothing stopping Microsoft from giving us bumper buttons that are actually buttons as opposed to levers, but apparently that's a bridge too far.  And obviously they have some serious design hangups when it comes to the poor D-pad—the best one they've ever had was only available on limited edition 360 controllers.  But eh, as long as I can comfortably use the D-pad as four bonus buttons, I'm happy.",
              "score": 2,
              "created_utc": 1751316794.0,
              "replies": [
                {
                  "id": "n0nti7p",
                  "author": "TechNickL",
                  "body": "Yeah but sometimes I wanna play em without having to set the thing on a desk. Not necessarily shooters but like say, fromsoft games. I seem to remember at least one dark souls game didn't support the mouse in the first place, you had to use wasd and ihjk as dual sticks.",
                  "score": 1,
                  "created_utc": 1751323524.0,
                  "replies": []
                },
                {
                  "id": "n0wjj69",
                  "author": "TechNickL",
                  "body": "> I will say that the Xbox controller as an entire package is far from perfect.\n\nHonestly yeah, from a feature perspective dualsense reigns supreme, but from a layout perspective Xbox nailed it first and as long as we're talking just sticks and buttons, no one has found a way to do it better. Except with regard to heavily specialized controllers like fightsticks and the like. I do love me my leverless.",
                  "score": 1,
                  "created_utc": 1751440887.0,
                  "replies": [
                    {
                      "id": "n0wutq6",
                      "author": "Fredasa",
                      "body": "The ergonomics of the Xbox pad has also been essentially perfect (with minor, inconsequential tweaks) since Xbox 360, whereas I still don't consider the PS5 pad comfortable to hold, even though they've blatantly scooted the frame in an obvious Xbox direction twice now.  The grips are just too vertical.  The less the wrists need to bend from a neutral position (centerpoint between both extremes), the better.  The angle you get on an Xbox pad is just fine; not so vertical that I feel inclined to hold the pad away from my lap, and not so angled that it's just a silly design.",
                      "score": 1,
                      "created_utc": 1751447589.0,
                      "replies": [
                        {
                          "id": "n1m9im6",
                          "author": "_RADIANTSUN_",
                          "body": "The ergonomics were first perfected by the GameCube and original Xbox Controller S",
                          "score": 1,
                          "created_utc": 1751801081.0,
                          "replies": [
                            {
                              "id": "n1mavpa",
                              "author": "Fredasa",
                              "body": "True, the housing was essentially idealized way back then.  But the start and \"back\" buttons were in a bad location.  \"Black\" and \"white\" also.",
                              "score": 1,
                              "created_utc": 1751801758.0,
                              "replies": [
                                {
                                  "id": "n1mpicj",
                                  "author": "_RADIANTSUN_",
                                  "body": "Actually I should have said the original \"Duke\" Xbox controller was also ergonomically amazing IMO, it just looked ridiculous, and the black and white buttons placement actually made a lot of sense since the design of the Xbox was influenced by Microsoft devouring the corpse of SEGA of America, it was like the 6 button controllers on SEGA consoles that worked great for fighting games. Controller S moved them totally out of the way and suddenly it felt just random.",
                                  "score": 1,
                                  "created_utc": 1751808026.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n1m8e0j",
          "author": "_RADIANTSUN_",
          "body": "Nobody remembers the original PS1 controller with no analogues. But I remember. That shit ruled for Tekken. But the analogues were added as a \"how do we change the shell molding and PCB layout the least\" mid-gen afterthought that happened to catch on. There's not an amazing reason for the layout to be the way it is, it was just convenient from a manufacturing standpoint and it stuck.",
          "score": 1,
          "created_utc": 1751800503.0,
          "replies": [
            {
              "id": "n1mbdlx",
              "author": "Fredasa",
              "body": "Precisely.  It was sort of Sony's bad luck that they felt that retrofitting their existing pad was the best way forward.  Or Microsoft's good luck that they didn't have any shackles when situating their own layout—though I will say it was prescient of them to understand that the analog stick was going to be the primary way of controlling console games, which in turn dictated their decision to go against the (Nintendo and Playstation) trend and place it in the primary spot for the thumb.",
              "score": 1,
              "created_utc": 1751802006.0,
              "replies": [
                {
                  "id": "n1mq2dg",
                  "author": "_RADIANTSUN_",
                  "body": "It wasn't even that prescient, that left thumb stick placement was already done on Dreamcast and the design influence transferred via Microsoft eating the fresh remains of SEGA of America. It just made too much sense.",
                  "score": 1,
                  "created_utc": 1751808236.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n0jhir9",
      "author": "PsychologicalCat937",
      "body": "I’ve been eyeing the Legion Go S, and it actually looks like they nailed the ergonomics where the Steam Deck feels like a brick. If battery life holds up and SteamOS runs smooth, this could seriously shake up the handheld scene—just hope the price doesn’t make us choke!",
      "score": 30,
      "created_utc": 1751268965.0,
      "replies": [
        {
          "id": "n0k5yut",
          "author": "cobaltocene",
          "body": "I stuck with the Steam Deck through-and-through for its ergonomics — just felt *right* to hold, you know?\n\nI got the LeGoS recently because I wanted to try something with a bigger screen and higher specs, specifically in this case because people had called out its ergonomics as a selling point. It’s very, very good. I’m still getting used to it, and there are some things that I don’t prefer (the placement of the home and QAM buttons, the size/placement of the right stick) but so far none are dealbreakers. The biggest thing going for it is that the console is huge but you can barely tell while you’re holding it. It just feels right. The Ally didn’t have that shape despite being lighter and the original LeGo just didn’t feel great to hold for very long (note: the Go S is actually much closer in size to the OG Go than I expected but despite that I can’t tell while gaming). For me, the best handheld is the one that just feels right when I pick it up, something that doesn’t feel like a chore to play for a longer session (I game a lot on airplanes… no blue 8bitdo either). Steam Deck had been the only one that did that for me, but the Go S is the first that feels like it could actually get me to retire my Steam Deck.",
          "score": 7,
          "created_utc": 1751282929.0,
          "replies": []
        },
        {
          "id": "n0ju284",
          "author": "mibarbatiene3pelos",
          "body": "Why are you being downvoted?! (it was -12 when I replied)",
          "score": -1,
          "created_utc": 1751276675.0,
          "replies": [
            {
              "id": "n0kofpa",
              "author": "AintNobody-",
              "body": "Brand warriors.",
              "score": 8,
              "created_utc": 1751290149.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n0l4l14",
      "author": "mickdrop",
      "body": "I know that the answer is no but I might ask it anyway...\n\nCurrently for these devices there seems to be only 2 options as a firmware :\n\n- Windows\n\n- SteamOS\n\nIs there a third option? \n\nSince my old PC became too obsolete according to Microsoft, I became more and more used at using Linux for gaming. I don't want to come back to Windows anymore. On the other end, using SteamOS is great when most of your games come from Steam but not if you mostly find them elsewhere like I do (other launcher or direct downloads). I know that you can add non-steam deck but it feels like a loophole and not a real functionality (you have to go on desktop mode and tinker). I don't want to leave a closed environment to end up in another closed environment.\n\nIs there a linux distrib that would be adapted for these kind of devices? Something that would be adapted to be used with a gamepad and displaying games maybe like in Playnite?",
      "score": 2,
      "created_utc": 1751295188.0,
      "replies": [
        {
          "id": "n0l7l5o",
          "author": "NSMike",
          "body": "You could look into Bazzite.  I'm using it on a gaming PC that I keep hooked up to my TV as a way of doing couch PC gaming.",
          "score": 4,
          "created_utc": 1751296066.0,
          "replies": []
        },
        {
          "id": "n0mtj9m",
          "author": "SexyOctagon",
          "body": "This isn’t technically an answer to your question, but have you heard of Heroic Launcher? It’s a decent compromise for other launchers on SteamOS.",
          "score": 2,
          "created_utc": 1751312617.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n0qa8jg",
      "author": "QuantumQuantonium",
      "body": "Being thr \"only real alternative to the steam deck\" thst means its priced similarly too, right?...\n\n$750 what a joke.\n\nHandhelds dont need to be high end PCs, they just need to play games comfortably given their form factor. Theres plenty of handhelds above $500 but the switch 2 and steam deck both prove to be the best value and most popular because its affordable and capable. Anything else new under $500 is either a mobile or cloud streaming device.\n\nBy all means, continue releasing pricey devices, letting valve dominate the market on thr PC side. Hopefully asus and Microsoft can pull some strings and make a version of the Xbox handheld under $500.",
      "score": 2,
      "created_utc": 1751362003.0,
      "replies": []
    },
    {
      "id": "n0rvwus",
      "author": "what595654",
      "body": "No track pads, no buy. A true PC handheld should be able to play ALL genres of PC games. Else, it is a half baked product. \n\nI am not using a joystick for an FPS, strategy game, or isometric RPG. Ridiculous.",
      "score": 2,
      "created_utc": 1751383881.0,
      "replies": [
        {
          "id": "n5h396v",
          "author": "xXShadowGravesXx",
          "body": "The Legion Go is where it’s at. The tiny ass excuse for a trackpad on the Legion Go S does not count.",
          "score": 1,
          "created_utc": 1753640540.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n6n8mms",
      "author": "Herr-Wolfgang",
      "body": "Can you connect two external controllers if you want to play local 1v1 (e.g. for fighters, racing, or co-op)?",
      "score": 1,
      "created_utc": 1754196778.0,
      "replies": []
    },
    {
      "id": "n6o8hfa",
      "author": "pokomoro",
      "body": "Finally a solid Deck rival? SteamOS seals the deal.",
      "score": 1,
      "created_utc": 1754217038.0,
      "replies": []
    },
    {
      "id": "n0m1ao2",
      "author": "Sangui",
      "body": "There's literally no situation where a Lenovo anything is the best version of something.",
      "score": 1,
      "created_utc": 1751304543.0,
      "replies": [
        {
          "id": "n0o6jpc",
          "author": "mrblaze1357",
          "body": "I got the Go S (Z2Go, 32GB, 1TB) a bit over two weeks ago. I first thing I did was uninstall windows, and install Steam OS. There were a handful of minor bugs, mostly audio issues, but overall it worked as expected out of the box. \n\nFrom firsthand experience if anyone tells you the Z2Go is a crappy chip, they're full of hot air. It's all power profie dependant, or fidelity dependent. I haven't come across a game I can't run so far. Usually a few tweaks to power/resolution makes any game a 40-120fps experience. Battery life is on par with most handhelds at 2 hours for let's say Doom or God of War. 3-5 hours for like Hades, or Dave the Diver. Got 6 playing just Balatro to see how far I could push it. \n\nWeight is my biggest complaint, but otherwise that screen is killer, the grips feel great, and the dual action triggers are a great addition.",
          "score": 3,
          "created_utc": 1751327821.0,
          "replies": [
            {
              "id": "n0ox3eg",
              "author": "LiftSleepRepeat123",
              "body": "> first thing I did was uninstall windows, and install Steam OS\n\nPeople are using Steam OS for a desktop operating system? Or are you basically just turning it into a gaming machine with no other functionality?",
              "score": 2,
              "created_utc": 1751337238.0,
              "replies": [
                {
                  "id": "n0p9pq8",
                  "author": "mrblaze1357",
                  "body": "It has a full Linux desktop environment. You can use it like a PC. But I have a laptop & desktop I use for that kind of stuff anyway",
                  "score": 1,
                  "created_utc": 1751342178.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n0o763t",
          "author": "Rullino",
          "body": "Their Thinkpad branding is one of the best ones out there, even in the used market since they're known for reliability at good prices, especially when companies sell them for much cheaper than the original price.",
          "score": 2,
          "created_utc": 1751328031.0,
          "replies": []
        }
      ]
    }
  ]
}