{
  "post": {
    "title": "Sony developing handheld device that plays PS5 games, competing with Nintendo Switch | It may also be competing with Microsoft's future handheld",
    "author": "chrisdh79",
    "id": "1gzg5rg",
    "score": 1342,
    "created_utc": 1732531799.0,
    "selftext": "",
    "num_comments": 228,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gzg5rg/sony_developing_handheld_device_that_plays_ps5/"
  },
  "comments": [
    {
      "id": "lywrlrn",
      "author": "jetstobrazil",
      "body": "So an item that doesn’t exist is competing with another item that doesn’t exist, against a 6 year old product?",
      "score": 107,
      "created_utc": 1732544996.0,
      "replies": [
        {
          "id": "lyxqwn9",
          "author": "None",
          "body": "[removed]",
          "score": 28,
          "created_utc": 1732556361.0,
          "replies": [
            {
              "id": "lyxvrwh",
              "author": "CreaminFreeman",
              "body": "What a time to be alive, amirite!?",
              "score": 7,
              "created_utc": 1732557831.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyyozdr",
          "author": "dandroid126",
          "body": "I'm certain that the Switch 2 will be out before the rumored Xbox or PS handhelds. Nintendo has confirmed the existence of a Switch 2, and recent rumors point to production having already started, with a launch as early as 3-4 months from now.",
          "score": 7,
          "created_utc": 1732566893.0,
          "replies": [
            {
              "id": "lz2lgwe",
              "author": "None",
              "body": "If Xbox can run windows I’m down to play some emulators",
              "score": 3,
              "created_utc": 1732628001.0,
              "replies": [
                {
                  "id": "lz355om",
                  "author": "Deceptiveideas",
                  "body": "I’m curious if it’d be an actual Xbox product or a surface gaming product that “supports Xbox”.",
                  "score": 1,
                  "created_utc": 1732634990.0,
                  "replies": [
                    {
                      "id": "m0izzpj",
                      "author": "kobemustard",
                      "body": "With the new chips coming out like lunar lake, just give me an 8 inch surface tablet with Bluetooth game controllers",
                      "score": 1,
                      "created_utc": 1733400906.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lz5gg5q",
                  "author": "Izoi2",
                  "body": "Isn’t that what a steam deck is for?",
                  "score": 1,
                  "created_utc": 1732660700.0,
                  "replies": [
                    {
                      "id": "lz5qw6z",
                      "author": "None",
                      "body": "Yes but it’s too heavy and expensive. Nobody said that the future Xbox would be cheaper though",
                      "score": 1,
                      "created_utc": 1732664386.0,
                      "replies": [
                        {
                          "id": "lz8aro6",
                          "author": "relator_fabula",
                          "body": "There are plenty of cheap-ish handhelds that can run emulators, depending on what consoles you're looking to emulate. There will never be some magical all-powerful handheld that can emulate consoles from the past 10 years or less... Like, you're not emulating a PS4 or a Switch on an inexpensive handheld, but you can get one that will play along the lines of the PS2 and gamecube for under $150.",
                          "score": 1,
                          "created_utc": 1732709060.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lzhumk9",
              "author": "None",
              "body": "I will force myself to wait till all three are out so I can watch videos for hours on comparisons just to end up not buying one, as I continue to research and watch the same videos again as if it’ll make a difference the second time to help me choose.",
              "score": 1,
              "created_utc": 1732844006.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lywiqv3",
      "author": "Takco",
      "body": "Think I’d rather a steam deck since the vast majority of exclusives eventually come to PC",
      "score": 359,
      "created_utc": 1732541603.0,
      "replies": [
        {
          "id": "lywtnpq",
          "author": "Jon_TWR",
          "body": "Unfortunately it’s getting harder and harder for the Steam Deck to play the newest PS5 games. It can still do it, but it’s getting rough.\n\nBut a Steam Deck 2 will probably be out either around the same time as this, or not long after.",
          "score": 120,
          "created_utc": 1732545745.0,
          "replies": [
            {
              "id": "lywzciv",
              "author": "None",
              "body": "[deleted]",
              "score": 53,
              "created_utc": 1732547703.0,
              "replies": [
                {
                  "id": "lyxtk6x",
                  "author": "WankerBott",
                  "body": "all I play on mine is older RPGs and emulated classics. Loving the Pixel Rematered Final Fantasy on the crapper at work, Boss isnt a fan but it's only because he doesn't have an OLED screen.",
                  "score": 13,
                  "created_utc": 1732557163.0,
                  "replies": [
                    {
                      "id": "lyxttin",
                      "author": "Dull_Half_6107",
                      "body": "Yeah OLED screen really pops with colourful games",
                      "score": 5,
                      "created_utc": 1732557240.0,
                      "replies": [
                        {
                          "id": "lyzbnxz",
                          "author": "WankerBott",
                          "body": "yeah, I really liked the ori games on it, they played and looked great. \n\nBut I prefer the classic 2d, 2.5d rpgs because that was what really caught me on consoles. I liked other games, but it was always someone wanting to fight you or beat your score. \n\nCrystal Project is kick ass on steam deck too. If you don't have that on switch, you should check it out. Best $15 bucks I spent on a early release game that hasn't disappointed me yet on steam. (honestly don't remember what I paid on steam for early release, but its $15 on switch)",
                          "score": 3,
                          "created_utc": 1732573926.0,
                          "replies": []
                        },
                        {
                          "id": "lyzc55j",
                          "author": "WankerBott",
                          "body": "Yes, I upgraded when it price dropped the first time, did not regret.",
                          "score": 2,
                          "created_utc": 1732574082.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "lyy9dz2",
                      "author": "JustNotMe_",
                      "body": "I really want to buy the pixel remaster, but not for 75€.. Nintendo sucks for discounts..",
                      "score": 2,
                      "created_utc": 1732562046.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyztfam",
                  "author": "Roy-Southman",
                  "body": "Yeah, it is unreal the amount of AAA games you can play on the Deck as long as they are from the previous generations. It feels like sci-fi to me the ability to play all kinds of games on a handheld since my first introduction to video games was on the NES.",
                  "score": 3,
                  "created_utc": 1732580089.0,
                  "replies": []
                },
                {
                  "id": "lyxtvgw",
                  "author": "derrhn",
                  "body": "Mine turned into the Vampire Survivors and Rimworld machine. I always intend to try more taxing things but I always return to those two.\n\nI still absolutely adore the hardware and would buy a revision immediately",
                  "score": 2,
                  "created_utc": 1732557257.0,
                  "replies": []
                },
                {
                  "id": "lz776f4",
                  "author": "TheDrGoo",
                  "body": "It came out during the PS4 era it makes total sense that’s its limit",
                  "score": 2,
                  "created_utc": 1732685097.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lywv6vq",
              "author": "None",
              "body": "[deleted]",
              "score": 34,
              "created_utc": 1732546284.0,
              "replies": [
                {
                  "id": "lyx3uts",
                  "author": "Dull_Half_6107",
                  "body": "With the current state of most AAA game releases, if the name of your game doesn’t start with “Resident” and end in “Evil”, then I’m highly likely to wait and pick it up on a sale 2 years after release.\n\nSpace Marine 2 was the rare exception because good Warhammer 40k games are so rare I want to support them so they keep making more.",
                  "score": 14,
                  "created_utc": 1732549184.0,
                  "replies": [
                    {
                      "id": "lyxu0ge",
                      "author": "derrhn",
                      "body": "Resi 4 Remake was the last AAA I got on release and it was absolutely worth it. Hard agree on being patient otherwise.",
                      "score": 3,
                      "created_utc": 1732557299.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyxaht7",
                  "author": "PeerPressure",
                  "body": "I’ve been picking up AAA games a few months later, after multiple patches, for around $30-$40. Finding time to play them is a different story.",
                  "score": 4,
                  "created_utc": 1732551296.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyx7tl5",
              "author": "sgeep",
              "body": "Interesting. My experience has kinda been the opposite. Days Gone, Tsushima, and Ragnarok have actually been some of the most impressive Steam Deck ports I've seen for similar games",
              "score": 6,
              "created_utc": 1732550447.0,
              "replies": [
                {
                  "id": "lyy3hui",
                  "author": "EVMad",
                  "body": "Same, and even games that are unsupported have performed well for the most part. The community is great with help for what version of proton to use and patches, launcher tweaks etc. Currently switching between my desktop and Steamdeck playing Guardians of the Galaxy and the Steamdeck handles it pretty well although there are some game breaking bugs where the frame rate drops to nothing and I have to reboot so that's likely why the game is marked as unsupported. Outside of that though, it's smooth and graphically damn good so once they figure out where the issue is then all good.",
                  "score": 3,
                  "created_utc": 1732560226.0,
                  "replies": []
                },
                {
                  "id": "lz17lxx",
                  "author": "RealisLit",
                  "body": "I mean, those are ps4 games",
                  "score": 2,
                  "created_utc": 1732599601.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lz0w1kd",
              "author": "rolfraikou",
              "body": "Aren't most new PC ports of PS5 games using better graphics than the native PS5 versions anyway? So it makes sense. Essentially, the Steamdeck *can* play games fairly well from when it came out.\n\nI think you are right, by the time the Steam Deck 2 comes out, it will probably be on par with, if not slightly better than the Sony handheld. \n\nHandhelds will always be a bit behind. It makes sense. I'm honestly shocked how close to handling modern games they are on systems like the Steamdeck and Steamdeck OLED.\n\nComparing it to just how far from a console experience the PSP and PSVita were when they came out, the gap is slightly smaller, I would say, for modern consoles compared to Steamdeck.",
              "score": 3,
              "created_utc": 1732594233.0,
              "replies": [
                {
                  "id": "lz0z3mr",
                  "author": "Jon_TWR",
                  "body": "I agree. The Steamdeck is honestly very impressive, even now. I had a PS4 Pro when it came out, and a PS5 now, and the Steam Deck can get higher framerates than the PS4 Pro, but not at the resolutions the PS4 Pro is capable of. Basically, the CPU is faster than the PS4’s, and the GPU is weaker than the PS4’s.\n\nReally an impressive handheld.",
                  "score": 5,
                  "created_utc": 1732595540.0,
                  "replies": [
                    {
                      "id": "lz164pd",
                      "author": "EVMad",
                      "body": "I only got my Steamdeck a few weeks back and while I'm a Linux expert so I'm happy to tinker, I'm very impressed with the basic out of the box performance. It's definitely last gen performance but that's still no bad thing because I bought into the hype and got an Xbox Series X only to find it barely improved over my One X and PS4 Pro and for that reason I decided to pass on the PS5, and especially the PS5 Pro. Getting streaming running from my consoles, as well as my desktop PC also allows me to play pretty much anything, as does Emudeck. It's a little powerhouse and superbly flexible. It basically saved gaming for me.",
                      "score": 1,
                      "created_utc": 1732598861.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyxwfhi",
              "author": "TONKAHANAH",
              "body": "I wouldn't hold my breath on a steam deck 2 any time soon. You can't lump valve into the same group as Sony and Microsoft, they don't operate with the same objectives or time lines, if they did we'd have half life 3 by now.\n\nIt would be nice but I'm still amazed the first steam deck even happened at all and knowing valve time, I just don't see a new one any time soon.\n\nBut I've been plenty wrong before.",
              "score": 4,
              "created_utc": 1732558035.0,
              "replies": [
                {
                  "id": "lyxxdkf",
                  "author": "Jon_TWR",
                  "body": "I’d expect the Steam Deck 2 to be announced in 2-3 years—around the same time I’d expect this to come out, if it is going to come out.\n\nI could be wrong, and maybe it’ll be 5 more years…we’re all just guessing.",
                  "score": 1,
                  "created_utc": 1732558326.0,
                  "replies": [
                    {
                      "id": "lyy0ln5",
                      "author": "TONKAHANAH",
                      "body": "Thing is I'm not going to even expect valve to do a steam deck 2 until they announce it. Valve is famous for making new things and then just not doing them any more.\n\nGranted the steam deck is the first highly successful non-game project they've done since steam it's self so I'd say chances are better than past projects but the track record stands.\n\nLike we're still waiting on another vr head set, supposedly that's coming but nothing yet.\n\nThey said steam OS 3 was gonna come to desktops 4 years ago when the deck released and that hadn't happened yet.\n\nHalf life 2 saw like 3 different almost completed builds that got scrapped before restarting and half life 2/ep3 got scrapped\n\nThey drop stuff all the time and take 3x longer to do stuff than any one else. They don't have any track record of releasing consecutive consoles on any kind of regular time like and they don't operate with the intent to compete against the other console manufacturers so trying to suggest a release lineup to compete is pointless. \n\nI'm not going to assume a deck 2 is even happening at all until it does, much less try to guess a time window.\n\nIf steam deck 2 does happen, then I'll make assumption on a steam deck 3, until then everything I've seen from valve tells me not to get my hopes up until they actually announce something.",
                      "score": 2,
                      "created_utc": 1732559326.0,
                      "replies": [
                        {
                          "id": "lyyaahj",
                          "author": "Jon_TWR",
                          "body": "Valve said they’re waiting on the Steam Deck 2 until there’s been a generational improvement in performance.\n\nSo it’s not guaranteed, but I’ll bet they will release one within the next 5 years.",
                          "score": 0,
                          "created_utc": 1732562345.0,
                          "replies": [
                            {
                              "id": "lyyn9tc",
                              "author": "TONKAHANAH",
                              "body": "Valve says a lot of things, again, still waiting on Steam OS 3 iso",
                              "score": 2,
                              "created_utc": 1732566367.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyy090k",
              "author": "paulerxx",
              "body": "20fps in Stalker 2",
              "score": 1,
              "created_utc": 1732559218.0,
              "replies": []
            },
            {
              "id": "lyzkjbo",
              "author": "DonTeca35",
              "body": "Thats not true at all, only bs linux has had to deal with (along with steam users on the windows) is the ps login overlay crap",
              "score": 1,
              "created_utc": 1732576932.0,
              "replies": [
                {
                  "id": "lyzp9lx",
                  "author": "Jon_TWR",
                  "body": "It is true. Some PS5 exclusives that have come to PC have drops below 30 FPS on the Steam Deck.\n\nIt’s not BS, it’s just games requiring more powerful hardware than the Steam Deck.",
                  "score": 1,
                  "created_utc": 1732578608.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyxiktv",
              "author": "Plank_With_A_Nail_In",
              "body": "What is it with the PC crowd and its \"If its not 60fps and ultra its shit\". 720p medium or low is still a great experience, should be comparing to what switch can do anyway.\n\nAnyone thinking the experience is going to be different with a Sony version is living in a fantasy.",
              "score": -1,
              "created_utc": 1732553804.0,
              "replies": [
                {
                  "id": "lyxty52",
                  "author": "DolphinFlavorDorito",
                  "body": "Yeah, but the Deck struggles with Baldur's Gate 3 even AT 720 (or 800, given the aspect ratio), often chugging in the 20fps range. I'm perfectly fine with 720p30 on a handheld, but it should be pretty much locked there.",
                  "score": 6,
                  "created_utc": 1732557280.0,
                  "replies": []
                },
                {
                  "id": "lyxr0z7",
                  "author": "None",
                  "body": "If you’re using the Switch as a visual benchmark in 2024 then we’ll never progress.",
                  "score": 2,
                  "created_utc": 1732556397.0,
                  "replies": [
                    {
                      "id": "lyy2leo",
                      "author": "Revenge_of_the_User",
                      "body": "My switch gets occasional frame freezes with Stardew Valley in 1.6; its basically just what a souped up game-compatible smartphone could do in 2017. \n\nAdd in the joystick issues and the Required subscription for basic online functions.....Switch belongs nowhere in quality discussions.",
                      "score": 5,
                      "created_utc": 1732559947.0,
                      "replies": [
                        {
                          "id": "lyy8qga",
                          "author": "ye_olde_green_eyes",
                          "body": "The switch is made from grey market tablet parts from 2014.",
                          "score": 4,
                          "created_utc": 1732561839.0,
                          "replies": [
                            {
                              "id": "lyyf42j",
                              "author": "Revenge_of_the_User",
                              "body": "I was being kind lol",
                              "score": 3,
                              "created_utc": 1732563836.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lz5ujdu",
              "author": "blackrock55",
              "body": "Unless there's a major generation leap in technology valve aren't going to put out steam deck 2. I know the word was similar to that. Can't remember specifics lol",
              "score": 0,
              "created_utc": 1732665719.0,
              "replies": [
                {
                  "id": "lz60e0b",
                  "author": "Jon_TWR",
                  "body": "There will be a generational leap in technology...it'll just take a few years, lol.",
                  "score": 1,
                  "created_utc": 1732667903.0,
                  "replies": [
                    {
                      "id": "lz62w71",
                      "author": "blackrock55",
                      "body": "Oh yeah definitely I'm denying it won't happen of course! It's just valve aren't going after lots of improvements and revisions of the deck. That's what I'm trying to get at. They're just releasing a good product until something genuinely worth it comes along",
                      "score": 1,
                      "created_utc": 1732668837.0,
                      "replies": [
                        {
                          "id": "lz67shr",
                          "author": "Jon_TWR",
                          "body": "Sure, but the rumored PS5P or PPS5 or PSP5, or whatever you want to call this portable device that will be able to play PS5 games won’t be out for a few years either. That’s why I made the guess that the Steam Deck 2 will probably be out around the same time as this or shortly after.",
                          "score": 2,
                          "created_utc": 1732670672.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyy86ts",
              "author": "kurotech",
              "body": "But steam deck is still a full system this Sony crap is just an end point for a streaming server it's a screen and controller with wireless nothing more you still need the hardware side to play the game weither this will be like stadia or the PlayStation portal is what matters one you need a PlayStation one you need a constant high speed internet connection",
              "score": -5,
              "created_utc": 1732561669.0,
              "replies": [
                {
                  "id": "lyyer4r",
                  "author": "Jon_TWR",
                  "body": "Did you not even read the headline? This would be a portable device that plays PS5 games. A PS5P, if you will.\n\nNot the Playstation Portal.",
                  "score": 0,
                  "created_utc": 1732563726.0,
                  "replies": [
                    {
                      "id": "lyzm2oo",
                      "author": "Critical_Impact",
                      "body": "I don't think the hardware exists for that to actually happen. If it did it'd either be the size of a laptop or have 2 minutes of battery\n\n\nThere's a reason that valve haven't made a Steam Deck 2 yet, the technology to make something better doesn't exist",
                      "score": 0,
                      "created_utc": 1732577474.0,
                      "replies": [
                        {
                          "id": "lz2u23d",
                          "author": "dakoellis",
                          "body": "other companies *have* made something better, at least from a hardware standpoint.  Valve haven't made a Steam Deck 2 because it's a console, not a phone - If you release a new version every year or 2 with upgraded hardware people won't be happy with you.  Valve have an image of consumer first, and I don't see them trying to throw that away anytime soon",
                          "score": 1,
                          "created_utc": 1732631230.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lyxqlr8",
          "author": "p_giguere1",
          "body": "Should we expect the Sony handheld to have better optimization, i.e. better performance for equivalent specs?\n\nI think it's generally accepted that consoles have better performance relative to specs compared to a Windows PC, thanks to a mix of game optimization, running a lighter OS and having hardware designed with precise software in mind.\n\nNot sure how true that holds for the Steam Deck though, which is somewhere in between a console and a traditional PC.",
          "score": 2,
          "created_utc": 1732556270.0,
          "replies": [
            {
              "id": "lyzmi67",
              "author": "Critical_Impact",
              "body": "That used to be true, but as far as I can tell the multi-platform releases and heavy use of the unreal engine means that any single-platform optimizations are giving far lower returns.\n\nOn top of that we used to expect companies to optimize for consoles and handhelds but they seem to be happy pushing games out in sub-optimal states now",
              "score": 2,
              "created_utc": 1732577627.0,
              "replies": [
                {
                  "id": "lz0guql",
                  "author": "p_giguere1",
                  "body": "I see! That seems to match my experience as well.\n\nI used to be blown away by the Xbox 360/PS3 graphics, especially knowing specs were like 256MB RAM/256MB VRAM.\n\nNowadays all I'm asking is for Silent Hill 2 (UE5) to run properly on PS5 and PS5 Pro, and that seems to be a challenge for devs.",
                  "score": 2,
                  "created_utc": 1732588403.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyxxvzw",
          "author": "gameonlockking",
          "body": "That tech is from 2018 it’s gonna be 2025 quickly. Get a rog ally or something newer if you go that route. ",
          "score": 2,
          "created_utc": 1732558484.0,
          "replies": []
        },
        {
          "id": "lyx7w6q",
          "author": "Bootychomper23",
          "body": "Yup especially if this handheld has to have dedicated ports made. Whereas steam deck just lets you attempt to play whatever. After they completely fucked over Vita unless this handheld can access ps4/ps5 games without devs needing to step in and port them then I’m not optimistic about support.",
          "score": 1,
          "created_utc": 1732550470.0,
          "replies": []
        },
        {
          "id": "lyxzbf4",
          "author": "antara33",
          "body": "As someone that owns a stupidly high end pc, I'm super willing to get a handheld that actually allows me to stream from steam to it, so I can play from my bed LMAO.\n\nSteam deck is expensive for this endevour, but maybe there are good android based alternatives?",
          "score": 0,
          "created_utc": 1732558930.0,
          "replies": [
            {
              "id": "lz19ioz",
              "author": "Pidder_Paddy",
              "body": "I also have a descent gaming rig and use moonlight to stream to my steam deck over wifi. No noticeable latency especially with a single player campaign. \n\nI do recommend steam deck and you can pick them up fairly cheap used at GameStop but if you want to try game streaming first the moonlight app works on phones and tablets.",
              "score": 1,
              "created_utc": 1732600586.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyxou4y",
          "author": "Jackal239",
          "body": "The crazy part is, Sony and Microsoft are only doing this because of how successful the Steam Deck was.",
          "score": -5,
          "created_utc": 1732555729.0,
          "replies": []
        },
        {
          "id": "lyxe1p8",
          "author": "DARR3Nv2",
          "body": "Laptops are also portable. I question the intelligence of anyone who bought a “handheld” pc lol",
          "score": -21,
          "created_utc": 1732552414.0,
          "replies": [
            {
              "id": "lyxgste",
              "author": "takiwasabi",
              "body": "Your “intelligence” cannot comprehend why a handheld size device that doesn’t require a table, keyboard, and mouse, is more portable than an entire laptop? Yikes.",
              "score": 10,
              "created_utc": 1732553263.0,
              "replies": [
                {
                  "id": "lyxgwnf",
                  "author": "DARR3Nv2",
                  "body": "I understand the concept. But, to be convinced to buy it. Dumb.",
                  "score": -18,
                  "created_utc": 1732553297.0,
                  "replies": [
                    {
                      "id": "lyxj3ai",
                      "author": "NecroCannon",
                      "body": "The Steam deck is probably the only one truly worth it since it’s sold at a loss like consoles. The thing is, it’s way better for portable gaming with a controller than a laptop. I can’t play on a laptop lying down as easily, can’t carry the laptop and things to game on easily, and the only other cheap option? A Nintendo Switch that can barely handle modern titles.\n\nPeople with your mentality are dumb, not the ones buying them, imo",
                      "score": 3,
                      "created_utc": 1732553961.0,
                      "replies": [
                        {
                          "id": "lyxn63t",
                          "author": "DARR3Nv2",
                          "body": "Bruh the only argument I’ve heard is, “I can play it laying down.” Aside from the people commenting with physical disabilities. Yall bought an inferior piece of tech so you could be lazier than you already were. Congrats lol",
                          "score": -10,
                          "created_utc": 1732555223.0,
                          "replies": [
                            {
                              "id": "lyzo6lt",
                              "author": "NecroCannon",
                              "body": "So… not lugging around a gaming laptop, power cable, mouse/controller which takes way more space than just a handheld and a cable is lazy?\n\nWhy even use a gaming laptop then? By your logic it’d be more efficient to build a sffpc and buy a portable monitor to just plug and play wherever because gaming laptops are more expensive than PCs for what you get",
                              "score": 2,
                              "created_utc": 1732578224.0,
                              "replies": [
                                {
                                  "id": "lyzpsff",
                                  "author": "DARR3Nv2",
                                  "body": "Uhhh yeah. Super lazy. Laptop will always be better. Your argument is. You have to make minimal extra effort. What would you call that?",
                                  "score": -1,
                                  "created_utc": 1732578793.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lyxkknw",
                      "author": "takiwasabi",
                      "body": "Just because people have different use cases you think they’re dumb?\n\nI think it’s more dumb that you can’t comprehend that convenience and portability is a desirable trait. Not everyone likes lugging around laptops. A steam deck fits in a small bag or a purse. You can take it out while on public transit.",
                      "score": 3,
                      "created_utc": 1732554423.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyxkb43",
              "author": "Pingy_Junk",
              "body": "Laptops in general aren’t great at running a lot of the games I want and I hate using a computer with a trackpad. Can’t exactly use a mouse while I’m lying down. Steam deck has been a godsend for the days when I’m physically too ill to sit up at a desk. Also a steam deck plays completely differently from a laptop a handheld console feels very different from playing on a pc.",
              "score": 1,
              "created_utc": 1732554338.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyy7b61",
          "author": "kurotech",
          "body": "You aren't even running the games on this thing it's a controller and screen it's like the stadia service from Google so you're just streaming the game to the handheld anyway",
          "score": -2,
          "created_utc": 1732561399.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyw200c",
      "author": "wicktus",
      "body": "legit curious to see it and interested by it. Psp was awesome, psvita too but but not managed well\n\nRegarding the headline, players are too attached to nintendo’s franchises…and as long as each one of your game costs hundreds of millions and nintendo can release much cheaper games that sell much more, there’s no competition\n\nBut..there’s no rivalry to begin with, it has always been different markets and complementary with the switch. It’s rare to see someone either picking up a switch OR a ps5/pc, it’ rather an AND, it exists but rare imho",
      "score": 103,
      "created_utc": 1732533509.0,
      "replies": [
        {
          "id": "lywklhi",
          "author": "R3dbeardLFC",
          "body": "I used to work for Sony and on the PS Vita production (games, not consoles). It took no time at all for them to completely stop giving a fuck about the vita. They are not good at promoting/marketing and keeping up interest. They seemed to bail the very second sales weren't incredible.\n\nAlso I play both PS5 and switch. The ability for the switch to sync up to a tv helps a lot there though.",
          "score": 51,
          "created_utc": 1732542336.0,
          "replies": [
            {
              "id": "lywqlus",
              "author": "None",
              "body": "[deleted]",
              "score": 19,
              "created_utc": 1732544631.0,
              "replies": [
                {
                  "id": "lz2frhm",
                  "author": "robitussinlatte4life",
                  "body": "Damn shame too, because it's an excellent device. Perhaps if the price of entry weren't so crazy, it would sell better.",
                  "score": 2,
                  "created_utc": 1732625653.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lywqvsi",
          "author": "OffTerror",
          "body": "PSP was so good. It was like owning a smartphone or a mini computer at the time.",
          "score": 20,
          "created_utc": 1732544734.0,
          "replies": []
        },
        {
          "id": "lywv9kz",
          "author": "abarrelofmankeys",
          "body": "Ps vita was great. If it had micro sd cards instead of proprietary crap that cost 4 times as much it would have done well. \n\nOh you wanna play uncharted? 50 dollars and it takes a whole 40 dollar memory card. Have fun chump.",
          "score": 14,
          "created_utc": 1732546309.0,
          "replies": []
        },
        {
          "id": "lyw4v5c",
          "author": "Valdie29",
          "body": "I have a friend that is sort of collector has old ps and xboxes including segas and nintendos from 90‘s and doesn’t play games at all simply because no time for it",
          "score": 12,
          "created_utc": 1732535161.0,
          "replies": [
            {
              "id": "lywab3x",
              "author": "_packo_",
              "body": "Ah yes. \n\nAdulthood.",
              "score": 23,
              "created_utc": 1732537939.0,
              "replies": []
            },
            {
              "id": "lyw9q2y",
              "author": "Snipedzoi",
              "body": "Similar thing, I'm in the sbc gaming and handhelds community. Many of us spend hours configuring and  buying, but we never play anything",
              "score": 3,
              "created_utc": 1732537656.0,
              "replies": [
                {
                  "id": "lyyfnbg",
                  "author": "DaoFerret",
                  "body": "More and more reason why I like consoles for gaming vs a gaming PC.\n\nLess personal time on maintenance, more on playing the game (when I can find the time to play).",
                  "score": -1,
                  "created_utc": 1732564001.0,
                  "replies": [
                    {
                      "id": "lyyn31t",
                      "author": "Snipedzoi",
                      "body": "Although there is also games look worse, worse frame rate for same price, etc",
                      "score": 2,
                      "created_utc": 1732566310.0,
                      "replies": [
                        {
                          "id": "lyyq2l0",
                          "author": "DaoFerret",
                          "body": "Fortunately there are more games than I have time for, so I can just avoid those.",
                          "score": 1,
                          "created_utc": 1732567226.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lywin3r",
              "author": "safeness",
              "body": "Kinda like my steam library.",
              "score": 2,
              "created_utc": 1732541561.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lywn6fi",
          "author": "None",
          "body": "Handheld enthusiast here. I'd buy it. But I am worried about battery life. I hope it will be a native console and not a streaming tablet (PS portal) which retails for the same price as a real console (Switch lite).",
          "score": 5,
          "created_utc": 1732543335.0,
          "replies": [
            {
              "id": "lywteby",
              "author": "Jon_TWR",
              "body": "After owning a Steam Deck, I believe Sony could make something that could play PS5 games at 800p-1080p at 30-60 FPS with technology that exists right now, with ok battery life (like 1-2 hours for high end games).\n\nIt would probably cost as much as a PS5 or PS5 pro. But it’d probably sell better than PSVR, especially if they also sold a dock so you could hook it up to your TV, even if it didn’t have quite the same performance as the base PS5.",
              "score": 2,
              "created_utc": 1732545650.0,
              "replies": [
                {
                  "id": "lywu8dl",
                  "author": "None",
                  "body": "Yikes. 1 hour for high end games is not enough for me. I'd personally would rather have a portable PS4 console with a good batter life over a portable PS5 with a shitty battery life. \n\n\nThis is what kept me from buying steam deck until OLED came out which still has a mediocre battery but its more tolerable than it previously was. \n\n\nHandheld consoles' important aspect isn't specs, its the longevity. There is no point in a portable PS5 if I can only play the games for 1 hour or use an AC adapter. Like we already had Atari Lynx and Sega GameGear which had this issue and that's why Gameboy had outsold both despite being a marginally weaker console.",
                  "score": 4,
                  "created_utc": 1732545947.0,
                  "replies": [
                    {
                      "id": "lyx9zxo",
                      "author": "_RADIANTSUN_",
                      "body": "Guarantee (put money on this) it will have 3-6 hour battery life in general, barely 3 or slightly under for intensive stuff.",
                      "score": 2,
                      "created_utc": 1732551138.0,
                      "replies": [
                        {
                          "id": "lyxacm2",
                          "author": "None",
                          "body": "It better be!. I love handhelds but I hate the recent trend of making super powerful handheld at the expense of size and battery life. Switch might be underpowered but atleast it has good battery life and is comfortable to move around.",
                          "score": 2,
                          "created_utc": 1732551250.0,
                          "replies": [
                            {
                              "id": "lyxs8a1",
                              "author": "_RADIANTSUN_",
                              "body": "3-6 hours to me is SHORT, to be clear. To me that would be the bare minimum before it's just annoyingly too low. Nintendo actually makes 6+ hour capable handhelds that you don't have to charge every single session, feel like I have to be close to an outlet or carry a powerbank always.",
                              "score": 2,
                              "created_utc": 1732556760.0,
                              "replies": [
                                {
                                  "id": "lyxw1zh",
                                  "author": "None",
                                  "body": "Yeah but its better than 1-2 hours most Pc handhelds manufacturers think is okay. \n\n\nLike Steam Deck Oled battery is still weak but its way better than its competition and you can play Fallout 4 for 5 hours with 30 fps",
                                  "score": 1,
                                  "created_utc": 1732557918.0,
                                  "replies": [
                                    {
                                      "id": "lyyrupg",
                                      "author": "_RADIANTSUN_",
                                      "body": "Yeah to me that is unacceptably low battery life, like there's not even any point in having a handheld portable at that point, might as well just get a laptop tbh.",
                                      "score": 2,
                                      "created_utc": 1732567767.0,
                                      "replies": [
                                        {
                                          "id": "lyytzii",
                                          "author": "None",
                                          "body": "Yeah. Hence why I think 99% of all Pc handhelds are trash. Like they are good but battery life is just too bad for them to be good products. Steam Deck saves the day again. Yet another reason why I love mine. I hope Valve releases Steam Deck's Steam OS which in term will make Linux more popular.",
                                          "score": 1,
                                          "created_utc": 1732568412.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lyxppsl",
                          "author": "Plank_With_A_Nail_In",
                          "body": "Its going to be basically a steam deck in a Sony branded box. slightly newer tech but not a major change, living in a dream world if you think its going to be different.",
                          "score": 1,
                          "created_utc": 1732555998.0,
                          "replies": [
                            {
                              "id": "lyxsl3h",
                              "author": "_RADIANTSUN_",
                              "body": "Yes but they can accomplish 3-6 hours (which is extremely short still IMO, but it's the bare minimum if you ask me) in that package. They can make whatever cuts they need to the fidelity, to achieve that.",
                              "score": 1,
                              "created_utc": 1732556868.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lyxpi29",
                      "author": "Plank_With_A_Nail_In",
                      "body": "Its going to be the same thing as the steam deck and its clones, maybe slightly updated but its still going to have the same issues.",
                      "score": 1,
                      "created_utc": 1732555932.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyx7d0g",
                  "author": "BIGSTANKDICKDADDY",
                  "body": "My question is why they would pivot to an $800+ device that plays PS5 games at lower quality settings, lower resolution, lower framerates, for 1~2 hours when when they *already have* a $200 accessory (for a $400 console) that lets you play PS5 games on a handheld with full quality settings at 1080p60 for 7~9 hours. \n\nAFAIK the vast majority of Steam Deck owners play primarily or exclusively at home. All of this extra cost and engineering effort would be to to unlock portable play that most customers don't even want or use. I'm struggling to see the value proposition here.",
                  "score": 1,
                  "created_utc": 1732550301.0,
                  "replies": [
                    {
                      "id": "lyxb9qn",
                      "author": "_RADIANTSUN_",
                      "body": "Because the Portal requires already owning a PS5. It doesn't increase the PS5 install base to have the Portal, it's an additional accessory for someone who already has a PS5 as well.\n\nA PS5P would be a separate device capable of playing PS5 games and catering to the portable/handheld market to add to the PS5 platform install base.",
                      "score": 5,
                      "created_utc": 1732551542.0,
                      "replies": [
                        {
                          "id": "lyz2zhk",
                          "author": "BIGSTANKDICKDADDY",
                          "body": "What I'm saying is that Sony can sell their current products to this hypothetical buyer today at a lower price. If there's a customer out there who loves what Sony has to offer, but really only wants to buy in if they can switch between portable and docked, there's a $600 bundle with the PS5 + Portal that satisfies that customer.\n\nThe \"PS5P\" would exist **solely** to cater to the customer who fits the above criteria and *also* wants to take their handheld out of the house on a regular basis (where remote streaming would not be a viable option). Based on both Switch and Steam Deck user behavior I'm not convinced that latter demographic is meaningful in size, or at least meaningful enough to make a dent on sales where the former group wouldn't. The Portal already captures the majority of the handheld demographic, the \"PS5P\" just grows it slightly more to cover that final sliver.",
                          "score": 1,
                          "created_utc": 1732571170.0,
                          "replies": [
                            {
                              "id": "lyzk2o0",
                              "author": "_RADIANTSUN_",
                              "body": "I think the price would be the key point and I doubt they would ever launch at $800+. I would expect a $300-500 handheld out of Sony for a \"PS5P\". Remember that they make INSANELY huge purchasing for consoles and get pretty much the best bulk pricing available.",
                              "score": 1,
                              "created_utc": 1732576772.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lyx86jx",
                  "author": "NobodyKnowsYourName2",
                  "body": "Ps5 pro pricing for a handheld? Not realistic. \n\nI am more than happy using a PS4 Controller with a 5$ Clamshell that holds my S23 to play mobile games. If I want to game AAA games I can book Geforce Now or just game a little via emulators. I get it that the steam deck is a nice device, but for my casual gaming this setup seems more than enough. To shell out 800$ for a mobile device is not going to attract a big enough market\n If I was Sony I would release a powerful phone / gaming combo that can run PS5 games with an attachable gamepad. I think the appeal of having a very powerful phone / gaming combination unit would be awesome. Same for Nintendo.",
                  "score": 0,
                  "created_utc": 1732550561.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lz51ipx",
          "author": "HeadFaithlessness548",
          "body": "I loved my Vita, but you can tell Sony didn’t really care too much about it when it came to marketing.",
          "score": 1,
          "created_utc": 1732655947.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lywhmm7",
      "author": "Hyperion1144",
      "body": "It won't be competing with much after Sony inevitably decides that it should cost more than a Steam Deck.",
      "score": 40,
      "created_utc": 1732541151.0,
      "replies": []
    },
    {
      "id": "lyxwkjc",
      "author": "Spiritual-Compote-18",
      "body": "The Switch 2 will have a big advantage being that it will be out early and if they manage to get some I.P like Horizon, Elder Scrolls and even Cyberpunk 2077 to play it will be a hit",
      "score": 8,
      "created_utc": 1732558078.0,
      "replies": [
        {
          "id": "lyyj7ov",
          "author": "None",
          "body": "Yeah but we like me I already have a huge library on my PlayStation making a handheld that works this way is basically a device that I already have games for \n\nAs long as you log in with your psn you should be able to download games you own.\n\nSo than who won’t buy such.\n\n\nThey are missing the point steamdeck was great because everyone already had games they own on the steam store.\n\nIt’s no brainer.  \n\nIt means I won’t have re buy anything. \n\nAnd I have most of my games are digital.\n\nI have a physical collection but ps5 games I don’t have any physical ps5 game yet.\n\nMost games I have on ps4 have a ps5 upgrade so I haven’t bought any ps5 game and most ps5 games disc base needs internet connection so it never made sense.\n\n\nThe new average consumer may have to pick.\n\nBut users who already have such would more likely  buy it first.",
          "score": 2,
          "created_utc": 1732565112.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lywbzxz",
      "author": "PopularStaff7146",
      "body": "After PS Vita’s failure, I personally don’t have much interest. I thought it was way ahead of its time and then Sony just abandoned it.",
      "score": 15,
      "created_utc": 1732538732.0,
      "replies": [
        {
          "id": "lywiw1d",
          "author": "None",
          "body": "It was an amazing game console. I played mine a lot. I liked using the touch screen and being able to tap on the back for certain games. It is too bad Sony killed. If they brought something like the ps vita out with a larger screen like the steam deck. I would definitely get it.",
          "score": 3,
          "created_utc": 1732541660.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyw8wbv",
      "author": "GamerRadar",
      "body": "Bring back the PSP!!!",
      "score": 14,
      "created_utc": 1732537252.0,
      "replies": [
        {
          "id": "lywfwy6",
          "author": "padeye242",
          "body": "As a delivery driver for Best Buy in 2012, my car was stolen from my front yard. In it, was my PSP. That same year, my store closed and a few display Vitas were discovered to be out of inventory. My boss had heard about my PSP being stolen with my car, and gifted me one of the extra Vitas ❤️",
          "score": 17,
          "created_utc": 1732540438.0,
          "replies": [
            {
              "id": "lywttbc",
              "author": "Jon_TWR",
              "body": "Your car was in your yard?",
              "score": 3,
              "created_utc": 1732545799.0,
              "replies": [
                {
                  "id": "lyza05m",
                  "author": "padeye242",
                  "body": "Yeah, my toddler son had gotten car sick, so I detailed it in the front yard (my driveway is gravel so I avoided the muddy mess).",
                  "score": 3,
                  "created_utc": 1732573384.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lywpq3q",
      "author": "Fredasa",
      "body": "Mmm yeah this isn't to compete with Nintendo.  It's Sony's PS6.  Been [predicting](https://www.reddit.com/r/Futurology/comments/1fm0ygi/nvidia_ceo_we_cant_do_computer_graphics_anymore/lo80i3t/) it for over a year.  Sony's answer to the new game started by Valve.  Still waiting on the other half of the equation: A Gamepass knockoff that will work on both this \"portable PS5\" and PCs.",
      "score": 6,
      "created_utc": 1732544302.0,
      "replies": []
    },
    {
      "id": "lyw67p0",
      "author": "MathematicianVivid1",
      "body": "Okay I’ll try it 4-5 years after release after scalpers lower their prices",
      "score": 25,
      "created_utc": 1732535887.0,
      "replies": [
        {
          "id": "lywoa3s",
          "author": "justin_memer",
          "body": "Scalpers aren't a thing anymore, check out how they lost money on the PS5 pro.",
          "score": -22,
          "created_utc": 1732543760.0,
          "replies": [
            {
              "id": "lywz8g2",
              "author": "martin519",
              "body": ">aren't a thing anymore, check out how they\n\nhmm",
              "score": 9,
              "created_utc": 1732547665.0,
              "replies": []
            },
            {
              "id": "lywpipf",
              "author": "timeshifter_",
              "body": "lol",
              "score": 12,
              "created_utc": 1732544226.0,
              "replies": []
            },
            {
              "id": "lyx7bzj",
              "author": "Cheezewiz239",
              "body": "The PS5 pro just doesn't have much demand. Scalpers haven't wetnt anywhere",
              "score": 4,
              "created_utc": 1732550292.0,
              "replies": []
            },
            {
              "id": "lyx14o8",
              "author": "LongBeakedSnipe",
              "body": "You could maybe see it as 'losing money' if you want to pat yourself on the back in ignorance.\n\nBut the reality is 'you have to speculate to accumulate'. If scalpers didn't go for the PS5 pro, they wouldn't go for anything, so they would be out of a job. \n\nYou win some, and you lose some. The very tiny amount they lost (if anything) scalping PS5 pros can be written off against their profits to lower their tax bills, and the reality is, those PS5 pros will sell, so they won't lose too much. \n\nThen when the next thing comes out, they will buy it en mass again, and soon enough the market for one of the things they buy will be fucked for normal consumers. Then they will make manifold more than they 'lost' from PS5 pros.",
              "score": 2,
              "created_utc": 1732548291.0,
              "replies": []
            },
            {
              "id": "lyzafd1",
              "author": "Simulation-Argument",
              "body": "lol WHAT?\n\nThat was only because there wasn't much interest in the console. It is a very unique situation. If ANY piece of tech releases with a bunch of interest, scalpers will be there. I can't believe you even just said this. Nintendo Switch 2 will likely be impossible to find for months unless Nintendo does amazingly well with stocking up before release.",
              "score": 2,
              "created_utc": 1732573522.0,
              "replies": []
            },
            {
              "id": "lyxcyip",
              "author": "Blueberrycake_",
              "body": "Are you for real?",
              "score": 1,
              "created_utc": 1732552073.0,
              "replies": []
            },
            {
              "id": "lz0wc88",
              "author": "rolfraikou",
              "body": "Oh, sweet summer child.",
              "score": 1,
              "created_utc": 1732594356.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lywrl0k",
      "author": "redlines4life",
      "body": "![gif](giphy|kc06qPieCwc4rZQ3Te|downsized)",
      "score": 6,
      "created_utc": 1732544988.0,
      "replies": []
    },
    {
      "id": "lywkvjj",
      "author": "kasimoto",
      "body": "im expecting it to be not a good deal at all, as mainly PC player with PS5 i keep being surprised how expensive the games on ps5 are, even the super big sales are usually worse than on PC, ive been using it mostly to play games included in ps extra sub, only advantage is being able to resell your physical games (and thats really nice) but surely theres no chance that will be an option with this new psp?",
      "score": 8,
      "created_utc": 1732542444.0,
      "replies": [
        {
          "id": "lywlvjm",
          "author": "jdev15",
          "body": "Are you digital only?  PS5 disc game prices seem to drop much faster (and there is the used market as well).",
          "score": 7,
          "created_utc": 1732542831.0,
          "replies": [
            {
              "id": "lywohnv",
              "author": "kasimoto",
              "body": "i have disc drive, bought stellar blade on release and resold it shortly after for similar price, that was cool but currently theres no other console exclusive that im interested in and overall i prefer to play AAA games on my pc(got a pretty good hardware)\n\n\nunfortunately the disc price drops dont seem to happen as much in my country, ive seen some US deals on reddit recently and yeah those were pretty attractive",
              "score": 1,
              "created_utc": 1732543840.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lz6ojax",
      "author": "madaking24",
      "body": "\"PS5 games\" all 6 of them?",
      "score": 4,
      "created_utc": 1732677035.0,
      "replies": []
    },
    {
      "id": "lywent0",
      "author": "padeye242",
      "body": "Hand held is the way to go, but their rival should be Valve, instead of Nintendo. My Steam Deck isn't just an amazing piece of hardware, but it has an enormous game catalog and can even serve as a mobile PC.",
      "score": 7,
      "created_utc": 1732539908.0,
      "replies": [
        {
          "id": "lyx51ep",
          "author": "BIGSTANKDICKDADDY",
          "body": "I don't think Sony's top rival is the company whose handheld is selling half as well as the original Vita did. The Steam Deck obsession on reddit borders on delusional.",
          "score": 6,
          "created_utc": 1732549562.0,
          "replies": [
            {
              "id": "lyyjwe0",
              "author": "None",
              "body": "Steamdeck is just pc. It’s not branded as handheld gaming console \n\nBut rather a pc handheld that can do gaming.\n\n\nSony doesn’t see them as a threat the more amd makes pc handheld the cheaper cost will be for Sony \n\nSo Sony would want more pc handhelds \n\nAs a huge buyer from AMD.\n\nMaking a handheld pc Sony has made all kinds of laptops and has expertise.\n\n\nIf the price is right they will make it.\n\nWhere steamdeck ppl aren’t even in the same class as them.\n\nBut that’s Reddit for you lol \n\nThe steamdeck is great for emulation and that I don’t see being replaced.",
              "score": 1,
              "created_utc": 1732565325.0,
              "replies": []
            },
            {
              "id": "lyzb08m",
              "author": "padeye242",
              "body": "Fair enough. Our switch has long since been retired, and hasn't been used in years. I was thinking to gift it to my friend's kids. I guess my opinion was observational, household doesn't regard the Switch at all.",
              "score": 1,
              "created_utc": 1732573710.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyxctau",
      "author": "mobrocket",
      "body": "Click bait \n\nBloomberg adds that Sony's handheld is still in development and likely years away from launch. The company might even abandon the plans before then.\n\n\nThey could have made the portal a real handheld and didn't. I doubt Sony will bring this to market and I'd be surprised if MSFT actually does as well",
      "score": 3,
      "created_utc": 1732552027.0,
      "replies": []
    },
    {
      "id": "lyw2dt3",
      "author": "N0x1mus",
      "body": "Wasn’t this info already released as being the PlayStation Portal not requiring an active remote connection to play? That it would be able to stream play games without a local copy installed.",
      "score": 9,
      "created_utc": 1732533735.0,
      "replies": [
        {
          "id": "lywzrl3",
          "author": "OneSeaworthiness7768",
          "body": "No, this appears to be separate and is referencing a device that would run games locally rather than streaming. What you’re talking about is still streaming, just from cloud instead of from your physical PS5.",
          "score": 6,
          "created_utc": 1732547842.0,
          "replies": []
        },
        {
          "id": "lywc33p",
          "author": "sometipsygnostalgic",
          "body": "No. the playstation portal is just a cheapnasty low power tablet, it can't be co-opted into a handheld. Whatever this is, it'll look completely different from the portal.",
          "score": 6,
          "created_utc": 1732538773.0,
          "replies": [
            {
              "id": "lywc9j2",
              "author": "N0x1mus",
              "body": "It’s already a streaming handheld though. Instead of connecting to the local PS5, why couldn’t it connect to the remote servers? That’s all software.",
              "score": 1,
              "created_utc": 1732538853.0,
              "replies": [
                {
                  "id": "lywdk3r",
                  "author": "orangpelupa",
                  "body": "but it can. try it yourself",
                  "score": 2,
                  "created_utc": 1732539428.0,
                  "replies": [
                    {
                      "id": "lyx2nwp",
                      "author": "N0x1mus",
                      "body": "Only by first connecting to the PS5 though right?",
                      "score": 1,
                      "created_utc": 1732548794.0,
                      "replies": [
                        {
                          "id": "lyxfaj7",
                          "author": "Dino_Rabbit",
                          "body": "Yes, you need to remote play from a PS5 on the Portal. Idk why the other guy just wants to keep giving you the workaround the answer.",
                          "score": 1,
                          "created_utc": 1732552801.0,
                          "replies": [
                            {
                              "id": "lyxfz6z",
                              "author": "N0x1mus",
                              "body": "That’s Reddit for ya 😂",
                              "score": 1,
                              "created_utc": 1732553010.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lyzy5sp",
                          "author": "orangpelupa",
                          "body": "No, you can play ps cloud games on PS portal\n\n\nU/Dino_Rabbit was spreading misinformation \n\n\nOpen this page and scroll down to how to access cloud streaming beta \n\n\nhttps://blog.playstation.com/2024/11/19/the-playstation-portal-remote-player-experience-to-evolve-with-new-system-update/",
                          "score": 1,
                          "created_utc": 1732581762.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lywhavi",
                  "author": "sometipsygnostalgic",
                  "body": "Then it still cant play games offline, on a plane or in a car, so whats the difference",
                  "score": 1,
                  "created_utc": 1732541018.0,
                  "replies": []
                },
                {
                  "id": "lyweayd",
                  "author": "squibbysnacks",
                  "body": "Tit still requires an active internet connection that’s high speed so it can’t be used for road trips or whatevr",
                  "score": 1,
                  "created_utc": 1732539752.0,
                  "replies": [
                    {
                      "id": "lyx2w0l",
                      "author": "N0x1mus",
                      "body": "No absolutely, although, I’ve tested it on 5G/5G+ and it worked. It also worked in a hotel as long as they’re not limiting bandwidth.",
                      "score": 2,
                      "created_utc": 1732548868.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lyxat7p",
          "author": "umbananas",
          "body": "the portal is like Wii U. This is more like Switch.",
          "score": 1,
          "created_utc": 1732551397.0,
          "replies": [
            {
              "id": "lyy80jf",
              "author": "N0x1mus",
              "body": "I know the difference. I just remember seeing an article last week that was leaking what I was asking about.",
              "score": 1,
              "created_utc": 1732561617.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyw4fu4",
      "author": "Tribolonutus",
      "body": "Just make it the way that it will handle all those games for more than 3 hours.",
      "score": 4,
      "created_utc": 1732534926.0,
      "replies": []
    },
    {
      "id": "lywihuh",
      "author": "Busy_Echo9200",
      "body": "Not requiring a PS5 to play right sony? You did that twice already.",
      "score": 2,
      "created_utc": 1732541502.0,
      "replies": []
    },
    {
      "id": "lyxdobj",
      "author": "SuperDinks",
      "body": "Whoa, all 6 of them?!?",
      "score": 2,
      "created_utc": 1732552297.0,
      "replies": []
    },
    {
      "id": "lyynn1i",
      "author": "Paulrus55",
      "body": "The psp is like the Dreamcast or Zune for me. It’s time was brief but it excelled against all the competitors at the time",
      "score": 2,
      "created_utc": 1732566480.0,
      "replies": []
    },
    {
      "id": "lyyrd1o",
      "author": "twixter8327",
      "body": "Why would I want a handheld that requires internet when I play games",
      "score": 2,
      "created_utc": 1732567619.0,
      "replies": []
    },
    {
      "id": "lz1v9js",
      "author": "Kichard",
      "body": "I want this so bad :(",
      "score": 2,
      "created_utc": 1732614073.0,
      "replies": []
    },
    {
      "id": "lywthye",
      "author": "engaging_psyco",
      "body": "They really need to focus on making a controller that won’t develop stick drift in 2 weeks.",
      "score": 4,
      "created_utc": 1732545686.0,
      "replies": []
    },
    {
      "id": "lyw6ox2",
      "author": "None",
      "body": "It sounds beautiful, as an idea. Executed, I just hope they don’t price it insane.",
      "score": 1,
      "created_utc": 1732536137.0,
      "replies": []
    },
    {
      "id": "lyw8if0",
      "author": "None",
      "body": "PSPX",
      "score": 1,
      "created_utc": 1732537061.0,
      "replies": []
    },
    {
      "id": "lywrfed",
      "author": "Suedie",
      "body": "Sounds really cool. PS5 games on a handheld would be very impressive, and I assume that would be mean backwards compatibility with PS4 games too. I doubt Sony would include it but if it's powerful enough to run PS5 games then I imagine it would be powerful enough to emulate PS3. If it gets jailbroken then it would be really cool to see PSX, PS2, PSP and PS3 emulators on it to get the ultimate handheld Sony device.",
      "score": 1,
      "created_utc": 1732544932.0,
      "replies": []
    },
    {
      "id": "lywrjdh",
      "author": "Kennayz",
      "body": "Awesome ! I'm guessing they'll do the same tactic of having proprietary memory cards that cost about half the price of the device itself, put no effort into it after the release, and then abandon it almost instantly?",
      "score": 1,
      "created_utc": 1732544971.0,
      "replies": []
    },
    {
      "id": "lywzalv",
      "author": "Elastichedgehog",
      "body": "Would they be competing though? Nintendo succeeds on its (relatively) low cost model and IP.",
      "score": 1,
      "created_utc": 1732547685.0,
      "replies": []
    },
    {
      "id": "lyx1pru",
      "author": "OgreTrax71",
      "body": "Some competition may force Nintendo to update the switch faster 😂",
      "score": 1,
      "created_utc": 1732548482.0,
      "replies": []
    },
    {
      "id": "lyx24lz",
      "author": "CrapDepot",
      "body": "AMD Hardware? What you guys think?",
      "score": 1,
      "created_utc": 1732548616.0,
      "replies": []
    },
    {
      "id": "lyx2gnz",
      "author": "FarhadTowfiq",
      "body": "Excited to see sony exploring handheld gaming again! If they can deliver ps5-quality games on the go, it could be a serious game-changer. Hope it’s more versatile than just remote play though, fingers crossed for something standalone like the steam deck.",
      "score": 1,
      "created_utc": 1732548727.0,
      "replies": []
    },
    {
      "id": "lyx6q0d",
      "author": "LupusDeusMagnus",
      "body": "As someone with a PS5 I turn on twice a year, I’d rather it was mobile. Instead, Sony will probably cook up an overpriced Steam Deck knock-off with a closed ecosystem and shitty priced games, with awful support . I’d rather import a hypothetical new iteration of the Deck.",
      "score": 1,
      "created_utc": 1732550100.0,
      "replies": []
    },
    {
      "id": "lyx7wgd",
      "author": "None",
      "body": "Sony exclusive franchise and studio are not strong enough to support a portable. And their skill as game dev is going down in the last 10 year. All they can do is simple game for teenager or movie lover as we can easily see in game like TLOU, GoW or Horizon",
      "score": 1,
      "created_utc": 1732550472.0,
      "replies": [
        {
          "id": "lyxmau3",
          "author": "dopeman311",
          "body": "Okay and what about Returnal and Astro Bot?",
          "score": 1,
          "created_utc": 1732554956.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyxc2cl",
      "author": "neyha97",
      "body": "Sooooo the PSP? Got it. \n\nIdk how I feel about the idea of gaming over WiFi. My biggest complaint about my switch is that I can’t play most of my games away from home unless I have a physical copy. I know it’s outdated, but I’d rather go back to the days of having physical cartridges that I can bring along with me; they were always more reliable.",
      "score": 1,
      "created_utc": 1732551792.0,
      "replies": []
    },
    {
      "id": "lyxh2vk",
      "author": "kid_sleepy",
      "body": "I mean it’s clearly trying to compete with both.",
      "score": 1,
      "created_utc": 1732553350.0,
      "replies": []
    },
    {
      "id": "lyxrb9h",
      "author": "darkbreak",
      "body": "If this is real I will be getting it. I wanted a PlayStation Portal but streaming only was a deal breaker for me. I understand that the Portal has better streaming than just using your phone or something but that still wasn't good enough for me. If this new device can download PS5 games (and hopefully anything else your PS5 can play) it might be a day one buy for me.",
      "score": 1,
      "created_utc": 1732556484.0,
      "replies": []
    },
    {
      "id": "lyxs523",
      "author": "Ornery-Addendum5031",
      "body": "Not unless it uses an apple chip no shot",
      "score": 1,
      "created_utc": 1732556733.0,
      "replies": []
    },
    {
      "id": "lyxu3zd",
      "author": "AskRedditor8080",
      "body": "How will this differ from the ps portable out at the moment ?",
      "score": 1,
      "created_utc": 1732557328.0,
      "replies": []
    },
    {
      "id": "lyxyz8g",
      "author": "cancercureall",
      "body": "Imagine if these companies just started selling phone compatible controllers and games for phones.\n\nWe already carry around computers that can run your back catalog. jfc.",
      "score": 1,
      "created_utc": 1732558826.0,
      "replies": []
    },
    {
      "id": "lyy0b5k",
      "author": "TheJasonaut",
      "body": "Over-extrapolation and pre-judgment about a potential* device years away is the gaming community’s favorite pastime.      \n\nWhy yes, I DO have strong opinions about vague hypothetical! I ABSOLUTELY will add my own details to idea of product and give you my unfounded final verdict 😆",
      "score": 1,
      "created_utc": 1732559237.0,
      "replies": []
    },
    {
      "id": "lyy6f4z",
      "author": "cwbyangl9",
      "body": "Hopefully better supported than the Vita.",
      "score": 1,
      "created_utc": 1732561121.0,
      "replies": []
    },
    {
      "id": "lyy87in",
      "author": "themangastand",
      "body": "Isn't that the steam deck already lol",
      "score": 1,
      "created_utc": 1732561676.0,
      "replies": []
    },
    {
      "id": "lyy9wph",
      "author": "cosplay-degenerate",
      "body": "I'm not buying a Sony product until they back off of the kadokawa purchase.",
      "score": 1,
      "created_utc": 1732562217.0,
      "replies": []
    },
    {
      "id": "lyyaczm",
      "author": "None",
      "body": "They need to ensure the controllers are removable. I can see stick drift being a MAJOR issue.",
      "score": 1,
      "created_utc": 1732562368.0,
      "replies": []
    },
    {
      "id": "lyybdge",
      "author": "EnolaGayFallout",
      "body": "Who needs another the last of us part 1 handheld edition.",
      "score": 1,
      "created_utc": 1732562689.0,
      "replies": []
    },
    {
      "id": "lyycqlb",
      "author": "Astronut325",
      "body": "It needs to play every PS5 without the devs needing to do anything. Else it’s a new platform and Sony is terrible at supporting multiple platforms.",
      "score": 1,
      "created_utc": 1732563106.0,
      "replies": []
    },
    {
      "id": "lyykm2i",
      "author": "korewednesday",
      "body": "I hope they name it the PS vIIta",
      "score": 1,
      "created_utc": 1732565545.0,
      "replies": []
    },
    {
      "id": "lyyov11",
      "author": "TheWayOfEli",
      "body": "I'm into this. I know everyone says \"Just get a ROG Ally or Steam Deck - PS5 exclusives are coming to PC!\" but my library is built on PlayStation, and I don't plan to migrate to PC, so this would be of great interest and value to me personally.\n\nI always thought it was kind of weird they lead with the Portal instead of a device that could play games locally installed on its SSD ***AND OR*** stream from your PS5. I know the Portal was selling pretty well, but I think a lot of players still want to play games that are installed on the device itself and I'm glad both Microsoft and Sony are pursuing this.",
      "score": 1,
      "created_utc": 1732566855.0,
      "replies": []
    },
    {
      "id": "lyz28m2",
      "author": "SGKurisu",
      "body": "Unless they commit to it like the PSP, I don't think this will matter. Their half baked portables have all been bad and or a commercial failure",
      "score": 1,
      "created_utc": 1732570942.0,
      "replies": []
    },
    {
      "id": "lyz3efg",
      "author": "DJ2Gunz",
      "body": "Get an ally instead.",
      "score": 1,
      "created_utc": 1732571296.0,
      "replies": []
    },
    {
      "id": "lyz7kew",
      "author": "Oil_slick941611",
      "body": "I’ll never trust Sony with another handheld. They don’t support them with games  and give up on them too early",
      "score": 1,
      "created_utc": 1732572595.0,
      "replies": []
    },
    {
      "id": "lyzbzcg",
      "author": "UnsolicitedNeighbor",
      "body": "Get WoW on PS5 and they win",
      "score": 1,
      "created_utc": 1732574030.0,
      "replies": []
    },
    {
      "id": "lyzlsyk",
      "author": "HardHJ",
      "body": "Fuck Sony and their shitty practices of limited edition items that are almost impossible to get that leads to assholes selling for 5x the price.",
      "score": 1,
      "created_utc": 1732577377.0,
      "replies": []
    },
    {
      "id": "lyzyren",
      "author": "Blooblack",
      "body": "Who knows when it's even going to be on the market? Next year? The year after?",
      "score": 1,
      "created_utc": 1732581974.0,
      "replies": []
    },
    {
      "id": "lz03042",
      "author": "iBody",
      "body": "Fool me once.",
      "score": 1,
      "created_utc": 1732583491.0,
      "replies": []
    },
    {
      "id": "lz07lmn",
      "author": "triadwarfare",
      "body": "Get an x86 handheld to play PS4 games and you got yourself a winner. \n\nThough, Sony should also fix their restrictive online service first and make them available in more countries.",
      "score": 1,
      "created_utc": 1732585115.0,
      "replies": []
    },
    {
      "id": "lz0lmss",
      "author": "WeDieYoung__",
      "body": "it’s gonna somehow outperform the switch 2 in game performance i bet you",
      "score": 1,
      "created_utc": 1732590149.0,
      "replies": []
    },
    {
      "id": "lz0z68d",
      "author": "Ruttagger",
      "body": "This is what I thought the Portal was going to be.\n\nI remember when the Portal launched and I realized what it was and thought \"wtf, this is completely useless to me\".",
      "score": 1,
      "created_utc": 1732595571.0,
      "replies": []
    },
    {
      "id": "lz10vnd",
      "author": "Drmo6",
      "body": "I’ll bet anyone it’ll be neglected like the vita and get demolished by switch 2",
      "score": 1,
      "created_utc": 1732596347.0,
      "replies": []
    },
    {
      "id": "lz15arw",
      "author": "encreturquoise",
      "body": "They won’t have Nintendo IP so they’re not really competing",
      "score": 1,
      "created_utc": 1732598452.0,
      "replies": []
    },
    {
      "id": "lz18ygs",
      "author": "Darksol503",
      "body": "lol…\n\nDid they not remember the PSP or Vita. They botched handhelds like it’s nobody’s business lol",
      "score": 1,
      "created_utc": 1732600292.0,
      "replies": [
        {
          "id": "lz2o0u3",
          "author": "Raknirok",
          "body": "What are you on about those were both great and pioneers",
          "score": 0,
          "created_utc": 1732628993.0,
          "replies": [
            {
              "id": "lz3usr4",
              "author": "Darksol503",
              "body": "They were critically and financially failures… do you see a current PlayStation handheld, since 2019?? lol.",
              "score": 1,
              "created_utc": 1732642901.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lz1f112",
      "author": "PrincessKirstyn",
      "body": "I would be down. When the portal was announced I originally thought it was a waste and like why would you want it? But having a baby now, and more than one console the portal makes it a lot easier for my husband and I both to enjoy games. So idk, worth I guess. \n\nWhat wasn’t worth is the steam link we have because it barely functions. But that’s what we get for buying one when they were discontinuing it.",
      "score": 1,
      "created_utc": 1732603637.0,
      "replies": []
    },
    {
      "id": "lz1id5g",
      "author": "Q__________________O",
      "body": "Smells like a digital only device...\n\nIm gonna pass. I only buy physical console games.",
      "score": 1,
      "created_utc": 1732605573.0,
      "replies": []
    },
    {
      "id": "lz1j98c",
      "author": "Kaizen2468",
      "body": "Isn’t that the portal lol",
      "score": 1,
      "created_utc": 1732606125.0,
      "replies": []
    },
    {
      "id": "lz1ksrb",
      "author": "Tepigg4444",
      "body": "If this thing plays genshin impact I am buying it, I’ve spent too long waiting for it to come to the switch",
      "score": 1,
      "created_utc": 1732607092.0,
      "replies": []
    },
    {
      "id": "lz1oseo",
      "author": "rugby065",
      "body": "A handheld PS5 could be a game changer. I wonder if it'll be as powerful as the console version. Can't wait to see what Sony has in store",
      "score": 1,
      "created_utc": 1732609676.0,
      "replies": []
    },
    {
      "id": "lz1vhmq",
      "author": "dzone25",
      "body": "Competition is rarely a negative. I know Reddit is filled with people who'd just buy a Steamdeck instead (as would I) but it's not a bad thing if all these brands compete for our money. Customers win in this scenario.",
      "score": 1,
      "created_utc": 1732614226.0,
      "replies": []
    },
    {
      "id": "lz27bjm",
      "author": "MetaVaporeon",
      "body": "dont hold your breath though, they'll once again try to undercut the nintendo price and overcut it by selling you 500gb storage for 200 bucks",
      "score": 1,
      "created_utc": 1732621568.0,
      "replies": []
    },
    {
      "id": "lz29d0c",
      "author": "ElonZuckerburgBezzos",
      "body": "Should have done it with the PS4",
      "score": 1,
      "created_utc": 1732622637.0,
      "replies": []
    },
    {
      "id": "lz2bv22",
      "author": "SmokesLetsGoBois",
      "body": "As someone who bought a steam deck I can honestly say mobile gaming is not worth it if game developers don't want to support it. Online only content ruins the experience and makes gaming impossible without an Internet connection. \n\nI haven't touched my steam deck in months and my job allows me a lot of free time to play games at work. I can count on my hand the number of times I actually managed to pick up a game and play it without issues while at work with no reliable connection.",
      "score": 1,
      "created_utc": 1732623871.0,
      "replies": []
    },
    {
      "id": "lz4r6ja",
      "author": "None",
      "body": "Fingers crossed.",
      "score": 1,
      "created_utc": 1732652775.0,
      "replies": []
    },
    {
      "id": "lz660yc",
      "author": "Sir_Lanian",
      "body": "So according to the headline its not competing with Steam Deck? Gottya.",
      "score": 1,
      "created_utc": 1732670008.0,
      "replies": []
    },
    {
      "id": "lz68m1s",
      "author": "JitteryBendal",
      "body": "Listen, if I can play my PS catalog on the go without needing to do a streaming thing like the portal, I’m SO HAPPY. It’s all I’ve wanted since I saw the switch was a thing.",
      "score": 1,
      "created_utc": 1732670980.0,
      "replies": []
    },
    {
      "id": "lz6d97l",
      "author": "Jingtseng",
      "body": "Sony announces it has already discontinued support for the handheld under development.",
      "score": 1,
      "created_utc": 1732672719.0,
      "replies": []
    },
    {
      "id": "lz7cg5q",
      "author": "Xanadel",
      "body": "By chance, will this be like a nut? Maybe even one I can play with outside?",
      "score": 1,
      "created_utc": 1732687842.0,
      "replies": []
    },
    {
      "id": "lzpoq64",
      "author": "bpronjon",
      "body": "Garbage company that SOE, buyer beware",
      "score": 1,
      "created_utc": 1732975420.0,
      "replies": []
    },
    {
      "id": "lyx0dc2",
      "author": "angelkrusher",
      "body": "Good luck with that legendary Sony support 😃😃😃🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄",
      "score": 1,
      "created_utc": 1732548041.0,
      "replies": []
    },
    {
      "id": "lywpdws",
      "author": "n1teraven",
      "body": "Hopefully this brings back better options for the handheld market",
      "score": 1,
      "created_utc": 1732544176.0,
      "replies": []
    },
    {
      "id": "lywlrrv",
      "author": "None",
      "body": "[deleted]",
      "score": 0,
      "created_utc": 1732542790.0,
      "replies": [
        {
          "id": "lywmrm3",
          "author": "lo0OO0ol",
          "body": "Where are you located that you can’t find a PS5?",
          "score": 3,
          "created_utc": 1732543175.0,
          "replies": [
            {
              "id": "lywnzqh",
              "author": "balllsssssszzszz",
              "body": "It's not that I can't find them\n\nI simply can't afford them",
              "score": 4,
              "created_utc": 1732543648.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lywph9q",
      "author": "None",
      "body": "Does this mean they’ll nuke remote play?",
      "score": 0,
      "created_utc": 1732544210.0,
      "replies": [
        {
          "id": "lyx0k95",
          "author": "Recipe-Jaded",
          "body": "nah, chances are it will rely on remote play\n\neven if it doesn't, there's already a great use case for a handheld that has the ability to use remote play, the steam deck",
          "score": 5,
          "created_utc": 1732548105.0,
          "replies": []
        },
        {
          "id": "lyx7xxv",
          "author": "Cheezewiz239",
          "body": "Nope if the steam deck is anything to go by",
          "score": 1,
          "created_utc": 1732550485.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyy0rwi",
      "author": "poopymcfarts",
      "body": "after the vita, I have no faith in them.",
      "score": 0,
      "created_utc": 1732559380.0,
      "replies": []
    },
    {
      "id": "lz3q77w",
      "author": "Debating24-7",
      "body": "what about the steam deck? I think i prefer a pc over a playstation..",
      "score": 0,
      "created_utc": 1732641508.0,
      "replies": []
    },
    {
      "id": "lywaqsf",
      "author": "ASilver76",
      "body": "And following Nintendo's naming convention for the Wii, this system will be known as the Syit.",
      "score": -3,
      "created_utc": 1732538148.0,
      "replies": []
    },
    {
      "id": "lyw40jf",
      "author": "Atilim87",
      "body": "If this product in its early development and will run ps5 games then honestly that’s not good enough. \n\nBy the time this launches ps6 will probably be on the horizon or available and those games need to be available in any future handheld.",
      "score": -13,
      "created_utc": 1732534685.0,
      "replies": [
        {
          "id": "lywbaca",
          "author": "Teshuko",
          "body": "Does it really matter? The steam deck exists and runs games perfectly fine. The switch is 8 years and still kicking. Calling the ps4 ‘old gen’ felt strange for a long ass time into the ps5’s lifespan. And most of the graphical advancements are getting more and more subtle, so there could be corners to cut without affecting the product too much if it can’t run games well.",
          "score": 5,
          "created_utc": 1732538405.0,
          "replies": []
        },
        {
          "id": "lywccal",
          "author": "eist5579",
          "body": "Seeing as the majority of games I’ve been playing on my ps5 are actually ps4 games, I think they could release it at the spec of ps5 and we’d be fine through the ps6 era.  \n\nLook at the steam deck, they get away with a bit more because they lower the resolution for the smaller screen.  So at ps5 power, it could probably irk out a bit more performance w lower quality settings and all.",
          "score": 2,
          "created_utc": 1732538887.0,
          "replies": [
            {
              "id": "lywf6z1",
              "author": "Atilim87",
              "body": "Dude that’s on you, don’t think you represents anybody but yourself. \n\nBecause if everyone was doing what you did then we would have gotten a lot of closed studios because non of the games of the last 2-3 years would have sold enough.",
              "score": -5,
              "created_utc": 1732540136.0,
              "replies": [
                {
                  "id": "lywiufw",
                  "author": "eist5579",
                  "body": "I think you may have misinterpreted what I’m saying.  Point is, as many have complained, the ps5 exclusive library is pretty slim.",
                  "score": 2,
                  "created_utc": 1732541643.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lywl5yo",
          "author": "Edmundyoulittle",
          "body": "You expect a handheld device to be equal power to the console of the same generation? Ridiculous",
          "score": 2,
          "created_utc": 1732542555.0,
          "replies": []
        },
        {
          "id": "lyw9tvu",
          "author": "Snipedzoi",
          "body": "This is appropriate. Handhelds with good battery life need to be weak to maintain battery life, so PS5 power is still a gen ahead over what the switch 2 will be.",
          "score": -1,
          "created_utc": 1732537708.0,
          "replies": [
            {
              "id": "lywa0mv",
              "author": "Atilim87",
              "body": "You don’t need a same day release. What you do need is new games and that will dry up in a 2-3 years unless your only playing cod and fifa.",
              "score": -2,
              "created_utc": 1732537799.0,
              "replies": [
                {
                  "id": "lywbwa9",
                  "author": "Snipedzoi",
                  "body": "When was same day release mentioned?",
                  "score": 1,
                  "created_utc": 1732538685.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}