{
  "post": {
    "title": "Sony's 61MP RX1R III fixed-lens compact camera is finally here after a ten-year wait",
    "author": "Doug24",
    "id": "1m0trk3",
    "score": 505,
    "created_utc": 1752613448.0,
    "selftext": "",
    "num_comments": 65,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1m0trk3/sonys_61mp_rx1r_iii_fixedlens_compact_camera_is/"
  },
  "comments": [
    {
      "id": "n3bzrtr",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752613450.0,
      "replies": []
    },
    {
      "id": "n3cfz7z",
      "author": "devilscr",
      "body": "So it is more expensive than the cheapest medium format camera today? Wild.",
      "score": 115,
      "created_utc": 1752618478.0,
      "replies": [
        {
          "id": "n3ebodc",
          "author": "ICC-u",
          "body": "It seems completely overpriced. How can it cost more than a superior A7R.",
          "score": 35,
          "created_utc": 1752643934.0,
          "replies": [
            {
              "id": "n3enm13",
              "author": "hosky2111",
              "body": "It also isn't really competing with either of the current R cameras - this weighs 498g, the a7cr weighs 515g, and the a7r v weighs 723g, and for the latter two, you still need to add on a lens. Even compared to the smaller and lights a7cr, that is going to weigh likely 300 grams more and be much larger by the time you add an equivalent lens. \n\nThis is a lifestyle camera, I don't imagine any professionals would pick this over an interchangeable lens alternative, so value is less important than desirability. This is competing in a much smaller market, with consumers willing to spend a lot of money on luxury products to get the best - only really the similarly priced gfx100rf, and the leica q3 which costs almost $7k compete directly, and this looks to be pretty competitive with both on paper. There is also a lot of brand loyalty in the segment, so Sony probably knows they can charge whatever without losing customers - ironically even without considering a \"lens ecosystem\".\n\nThere are definitely major compromises to get it to the size and weight, no ibis and fixed screen are a miss, and a ~2mp evf is criminal in 2025, but given the cult status the prior gen had, I think this will have fans among the very small market segment it's targeting.",
              "score": 20,
              "created_utc": 1752650301.0,
              "replies": [
                {
                  "id": "n3fxbym",
                  "author": "dekachenko",
                  "body": "Yeah, if anything it’s a sunday camera for the professionals who use the Sony system.\n\nIf number on paper was the only thing that determines the value of the camera, this might be a hard sell. But there are many who would find this an ideal camera.\n\nI won’t be getting it myself(I personally dont mesh well with Sony’s doctrine) but I appreciate that they are making this kind of niche camera.",
                  "score": 4,
                  "created_utc": 1752671987.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n3i2vj9",
              "author": "phd24",
              "body": "Cost ≠ price. The price is what they think “the market” will pay. Maybe they’re right, maybe they’re wrong…",
              "score": 3,
              "created_utc": 1752695205.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3ca4dg",
      "author": "None",
      "body": "[deleted]",
      "score": 57,
      "created_utc": 1752616521.0,
      "replies": [
        {
          "id": "n3cld7f",
          "author": "Seenmeb4today",
          "body": "![gif](giphy|vQqs6qcHCTYIw)\n\nThe only thing I think of when I see Leica.",
          "score": 43,
          "created_utc": 1752620238.0,
          "replies": [
            {
              "id": "n3dwz7h",
              "author": "StanielReddit",
              "body": "What’s this from? I’ve seen it before but am drawing a blank.",
              "score": 4,
              "created_utc": 1752637063.0,
              "replies": [
                {
                  "id": "n3dxuxl",
                  "author": "Gobsalot",
                  "body": "Eurotrip",
                  "score": 8,
                  "created_utc": 1752637411.0,
                  "replies": []
                },
                {
                  "id": "n3ea30k",
                  "author": "fane1967",
                  "body": "Scusi…",
                  "score": 6,
                  "created_utc": 1752643125.0,
                  "replies": [
                    {
                      "id": "n3krxa0",
                      "author": "criticalt3",
                      "body": "Mi 'scusi, mi 'scusi",
                      "score": 3,
                      "created_utc": 1752727907.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n3cp84m",
          "author": "waloz1212",
          "body": "The Q3 has much more rugged body and weather seal, not to mention tilt screen and much bigger battery. It has advantages of being smaller and lighter than the Q3, but then if portability is the focus then I would rather go for the X100VI, which is much more pocketable due to the lens not being as big, not to mention also weather seal (with filter) and tilt screen. It does have the biggest advantage of having Sony AF, but asking for Leica level price with Sony branding and with much less features is still lmao.",
          "score": 19,
          "created_utc": 1752621504.0,
          "replies": [
            {
              "id": "n3g3rwk",
              "author": "hiraeth555",
              "body": "It's also not as good looking as the Leica or Fuji offerings (which, let's be honest, is part of their appeal).\n\n\nI suppose it straddles the two, being full frame. \n\n\nI think they should have gone for a more compact lens though.",
              "score": 3,
              "created_utc": 1752674038.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3cdh3t",
          "author": "f8Negative",
          "body": "And Fuji x100 series",
          "score": 5,
          "created_utc": 1752617581.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3dqvf5",
      "author": "Found_My_Ball",
      "body": "Sony has lost their mind with that price… I could get into a GFX system for that.",
      "score": 6,
      "created_utc": 1752634678.0,
      "replies": []
    },
    {
      "id": "n3c4mp3",
      "author": "CGI_OCD",
      "body": "But it won't have the same depth compression as an actual 50/70mm lens.\n\nWhen will people get it and don't fall for this. \n\nI still think it's quite stylish and minimal and i love that tho, but $5100 Bucks for FF....thats pretty bold innit?\n\nEdit: $300 (!) thumb grip..wtaf SONY. You good?",
      "score": 97,
      "created_utc": 1752614872.0,
      "replies": [
        {
          "id": "n3chzel",
          "author": "ChucklesInDarwinism",
          "body": "They want to be Leica",
          "score": 48,
          "created_utc": 1752619136.0,
          "replies": [
            {
              "id": "n3ec0jh",
              "author": "neurobotic242",
              "body": "well they ain’t.",
              "score": 9,
              "created_utc": 1752644108.0,
              "replies": []
            },
            {
              "id": "n3cmnag",
              "author": "CGI_OCD",
              "body": "100%",
              "score": 5,
              "created_utc": 1752620661.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n3djicj",
          "author": "ozzilee",
          "body": "No, cropping and zooming are exactly the same, other than resolution. You can try it yourself, and I encourage you to.\n\n“Depth compression” isn’t a real thing. Distance to subject is the only thing that matters.\n\nTaken from the same location, a 50mm f2.8 shot will look exactly the same as a 25mm f2.8 shot cropped 2x.",
          "score": 67,
          "created_utc": 1752631964.0,
          "replies": [
            {
              "id": "n3fg0m7",
              "author": "merelysounds",
              "body": "Correct about no change to composition. Note that using actual lenses with these parameters would result in different out of focus areas, at least as reported by https://dofsimulator.net/en/ .\n\n- For a 25mm f2.8 FF lens at 100cm distance the reported diffusion circle is 0.229mm.\n\n- For a 50mm f2.8 FF lens at 100cm distance the reported diffusion circle is 0.94mm.",
              "score": 8,
              "created_utc": 1752665621.0,
              "replies": [
                {
                  "id": "n3fmoiw",
                  "author": "ozzilee",
                  "body": "I’d have to try it on real lenses again, but I think when you crop and then scale the images to the same physical size, the out of focus areas end up looking the same.\n\nI played around with that calculator and didn’t actually see a way to crop. You can change the sensor size, but that doesn’t quite work because aperture on a lens is relative to the size of the image area.\n\nEdit: I’m wrong, cropping gives you less background blur than zooming at the same aperture.",
                  "score": 3,
                  "created_utc": 1752668269.0,
                  "replies": [
                    {
                      "id": "n3g7hxi",
                      "author": "merelysounds",
                      "body": "> I played around with that calculator and didn’t actually see a way to crop\n\nYou can take a screenshot and crop that - that’s equivalent to what the [earlier comment](https://old.reddit.com/r/gadgets/comments/1m0trk3/sonys_61mp_rx1r_iii_fixedlens_compact_camera_is/n3djicj/) describes and what the newly announced camera does.",
                      "score": 2,
                      "created_utc": 1752675171.0,
                      "replies": [
                        {
                          "id": "n3gkc72",
                          "author": "ozzilee",
                          "body": "Ah true. Yeah you’re right then, the background blur is different. I guess that makes sense, since aperture is also relative to focal length… the same physical aperture size would probably create the same blur regardless of focal length, but f2.8 on a 80mm is significantly larger than f2.8 on a 40mm.",
                          "score": 2,
                          "created_utc": 1752678810.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n3dma70",
              "author": "The_Potato_Monster",
              "body": "This needs to be higher. 100% correct.",
              "score": 10,
              "created_utc": 1752632969.0,
              "replies": []
            },
            {
              "id": "n3e7brb",
              "author": "KowalskiePCH",
              "body": "It will not. I don’t know what people are chiming in to say but I have a range of focal lengths and cropping does not yield the same results as using a different focal length.",
              "score": 0,
              "created_utc": 1752641704.0,
              "replies": [
                {
                  "id": "n3ecaey",
                  "author": "ICC-u",
                  "body": "Cropping does yield exactly the same result as focal length, minus a little bit of leeway for distortion caused by different lenses/zooms.\n\nStand in one spot. Photograph an object of a fixed size/distance. A telephone box, post box, park bench etc. Take two photographs from the same spot at two different focal lengths. Overlay the two images and crop them, you will have almost exactly the same image.\n\nThe opposite is to then take the same object, and move with the camera so it is the same size in the viewfinder with both lenses. This time you will see that a wide angle includes more background extremity and everything is more bulbous. The telephoto will mean you stand further away and everything gets compressed - this is where the compression term comes from.\n\nDid an evening class in photography and this was like the second assignment on the first day after we did shutter/aperture/iso.",
                  "score": 24,
                  "created_utc": 1752644248.0,
                  "replies": []
                },
                {
                  "id": "n3eoh0r",
                  "author": "wantsoutofthefog",
                  "body": "It’s physics and it does though",
                  "score": 11,
                  "created_utc": 1752650786.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3d4q9s",
          "author": "Drolevarg",
          "body": "Cropping to a 50/70mm equivalent does have the same background framing (I assume that's what you mean by depth compression). The only difference (except resolution of course) is that the depth of field is deeper by cropping.\n\nhttps://www.diyphotography.net/zooming-lens-feet-changes-relationship-foreground-background/\n\nYou can try it yourself. The background will be framed identically, except for the bokeh which will be less blurry, with smaller specular highlights.",
          "score": 17,
          "created_utc": 1752626788.0,
          "replies": [
            {
              "id": "n3drtjy",
              "author": "illiteratebeef",
              "body": "Here's another source that tested this and says the same thing, background compression is the same on optical or digital zoom.\n\nhttps://fstoppers.com/architecture/how-lens-compression-and-perspective-distortion-work-251737",
              "score": 7,
              "created_utc": 1752635042.0,
              "replies": []
            },
            {
              "id": "n3dffh3",
              "author": "ArchieThomas72",
              "body": "Compression of the image from different focal lengths is different than framing.",
              "score": -8,
              "created_utc": 1752630536.0,
              "replies": [
                {
                  "id": "n3djsp2",
                  "author": "ozzilee",
                  "body": "There is no such thing as focal length compression. Distance to subject is all that matters. You can prove it yourself easily enough. As long as you stay the same distance from your subject, cropping and zooming are exactly the same (other than resolution, obviously).",
                  "score": 11,
                  "created_utc": 1752632067.0,
                  "replies": []
                },
                {
                  "id": "n3djrxj",
                  "author": "Drolevarg",
                  "body": "But other than the depth of field, it will be identical. Cropping a 70mm equivalent frame on a photo taken with a 35mm at f2.8 will result in the same background compression as a photo taken with a 70mm lens at f5.6.",
                  "score": 8,
                  "created_utc": 1752632060.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n3dfkvs",
          "author": "correctingStupid",
          "body": "You think that the depth compression factor of a camera is anything a consumer has ever wondered about lol. The people that buy these wonder about one thing...size. ",
          "score": 5,
          "created_utc": 1752630587.0,
          "replies": []
        },
        {
          "id": "n3dgixw",
          "author": "infinite_in_faculty",
          "body": "$5000? Tariffs maybe?",
          "score": 4,
          "created_utc": 1752630914.0,
          "replies": [
            {
              "id": "n3e8uuf",
              "author": "nagi603",
              "body": "Nah, the RX1 series were always extremely expensive, even if you factor in the full-frame sensor, high res and size.",
              "score": 5,
              "created_utc": 1752642512.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n3c0zyn",
      "author": "Doug24",
      "body": "\"It comes with a macro ring that enables users to get as close as 20cm to subjects and feature's Sony's new \"Step Crop Shooting\" function that allows 35mm, 50mm and 70mm focal lengths by cropping into the sensor, just like the GFX100RF can do with a similar button.\"",
      "score": 28,
      "created_utc": 1752613802.0,
      "replies": [
        {
          "id": "n3c38pf",
          "author": "Curious_Document_956",
          "body": "“It's not nearly as powerful as the A7R V for video, but can still handle 4K 30 fps video with 10-bit 4:2:2 color sampling, along with 1080p video at up to 120 fps. \n\nNo log mode is available, but you do get the log-like S-Cinetone that boosts dynamic range a bit. Other features include a single SDXC UHS II slot, a mic input (but not headphone jack), a microHDMI port and a USB-C input.”\n\nThe R1XR III is much more expensive than the RX1R II was at launch. It'll go on pre-order soon for $5,100, with shipping set to start on July 31st. Sony is also offering a handful of accessories (also expensive), including a $300 (!) thumb grip, $250 body case and $200 lens hood (!!). “",
          "score": 17,
          "created_utc": 1752614459.0,
          "replies": [
            {
              "id": "n3cexhw",
              "author": "Firm_Watercress_4228",
              "body": "No log and no 4k60 when the A7CR with the same sensor is just wow",
              "score": 9,
              "created_utc": 1752618115.0,
              "replies": [
                {
                  "id": "n3cze4j",
                  "author": "SEND_ME_FAKE_NEWS",
                  "body": "Probably heat related if I had to guess.\n\nI very briefly thought of getting this, but I think I’ll just continue travelling with my A7CR + 35 1.8",
                  "score": 7,
                  "created_utc": 1752624924.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3d164h",
      "author": "abarrelofmankeys",
      "body": "Can’t figure out what the use case is for this at 5k. More money than sense perhaps?",
      "score": 11,
      "created_utc": 1752625545.0,
      "replies": []
    },
    {
      "id": "n3ebymc",
      "author": "neurobotic242",
      "body": "way overpriced. dumb move sony.",
      "score": 5,
      "created_utc": 1752644080.0,
      "replies": []
    },
    {
      "id": "n3cno3b",
      "author": "None",
      "body": "[deleted]",
      "score": 13,
      "created_utc": 1752620997.0,
      "replies": []
    },
    {
      "id": "n3cd4dp",
      "author": "18voltbattery",
      "body": "I had an OG RX100 amazing camera for the time and price",
      "score": 4,
      "created_utc": 1752617470.0,
      "replies": [
        {
          "id": "n3cpkei",
          "author": "None",
          "body": "Yeah, that camera was sick. I didn’t own it but did camera sales then. ",
          "score": 3,
          "created_utc": 1752621615.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3g7hg7",
      "author": "sjesmith127",
      "body": "Who was actually waiting 10 years?  I woukd have just bought another camera.",
      "score": 3,
      "created_utc": 1752675167.0,
      "replies": []
    },
    {
      "id": "n3daj2m",
      "author": "None",
      "body": "How about an affordable RX100 M8 for the regular people",
      "score": 6,
      "created_utc": 1752628819.0,
      "replies": [
        {
          "id": "n3e117v",
          "author": "ZappAstrim",
          "body": "Yes please. I'm waiting for the rx100 to be released and will most likely buy it unless Sony completely screw it up. ",
          "score": 2,
          "created_utc": 1752638701.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n3di0wi",
      "author": "Nimesaloteth",
      "body": "This looks like a great camera (missing ibis aside) but $5100??!? That price is absurd. That’s almost the price of two A7CRs.",
      "score": 6,
      "created_utc": 1752631435.0,
      "replies": []
    },
    {
      "id": "n3eqpva",
      "author": "DiplomatikEmunetey",
      "body": "DOA with that insane price. And looks like they are not adding any smart, convenient features to it. Sony still relies purely on their hardware horsepower.",
      "score": 4,
      "created_utc": 1752652061.0,
      "replies": []
    },
    {
      "id": "n3di1zl",
      "author": "Nimesaloteth",
      "body": "The fact that this is finally here and it was a surprise?! Crazy",
      "score": 2,
      "created_utc": 1752631445.0,
      "replies": []
    },
    {
      "id": "n3f9gad",
      "author": "More-A1d165951O3",
      "body": "Panasonic pls help us",
      "score": 1,
      "created_utc": 1752662634.0,
      "replies": []
    },
    {
      "id": "n5olqat",
      "author": "cameramule",
      "body": "4k30 was nearly ten years ago.",
      "score": 1,
      "created_utc": 1753738228.0,
      "replies": []
    },
    {
      "id": "n5qlgrx",
      "author": "randomcourage",
      "body": "lets see its competitor, Leica q3 comes with OIS(stabilizer), wider 28mm and 1/2 stop faster lens, but heavier and a little more expensive.\n\n\nFujifilm GFX100RF, bigger medium format 0.79x sensor, 28mm equivalent wider lens, 2 stops slower lens, larger 102 megapixel, and as big and heavy as leica. slightly cheaper.\n\n\nricoh GR IV, 5axis ibis(better stabilizer), smaller apsc 1.5x sensor,  28mm equivalent wider 1 stop slower lens. half the weight of sony. 1/5 the price of sony.",
      "score": 1,
      "created_utc": 1753763438.0,
      "replies": []
    },
    {
      "id": "n3cse3i",
      "author": "brewgiehowser",
      "body": "Does it make those tonez tho?",
      "score": -2,
      "created_utc": 1752622547.0,
      "replies": []
    },
    {
      "id": "n3cjbj2",
      "author": "firedrakes",
      "body": "ay yes the mp lie.\n\njust like 60mp camera in phones...\n\n\nYes yes reddit bros thanks for the dv showing you know nothing about the topic.",
      "score": -20,
      "created_utc": 1752619572.0,
      "replies": [
        {
          "id": "n3dmny4",
          "author": "PeriapsisBurn",
          "body": "What do you mean?",
          "score": 5,
          "created_utc": 1752633109.0,
          "replies": [
            {
              "id": "n3dnsfe",
              "author": "firedrakes",
              "body": "So smart phone manf lie on mp count  have been for years so does none film maker camera to. Not in any way my fault most people and reddit  user know that.\n\nSensors are simple to small size for it ( consumer side)",
              "score": -12,
              "created_utc": 1752633524.0,
              "replies": [
                {
                  "id": "n3dqx5w",
                  "author": "BlastFX2",
                  "body": "This is a full frame camera. 60MP is quite reasonable for a 35mm sensor.",
                  "score": 8,
                  "created_utc": 1752634697.0,
                  "replies": [
                    {
                      "id": "n3ds2m0",
                      "author": "firedrakes",
                      "body": "Swing and mess. To small sensor and would need way more cooling for a  true 60 mp sensor. Guessing you did not know that and how much camera  sensor manf lie on mp. Been a industry lienon mp for a long time now .\nBtw file size is to small for a true sensor.",
                      "score": -10,
                      "created_utc": 1752635139.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n3dsir8",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 5,
                  "created_utc": 1752635313.0,
                  "replies": [
                    {
                      "id": "n3du13e",
                      "author": "firedrakes",
                      "body": "that consumer full frame.\n\ntrue full frame\n\nhere a link to what those bodies look like.\n\n[https://ymcinema.com/2024/11/11/the-philosophy-behind-cinema-cameras-sensor-sizes/](https://ymcinema.com/2024/11/11/the-philosophy-behind-cinema-cameras-sensor-sizes/)\n\nnotice how massive those camerae are.\n\nthey also need ssd lvl storage speeds and that for   a short record  time , also they have tons of ram in those camera due to even m.2 drives are simple to slow for real full frame cameras.\n\n\n\ni get reddit bros dont understand how industry lie to average consumer.\n\nconsumer side and physic side has force  this to be use alot. just like fake hdr! for consumer side\n\n[https://en.wikipedia.org/wiki/Pixel\\_shift](https://en.wikipedia.org/wiki/Pixel_shift)\n\nbut dont worry this will get dv and buried . Consumer simple adore being lied to so much now that it borderline legal in many industry to do that.",
                      "score": -6,
                      "created_utc": 1752635901.0,
                      "replies": [
                        {
                          "id": "n3dwobe",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 4,
                          "created_utc": 1752636943.0,
                          "replies": [
                            {
                              "id": "n3dxf04",
                              "author": "firedrakes",
                              "body": "the mp amount a lie. body again is to small and need more cooling, storage would not work due to being to slow for fake rez it hitting..\n\nthis is pixil shifting and other camera manf trick to hit a  rez that no possible  with size of camera.\n\nbut dont worry you will bs cover them more on this.",
                              "score": -3,
                              "created_utc": 1752637234.0,
                              "replies": [
                                {
                                  "id": "n3dxog9",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 3,
                                  "created_utc": 1752637338.0,
                                  "replies": [
                                    {
                                      "id": "n3e1udx",
                                      "author": "firedrakes",
                                      "body": "Third and finale time. To small of a sensor and camera  body...",
                                      "score": -5,
                                      "created_utc": 1752639047.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "n3lgo9i",
                                  "author": "Captain_Biscuit",
                                  "body": "What are you smoking mate?  Cameras don't use quad bayer sensors. \n\nAnd good luck pixel shifting on a camera that doesn't have IBIS.",
                                  "score": 0,
                                  "created_utc": 1752740839.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}