{
  "post": {
    "title": "Indonesia blocks Google Pixel sales after ban on iPhone 16",
    "author": "diacewrb",
    "id": "1gh6wk4",
    "score": 128,
    "created_utc": 1730471847.0,
    "selftext": "",
    "num_comments": 60,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gh6wk4/indonesia_blocks_google_pixel_sales_after_ban_on/"
  },
  "comments": [
    {
      "id": "luy5ohr",
      "author": "Zyrobe",
      "body": "\"failing to meet domestic content requirements\" idk what that means",
      "score": 78,
      "created_utc": 1730508149.0,
      "replies": [
        {
          "id": "luy6xyw",
          "author": "caiusto",
          "body": "Apparently 40% of the phones' components sold in the country have to be sourced locally.",
          "score": 86,
          "created_utc": 1730508634.0,
          "replies": [
            {
              "id": "luy72d3",
              "author": "Zyrobe",
              "body": "wow that sounds hard",
              "score": 68,
              "created_utc": 1730508681.0,
              "replies": []
            },
            {
              "id": "luyu0ly",
              "author": "Rabo_McDongleberry",
              "body": "Really? What phone would even meet that threshold? Do they have a local company?",
              "score": 48,
              "created_utc": 1730518225.0,
              "replies": [
                {
                  "id": "luzv1bn",
                  "author": "hasdunk",
                  "body": "Samsung, for example, build their phones locally in Indonesia.",
                  "score": 27,
                  "created_utc": 1730541824.0,
                  "replies": [
                    {
                      "id": "lv0jqn6",
                      "author": "yoerie86",
                      "body": "Thats a good infp, flying there in 3 weeks",
                      "score": 2,
                      "created_utc": 1730554597.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luzuyqc",
              "author": "hkg_shumai",
              "body": "Or local investments. Apple is in a similar situation. They’re planning to open a developer centre.",
              "score": 6,
              "created_utc": 1730541778.0,
              "replies": []
            },
            {
              "id": "luy7zq7",
              "author": "CallMeDrLuv",
              "body": "Well Krakatoa is the new silicon volcano",
              "score": 9,
              "created_utc": 1730509045.0,
              "replies": [
                {
                  "id": "luywa2x",
                  "author": "Calvykins",
                  "body": "It’s also where the X-men have lived for the past 5 years.",
                  "score": 3,
                  "created_utc": 1730519283.0,
                  "replies": [
                    {
                      "id": "luzvzqj",
                      "author": "secretqwerty10",
                      "body": "it's also the name of a superhero underwater",
                      "score": 0,
                      "created_utc": 1730542457.0,
                      "replies": []
                    },
                    {
                      "id": "lv0ghe9",
                      "author": "Mr_master89",
                      "body": "I think they live on Mars now too, or at least declared mars as the mutant home world",
                      "score": 0,
                      "created_utc": 1730553299.0,
                      "replies": [
                        {
                          "id": "lv0h3nn",
                          "author": "Calvykins",
                          "body": "We call it by its proper mutant name: Arakko",
                          "score": 1,
                          "created_utc": 1730553551.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luyji4h",
              "author": "Ok-Ice1295",
              "body": "That sounds pretty absurd………",
              "score": 16,
              "created_utc": 1730513658.0,
              "replies": [
                {
                  "id": "luzwz3s",
                  "author": "LePouletMignon",
                  "body": "Nothing absurd about it. It makes perfect economic sense. Unless leglislation is there, how do you suggest these countries can develop their domestic industries?",
                  "score": -7,
                  "created_utc": 1730543098.0,
                  "replies": [
                    {
                      "id": "lv004c6",
                      "author": "Bloodsucker_",
                      "body": "Narrator: they didn't develop their domestic industries.",
                      "score": 13,
                      "created_utc": 1730545098.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lv5zo9t",
              "author": "ChampionshipBig8290",
              "body": "AUSTRALIA would be fucked if we had these laws.\n\nWe would be kicking around in the nude wearing hug boots on our feet. Eating vegimite sandwiches",
              "score": 1,
              "created_utc": 1730635686.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luzt9cl",
          "author": "DutchBlob",
          "body": "Two Campbell soup cans with a wire between them have been banned from sales in Indonesia after failing to meet the domestic content requirements.",
          "score": 4,
          "created_utc": 1730540595.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luybwem",
      "author": "orangpelupa",
      "body": "They didn't official sell in indonesia so Google probably went \"meh\" ",
      "score": 38,
      "created_utc": 1730510591.0,
      "replies": []
    },
    {
      "id": "luzek7o",
      "author": "Spicy_Pickle_6",
      "body": "Sounds like Indonesia wants to go back to using smoke signals",
      "score": 30,
      "created_utc": 1730529975.0,
      "replies": [
        {
          "id": "lv1aoz0",
          "author": "ozzie123",
          "body": "I mean... Samsung already opened their phone factories and R&D center in Indonesia, so...",
          "score": 6,
          "created_utc": 1730563914.0,
          "replies": []
        },
        {
          "id": "lv40ckj",
          "author": "MoneyGrubbingMonkey",
          "body": "Seems to me like they're giving certain companies a defacto monopoly in their region",
          "score": 2,
          "created_utc": 1730596745.0,
          "replies": []
        },
        {
          "id": "lv5oi7t",
          "author": "GerhardArya",
          "body": "If you know Indonesia and how big of a market it is, you wouldn't be so arrogant. Like the other reply said, Samsung and chinese manufacturers follow their requirements and can sell there.\n\nThey just want you selling your stuff there to also benefit them through job creation, knowledge acquistion, something. So, honestly good for them.",
          "score": 1,
          "created_utc": 1730629206.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luz0znp",
      "author": "Athryn237",
      "body": ">Major smartphone makers must manufacture devices, develop firmware, or invest in local innovation to meet Indonesia’s content rules.\n\n>The Indonesian rule requires tech companies to source 40% of handset and tablet components domestically, a requirement that can be met through local manufacturing, firmware development, or direct investment in innovation projects.\n\nHonestly, good for Indonesia, they know the value of their market to the phone makers, and are actively trying to get more of the money to stay within the country",
      "score": 7,
      "created_utc": 1730521624.0,
      "replies": [
        {
          "id": "lv05g7i",
          "author": "CosmicCreeperz",
          "body": "Except when Apple and Google say “who cares” and refuse to comply with their unofficial bribes, I guess they overestimated the value of their market for high end phones…",
          "score": 19,
          "created_utc": 1730548177.0,
          "replies": [
            {
              "id": "lv5orrk",
              "author": "GerhardArya",
              "body": "They have Samsung and the chinese brands. They don't care. The rich indonesians can still buy those phones abroad or through some other ways.",
              "score": 2,
              "created_utc": 1730629385.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luz23tm",
          "author": "Scat_fiend",
          "body": "But is that feasible? Or are they deliberately making the requirements impossible?",
          "score": 6,
          "created_utc": 1730522218.0,
          "replies": [
            {
              "id": "luzui22",
              "author": "skolioban",
              "body": "Samsung did it. So are the plethora of Chinese brands.",
              "score": 7,
              "created_utc": 1730541459.0,
              "replies": []
            },
            {
              "id": "luz5l39",
              "author": "Athryn237",
              "body": "Absolutely feasible! If Indonesia had demanded that they had to specifically have 40% of the phones physical components made locally, end of story, that would for sure be ridiculous, but they offer several ways to reach the dollar value of that 40% requirement. \n\n>The Indonesian rule requires tech companies to source 40% of handset and tablet components domestically, a requirement that can be met through local manufacturing, firmware development, or direct investment in *innovation projects.*\n\nSamsung and Xiaomi have opened manufacturing facilities there, and Apple had originally been allowed to sell as they opened developer academies to train people from the country, but didn't meet the $95 million investment requirement Indonesia set for the company. Which might seem like a lot of money, but Apple also just made approx. $29.6 Billion dollars in gross profit from just the pre-sales weekend of the iPhone 16 launch. So regardless of anything else the company does or sells, just that sales volume is staggering.\n\nIndonesia is the largest smartphone market in Southeast Asia, being 40% of the total smartphone devices for the entire region, so it's a juicy steak to smartphone makers. Good to see a country leveraging its market share to bring more money, training and skills into the country and keeping it there, rather than having all that money immediately going offshore",
              "score": 9,
              "created_utc": 1730524162.0,
              "replies": [
                {
                  "id": "luzo6al",
                  "author": "jonesaus1",
                  "body": "Most of the Indonesian market is low end, not flagship devices like the google pixels and iPhones",
                  "score": 24,
                  "created_utc": 1730536936.0,
                  "replies": []
                },
                {
                  "id": "luzjvyn",
                  "author": "shadowrun456",
                  "body": "If every single country made laws like this, then a smartphone would cost 10k USD.",
                  "score": 14,
                  "created_utc": 1730533807.0,
                  "replies": [
                    {
                      "id": "lv0495y",
                      "author": "3600CCH6WRX",
                      "body": "Not many countries have the same leverage as Indonesia. Their relatively young, large population and their strategic importance in geopolitics are not something anyone can ignore. The local build/investment requirement sounds ridiculous, but they did it, and most companies complied with it.",
                      "score": 5,
                      "created_utc": 1730547512.0,
                      "replies": [
                        {
                          "id": "lv2fj8w",
                          "author": "jonesaus1",
                          "body": "People have been saying this for 30 years",
                          "score": 2,
                          "created_utc": 1730576880.0,
                          "replies": []
                        },
                        {
                          "id": "lv0dv6i",
                          "author": "shadowrun456",
                          "body": "So just because they have a relatively young and large population they should get special rules? If I was the US, I would ban all US companies from following similar rules. This is worse than tariffs.\n\n>most companies complied with it.\n\nDefine \"most\". Both the newest Apple phone and the newest Google phone are banned. That's literally the two largest companies which make phones.",
                          "score": -4,
                          "created_utc": 1730552209.0,
                          "replies": [
                            {
                              "id": "lv0grtz",
                              "author": "msennaGT",
                              "body": "Samsung, Xiaomi, Oppo, Vivo. Basically 4 of the 5 largest phone companies in the world complied.\n\n>Google\n>largest company which make phones\n\nLargest tech company? Yes. Largest phone company? Not by a landslide.",
                              "score": 10,
                              "created_utc": 1730553417.0,
                              "replies": []
                            },
                            {
                              "id": "lv0pm5f",
                              "author": "3600CCH6WRX",
                              "body": "It’s not a rule. Population demographic is a powerful leverage. They can do this because there are manufacturers who is willing and the market who receptive. \n\nGuess what? The US had a similar law back in 1933 called the Buy American Act. The rule was that American companies had to use at least 55% to 75% American-made materials in their products. Even higher than what Indonesia asks for! While there are some drawbacks to this policy, it had a huge impact on the growth of American domestic manufacturing.",
                              "score": 6,
                              "created_utc": 1730556790.0,
                              "replies": [
                                {
                                  "id": "lv1v3sv",
                                  "author": "shadowrun456",
                                  "body": "Like I said, this is worse than tariffs. Why should other countries not retaliate with similar measures?",
                                  "score": -1,
                                  "created_utc": 1730570355.0,
                                  "replies": [
                                    {
                                      "id": "lv1wh72",
                                      "author": "3600CCH6WRX",
                                      "body": "Then try do it😂. That’s the point of diplomacy and trade agreement.",
                                      "score": 1,
                                      "created_utc": 1730570796.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "lv1rvdh",
                              "author": "Moscato359",
                              "body": "Google doesnt make many phones",
                              "score": 0,
                              "created_utc": 1730569339.0,
                              "replies": [
                                {
                                  "id": "lv1upqq",
                                  "author": "shadowrun456",
                                  "body": "Do you understand the difference between \"two largest companies which make phones\" and \"two companies which make the most phones\"? I said the former, you replied as if I have said the latter.",
                                  "score": -1,
                                  "created_utc": 1730570229.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "luzvg42",
                      "author": "hasdunk",
                      "body": "Samsung does it and the S24 FE is IDR 9,999,000 (≈USD 630) so roughly the same price in the US (USD 649.99).",
                      "score": 1,
                      "created_utc": 1730542096.0,
                      "replies": [
                        {
                          "id": "luzx4av",
                          "author": "shadowrun456",
                          "body": "What? I think you replied to the wrong comment.",
                          "score": -6,
                          "created_utc": 1730543193.0,
                          "replies": [
                            {
                              "id": "luzxd43",
                              "author": "hasdunk",
                              "body": "nope, it's to yours. you said phone will cost 10k. the fact that Samsung manufactures their phones in Indonesia and Indonesian can still buy them with competitive prices says otherwise.",
                              "score": 4,
                              "created_utc": 1730543352.0,
                              "replies": [
                                {
                                  "id": "luzxu39",
                                  "author": "shadowrun456",
                                  "body": "Do you have reading comprehension problems or something?\n\n>**If every single country made laws like this**, then a smartphone would cost 10k USD.",
                                  "score": -4,
                                  "created_utc": 1730543660.0,
                                  "replies": [
                                    {
                                      "id": "luzzu2i",
                                      "author": "hasdunk",
                                      "body": "Okay, let me break it down slowly for your sake:\n\nSamsung does this in Indonesia, the price didn't increase. \nWhat Samsung did is not building everything from scratch like the chip, motherboard, or display in Indonesia, but only assembly. \n\nCars, for example, are assembled locally, or at least regionally. yet the prices are not that much different between market. \n\nWhy would a smartphone cost 10k USD if they have to be assembled locally?",
                                      "score": 1,
                                      "created_utc": 1730544922.0,
                                      "replies": [
                                        {
                                          "id": "lv0cj8c",
                                          "author": "shadowrun456",
                                          "body": ">Why would a smartphone cost 10k USD if they have to be assembled locally?\n\nFor the third time:\n\n# If every single country made laws like this\n\nIt has nothing to do with being produced locally and everything to do with having to find and permanently maintain 190+ different manufacturing / assembly / whatever lines.",
                                          "score": 3,
                                          "created_utc": 1730551631.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "luzi6fw",
                  "author": "boilingchip",
                  "body": "What happens when another country passes a law that requires 61% of the product to be sourced locally? Do you see how absurd the Indonesian rule is?",
                  "score": 2,
                  "created_utc": 1730532562.0,
                  "replies": [
                    {
                      "id": "lv09mg3",
                      "author": "humannose2",
                      "body": "Then the remaining 39% can be made somewhere else? Lots of countries (Vietnam, India etc.) already do this, not just with phones but cars too. Or are you thinking the Indonesian law also rules where phones in America/world are made?\n\nGoogle Pixels in America can be 0% Indonesian. Google Pixels in Indonesia has to be at least 40% Indonesian.",
                      "score": 4,
                      "created_utc": 1730550280.0,
                      "replies": [
                        {
                          "id": "lv2vrr5",
                          "author": "boilingchip",
                          "body": "So every country gets their own phone manufacturing plant? This is not feasible. The people in this thread who are acting like the Indonesian rule is at all reasonable simply don't understand how logistics, manufacturing, QA/QC, or distribution work.",
                          "score": 1,
                          "created_utc": 1730582240.0,
                          "replies": [
                            {
                              "id": "lv3f0we",
                              "author": "humannose2",
                              "body": "I think you don't understand how phones (or anything) are made.\nPhones are not just made out of thin air in \"phone manufacturing plants\". They need GPS receiver, LCD or OLED, the panel itself, touch sensor layer, protective glasses, flash storage, image sensors, camera, camera lens, camera modules, lithium ion battery, NFC chips, accelerometer, gyroscope etc.\n\nLet me give you an example for Vietnam. For non-Vietnamese phones, ~25 phone parts are produced in Vietnamese plants/factories/mines, but 72 for Vietnamese phones. China itself is able to make more than 150 parts of a phone. You mentioned \"logistics\" and \"distribution\", so you have to at least realize phones are not just made in phone factories out of thin air.",
                              "score": 1,
                              "created_utc": 1730588990.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luzwk31",
          "author": "Pandamio",
          "body": "I don't get why you are being downvoted.",
          "score": 4,
          "created_utc": 1730542824.0,
          "replies": [
            {
              "id": "lv1nkhg",
              "author": "Athryn237",
              "body": "Right? Absolutely confounding, but I guess people just really don't like the idea, or to view it in a negative light, maybe they just don't like when any country tries to stand up to their favorite corporate overlord",
              "score": 0,
              "created_utc": 1730568004.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luzmsq3",
          "author": "GuybrushBeeblebrox",
          "body": "What the fuck are you getting downvoted for.",
          "score": 2,
          "created_utc": 1730535920.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv0gbyx",
      "author": "Alex01100010",
      "body": "Indonesien Government clearly never Head the sentence „Rome hasn’t been built in a day“.\nYou start with 1% not 40%.",
      "score": 1,
      "created_utc": 1730553240.0,
      "replies": []
    },
    {
      "id": "luzlnzd",
      "author": "Unhappy-Jaguar5495",
      "body": "They just need to invest in the country.. other phone brands have set up business there producing parts etc. A country looking out for its people.. wow must be nice to see here no?",
      "score": -7,
      "created_utc": 1730535089.0,
      "replies": [
        {
          "id": "lv0gu20",
          "author": "ProgressiveSpark",
          "body": "That sounds like commie talk brother. \n\nAll i care about as a shareholder is maxing profits. Why should i care about the welfare of foreigners? /S",
          "score": 2,
          "created_utc": 1730553442.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luzwpbj",
      "author": "Pandamio",
      "body": "Who the fuck is downvoting all of you and not giving reasons?",
      "score": -7,
      "created_utc": 1730542920.0,
      "replies": [
        {
          "id": "luzzghh",
          "author": "Skyswimsky",
          "body": "Not downvoting but \"Capitalism bad\" is such a loaded statement. I mean nobody is saying that but the whole idea behind it is that a group of individuals focus their effort into overproducing what they excel at, and export it, while importing what they're lacking. That's commonly done via trade. And it's what helped humanities growth accelerate.\n\nSo going \"so GOOD of them to force companies to produce there instead in places where it make more sense\", rather than India focusing on it's economic strengths is kinda like saying \"capitalism bad.\" or \"just eat an apple if you have depressions, the vitamins make you happy.\" \n\nAt least that's my take and I guess that's why downvotes.",
          "score": 2,
          "created_utc": 1730544688.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv0lvh6",
      "author": "Kanguin",
      "body": "It's a small market,  maybe all tech companies should just pull out",
      "score": -5,
      "created_utc": 1730555413.0,
      "replies": [
        {
          "id": "lv1l0os",
          "author": "imsorryken",
          "body": "yes very small, only the fourth most populous country lol",
          "score": 12,
          "created_utc": 1730567209.0,
          "replies": []
        }
      ]
    }
  ]
}