{
  "post": {
    "title": "Microsoft's potential answer to the PlayStation 5 DualSense controller revealed in patent",
    "author": "Sariel007",
    "id": "1ho9he9",
    "score": 1531,
    "created_utc": 1735404156.0,
    "selftext": "",
    "num_comments": 565,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ho9he9/microsofts_potential_answer_to_the_playstation_5/"
  },
  "comments": [
    {
      "id": "m47o3ni",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1735404157.0,
      "replies": []
    },
    {
      "id": "m48biy8",
      "author": "eestionreddit",
      "body": "but where's the gyro?",
      "score": 207,
      "created_utc": 1735411800.0,
      "replies": [
        {
          "id": "m49ijll",
          "author": "JesusLazalde123",
          "body": "It’s pronounced gyro",
          "score": 266,
          "created_utc": 1735426064.0,
          "replies": [
            {
              "id": "m49p39o",
              "author": "Kresche",
              "body": "There's at least three ways to pronounce it. For example: gyro",
              "score": 67,
              "created_utc": 1735428362.0,
              "replies": [
                {
                  "id": "m4a1pe2",
                  "author": "StaticBlack",
                  "body": "Yee-ro, ghee-ro, jee-ro, guy -ro, jy-ro sorry I was bored and typed out all the ways I’ve heard it lol",
                  "score": 35,
                  "created_utc": 1735432697.0,
                  "replies": [
                    {
                      "id": "m4aq55u",
                      "author": "ADHD_Supernova",
                      "body": "As long as you want the cucumber sauce then we good.",
                      "score": 18,
                      "created_utc": 1735441622.0,
                      "replies": [
                        {
                          "id": "m4cc5bs",
                          "author": "stellvia2016",
                          "body": "You mean the tazeekey sauce, right? /s",
                          "score": 6,
                          "created_utc": 1735473091.0,
                          "replies": [
                            {
                              "id": "m4g66bt",
                              "author": "piTehT_tsuJ",
                              "body": "Nah, they want the *cucumber* sauce... Similar to *Jack* sauce, but not from Jack in the Box.",
                              "score": 2,
                              "created_utc": 1735520848.0,
                              "replies": []
                            },
                            {
                              "id": "m4cp9g4",
                              "author": "AlwaysRushesIn",
                              "body": "Tzatziki*",
                              "score": 1,
                              "created_utc": 1735479963.0,
                              "replies": [
                                {
                                  "id": "m4e6iez",
                                  "author": "stellvia2016",
                                  "body": "*whoosh*",
                                  "score": 2,
                                  "created_utc": 1735498070.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4ch3r9",
                      "author": "None",
                      "body": "Damn I’ve been pronouncing it döner",
                      "score": 6,
                      "created_utc": 1735475956.0,
                      "replies": [
                        {
                          "id": "m4cslfn",
                          "author": "StaticBlack",
                          "body": "There’s a place in the St. Louis area call doner kabob that makes the best gyros I’ve ever had.",
                          "score": 3,
                          "created_utc": 1735481442.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m4b1qsw",
                      "author": "CreativeDimension",
                      "body": "y'all pronouncing it wrong \n\n\nit is pronounced jairo\n\n*pff*",
                      "score": 1,
                      "created_utc": 1735446280.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m49w0e2",
                  "author": "hazed-and-dazed",
                  "body": "But there are only 2 ways to eat it",
                  "score": 1,
                  "created_utc": 1735430775.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4a2ocg",
              "author": "MRintheKEYS",
              "body": "Damn, I am hungry now.",
              "score": 2,
              "created_utc": 1735433030.0,
              "replies": []
            },
            {
              "id": "m49xkr8",
              "author": "Soakitincider",
              "body": "I’m holding out for a gyro till the end of the night.",
              "score": 1,
              "created_utc": 1735431313.0,
              "replies": []
            },
            {
              "id": "m49xt14",
              "author": "pvtcannonfodder",
              "body": "I hate that you made me pronounce it differently in my head",
              "score": 1,
              "created_utc": 1735431391.0,
              "replies": []
            },
            {
              "id": "m4a3uu1",
              "author": "Lazy_Presence7685",
              "body": "You spelled it the same way",
              "score": 1,
              "created_utc": 1735433433.0,
              "replies": []
            },
            {
              "id": "m4ax74m",
              "author": "Practical-Command634",
              "body": "In Scotland it's spelt giro and is what you get when you're on benefits",
              "score": 1,
              "created_utc": 1735444416.0,
              "replies": []
            },
            {
              "id": "m4bqzib",
              "author": "RagingSinusInfection",
              "body": "that’s what i said, G-Y-R-O",
              "score": 1,
              "created_utc": 1735459383.0,
              "replies": []
            },
            {
              "id": "m4brqmu",
              "author": "Old-Basil-5567",
              "body": "But what does it taste like?",
              "score": 1,
              "created_utc": 1735459851.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m493z0e",
          "author": "KEVLAR60442",
          "body": "Also confirmed in the same patent. \n\nhttps://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1h8Gxz.img?w=768&h=432&m=6",
          "score": 18,
          "created_utc": 1735421155.0,
          "replies": [
            {
              "id": "m4aeqjn",
              "author": "kfmush",
              "body": "I don’t see any mention of a gyroscope on that slide. It mentions an accelerometer, which is not the same thing. \n\nAn accelerometer just reads acceleration in a direction, it doesn’t do anything for rotation and isn’t very accurate for even what it does, on the scale of movements a controller would experience. They’re usually used just for gesture inputs and not for accurate pointing.\n\nHere’s hoping it’s a typo and it has a gyroscope.",
              "score": 17,
              "created_utc": 1735437300.0,
              "replies": [
                {
                  "id": "m4bk3na",
                  "author": "Ok_Resolution7047",
                  "body": "I think you might be confused about the term accelerometer. There are accelerometer arrays for guidance systems that are micro-g accurate and could record your pulse if you were touching the case,",
                  "score": 3,
                  "created_utc": 1735455262.0,
                  "replies": []
                },
                {
                  "id": "m4afp0z",
                  "author": "KEVLAR60442",
                  "body": "When was the last time you saw a motion control interface with an acellerometer but no gyro?  Maybe the late aughts with 20 dollar PopStation Wii knockoffs?  At this point, they're two sides of the same coin and are effectively interchangeable in common language.",
                  "score": -1,
                  "created_utc": 1735437656.0,
                  "replies": [
                    {
                      "id": "m4buo7k",
                      "author": "cunningmunki",
                      "body": "wrong. do some research",
                      "score": -3,
                      "created_utc": 1735461742.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m49bx7e",
              "author": "UboaNoticedYou",
              "body": "Thank christ, finally. Might purchase a new Microsoft controller for the first time in almost a decade!",
              "score": 20,
              "created_utc": 1735423808.0,
              "replies": [
                {
                  "id": "m49vvwr",
                  "author": "Fredasa",
                  "body": "I'll have something I can tolerate using, for when PS5 emulation gets in full swing.\n\n(Can't handle having the primary analog stick well below where my thumb rests naturally.  There's a reason why even Nintendo has finally thrown in the towel on their precious symmetry.  The Xbox layout just works the best.)",
                  "score": 1,
                  "created_utc": 1735430732.0,
                  "replies": [
                    {
                      "id": "m4a0cvr",
                      "author": "Ghisteslohm",
                      "body": "Nintendos special symmetry sounds funny to me because almost every Nintendo console had a different button layout for the last 30 years. They seem to be the most likely to switch it up.",
                      "score": 15,
                      "created_utc": 1735432252.0,
                      "replies": [
                        {
                          "id": "m4a4kpz",
                          "author": "Fredasa",
                          "body": "Exactly.  They've tried everything they can, but crucially, when it came to their \"pro controllers,\" they were very married to symmetry, no matter what it cost the actual ergonomics.  It says a heck of a lot that they've finally given it up.\n\nI'll consider the transition complete when they figure out what angle works best for the side grips.  (I.e. when they copy that from Xbox as well.)",
                          "score": 2,
                          "created_utc": 1735433658.0,
                          "replies": [
                            {
                              "id": "m4a7axo",
                              "author": "_RADIANTSUN_",
                              "body": "I liked the Wii U's Pro controller layout with both analogues up top.",
                              "score": 2,
                              "created_utc": 1735434588.0,
                              "replies": [
                                {
                                  "id": "m4bw22x",
                                  "author": "KingofSkies",
                                  "body": "I really want a wii u pro controller layout with 4 back buttons. I think it'd be neat. And while I'm at it, the disparity between prices and availability of good aftermarket controllers for switch VS for ps5 is ridiculous. Want gyro, rumble, Bluetooth connect and 4 back buttons? And hall effect sticks? OK, for switch, that'll be $60. For ps5? Doesn't exist. Closest you can get starts at $180. Premium tax or Sony gatekeeping, whatever the cause, it's bloody annoying.",
                                  "score": 1,
                                  "created_utc": 1735462650.0,
                                  "replies": []
                                },
                                {
                                  "id": "m4aeicz",
                                  "author": "Fredasa",
                                  "body": "I actually bust that out whenever I play anything _Robotron_-like.\n\nBasically, my hands like it when the thumbs are permitted to rest above the primary controls the majority of the time.  In most games, that means control stick on left, main buttons on right.\n\nI don't envy Sony's position on this.  You can bet they'd like to be able to provide something more ergonomic, as evinced by how they finally gave up the PS1 grips for something more Xbox-like, but I think they're aware that their fanbase would be out for blood if they fixed the left analog stick's legacy position after all these decades.",
                                  "score": 0,
                                  "created_utc": 1735437216.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4chxbl",
                              "author": "Ghisteslohm",
                              "body": "But the pro controllers were only on Wii and WiiU right? and just as a side option to the main controller. Gamecube already kinda had the asymmetrical design and then Switch has it again.",
                              "score": 1,
                              "created_utc": 1735476397.0,
                              "replies": [
                                {
                                  "id": "m4f6lt1",
                                  "author": "Fredasa",
                                  "body": "Sure, I speak of the relevant history.  GC controller was essentially an evolution from what they came up with for the N64.  A kind of sheepish hybrid between that early effort and what the other makers had cooking.  As much as I liked the Wavebird, I didn't like the variously-sized primary buttons or the octagonal stick resistor.  Vestiges that Nintendo couldn't immediately abandon.\n\nIt is a good observation, though.  It suggests that Nintendo's insistence upon symmetry was part of the marketing package they came up with for the Wii.",
                                  "score": 1,
                                  "created_utc": 1735509088.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4dscf9",
                      "author": "Mucher_",
                      "body": "I'm on the other side. It's uncomfortable and unintuitive for the sticks to be in different positions. Never owned an Xbox for this reason and hate the fact that the Switch pro controllers moved the stick. That said, I also find the dualsense less comfortable and ergonomic than the dualshock 4. I was one of the first to offer my thoughts about the DS and found criticism from both sides of the fence.\n\nThat being said, the real path forward, imo, is to make both sticks, the 4 face buttons, and the dpad magnetically interchangeable. The reality is there will always be people on either side, and the first to introduce such a feature will win the game. It will also open the path for increased comfort for left-handed individuals.",
                      "score": 0,
                      "created_utc": 1735493771.0,
                      "replies": [
                        {
                          "id": "m4f844g",
                          "author": "Fredasa",
                          "body": "Probably will never happen for the in-box pad.  Expensive prospect with all the downsides of a significant uptick in moving parts.  What is more likely to happen, especially within the context of this very thread, is some kind of inter-compatibility between platforms and pads, which, even if arrived at through a third party device, is left alone by the first parties.\n\nSince Microsoft has already made the first significant move (Gamepass) in the inevitable transition away from core consoles, this inter-compatibility may well end up being resolved _de facto_ when both parties are simply hosting each of their platforms as Gamepass/Gamepass clone on PC-compatible hardware.",
                          "score": 1,
                          "created_utc": 1735509559.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4bv0qn",
                  "author": "cunningmunki",
                  "body": "Sorry to say that an accelerometer is not a gyro. It'll still be a potato unfortunately.",
                  "score": -1,
                  "created_utc": 1735461968.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4b2q1r",
              "author": "ivera",
              "body": "That’s not the patent. That’s a image of their concept that was shown during the ftc trial over a year ago. That image proves nothing",
              "score": 3,
              "created_utc": 1735446699.0,
              "replies": []
            },
            {
              "id": "m4buwvg",
              "author": "cunningmunki",
              "body": "No gyro on the patent. Accelerometer≠Gyro",
              "score": 1,
              "created_utc": 1735461899.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4a3pzv",
          "author": "primev_x",
          "body": "I ate the gyros!",
          "score": 1,
          "created_utc": 1735433389.0,
          "replies": [
            {
              "id": "m4cjqbi",
              "author": "Idiotology101",
              "body": "I don’t know why anyone ever wants gyro controls.",
              "score": 1,
              "created_utc": 1735477334.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m49txns",
          "author": "IamZeus11",
          "body": "I don’t think Sony has exclusive rights to gyro since switch also has gyro",
          "score": 0,
          "created_utc": 1735430060.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m47ps7z",
      "author": "Really_McNamington",
      "body": "I'd be happy if they could just manage to make one that didn't succumb to stick drift in less than 6 months.",
      "score": 829,
      "created_utc": 1735404715.0,
      "replies": [
        {
          "id": "m47rq1h",
          "author": "MobileVortex",
          "body": "I've never gotten stick drift on my Xbox controllers. It's strange how some people never have issues and some people can't make it for 12 months...",
          "score": 532,
          "created_utc": 1735405355.0,
          "replies": [
            {
              "id": "m47u2nt",
              "author": "nightpop",
              "body": "I use an Xbox controller for PC gaming and it’s still healthy after 4 years. My PS5 controllers, on the other hand, all have stick drift or dead battery or both after 2-3 years.\n\nETA: Also, my switch pro and joycons are all fine like 6 years in. And my PS3 controllers from gd 2010 still work. RNGesus works in mysterious ways.",
              "score": 252,
              "created_utc": 1735406131.0,
              "replies": [
                {
                  "id": "m47y70c",
                  "author": "user11711",
                  "body": "Ironically, the controller that’s given me the most issues is the Xbox Elite first model. Rubber completely peeled, the USB on top doesn’t even work anymore 🙁. The controller still works wireless and it still functions but mostly because I put a silicone cover around it. The peeled sides made it annoying to hold. All my non elite Xbox controllers work fine.",
                  "score": 70,
                  "created_utc": 1735407480.0,
                  "replies": [
                    {
                      "id": "m482nvs",
                      "author": "ChaseballBat",
                      "body": "Rubber pealed for me too. All that heat and sweat loosened the adhesive lol",
                      "score": 23,
                      "created_utc": 1735408928.0,
                      "replies": [
                        {
                          "id": "m49kf4i",
                          "author": "LouBerryManCakes",
                          "body": "I buy used Xbox controllers to repair and pretty much every Elite Series 1 I've seen have rubber that is swelling and falling off to some degree. You almost never find one used still in good physical shape.",
                          "score": 4,
                          "created_utc": 1735426717.0,
                          "replies": [
                            {
                              "id": "m4p59ac",
                              "author": "WeaknessAshamed6872",
                              "body": "how have the elite 2s been? what are them main points of failure that youve noticed?",
                              "score": 1,
                              "created_utc": 1735656614.0,
                              "replies": [
                                {
                                  "id": "m4pxpnk",
                                  "author": "LouBerryManCakes",
                                  "body": "Elite 2s have a different shell material that almost never peel off like the Elite 1s. Much to my pleasant surprise most of mine have issues with the internal batteries connection coming loose, which is an easy disassembly and clean, bend some pins slightly and they are back to working again. I have had a couple bad analog sticks and unlike all the other Xbox controllers, the analog sticks are a different style, the mechanism that allows them to loosen and tighten means I had to source them elsewhere. But overall I like them a lot and choose to use one for my main.",
                                  "score": 1,
                                  "created_utc": 1735665940.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m4cf6qm",
                              "author": "ParsnipFlendercroft",
                              "body": "Sure - but you can buy replacements for cheap as chips and they’re easy to fit.",
                              "score": 1,
                              "created_utc": 1735474877.0,
                              "replies": [
                                {
                                  "id": "m4dche6",
                                  "author": "LouBerryManCakes",
                                  "body": "Where? I have never seen just the rubber parts. I have seen the grips but it's also the back shell piece. They seem to be hard to find due to how they all fail.",
                                  "score": 1,
                                  "created_utc": 1735488737.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m4841zx",
                      "author": "GotSmokeInMyEye",
                      "body": "How do you charge it?\n\nEdit because I realize now that the first gen did, in fact, have a battery pack. All of my elite controllers have been gen 2 and up and only have internal batteries so I didn’t know the first one had a battery pack.",
                      "score": 8,
                      "created_utc": 1735409387.0,
                      "replies": [
                        {
                          "id": "m48hvh3",
                          "author": "SuperTeamRyan",
                          "body": "Probably rechargeable Duracells or he has an aftermarket charging dock battery backplate.",
                          "score": 5,
                          "created_utc": 1735413852.0,
                          "replies": [
                            {
                              "id": "m48jkmi",
                              "author": "JamesCDiamond",
                              "body": "I got a backplate for the controller that came with my Series X. Never had any other issues with an Xbox controller.\n\nI did have to repair my Switch controllers when they developed drift - which appeared to be related to my family’s Animal Crossing infatuation of all things!",
                              "score": 3,
                              "created_utc": 1735414405.0,
                              "replies": []
                            },
                            {
                              "id": "m49gaon",
                              "author": "GotSmokeInMyEye",
                              "body": "Nah he said the elite controller. My elite controller does not have a battery pack at all. It only has an internal battery that needs to be charged by usb-c",
                              "score": 2,
                              "created_utc": 1735425293.0,
                              "replies": [
                                {
                                  "id": "m49goj7",
                                  "author": "SuperTeamRyan",
                                  "body": "The original elite controller had a battery pack compartment, I can’t speak for the second version of the elite controller though since I never got it.",
                                  "score": 2,
                                  "created_utc": 1735425425.0,
                                  "replies": [
                                    {
                                      "id": "m49h1qn",
                                      "author": "GotSmokeInMyEye",
                                      "body": "Yea I just edited my comment after googling. First gen had battery pack but all subsequent models are internal battery with usb-c charging only. Don’t know if that’s better or worse tbh. My last elite controller lasted like 2 yrs before getting stick drift and then I bought another one that’s been going for about a year now. So I never had one long enough to see if the battery will start to fail.",
                                      "score": 2,
                                      "created_utc": 1735425550.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m49g55h",
                          "author": "user11711",
                          "body": "Like the other person mentioned! I have a rechargeable battery for it. It’s just a single block that fits into the battery slots. I have another one charged always ready to go when one dies.",
                          "score": 1,
                          "created_utc": 1735425241.0,
                          "replies": [
                            {
                              "id": "m49gg52",
                              "author": "GotSmokeInMyEye",
                              "body": "My elite controller doesn’t have a battery pack at all that’s why I asked. Maybe I just have the second version? Did the first one have a battery pack? Mine only has an internal battery and needs to be charged by usb-c",
                              "score": 1,
                              "created_utc": 1735425346.0,
                              "replies": [
                                {
                                  "id": "m49ribz",
                                  "author": "user11711",
                                  "body": "Correct! The first model was just like a normal Xbox controller in regard to how the battery is. As in you have to slap in your own AA’s",
                                  "score": 1,
                                  "created_utc": 1735429208.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m483hsi",
                      "author": "corrrnboy",
                      "body": "Same, I sold the elite due to sticky buttons and stick issues",
                      "score": 2,
                      "created_utc": 1735409203.0,
                      "replies": [
                        {
                          "id": "m4ce9hc",
                          "author": "Miserable-Bear7980",
                          "body": "“not my problem… anymore”\n\n![gif](giphy|kaa12hX0AGM0ta7jqs)",
                          "score": 1,
                          "created_utc": 1735474345.0,
                          "replies": [
                            {
                              "id": "m4cf0c5",
                              "author": "corrrnboy",
                              "body": "Haha yeah",
                              "score": 1,
                              "created_utc": 1735474776.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m48mu8v",
                      "author": "InsaneLuchad0r",
                      "body": "Same — my Elite crapped out within two years. Meanwhile, the Xbox One era controller I got in 2014 still works just fine.",
                      "score": 1,
                      "created_utc": 1735415475.0,
                      "replies": []
                    },
                    {
                      "id": "m4c7dl7",
                      "author": "Yummier",
                      "body": "Xbox Elite controllers are well known to be of lesser quality than regular ones. It's stupid, but true. Even the Elite 2 apparently. \n\nI don't know if newer batches are any better.",
                      "score": 1,
                      "created_utc": 1735470073.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m47wvm6",
                  "author": "mimic751",
                  "body": "I'm still using my Xbox 360 controller on my computer",
                  "score": 13,
                  "created_utc": 1735407052.0,
                  "replies": [
                    {
                      "id": "m48eakc",
                      "author": "Assdolf_Shitler",
                      "body": "360 controller was tougher and felt better in the hands. My friend in highschool would rage and throw his into the bricks around his fireplace weekly. It was beat up, but thst thing worked for years. I've already gone through 1 of the new controllers and 1 of the elite controllers because of stick drift. The elite controller didn't even last 6 months before it was drifting.",
                      "score": 2,
                      "created_utc": 1735412685.0,
                      "replies": []
                    },
                    {
                      "id": "m48k9qd",
                      "author": "G3R4",
                      "body": "Is there a reliable alternative (read: knockoff) for the PC adapter? I lost mine years ago and still have a few 360 controllers floating around that I could repurpose.",
                      "score": 1,
                      "created_utc": 1735414634.0,
                      "replies": [
                        {
                          "id": "m48oato",
                          "author": "mimic751",
                          "body": "I don't know I bought a USB wireless adapter and it's been working for me for like 12 years or longer",
                          "score": 1,
                          "created_utc": 1735415958.0,
                          "replies": []
                        },
                        {
                          "id": "m49la2s",
                          "author": "notagoodscientist",
                          "body": "eBay has them",
                          "score": 1,
                          "created_utc": 1735427020.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m48q4kp",
                  "author": "RabidSeason",
                  "body": "It's not so much random as it is designs.  My original PS4 controllers (purchased whatever year GTA:V was ported) lasted up until a few years ago and never had stick drift.  The battery was only lasting for about an hour though, so I replaced them.  New controllers only lasted about two years until they had the drift.  At that time, I looked into how to change the battery, and also fix the drift, and all the details of taking them apart, and it became very clear that they changed a lot of things.  The old battery was larger and the sticks were better protected from dust.  And looking back to PS2 and XB360, those NEVER had stick drift issues for however many ~~years~~ *decades* this is now.\n\nThings are just built to lower standards now.",
                  "score": 4,
                  "created_utc": 1735416563.0,
                  "replies": []
                },
                {
                  "id": "m485lcz",
                  "author": "TehOwn",
                  "body": "None of my controllers have ever had stick drift. PS2 controllers all still work perfectly, all my original Xbox controllers, my Xbox 360 controller, both my Xbox Series X controllers, all of my Wii controllers and nunchucks.\n\nNever ever had stick drift. Honestly, I'm not even 100% sure what the issue is but I'm guessing it's that the sticks don't centre any more?",
                  "score": 16,
                  "created_utc": 1735409886.0,
                  "replies": [
                    {
                      "id": "m48cqju",
                      "author": "nightpop",
                      "body": "Unless it’s a different issue, for me stick drift is when the console registers you moving the stick even when you aren’t touching it. So you’re playing a game, you stop moving, but your character keeps going. It’s very annoying and makes any action-ey game basically unplayable",
                      "score": 10,
                      "created_utc": 1735412186.0,
                      "replies": [
                        {
                          "id": "m48kqf4",
                          "author": "ThePowerOfStories",
                          "body": "And makes interacting with menus or any grid-like turn-based system damn near impossible. To various degrees, it’s affected three out of the six Xbox controllers I’ve bought over the years to use with my PC.",
                          "score": 5,
                          "created_utc": 1735414785.0,
                          "replies": []
                        },
                        {
                          "id": "m48v1p8",
                          "author": "BattBoi69",
                          "body": "That’s exactly what is happening to me right now playing FF7 Rebirth. It’s annoying as fuck. I saw a video on how to repair it, but I’m way too nervous about fucking it up even more.",
                          "score": 1,
                          "created_utc": 1735418197.0,
                          "replies": []
                        },
                        {
                          "id": "m48fq8w",
                          "author": "TehOwn",
                          "body": "I think that's related to the same issue but I've never had that either.",
                          "score": 0,
                          "created_utc": 1735413150.0,
                          "replies": [
                            {
                              "id": "m48kcvk",
                              "author": "None",
                              "body": "as i understand it, stick drift usually comes from a joystick's moving parts, or the sensors that read them, malfunctioning or degrading somehow. so it's a technical issue more than anything. it's why you dont see it happen to Hall Effect sensors, bc they use magnets and their critical moving parts don't contact each other.\n\nsticks not centering just comes from playing too much or too hard - to some extent it's just wear and tear",
                              "score": 1,
                              "created_utc": 1735414663.0,
                              "replies": [
                                {
                                  "id": "m48m8au",
                                  "author": "TehOwn",
                                  "body": "I've definitely played a lot but I've always been very careful with my belongings, especially tech. Never threw it in anger, almost never dropped it, always put it away after using it and kept my tech out of harm's way. Never had friends who did that to any of my stuff either.\n\nI do wonder if that has something to do with it. I don't really get angry when playing video games or start hammering my controllers. With the exception of those things where you're required to spam a button as fast as possible.",
                                  "score": 3,
                                  "created_utc": 1735415276.0,
                                  "replies": [
                                    {
                                      "id": "m49a9md",
                                      "author": "nightpop",
                                      "body": "Oh my god. I never really played a fromsoft game before Elden Ring PS5. PS5 also the first time I’ve experienced stick drift. COINCIDENCE???",
                                      "score": 5,
                                      "created_utc": 1735423246.0,
                                      "replies": [
                                        {
                                          "id": "m49hc9w",
                                          "author": "TehOwn",
                                          "body": "Lmao, perhaps, it is a maddening game sometimes.",
                                          "score": 2,
                                          "created_utc": 1735425651.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "m48sxfz",
                                      "author": "None",
                                      "body": "i wouldn't be surprised if the disparity in reliability reports stems from a combination of different reasons\n\ntype of games played, how people treat the controller, how much they sweat, how acidic their skin is, who the designer contracts to manufacture it, what guidelines the designer gives, where the manufacturer sources materials, the manufacturer's long-term consistency\n\nall these things could affect various aspects of a game controller",
                                      "score": 3,
                                      "created_utc": 1735417494.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m49dh51",
                              "author": "duckliin",
                              "body": "bro stop lying. everyone saying \"ive never had stick drifts\" does not clock hours or plays candy crush. the number of hall effect sticks i had to install for every console. you guys are great liars just go into politics at this point.",
                              "score": -7,
                              "created_utc": 1735424339.0,
                              "replies": [
                                {
                                  "id": "m49okco",
                                  "author": "epochellipse",
                                  "body": "lol you caught them, internet detective. People are lying about stick drift to impress you. But you figured it out.",
                                  "score": 3,
                                  "created_utc": 1735428179.0,
                                  "replies": [
                                    {
                                      "id": "m49uwl9",
                                      "author": "duckliin",
                                      "body": "cute comment",
                                      "score": -1,
                                      "created_utc": 1735430392.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m49esna",
                                  "author": "HomemadeSprite",
                                  "body": " Buddy, go touch some grass.",
                                  "score": 1,
                                  "created_utc": 1735424787.0,
                                  "replies": [
                                    {
                                      "id": "m49fmty",
                                      "author": "duckliin",
                                      "body": "buddy stop backing up liars",
                                      "score": -3,
                                      "created_utc": 1735425069.0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "m49g7b4",
                                  "author": "TehOwn",
                                  "body": "I have tens of thousands of hours playing PC games, about a third of them on (two different) Xbox controllers, before that (decades ago) I had a Sidewinder joypad. I didn't play a huge amount of Wii (mostly just used it for exercise and Skyward Sword) but I played a ton of PS2 with two different controllers, mostly Final Fantasy 7, 8, 9 and X but also a bunch of Gran Turismo 2, THPS2, DMC and so many other games that I forget. It's PS2, there were so many good games.\n\nThe only time I've ever had to replace a controller was last year when my infant daughter drooled on a thumbstick and her drool nuked the logic board (I took it apart, I fix things for a living). I still have the spares which will come in handy if I do experience drift in future.\n\nI played a fuck ton of Xbox but only the OG and almost all of that was using the Duke controllers (yes, I liked them). Never had a single issue. Played the absolute shit out of the first two Halo games but also Splinter Cell, THPS2X, Fusion Frenzy and a ton of other games, most of which I imported from Canada because it was cheaper. \n\nYou can think I'm a liar but I'm not. Idk what to say, I've never had stick drift. I never abused my controllers either, so idk if those are related. I just play and don't have issues. I think I've had a sticky bumper before but I forget what controller that was, probably my X360 one. I used that for ages. Both of my PS2 controllers still work great but the thumbsticks have started to deteriorate, not the function, just the rubber on the outside.\n\nMy nunchucks are absolutely fucked though because they were stored in a closet that got water damaged.",
                                  "score": 1,
                                  "created_utc": 1735425261.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m49iwq6",
                      "author": "valryuu",
                      "body": "I've only ever had stick drift on the Switch Joycons, and I'm sure that's just because they do have an inherent design flaw from how their mechanism works compared to normal sticks.\n\nEverything else I've used though, PS1, 2, 3, 4,; Xbox 360, One; GC, Wii, Switch Pro, no problems at all.",
                      "score": 5,
                      "created_utc": 1735426190.0,
                      "replies": [
                        {
                          "id": "m49t51l",
                          "author": "TehOwn",
                          "body": "I've never owned a Switch, so perhaps that would end my streak. Hopefully they solve it with the sequel.",
                          "score": 1,
                          "created_utc": 1735429780.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m48t5xq",
                      "author": "TheStoicNihilist",
                      "body": "You probably wash your hands.",
                      "score": 3,
                      "created_utc": 1735417574.0,
                      "replies": [
                        {
                          "id": "m49raq7",
                          "author": "TehOwn",
                          "body": "That must be it. I am a bit OCD. Can't leave the bathroom without washing my hands. Must be something wrong with me.",
                          "score": 1,
                          "created_utc": 1735429135.0,
                          "replies": [
                            {
                              "id": "m4aezhr",
                              "author": "foreveraloneasianmen",
                              "body": "most stick drift dont come from food or debris.\n\nits about how often you rotate your stick. depends on the game.\n\nWear and tear.\n\n[https://www.youtube.com/watch?v=7qPNyio3VDk&t=161s](https://www.youtube.com/watch?v=7qPNyio3VDk&t=161s)",
                              "score": 2,
                              "created_utc": 1735437393.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m47vta3",
                  "author": "cleanerbot",
                  "body": "Some ps3 controllers actually had hall effect sticks.",
                  "score": 7,
                  "created_utc": 1735406701.0,
                  "replies": []
                },
                {
                  "id": "m47yne5",
                  "author": "Mindless-Product580",
                  "body": "I got the dual sense one and love it. Now, I don’t have stick drift per se, but the right one made a weird cracking noise and now it’s rough to move it in certain directions. Read this could be some kind of plastic o-ring. \n\n\nAll in all the controller is super premium but they really fucked up with however they designed the sticks. Best thing I love about them is the buttons are quiet as hell. I can actually play without waking up my partner. Something Xbox controllers struggled with since I’ve used one. (Xbox oneish)",
                  "score": 2,
                  "created_utc": 1735407628.0,
                  "replies": []
                },
                {
                  "id": "m48g3jp",
                  "author": "kruegerc184",
                  "body": "I have 3 sets of joycons and a pro controller and every single specific piece has stick drift.",
                  "score": 1,
                  "created_utc": 1735413270.0,
                  "replies": []
                },
                {
                  "id": "m48h6kv",
                  "author": "AfroSamuraii_",
                  "body": "You got really lucky with your joycons. I’ve had three sets, and two of the six total had gotten stick drift within a few months.",
                  "score": 1,
                  "created_utc": 1735413628.0,
                  "replies": []
                },
                {
                  "id": "m48mjvu",
                  "author": "TripleSecretSquirrel",
                  "body": "Maybe I’m just hard on joysticks, but the Xbox one controller I use for pc gaming very occasionally (cause I almost always use KBM), got stick drift after like 6 months! The PS1 controllers I got for Christmas back in like 1998 still work perfectly though.",
                  "score": 1,
                  "created_utc": 1735415381.0,
                  "replies": []
                },
                {
                  "id": "m48tugo",
                  "author": "Roboticpoultry",
                  "body": "My PS3 controller, also from 2010, is held together with tape after my brother lost the screws fixing the R2 trigger in like 2013. Fucking thing still holds a good charge and has no issues with the analog sticks, triggers or buttons",
                  "score": 1,
                  "created_utc": 1735417801.0,
                  "replies": []
                },
                {
                  "id": "m4945mm",
                  "author": "Zech08",
                  "body": "Same here... only issue is little black specks from the rubber/plastic degrading but everything works lol.",
                  "score": 1,
                  "created_utc": 1735421217.0,
                  "replies": []
                },
                {
                  "id": "m49eq7i",
                  "author": "Thefdt",
                  "body": "I’be never had stick drift on any console but ps5 two controls have succumbed",
                  "score": 1,
                  "created_utc": 1735424766.0,
                  "replies": []
                },
                {
                  "id": "m49rt8f",
                  "author": "BogdanPradatu",
                  "body": "I have 15 years old controllers like Saitek PS1000 or Logitech F710 that don't have stick drift. I mostly use chinese controllers now like Iine, RedDragon, GameSir or 8BitDo and never had stick drift issues.\n\nPS5 controller, though? A few months and it's fucking useless. Had to order hall effect sticks from aliexpress and replace the original ones.",
                  "score": 1,
                  "created_utc": 1735429312.0,
                  "replies": []
                },
                {
                  "id": "m49ymb2",
                  "author": "HerefortheFruitLoops",
                  "body": "Those ps5 controller batteries probably aren’t dead, at least not the case for me. The front charging port mini-usb (trigger side) stopped working on all of mine long ago. The back charging port (on either side of headphone jack) still works great. Snagged one of those charging docks and they charged up no prob. Maybe worth a shot.",
                  "score": 1,
                  "created_utc": 1735431667.0,
                  "replies": [
                    {
                      "id": "m4aby8s",
                      "author": "nightpop",
                      "body": "Appreciated, but the issue is that they charge but die within 30 minutes. I actually just replaced the battery today with a $15 battery from Amazon and it works, so that’s a relief.",
                      "score": 2,
                      "created_utc": 1735436277.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m4a2igy",
                  "author": "Denali_Nomad",
                  "body": "I've got a day one controller on my One X that, only thing that stopped working was a shoulder button 3yrs ago, I use xbox controllers for both console and PC gaming and have never had a stick drift issue ever thankfully.  Never needed a new 360 controller either.",
                  "score": 1,
                  "created_utc": 1735432972.0,
                  "replies": []
                },
                {
                  "id": "m4a9saf",
                  "author": "Higira",
                  "body": "Good job. I've bought 4 Xbox controllers. The first one lasted the longest at 10months and shortest was 6 months. Currently on the fourth lol. Can't believe the controllers only have like a month of warranty wtf",
                  "score": 1,
                  "created_utc": 1735435485.0,
                  "replies": []
                },
                {
                  "id": "m4e7hiu",
                  "author": "madebcus_ur_thatdumb",
                  "body": "Have my xbone controller I got with the advanced warfare bundle when it came out and it only has a little rubber deg",
                  "score": 1,
                  "created_utc": 1735498362.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m486kth",
              "author": "ciemnymetal",
              "body": "Xbox, playstation & switch all use really the exact same cheap potentiometers. Even if 1% of potentiometers produced are a bad/subpar batch, that's still a lot of bad units given the scale of production.\n\nE.g. xbox series x/s sold 30 million units. That's 60 million potentiometers. 1% is 600k bad units. Usually only one stick starts drifting so there are about 600k controllers with a bad potentiometer that will drift early. And since people are more likely to complain, you will more likely hear from the 600k people who have a drifting xbox controller. And if the parts have a higher failure rate, the number only goes up.\n\nNote: my numbers aren't meant to accurate, just to illustrate the scale that even 1% of subpar parts affect hundreds of thousands of people.",
              "score": 12,
              "created_utc": 1735410205.0,
              "replies": []
            },
            {
              "id": "m47snkx",
              "author": "FilthyUsedThrowaway",
              "body": "Exactly.  Same with all the complaints about the grips coming off elite controllers.  I bought one and then won one (with a Taco Bell Xbox) and neither have ever had that problem.",
              "score": 24,
              "created_utc": 1735405664.0,
              "replies": [
                {
                  "id": "m47vcb2",
                  "author": "Abba_Fiskbullar",
                  "body": "Different people have radically different skin pH. My pH destroys glues and some plastics. I have to use gloves to handle latex. I'm guessing this is why your elite controllers are fine.",
                  "score": 12,
                  "created_utc": 1735406546.0,
                  "replies": [
                    {
                      "id": "m47x3m9",
                      "author": "Southern_Pie6474",
                      "body": "I finally convinced my wife to play Stardew Valley on the Switch and I still had the white stock joy cons. Within days or week her nails have destroyed the thumb stick. Bought her some caps for the sticks. My nails never touched the thumb stick, but that was her natural way to maneuver them. I'm convinced some people are tougher on their hardware, that puts more stress on the device than others.",
                      "score": 15,
                      "created_utc": 1735407124.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m47xjo1",
                  "author": "Atomiclouch44",
                  "body": "I've suffered the grips coming off the elite controller, but to be honest I think it was sheer overuse and a slight lack of care that did it. After a few months it just became the \"main\" controller for me and my partner, and we'd use it for every game (even if the paddles weren't in use) and every app like YouTube & Disney+.\n\nAfter two years of use pretty much every day it started rapidly falling apart, and it sucks but I do think it's my own fault!",
                  "score": 1,
                  "created_utc": 1735407268.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m482gxt",
              "author": "ChaseballBat",
              "body": "Dude same. I have never gotten stuck drift on any controller in 25 years...\n\nFor people who have it with eer controller I genuinely want to know how and what games these people play, or how they store their controllers.",
              "score": 18,
              "created_utc": 1735408866.0,
              "replies": [
                {
                  "id": "m4871r7",
                  "author": "Mattdodge666",
                  "body": "FPS games can be pretty rough for stick drift, especially call of duty now with all the tactical sprint shit they introduced, I find myself being pretty hard on my left stick at times.\n\nMy L3 button went on the controller that came with my Xbox in like 6 months, I think that was a manufacturer defect, I ended up buying a scuff (which still uses Xbox sticks) and it recently developed awful stick drift after about 2 years of absolutely nothing, but I think that might be a motherboard issue because it's so extreme out of nowhere.\n\nThe only controller I can genuinely remember developing stick drift for sure was my PS3 controller.\n\nI went for a controller with hall effects sticks now and am currently loving it.",
                  "score": 6,
                  "created_utc": 1735410356.0,
                  "replies": [
                    {
                      "id": "m48br0g",
                      "author": "namon295",
                      "body": "This is why they really needed to put back buttons on all controllers to be the L3/R3 buttons when this started to be a thing.  It's insane that's really only a feature on high end expensive controllers still.",
                      "score": 3,
                      "created_utc": 1735411872.0,
                      "replies": []
                    },
                    {
                      "id": "m488fbf",
                      "author": "rafssimmons",
                      "body": "Exactly this, my xbox controller got stick drift pretty fast once I started playing COD, before I had never encountered it",
                      "score": 2,
                      "created_utc": 1735410798.0,
                      "replies": [
                        {
                          "id": "m4blhgr",
                          "author": "Lmoneyfresh",
                          "body": "Yup. I play apex a lot and I destroy controllers. It doesn't help that you're constantly sprinting with the circle mechanic.",
                          "score": 2,
                          "created_utc": 1735456045.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m48j989",
                      "author": "xurdm",
                      "body": "My left sticks got messed up often playing NHL games because you’d move with left stick and sprint with L3 while rotating it often. I don’t even use L3/R3 anymore. I got an elite controller and set the buttons behind the controller to replace them and honestly it feels better than clicking sticks",
                      "score": 1,
                      "created_utc": 1735414301.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m49bgy7",
                  "author": "RustyFJ80",
                  "body": "Two words: Hit Stick. lol only play football games and regardless of scenario I’m trying to take souls on that field, which results in me putting my full body weight behind that thumb stick flick.",
                  "score": 1,
                  "created_utc": 1735423652.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47wown",
              "author": "brapbrapcake",
              "body": "I’m going to ditto this. People are too hard on their controllers in general and I have to wonder if them being hard also causes drift.\n\nI’ve never had drift what so ever. I’ve had the same controllers that came with all their respective consoles and have purchased more only because I like a few paint jobs or limited editions. Not to mention the few I’ve purchased so I could spray paint some for customization’s sake.\n\nI work in retail and would have people returning Xbox controllers (mainly, not really any PS controllers) and the sticks would be pushed in to oblivion and/or be flat out broken and just spinning in place. \n\nThey would always say they play hard, but I would tell them, you don’t need to crush the controller, a light touch goes a long way. Or they need therapy.",
              "score": 18,
              "created_utc": 1735406991.0,
              "replies": [
                {
                  "id": "m4a5e6v",
                  "author": "foreveraloneasianmen",
                  "body": "It's a stick module which you use to rotate around , it supposed to function as it is.\n\nHow are you supposed to \"light touch\" the stick when you play games like sports game/ fortnite or COD where you constantly required to rotate the stick often for fast movement ? Unless you dont move your character often?\n\nIt also depends on the game you play .\n\nWatch this short and you know why, it just depends how often you rotate your stick especially on the same direction.  \n[https://www.youtube.com/shorts/QzAHXS6AGDA](https://www.youtube.com/shorts/QzAHXS6AGDA)",
                  "score": -1,
                  "created_utc": 1735433933.0,
                  "replies": [
                    {
                      "id": "m4ajm2y",
                      "author": "brapbrapcake",
                      "body": "Light touch as in just literally don’t crush the stick in for a click or don’t crush it in any one direction as if an analog stick were “more analog” and if you kept on pushing the stick to the circular edge it would make the stick “work better”. An analog stick only goes so far. You’d be surprised in retail how many people don’t know that.",
                      "score": 1,
                      "created_utc": 1735439129.0,
                      "replies": [
                        {
                          "id": "m4ajwwo",
                          "author": "foreveraloneasianmen",
                          "body": "nobody \"crush\" the analog stick, its a stick, how far can you push ?  \nWe are not superman xD.",
                          "score": 0,
                          "created_utc": 1735439244.0,
                          "replies": [
                            {
                              "id": "m4aljx6",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1735439869.0,
                              "replies": [
                                {
                                  "id": "m4am4af",
                                  "author": "foreveraloneasianmen",
                                  "body": "btw, i dont abuse my sticks, and 4 of my controller drift. your reply is just an assumption here.\n\ndo you know how hurt your thumb is if you keep aggressively push the sticks hard?\n\nBut then, im sure you dont believe me, just like the other users.\n\n\"you are getting stick drift because you are abusing your sticks, im sure of it\"\n\nif you watched the video, in the end it all depends on how often you rotate the sticks and wear off the potentiometer. Gently or abuse, the potentiometer moves the same its a mechanism.",
                                  "score": 3,
                                  "created_utc": 1735440084.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m47trgr",
              "author": "Really_McNamington",
              "body": "I think their component supply line got worse during COVID. Can't prove it ofc, but my old 360 controllers seem to go nearer 2 years before drifting became intolerable.",
              "score": 3,
              "created_utc": 1735406028.0,
              "replies": [
                {
                  "id": "m47vfka",
                  "author": "cleanerbot",
                  "body": "Old controllers have larger deadzones. The reason we see this big change in drift is because series and ps5 controllers have 0 deadzone. Meaning the old controllers had to drift alot more before it was noticeable. The new controllers drift from slightest problem in the potentiometers.\n\nEven though they all use the same kind of potentiometers this makes a big difference. Graphitepads are really bad and hopefully they all change to tmr or hall effect next gen.",
                  "score": 10,
                  "created_utc": 1735406576.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47y8vg",
              "author": "Joe_Van_Bob",
              "body": "It depends on the games you play. Call of duty vs sports games for example.",
              "score": 1,
              "created_utc": 1735407496.0,
              "replies": []
            },
            {
              "id": "m47zk5z",
              "author": "None",
              "body": "I've never had stick drift on a single controller my whole life and I'm 36 only controller I've ever had a problem with was recently my launch dual sense down d pad stopped working",
              "score": 1,
              "created_utc": 1735407924.0,
              "replies": []
            },
            {
              "id": "m4803sw",
              "author": "NeoNuatica",
              "body": "I was the same until I got the Series X, now every controller I touch gets stick drift, just outside of warranty.",
              "score": 1,
              "created_utc": 1735408098.0,
              "replies": []
            },
            {
              "id": "m4812wc",
              "author": "shifty_coder",
              "body": "\\#ragegamerissues",
              "score": 1,
              "created_utc": 1735408415.0,
              "replies": []
            },
            {
              "id": "m482a27",
              "author": "Anatharias",
              "body": "Two controllers, one after 2 years, the second one after two years… it’s like they have some kind of planned defect in place",
              "score": 1,
              "created_utc": 1735408805.0,
              "replies": []
            },
            {
              "id": "m482lm6",
              "author": "AlexHimself",
              "body": "I would get it after about a year when I was younger, but I was a professional gamer at one point. Otherwise, I think people like to blame \"stick drift\" on their poor skills.",
              "score": 1,
              "created_utc": 1735408909.0,
              "replies": []
            },
            {
              "id": "m482xeb",
              "author": "Grapes-RotMG",
              "body": "I have countless switch, ps5, and Xbox controllers. And I treat them all like a disturbed child treats animals (except limited ones of course). And I've never had stick drift.\n\nAt this point I WISH i could relate to people getting stick drift.",
              "score": 1,
              "created_utc": 1735409014.0,
              "replies": []
            },
            {
              "id": "m485wax",
              "author": "Sea-salt_ice_cream",
              "body": "Aye I’ve had my Series X since release and I’m still using the same controller with no issues, I think a lot of these people put their controllers through hell.",
              "score": 1,
              "created_utc": 1735409984.0,
              "replies": [
                {
                  "id": "m48fyrm",
                  "author": "Assdolf_Shitler",
                  "body": "I think the issue is with the elite controllers and not so much the stock ones. I am still using my day 1 controller and it's running like a champ. The elite controller that I got for christmas a few years ago, that thing stsrted stick drifting after about 4 months of use. Even the bumpers on the elite controller felt different from each other. The left one was clicky and the right one felt like mush.",
                  "score": 2,
                  "created_utc": 1735413228.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m488ejf",
              "author": "DavidLaBonita",
              "body": "I sure some of the problem is the way a lot of people play.  I got friends like play like they are trying to strangle a rabbit.",
              "score": 1,
              "created_utc": 1735410791.0,
              "replies": []
            },
            {
              "id": "m4893vy",
              "author": "raybreezer",
              "body": "I’ve never gotten stickdrift and I have all three current gen consoles and I’ve had every PlayStation. I don’t get why it happens so often to people.",
              "score": 1,
              "created_utc": 1735411016.0,
              "replies": []
            },
            {
              "id": "m489sy1",
              "author": "ProfessorPetrus",
              "body": "Do ya play competitive shooters? Do ya measure for stick drift sometimes?",
              "score": 1,
              "created_utc": 1735411244.0,
              "replies": [
                {
                  "id": "m48p7ds",
                  "author": "MobileVortex",
                  "body": "Yes and yes. My most played game on Xbox last year was Valorant and my highest rank was Diamond.",
                  "score": 1,
                  "created_utc": 1735416256.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48cea2",
              "author": "OneBadHarambe",
              "body": "Same here. I have used and abused about 20+ of them going back to the 360. No stick drift ever. stopped using the nintendo switch after the 4 pair went to hell.",
              "score": 1,
              "created_utc": 1735412077.0,
              "replies": []
            },
            {
              "id": "m48frof",
              "author": "Xrevitup360X",
              "body": "I have an original Xbox one controller that still has no stick drift, but my elite controller began getting stuck drifts a few months after I got it. I've had it sent out for repair over 15 times at this point and every time I get it back, it's still defective. While the regular controllers last a good long while, the elite controllers are complete garbage. Unless you get lucky and get one without issues.",
              "score": 1,
              "created_utc": 1735413163.0,
              "replies": []
            },
            {
              "id": "m48gi2z",
              "author": "Local-Butterfly-8120",
              "body": "“Ah, it’s never happened to me, so that means it’s not real!”",
              "score": 1,
              "created_utc": 1735413402.0,
              "replies": []
            },
            {
              "id": "m48gmvh",
              "author": "HeldnarRommar",
              "body": "Only one of mine did ever did and it was after my wife used it to play Hogwarts Legacy, I swear she pushes the sticks way too hard lol.",
              "score": 1,
              "created_utc": 1735413447.0,
              "replies": []
            },
            {
              "id": "m48hsvd",
              "author": "None",
              "body": "I’ve had my controller since the Xbox series s came out like week one and still not a single issue with my controller",
              "score": 1,
              "created_utc": 1735413829.0,
              "replies": []
            },
            {
              "id": "m48jtsl",
              "author": "None",
              "body": "I use an xbox controller with PC, but had several xboxes before this. I've always had some drift, except maybe on new controllers, but even my current elite v2 had drift from day 1. It's slight, easy enough to correct with deadzones. I'm not as sure about xbox, but on PC, I feel like most games have a deadzone set by default. Maybe that's why you haven't experienced it? Have you turned off deadzone in a game that lets you do so, and confirmed there is still no drift?",
              "score": 1,
              "created_utc": 1735414489.0,
              "replies": []
            },
            {
              "id": "m48kw9t",
              "author": "spyinthesky",
              "body": "It’s gotta be play style. All my fresh new bought ones or stock ones have no drift. All the ones I’ve bought second hand have drift",
              "score": 1,
              "created_utc": 1735414839.0,
              "replies": []
            },
            {
              "id": "m48n85f",
              "author": "ReticlyPoetic",
              "body": "Same but my Xbox hasn’t been turned on in 6 months.",
              "score": 1,
              "created_utc": 1735415603.0,
              "replies": []
            },
            {
              "id": "m48o18l",
              "author": "mixedd",
              "body": "I'm 50/50 here, as my stock controller that came with Series X is stick drift free since launch, but my Elite got drift after a year.",
              "score": 1,
              "created_utc": 1735415870.0,
              "replies": []
            },
            {
              "id": "m48rvjh",
              "author": "None",
              "body": "What kinds of games do you play?",
              "score": 1,
              "created_utc": 1735417145.0,
              "replies": []
            },
            {
              "id": "m48u5k8",
              "author": "BassheadGamer",
              "body": "My controllers last forever. My original PlayStation controllers work ALMOST flawlessly, aside from battery not lasting and my options button.    \nThe controller that came with my xb1 just died on me last year, and had to use the one that came with my X.    \nMy 360 controllers didn’t last a season.    \n\nI just tried 8bitdo controllers since they finally have a Hall effect Version for Xbox, I’m on my 3rd return of the more expensive one. Their cheaper one has given me zero issues.",
              "score": 1,
              "created_utc": 1735417902.0,
              "replies": []
            },
            {
              "id": "m4918au",
              "author": "dandroid126",
              "body": "Somehow I still have my day 1 joycons and still don't have stick drift, even though that seems to be the number one complaint about joycons.",
              "score": 1,
              "created_utc": 1735420239.0,
              "replies": []
            },
            {
              "id": "m493t8z",
              "author": "iBody",
              "body": "It’s the games you play. I can play a CRPG or similar for years on the same controller. I can get maybe 6 months out of a controller playing gears of war multiplayer, or COD. There’s a reason the controllers have a 3 month warranty and it isn’t because they’re designed to last a long time.",
              "score": 1,
              "created_utc": 1735421101.0,
              "replies": []
            },
            {
              "id": "m497u7f",
              "author": "PlagueDoc69",
              "body": "Playing video games 40 hours a week will wear out their controllers faster…",
              "score": 1,
              "created_utc": 1735422440.0,
              "replies": []
            },
            {
              "id": "m49a1p5",
              "author": "Mastermachetier",
              "body": "5 out of my last 6 Xbox controllers have had stick drift haha",
              "score": 1,
              "created_utc": 1735423172.0,
              "replies": []
            },
            {
              "id": "m49cuyr",
              "author": "Mean_Peen",
              "body": "You’re lucky. \n\nThis entire generation of game controllers have tons of issues with stick drift. Switch, PlayStation and Xbox controller issues have shot through the roof since the end of last gen.",
              "score": 1,
              "created_utc": 1735424128.0,
              "replies": []
            },
            {
              "id": "m49htv8",
              "author": "None",
              "body": "Some people also seem to burn through multiple controllers, meanwhile I have every controller I have ever owned going back to 1992, and I have never had stick drift. Even my launch edition Xbox one controller has none.",
              "score": 1,
              "created_utc": 1735425817.0,
              "replies": []
            },
            {
              "id": "m4a2527",
              "author": "Ghisteslohm",
              "body": "I would like to see games and hours played with statements like this. The other person could have played more hours in a month than you did in 5.\n\n\nIf I play Rocket League I feel like I am stresstesting my controllers with constant use of all buttons and rapid stick movement and flicks. On the other hand if I play a third person open world game I just hold the stick lightly in directions and tap some buttons. If you play turn based games or games without any time/stress component you might only use a few buttons and the dpad most of the time.\n\n\n\" I used a controller for 12 months\" can describe vastly different things.",
              "score": 1,
              "created_utc": 1735432849.0,
              "replies": []
            },
            {
              "id": "m4a3fas",
              "author": "JMJimmy",
              "body": "We're down to 1 working controller out of 4 between Xbox & PS5.  We went to checkout new contollers, not that we can afford them, the reviews were stickdrift out of the box.  Something has gone wrong, especially with PS5",
              "score": 1,
              "created_utc": 1735433286.0,
              "replies": []
            },
            {
              "id": "m4a4tz5",
              "author": "foreveraloneasianmen",
              "body": "There are a few reasons why .\n1. You don't play games often.\n2. You don't rotate the stick often.\n3. The game you are playing  is not really \"stick\" sensitive , certain games are very sensitive on stick deadzone like hitman 3 or ghost of Tsushima.\n\nXbox controllers using the same stick module like dualsense controller , all official controllers using the same ALPS stick module .",
              "score": 1,
              "created_utc": 1735433741.0,
              "replies": [
                {
                  "id": "m4a9ozl",
                  "author": "MobileVortex",
                  "body": "lol I have 582 hours of Valorant on Xbox this year...",
                  "score": 1,
                  "created_utc": 1735435452.0,
                  "replies": [
                    {
                      "id": "m4abvu0",
                      "author": "foreveraloneasianmen",
                      "body": "then you either lying, or you dont move your character often or the games you played are not very sensitive on stick deadzones.\n\nstick drift is not a myth, is not a user self created rumor or story.\n\nYou can search on google or youtube on this within 15 sec\n\nwatch this video if you are lazy to search, start from 2:40  \n[https://www.youtube.com/watch?v=7qPNyio3VDk&t=221s](https://www.youtube.com/watch?v=7qPNyio3VDk&t=221s)",
                      "score": 2,
                      "created_utc": 1735436252.0,
                      "replies": [
                        {
                          "id": "m4ae5zi",
                          "author": "MobileVortex",
                          "body": "who called it a myth? lol Your video further supports my point that most stick drift is due to how you handle your controller... \n\nYou act like it's not possible to prevent stick drift... And it is.",
                          "score": 1,
                          "created_utc": 1735437088.0,
                          "replies": [
                            {
                              "id": "m4aeg8m",
                              "author": "foreveraloneasianmen",
                              "body": "amazing, you ignored the other causes mentioned in the video...for some reason.\n\nDon't be ignorant next time,  please do not give the wrong advise to other people \"if you take care of your controller, you wont get stick drift\".\n\n\"what? your gaming PC GPU busted within 2 years? bro did you take care of your GPU properly?\"",
                              "score": 1,
                              "created_utc": 1735437193.0,
                              "replies": [
                                {
                                  "id": "m4af8vh",
                                  "author": "MobileVortex",
                                  "body": "lol you don't touch a GPU after you install it. What a pointless comparison. If you put your GPU in a good case with filters your GPU is going to last 10x longer then if you don't. The only one ignorant here is you. Take care of your stuff it lasts longer. That's all there is to it.",
                                  "score": 0,
                                  "created_utc": 1735437489.0,
                                  "replies": [
                                    {
                                      "id": "m4afmpx",
                                      "author": "foreveraloneasianmen",
                                      "body": "\"Take care of your stuff it lasts longer. \"\n\nSure, but not for stick drift.\n\nbut how do you \"take care\" of a stick which you are required to rotate?  \nDo you have some sort of unique thumb movement to rotate the stick? please teach me.",
                                      "score": 0,
                                      "created_utc": 1735437632.0,
                                      "replies": [
                                        {
                                          "id": "m4aft2z",
                                          "author": "MobileVortex",
                                          "body": "Don't press so hard. You seriously think everyone rotates and presses the stick the same? Like what are you going on about here? Please actually make a point...",
                                          "score": 0,
                                          "created_utc": 1735437699.0,
                                          "replies": [
                                            {
                                              "id": "m4agaww",
                                              "author": "foreveraloneasianmen",
                                              "body": "\"You seriously think everyone **rotates and presses the stick the same**\"\n\nWhen did i say that?\n\nwe are talking about rotation here.\n\nYou dont \"press\" your stick unless you are activating L3 or R3.\n\nNow you are accusing me randomly .",
                                              "score": 0,
                                              "created_utc": 1735437885.0,
                                              "replies": [
                                                {
                                                  "id": "m4agm9w",
                                                  "author": "MobileVortex",
                                                  "body": "Rotation and pressing both affect longevity... This is pointless. Have a great night.",
                                                  "score": 1,
                                                  "created_utc": 1735438005.0,
                                                  "replies": [
                                                    {
                                                      "id": "m4ah6de",
                                                      "author": "foreveraloneasianmen",
                                                      "body": "please watch the same video again once you cool down.  \n2:50 - 3:10\n\n[https://www.youtube.com/watch?v=7qPNyio3VDk&t=161s](https://www.youtube.com/watch?v=7qPNyio3VDk&t=161s)\n\nThis is wear and tear, you cant \"take care\" of it.",
                                                      "score": 0,
                                                      "created_utc": 1735438216.0,
                                                      "replies": [
                                                        {
                                                          "id": "m4ai9rh",
                                                          "author": "MobileVortex",
                                                          "body": "Sir / Madam... I understand how thumbsticks work. I have replaced quite a few of them over the years for friends who go ham on theirs.  Yes normal wear and tear can cause stick drift, but not pressing so hard on both the edges when rotating, or down when activating makes this happen significantly less. Pressing harder or sharper cause the wear and tear of the device as described in the video you linked.... The fact that you can watch this video and not understand that how you take care of your controller GREATLY affects how long it will last. This whole video is pointing that out and somehow you're not getting it lol.  If you are going through controllers all the time. The issue is somewhere between the thumbsticks and the chair.",
                                                          "score": 0,
                                                          "created_utc": 1735438623.0,
                                                          "replies": [
                                                            {
                                                              "id": "m4airw2",
                                                              "author": "foreveraloneasianmen",
                                                              "body": "please watch the video again, clearly, you didnt.  \nIt depends how often you game and the type of game.\n\nyou cant tell other people to game less , to \"take care\" of their controller stick.\n\nAnd can you please stop talking about \"pressing\" the stick? why do you keep talking about this? please stay in the topic. i didnt mention anything about \"pressing\" here.\n\nYou are accusing me here.",
                                                              "score": 1,
                                                              "created_utc": 1735438813.0,
                                                              "replies": [
                                                                {
                                                                  "id": "m4aiycy",
                                                                  "author": "MobileVortex",
                                                                  "body": "r/woosh\n\nWhy do you think the type of game matters?\n\nPress does not mean click. you have to press to move the joystick in any direction... lol",
                                                                  "score": 1,
                                                                  "created_utc": 1735438880.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "m4ajlh1",
                                                                      "author": "foreveraloneasianmen",
                                                                      "body": "are you stupid or pretend to be stupid?\n\nsome game use alot of dpad, some games use alot of stick rotation.\n\nDo you keep rotate your stick when you are playing a grid base CRPG?\n\nIm starting to think whether you are actually trolling here.",
                                                                      "score": 0,
                                                                      "created_utc": 1735439122.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "m4akerg",
                                                                          "author": "MobileVortex",
                                                                          "body": "dude you are so close to getting it. Keep trying. \n\n  \nGenerally, it's natural to 'press' 'move' 'rotate' more aggressively when playing say competitive shooters. Which is why playing these games can result in causing stick drift... \n\n  \nWhat I am saying is... It's possible to still play these games and not 'press' 'move' 'rotate' as hard as some people do and your controller will last longer. This is because it causes less friction within the thumbstick... as pointed out in the video you linked...\n\n  \nSome people grip their controller VERY hard when they are playing these types of games. You don't HAVE to do this. if you dont... your controller will last longer. \n\n  \nSeriously this is insane to me this is not obvious to you.",
                                                                          "score": 1,
                                                                          "created_utc": 1735439430.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "m4aks73",
                                                                              "author": "foreveraloneasianmen",
                                                                              "body": "how do you know whether that someone abuse their controller stick if their controller drift?\n\nYou have proof?\n\nI dont play COD or fortnite yet my controller drift, so..... are you assuming i abuse my controller now?\n\nBTw, you are basically agree what i said earlier. depends on the game you play.\n\n\"hi james, i know you are playing COD but could you err.......gently move your controller stick\"",
                                                                              "score": 1,
                                                                              "created_utc": 1735439574.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "m4akzhu",
                                                                                  "author": "MobileVortex",
                                                                                  "body": "If you go through more than 1 or 2 in a year... yes I would suspect that you misuse your controller.  It's not a big deal some people dont realize how strong they are.",
                                                                                  "score": 1,
                                                                                  "created_utc": 1735439651.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "m4alcqe",
                                                                                      "author": "foreveraloneasianmen",
                                                                                      "body": "no i dont.\n\nPlease dont assume things and accusing people to prove your point.\n\nAs i said, go google, and watch other videos. Those are professionally made videos, im not the one making it.\n\nIn the end its just depends how often you game and the type of game.",
                                                                                      "score": 1,
                                                                                      "created_utc": 1735439792.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "m4aln0d",
                                                                                          "author": "MobileVortex",
                                                                                          "body": "\"In the end its just depends how often you game and the type of game.\"\n\nThere are more factors than just this. These videos support my point. I think you are missing something here.",
                                                                                          "score": 1,
                                                                                          "created_utc": 1735439901.0,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "m4alxcf",
                                                                                              "author": "foreveraloneasianmen",
                                                                                              "body": "you cant tell people to rotate the stick gently or less.  \nthese sticks are supposed to work as intended.\n\nSo its wear and tear, depends on the usage, which i mentioned in my first reply, point 2.\n\n1. You don't rotate the stick often.",
                                                                                              "score": 0,
                                                                                              "created_utc": 1735440011.0,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "m4aopws",
                                                                                                  "author": "MobileVortex",
                                                                                                  "body": "lol i have 600 hours in Valorant with the same controller this year... You can use it a lot and still not develop stick drift. It depends on HOW you use it.",
                                                                                                  "score": 1,
                                                                                                  "created_utc": 1735441078.0,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "m4aowpw",
                                                                                                      "author": "foreveraloneasianmen",
                                                                                                      "body": "i personally believe valorant is not as \"aggresive\" compared to COD in terms of movement. its a slower pace game compared to COD right? now i think of it.\n\n\"You can use it a lot and still not develop stick drift. It depends on HOW you use it.\"\n\nSo it depends on the game.  \nAnd you cant tell other people \"please use your controller stick gently\", that doesnt make alot of sense, like how do you monitor/ gauge it lol?",
                                                                                                      "score": 1,
                                                                                                      "created_utc": 1735441150.0,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "m4arq82",
                                                                                                          "author": "MobileVortex",
                                                                                                          "body": "I also have like 200+ hours in COD lol",
                                                                                                          "score": 1,
                                                                                                          "created_utc": 1735442237.0,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "m4as4v9",
                                                                                                              "author": "foreveraloneasianmen",
                                                                                                              "body": "my point is, its nothing \"strange\" about people having stick drift within a year.\n\nYou dont know how they use their controller, assuming people abusing their controller just because they got stick drift before you do is not right.",
                                                                                                              "score": 1,
                                                                                                              "created_utc": 1735442397.0,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "m4at94q",
                                                                                                                  "author": "MobileVortex",
                                                                                                                  "body": "lol all I said is how you use your control does affect how long it works. Just plain common sense.\n\nWhatever helps you deal with your controller breaking. I'll keep using the same one for over 3 years now lol.",
                                                                                                                  "score": 1,
                                                                                                                  "created_utc": 1735442837.0,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "m4au7ny",
                                                                                                                      "author": "foreveraloneasianmen",
                                                                                                                      "body": "i doubt its going to last 3 years, unless you are blind, or  lying to me and you dont game often and use the sticks as often.\n\nAs i said, go watch the videos on youtube and educate yourself, im not sure why are you still arguing with me here.\n\nStick drift is more common than you think.\n\nIts fine if you are being ignorant here, i hope you dont do the same out there for your own good.\n\nImagine you are going for warranty exchange and the seller told you   \n\"hmmm weird, we dont receive this request often, did you abuse your item?\" i'm sure you'll upset.  \nThink of the other way around, nobody likes being accused here.",
                                                                                                                      "score": 0,
                                                                                                                      "created_utc": 1735443216.0,
                                                                                                                      "replies": [
                                                                                                                        {
                                                                                                                          "id": "m4awrl7",
                                                                                                                          "author": "MobileVortex",
                                                                                                                          "body": "This has to be a troll post lol.",
                                                                                                                          "score": 1,
                                                                                                                          "created_utc": 1735444244.0,
                                                                                                                          "replies": [
                                                                                                                            {
                                                                                                                              "id": "m4axwst",
                                                                                                                              "author": "foreveraloneasianmen",
                                                                                                                              "body": "yep, yours.  \nNow you know how ridiculous are your replies.",
                                                                                                                              "score": 0,
                                                                                                                              "created_utc": 1735444699.0,
                                                                                                                              "replies": [
                                                                                                                                {
                                                                                                                                  "id": "m4aydxv",
                                                                                                                                  "author": "MobileVortex",
                                                                                                                                  "body": "You missed the whole point of the videos you shared lol",
                                                                                                                                  "score": 1,
                                                                                                                                  "created_utc": 1735444889.0,
                                                                                                                                  "replies": [
                                                                                                                                    {
                                                                                                                                      "id": "m4az4qd",
                                                                                                                                      "author": "foreveraloneasianmen",
                                                                                                                                      "body": "First, you are talking about \"pressing\" stick, which i did not mention at all.\n\nThen, you assume i abuse my controller.\n\nNow, you are talking about \"you missed the whole point\"\n\nI hope this is not how you argue with a person in real life.\n\n\"you are wrong bro, you missed the whole point, im right\"",
                                                                                                                                      "score": 0,
                                                                                                                                      "created_utc": 1735445192.0,
                                                                                                                                      "replies": [
                                                                                                                                        {
                                                                                                                                          "id": "m4azolg",
                                                                                                                                          "author": "MobileVortex",
                                                                                                                                          "body": "Is English your first language?",
                                                                                                                                          "score": 1,
                                                                                                                                          "created_utc": 1735445417.0,
                                                                                                                                          "replies": [
                                                                                                                                            {
                                                                                                                                              "id": "m4azs9g",
                                                                                                                                              "author": "foreveraloneasianmen",
                                                                                                                                              "body": "you missed the whole point bro.",
                                                                                                                                              "score": 0,
                                                                                                                                              "created_utc": 1735445459.0,
                                                                                                                                              "replies": [
                                                                                                                                                {
                                                                                                                                                  "id": "m4b0cl1",
                                                                                                                                                  "author": "MobileVortex",
                                                                                                                                                  "body": "lol",
                                                                                                                                                  "score": 1,
                                                                                                                                                  "created_utc": 1735445691.0,
                                                                                                                                                  "replies": []
                                                                                                                                                }
                                                                                                                                              ]
                                                                                                                                            }
                                                                                                                                          ]
                                                                                                                                        }
                                                                                                                                      ]
                                                                                                                                    }
                                                                                                                                  ]
                                                                                                                                }
                                                                                                                              ]
                                                                                                                            }
                                                                                                                          ]
                                                                                                                        }
                                                                                                                      ]
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4a9reb",
              "author": "HeftyArgument",
              "body": "The only controller I’ve ever experienced stick drift on from memory is an N64 controller; it hasn’t even happened to my 4 year old nintendo switch joy cons.\n\nHonestly I think it’s just luck of the draw, which is the risk with potentiometer style joysticks",
              "score": 1,
              "created_utc": 1735435476.0,
              "replies": []
            },
            {
              "id": "m4aai6v",
              "author": "slickrasta",
              "body": "Some people are just rough on their electronics and don't realize. My friend holds my controllers so hard when he comes over I can hear them creak. So now he gets the old controller lol.",
              "score": 1,
              "created_utc": 1735435749.0,
              "replies": []
            },
            {
              "id": "m4bprfq",
              "author": "Deathwatch72",
              "body": "I still have the controller that was bundled with my launch edition One X and it has no drifting issues. Many many other issues but sticks work great lmao",
              "score": 1,
              "created_utc": 1735458622.0,
              "replies": []
            },
            {
              "id": "m4bsdly",
              "author": "Durahl",
              "body": "Well... Users not affected by Stick Drift will generally not rush to the Forums applauding how their stuff doesn't break so yeaa... 🤔 I'd also like to think if you break more than one Controller within a short time then perhaps the problem is not ( just ) with the device but the user 🤨\n\nThat being said... Despite not having any issues with my Elite Controllers I intend to not be buying any newer release unless they come with Hall Effect like Sticks - It would cost them like literally nothing to use them instead of Potentiometer based ones but it would solve pretty much anyone's woes 💢",
              "score": 1,
              "created_utc": 1735460262.0,
              "replies": []
            },
            {
              "id": "m4db248",
              "author": "None",
              "body": "I think it depends on what games you play often, COD and FIFA involve constantly pushing the left joystick in 1 direction. Platformers etc seem to have more varied movement on that joystick. I have my original dualsense that came with the console that has a bit of stick drift that I use for casual games and a black one I only use for story based games that’s got zero drift.",
              "score": 1,
              "created_utc": 1735488269.0,
              "replies": []
            },
            {
              "id": "m4ebw2u",
              "author": "darktotheknight",
              "body": "It really depends on what games you play. I played Tekken on DualShock and the D-Pad would break within 3 - 6 months. I was playing Mishimas, so it was quite heavy on directional inputs. The rubber/silicone was tearing and resulting in skipped inputs. Another common issue was Micro USB slot becoming loose pretty quickly (leading to disconnects while playing), due to us Tekken players always playing over cable for constant and less input delay.\n\n\nStick Drift on PlayStation and Xbox is mostly affecting Call of Duty/Ego Shooter players, who are wearing off the analogue stick.\n\n\nIf you're a casual gamer and only play from time to time, you probably will never notice any sort of issues with your controller.",
              "score": 1,
              "created_utc": 1735499677.0,
              "replies": [
                {
                  "id": "m4ejfqx",
                  "author": "MobileVortex",
                  "body": "I played 600 hours of Valorant this year and hundreds in other FPS's. Still do not have any issues.",
                  "score": 1,
                  "created_utc": 1735501968.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4f68ky",
              "author": "stillslightlyfrozen",
              "body": "I was the same, till it happened to me (3 years in). It’s so annoying and there really isn’t anything in the settings which would fix the issue (even though I personally feel like it is fixable. How hard can it be to code in new sensitivity levels system wide for a joystick??)",
              "score": 1,
              "created_utc": 1735508977.0,
              "replies": []
            },
            {
              "id": "m4gil39",
              "author": "-SPM-",
              "body": "Probably comes down to the games people play",
              "score": 1,
              "created_utc": 1735525274.0,
              "replies": []
            },
            {
              "id": "m4gk0ud",
              "author": "Realistic_Condition7",
              "body": "People be playing rocket league 12 hours a day and wonder why their controllers don’t last for 5 years.",
              "score": 1,
              "created_utc": 1735525797.0,
              "replies": []
            },
            {
              "id": "m4gqhm9",
              "author": "OneMoistMan",
              "body": "You must not play any souls games",
              "score": 1,
              "created_utc": 1735528166.0,
              "replies": []
            },
            {
              "id": "m47sotg",
              "author": "Hamuelin",
              "body": "There must be some real quality control issues. I wonder if it’s regional?\n\nEdit: why does this even get downvoted?? \n\nWe’re literally just discussing the very real phenomenon that some but not all Xbox controllers suffer stick drift…",
              "score": 4,
              "created_utc": 1735405675.0,
              "replies": [
                {
                  "id": "m47szqx",
                  "author": "DredZedPrime",
                  "body": "Might be partly quality control, but also with a good amount of rough use in there as well, since a lot of times the people complaining about major stick drift have it happen repeatedly.",
                  "score": 13,
                  "created_utc": 1735405774.0,
                  "replies": [
                    {
                      "id": "m47vmt0",
                      "author": "Seigmoraig",
                      "body": "I've had it happen repeatedly on my dualsense controllers but my Switch Pro that I got at launch hasn't had any issue. I'm not rough with my controllers either, I don't play any sports, fighting or other competitive games and barely any shooters, most of my play time is on rpg games but I went through 3 or 4 Dualsense controllers since 2020. It's so bad that I got a Dualsense Edge just so that I can hot swap the joysticks. I even had to send in the controller that came with the console because some buttons were stuck out of the box",
                      "score": 2,
                      "created_utc": 1735406642.0,
                      "replies": [
                        {
                          "id": "m47wlcs",
                          "author": "DredZedPrime",
                          "body": "See, I'm the opposite though,  I play quite a bit, and mostly pretty rough games. I've had my PS5 for a few years and only just recently started to notice the slightest bit of drift on my controller, and even then only where the game itself is very sensitive to it. \n\nI don't doubt that the PlayStation controllers are a bit more prone to getting drift than others, but I honestly don't see it being nearly as bad as most people try to say.",
                          "score": 2,
                          "created_utc": 1735406959.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m47tewp",
                      "author": "Old-Rhubarb-97",
                      "body": "It took over 5 years to happen with my Switch. Happened to ps5 within the first year.",
                      "score": 4,
                      "created_utc": 1735405913.0,
                      "replies": [
                        {
                          "id": "m47x5yz",
                          "author": "Loki-Holmes",
                          "body": "Similar with me. It took 3 years for my switch joycons to drift and it happened to the left and right almost at the same time. The dualsense that came with my PS5 started drifting after about a year and a half but the purple one I got a month or so after I got the ps5 is still fine. I had no issue with PS4 or PS3 controllers drifting.\n\nMy friend however had his left joycon drift about 6 months in but his right joycon has never had a problem. He also never had issues with any other controller but has only had a PS5 for a few months now.",
                          "score": 2,
                          "created_utc": 1735407145.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m47tfou",
                      "author": "Sroemr",
                      "body": "I've owned consoles since the SNES days, and never had stick drift until my Xbox anniversary controller got it. Probably should go about replacing the sticks, as it's just been collecting dust for a year now.",
                      "score": 2,
                      "created_utc": 1735405920.0,
                      "replies": [
                        {
                          "id": "m4819vv",
                          "author": "ye_olde_green_eyes",
                          "body": "First stick drift for me was with the Dual Shock 4. Happened with every controller I bought for that console after 6-12 months.",
                          "score": 3,
                          "created_utc": 1735408477.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m47tvul",
                  "author": "Soteria69",
                  "body": "My right bumper stopped working like a week after I got it, it was under warranty but I couldn't send it back since I'm not in the US, been using since 2019 like that didn't get stick drift though.",
                  "score": 2,
                  "created_utc": 1735406069.0,
                  "replies": []
                },
                {
                  "id": "m47ztjq",
                  "author": "bigjoe980",
                  "body": "ALPS sticks are inherently flawed for a multitude of reasons, biggest of which is they have absolutely no sealing between the actual pad and the housing, so dust and debris can (and will... dust likes to weasel into electronics) get in and scuff the pads.\n\nps5 controllers in particular have this nasty habit of rubbing off some of the inner plastic when you move it and have it pressed to click L3/R3 - theres these little like.. uh.. support ridges i guess id call them? they rub against the corners of the actual metal assembly of the stick housing\n\nsome of that plastic dust can fall down into the pads.\n\nnot even joking, biggest short term fix for stick drift without changing the design to hall effect would just be to quit putting critical game functions on fucking L3/R3 - granted that doesnt apply to switch joycons, but hey, those are ALPS too (all the major 1st party brands are!) so you can circle back to the inherent dust/debris issue.",
                  "score": 1,
                  "created_utc": 1735408007.0,
                  "replies": []
                },
                {
                  "id": "m47w6nj",
                  "author": "MobileVortex",
                  "body": "I believe it's more user based than anything. Some people really just press to hard on the thumb sticks.",
                  "score": 0,
                  "created_utc": 1735406824.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47t1xf",
              "author": "lucky_1979",
              "body": "My OG elite pad still going strong, yet people complaining about theirs breaking and failing after a relatively short time.",
              "score": 1,
              "created_utc": 1735405794.0,
              "replies": []
            },
            {
              "id": "m47x1xr",
              "author": "ChalupaBatmanBeyond",
              "body": "I’ve spent more on Xbox controllers than consoles. And I’ve had like 7 Xbox consoles.",
              "score": 1,
              "created_utc": 1735407108.0,
              "replies": [
                {
                  "id": "m47x6k8",
                  "author": "MobileVortex",
                  "body": "Oof what's the common denominator here?",
                  "score": 6,
                  "created_utc": 1735407151.0,
                  "replies": [
                    {
                      "id": "m480owr",
                      "author": "ChalupaBatmanBeyond",
                      "body": "They’re all Microsoft branded? Haha\n\nFor real though some of the last ones I’d put in a case after every use and put it up so my kids couldn’t use it. Still didn’t last.",
                      "score": 1,
                      "created_utc": 1735408289.0,
                      "replies": [
                        {
                          "id": "m4ahgsw",
                          "author": "MobileVortex",
                          "body": "haha you're the common denominator :P case doesn't matter if you are going ham on the thumbsticks when you play.",
                          "score": 1,
                          "created_utc": 1735438322.0,
                          "replies": [
                            {
                              "id": "m4ajrzp",
                              "author": "ChalupaBatmanBeyond",
                              "body": "I’d agree if I played liked I used to. But I rarely play. I’d play like 4 hours a week and that can happen. I don’t play any more. And back when I used to play and go ham those puppies would actually last",
                              "score": 1,
                              "created_utc": 1735439191.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m47vz6q",
              "author": "BloodSteyn",
              "body": "Same, I have some old 360's that don't even have drift.\n\nThen there is my nephew, stick drift after 12 months.\n\nIt's down to how hard you play... but I ordered some Hall Effect sticks to fix his controller for him.",
              "score": 1,
              "created_utc": 1735406756.0,
              "replies": []
            },
            {
              "id": "m47wvox",
              "author": "gummyworm21_",
              "body": "Same.",
              "score": 1,
              "created_utc": 1735407052.0,
              "replies": []
            },
            {
              "id": "m4844ja",
              "author": "_IratePirate_",
              "body": "Idk if Xbox uses Hall Effect thumb sticks, but in case you aren’t aware, there is a technology created that effectively puts an end to stick drift (Hall Effect)\n\nSony and Nintendo refuse to put them in their controllers despite this technology being older than the PS5 and Switch. This is probably because less people would be spending money on replacement controllers if they remedied this issue.",
              "score": 1,
              "created_utc": 1735409410.0,
              "replies": [
                {
                  "id": "m48dxud",
                  "author": "_BannedAcctSpeedrun_",
                  "body": "I don’t think any console comes standard with them yet but I just bought a 3rd party Xbox controller with hall effect sticks and two back paddles for about $40.",
                  "score": 1,
                  "created_utc": 1735412571.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4apzdx",
              "author": "Maleficent-Water8763",
              "body": "You aren’t gaming hard enough then my friend",
              "score": 0,
              "created_utc": 1735441559.0,
              "replies": []
            },
            {
              "id": "m4biqwk",
              "author": "Due-Cup-729",
              "body": "Me neither. It’s because I never play mine because Xbox has no games",
              "score": 0,
              "created_utc": 1735454509.0,
              "replies": []
            },
            {
              "id": "m47yb7n",
              "author": "None",
              "body": "[deleted]",
              "score": -4,
              "created_utc": 1735407517.0,
              "replies": [
                {
                  "id": "m47ypm4",
                  "author": "MobileVortex",
                  "body": "I game 50hrs a week easy with no issues. It's really hard to believe this.",
                  "score": 6,
                  "created_utc": 1735407648.0,
                  "replies": [
                    {
                      "id": "m480jrd",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1735408243.0,
                      "replies": [
                        {
                          "id": "m48pb2s",
                          "author": "MobileVortex",
                          "body": "I believe you exchanged that many times I don't believe they were DOA.",
                          "score": 0,
                          "created_utc": 1735416291.0,
                          "replies": [
                            {
                              "id": "m4bn6u2",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 0,
                              "created_utc": 1735457051.0,
                              "replies": [
                                {
                                  "id": "m4cvt1w",
                                  "author": "MobileVortex",
                                  "body": "lol",
                                  "score": 0,
                                  "created_utc": 1735482786.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m47vyrs",
          "author": "SQUIDWARD360",
          "body": "Mine is good. Had it for years",
          "score": 8,
          "created_utc": 1735406752.0,
          "replies": []
        },
        {
          "id": "m485oa0",
          "author": "Mr_MAlvarez",
          "body": "I’ve never had stick drift, but both of my controllers LT’s are sticking, which is extremely annoying.",
          "score": 4,
          "created_utc": 1735409912.0,
          "replies": []
        },
        {
          "id": "m47wb84",
          "author": "SolidOshawott",
          "body": "Xbox controllers are the most reliable of the big three in that department already.",
          "score": 32,
          "created_utc": 1735406867.0,
          "replies": [
            {
              "id": "m47z6eq",
              "author": "bakerzdosen",
              "body": "Yeah, as someone who has never owned a Microsoft hardware product (and software is limited to older versions of Office for Mac), I literally thought this comment was about PlayStation/Dualsense controllers.\n\nI can’t count the number of PS3 controllers we went through. The PS4 ones were seemingly better, but I’m already on my 2nd PS5 controller due to drift issues.",
              "score": 19,
              "created_utc": 1735407800.0,
              "replies": []
            },
            {
              "id": "m48b3ln",
              "author": "VietOne",
              "body": "I repair controllers in my area, the Seattle area, Xbox controllers are easily 2/3rd of the volume I fix with drift issues.",
              "score": 5,
              "created_utc": 1735411664.0,
              "replies": [
                {
                  "id": "m4a2mrf",
                  "author": "Thathappenedearlier",
                  "body": "That’s gotta be a local population thing, statistically joycons are way worse",
                  "score": 2,
                  "created_utc": 1735433015.0,
                  "replies": [
                    {
                      "id": "m4a8o9f",
                      "author": "VietOne",
                      "body": "Sure but Nintendo fixes them for free.",
                      "score": 0,
                      "created_utc": 1735435080.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m4b29dz",
              "author": "SkaBonez",
              "body": "Sony and Microsoft use the same sticks in their controllers, the Alps RKJXV.\n\nIf you want markedly more reliability, then you need to replace the sticks with Hall effect sticks or buy a new controller that already has them.",
              "score": 1,
              "created_utc": 1735446501.0,
              "replies": []
            },
            {
              "id": "m484r4g",
              "author": "wrathmont",
              "body": "Big three? More like “big two and Xbox”",
              "score": -4,
              "created_utc": 1735409614.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m47q0sc",
          "author": "m0stly_toast",
          "body": "That’ll be $300 for no reason even though you can buy perfectly good Hal stick controllers for like $50",
          "score": 17,
          "created_utc": 1735404793.0,
          "replies": [
            {
              "id": "m47tyoy",
              "author": "Really_McNamington",
              "body": "I just invested in a Hall effect wired controller to try and get a better longevity. We shall see.",
              "score": 2,
              "created_utc": 1735406095.0,
              "replies": [
                {
                  "id": "m47vpnd",
                  "author": "RedComet313",
                  "body": "I use the wired GameSir ones off of Amazon. The only issue I’ve ever had was dropping one right on its sticks after countless months where I’m sure it’s fallen before. But for the price and the fact that they have two buttons on the back, you can’t beat ‘em!",
                  "score": 1,
                  "created_utc": 1735406668.0,
                  "replies": []
                },
                {
                  "id": "m481w24",
                  "author": "Tovar42",
                  "body": "any brand recommendations for this? I dont want to find a cheap chineese knockoff by accident",
                  "score": 1,
                  "created_utc": 1735408679.0,
                  "replies": [
                    {
                      "id": "m4890vb",
                      "author": "Really_McNamington",
                      "body": "The one I have is by [8BitDo](https://shop.8bitdo.com/products/8bitdo-ultimate-wired-controller-for-xbox-and-windows). Reviews seem pretty decent but I haven't had it long enough to tell you more than that. I think I got it recommended in r/gaming but don't quote me on that.",
                      "score": 3,
                      "created_utc": 1735410989.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m49azv7",
              "author": "Eurynom0s",
              "body": "The Hall sensor stick itself is probably like a dollar extra per controller, if that. Although as other people said Xbox controllers are actually pretty reliable despite not having Hall sensors.",
              "score": 1,
              "created_utc": 1735423493.0,
              "replies": [
                {
                  "id": "m49dwd0",
                  "author": "m0stly_toast",
                  "body": "I’ve always liked Xbox controllers and the ones for the series consoles are extremely solid. That being said they’re extremely unremarkable, it’s like the ultimate “stock” controller, and you can definitely do better for around the same price. \n\nMore than anything though, their elite controllers are the ones that are insulting. Horribly over.priced and horribly unreliable, and they don’t even perform well. Just about any good controller that’s half its price blows the elite controller out of the water, but knowing Microsoft I know that a non-dogshit version of the elite controller would probably cost an extra $100 somehow because at the price of the elite it’s not even good to begin with",
                  "score": 1,
                  "created_utc": 1735424485.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47vahw",
              "author": "None",
              "body": "[deleted]",
              "score": -2,
              "created_utc": 1735406529.0,
              "replies": [
                {
                  "id": "m47vkzo",
                  "author": "smulfragPL",
                  "body": "But much less of it. The only part that can break is the recentering spring",
                  "score": 10,
                  "created_utc": 1735406626.0,
                  "replies": [
                    {
                      "id": "m47xs9e",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -5,
                      "created_utc": 1735407346.0,
                      "replies": [
                        {
                          "id": "m47y0b2",
                          "author": "smulfragPL",
                          "body": "Those are Just bad Controllers then. I havent heard of the kk3 having issues like this",
                          "score": 11,
                          "created_utc": 1735407420.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m48fqtn",
          "author": "TheSavouryRain",
          "body": "My controllers don't get stick drift, but I don't own an Xbox One/Series X controller where the bumpers don't break. That goes for both versions of the elites as well.",
          "score": 2,
          "created_utc": 1735413155.0,
          "replies": [
            {
              "id": "m48i6vy",
              "author": "Really_McNamington",
              "body": "Those bumper repair kits are actually pretty good. Shouldn't need them but they do work OK.",
              "score": 1,
              "created_utc": 1735413955.0,
              "replies": [
                {
                  "id": "m48vvli",
                  "author": "TheSavouryRain",
                  "body": "Yeah, I've done the repair a couple times now. It just pisses me off that even the elites have bumper problems",
                  "score": 1,
                  "created_utc": 1735418471.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m4elxu6",
          "author": "ernyc3777",
          "body": "I got all the luck with Xbox controllers and none of the luck with Switch controllers. \n\nI legitimately can’t recall having gotten stick drift from an Xbox controller but seem to take joycons out of the box with drift.",
          "score": 2,
          "created_utc": 1735502734.0,
          "replies": []
        },
        {
          "id": "m48de0b",
          "author": "bossmt_2",
          "body": "Yeah, my 360 controllers were beasts. By ones that came with the XBONE all have broken.",
          "score": 1,
          "created_utc": 1735412396.0,
          "replies": [
            {
              "id": "m49bppx",
              "author": "Eurynom0s",
              "body": "Main reason I replaced my wired 360 controller were the joystick rubber padding was falling off and by the time that started you couldn't get a new 360 controller anymore, wireless or otherwise. Got the thing in high school and was using it until years after grad school.",
              "score": 1,
              "created_utc": 1735423736.0,
              "replies": [
                {
                  "id": "m49enzb",
                  "author": "bossmt_2",
                  "body": "I mistakenly traded 2 of mine in. Still kind of salty because I was firm believer in the convenience of the recharable battery. Fuck me though. XBONE controller, and no more exclusives (I have a gaming PC) is why I got a PS5.",
                  "score": 1,
                  "created_utc": 1735424746.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48i7sg",
          "author": "Symbiot3_Venom",
          "body": "It’s not in their best interest to solve stick drift issues. Broken controllers = more money for them",
          "score": 1,
          "created_utc": 1735413963.0,
          "replies": []
        },
        {
          "id": "m48k1zd",
          "author": "BaronVonSlipnslappin",
          "body": "… or squeak when you hold it and give off loud clacking noises in use like a cheap child’s toy",
          "score": 1,
          "created_utc": 1735414563.0,
          "replies": []
        },
        {
          "id": "m48mu02",
          "author": "Adventurous-Depth984",
          "body": "That’s by design. My original PS1 controllers still work with no drift",
          "score": 1,
          "created_utc": 1735415473.0,
          "replies": []
        },
        {
          "id": "m48ni8b",
          "author": "hiricinee",
          "body": "Hall effect controllers, unfortunately no one but 3rd party wants to make them.",
          "score": 1,
          "created_utc": 1735415695.0,
          "replies": [
            {
              "id": "m48po25",
              "author": "Really_McNamington",
              "body": "The ones on my Dreamcast are still working.",
              "score": 1,
              "created_utc": 1735416410.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m48oy2b",
          "author": "ROM883",
          "body": "They have gone a bit far with the planned obsolescence.",
          "score": 1,
          "created_utc": 1735416171.0,
          "replies": []
        },
        {
          "id": "m48z6w8",
          "author": "PrblyMy3rdAltIDK",
          "body": "I’ve been running with the same Xbox controller for 10 years. I had two, but one died after 6 years because I dropped it on tile and the body broke. Put thousands of hours on them between Xbox and PC and never experienced any drift. The six year one had a sticky B for a bit but I was able to clean it and never had the issue again.\n\nI don’t ever plan to buy another Xbox, but I will almost definitely buy Xbox controllers for PC gaming once ol’ trusty kicks the bucket.",
          "score": 1,
          "created_utc": 1735419560.0,
          "replies": []
        },
        {
          "id": "m49924r",
          "author": "MinusBear",
          "body": "Sho, I think of the six Xbox One and Xbox Series controllers I have only one ever got stick drift. And it put in a solid 4 years before that happened. Thinking of my 360 controllers, and I had a few of those, never had this. My Switch on the other hand waited till it was just out of warranty.",
          "score": 1,
          "created_utc": 1735422847.0,
          "replies": []
        },
        {
          "id": "m49cq3m",
          "author": "mister_newbie",
          "body": "There should be no excuse for new pads to not use Hall Effect (or, better, TMR) sticks",
          "score": 1,
          "created_utc": 1735424082.0,
          "replies": []
        },
        {
          "id": "m49n0h8",
          "author": "CBalsagna",
          "body": "My work around has been to get the elite series and bind the joystick click to something else. I have not had one single problem with drift in years.  This isn’t hyperbole.  I think, in the heat of game play that it’s very harsh on the joysticks over time.  I mean I’m fucking smashing that joystick during, say, halo infinite.\n\nIt’s worked for me really well.  I know it’s dumb and doesn’t solve the problem but it’s a solution that worked with more money applied to the problem",
          "score": 1,
          "created_utc": 1735427640.0,
          "replies": []
        },
        {
          "id": "m49q5iz",
          "author": "sargonas",
          "body": "Xbox, ps, switch… I’ve had multiples of every one over the years and not once have I ever had any stick drift. I truly believe it happens but I’m struggling to relate to the communities perceived frequency of it.",
          "score": 1,
          "created_utc": 1735428735.0,
          "replies": []
        },
        {
          "id": "m49tdzz",
          "author": "Kuli24",
          "body": "I'll just take one that's easier to clean to fix stick drift.  I NEVER do xbox controllers, but ps4 and ps5 controllers are easy to fix.",
          "score": 1,
          "created_utc": 1735429867.0,
          "replies": []
        },
        {
          "id": "m4aav7z",
          "author": "SpicyNuggs4Lyfe",
          "body": "I'm curious how people get these all the time. I've had 1 out of the 8 Xbox One/Series X controllers I've owned get stick drift. That's since 2013 when Xbox One came out.",
          "score": 1,
          "created_utc": 1735435882.0,
          "replies": []
        },
        {
          "id": "m4acjiy",
          "author": "PerformanceOk3885",
          "body": "Are you talking about PS or XBOX?? I have 3 Xbox controllers that I have been using daily for YEARS and there’s not a sliver of stick drift on them. Same with my friend, he’s still using his original Xbox one controller and it’s going strong.",
          "score": 1,
          "created_utc": 1735436493.0,
          "replies": []
        },
        {
          "id": "m4aclcu",
          "author": "Abtun",
          "body": "Me with my quest 2 controllers",
          "score": 1,
          "created_utc": 1735436512.0,
          "replies": []
        },
        {
          "id": "m4ai5n3",
          "author": "nuclearwinterxxx",
          "body": "Ha! I just commented almost the exact same thing, but it was worded differently and 9 hours later than yours.",
          "score": 1,
          "created_utc": 1735438579.0,
          "replies": []
        },
        {
          "id": "m4akgvr",
          "author": "bitNine",
          "body": "I’ve had controllers that never drift after years and had controllers that drift brand new out of the box. It’s all about the quality of the individual components within.",
          "score": 1,
          "created_utc": 1735439453.0,
          "replies": []
        },
        {
          "id": "m4bg781",
          "author": "C10ckw0rks",
          "body": "Fucking fix where the d pad is too. That positioning only works on the switch because it’s directly below the thumb. Some of my old games are unplayable, shit some of my new games are annoying to play. The D-pad is in Cozumel Mexico while my joystick is in Vancouver Canada. I hate it. Even the DREAMCAST of all things understood good D pad placement and that controller was as hefty as an og xbox controller",
          "score": 1,
          "created_utc": 1735453125.0,
          "replies": []
        },
        {
          "id": "m4bjih8",
          "author": "SpiritLBC",
          "body": "It's very easy nowadays to swap to hall effect ones. I did it on my DS after it started drifting. Though the cap is kinda bugging me as it feels much cheaper.",
          "score": 1,
          "created_utc": 1735454931.0,
          "replies": [
            {
              "id": "m4bqbc8",
              "author": "Really_McNamington",
              "body": "Going to require more soldering than I'm entirely comfortable with. That said, the busted ones are not going to work any less if I use them to learn on.",
              "score": 1,
              "created_utc": 1735458965.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4bz6y2",
          "author": "Roo-90",
          "body": "Fucking elite controllers. They would be so GOOD if they weren't so fucking shitly built",
          "score": 1,
          "created_utc": 1735464714.0,
          "replies": []
        },
        {
          "id": "m4c3z9a",
          "author": "Timmar92",
          "body": "my xbox one controller I have for pc is 6 years old, one stick doesn't even have any rubber left and I still have zero issues with it haha, I have been lucky because I have never experienced stick drift in ever and I'm 32.",
          "score": 1,
          "created_utc": 1735467861.0,
          "replies": []
        },
        {
          "id": "m4ce2mz",
          "author": "Miserable-Bear7980",
          "body": "keep dreaming",
          "score": 1,
          "created_utc": 1735474235.0,
          "replies": []
        },
        {
          "id": "m48a5ad",
          "author": "cluckay",
          "body": "Or bumpers breaking within weeks",
          "score": 1,
          "created_utc": 1735411355.0,
          "replies": [
            {
              "id": "m48hveb",
              "author": "Really_McNamington",
              "body": "Yeah, I've had that too, but at least those are a pretty easy fix and don't require soldering skills I don't have.",
              "score": 1,
              "created_utc": 1735413851.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m47t8mt",
          "author": "jlaine",
          "body": "Now now, peripherals with functional deficiencies make for an excellent cash cow.",
          "score": -1,
          "created_utc": 1735405855.0,
          "replies": [
            {
              "id": "m47y4r2",
              "author": "hwmchwdwdawdchkchk",
              "body": "Fucking right, I have four controllers for my playstation now, 2 work correctly as they are new, the other two back for second repair in jan",
              "score": 2,
              "created_utc": 1735407460.0,
              "replies": [
                {
                  "id": "m48760d",
                  "author": "jlaine",
                  "body": "I'd love to say it's because I 'play too hard' - but I'm old & slow and the heaviest crap I play these days is usually Tetris. I've found a second life with some of them by using them on PC, since you can use software to adjust for the drift in the controller itself, if that's any help.",
                  "score": 1,
                  "created_utc": 1735410394.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48o15m",
          "author": "upyourskneegrow",
          "body": "I've had 5 Ds4 controllers, never had stick drift issues but all of them have trigger issues. Random presses constantly for no reason.",
          "score": 0,
          "created_utc": 1735415869.0,
          "replies": []
        },
        {
          "id": "m49t81y",
          "author": "Sevallis",
          "body": "This! I've got two in my office that have this problem.",
          "score": 0,
          "created_utc": 1735429810.0,
          "replies": []
        },
        {
          "id": "m4ab4p3",
          "author": "None",
          "body": "Wtf are you all doing to the controllers. I have owned every single console starting from nintendo. & i mean all of them. & i have NEVER gotten stick drift EVER",
          "score": 0,
          "created_utc": 1735435977.0,
          "replies": [
            {
              "id": "m4bdpax",
              "author": "Really_McNamington",
              "body": "Normal play, fairly heavy use. But the failure rate is since series X. My old 360 controllers would last a couple of years before any issues..",
              "score": 1,
              "created_utc": 1735451821.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m48azq5",
          "author": "1234pinkbanana",
          "body": "There’s an easy fix to this. Only buy PlayStation in future.",
          "score": -2,
          "created_utc": 1735411629.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48gxyh",
      "author": "ReflxFighter",
      "body": "Now they just need to add gyro and standardize it as an input method like every other controller",
      "score": 40,
      "created_utc": 1735413549.0,
      "replies": [
        {
          "id": "m4a2qtv",
          "author": "hauser255",
          "body": "Nintendo was so far ahead of the curve with gyro aiming in Splatoon. Now it's the only way my partner and son play in Fortnite on Switch and PS5.",
          "score": 11,
          "created_utc": 1735433054.0,
          "replies": [
            {
              "id": "m4bgx1w",
              "author": "Athen65",
              "body": "And then Valve with stick flick on the Steam Deck. Best way to play any shooter on a controller",
              "score": 3,
              "created_utc": 1735453504.0,
              "replies": [
                {
                  "id": "m4fqav7",
                  "author": "FrenchTouch42",
                  "body": "can you explain more? Confused 😅",
                  "score": 1,
                  "created_utc": 1735515497.0,
                  "replies": [
                    {
                      "id": "m4g4sjb",
                      "author": "Athen65",
                      "body": "The appeal of mouse and keyboard is the 1:1 input for aiming provided by the mouse, plus the ability to perform both precise and broad movements (precise aiming and doing a 180). Gyroscope is a 1:1 input modality, but it only allows for precise aiming, not comfortably doing 180s. \n\nFlick stick makes up for this lack of comfortable 180s by treating the right joystick as a sort of compass. North is where the player is currently looking. Tap north (forward) on the right joystick and nothing happens. South is 180 degrees behind the player. Tap south and the player turns 180 degrees (and this is now the new North). You can also rotate the stick in a circle to keep turning.\n\nThe Team Fortress 2 player SolarLight made a great video on the subject which can be found [here](https://www.youtube.com/watch?v=PJIqEX93vL8)",
                      "score": 3,
                      "created_utc": 1735520362.0,
                      "replies": [
                        {
                          "id": "m4g83rf",
                          "author": "FrenchTouch42",
                          "body": "Thank you for sharing!",
                          "score": 2,
                          "created_utc": 1735521535.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m47q8xw",
      "author": "GreatnessToTheMoon",
      "body": "Make an Elite Controller that doesn’t break within a month too please",
      "score": 241,
      "created_utc": 1735404867.0,
      "replies": [
        {
          "id": "m47uutv",
          "author": "None",
          "body": "[deleted]",
          "score": 94,
          "created_utc": 1735406387.0,
          "replies": [
            {
              "id": "m47y8so",
              "author": "Express_Helicopter93",
              "body": "The truly funny aspect is how well known this is. Every one of my friends that owns an Xbox refuses to buy an elite simply because of their reputation. \n\nMicrosoft just makes crappy things now. Been this way for a bit.",
              "score": 37,
              "created_utc": 1735407496.0,
              "replies": [
                {
                  "id": "m49etk0",
                  "author": "DDisired",
                  "body": "And it's sad because I'm at the point in life where I Want to drop up to $200 for the perfect controller, only to find out the one I was interested in had so many issues. It's costing them money at this point.",
                  "score": 1,
                  "created_utc": 1735424796.0,
                  "replies": []
                },
                {
                  "id": "m4ec9kt",
                  "author": "Retro-Lemunz",
                  "body": "It seems to be super hit or miss, ive had my elite series 2 for a bit over 2 years now with absolutely zero problems",
                  "score": 1,
                  "created_utc": 1735499789.0,
                  "replies": []
                },
                {
                  "id": "m499nxn",
                  "author": "MinusBear",
                  "body": "This is why I just use the Armor-X Pro attachment on a regular controller to get back padels. Two of the four paddles aren't quite as ideally placed as they are on the Elite. But at a fraction of the cost you make do.",
                  "score": 0,
                  "created_utc": 1735423045.0,
                  "replies": []
                },
                {
                  "id": "m49c7xo",
                  "author": "Eurynom0s",
                  "body": "And now they're doing the Elite Core where apparently even the nonfunctional parts are even flimsier plastic now.\n\nThey also stuck the original, not sure about the Core, with a pretty shitty rechargeable battery. Rechargeable is nice I guess but I'll take a AA battery compartment over a shitty nonremovable rechargeable.",
                  "score": 0,
                  "created_utc": 1735423909.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48bdhb",
              "author": "KaiKamakasi",
              "body": "I disagree, and I say this after having an Elite 2 that fucking disintegrated in 8 months...\n\nBought a series X and I killed the left stick of the included controller within a month doing a melee challenge on Cod.... All I did was click it on each spawn",
              "score": 5,
              "created_utc": 1735411752.0,
              "replies": [
                {
                  "id": "m48guv1",
                  "author": "None",
                  "body": "This is why I use the back paddles on the higher end model controllers for the stick click. The stick click button is what causes drift.",
                  "score": 8,
                  "created_utc": 1735413520.0,
                  "replies": [
                    {
                      "id": "m4beuly",
                      "author": "shibbitydibbity",
                      "body": "This would explain why I have never seen this issue. I exclusively used an elite and now a series 2 controller since like 2018. I have never had stick drift. But I also never click the sticks and always bind those to the back paddles. Clicking the sticks feels so unnatural to me. Also RMGesus. But yea",
                      "score": 1,
                      "created_utc": 1735452415.0,
                      "replies": []
                    },
                    {
                      "id": "m4bzhe9",
                      "author": "KaiKamakasi",
                      "body": "Can't say I've experienced any stick drift, ever actually, though strictly speaking it's not the click that causes it, it's wear and tear on the potentiometer which is caused by *any* action that moves the stick, stick drift is just one of those things that can happen within months or it takes years and years but it will happen eventually unless you have halleffect",
                      "score": 1,
                      "created_utc": 1735464905.0,
                      "replies": []
                    },
                    {
                      "id": "m4c42wc",
                      "author": "somebozo",
                      "body": "Those back paddles on my Elite series 2 got real unresponsive real quick though.  Dogshit controller!",
                      "score": 1,
                      "created_utc": 1735467928.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m48mqoh",
              "author": "Deadlymonkey",
              "body": "I hate how true this is. \n\nI have a project Scorpio Xbox that I bought new and have gone through 3 elite controllers while the project Scorpio controller is still fine. I do/did use the elite controllers more than the regular one, but the latest elite controller effectively died after 6 months of being in my closet.",
              "score": 1,
              "created_utc": 1735415443.0,
              "replies": []
            },
            {
              "id": "m49470f",
              "author": "iBody",
              "body": "I remember the reveal trainer showing how they built and tested it to be even more durable. I proceeded to burn through so many that Best Buy would no longer honor my extended warranty.",
              "score": 1,
              "created_utc": 1735421230.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m47rdto",
          "author": "technoph0be",
          "body": "Seriously, this.  I bought two Elite controllers thinking they'd be 10+ year devices (like the original XBOX controllers were).  Two months in it was just... what the fuck.  And for them to claim zero actual responsibility?  Fuck Microsoft now and forever.",
          "score": 12,
          "created_utc": 1735405241.0,
          "replies": [
            {
              "id": "m47t8ur",
              "author": "herrbz",
              "body": "Mine's 10 years old.",
              "score": -15,
              "created_utc": 1735405857.0,
              "replies": [
                {
                  "id": "m47wlnc",
                  "author": "Pterodactyl_midnight",
                  "body": "It hasn’t even existed for 10 years",
                  "score": 3,
                  "created_utc": 1735406962.0,
                  "replies": [
                    {
                      "id": "m47xzur",
                      "author": "TXTexasRangerTX",
                      "body": "Over 9 years, that’s pretty close to 10.",
                      "score": 7,
                      "created_utc": 1735407416.0,
                      "replies": [
                        {
                          "id": "m481v9a",
                          "author": "Pterodactyl_midnight",
                          "body": "It just seems weird to state an impossible time period. Makes me wonder if they’re lying about a controller that’s notorious to break within 1 year.",
                          "score": -12,
                          "created_utc": 1735408672.0,
                          "replies": [
                            {
                              "id": "m486s1b",
                              "author": "ninjapro98",
                              "body": "Or, they didn’t remember exactly when it came out because 9 years is a long time, and just assumed it had been a full decade",
                              "score": 12,
                              "created_utc": 1735410270.0,
                              "replies": []
                            },
                            {
                              "id": "m48jzuk",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1735414544.0,
                              "replies": [
                                {
                                  "id": "m48ligw",
                                  "author": "Pterodactyl_midnight",
                                  "body": "Cool story bro",
                                  "score": -2,
                                  "created_utc": 1735415039.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m483i19",
                      "author": "ChaseballBat",
                      "body": "Mine is almost ten too. Only the rubber coming off is the issue.\n\nProbably got over 3k hours on it? Maybe more.",
                      "score": 3,
                      "created_utc": 1735409205.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m49zy0j",
          "author": "ThatGuyFromBRITAIN",
          "body": "Mine was broken out the box… £180 that was",
          "score": 2,
          "created_utc": 1735432117.0,
          "replies": []
        },
        {
          "id": "m47rcqt",
          "author": "RJValdez216",
          "body": "Mine has been going strong for almost 2 years now, some people are just too rough with their shit",
          "score": 3,
          "created_utc": 1735405231.0,
          "replies": [
            {
              "id": "m48bztx",
              "author": "KaiKamakasi",
              "body": "You say that but my original series 2 lived in its case, I didn't death grip it, never threw it, hadn't even dropped it.... The rubber grips peeled almost entirely, the left bumper died as did the D-Pad all within 8 months, the ONE time I did drop it, from desk height onto carpet, it fucking SHATTERED.\n\nI was legit rougher with my newborn than I was this thing and it just failed.\n\nThat said, I bought a second, I'm just gonna treat it as a £100 per year subscription because I genuinely love the controller.",
              "score": 6,
              "created_utc": 1735411949.0,
              "replies": []
            },
            {
              "id": "m499wan",
              "author": "glitchvid",
              "body": "I've had two (one as a brand new replacement from MS) and both had face button issues, unless you pressed directly in the center of A or Y with significant force, it wouldn't register the press.  \n\n\nGot very frustrated fighting Virgil in DMC3's last mission on account of missing a bunch of attacks, went back to my original Xbone controller and haven't given the elite 2 the time of day since.",
              "score": 2,
              "created_utc": 1735423122.0,
              "replies": []
            },
            {
              "id": "m49jlis",
              "author": "None",
              "body": "Where do you live? Ive found out they use a rubber/silicon that doesnt handle climates that have big and fast swings in humidity and temperature. Same goes for iphone cables. They tear themselves apart in countries like the UK, Belgium, The Netherlands... Has nothing to do with being rough",
              "score": 2,
              "created_utc": 1735426428.0,
              "replies": []
            },
            {
              "id": "m47tans",
              "author": "lucky_1979",
              "body": "2016 when I got mine.  Still trooping on with no issues.",
              "score": 6,
              "created_utc": 1735405874.0,
              "replies": []
            },
            {
              "id": "m47y79d",
              "author": "awsmpwnda",
              "body": "Same for my elite controller 2. No issues 2 years in. Idk what could be their issue.\n  \nThe elite controller 1 however only lasted 1 year because of the rubber warping and the A button getting stuck.",
              "score": -2,
              "created_utc": 1735407482.0,
              "replies": [
                {
                  "id": "m49mfho",
                  "author": "Inform-All",
                  "body": "The issue is that Microsoft makes an inconsistent product. That’s why sons people have ok controllers, and most people don’t. Although, with elite controllers, it seems more people have issues than not. There’s forums full of it. \n\nMy first ever elite (a series 1) lasted me around 2 years with no issues. I’ve had 3 elite series 2 controllers that all busted. The bumpers on one, stick drift on another and paddles stopped working on the last one. \n\nMy wife’s standard controls are the same way. Stick drift, faulty bluetooth and busted headphone jack. The quality just isn’t there like it used to be. I’d say especially in the past 5-6 years",
                  "score": 3,
                  "created_utc": 1735427427.0,
                  "replies": []
                },
                {
                  "id": "m49mrn1",
                  "author": "EngineeringNext7237",
                  "body": "Exact same. Series 1 always had A button troubles. But my series 2 has been perfect since launch and I occasionally rage squeeze it. Surprised it has no issues tbh.",
                  "score": 1,
                  "created_utc": 1735427551.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m483yjb",
              "author": "ChaseballBat",
              "body": "I am on the fence, going to college a decade ago showed me that like 70% of people treat their controllers like shit, throwing them, tossing them, dropping them, punching them, leaving them on the ground or in a mess of fabric.\n\nI can't imagine that has changed since then.",
              "score": -1,
              "created_utc": 1735409355.0,
              "replies": [
                {
                  "id": "m4896j6",
                  "author": "RJValdez216",
                  "body": "lol, some people are just too rough with controllers, especially when it comes to highly competitive games like CoD, Overwatch, Rainbow six Siege ect ect, people get too worked up and angry and their controller suffers because of it. I’ve played video games all my life and the only controller that ever got stick drift was my 360 controller and that was only because I tried a stupid trick to max out my stealth stat on GTA V by put a rubber band on the joysticks to keep him walking in stealth mode while afk, other then that, no other controller of mine got it",
                  "score": 0,
                  "created_utc": 1735411039.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48gknq",
              "author": "Muted_Yoghurt6071",
              "body": "3+ on mine. Dropped plenty and no issues",
              "score": -1,
              "created_utc": 1735413426.0,
              "replies": []
            },
            {
              "id": "m4919wn",
              "author": "Kahlypso",
              "body": "Same. Thing is a tank. Idk what these people are smoking.",
              "score": -1,
              "created_utc": 1735420253.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m48runu",
          "author": "siqiniq",
          "body": "Holy Shit, my $12 temu controller broke (just the left stick started drifting) after 4 months of intense gaming and I felt bad and bought another $5 controller…",
          "score": 1,
          "created_utc": 1735417137.0,
          "replies": []
        },
        {
          "id": "m493sxe",
          "author": "greenrangerguy",
          "body": "Yes but make it the new standard controller with back buttons, don't make it \"Elite\" that costs extra, make it the new baseline. I'm sick of people having an advantage in games because they bought the more expensive controller.",
          "score": 1,
          "created_utc": 1735421098.0,
          "replies": []
        },
        {
          "id": "m49ip8v",
          "author": "None",
          "body": "The elite is the worst pos I've ever bought. I had to add drops of superglue to the small padels to work as the leverage was impeded by the rubber grips on day 1. After a year the rubber grips were expanding tearing themselves loose from the plastic. And the bumpers have now started to fail",
          "score": 1,
          "created_utc": 1735426119.0,
          "replies": []
        },
        {
          "id": "m49nbnc",
          "author": "CBalsagna",
          "body": "Buy the warranty.  Again, not a great solution but a solution.  I’ve used it once over 6 years of owning 3 separate elite series controllers but I get it every time",
          "score": 1,
          "created_utc": 1735427749.0,
          "replies": []
        },
        {
          "id": "m4a8r0b",
          "author": "VagueSomething",
          "body": "If it has these features they'll break faster and have worse battery life.",
          "score": 1,
          "created_utc": 1735435108.0,
          "replies": []
        },
        {
          "id": "m4cs8nw",
          "author": "KaosC57",
          "body": "I've had my Elite Series 2 for about a year now and the only issue is the rubber grips are falling apart. Which is fairly normal for both Series 1 and 2. I'm just going to buy a completely white shell to replace it and move on about my day.",
          "score": 1,
          "created_utc": 1735481289.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48n4es",
      "author": "fudgepuppy",
      "body": "Microsoft, it's fucking time for you to include gyro in your controllers and Xinput.",
      "score": 32,
      "created_utc": 1735415569.0,
      "replies": [
        {
          "id": "m4akye5",
          "author": "juniorspank",
          "body": "Nintendo and Sony have had motion controls for nearly 20 years. That’s not a typo.",
          "score": 1,
          "created_utc": 1735439640.0,
          "replies": [
            {
              "id": "m4boj0o",
              "author": "FujiClimber2017",
              "body": "I was going to call you out but you are correct, 19 years and 1 month for the Sixaxis ps3 controller.",
              "score": 3,
              "created_utc": 1735457872.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4851rn",
      "author": "RobertoPaulson",
      "body": "If it doesn’t have hall effect sticks they can fuck right off.",
      "score": 31,
      "created_utc": 1735409708.0,
      "replies": [
        {
          "id": "m4bo727",
          "author": "FujiClimber2017",
          "body": "🧂",
          "score": -6,
          "created_utc": 1735457669.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m486fe5",
      "author": "None",
      "body": "Negativity aside, the haptics and adaptive triggers of the dual sense are really innovative. When used well by developers, the immersion is really enhanced. I wonder what sort of effect this could have since the patent says the motors can move around inside the housing. If they can slide up and down on an axis in the handle, for example, it would produce a different sensation. It’s something I hope to see standard and not just on Sony consoles.",
      "score": 24,
      "created_utc": 1735410155.0,
      "replies": [
        {
          "id": "m49bk7i",
          "author": "MinusBear",
          "body": "My hope is that with Xbox embracing this more devs will put more thought into it as the feature will be less niche. Even though their console sales are half of PS. Xbox still have an influence much larger than their footprint suggest.",
          "score": 6,
          "created_utc": 1735423683.0,
          "replies": []
        },
        {
          "id": "m4jyp4k",
          "author": "Azuljustinverday",
          "body": "Ratchet and clank rift apart has opened up my view on haptics and adaptive triggers. Using it for every single player games now love it",
          "score": 2,
          "created_utc": 1735580731.0,
          "replies": [
            {
              "id": "m4lf8hk",
              "author": "None",
              "body": "Yeah, the industry must think that all we want is better graphics. The haptics add more to a game than Ray tracing imo 😂",
              "score": 1,
              "created_utc": 1735596820.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m47pn6d",
      "author": "VirtuaFighter6",
      "body": "That’ll get em. A new whiz bang controller. That’s the answer.",
      "score": 107,
      "created_utc": 1735404669.0,
      "replies": [
        {
          "id": "m483o5m",
          "author": "FilteringAccount123",
          "body": "It really does feel like too little too late in more ways than one. \"3rd party controller\" went from a punchline to the premium. The market is really an embarrassment of riches nowadays, and the fact that extra features like gyro get nerfed in Xinput mode speaks to the state of xbox more than anything else.",
          "score": 40,
          "created_utc": 1735409261.0,
          "replies": [
            {
              "id": "m49hz02",
              "author": "None",
              "body": "Is there a better high end wireless controller for the Xbox? I thought they were all wired.",
              "score": 1,
              "created_utc": 1735425865.0,
              "replies": [
                {
                  "id": "m49k4wz",
                  "author": "FilteringAccount123",
                  "body": "For the Xbox specifically? No idea. I'm talking about PC gaming and the fact that they went from the standard to being completely left behind.",
                  "score": 3,
                  "created_utc": 1735426618.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48kc8i",
          "author": "manofth3match",
          "body": "I’m confused is this the only thing they said they will ever do? Should they not improve their controllers? Are you incapable of imagining a scenario where this isn’t the only thing on the roadmap?",
          "score": 8,
          "created_utc": 1735414657.0,
          "replies": [
            {
              "id": "m48kpei",
              "author": "drizzitdude",
              "body": "It’s a joke.",
              "score": -8,
              "created_utc": 1735414776.0,
              "replies": [
                {
                  "id": "m48kw4z",
                  "author": "manofth3match",
                  "body": "The never ending cynicism isn’t really all that funny but it is exhausting.",
                  "score": 11,
                  "created_utc": 1735414837.0,
                  "replies": [
                    {
                      "id": "m48lfwr",
                      "author": "drizzitdude",
                      "body": "Well I can say Microsoft responding to something the competition did 4 years ago instead of **making games** is endlessly funny to me. If you keep fumbling the ball people will keep making fun of you for it.",
                      "score": -2,
                      "created_utc": 1735415016.0,
                      "replies": [
                        {
                          "id": "m49a76h",
                          "author": "MinusBear",
                          "body": "Xbox Studios have put out the same number of games this gen as PlayStation studios. Sometimes they're a couple games ahead, sometimes PlayStation is. What a weird statement to make.",
                          "score": -1,
                          "created_utc": 1735423223.0,
                          "replies": [
                            {
                              "id": "m49c60p",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1735423891.0,
                              "replies": [
                                {
                                  "id": "m49g2pl",
                                  "author": "MinusBear",
                                  "body": "Personally, I wouldn't say mid, they just produce a wider variety of games than PS. Some of those genres aren't as popular, so it's not always as flashy. \n\nFor the games you mentioned, Forza Motorsport has a whiny community, but most players just get on with it and have a good time, the game reviewed well. Starfield was the first Bethesda game I ever enjoyed after bouncing off the four games they put out before it. Halo Infinite also reviewed well initially, it was the post launch support that did it in. \n\nBut you're forgetting gems like Age of Empires 4, Psychonauts 2, Forza Horizon 5, Pentiment, Grounded, Deathloop, & HiFi Rush. This isn't even getting into some of the truly deserved remasters (games that needed it) like Quake 1 & 2, several Dooms, and Age of Empires 2. These were just the titles that stood out to me. \n\nMy point being, Microsoft puts out plenty of games. It doesn't feel that way because most people aren't interested in such a wide variety of games, so only a few appeal to each person's taste. But if all you want is high production, narrtivie lead, 3rd person action games, there is a platform that just focuses on that, or at least used to and is probably busy refocusing on it.",
                                  "score": -3,
                                  "created_utc": 1735425218.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m49ntu7",
                          "author": "VirtuaFighter6",
                          "body": "This guy gets it.",
                          "score": 1,
                          "created_utc": 1735427922.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m491e3x",
                  "author": "Kahlypso",
                  "body": "No it isn't",
                  "score": -4,
                  "created_utc": 1735420291.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48lmd0",
          "author": "brooklyndavs",
          "body": "I thought MS was looking to get out of the gaming hardware business?",
          "score": -2,
          "created_utc": 1735415075.0,
          "replies": [
            {
              "id": "m48r8vn",
              "author": "darkbreak",
              "body": "That's what's speculated but nothing's confirmed. Their behavior in recent years has made everyone think that they're trying to position themselves to pivot easily to being only a publisher.",
              "score": 2,
              "created_utc": 1735416935.0,
              "replies": []
            },
            {
              "id": "m49absu",
              "author": "MinusBear",
              "body": "They've literally confirmed they are releasing a next gen console. They're at the very least in it for one more round.",
              "score": 1,
              "created_utc": 1735423266.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4ds3lx",
      "author": "Kosmos992k",
      "body": "Personally I can never wrap my head around the asymmetric layout of their controller. Humans are physically symmetrical which suggests to me that controller layout should be as well",
      "score": 4,
      "created_utc": 1735493694.0,
      "replies": [
        {
          "id": "m4p6lkk",
          "author": "WeaknessAshamed6872",
          "body": "physically maybe, but mentally we are not. left handed vs righthanded. Some people can be ambidextrous but that's usually after learning how to use their none dominant side and they will still favor one over the other.",
          "score": 3,
          "created_utc": 1735657099.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m47t5tl",
      "author": "None",
      "body": "[deleted]",
      "score": 42,
      "created_utc": 1735405830.0,
      "replies": [
        {
          "id": "m483hzz",
          "author": "Volitious",
          "body": "I play all my Xbox games on my PC with a PS5 controller via Bluetooth. no issue lol.",
          "score": 41,
          "created_utc": 1735409204.0,
          "replies": [
            {
              "id": "m487udg",
              "author": "3MnC",
              "body": "Just in case you aren't aware, you cannot play with DualSense features unless plugged into a PC with the USB.  I highly recommend taking advantage of it.",
              "score": 16,
              "created_utc": 1735410610.0,
              "replies": [
                {
                  "id": "m4ab8u5",
                  "author": "TechNickL",
                  "body": "Haptic trigger feedback is a game changer for diving in cyberpunk.",
                  "score": 3,
                  "created_utc": 1735436018.0,
                  "replies": []
                },
                {
                  "id": "m48xdhe",
                  "author": "TopdeckIsSkill",
                  "body": "I'm using dsx for that",
                  "score": 4,
                  "created_utc": 1735418965.0,
                  "replies": []
                },
                {
                  "id": "m4a7wz1",
                  "author": "Volitious",
                  "body": "I use dualsenseX or DS4Windows and get full functionality for steam and Xbox games",
                  "score": 1,
                  "created_utc": 1735434804.0,
                  "replies": [
                    {
                      "id": "m4br6jh",
                      "author": "3MnC",
                      "body": "I hadn't heard of DualSenseX before, so I went to their site to find out specifics.  This is pulled directly from their FAQ:\n\n[Does Haptic Feedback (Audio Haptics) work via Bluetooth?]()\n\n`Currently Audio Haptics works only with a USB connection to the controller`\n\nThey also state that if you are playing a game with native DualSense support you should turn off their software because it will conflict.  That software is simply emulating the features.  You are not experiencing those features as the developers designed.  \n\nI stand by my point.  I highly recommend you use USB.",
                      "score": 2,
                      "created_utc": 1735459504.0,
                      "replies": []
                    },
                    {
                      "id": "m4br7ne",
                      "author": "3MnC",
                      "body": "I hadn't heard of DualSenseX before, so I went to their site to find out specifics.  This is pulled directly from their FAQ:\n\n[Does Haptic Feedback (Audio Haptics) work via Bluetooth?]()\n\n`Currently Audio Haptics works only with a USB connection to the controller`\n\nThey also state that if you are playing a game with native DualSense support you should turn off their software because it will conflict.  That software is simply emulating the features.  You are not experiencing those features as the developers designed.  \n\nI stand by my point.  I highly recommend you use USB.",
                      "score": 1,
                      "created_utc": 1735459525.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m484u4n",
              "author": "None",
              "body": "[deleted]",
              "score": -1,
              "created_utc": 1735409641.0,
              "replies": [
                {
                  "id": "m48v7kw",
                  "author": "Spider-Thwip",
                  "body": "No\n\nhttps://www.pcgamingwiki.com/wiki/Controller:DualSense\n\nScroll down to the section on games, it shows you which features work on which games, and whether you need wired or wireless.",
                  "score": 4,
                  "created_utc": 1735418251.0,
                  "replies": []
                },
                {
                  "id": "m485f7u",
                  "author": "Volitious",
                  "body": "Ummm I don’t think on all games. I know I do with CoD and Forza 5. But not on madden 25. I only used 3rd party software to change the virtual game pad if needed.",
                  "score": 5,
                  "created_utc": 1735409831.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48ele2",
          "author": "ISB-Dev",
          "body": "square selective bells existence jeans price vegetable ripe wakeful voracious\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 10,
          "created_utc": 1735412782.0,
          "replies": [
            {
              "id": "m48ul7o",
              "author": "spikederailed",
              "body": "Maybe this is the answer for me. I love my PS5, but I find the DD5 controller so much more uncomfortable compared to the DS4.",
              "score": 0,
              "created_utc": 1735418045.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4ack3g",
          "author": "None",
          "body": "Steam recognized my ps pro controller but STILL doesn't work.",
          "score": 2,
          "created_utc": 1735436499.0,
          "replies": []
        },
        {
          "id": "m481lni",
          "author": "theRobomonster",
          "body": "This generation is most definitely the PlayStation controller. I love the resistance of the sticks. The Xbox sticks just feel loose.",
          "score": 4,
          "created_utc": 1735408585.0,
          "replies": [
            {
              "id": "m4csqbu",
              "author": "KaosC57",
              "body": "The only Xbox controller I feel like has \"loose sticks\" is the Series controller that came with my Series X. Both my Xbox One Gen 2 controller and my Elite Series 2 controller feel much stiffer and better built.\n\nMy Series controller also has an oddity that allows the thumbsticks a lot of play in the vertical axis where there should be no movement other than to press R3 and L3.",
              "score": 1,
              "created_utc": 1735481500.0,
              "replies": []
            },
            {
              "id": "m484nps",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1735409583.0,
              "replies": [
                {
                  "id": "m48f5sq",
                  "author": "TopdeckIsSkill",
                  "body": "me too. I think it's because xbox controller is smaller",
                  "score": -2,
                  "created_utc": 1735412965.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48eo6e",
              "author": "IntentionAdmirable36",
              "body": "The controller feels so good in the hand too. It’s hard to go back to the DS4 and I loved that controller",
              "score": 2,
              "created_utc": 1735412807.0,
              "replies": [
                {
                  "id": "m48t527",
                  "author": "ess-doubleU",
                  "body": "The dualshock 4 feels like a small toy now lol",
                  "score": 1,
                  "created_utc": 1735417566.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m491gdo",
          "author": "betelgeuse_boom_boom",
          "body": "Funnily enough steamOS is supporting dual sense. So I think what we are missing is more games being steam OS compatible.",
          "score": 1,
          "created_utc": 1735420312.0,
          "replies": [
            {
              "id": "m4acpna",
              "author": "None",
              "body": "They are but it doesn't work.\n\nSource: I just tried to use my pro controller last night and while it recognizes it the controller still doesn't work.",
              "score": 1,
              "created_utc": 1735436555.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m4827ix",
          "author": "None",
          "body": "[deleted]",
          "score": -3,
          "created_utc": 1735408783.0,
          "replies": [
            {
              "id": "m482ycp",
              "author": "WeeWooPeePoo69420",
              "body": "The point is not wanting to have to use third party solutions or workarounds or adapters, and that's just to get controllers to work at all sometimes let alone features like the dualsense has",
              "score": 1,
              "created_utc": 1735409023.0,
              "replies": []
            },
            {
              "id": "m48du5e",
              "author": "BestieJules",
              "body": "You need Xbox or PS for any racing games, Gamecube emulation, FF14, anything that requires triggers really.",
              "score": -1,
              "created_utc": 1735412538.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m48o388",
      "author": "Mirkrid",
      "body": "I much prefer the feel of an Xbox controller to a PlayStation one — it’s not gonna make be buy their next console, but I’ll pick is controller up for PC if it looks good \n\nI think PC gaming is an often overlooked demo for this kind of thing, this move isn’t *only* to try to drum up console sales",
      "score": 9,
      "created_utc": 1735415888.0,
      "replies": []
    },
    {
      "id": "m47qjqg",
      "author": "gatsome",
      "body": "Sony’s battery life in their controllers is completely unacceptable to me so this is already answered. I put up with it when I play PS games, but that’s it.",
      "score": 36,
      "created_utc": 1735404968.0,
      "replies": [
        {
          "id": "m48dhu6",
          "author": "Gatlindragon",
          "body": "If the Dualsense didn't have haptic feedback, adaptive triggers, gyroscope, accelerometer, speaker, microphone and light functions it will probably last as long as an Xbox controller lol.",
          "score": 23,
          "created_utc": 1735412429.0,
          "replies": [
            {
              "id": "m4b86rd",
              "author": "makomirocket",
              "body": "Except it was also an issue on the PS4 dualshock too. You can't beat a bigger battery compartment of the Xbox controllers, nor their ability to be fully charged with a second battery pack in seconds, while I have to play with a cable plugged in for an hour or two if I forget to charge my PS5 controller.\n\nA rechargeable AA is about 2500 mAh EACH. Vs the dualsense's 1500 mAh. No comparison",
              "score": 5,
              "created_utc": 1735449153.0,
              "replies": [
                {
                  "id": "m4ja2qf",
                  "author": "Gamebird8",
                  "body": "Not to mention that you can replace the battery as easily as buying a new rechargeable AA when yours inevitably hits its life cycle limit",
                  "score": 1,
                  "created_utc": 1735572995.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48t0zr",
              "author": "Santa_Ricotta69",
              "body": "Every time I use the majority of those features I have to wonder why they bother. I do not need some cheap little speaker in my hand making tinny sound effects, nor do I need it for voice chat, nor does any serious game use the accelerometer, and the light function is mostly useless, as is the gyroscope",
              "score": 1,
              "created_utc": 1735417528.0,
              "replies": [
                {
                  "id": "m48xpcx",
                  "author": "TopdeckIsSkill",
                  "body": "for me they are game changing instead.\n\nPlaying atrobot now feels incredible, or the latest horizon for example.\n\nNot all games use those features but I love them",
                  "score": 3,
                  "created_utc": 1735419073.0,
                  "replies": [
                    {
                      "id": "m49i8g3",
                      "author": "None",
                      "body": "Which features do those two games use??",
                      "score": 4,
                      "created_utc": 1735425956.0,
                      "replies": [
                        {
                          "id": "m4a8ik6",
                          "author": "Santa_Ricotta69",
                          "body": "I know Horizon specifically makes these awful little sound effects from the controller that sound like they're being made from a tamagotchi, I'm glad y'all like it though or whatever",
                          "score": 5,
                          "created_utc": 1735435022.0,
                          "replies": [
                            {
                              "id": "m4a93v4",
                              "author": "None",
                              "body": "Nah I turned that shit off immediately. The radio chatter in silent hill was fucking torture.",
                              "score": 6,
                              "created_utc": 1735435238.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m4akovv",
                  "author": "juniorspank",
                  "body": "Gyro is a game changer for competitive FPS games 🤷🏻‍♂️",
                  "score": 1,
                  "created_utc": 1735439539.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m492wxd",
              "author": "None",
              "body": "90% of those things have very little effect on battery life. This all has been tested.",
              "score": 0,
              "created_utc": 1735420800.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m482e81",
          "author": "corgis_are_awesome",
          "body": "Yeah, you aren’t kidding. I vastly prefer rechargeable AA batteries over built-in batteries that wear out and turn the controller into a brick (unless you want to deal with the hassle of disassembly)\n\nMy ps5 controller dies after about 6 hours of gameplay, but my Xbox controller lasts for weeks (using powerowl batteries). When they run out, it only takes 30 seconds to swap them",
          "score": 14,
          "created_utc": 1735408841.0,
          "replies": [
            {
              "id": "m48uey2",
              "author": "BRAND-X12",
              "body": "Not giving them a pass or anything, but FYI disassembly is legitimately trivial. I got a huge ass battery and replaced the one that’s in there, the controller lasts all day now it’s incredible. \n\nAnd I’m not downplaying, the process probably took 30 minutes.",
              "score": 3,
              "created_utc": 1735417989.0,
              "replies": [
                {
                  "id": "m49b8v9",
                  "author": "MinusBear",
                  "body": "This is good to know. But you'd be surprised how even simple electronic DIY tasks are beyond a lot of people. Since repairing Joycons and replacing the sticks with hall effects, I feel like I could take on anything.",
                  "score": 3,
                  "created_utc": 1735423576.0,
                  "replies": []
                },
                {
                  "id": "m497tej",
                  "author": "Gatlindragon",
                  "body": "Yup, you just need to remove 4 screws, remove the back shell and the battery is right there, it takes 15 minutes max.",
                  "score": 2,
                  "created_utc": 1735422433.0,
                  "replies": []
                },
                {
                  "id": "m4amch6",
                  "author": "corgis_are_awesome",
                  "body": "For sure. I have had to disassemble many controllers over the years. It’s still way way way more hassle than just swapping out two AA batteries on the Xbox controller though.",
                  "score": 1,
                  "created_utc": 1735440171.0,
                  "replies": []
                },
                {
                  "id": "m4ir04u",
                  "author": "Remy0507",
                  "body": "I replaced the batteries in 4 of my older Dualsense controllers. The first one might have taken a little longer while I was figuring it out, but it should be more like a 5 minute process than a 30 minute process.",
                  "score": 1,
                  "created_utc": 1735565901.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m48ff05",
              "author": "TopdeckIsSkill",
              "body": "Xbox controller doesn't have any features, that's why.\n\nAlso you could just plug a usb cable into dualsense and play without even having to pause the game",
              "score": 3,
              "created_utc": 1735413049.0,
              "replies": [
                {
                  "id": "m4b8oq5",
                  "author": "makomirocket",
                  "body": "A rechargeable AA battery is 2500 mAh EACH. The Dualsense has a 1500mAh pack that is built in. THAT'S why.\n\nYou can also run an Xbox controller off of a cable too?",
                  "score": 1,
                  "created_utc": 1735449382.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m47um8x",
          "author": "mountainyoo",
          "body": "I just have the PS5 controller dock and drop the controller on it whenever I’m done playing. Battery has never been an issue when using the dock.",
          "score": 7,
          "created_utc": 1735406309.0,
          "replies": []
        },
        {
          "id": "m47r61k",
          "author": "None",
          "body": "[deleted]",
          "score": 6,
          "created_utc": 1735405170.0,
          "replies": [
            {
              "id": "m47rth5",
              "author": "None",
              "body": "Controller were all using wired so he wouldn't complain about battery life...",
              "score": 21,
              "created_utc": 1735405387.0,
              "replies": [
                {
                  "id": "m47td5t",
                  "author": "FilthyUsedThrowaway",
                  "body": "Pretty sure he’s talking about portable games.",
                  "score": 0,
                  "created_utc": 1735405897.0,
                  "replies": []
                },
                {
                  "id": "m49qcmu",
                  "author": "SUPREMACY_SAD_AI",
                  "body": "controllers weren't even real",
                  "score": 0,
                  "created_utc": 1735428804.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47rl68",
              "author": "rudthedud",
              "body": "Buying a 10 dollar 5 meter cord is too much for people apparently",
              "score": 14,
              "created_utc": 1735405309.0,
              "replies": [
                {
                  "id": "m47sgow",
                  "author": "TheWhooooBuddies",
                  "body": "Spoken like a man that’s never had a little cousin send their SNES flying across the room like a NJ drone.",
                  "score": 18,
                  "created_utc": 1735405600.0,
                  "replies": []
                },
                {
                  "id": "m48dhrn",
                  "author": "tuenmuntherapist",
                  "body": "I just plug it into a portable battery with a 1 foot cord.",
                  "score": 2,
                  "created_utc": 1735412429.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m47rywx",
              "author": "MisterEinc",
              "body": "... When they were wired and never died?",
              "score": 7,
              "created_utc": 1735405436.0,
              "replies": [
                {
                  "id": "m486e8l",
                  "author": "whewtang",
                  "body": "They had wireless controllers available all the way back on NES.  \n\nMy family had some. Don't remember the name but they were blue.",
                  "score": 1,
                  "created_utc": 1735410145.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m48fb0y",
          "author": "TopdeckIsSkill",
          "body": "Can't you hyst plug a usb cable into it for a while?",
          "score": 1,
          "created_utc": 1735413012.0,
          "replies": []
        },
        {
          "id": "m486yb0",
          "author": "whewtang",
          "body": "Exactly. I don't understand why the battery life is so terrible. I can go a week or more without charging my Switch Pro controllers. \n\nPs5, maybe a few hours.",
          "score": 1,
          "created_utc": 1735410325.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48g4ic",
      "author": "None",
      "body": "The base Xbox Series controller is so fucking good once you get the rechargeable battery pack.\n\nI prefer it over the elite because it’s just so reliable and the Dpad is amazing for fighting games.\n\nStill prefer DualShock but for wireless pc play it’s become my go-to",
      "score": 6,
      "created_utc": 1735413278.0,
      "replies": [
        {
          "id": "m4a9puw",
          "author": "BlackHoleCole",
          "body": "You prefer DualShock over duelsense?",
          "score": 2,
          "created_utc": 1735435460.0,
          "replies": [
            {
              "id": "m4b2m9l",
              "author": "None",
              "body": "I still use my old dualshocks. I’ve had them for years with zero issues. My both my Series X controllers got stick drift after a year. \n\nPart of me wants to try a dualsense but the old DualShocks are so reliable it’s hard to justify the switch.",
              "score": 1,
              "created_utc": 1735446654.0,
              "replies": [
                {
                  "id": "m4d8qtb",
                  "author": "BlackHoleCole",
                  "body": "For me the duelsense is just leagues above DualShock in both comfort and function",
                  "score": 1,
                  "created_utc": 1735487491.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m4bo50h",
              "author": "None",
              "body": "I meant dualsense-It’s kindof the same to me but I do not really like the dualsense dpad (mushy)",
              "score": 1,
              "created_utc": 1735457635.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4ahra8",
      "author": "nuclearwinterxxx",
      "body": "I would settle for a controller that lasts more than 6 months before it gets unusable stick drift.",
      "score": 7,
      "created_utc": 1735438429.0,
      "replies": []
    },
    {
      "id": "m483nc7",
      "author": "Whiskey1992",
      "body": "How about they fix their shitty elite controller bumpers first.",
      "score": 7,
      "created_utc": 1735409254.0,
      "replies": []
    },
    {
      "id": "m489ine",
      "author": "moritsunee",
      "body": "And it'll still have the stick drift like all the others.",
      "score": 2,
      "created_utc": 1735411150.0,
      "replies": []
    },
    {
      "id": "m48a7km",
      "author": "DXsocko007",
      "body": "I just want something on my pc that can do more than 125hz pulling rate. It’s why I just switched to ps5 dual sense",
      "score": 2,
      "created_utc": 1735411375.0,
      "replies": []
    },
    {
      "id": "m48yvvx",
      "author": "GreenLanternsPodcast",
      "body": "But will it work on Playstation?!",
      "score": 2,
      "created_utc": 1735419459.0,
      "replies": []
    },
    {
      "id": "m4bj27c",
      "author": "y_not_right",
      "body": "So you can play all the games you can get on pc/playstation anyway",
      "score": 2,
      "created_utc": 1735454682.0,
      "replies": []
    },
    {
      "id": "m4bya05",
      "author": "-re-da-ct-ed-",
      "body": "Done with Microsoft hardware. *$250* for Elite Series 2 that they supported with 2 firmware updates that basically has you reverting to the first because the second one broke functionality. And they just left it.\n\nMy first one my wife gifted me had a broken left joystick out of the box, had to be returned, and it’s surprisingly not even all that uncommon. They have a serious quality control issue (Red Ring of Death, anyone?) and I have fallen victim to it for the last time.",
      "score": 2,
      "created_utc": 1735464106.0,
      "replies": []
    },
    {
      "id": "m49mxm6",
      "author": "EngineeringNext7237",
      "body": "Do people actually like the PS controllers? The touch pad and gyro seem so niche and have never made any of my gaming experiences better. Same for the damn speaker in the controller lol",
      "score": 5,
      "created_utc": 1735427611.0,
      "replies": [
        {
          "id": "m4bnred",
          "author": "Rhellic",
          "body": "I'm probably biased because I play on pc and Xbox controllers are basically the default option there (aside from the obvious keyboard and mouse of course) but yeah I have to admit those don't sound terribly useful to me.\n\nLike, if people enjoy them, good for them, but I'd probably be turning off as much of that as possible. A controller is basically UI and UIs job is to disappear and be forgotten about. To me anyway.",
          "score": 2,
          "created_utc": 1735457402.0,
          "replies": []
        },
        {
          "id": "m4al5e4",
          "author": "juniorspank",
          "body": "I will exclusively purchase FPS games on PS5 over my XSX because of gyro controls.",
          "score": 2,
          "created_utc": 1735439715.0,
          "replies": []
        },
        {
          "id": "m4a7huh",
          "author": "themanintheblueshirt",
          "body": "It's truly awful",
          "score": 0,
          "created_utc": 1735434656.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4bo8g8",
      "author": "mao_dze_dun",
      "body": "Well, no gyro, no touchpad, no hall effect sticks or triggers, no back buttons, but hey - it vibrates better. Literally has less features than the 30 dollar gamepad I bought my daughter for Christmas...",
      "score": 3,
      "created_utc": 1735457693.0,
      "replies": []
    },
    {
      "id": "m486v84",
      "author": "blacksoxing",
      "body": "Finally got around to my ps5 after a few years and damn…that controller is the best I’ve ever used. Astro Bot is amazing with it. So is Ratchet and Clank. Great uses.",
      "score": 3,
      "created_utc": 1735410298.0,
      "replies": []
    },
    {
      "id": "m48eg0o",
      "author": "zarafff69",
      "body": "Can’t wait. The ps5 dual sense controller is legit sick! Some PC games support all the features, and it can be game changing",
      "score": 2,
      "created_utc": 1735412734.0,
      "replies": []
    },
    {
      "id": "m485aj9",
      "author": "palescoot",
      "body": "All I want is an Xbox Elite controller with gyro and maybe a touch pad somewhere. Bar that, a controller that perfectly mimics the Steam Deck's setup would be great for my Deck / PC \"Steam Switch\" setup.",
      "score": 2,
      "created_utc": 1735409789.0,
      "replies": []
    },
    {
      "id": "m48gk2o",
      "author": "GoGoPowerPlay",
      "body": "I want motion controls. Playing on the switch, being able to aim with the sticks and make fine adjustments with motion control is the best aiming system I've ever played.",
      "score": 2,
      "created_utc": 1735413421.0,
      "replies": []
    },
    {
      "id": "m49v1ld",
      "author": "optronix32",
      "body": "I find the Xbox controller to be more comfortable in my hands for long duration use, I also prefer the placement of the sticks over the PS controllers. Having used an Xbox controller for many years any time I switch to using a PS controller it just hurts my fingers.. 🤷‍♂️",
      "score": 2,
      "created_utc": 1735430440.0,
      "replies": []
    },
    {
      "id": "m4814mk",
      "author": "ttubehtnitahwtahw1",
      "body": "Why not make it so that the $170 controller doesn't break in the first month? The Xbox controllers are fine, they need nothing but QC.",
      "score": 2,
      "created_utc": 1735408430.0,
      "replies": [
        {
          "id": "m482itp",
          "author": "leaderofstars",
          "body": "Because they cost 170 bucks",
          "score": 1,
          "created_utc": 1735408884.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m47qnl3",
      "author": "None",
      "body": "Typical of Xbox to want to compete with something the competition did 4 years ago.\n\nMost ppl don’t even care about the dual sense features. The biggest innovation was swapping sticks on the overpriced premium one and that’s just a scam to sell you more joysticks.",
      "score": -6,
      "created_utc": 1735405003.0,
      "replies": [
        {
          "id": "m47s7po",
          "author": "MobileVortex",
          "body": "lol",
          "score": 8,
          "created_utc": 1735405518.0,
          "replies": []
        },
        {
          "id": "m47t65p",
          "author": "Sic_Semper_T_Rex_",
          "body": "Tell me you haven't played Returnal without telling me you haven't played Returnal. ",
          "score": 16,
          "created_utc": 1735405833.0,
          "replies": [
            {
              "id": "m486krm",
              "author": "bam2403",
              "body": "Returnal was the only game I remember it feeling like it really affected gameplay.",
              "score": 1,
              "created_utc": 1735410205.0,
              "replies": []
            },
            {
              "id": "m47tx3n",
              "author": "None",
              "body": "What does returnal do that’s so mind blowing? Looks like a good game but it’s on pc so how crucial is that feature really?",
              "score": -18,
              "created_utc": 1735406080.0,
              "replies": [
                {
                  "id": "m47vp1y",
                  "author": "Sic_Semper_T_Rex_",
                  "body": "It's just my opinion, but the PS5 controller and haptic feedback are the only thing that has made this generation of consoles feel next gen. I notice the lack of it when I'm playing with any other controller. Maybe a little exaggerated but switching to an Xbox controller reminds me of getting handed the Mad Catz controller as a kid. ",
                  "score": 9,
                  "created_utc": 1735406662.0,
                  "replies": [
                    {
                      "id": "m47xyje",
                      "author": "Chassian",
                      "body": "Gyro control is actually pretty good too, aiming with sticks plus motion makes shooting stuff almost as good as with a mouse.",
                      "score": 3,
                      "created_utc": 1735407404.0,
                      "replies": []
                    },
                    {
                      "id": "m47wjwv",
                      "author": "SolidOshawott",
                      "body": "Yeah, that's an exaggeration lol.",
                      "score": -1,
                      "created_utc": 1735406946.0,
                      "replies": []
                    },
                    {
                      "id": "m47x7m4",
                      "author": "None",
                      "body": "Fair enough. I use a switch pro for everything but if I play returnal I’m probably using mouse and keyboard.\n\nI was just curious what that game did specifically",
                      "score": 0,
                      "created_utc": 1735407160.0,
                      "replies": [
                        {
                          "id": "m482mfz",
                          "author": "UncleMrBones",
                          "body": "A half pull of the trigger is normal fire, but a full pull is the alt fire, with significant resistance at the half way point to differentiate the alt fire. Furthermore when the alt fire is still charging when it is pulled the vibration of the trigger and the speaker inform you of its cooldown status without taking your eyes off the enemies. \n\nThe haptics also vibrate in the direction of interactive objects, so not only does it notify you if your near health you might not see, it will let you know exactly where it is even if it isn’t visible on the screen.",
                          "score": 3,
                          "created_utc": 1735408916.0,
                          "replies": [
                            {
                              "id": "m485obn",
                              "author": "whewtang",
                              "body": "For me the ps5 trigger feature on returnal is just annoying. Astrobot does a better job with using the features of these controllers. But none of that is really all that impressive. \n\nI'd trade all of that for reliability. Because either way mine have all had stick drift. Some after a couple weeks.",
                              "score": 0,
                              "created_utc": 1735409913.0,
                              "replies": [
                                {
                                  "id": "m48axs5",
                                  "author": "UncleMrBones",
                                  "body": "The way Returnal implanted haptics and the adaptive trigger are designed to make you a better more responsive player, which is vital in an intense bullet hell shooter. Your always holding the alt-fire button, and as soon as it is ready fire (which you will know without ever taking your eyes off the enemy) you just have to press the button your already holding a little deeper. Any health, or consumables will be felt, the haptics are unique allowing you to identify it as health or a consumable without looking as you dodge attacks and continue blasting. \n\nAstro Bot has great haptics but they are implemented purely for enjoyment, and don’t impact gameplay in any significant way. It would be a less enjoyable experience, but your platforming wouldn’t suffer if you play without the haptics and adaptive triggers. I wouldn’t say that this is a worse implementation, it suits the game perfectly.",
                                  "score": 1,
                                  "created_utc": 1735411612.0,
                                  "replies": [
                                    {
                                      "id": "m48g459",
                                      "author": "whewtang",
                                      "body": "Personally preference then. I'm not sure the argument works better by narrowing the discussion. Astrobot more effectively highlights what the PS5 controller is capable of. \n\nI'd personally prefer to disable the adaptive trigger on returnal. (Or any shooters)",
                                      "score": 1,
                                      "created_utc": 1735413275.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m47w67e",
                  "author": "Sic_Semper_T_Rex_",
                  "body": "It's also the seamless integration of the haptics with the game. The subtle changes from room to room and between shooting the different weapons.  It just feels different. It's the first video game experience that reminds me of the excitement of what it was like to get a new game as a kid. ",
                  "score": 1,
                  "created_utc": 1735406821.0,
                  "replies": []
                },
                {
                  "id": "m4861cs",
                  "author": "whewtang",
                  "body": "None of it is mind blowing. None of it is worth having to disassemble a drifting controller.",
                  "score": -1,
                  "created_utc": 1735410029.0,
                  "replies": [
                    {
                      "id": "m493agd",
                      "author": "None",
                      "body": "none of that has to do with your controller drifting genius",
                      "score": 2,
                      "created_utc": 1735420928.0,
                      "replies": [
                        {
                          "id": "m497ldo",
                          "author": "whewtang",
                          "body": "Are you having trouble understanding?",
                          "score": 0,
                          "created_utc": 1735422360.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m47rw2g",
          "author": "MisterEinc",
          "body": "Yeah, the Xbox controller is already far superior for everyday use across devices. Should just refine it, not chase gimmicky features.",
          "score": -1,
          "created_utc": 1735405410.0,
          "replies": [
            {
              "id": "m47tins",
              "author": "DredZedPrime",
              "body": "Other than slightly more universal compatibility, in what way is it \"far superior\"?\n\nMaybe battery life too, thanks to the extra features draining the dualsense a little quicker, but I've never had any issues in that area anyway. It's not like the majority of people are sitting around literally all day gaming. They at least would be taking breaks occasionally.",
              "score": 8,
              "created_utc": 1735405947.0,
              "replies": [
                {
                  "id": "m47uszh",
                  "author": "MisterEinc",
                  "body": "Ergonomics, battery life, and compatability.",
                  "score": 6,
                  "created_utc": 1735406370.0,
                  "replies": [
                    {
                      "id": "m47vwqv",
                      "author": "DredZedPrime",
                      "body": "Battery life is a little better, sure, but like I said, I've never had any issues with that, and I doubt most who use them have either. As long as you're not trying to do ridiculous marathon sessions, it's really not something the average person is going to have a problem with. \n\nCompatibility I get a little bit, certainly in the DS4 AND DS3 days, but the Dualsense works just fine with almost everything I've used it on, thanks to Steam handling a lot of that. Granted if you're not within the Steam ecosystem for most of your games (why?) it may be a bit more of an issue. \n\nErgonomics I definitely don't agree with personally, I find the XBox controllers far less comfortable to use in general. Alltogether I think each of them is very well suited to different people, and neither of them has any major ergonomic flaws. It's really more a matter of preference than anything.",
                      "score": -1,
                      "created_utc": 1735406733.0,
                      "replies": [
                        {
                          "id": "m47x4o6",
                          "author": "ThatLowKeyGuy",
                          "body": "Removable battery and joy stick placement makes the Xbox controller better imo, plus it sits better in bigger hands. \n\nThe haptics on the DS5 is fun, but you forget it’s there after a couple min tbh. Haven’t played a game where it made a difference as to wanting to play said game or not.",
                          "score": 5,
                          "created_utc": 1735407133.0,
                          "replies": [
                            {
                              "id": "m480pt8",
                              "author": "Chimwizlet",
                              "body": "For me the deciding factor is the d-pad; every iteration of xbox d-pads I've tried has seemed vastly inferior to any other d-pad I've used.\n\nIt depends on the types of games you typically play of course, but alot of the games where I opt to use a controller I also want a decent d-pad.",
                              "score": 3,
                              "created_utc": 1735408298.0,
                              "replies": [
                                {
                                  "id": "m4880g6",
                                  "author": "ThatLowKeyGuy",
                                  "body": "But they’re not d pad centric controllers? Why not get a controller that has like a big dedicated d pad for stuff like that.  \n\nMaybe you should just stick to the OG ps1 controller /s",
                                  "score": -3,
                                  "created_utc": 1735410665.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m48498b",
                              "author": "CornWallacedaGeneral",
                              "body": "Thats the point of the DS....you forget that its there because you're so immersed,but you notice it when your gun jams or you need to reload in shooting games,or when you're playing a basketball game and you gotta time the trigger and release it for the perfect shot,its subtle....but thats the point.",
                              "score": 2,
                              "created_utc": 1735409452.0,
                              "replies": [
                                {
                                  "id": "m488kx0",
                                  "author": "ThatLowKeyGuy",
                                  "body": "I didn’t say it was because I was so immersed lmao. I appreciate the key note talking points, but you notice all these things playing games in general. Do you turn off all HUD elements bc the controller can do it all for you? \n\nIt’s not very subtle at all when it tries to be “impressive” and as I said doesn’t add anything to my experience. It’s a neat gimmick, but I’d rather the devs put energy in to the actual game.",
                                  "score": 5,
                                  "created_utc": 1735410847.0,
                                  "replies": [
                                    {
                                      "id": "m489jkm",
                                      "author": "CornWallacedaGeneral",
                                      "body": "Nah lol...but its dope when you play certain games and adds a shit ton of immersion,being able to feel the point when to release it in certain games is dope as fuck and I feel with it winning all of the innovation awards for accessibility it was made precisely for gamers who are blind...those players can't see the game let alone the Hud.",
                                      "score": 0,
                                      "created_utc": 1735411158.0,
                                      "replies": [
                                        {
                                          "id": "m4bnxwb",
                                          "author": "Rhellic",
                                          "body": "Huh. Fair point about blind players I guess. Other than that it still seems extremely gimmicky and potentially annoying though tbh.",
                                          "score": 1,
                                          "created_utc": 1735457512.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m47xpqx",
                              "author": "DredZedPrime",
                              "body": "See, I absolutely hate the joystick placement of XBox style controllers. I've never understood why anyone would prefer it. \n\nI like the symmetry of having my hands in the same position to be on each stick, since that's where they usually spend the majority of the time anyway. \n\nA removable battery would be nice, but like I said, I've never actually ran my DS5 battery down to nothing, even playing a good amount in a day. There's always need for breaks and stuff anyway, I just throw it on the charger when I'm doing anything else in between playing. \n\nI definitely think the reactive triggers do add a lot to certain games when they're used well, though I do agree that they're not used as much or always as well as they could be.",
                              "score": -4,
                              "created_utc": 1735407323.0,
                              "replies": [
                                {
                                  "id": "m487lgm",
                                  "author": "ThatLowKeyGuy",
                                  "body": "If you think of it ergonomically, it’s more comfy moving your thumb down on the fuller “hips” of the Xbox controller when using the d pad. \n\nThe DS5 has made it a bit better by elongating the legs, but it’s more strenuous to move your thumb up and like hitting the sides all the time. The DS4 and down are the worst for this bc they’re stumpy and dig in to your hand all the time. \n\nIt’s not about how good it is now, batteries degrade over time and the controllers are pricey.  \n\nThe haptics and triggers have been so meh to me. And I’ve played spider man 2, gow, cod and that Astro game. \n\nThe ONE time it really impressed me was swinging in spider man and brushing the top of a tree. It’s really neat how the controller rustles. Other than that? It’s more annoying than cool tbh. Either I don’t notice, or it’s like doing way too much for like very short blips. Like sure it makes quick time events more fun, but that’s not why I play games lol \n\nThe Xbox elite controller has triggers you can set and that’s all I’ve needed, pretty nice to switch between it being a click and like 30 inputs depending on what I’m playing, but that’s up to me.",
                                  "score": -1,
                                  "created_utc": 1735410531.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m47tlbu",
              "author": "None",
              "body": "Why is it far superior?? As a pc player they seem basically the same besides the rumble and the pointless touchpad.\n\nI use a switch pro and it’s never done me wrong since 2018",
              "score": -1,
              "created_utc": 1735405972.0,
              "replies": [
                {
                  "id": "m484oq5",
                  "author": "WeeWooPeePoo69420",
                  "body": "Ergonomics are phenomenal, it's the most premium feeling and comfortable controller out there imo. Every input whether the analog sticks or face buttons or triggers feel great. Haptics and adaptive triggers really do a great job of letting you feel the weight of an action and I really miss it when it's not there. Built in mic. The touchpad is gimmicky but it also feels nice to the touch and is the typical menu button so I like it. I don't care about compatibility since I mostly play on PS5.",
                  "score": 0,
                  "created_utc": 1735409592.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m47ul61",
          "author": "Smooth-Accountant",
          "body": "Built in mic and the haptive triggers are amazing and I’m picking dualsense over my series controller whenever it’s possible. Touchpad is gimmicky and useless. I do prefer the Xbox layout though.",
          "score": 1,
          "created_utc": 1735406299.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48bto7",
      "author": "hyperforms9988",
      "body": "...and how much is it going to cost if this comes to pass?",
      "score": 1,
      "created_utc": 1735411895.0,
      "replies": []
    },
    {
      "id": "m48k2j1",
      "author": "popmanbrad",
      "body": "Jokes on you I use my stadia controller",
      "score": 1,
      "created_utc": 1735414569.0,
      "replies": []
    },
    {
      "id": "m48lmu1",
      "author": "salesmunn",
      "body": "Didn't they already release an Elite controller before the Dual Sense Edge?",
      "score": 1,
      "created_utc": 1735415080.0,
      "replies": []
    },
    {
      "id": "m48muf9",
      "author": "darkbreak",
      "body": "I hope it comes to fruition. A while back Xbox sent out a questionnaire asking players if they wanted to see DualSense-like features in a future Xbox controller. They very clearly saw the DualSense as a remarkable piece of gaming tech. I very much hope they make something like it for Xbox. If they do we can have haptic feedback and adaptive triggers for almost any game for almost any platform going forward.",
      "score": 1,
      "created_utc": 1735415477.0,
      "replies": []
    },
    {
      "id": "m48p65z",
      "author": "raynorelyp",
      "body": "Their solution should be fixing the awful UI and making games that are fun. The base Xbox controller is pretty close to perfect.",
      "score": 1,
      "created_utc": 1735416245.0,
      "replies": []
    },
    {
      "id": "m4915wp",
      "author": "obi1kenobi1",
      "body": "I guess the fact that it’s a patent is something, but this doesn’t really tell us anything that the big console roadmap leak from over a year ago didn’t tell us. That leak said a revised controller with Sony/Nintendo-like haptic feedback (I don’t remember if the leak mentioned the triggers) and gyro support was coming in 2024, but it never happened (nor did the cylindrical Xbox Series X revision). Haptic feedback and adaptive triggers would be nice, especially if they were implemented in a way that makes it relatively straightforward to make the functionality cross-platform since that would encourage PC titles to adopt those features if they know the most popular PC controller supports them. But really what I want more than anything is gyro because the industry refuses to universally support gyro aim assist as long as that feature isn’t supported by Xbox, their controllers have been holding the whole industry back by 10-15 years and it’s time for them to catch up to every other controller on the market.",
      "score": 1,
      "created_utc": 1735420217.0,
      "replies": []
    },
    {
      "id": "m49a7oo",
      "author": "chickenintendo",
      "body": "Perhaps they should come up with a potential answer to ps5 games",
      "score": 1,
      "created_utc": 1735423227.0,
      "replies": []
    },
    {
      "id": "m4aokkc",
      "author": "SillyMikey",
      "body": "Didn’t this shit already leak during the ABK trials?",
      "score": 1,
      "created_utc": 1735441021.0,
      "replies": []
    },
    {
      "id": "m4bauyf",
      "author": "Eyehopeuchoke",
      "body": "Adaptive triggers is cool for single player games, but absolutely not for a PvP game.",
      "score": 1,
      "created_utc": 1735450413.0,
      "replies": []
    },
    {
      "id": "m4bmtpr",
      "author": "Rhellic",
      "body": "I admit I pretty much only use controllers for a few types of games like action adventure stuff. Think Tomb Raider and stuff like that. But... Does it need a specific answer? I've never really heard of anyone really getting anything out of these supposed advantages of the dualsense.",
      "score": 1,
      "created_utc": 1735456834.0,
      "replies": []
    },
    {
      "id": "m4bogmr",
      "author": "None",
      "body": "Unfortunately no matter what they do, can't get around the half arsed design of the thumb sticks with these here. That leaves the playstation controllers here or the one ~~fit for a submarine~~.\n\nThat's just my problem though. Might be saying the same thing directed at the playstation ones if it had been the xbox style used here first. heh",
      "score": 1,
      "created_utc": 1735457831.0,
      "replies": []
    },
    {
      "id": "m4bsrlr",
      "author": "Awkward_Pangolin3254",
      "body": "> The controller also features adaptive triggers that alter resistance dynamically, enabling realistic sensations like drawing a bowstring or the click of a gun trigger.\n\nThis is what I want. Force feedback triggers that can feel like a brake pedal, or click off and reset like a real gun trigger",
      "score": 1,
      "created_utc": 1735460510.0,
      "replies": []
    },
    {
      "id": "m4bxpax",
      "author": "ediculous",
      "body": "Same here. I think I've broken bumpers on 4 or 5 controllers now.",
      "score": 1,
      "created_utc": 1735463724.0,
      "replies": []
    },
    {
      "id": "m4ce0x3",
      "author": "Miserable-Bear7980",
      "body": "definitely hold your breath, and then a little longer. they dont even have the elite under control, theyre the last person id trust with controller hardware in 2025.",
      "score": 1,
      "created_utc": 1735474206.0,
      "replies": []
    },
    {
      "id": "m4e2btm",
      "author": "JVIoneyman",
      "body": "They really need to get this out there. The controller is kind of holding back turning some features into platform agnostic conventions.",
      "score": 1,
      "created_utc": 1735496818.0,
      "replies": []
    },
    {
      "id": "m4f23nn",
      "author": "A_N_T",
      "body": "Just let it go bruh it's over. Become a publisher.",
      "score": 1,
      "created_utc": 1735507693.0,
      "replies": []
    },
    {
      "id": "m4felod",
      "author": "iamtheju",
      "body": "I'm happy for the people who like the Dualsense gimmicks but I personally turn all of the crap off and use it like a normal controller. \n\nManic vibration and stiff triggers are completely immersion-breaking for me as they just remind me I'm holding a controller. \n\nXbox already has the superior controller so I am not looking forward to them making it more expensive.",
      "score": 1,
      "created_utc": 1735511642.0,
      "replies": []
    },
    {
      "id": "m4ff491",
      "author": "briandt75",
      "body": "Doing just fine with my Playstation.",
      "score": 1,
      "created_utc": 1735511808.0,
      "replies": []
    },
    {
      "id": "m4grpnd",
      "author": "None",
      "body": "Kinect 2?",
      "score": 1,
      "created_utc": 1735528626.0,
      "replies": []
    },
    {
      "id": "m4mm0iz",
      "author": "Dolatron",
      "body": "Hope it survives my kids dropping the controller 300 times per month",
      "score": 1,
      "created_utc": 1735611398.0,
      "replies": []
    },
    {
      "id": "m4o32t0",
      "author": "MrTopHatMan90",
      "body": "Ngl I'm happy with the xbox S controller. I wouldn't even go for a pro controller the base model feels really nice to use",
      "score": 1,
      "created_utc": 1735636707.0,
      "replies": []
    },
    {
      "id": "m483lty",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1735409240.0,
      "replies": [
        {
          "id": "m48kds5",
          "author": "None",
          "body": "Actually Hall effects and TMR sticks are at better level than pots now. They have evolved and improved over the last year",
          "score": 2,
          "created_utc": 1735414671.0,
          "replies": [
            {
              "id": "m48lwv8",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1735415171.0,
              "replies": [
                {
                  "id": "m48mbet",
                  "author": "None",
                  "body": "Check out this guys channel he tests all sorts of hall and tmr sticks - https://youtu.be/psXxCTNB55I",
                  "score": 2,
                  "created_utc": 1735415305.0,
                  "replies": [
                    {
                      "id": "m48q7r0",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -1,
                      "created_utc": 1735416592.0,
                      "replies": [
                        {
                          "id": "m48ru9d",
                          "author": "None",
                          "body": "GPDL test shows board specific latency though so thats not really applicable to sticks only.   \n  \nI don't see 'jitter' on the circularity tests so I'm not sure what u mean here. Looks exactly like a pot stick to me \n\nMaybe no response curve tests but the K-silver ones report a linear response curve (better than pots actually). But these are on Gamesir controllers (T3 pro to be exact).",
                          "score": 3,
                          "created_utc": 1735417133.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m487q29",
          "author": "whewtang",
          "body": "Regardless of the reasons. There should be (but likely never will be) a full recall on these dysfunctional drifting ps5 controllers.",
          "score": 1,
          "created_utc": 1735410572.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48iicl",
      "author": "Intelligent-Luck8747",
      "body": "Xbox behind as always",
      "score": 1,
      "created_utc": 1735414059.0,
      "replies": []
    },
    {
      "id": "m47w35d",
      "author": "slammens",
      "body": "So, how hard is this going to jiggle my man-boobs?",
      "score": 1,
      "created_utc": 1735406792.0,
      "replies": []
    },
    {
      "id": "m49gw20",
      "author": "ActionFigureCollects",
      "body": "Roku TV = this is an XBox  \n\nTablet = this is an XBox  \n\nCellphone = this is an XBox  \n\nRefrigerator = this is an XBox  \n\nAirport check-in terminal = this is an XBox  \n\nTSA security check-point = this is an XBox  \n\nGoogle Stadia = this is an XBox  \n\nAmazon Luna = this is an XBox  \n\nPlayStation 5 = this is an XBox  \n\nNintendo Switch = this is an XBox  \n\nKitty Litterbox = this is an XBox  \n\nLetterbox format movies = this is an XBox\n\nXBox = we have no idea",
      "score": 1,
      "created_utc": 1735425496.0,
      "replies": []
    },
    {
      "id": "m493i7f",
      "author": "hangman401",
      "body": "Can they also make it not $75 for a controller that feels like it's imitating an Xbox controller in shape?",
      "score": 1,
      "created_utc": 1735421000.0,
      "replies": []
    },
    {
      "id": "m496ghu",
      "author": "ImaRiskit",
      "body": "Answer?? Don't you mean ripoff.",
      "score": 1,
      "created_utc": 1735421985.0,
      "replies": []
    },
    {
      "id": "m4ae3gs",
      "author": "None",
      "body": "Microsoft will sue or buy out before competing, it’s their core ideology.  Internal culture day and be is curb stomp your neighbor.",
      "score": 1,
      "created_utc": 1735437062.0,
      "replies": []
    },
    {
      "id": "m4agy3s",
      "author": "pokemon-sucks",
      "body": "Just got a PS5 for christmas. And damn I hate those fat bloated MS controllers.",
      "score": 1,
      "created_utc": 1735438129.0,
      "replies": []
    },
    {
      "id": "m4bsw1c",
      "author": "Superseaslug",
      "body": "Please. The Xbox controllers have been woefully behind the curve for over a decade. I wish it wasn't my preferred button layout because dual sense controllers are so much nicer",
      "score": 1,
      "created_utc": 1735460590.0,
      "replies": []
    },
    {
      "id": "m4bv36g",
      "author": "cunningmunki",
      "body": "Still just a very comfortable potato without a gyro.",
      "score": 1,
      "created_utc": 1735462014.0,
      "replies": []
    },
    {
      "id": "m4c98id",
      "author": "toluwalase",
      "body": "I love the triggers and haptic feedback of the dual sense so much I bought it for my PC even though I have multiple Xbox Series controllers. For some games I prefer the looser thumb sticks of the Xbox controller like FIFA for skilling but driving in Cyberpunk with the dual sense is a joy",
      "score": 1,
      "created_utc": 1735471260.0,
      "replies": []
    },
    {
      "id": "m4hti55",
      "author": "deathbunnyy",
      "body": "xbox controllers are absolute garbage. The face buttons literally just don't work if you press them down lightly in a certain position. You can press them down completely, and it won't ever go off.\n\nAlso, every single controller has triggers that stick. 2 friends and I played Need For Speed on game pass, we all suffered from a stuck throttle because the trigger would fucking stick for a split second when fully-depressed if you let off it. Eventually, WE ALL NOTICED THIS PROBLEM. Me and one other friend even tried different controllers, same issue.\n\nIt's absolutely pathetic, Dual Sense is flawless. I have 2 of them when I got my PS5 in 2020, they are still what I use. Thousands of hours on them, no issues.",
      "score": 1,
      "created_utc": 1735546470.0,
      "replies": [
        {
          "id": "m4im70w",
          "author": "No_Accident2331",
          "body": "Dude, wash your hands. I have Xbox controllers all the way back from my original that don’t stick.",
          "score": 3,
          "created_utc": 1735563754.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4j9ss0",
      "author": "Gamebird8",
      "body": "Just don't integrate the battery.  Leave it so I can use rechargeable AA batteries and save on the e-waste",
      "score": 1,
      "created_utc": 1735572903.0,
      "replies": []
    },
    {
      "id": "m48h1vv",
      "author": "ChafterMies",
      "body": "By the time Microsoft makes a competitor to the DualSense controller, Sony will have a DualSense 2 and Xbox will have an even smaller install base.",
      "score": 0,
      "created_utc": 1735413584.0,
      "replies": []
    },
    {
      "id": "m48mx61",
      "author": "_black_milk",
      "body": "I prefer the Xbox controller to the PlayStation, the PS makes my hands cramp.",
      "score": 0,
      "created_utc": 1735415502.0,
      "replies": []
    },
    {
      "id": "m49wmxs",
      "author": "aacawe",
      "body": "I don’t own an Xbox. I had a 360 maybe 10 years ago I guess. I’m a PlayStation fan. But even I know Xbox makes the best controllers, always have. Why do they need an answer for anything?",
      "score": -2,
      "created_utc": 1735430992.0,
      "replies": [
        {
          "id": "m4aky6g",
          "author": "Nottingham_Sherif",
          "body": "No way. Maybe the 360 controller, but the dual sense is so much better than the Xbox ones now",
          "score": 2,
          "created_utc": 1735439638.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m47qs37",
      "author": "Logictrauma",
      "body": "Microsoft could just try making a good game.",
      "score": -10,
      "created_utc": 1735405044.0,
      "replies": [
        {
          "id": "m47uhju",
          "author": "CaptainColdSteele",
          "body": "I'm just hoping I don't die of old age before tes vi comes out",
          "score": 3,
          "created_utc": 1735406266.0,
          "replies": []
        },
        {
          "id": "m47sqrg",
          "author": "resil_update_bad",
          "body": "Indiana Jones...?",
          "score": 3,
          "created_utc": 1735405692.0,
          "replies": [
            {
              "id": "m4832lg",
              "author": "KowardlyMan",
              "body": "IIRC it'll come out on PS5 for Easter, and there's already a steam version, it's not an exclusive.",
              "score": 4,
              "created_utc": 1735409062.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m482l57",
      "author": "Vazhox",
      "body": "I thought microsoft was done in the gaming community?",
      "score": 0,
      "created_utc": 1735408905.0,
      "replies": []
    },
    {
      "id": "m48spb0",
      "author": "Badmannoobie",
      "body": "It does and it is.",
      "score": 0,
      "created_utc": 1735417419.0,
      "replies": []
    },
    {
      "id": "m490mn1",
      "author": "guswang",
      "body": "Microsoft controllers just need to be better built: they’re noisy, feels cheap, and their last good dpad was on the 360.",
      "score": 0,
      "created_utc": 1735420038.0,
      "replies": [
        {
          "id": "m4aavdw",
          "author": "-NotEnoughMinerals",
          "body": "Playing on the PS5 controller, man that vibration is *so* much nicer. And the clickity fucking black of the buttons..\nITS NOT THERE. ITS AMAZING.",
          "score": 2,
          "created_utc": 1735435884.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m4c1zwg",
      "author": "VirtualPoolBoy",
      "body": "Is the controller the issue?",
      "score": 0,
      "created_utc": 1735466568.0,
      "replies": []
    },
    {
      "id": "m4cg8ib",
      "author": "daredwolf",
      "body": "I hope they move away from AA batteries for that controller.",
      "score": 0,
      "created_utc": 1735475472.0,
      "replies": []
    },
    {
      "id": "m4djema",
      "author": "None",
      "body": "Honestly it doesn't matter how many bells and whistles they add to their controllers, because they're probably still going to feel wrong, which is why I've never left Playstation. Just the controller won me over in the PS1 days, and almost nothing else besides their terrible controllers keeps me from owning an xbox. Nintendo has the same problem, but I tend not to play as seriously on Nintendo so it's not as important. \n\nIf everyone wants their controllers to feel like Sony's, it goes past the features into the form. Because the thing about Sony's controllers that makes them feel good, has been the same since the first one. And to know what that is, all you have to do is look at an xbox or Nintendo controller, look at a Sony controller, identify what's the sole difference, then look at your hands, and there's the answer. Because I don't know about anyone else on the planet, but my thumbs are in the same place on each hand. I am not a crab, I don't have one finger thats an inch longer at a different angle. My hands are mostly symmetrical, so the controller should be too. All the haptic feedback and sensors and crap in the world do not make the controller itself feel better.",
      "score": 0,
      "created_utc": 1735490971.0,
      "replies": []
    },
    {
      "id": "m47tps4",
      "author": "Discobastard",
      "body": "#🤡",
      "score": -1,
      "created_utc": 1735406012.0,
      "replies": []
    },
    {
      "id": "m48cnm7",
      "author": "None",
      "body": "The DualSense sucks tho. Xbox controller is much better",
      "score": -1,
      "created_utc": 1735412160.0,
      "replies": [
        {
          "id": "m48g7r1",
          "author": "Chronotaru",
          "body": "Xbox's controller was better than the DS4, but right now Xbox have nothing to answer against the DualSense.",
          "score": 1,
          "created_utc": 1735413308.0,
          "replies": [
            {
              "id": "m48ilpy",
              "author": "None",
              "body": "How? Just saying it doesn’t make it true",
              "score": 1,
              "created_utc": 1735414090.0,
              "replies": [
                {
                  "id": "m48jtsn",
                  "author": "Chronotaru",
                  "body": "New ideal shape and weight, gyros, haptics, adaptive triggers. Touchpad is mostly irrelevant. Internal speaker and mic, although don't know if those are on the Elite.",
                  "score": 1,
                  "created_utc": 1735414489.0,
                  "replies": [
                    {
                      "id": "m48mjqx",
                      "author": "None",
                      "body": "Why do I need a speaker in my controller? A touchpad? \n\nIt has more features but it isn’t inherently better.",
                      "score": 2,
                      "created_utc": 1735415380.0,
                      "replies": [
                        {
                          "id": "m48u2he",
                          "author": "ElDoRado1239",
                          "body": "To make the gamepad heavier and last a shorter time.",
                          "score": 2,
                          "created_utc": 1735417874.0,
                          "replies": [
                            {
                              "id": "m49a4a3",
                              "author": "None",
                              "body": "Exactly. The ps5 controller is ok. But it’s not some perfect design. No one made their console decision on the controller design. PlayStation has better exclusives and greater presence in the market. The controller is an after thought",
                              "score": 1,
                              "created_utc": 1735423196.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m48no3u",
                          "author": "Chronotaru",
                          "body": "If you don't understand why haptics, adaptive triggers and an internal speaker add to the experience, play Astro's Playroom which is free on every PS5.\n\nEven without those though, the DualSense has an amazing feel.",
                          "score": 1,
                          "created_utc": 1735415750.0,
                          "replies": [
                            {
                              "id": "m48or89",
                              "author": "None",
                              "body": "I’d argue the Xbox feel is better. Haptics haven’t done enough to offer a significant change in button and trigger feel and the speaker is gimmicky at best. \n\nI’d also argue the removable battery of the Xbox controller makes it more useful. Less gimmick and more utility of purpose",
                              "score": 1,
                              "created_utc": 1735416109.0,
                              "replies": [
                                {
                                  "id": "m48pf00",
                                  "author": "Chronotaru",
                                  "body": "The removable battery is the best feature of Xbox controllers but this is a legacy feature and isn't on the Elite.",
                                  "score": 2,
                                  "created_utc": 1735416327.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m48pdrj",
          "author": "TjbMke",
          "body": "The vibration in an Xbox controller feels like an N64 rumble pack.",
          "score": 1,
          "created_utc": 1735416315.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m48b47t",
      "author": "KaiKamakasi",
      "body": "I don't want it.\n\nDualsense controllers die in like 5 hours. Sure the features are great, but if I wanted a wired controller, I'd buy a wired controller.",
      "score": -1,
      "created_utc": 1735411669.0,
      "replies": [
        {
          "id": "m48gfcd",
          "author": "Chronotaru",
          "body": "Xbox controllers' best feature is the switchable battery pack. Even if it only holds fine hours it needn't need a cable.",
          "score": 1,
          "created_utc": 1735413376.0,
          "replies": [
            {
              "id": "m48gllr",
              "author": "KaiKamakasi",
              "body": "The elite series controller is a built in rechargable. It lasts up to 40 hours.\n\nI can guarantee a controller to \"match the dualsense\" will also be a built in battery",
              "score": 2,
              "created_utc": 1735413435.0,
              "replies": [
                {
                  "id": "m48guhe",
                  "author": "Chronotaru",
                  "body": "Ah, sorry to hear that.",
                  "score": 1,
                  "created_utc": 1735413517.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m48mpqt",
      "author": "PM_YOUR_CENSORD",
      "body": "Is it generally accepted now PlayStation has a better controller? I’ve always felt XBOX had the superior controller and didn’t need to “answer” to a PlayStation.   \n  \nThe parallel sticks I just can’t do, personally.",
      "score": -1,
      "created_utc": 1735415434.0,
      "replies": []
    },
    {
      "id": "m47s2zv",
      "author": "Cool_Being_7590",
      "body": "Where the fuck is Microsoft's answer to the PSVR?",
      "score": -7,
      "created_utc": 1735405474.0,
      "replies": [
        {
          "id": "m484ol7",
          "author": "Grapes-RotMG",
          "body": "Sony themselves don't even have an answer to PSVR lmao",
          "score": 1,
          "created_utc": 1735409591.0,
          "replies": []
        },
        {
          "id": "m47squa",
          "author": "TheWhooooBuddies",
          "body": "MS didn’t think VR was anything but a fad. \n\nThat hasn’t worked out so well for them. \n\nBy the time they get into the game, Sony and Meta will have literal years of R&D under their belts.",
          "score": -5,
          "created_utc": 1735405693.0,
          "replies": [
            {
              "id": "m47thq8",
              "author": "snorcack",
              "body": "MS literally had the Mixed Reality toolkit integrated with custom devices. It was the only other alternative to SteamVR. Too bad they discontinued the software, but they definitely had a VR presence before Sony.",
              "score": 5,
              "created_utc": 1735405939.0,
              "replies": []
            },
            {
              "id": "m47wyu3",
              "author": "SolidOshawott",
              "body": "So far it has worked out, because so far it has been a fad. Meta is doing ok but it's still a niche product while both Sony and Apple struggled to hit the mark.",
              "score": 5,
              "created_utc": 1735407080.0,
              "replies": []
            },
            {
              "id": "m47va39",
              "author": "Cool_Being_7590",
              "body": "Think they've partnered with Meta and left VR in their hands",
              "score": 2,
              "created_utc": 1735406526.0,
              "replies": []
            },
            {
              "id": "m47xd2a",
              "author": "None",
              "body": "Yea they gave up on it for consoles. But they 100% support it on PC.",
              "score": 1,
              "created_utc": 1735407209.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m4a0uzy",
      "author": "AVLThumper",
      "body": "lol….xbox…they still making these pieces of shit?",
      "score": -4,
      "created_utc": 1735432414.0,
      "replies": []
    }
  ]
}