{
  "post": {
    "title": "Apple to stop selling iPhone SE and iPhone 14 in Europe as USB-C deadline hits",
    "author": "chrisdh79",
    "id": "1hda6w5",
    "score": 2370,
    "created_utc": 1734089189.0,
    "selftext": "",
    "num_comments": 193,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1hda6w5/apple_to_stop_selling_iphone_se_and_iphone_14_in/"
  },
  "comments": [
    {
      "id": "m1vw8m5",
      "author": "TheMacMan",
      "body": "Technically, this isn't because of the USB-C deadline. The law applies to devices INTRODUCED after January 1, 2025. Since the iPhone SE and iPhone 14 were introduced before then, they can continue sale if they choose. It's only NEWLY RELEASED devices that must have USB-C. So this is Apple's choice, not due to the EU regulations.",
      "score": 746,
      "created_utc": 1734109960.0,
      "replies": [
        {
          "id": "m1vzspj",
          "author": "ughnotanothername",
          "body": "> Technically, this isn't because of the USB-C deadline. The law applies to devices INTRODUCED after January 1, 2025. Since the iPhone SE and iPhone 14 were introduced before then, they can continue sale if they choose. It's only NEWLY RELEASED devices that must have USB-C. So this is Apple's choice, not due to the EU regulations.\n\nMakes total sense, thanks for the useful information.",
          "score": 183,
          "created_utc": 1734111094.0,
          "replies": [
            {
              "id": "m1w1owc",
              "author": "TheMacMan",
              "body": "No problem. Initially folks were saying that it'd effect the current iPhone but it would really not impact them until the iPhone 17 release in 2026, because it'd be the first new model introduced after the requirement went into effect.\n\nFolks need to remember this only applies to cellphones. The same does not apply to things like laptops and other USB-powered devices.",
              "score": 65,
              "created_utc": 1734111693.0,
              "replies": [
                {
                  "id": "m1yapjp",
                  "author": "Dick_in_owl",
                  "body": "New iPhones every year around September so, the iPhone 17 will release in 2025 as the 16 was 2024",
                  "score": 14,
                  "created_utc": 1734139503.0,
                  "replies": [
                    {
                      "id": "m1yzhl6",
                      "author": "Buttersaucewac",
                      "body": "There’s been talk of them changing to an 18 month schedule as the hardware progress slows, but I don’t know how reliable those reports are or when they’ll switch. People aren’t upgrading as often as they used to.",
                      "score": 10,
                      "created_utc": 1734150198.0,
                      "replies": [
                        {
                          "id": "m1znrpr",
                          "author": "Dick_in_owl",
                          "body": "Maybe hardware sales of iPhones has been static for 9 years.",
                          "score": 4,
                          "created_utc": 1734164470.0,
                          "replies": []
                        },
                        {
                          "id": "m22yrek",
                          "author": "y0l0naise",
                          "body": "I don’t think that makes a lot of sense. A lot of people get their phones with a plan, which typically run for 1 or 2 years. Hijacking this already existing pattern makes it so much easier for them to make money off of.\n\nThey have been experimenting with slowing down hardware releases in another, however. Initially by putting new insides in older outsides, with the iPhone SE, but also my iPhone 15 carries the same processor as the iPhone 14 Pro did. This basically means putting a year old hardware in that year’s phone.\n\nThey’ve changed back with the iPhone 16 though",
                          "score": 1,
                          "created_utc": 1734215356.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1yhcg1",
                  "author": "NotSoCoolWaffle",
                  "body": "SE 4 is gonna be here before 17 though",
                  "score": 4,
                  "created_utc": 1734142190.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1zjg4i",
              "author": "PolloCongelado",
              "body": "Why would you quote the ENTIRE comment you're replying to? lol",
              "score": 5,
              "created_utc": 1734161554.0,
              "replies": [
                {
                  "id": "m1zko7s",
                  "author": "KrtekJim",
                  "body": "> Why would you quote the ENTIRE comment you're replying to? lol\n\nI agree, what kind of madman would do that",
                  "score": 12,
                  "created_utc": 1734162393.0,
                  "replies": [
                    {
                      "id": "m1zydsa",
                      "author": "Eruannster",
                      "body": "> I agree, what kind of madman would do that\n\n\nTruly insane. \\*Eye twitch*",
                      "score": 6,
                      "created_utc": 1734172013.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1zzvvo",
                  "author": "subaru5555rallymax",
                  "body": ">Why would you quote the ENTIRE comment you're replying to? lol\n\n….posterity?",
                  "score": 4,
                  "created_utc": 1734173076.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1wh3w9",
          "author": "randompantsfoto",
          "body": "Yup, this is totally Apple taking advantage of the situation and spinning it as an excuse to only sell newer, more expensive phones!  Sneaky.",
          "score": 68,
          "created_utc": 1734116572.0,
          "replies": [
            {
              "id": "m1zgox0",
              "author": "PlayingDoomOnAGPS",
              "body": "They're just discontinuing old product, like every normal company does. The 14 was 2 generations ago. Why would they keep making 14s when that production line could be making newer phones. \n\nApple probably keeps old models of product for sale longer than most others, but after a point, they're just not worth it any more. I'd be shocked if Apple were moving significant units of 14s and they never sold significant units of the SE.",
              "score": 3,
              "created_utc": 1734159729.0,
              "replies": [
                {
                  "id": "m2f4m74",
                  "author": "LetsJerkCircular",
                  "body": "They allude to it in the article, but Apple has what they call their “lineup.” It’s basically their list of devices that are currently still for sale, brand new, through Apple.\nLike they said in the article, Apple would typically keep the 14° and the SE^(3) in *the lineup* until the 17 series comes out and when a new SE comes out, respectively.\nRegardless of the validity or reasoning behind this, we’re all here talking about Apple.",
                  "score": 1,
                  "created_utc": 1734396365.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1wl11h",
              "author": "TheMacMan",
              "body": "How many old iPhone 14 are they selling in Europe when they have the 15 and 16 available? Come on, it's been out for over 3 years. It's not as if buyers haven't had enough time to make that purchase if they wanted it. Guess they'll just have to purchase a refurbished unit.",
              "score": 15,
              "created_utc": 1734117803.0,
              "replies": [
                {
                  "id": "m1xgyw6",
                  "author": "Kramer7969",
                  "body": "I just bought a 12, was an upgrade from the X.\n\nNo new phone does anything I can’t do or need to do. People made fun of me in the early 2000s for always having a new phone (who needs a phone with a camera they asked lol) now is the opposite.",
                  "score": 13,
                  "created_utc": 1734128305.0,
                  "replies": [
                    {
                      "id": "m1yks6k",
                      "author": "rogue_giant",
                      "body": "Im happy with the iPhone SE that I have. It’s not a mega sized phone that barely fits in my pocket and I much rather prefer having an actual home button over a slightly larger screen.",
                      "score": 3,
                      "created_utc": 1734143642.0,
                      "replies": [
                        {
                          "id": "m1zp8lv",
                          "author": "AbyssalRedemption",
                          "body": "Same, had the SE 2020 since its release (and honestly, it's the last phone that has the basic features that I actually *like* and would go for, given the choice). I HATE how we're still getting bigger and bigger phones, and the companies keep pushing for that \"no buttons, only screen\" design model. Give me back my compact phone with tactile feedback smfh.",
                          "score": 3,
                          "created_utc": 1734165501.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m1yzzmt",
                      "author": "Buttersaucewac",
                      "body": "I get the new upgrades every 2 years through work (Galaxy, A and iPhone, doing QA on our mobile apps) and it never feels like a noticeable difference anymore for the high end flagship models. The budget models are improving steadily but iPhone 12 to 14 to 16, only minor incremental improvements. I would happily use an iPhone 12 today and miss nothing.",
                      "score": 3,
                      "created_utc": 1734150442.0,
                      "replies": [
                        {
                          "id": "m1z9hqy",
                          "author": "blackweebow",
                          "body": "I didnt even know my work iphone 12 was an Xr until yesterday. There is no difference outside of the number of cameras on the back",
                          "score": 2,
                          "created_utc": 1734155361.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "m1zp2mq",
                      "author": "AbyssalRedemption",
                      "body": "Same, been content with my 2020 SE since it came out, and will probably gold onto it until the security updates stop in two-three years or so. I don't want, nor need, any of the fancy AI mumbo-jumbo every new phone comes with now. Don't want any new gimmicky tech either, like the folding screen trend we're seeing now. Just give me a phone that fits in the palm of my hand; has a decent processor; decent batter; large hard drive; and the ability to access every conventional app I need, and I'm content.",
                      "score": 3,
                      "created_utc": 1734165383.0,
                      "replies": [
                        {
                          "id": "m21vhze",
                          "author": "cyankitten",
                          "body": "Some of the things the newer models have erm I have an XS 😳 \n\nWell I don’t WANT fingerprint recognition etc - I don’t mind it as an OPTION but I’d be wary of anything that forced it.  Nor do I want 5G & I’ll stay away from that for as long as I possibly can.  Again, I don’t mind if it’s an OPTION but I don’t want a phone that ONLY has 5G & fingerprints.\n\nI’m keeping my XS too as long as I can.  I don’t know how much longer it has left but yeah.\n\nWith a bajillion photos too sometimes that switch over is a pain too!",
                          "score": 2,
                          "created_utc": 1734201530.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1zykjs",
                  "author": "Eruannster",
                  "body": "Electronic retailers are still selling iPhone 11 and 12 models at a pretty hefty discount compared to newer models. They are still incredibly good phones, even by today's standards.\n\n\nI'm still rocking an iPhone XR, and it's still getting updates...",
                  "score": 3,
                  "created_utc": 1734172146.0,
                  "replies": [
                    {
                      "id": "m21vnau",
                      "author": "cyankitten",
                      "body": "For me XS recently it updated too.",
                      "score": 1,
                      "created_utc": 1734201580.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1x7ofz",
                  "author": "Jim3001",
                  "body": "Realistically, the question should be, \"How many people don't want to shell out €1000+ for a phone?\" I guarantee that those older models are being sold cheaply to kids and the elderly.",
                  "score": 9,
                  "created_utc": 1734125199.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1xg22z",
          "author": "Mystic_L",
          "body": "I’ve just had a quick scan of the EU common charger regulation which this article is referring to. The regulation applies to devices “being placed on the market” simplistically that is typically as it arrives in the first port within the EU. Placed on the market applies to each individual device, so it’s entirely plausible that this blocks Apple from “making the device available” if it wasn’t already in the EU at the cut off date.\n\nChanging the the lightning port for a usb-c port is likely not as straight forward as it seems, it may drive the need for a complete change to the pan to accommodate the port if it’s a different wiring configuration, size or power regulation needs. There would be a change to the design of the case and the assembly line to manufacture. Plus changes to middleware and drivers to support the change,and need be supported in life for the phone in software updates, this could run into the millions.\n\nI’d guess Apple have taken the decision, with a relatively old device, to discontinue it for the EU as the cost / benefit doesn’t stack up",
          "score": 14,
          "created_utc": 1734127990.0,
          "replies": [
            {
              "id": "m1zyh96",
              "author": "Eruannster",
              "body": "Also, they are rumored to be launching a new iPhone SE model in early 2025 which I assume may compete with the 14 and SE in price/features and they would rather have customers buy their New Cool Thing.",
              "score": 5,
              "created_utc": 1734172081.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1xjsn8",
          "author": "loljetfuel",
          "body": "> The law applies to devices INTRODUCED after January 1, 2025. \n\nI've seen people saying this and people disputing this (saying it's any new device SOLD after that date), but I haven't seen an authoritative source either way. Any chance you have one handy?",
          "score": 5,
          "created_utc": 1734129296.0,
          "replies": [
            {
              "id": "m1xkakt",
              "author": "TheMacMan",
              "body": "Not offhand but the adopted text is linked at the bottom of this release.\n\nhttps://www.europarl.europa.eu/news/en/press-room/20220930IPR41928/long-awaited-common-charger-for-mobile-devices-will-be-a-reality-in-2024",
              "score": 4,
              "created_utc": 1734129470.0,
              "replies": [
                {
                  "id": "m1xlw4t",
                  "author": "loljetfuel",
                  "body": "Appreciate that. Based on that source, I was able to find the EU's implementation guide which says:\n\n>This will not prevent **existing stock of equipment that have been placed on the EU market** before the entry into application of the new rules from being sold legally after the entry into application of the new rules. The ‘Blue Guide’ contains further detailed guidance on that matter, notably in section 2. See also the answer to question 43. (emphasis mine, [source](https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=OJ:C_202402997))\n\nSo it's actually _incorrect_ to say that it only applies to items introduced after that date; it applies to items _placed on the market_ after that date. That term applies to devices, not models or model lines. That means that if there are iPhones with lightning connectors already in stock within the EU, they don't have to be removed from stock after the rule goes into effect. But Apple cannot ship additional phones with that connector into the market after that date.",
                  "score": 20,
                  "created_utc": 1734130030.0,
                  "replies": [
                    {
                      "id": "m1yluce",
                      "author": "brucebrowde",
                      "body": "My understanding is iPhone SE and 14 are not being produced anymore, so this point is kind of moot.",
                      "score": -2,
                      "created_utc": 1734144089.0,
                      "replies": [
                        {
                          "id": "m1yw8xw",
                          "author": "None",
                          "body": "[deleted]",
                          "score": 4,
                          "created_utc": 1734148654.0,
                          "replies": [
                            {
                              "id": "m1z2eg7",
                              "author": "brucebrowde",
                              "body": "If they *really* wanted to continue selling in EU, they could have just shipped them before the end of 2024. I don't really see this law being relevant for this particular case.\n\nIt looks to me Apple is just using the law as a scapegoat in order to push for newer phones. It's not in their best interest to sell old models when they have higher margins on newer ones.",
                              "score": 3,
                              "created_utc": 1734151626.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1zz7fw",
          "author": "Oreelz",
          "body": "Im realy gering tired of this shit.\n\nBig companys blame EU regualtions for buisness decisions is dangerous. They want to damage the trust to democratic goverments and institutions. Which is unverstandable cause the EU in fact regulates them in favor for the customer. \n\nEU: You can‘t sell new products without usb-c\nApple: Bohoo the EU doesn‘t allow us to sell our old products, buy our new expensive shit.\n\nEU: You can‘t exploit your monopole and cut out the competition.\nGoogle: Bohoo the EU forbids that we link Maps",
          "score": 12,
          "created_utc": 1734172597.0,
          "replies": []
        },
        {
          "id": "m1zybad",
          "author": "Eruannster",
          "body": "Also, this only seems to apply to Apple themselves. Other retailers will happily sell stock of whatever iPhones they have lying around. Hell, you can still buy iPhone 11 and 12 from electronic retailers at a pretty decent discount.\n\n\nI assume that Apple is halting sales of these devices because they want to sell their rumored upcoming new iPhone SE which is rumored to launch early 2025 and they don't want to cut into their own sales with competing devices.",
          "score": 3,
          "created_utc": 1734171964.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1uew91",
      "author": "Jugales",
      "body": "Might not be a popular Reddit opinion but that’s fair. Can’t expect companies to go back to the design board for previous generations of products. People who want cheaper phones will probably go to Android. When the consumer and company are both losing, that’s compromise. The benefit is universal charging, and I think it’s worth the loss.",
      "score": 416,
      "created_utc": 1734089737.0,
      "replies": [
        {
          "id": "m1ujtlg",
          "author": "Sylvurphlame",
          "body": "Doesn’t the rumor mill say they’re releasing an iPhone SE4 in March or April? That would have USBC anyway.",
          "score": 128,
          "created_utc": 1734092384.0,
          "replies": [
            {
              "id": "m1x05nm",
              "author": "obi1kenobi1",
              "body": "Yeah but the rumor mill also said it would be March 2024, and before that it said late 2023. When it comes to the SE specifically the rumor mill is exactly that, unfounded rumors with no basis in reality.",
              "score": 19,
              "created_utc": 1734122721.0,
              "replies": [
                {
                  "id": "m1yagmy",
                  "author": "Sylvurphlame",
                  "body": "It’s not really any more unfounded than the rumors that fly around about the iPhone and iPhone Pro until right before the actual release. That’s where you have to apply critical thinking. A fourth generation iPhone SE in 2023 never made any sense because \n1) they had just released one in 2022 and\n2) Apple was having to look at shifting to USBC for the EU. No way were they releasing USBC on the iPhone SE before it debuted on the iPhone and iPhone Pro.\n\nA 2024 release was a little more plausible but I suspect they had to change things to accommodate Apple Intelligence which delayed production.",
                  "score": 8,
                  "created_utc": 1734139404.0,
                  "replies": []
                },
                {
                  "id": "m21vnmg",
                  "author": "None",
                  "body": "To be fair, us SE users aren’t probably the types that buy a new device the instant they’re released, or we wouldn’t have the cheapest version of the iPhone. I’m not sitting here waiting for the new version. When mine breaks I’ll buy it",
                  "score": 2,
                  "created_utc": 1734201583.0,
                  "replies": [
                    {
                      "id": "m22dco5",
                      "author": "obi1kenobi1",
                      "body": "That kind of depends on which rumor you follow and why you want an SE.\n\nIf you’re a home button holdout then the idea of a new phone in that form factor could be a day one buy. Or even a hypothetical phone that ditches the home button but has an iPad-style TouchID sensor instead of FaceID could appeal to some people. Or you could be like my father, who is hoping for the next SE to have the 12/13 Mini form factor but with USB-C like his work phone. He’s been putting off upgrading his SE2 for almost a year now, waiting for the SE that might not even happen instead of buying a 13 Mini or a cheap subsidized 15/16 that has USB-C, and no matter what form factor it ends up having he’ll probably be a day one buyer of the next SE.\n\nBut yeah, if it ends up being something more mundane like a normal iPhone 12-16 form factor with an LCD instead of OLED and one camera then it’s probably not going to have a lot of day one buyers.",
                      "score": 1,
                      "created_utc": 1734207710.0,
                      "replies": [
                        {
                          "id": "m22k311",
                          "author": "None",
                          "body": "I’m just thinking if apple had data that showed SE users would be buying a ton of them, they’d be faster to come out like other models of the iPhone. I’d be willing to bet money that most SE users purchase it for the cost, above all else. \n\nI do love my home button though",
                          "score": 2,
                          "created_utc": 1734210101.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m2qzq7v",
                  "author": "thehighshibe",
                  "body": "No one at Apple or Foxconn is willing to risk their job and legal issues just to leak the fuckin SE model of the iPhone lol\n\nGo big or go home , they’ll obviously risk it for the flagships if they’re going to risk it at all",
                  "score": 2,
                  "created_utc": 1734569190.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1zp2of",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1734165384.0,
              "replies": [
                {
                  "id": "m24c5wl",
                  "author": "Sylvurphlame",
                  "body": "How so? If they release another SE, it will have to be USBC unless they plan to just not sell it in Europe which seems a little unlikely.\n\nOr are you referring to the projected date?",
                  "score": 1,
                  "created_utc": 1734235257.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1uszhz",
              "author": "Inform-All",
              "body": "Not with the typical SE style. USBC and no home button. It’s also a marginally larger phone than before. With a higher price point than before. Seems to defeat the purpose of the SE.",
              "score": -16,
              "created_utc": 1734096491.0,
              "replies": [
                {
                  "id": "m1uuf2x",
                  "author": "Sylvurphlame",
                  "body": "The price point is only predicted to be *slightly* higher at $499 USD versus $429 (last I read). If anything that’s pretty good given inflation post COVID. And that’s not even talking about the spec bump to support AI Which will benefit you even if you don’t use AI.\n\nUSB-C is going to be mandatory to sell it in the EU.\n\nAs for the Home Button/Touch ID. Just let it go. It’s over. Those are dead technologies on the iPhone.",
                  "score": 38,
                  "created_utc": 1734097070.0,
                  "replies": [
                    {
                      "id": "m1uveve",
                      "author": "None",
                      "body": "[removed]",
                      "score": -64,
                      "created_utc": 1734097467.0,
                      "replies": [
                        {
                          "id": "m1v2h67",
                          "author": "Sylvurphlame",
                          "body": "To be honest I find it wild that people think it’s boot licking to *not* insist that a company continue to use an outdated design to please an increasingly small customer segment. It’s bizarre. Nevertheless, go forth and find your preferred phone.",
                          "score": 34,
                          "created_utc": 1734100148.0,
                          "replies": [
                            {
                              "id": "m1w260g",
                              "author": "ScoodScaap",
                              "body": "People love buzzwords",
                              "score": 2,
                              "created_utc": 1734111841.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1vn4nv",
                          "author": "FupaDeChao",
                          "body": "I’m sure Apple will be besides themselves when they find out ur switching brands",
                          "score": 16,
                          "created_utc": 1734107064.0,
                          "replies": [
                            {
                              "id": "m1wkk0a",
                              "author": "Plank_With_A_Nail_In",
                              "body": "He's not switching brands he's basically just admitted he wants it but can't afford it. The idea that he could save the difference pretty easily over then next 5 months seems beyound him.",
                              "score": 1,
                              "created_utc": 1734117657.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1v1qxe",
                          "author": "Sylvurphlame",
                          "body": "Continue to cope, friend. Products change over time. Switching brands is probably your personal best move. I sincerely wish you best of luck finding something you enjoy, despite your insulting response. It’s not insensitive, it’s encouraging you to move on because the Home Button is going away.",
                          "score": 18,
                          "created_utc": 1734099881.0,
                          "replies": []
                        },
                        {
                          "id": "m1vi4zo",
                          "author": "None",
                          "body": "Let me guess: you still complain about headphone jacks",
                          "score": 11,
                          "created_utc": 1734105464.0,
                          "replies": []
                        },
                        {
                          "id": "m1wkbn7",
                          "author": "Plank_With_A_Nail_In",
                          "body": "You aren't an SE customer you are just someone who bought an SE once. You don't have to chain yourself to the brand ffs just go buy a different phone if you don't like it ffs.\n\nHow do people make buying things as simple as a phone so hard for themselves?",
                          "score": 3,
                          "created_utc": 1734117584.0,
                          "replies": []
                        },
                        {
                          "id": "m1zf1l2",
                          "author": "Eraser92",
                          "body": "Good luck finding a small form factor, midrange android, with physical buttons. They don’t exist",
                          "score": 1,
                          "created_utc": 1734158689.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1uprch",
              "author": "None",
              "body": "[deleted]",
              "score": 0,
              "created_utc": 1734095136.0,
              "replies": [
                {
                  "id": "m1uti5i",
                  "author": "Sylvurphlame",
                  "body": "I mean they don’t *have* to, strictly. But they are highly likely to, in order to capture users for services if nothing else, and highly likely to want to be able to market and sell it in EU markets. So it’s very very likely we’ll see an SE4 with usb-c.",
                  "score": 7,
                  "created_utc": 1734096700.0,
                  "replies": []
                },
                {
                  "id": "m1uqmn3",
                  "author": "detailcomplex14212",
                  "body": "Wait you mean I can finally upgrade my 6s?",
                  "score": 4,
                  "created_utc": 1734095513.0,
                  "replies": []
                },
                {
                  "id": "m1vgi68",
                  "author": "tacmac10",
                  "body": "The SE4 is slated to come out in April and retail under $500.",
                  "score": 1,
                  "created_utc": 1734104939.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m1umlco",
          "author": "None",
          "body": "I don’t want a cheaper phone. I want the same size phone I have now. Apple 12 mini.",
          "score": 87,
          "created_utc": 1734093719.0,
          "replies": [
            {
              "id": "m1v0bx1",
              "author": "None",
              "body": "I have a really old SE. It’s small and I like that. I don’t need a phone the size of Texas. I have little hands and can’t get them around those huge ass ones.",
              "score": 30,
              "created_utc": 1734099356.0,
              "replies": []
            },
            {
              "id": "m1upten",
              "author": "hudsoncider",
              "body": "Yup, I have the iPhone 13 mini. Don’t want a huge phone",
              "score": 31,
              "created_utc": 1734095161.0,
              "replies": []
            },
            {
              "id": "m1w3onc",
              "author": "Woodwonk",
              "body": "My mini got destroyed, was so sad I could not replace it.\n\nWTF is with these giant phones that barely fit in a pocket!",
              "score": 9,
              "created_utc": 1734112315.0,
              "replies": []
            },
            {
              "id": "m1upuzj",
              "author": "ApatheticDomination",
              "body": "The 13 mini didn’t do well enough for them to continue those unfortunately. I loved mine.",
              "score": 23,
              "created_utc": 1734095181.0,
              "replies": [
                {
                  "id": "m1v63gw",
                  "author": "Few_Direction9007",
                  "body": "Not just didn’t sell well enough, it was the biggest iPhone flop of all time. The mini 1 was 5% of its generations sales and the mini 2 was 3%. Those are unbelievably awful sales figures. It’s too bad because it was a good product, but the mini was apocalyptically unpopular.",
                  "score": 14,
                  "created_utc": 1734101450.0,
                  "replies": [
                    {
                      "id": "m1w6xm5",
                      "author": "dertechie",
                      "body": "Honestly the mini feels like the kind of product you revive on a 3-5 year cycle, and sell for a year each time (and be clear that it’s a one year revival).  There’s not enough people buying to make sense for continuous production though.  3-5% of iPhone sales is still a lot of phones.",
                      "score": 10,
                      "created_utc": 1734113339.0,
                      "replies": []
                    },
                    {
                      "id": "m1vsx2o",
                      "author": "Mental_Tea_4084",
                      "body": "Everyone I've talked to that had one *loved* it though. I had to console several of them when I worked for Verizon, as they tried to order the latest mini just to find out that it doesn't exist.",
                      "score": 14,
                      "created_utc": 1734108900.0,
                      "replies": [
                        {
                          "id": "m1wl2yj",
                          "author": "Plank_With_A_Nail_In",
                          "body": "> Everyone I've talked to that had one\n\nThat's one other person lol, cool story dude.",
                          "score": -13,
                          "created_utc": 1734117820.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m1us3ri",
                  "author": "nomnomnomnomRABIES",
                  "body": "Make the SE the same size and numbers would be made up by those buying on price, and also give clearer differentiation for those who buy the flagship to show off",
                  "score": 8,
                  "created_utc": 1734096129.0,
                  "replies": [
                    {
                      "id": "m1uuah9",
                      "author": "_RADIANTSUN_",
                      "body": "Also it could actually look modern and not like an iPhone 8",
                      "score": 9,
                      "created_utc": 1734097018.0,
                      "replies": [
                        {
                          "id": "m1xmyc4",
                          "author": "mezzzolino",
                          "body": "I think it was intentional.  The SE was a way to have employees (optionally) use a company-supplied iPhone without having the luxury-vibes.",
                          "score": 1,
                          "created_utc": 1734130414.0,
                          "replies": [
                            {
                              "id": "m1y4vqo",
                              "author": "_RADIANTSUN_",
                              "body": "100% intentional but I don't think it's just for company-provided phones. \n\nThe SE is intentionally the \"poor people\" iPhone. It's supposed to give contrast to the \"proper\" ones.",
                              "score": 1,
                              "created_utc": 1734137213.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m1uv6r2",
                          "author": "lost_send_berries",
                          "body": "On a smaller phone they probably need that bezel space for the phone's internals",
                          "score": -5,
                          "created_utc": 1734097378.0,
                          "replies": [
                            {
                              "id": "m1v81la",
                              "author": "_RADIANTSUN_",
                              "body": "No they don't, iPhone 13 mini already exists, what are you talking about?",
                              "score": 11,
                              "created_utc": 1734102120.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m1uzjyd",
                      "author": "BWCDD4",
                      "body": "Mini users are delusional.\n\nWhy would you expect them to do that and cater to your niche when there is no substantial demand for a mini?\n\nThe SE is popular because its normal sized, larger phones in general are also more popular hence they released the 16 plus.\n\nAt best you can hope they turn it into an every 3-4 years phone.",
                      "score": -1,
                      "created_utc": 1734099065.0,
                      "replies": [
                        {
                          "id": "m1v0b3k",
                          "author": "cape2cape",
                          "body": "The mini has a larger screen than the SE.",
                          "score": 15,
                          "created_utc": 1734099347.0,
                          "replies": []
                        },
                        {
                          "id": "m1vt3nc",
                          "author": "mullse01",
                          "body": "The SE is popular because it’s the cheapest model.",
                          "score": 8,
                          "created_utc": 1734108956.0,
                          "replies": []
                        },
                        {
                          "id": "m1v20e5",
                          "author": "Pauly_Amorous",
                          "body": "> At best you can hope they turn it into an every 3-4 years phone.\n\nHonestly, that would be good enough. At least us small pone connoisseurs would have **ONE FUCKING OPTION** that's halfway decent. Apparently though, that's too much to ask for.",
                          "score": 12,
                          "created_utc": 1734099976.0,
                          "replies": []
                        },
                        {
                          "id": "m1v1nsb",
                          "author": "meeeeelz",
                          "body": "You are delusional. There is ample demand for a mini variant - I work in UX design and the amount of 13 Mini designers I work with outweigh the huge, cumbersome brick-like tablets we call phones today. \n\nThe 13 Mini has a smaller footprint than the current SE and a much larger screen.",
                          "score": -8,
                          "created_utc": 1734099849.0,
                          "replies": [
                            {
                              "id": "m1v4tn4",
                              "author": "Few_Direction9007",
                              "body": "Nah, you’re the one who’s delusional, don’t get me wrong I love the mini, I wish it was more popular, but it was apples biggest iPhone failure period. The first mini made up just 5% of the iPhone 13 generation sales and the mini 2 made up just 3% of the 14th gen. It was an absolute disaster of a product for them. Literally the worst selling iPhone ever made.\n\nSorry but with this one it’s absolutely the consumer telling Apple they don’t want this. A vocal minority *say* they want a small phone, but the sales numbers speak way louder than a few Reddit posts. Don’t blame Apple one bit, even though I very much wish I could get a modern mini with USB  C.",
                              "score": 10,
                              "created_utc": 1734101000.0,
                              "replies": [
                                {
                                  "id": "m1vbut9",
                                  "author": "theskyopenedup",
                                  "body": "Source?",
                                  "score": -4,
                                  "created_utc": 1734103413.0,
                                  "replies": [
                                    {
                                      "id": "m1vcivn",
                                      "author": "Few_Direction9007",
                                      "body": "Literally just google iPhone mini sales numbers dude. https://www.macrumors.com/2022/04/21/iphone-13-mini-unpopular-march-quarter/\n\nhttps://www.slashgear.com/1234403/apples-decision-to-cancel-the-iphone-mini-vindicated-by-new-report/",
                                      "score": 9,
                                      "created_utc": 1734103633.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "m1vifxy",
                              "author": "None",
                              "body": "UX design? Then you know things are never consistent.",
                              "score": 0,
                              "created_utc": 1734105563.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1wvprz",
              "author": "Fantasticxbox",
              "body": "Mini gang rise up",
              "score": 3,
              "created_utc": 1734121260.0,
              "replies": []
            },
            {
              "id": "m1wbh3c",
              "author": "Sylvurphlame",
              "body": "I do sometimes wish they’d have adopted the 5.8” X/XS body for our small phone aficionados. But we missed that boat as far as timing when they didn’t do it by the SE3.",
              "score": 2,
              "created_utc": 1734114784.0,
              "replies": []
            },
            {
              "id": "m1uwn72",
              "author": "Targox",
              "body": "I’m using an iPhone 11 as daily driver, I have a working 12 Pro Max here in the drawer that I just can’t get used to because it’s so freakin big. Now I read somewhere that the Pro Max’es are basically the best selling models. I really don’t get it. Even with bigger hands it’s impossible to reach the far end of these phones",
              "score": 3,
              "created_utc": 1734097950.0,
              "replies": [
                {
                  "id": "m1v7mhq",
                  "author": "technobrendo",
                  "body": "I don't get it either. I have an S23 which I wish was smaller. My wife has a 12 (or 13, not sure) Pro Max. Her hands are quite a bit smaller than mine, yet she loves the phone and it doesn't bother her. I can't stand using it.... Oh well",
                  "score": 2,
                  "created_utc": 1734101977.0,
                  "replies": []
                },
                {
                  "id": "m1w454e",
                  "author": "None",
                  "body": "See, I used to be all gung ho on smaller phones. Had an iPhone 5S as my first smartphone, then a XS, then my Galaxy S22. I smashed my Galaxy S22 with a dumbbell a couple weeks ago when I wasn't paying attention and am now borrowing my roommate's old Note 20. I actually find I can type so much more accurately on a larger display, and am not bothered by it as much now. I just ordered an iPhone 15 Pro Max to replace it, and I'm comfy with the size on it. I wasn't on a 16 Pro Max, though, which is the largest new smartphone and actually cannot be held one-handed because my hands are so small. \n\nI think it's one of those things where you use it long enough and kinda just gaslight yourself into liking it, because I was set on never getting a larger phone until now.",
                  "score": 2,
                  "created_utc": 1734112458.0,
                  "replies": [
                    {
                      "id": "m242gy7",
                      "author": "TheCatfishManatee",
                      "body": "Used a normal (read large) sized phone for at least a decade. Recent switched to an S23 and it's miles better. Haven't dropped my phone a single time in the 6 months since I bought it, it's easier to use single handed, even while swipe typing and it's not this huge ass thing in your pocket",
                      "score": 1,
                      "created_utc": 1734230987.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m1w7s7l",
                  "author": "dertechie",
                  "body": "I don’t get it either.  Got a PM when I upgraded to see what all the fuss was about.  Ended up returning it for a regular Pro.  \n\nIt has some upsides.  The big screen is nice and the battery lasts forever.  However, I can’t one hand it at all.  Every interaction beyond scrolling basically takes two hands.  The battery is amazing but it’s overkill.  I forgot to plug in last night and still have 47% on a Pro.",
                  "score": 2,
                  "created_utc": 1734113610.0,
                  "replies": []
                },
                {
                  "id": "m1v9nbh",
                  "author": "n00bForFun",
                  "body": "It just gets down to what you're used to, I was used to a 5.5\" display and can't use anything smaller, I hate small keyboards that get my fingers bumping into eachother when typing and watching videos on a tiny screen for example",
                  "score": 1,
                  "created_utc": 1734102670.0,
                  "replies": []
                },
                {
                  "id": "m1vc1n7",
                  "author": "None",
                  "body": "I can see it honestly. I have a 13 and while I absolutely love it. I do find certain things less ergonomic because I have larger hands. That said, the top to bottom reach on my 13 while using one hand is extremely difficult so there’s pros and cons to both sizes. Really I want a phone that is more square than a skinny rectangle. I’ve never liked the super wide screen feel of phones personally.",
                  "score": 1,
                  "created_utc": 1734103476.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1wnse6",
              "author": "Usernametaken1121",
              "body": "I want $1 million. Don't always get what we want 🤷",
              "score": -2,
              "created_utc": 1734118686.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1x9t6t",
          "author": "SkyeAuroline",
          "body": "> Can’t expect companies to go back to the design board for previous generations of products.\n\nWhich is why the law doesn't expect that.",
          "score": 11,
          "created_utc": 1734125910.0,
          "replies": []
        },
        {
          "id": "m1uhnfa",
          "author": "generally-speaking",
          "body": "It's not necessarily a loss either, instead of buying an iPhone 14 they have a new iPhone SE with USB-C in the pipeline. Which will likely end up being very good device for the money.",
          "score": 11,
          "created_utc": 1734091264.0,
          "replies": [
            {
              "id": "m1wbxoo",
              "author": "Sylvurphlame",
              "body": "If keeps that ≤$500 USD price and makes the jump to 8GB because Apple Intelligence (whether a user wants to use it or not) it will be a pretty decent deal.",
              "score": 1,
              "created_utc": 1734114931.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m21w2kf",
          "author": "cyankitten",
          "body": "It might be different now but my only problem with Android was at one stage it had a tiny fraction of the versions of the apps IOS had.  But that might be different now, IDK 🤷🏻‍♀️\n\nHaving said that, I also don’t know whether or not Android have a better battery?",
          "score": 1,
          "created_utc": 1734201724.0,
          "replies": []
        },
        {
          "id": "m24xvy4",
          "author": "razikp",
          "body": "They don't need to redesign it, they can continue to sell the old crappy ones without USB C, the law only applies to new phones. Apple want to get rid of the option to buy the old  cheaper phones that's why they re doing this.",
          "score": 1,
          "created_utc": 1734246601.0,
          "replies": []
        },
        {
          "id": "m1uho8l",
          "author": "IndestructibleNewt",
          "body": "They can still keep their old phones or buy secondhand on eBay for a one or two gens",
          "score": 1,
          "created_utc": 1734091277.0,
          "replies": []
        },
        {
          "id": "m1ufmyi",
          "author": "fixminer",
          "body": "Replacing a lightning port with a USB-C port isn’t a particularly complex redesign, but it is still understandable that they don’t want to retool their old assembly lines.",
          "score": -6,
          "created_utc": 1734090160.0,
          "replies": [
            {
              "id": "m1ug5ry",
              "author": "None",
              "body": "[deleted]",
              "score": 8,
              "created_utc": 1734090456.0,
              "replies": [
                {
                  "id": "m1ugwah",
                  "author": "originalusername__",
                  "body": "The rumor is the new SE will be usb c",
                  "score": -6,
                  "created_utc": 1734090862.0,
                  "replies": [
                    {
                      "id": "m1uk5mf",
                      "author": "Due-Bodybuilder9221",
                      "body": "rumor is it’ll have a touch screen",
                      "score": 17,
                      "created_utc": 1734092551.0,
                      "replies": [
                        {
                          "id": "m1xtz1c",
                          "author": "Smartnership",
                          "body": "Prolly run iOS idk",
                          "score": 3,
                          "created_utc": 1734133049.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m1yrszy",
          "author": "LeCrushinator",
          "body": "Apple had 2 years to make a minor change to those devices to use usb-c connectors. They easily could have, but I suspect they’ll release a new iPhone SE soon, and not selling the 14 isn’t a major deal, they can discount the 15 slightly if they need.",
          "score": -1,
          "created_utc": 1734146632.0,
          "replies": [
            {
              "id": "m1ywh76",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1734148760.0,
              "replies": [
                {
                  "id": "m1z2k8y",
                  "author": "LeCrushinator",
                  "body": "They design 4 new phones every year, giving them over 2 years to change the charging jack on an existing lineup is plenty.",
                  "score": -1,
                  "created_utc": 1734151706.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1wjngi",
      "author": "themellowmedia",
      "body": "Can we just get the mini back!? Pretty please!",
      "score": 24,
      "created_utc": 1734117373.0,
      "replies": [
        {
          "id": "m22ez0t",
          "author": "zippy72",
          "body": "I love my 13 mini, defo wouldn't buy a bigger iPhone. If anything I'd want an even smaller form factor than this one.",
          "score": 3,
          "created_utc": 1734208288.0,
          "replies": []
        },
        {
          "id": "m21ae8n",
          "author": "House_Of_Doubt",
          "body": "Unfortunately, it’s very unlikely we will see another mini. At least for several generations. Their low sales volume is just too hard to justify when considering all of the R&D and manufacturing costs that go into making a new model. \n\nWe may eventually see another, when demand is deemed high enough, and/or Apple feels like blowing some cash to gain/retain brand loyalty.",
          "score": 1,
          "created_utc": 1734194381.0,
          "replies": [
            {
              "id": "m21pun2",
              "author": "Ehmc130",
              "body": "I agree for the most part but I think the upcoming release of the 4th generation iPhone SE may take on more of that market segment of a smaller more economical entry into the Apple ecosystem. I don’t believe we’ll see a flagship model with a smaller chassis based on a more vocal minority of customers. I could be off base but I believe the iPhone Plus has been selling better than the Mini ever did. Cook has always been a numbers first CEO, if it’s not profitable enough he’s not going to let it happen.",
              "score": 1,
              "created_utc": 1734199599.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m224lwf",
          "author": "V_es",
          "body": "Nobody bought them so it’s probably never going to happen",
          "score": 1,
          "created_utc": 1734204645.0,
          "replies": []
        },
        {
          "id": "m1zg8gn",
          "author": "ChodaRagu",
          "body": "This is the most important question!",
          "score": 1,
          "created_utc": 1734159432.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1usnsq",
      "author": "TigerUSA20",
      "body": "Well Apple is now up to 16, so probably not a big loss for them at this point. All the used phone suppliers will still have 14’s in mass quantities for re-sale.",
      "score": 23,
      "created_utc": 1734096358.0,
      "replies": [
        {
          "id": "m1vpw1f",
          "author": "chth",
          "body": "Also at least in my opinion it makes very little sense to buy older generation products directly from Apple anyways.",
          "score": 7,
          "created_utc": 1734107937.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1ue3qh",
      "author": "chrisdh79",
      "body": "From the article: As [reported](https://www.igen.fr/iphone/2024/12/apple-va-arreter-la-vente-des-iphone-se-et-iphone-14-dans-lunion-europeenne-147523) by iGeneration, Apple will stop selling the iPhone SE and the iPhone 14 series at the end of the year, as the USB-C universal charging connector deadline comes into effect.\n\nRight now, the oldest phones still sold directly through Apple are the third-generation iPhone SE, the iPhone 14 and the iPhone 14 Plus. As these phones feature a Lightning port, they are in violation of the European Union policy, which goes into effect starting January 2025.\n\nApple could have elected to make a new version of these devices with USB-C ports instead of Lightning, but they have not done so. Instead, the company has decided to simply discontinue these models slightly earlier than they otherwise would.\n\nHowever, it is not that big a loss. In spring 2025, Apple will launch the new fourth-generation iPhone SE, which will naturally feature a USB-C port. (The new iPhone SE is expected to resemble an iPhone 14 in chassis design, featuring edge-to-edge screen, upgraded camera, and USB-C charging.)",
      "score": 46,
      "created_utc": 1734089267.0,
      "replies": [
        {
          "id": "m1vwci8",
          "author": "TheMacMan",
          "body": "This is not due to the USB-C requirement, as it doesn't apply to these phones. That is incorrect.",
          "score": 37,
          "created_utc": 1734109994.0,
          "replies": []
        },
        {
          "id": "m1v9piv",
          "author": "punkerster101",
          "body": "I mean the iPhone 14 does have a new model serval",
          "score": 0,
          "created_utc": 1734102691.0,
          "replies": [
            {
              "id": "m1va3gu",
              "author": "darkmacgf",
              "body": "Serval cat?",
              "score": 9,
              "created_utc": 1734102821.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1wfxk4",
      "author": "thegooddoktorjones",
      "body": "As a lover of the mini iphone, I weep.  Would love a USB-C phone, but I will not buy a huge one any time soon.",
      "score": 4,
      "created_utc": 1734116199.0,
      "replies": []
    },
    {
      "id": "m1uunzi",
      "author": "Zockgone",
      "body": "I understand that it makes sense for new products but why limit the sales of allready released products? I mean  the SE is a quite popular device for businesses.",
      "score": 13,
      "created_utc": 1734097170.0,
      "replies": [
        {
          "id": "m1vg7z3",
          "author": "epsilona01",
          "body": "> why limit the sales of allready released products\n\nIt doesn't really. Apple will have wound down their own inventory, but supplies will still exist elsewhere in the market.",
          "score": 5,
          "created_utc": 1734104848.0,
          "replies": []
        },
        {
          "id": "m1uvkwe",
          "author": "lost_send_berries",
          "body": "Because there's loads of devices with long update cycles that would just never get changed, like portable speakers. Also, the government doesn't have a list of every electronic device sold, they don't know when a device was introduced.",
          "score": 9,
          "created_utc": 1734097532.0,
          "replies": [
            {
              "id": "m1v5v2a",
              "author": "chrisagiddings",
              "body": "Someone authorizes the CE mark for electronics in Europe, so the bureaucracy absolutely knows when the device was released and could enforce penalties on only newer products. \n\nThey could easily choose to rescind certification and/or force recalls within the Eurozone as well, a method of regulatory enforcement. \n\nThey’re unlikely to do any of these things. But they have options.",
              "score": 5,
              "created_utc": 1734101367.0,
              "replies": [
                {
                  "id": "m1vls3a",
                  "author": "notjfd",
                  "body": "CE does not mean that it was authorized. CE is not a certificate, but a mark. It means that the manufacturer _affirms_ (i.e. promises) to be compliant with regulatory requirements. Some electronics, in order to be compliant, need to be certified (e.g. wireless products). Some larger products require that the factory is also compliant with safety/regulatory standards, and must be inspected.\n\nBut no, a CE mark does not imply it was approved/certified/authorised/reviewed by any official, unless that product category requires it (few do).",
                  "score": 7,
                  "created_utc": 1734106637.0,
                  "replies": [
                    {
                      "id": "m1vmj9y",
                      "author": "chrisagiddings",
                      "body": "My understanding is the CE mark is akin to the FCC mark which requires a regulatory certification for the physical product.",
                      "score": 1,
                      "created_utc": 1734106875.0,
                      "replies": [
                        {
                          "id": "m1vzq62",
                          "author": "notjfd",
                          "body": "FCC certification is required for devices that emit radiation (e.g. wifi-equipped laptops). Not all devices fall within that scope. Battery-powered devices with no radios like flashlights require no FCC approval.\n\nCE, on the other hand, covers _every_ product sold in the internal market. Kids' toys must be compliant with EU regulations like the Toy Safety Directive 2009/48/EC. In this case, the CE mark is nothing more than a self-declaration from the manufacturer that these regulations are followed. If you make a kids toy that has wireless emissions (e.g. a wifi-equipped talking bear), then it also has to comply with the Radio Equipment Directive (RED) 2014/53/EU. It's this directive, the RED, that requires certification. So for wireless products, the CE mark _does_ mean it's certified, but the vast majority of products are not covered by regulations that require certification.",
                          "score": 6,
                          "created_utc": 1734111072.0,
                          "replies": [
                            {
                              "id": "m1w04tu",
                              "author": "chrisagiddings",
                              "body": "TIL, thanks",
                              "score": 1,
                              "created_utc": 1734111202.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1uvs1h",
              "author": "Zockgone",
              "body": "We are speaking about a phone which is really popular for businesses, I just don’t think that doing it this way is a good business decision.",
              "score": 2,
              "created_utc": 1734097611.0,
              "replies": []
            },
            {
              "id": "m1w2osw",
              "author": "waterloograd",
              "body": "They could have done a staged deployment. So any new device in 2025 has to be USB-C, but anything already for sale in the EU has until 2026. Or something like that.",
              "score": 0,
              "created_utc": 1734112005.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1um1sg",
      "author": "None",
      "body": "I'd love an unused of the latest gen of SE if I could get it real cheap.  I've had both gens and loved em , but mine is over 2 years old now .",
      "score": 7,
      "created_utc": 1734093464.0,
      "replies": [
        {
          "id": "m1uqc5e",
          "author": "hudsoncider",
          "body": "Both gens? iPhone SE has had 3 gens already : 2016, 2020 and 2022…..\nIf you are saying you have the iPhone SE 2020 currently then your phone is more than 4 years old.",
          "score": 8,
          "created_utc": 1734095388.0,
          "replies": [
            {
              "id": "m1utwg5",
              "author": "None",
              "body": "Oh right my bad  , yeah. I've got the 2022 version with 5G capability. I love it, and would pay a couple hundred for a brand new one . It's still holding on though.",
              "score": 1,
              "created_utc": 1734096862.0,
              "replies": [
                {
                  "id": "m20abeo",
                  "author": "Freshprinceaye",
                  "body": "What’s wrong with the one you have? I’m using one just got a new battery and screen fixed. Pretty much brand new again.",
                  "score": 1,
                  "created_utc": 1734179760.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1z6w1x",
      "author": "None",
      "body": "As an iPhone user (but also Apple critic) I am happy to see the Lightning connector gone. Not only is it more fragile than USB-C, it has no benefits over USB-C.\n\nThe Lightning connector is truly e-waste that Apple created only to sell more proprietary iPhone accessories. ",
      "score": 4,
      "created_utc": 1734153934.0,
      "replies": [
        {
          "id": "m1zd84w",
          "author": "green_link",
          "body": "I, as a non-apple user, understand that the lightning cable had its place. It was a proper successor to the 30pin and was better than micro USB. But as soon as USB C came about the lightning port was obsolete and apple should have changed to it, especially when they had only USB c on their laptops and desktops. But instead they went greedy and wanted to make money on every lightning cable sold, yes even third party",
          "score": 6,
          "created_utc": 1734157564.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1zs0my",
      "author": "TheTanadu",
      "body": "It’s totally Apple choice, it’s nothing with new regulations. They use it as excuse.",
      "score": 2,
      "created_utc": 1734167456.0,
      "replies": [
        {
          "id": "m25ok8d",
          "author": "beaglepooch",
          "body": "Wrong.",
          "score": 0,
          "created_utc": 1734264409.0,
          "replies": [
            {
              "id": "m25otda",
              "author": "TheTanadu",
              "body": "Just because you say so, doesn’t mean it’s right. Look into regulations yourself. It’s about new devices, they need USB-C. Old ones still can be available on market with “non standardised” connector. It’s about new manufacturing standard. So it was all Apple’s choice to withdraw “old” phone from markets, and force people to buy new ones.\n\nIf I’m wrong, why do others who have the old types of connectors in older models still have them available on the market?",
              "score": 1,
              "created_utc": 1734264562.0,
              "replies": [
                {
                  "id": "m276wkr",
                  "author": "beaglepooch",
                  "body": "The new regulation means Apple stop manufacturing, they delist when inventory is at a point where it costs them more to stock than necessary and this stock goes to resellers (catalogues etc) they do this with every item. So it’s not about ‘choice’ as you describe, they are responding to a regulation in every way.",
                  "score": 1,
                  "created_utc": 1734285780.0,
                  "replies": [
                    {
                      "id": "m278tee",
                      "author": "TheTanadu",
                      "body": "The regulation targets *new* devices. Nobody’s forcing Apple to pull perfectly good iPhone 14s off the shelves. They *could* keep selling them. It's not regulation-driven, it's their business decision.",
                      "score": 0,
                      "created_utc": 1734286389.0,
                      "replies": [
                        {
                          "id": "m27zbet",
                          "author": "beaglepooch",
                          "body": "Nobody says they were, but there standard business model and the need to move to USB-C don’t match, therefore it is in relation to the regulations.",
                          "score": 1,
                          "created_utc": 1734294735.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1zwhyw",
      "author": "DQ11",
      "body": "Bring back the 3.5mm. Music through an iPhone sucks now.",
      "score": 1,
      "created_utc": 1734170670.0,
      "replies": []
    },
    {
      "id": "m1v9j7q",
      "author": "None",
      "body": "[removed]",
      "score": -5,
      "created_utc": 1734102631.0,
      "replies": [
        {
          "id": "m1yr2wo",
          "author": "1997PRO",
          "body": "They should have 2 so 2 people can listen to the same iPhone at the same time.",
          "score": 2,
          "created_utc": 1734146332.0,
          "replies": []
        },
        {
          "id": "m1zzbjj",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1734172678.0,
          "replies": [
            {
              "id": "m20knnx",
              "author": "None",
              "body": "now we're talking! Bluetooth is another technological step backwards",
              "score": 1,
              "created_utc": 1734184718.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1vnyk6",
          "author": "linxdev",
          "body": "Video and audio is supported on USBC.  You don't need audio jacks.  You just need an USBC to 3.5mm female dongle.  Works very well.",
          "score": 3,
          "created_utc": 1734107326.0,
          "replies": [
            {
              "id": "m20jqu5",
              "author": "None",
              "body": "I need audio jacks because I am an audio engineer",
              "score": 2,
              "created_utc": 1734184316.0,
              "replies": [
                {
                  "id": "m226qh8",
                  "author": "linxdev",
                  "body": "The audio is analog.  I don't think there is input.  That is a problem.",
                  "score": 1,
                  "created_utc": 1734205379.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1xrntr",
              "author": "Sopel97",
              "body": "the only reason I upvoted the comment above is because you wrote this dumb fucking one",
              "score": 1,
              "created_utc": 1734132168.0,
              "replies": [
                {
                  "id": "m1ywyr6",
                  "author": "linxdev",
                  "body": "Have you never used those adapters?",
                  "score": 2,
                  "created_utc": 1734148989.0,
                  "replies": [
                    {
                      "id": "m20211h",
                      "author": "Sopel97",
                      "body": "I would never because they are expensive and clunky and use up the only usb-c slot",
                      "score": 2,
                      "created_utc": 1734174558.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m1whok9",
              "author": "FAYCSB",
              "body": "I bought a 16 two weeks ago. Very disappointed when I went into the office yesterday, went to plug in my headphones and realized they too would need to be replaced.",
              "score": -2,
              "created_utc": 1734116755.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1vd76k",
          "author": "fishingpost12",
          "body": "No",
          "score": -1,
          "created_utc": 1734103857.0,
          "replies": []
        },
        {
          "id": "m1xxbmo",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1734134328.0,
          "replies": [
            {
              "id": "m20asi5",
              "author": "Freshprinceaye",
              "body": "If you want to charge and listen to headphones. Charge on a pad that you lay your phone on.",
              "score": 0,
              "created_utc": 1734180023.0,
              "replies": [
                {
                  "id": "m20jo0x",
                  "author": "None",
                  "body": "fuck no",
                  "score": 1,
                  "created_utc": 1734184282.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m24hwb6",
      "author": "lo_fi_ho",
      "body": "I recently bought an iPhone 14. Awesome phone for the money, a shame that it’s gone now.",
      "score": 1,
      "created_utc": 1734237949.0,
      "replies": []
    },
    {
      "id": "m25lfcu",
      "author": "logosfabula",
      "body": "What does it mean to iPhone 14 owners?",
      "score": 1,
      "created_utc": 1734262437.0,
      "replies": [
        {
          "id": "m25oj9w",
          "author": "beaglepooch",
          "body": "Nothing why would it?",
          "score": 1,
          "created_utc": 1734264394.0,
          "replies": [
            {
              "id": "m25wwyp",
              "author": "logosfabula",
              "body": "Only a fit of consumerism paranoia, I guess.",
              "score": 1,
              "created_utc": 1734268874.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m25ozyx",
      "author": "beaglepooch",
      "body": "This is simple: they’re not making any more, they will stop selling them, inventory goes to resellers for them to sell so Apple can delist it (which happens with every model). No EU / Apple conspiracy here. Yes it is related to the law but not because of it.",
      "score": 1,
      "created_utc": 1734264672.0,
      "replies": []
    },
    {
      "id": "m2lpapm",
      "author": "marc-andre-servant",
      "body": "LOL, I have a Dell XPS 13 laptop and a Pixel 7 with GrapheneOS, with both devices supporting USB-PD. I can fast-charge my phone on my OEM laptop charger, and my laptop will accept a charge from my OEM Pixel charger, though it will charge slower than the 45W charger that came with the laptop (which the tiny phone charger obviously can't match).\n\nThe laptop shows a prominent low-power charger notification if plugged into my phone charger, but it will still charge at the current supported by the tiny phone charger. Standardisation is a meaningful and significant improvement. I have a generic Amazon USB-PD 45W charger plugged into my bedside table. It will fast-charge either my phone or my laptop depending on which device is about to run out of juice. By the way I currently live in Canada, but my choice to buy an Android phone with a USB-C charging port means I already benefit from the EU mandate.",
      "score": 1,
      "created_utc": 1734491535.0,
      "replies": []
    },
    {
      "id": "m1ummsi",
      "author": "diacewrb",
      "body": "Does the uk have the same usb-c law?\n\nOr can apple dump all these on brits as some sort of brexit bonus.",
      "score": 2,
      "created_utc": 1734093738.0,
      "replies": [
        {
          "id": "m1uqudq",
          "author": "ImBoredButAndTired",
          "body": "The UK overestimated how important they were in the grand scheme of things. In most cases, if something gets discontinued or banned in the EU then it will likely stop being sold in the UK.",
          "score": 37,
          "created_utc": 1734095604.0,
          "replies": [
            {
              "id": "m1uvv5v",
              "author": "Jack123610",
              "body": "Uk in a nutshell",
              "score": 15,
              "created_utc": 1734097645.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1x9keo",
          "author": "None",
          "body": "Apple never dumps anything and certainly not in premium markets. If anything they'll go to India, Indonesia and South American countries.\n\nYou think Apple is going to sell cheap phones to rich people?",
          "score": 2,
          "created_utc": 1734125830.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1uu3di",
      "author": "Hot_Cheese650",
      "body": "I prefer lightening plug more to USB-C, it just feels easier and more satisfying plugging it and removing it.",
      "score": -12,
      "created_utc": 1734096940.0,
      "replies": [
        {
          "id": "m1v30l6",
          "author": "Candle1ight",
          "body": "Universal standards and reducing the amount of tech ending up in landfills? Nah.\n\nIt doesn't feel as satisfying to plug in!",
          "score": 10,
          "created_utc": 1734100349.0,
          "replies": [
            {
              "id": "m1w2ogu",
              "author": "SamSzmith",
              "body": "It would have been nice to have a better standard, that's all, the person is not saying he wishes there were more than one standard.",
              "score": 4,
              "created_utc": 1734112002.0,
              "replies": [
                {
                  "id": "m1w7zbp",
                  "author": "Candle1ight",
                  "body": "https://xkcd.com/927/",
                  "score": 1,
                  "created_utc": 1734113672.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m1yrs2l",
              "author": "LoadedSteamyLobster",
              "body": "I’m all for settling on a single standard. I just wish it had the durability of a lightning connector. So many fucked usb c ports on my MacBooks, they just don’t stand up to continuous plugging and unplugging as the lightning port on a decade of phones have",
              "score": 0,
              "created_utc": 1734146621.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1uut03",
          "author": "SnooChipmunks2079",
          "body": "Agreed. Less delicate connector design and presumably much easier to clean lint out of too.",
          "score": 6,
          "created_utc": 1734097226.0,
          "replies": []
        },
        {
          "id": "m1uwy5y",
          "author": "schmog_",
          "body": "Peak Reddit bullshit.",
          "score": -1,
          "created_utc": 1734098068.0,
          "replies": [
            {
              "id": "m1v3bta",
              "author": "SamSzmith",
              "body": "I like it too, not sure why that's such a big deal lol.",
              "score": 1,
              "created_utc": 1734100463.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1uq1oi",
      "author": "None",
      "body": "[deleted]",
      "score": -22,
      "created_utc": 1734095262.0,
      "replies": [
        {
          "id": "m1whuj9",
          "author": "atomic1fire",
          "body": "You're looking at it from a standpoint of what feels right to you.\n\nUSB-C has higher data and power transfer and isn't exclusively owned by one company. All USB plugs/ports are licensed by a nonprofit that has multiple companies backing it so that they all sort of agree on how things should work and third party manufacturers can readily support it.\n\nI don't think Apple dropped lightning just because they were forced to, but because getting factories to build hardware is probably expensive and a port that everyone makes is easier to set up for then a custom one that needs retooling every time a new supplier is responsible for it.\n\nPlus I'm pretty sure the only reason Apple created lightning was because Micro-usb couldn't handle the throughput needed for an iphone, while USB-C can.",
          "score": 5,
          "created_utc": 1734116806.0,
          "replies": []
        },
        {
          "id": "m1yx6ce",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1734149088.0,
          "replies": [
            {
              "id": "m1z6vpu",
              "author": "xamott",
              "body": "You sound unbiased here. My thought is that the small thing goes inside the large thing, this is how we miniaturize. If the wrapper has to go inside another wrapper, we’re imposing a limit on miniaturization which is what this all about. It trumps all else that’s why Apple went this way. We will miniaturize until smart glasses finally replace “smart phones” and every single thing that poses a barrier must be removed. Relentlessly. Or am I just a “fanboy”.",
              "score": 0,
              "created_utc": 1734153929.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m1v33gb",
          "author": "Candle1ight",
          "body": "Apple fanboy brainrot",
          "score": 1,
          "created_utc": 1734100378.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1witb3",
      "author": "Seattle-Washington",
      "body": "Looks like the EU is forcing planned obsolescence on this one",
      "score": -8,
      "created_utc": 1734117109.0,
      "replies": [
        {
          "id": "m1xq37d",
          "author": "None",
          "body": "You can still buy them from retailers",
          "score": 3,
          "created_utc": 1734131574.0,
          "replies": []
        },
        {
          "id": "m25orf1",
          "author": "beaglepooch",
          "body": "You don’t really understand how the EU works evidently",
          "score": 1,
          "created_utc": 1734264529.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m1ybrhw",
      "author": "TheDevilsAdvokaat",
      "body": "A few years back I bought a 128gb iphone six....\n\nStill running it. It's perfectly fine, and I see no reason to update.\n\nEdit: Looks like  the guy who made the shitty comment has multiple accounts and is downvoting me...",
      "score": -8,
      "created_utc": 1734139927.0,
      "replies": [
        {
          "id": "m1ywyrz",
          "author": "None",
          "body": "[deleted]",
          "score": 4,
          "created_utc": 1734148989.0,
          "replies": [
            {
              "id": "m1yz0fg",
              "author": "TheDevilsAdvokaat",
              "body": "Thanks for telling me not to do something I wasn't planning to do anyway.\n\nYour comment really doesn't seem to very useful.",
              "score": -4,
              "created_utc": 1734149965.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m25oov4",
          "author": "beaglepooch",
          "body": "What is the point of your comment is why you’re being down voted",
          "score": 2,
          "created_utc": 1734264486.0,
          "replies": [
            {
              "id": "m25qlov",
              "author": "TheDevilsAdvokaat",
              "body": "i wonder..reddit is also has a lot of sock puppeteers.",
              "score": -1,
              "created_utc": 1734265615.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m1zpt19",
      "author": "Johnready_",
      "body": "lol eu forcing ppl to pay more for iPhones hahah, they was celebrating when they put usb, and no one thought about all the other phone apple sells that DONT have usb c. Smh, real great idea.",
      "score": -4,
      "created_utc": 1734165907.0,
      "replies": [
        {
          "id": "m2h5b72",
          "author": "Thandor369",
          "body": "Apple was free to sell them going forward, and other stores will continue to do so. It has nothing to do with the regulations, they just preparing for new SE that will be released in spring.",
          "score": 2,
          "created_utc": 1734432103.0,
          "replies": []
        },
        {
          "id": "m25om5p",
          "author": "beaglepooch",
          "body": "What other phones?",
          "score": 1,
          "created_utc": 1734264441.0,
          "replies": [
            {
              "id": "m2gvfiy",
              "author": "Johnready_",
              "body": "The ones without usb c, do you think every iPhone all of a sudden has c port? Or do yo think ppl only buy the newest phones?  Apple does sell other phones besides the newest ones, and not everyone gets the newest best phone.",
              "score": 1,
              "created_utc": 1734425358.0,
              "replies": [
                {
                  "id": "m2hz3yz",
                  "author": "beaglepooch",
                  "body": "I think you probably need to read the specs on Apple’s current items for sale.",
                  "score": 1,
                  "created_utc": 1734446256.0,
                  "replies": [
                    {
                      "id": "m2png91",
                      "author": "Johnready_",
                      "body": "So you’re saying Apple only sells items with usb-c port? If that’s what you’re saying, you’re sadly mistaken.",
                      "score": 1,
                      "created_utc": 1734553085.0,
                      "replies": [
                        {
                          "id": "m2pwz1s",
                          "author": "beaglepooch",
                          "body": "🤫",
                          "score": 1,
                          "created_utc": 1734555982.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m1vp7is",
      "author": "None",
      "body": "Don’t the magsafe chargers work on android phones too? You think somebody would have made the argument that wireless is the new standard.  \n\nI can hardly charge my phone with a lightning connector these days.",
      "score": -5,
      "created_utc": 1734107720.0,
      "replies": [
        {
          "id": "m1vtvbv",
          "author": "Mental_Tea_4084",
          "body": "Yes, and Apple is supposedly contributing the magnet ring back to the Qi standards, so other phones may have it built in with Qi2. For now I'm very happy with my magsafe compatible case",
          "score": 5,
          "created_utc": 1734109199.0,
          "replies": []
        },
        {
          "id": "m1wh2ov",
          "author": "atomic1fire",
          "body": "I think all phones should have a physical input for the simple reason that it makes using accessories easier.\n\nI mean sure someone could make a wireless transfer spec, but it's my understanding that transfer rates among usb-c are going to be much faster then bluetooth or NFC and work with way more things out of pocket.",
          "score": 2,
          "created_utc": 1734116562.0,
          "replies": [
            {
              "id": "m1wm1kz",
              "author": "None",
              "body": "I’m with you 100% on that. Wish my phone had more than one usb, 1/8 inch and 1/4” audio jacks. I just think apple would have been tricky enough to push forward with the wireless chargers.",
              "score": 1,
              "created_utc": 1734118127.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}