{
  "post": {
    "title": "Belkin is ending support for nearly all its Wemo smart home devices | Wemo hardware will stop working in January 2026 unless it’s been set up in Apple HomeKit.",
    "author": "chrisdh79",
    "id": "1lx7rfi",
    "score": 1630,
    "created_utc": 1752242693.0,
    "selftext": "",
    "num_comments": 231,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lx7rfi/belkin_is_ending_support_for_nearly_all_its_wemo/"
  },
  "comments": [
    {
      "id": "n2jvhm7",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752242693.0,
      "replies": []
    },
    {
      "id": "n2k0kdo",
      "author": "Fractured_Senada",
      "body": "Whelp. I had trusted Belkin as a brand but that's gone now; looks like they won't be getting my money any more.",
      "score": 319,
      "created_utc": 1752244189.0,
      "replies": [
        {
          "id": "n2k3vxs",
          "author": "chrissamperi",
          "body": "Same I have so many WEMOs in my house. Have for years through two houses. This is such a disgusting betrayal",
          "score": 113,
          "created_utc": 1752245147.0,
          "replies": [
            {
              "id": "n2kn9o3",
              "author": "Gandalfthefab",
              "body": "I'm interested to see if anyone in the home assistant community will take these and start creating a local system for them to operate on as these get sold off in huge bulk deals to liquidate stock.",
              "score": 50,
              "created_utc": 1752250591.0,
              "replies": [
                {
                  "id": "n2qzmn1",
                  "author": "Electronic_Unit8276",
                  "body": "Most of this stuff already works in Home Assisttant.",
                  "score": 16,
                  "created_utc": 1752337268.0,
                  "replies": [
                    {
                      "id": "n2r0qkh",
                      "author": "Gandalfthefab",
                      "body": "Ya but reading the home assistant page for Wemo devices it sounds like you still need to set them up though the Wemo service first before you can use them with home assistant",
                      "score": 12,
                      "created_utc": 1752337614.0,
                      "replies": [
                        {
                          "id": "n2r8iv1",
                          "author": "itinerantmarshmallow",
                          "body": "I could be wrong but that these are Home Kit compatible means they will work already locally with Home Assistant.",
                          "score": 8,
                          "created_utc": 1752340024.0,
                          "replies": [
                            {
                              "id": "n2s2e1x",
                              "author": "Gandalfthefab",
                              "body": "Interesting. These could be a good buy if they get cheap enough for someone with the technical knowledge on how to get most out of them with home assistant",
                              "score": 3,
                              "created_utc": 1752349379.0,
                              "replies": []
                            },
                            {
                              "id": "n3thlo4",
                              "author": "Stinedurf",
                              "body": "For what it is worth I was able to migrate all my Wemo Plugs to the Apple implementation of Home/Homekit.  Some were easy to migrate, some (especially the older ones) were very difficult, but in the end it worked.  Afterwards I removed them from the Wemo App and they still work fine with Homekit.",
                              "score": 2,
                              "created_utc": 1752847469.0,
                              "replies": [
                                {
                                  "id": "n3ti9nt",
                                  "author": "itinerantmarshmallow",
                                  "body": "Yeah, the issue another issue raised would be if you ever needed to repeat the process when the cloud is gone.\n\nIf for example your Home Kit account or Home Assistant had issues and you refreshed it all.",
                                  "score": 1,
                                  "created_utc": 1752847668.0,
                                  "replies": [
                                    {
                                      "id": "n3tohqf",
                                      "author": "Stinedurf",
                                      "body": "For the newer ones the homekit code is written on the label of the device so I wouldn't expect that to be a problem.  On the older ones without the homekit code it could be a problem.  The Wemo app gave me homekit codes for the older ones but they didn't work when I tried to import them directly to the Home app.  For those I needed to tell the Wemo app to push them into Home/Homekit.",
                                      "score": 2,
                                      "created_utc": 1752849474.0,
                                      "replies": [
                                        {
                                          "id": "n3ts8hi",
                                          "author": "itinerantmarshmallow",
                                          "body": "Great stuff.\n\nWell at least for you and users like you. Others may have to look into it.",
                                          "score": 1,
                                          "created_utc": 1752850526.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "n3f9qek",
                              "author": "dnev6784",
                              "body": "You can only link them to Home Kit between now and Jan 31 2026. After that date, you're out of luck :(",
                              "score": 1,
                              "created_utc": 1752662772.0,
                              "replies": [
                                {
                                  "id": "n3ffhu2",
                                  "author": "itinerantmarshmallow",
                                  "body": "Once linked it's fine?\n\nDoes mean any need to remove the devices and add back (as is usually the easiest fix for tech) will leave users in trouble.\n\nDissapointing.",
                                  "score": 1,
                                  "created_utc": 1752665393.0,
                                  "replies": []
                                },
                                {
                                  "id": "n3fgaes",
                                  "author": "itinerantmarshmallow",
                                  "body": "Once linked it's fine?\n\nI guess that does mean any need to remove the devices and add back (as is usually the easiest fix for tech) will leave users in trouble an unusable device. \n\nDissapointing.\n\nStop Killing Games may need to be extended to all cloud based tech.",
                                  "score": 1,
                                  "created_utc": 1752665737.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2t3ufr",
              "author": "HawkeyeByMarriage",
              "body": "Mine work with Alexa but not the wemo app already. I'm good",
              "score": 2,
              "created_utc": 1752361865.0,
              "replies": [
                {
                  "id": "n2t7aeg",
                  "author": "chrissamperi",
                  "body": "Yeah. The app is bunk. ASL ong as they still work with Alexa and Apple I’m fine",
                  "score": 2,
                  "created_utc": 1752363063.0,
                  "replies": [
                    {
                      "id": "n2w43fu",
                      "author": "illuminated0ne",
                      "body": "They won't work with Alexa as that's a relay through the Wemo servers which are being turned off. Homekit works differently",
                      "score": 2,
                      "created_utc": 1752411824.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n2m2htn",
          "author": "punIn10ded",
          "body": "I've had so much of their hardware fail over the years that I now trust Chinese stuff over them. I'm really not surprised they've been going down hill for years.",
          "score": 19,
          "created_utc": 1752265322.0,
          "replies": []
        },
        {
          "id": "n2p7zh3",
          "author": "shitty_mcfucklestick",
          "body": "I’m confused - I thought they discontinued the line a few years ago when they shut down their online service. \n\nAlso, these devices work on the local network still. You can get an app called Control+ which just lists them and lets you shut them on and off. This doesn’t depend on the cloud, as the devices expose themselves on the local network completely openly. Not the most secure thing locally but it may let you use them longer.",
          "score": 8,
          "created_utc": 1752311601.0,
          "replies": []
        },
        {
          "id": "n2os6er",
          "author": "meloman11",
          "body": "Same here. Been buying their stuff for years but this is such a scummy move.",
          "score": 5,
          "created_utc": 1752302326.0,
          "replies": []
        },
        {
          "id": "n2tkw55",
          "author": "Scott_IUsed2Know",
          "body": "So First it was the Amazon Webcam that was bricked.... then Stadia, now Wemo- Belkin, I was loyal, and now I'm done with everything... and I buy equipment for my company- they just lost a bunch of money. Sadly- I know they don't care.",
          "score": 4,
          "created_utc": 1752368067.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2jxwg7",
      "author": "AutocraticHilarity",
      "body": "We need significantly more consequences for companies that pull support like this. And by significantly more consequences, I actually just mean any consequence at all…",
      "score": 774,
      "created_utc": 1752243412.0,
      "replies": [
        {
          "id": "n2n93c5",
          "author": "thisischemistry",
          "body": "We need to demand that any business which runs a cloud service also provides a server app you can run yourself or an open API so you can make your own.",
          "score": 76,
          "created_utc": 1752279188.0,
          "replies": [
            {
              "id": "n2ovcdd",
              "author": "Bladechildx",
              "body": "Shit. Maybe Stop Killing games needs to be expanded to Stop Killing Products.",
              "score": 71,
              "created_utc": 1752304107.0,
              "replies": [
                {
                  "id": "n2qtg7q",
                  "author": "Dr_Valen",
                  "body": "Everything is going digital but unfortunately our governments and legislatures aren't keeping up. Hell half of them don't even know what a smart device is.",
                  "score": 11,
                  "created_utc": 1752335351.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2k02pi",
          "author": "drae-",
          "body": "Don't buy them.\n\nI already don't buy Belkin products cause of exactly this reason on different hardware.\n\nThere's a pattern here.",
          "score": 93,
          "created_utc": 1752244045.0,
          "replies": [
            {
              "id": "n2lg8yk",
              "author": "Netcooler",
              "body": "Did we know Belkin would do this, one year ago? 2 months ago? This is weird advice",
              "score": 28,
              "created_utc": 1752258727.0,
              "replies": [
                {
                  "id": "n2oo624",
                  "author": "Eruannster",
                  "body": "The article mentions that Belkin stopped selling these devices (and was reconsidering what to do with their smart home lineup) back in 2023, so I guess we could have sort of guessed back then.",
                  "score": 11,
                  "created_utc": 1752300129.0,
                  "replies": []
                },
                {
                  "id": "n2lk9yz",
                  "author": "drae-",
                  "body": "Well, they stopped making smart home devices and announced they were reconsidering their smart home strategy months ago.\n\nThey have a history of selling off divisions to other firms which then transition away from Belkin software. The one I'm most familiar with was their pc peripherals. I owned an n52te before belkin sold their peripheral division to razer. The firmware app was succeeded by synapse, which dropped support for legacy products. \n\nSome of their mobile accessories had app support dropped early too. \n\nIf youre buying Belkin you're just asking for this kinda thing.",
                  "score": 24,
                  "created_utc": 1752259897.0,
                  "replies": [
                    {
                      "id": "n2o5c4o",
                      "author": "graywolfman",
                      "body": "Not sure why you're getting downvotes. This is the truth. L\n\nBelkin is the strip miner of tech divisions.",
                      "score": 11,
                      "created_utc": 1752291308.0,
                      "replies": []
                    },
                    {
                      "id": "n2lr3oy",
                      "author": "Netcooler",
                      "body": "Ok fair point",
                      "score": 1,
                      "created_utc": 1752261906.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2k0ujl",
              "author": "Butt_Face2000",
              "body": "You mean... Don't buy anything? \n\nThis isn't exclusive to Belkin. You would have to avoid the world.",
              "score": 123,
              "created_utc": 1752244271.0,
              "replies": [
                {
                  "id": "n2k3bbc",
                  "author": "not_a_moogle",
                  "body": "They probably meant dont by smart home electronics. And I would agree with that.",
                  "score": 52,
                  "created_utc": 1752244983.0,
                  "replies": [
                    {
                      "id": "n2luak7",
                      "author": "Dhegxkeicfns",
                      "body": "Easy to say when it's something you don't want.\n\nThe real answer is don't buy them when they use proprietary protocols and require contacting a central server. We need these to be autonomous and work locally if the central servers are gone.",
                      "score": 28,
                      "created_utc": 1752262873.0,
                      "replies": []
                    },
                    {
                      "id": "n2k9xdt",
                      "author": "Kurappu",
                      "body": "I agree with you. \n\nThat said, there are devices that don't require a service provider for them to work. You just need to put a bit more work in.",
                      "score": 17,
                      "created_utc": 1752246851.0,
                      "replies": [
                        {
                          "id": "n2ljrjx",
                          "author": "sierajedi",
                          "body": "My boyfriend’s dad has an insane CCTV setup in his house. Not connected to the internet at all, and he has a backup generator. First time I saw a home camera system I’d actually want to use.",
                          "score": 11,
                          "created_utc": 1752259748.0,
                          "replies": [
                            {
                              "id": "n2mebdn",
                              "author": "Saloncinx",
                              "body": "Off the shelf Amcrest stuff works great offline! I've been running one of their NVR's for years, it's so stable and does not need an internet connection at all.",
                              "score": 5,
                              "created_utc": 1752268848.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "n2lsxm2",
                      "author": "lordaddament",
                      "body": "Or we could have laws that protect consumers and we wouldn’t have to avoid a whole product category?",
                      "score": 2,
                      "created_utc": 1752262459.0,
                      "replies": [
                        {
                          "id": "n2nwrgy",
                          "author": "eexxiitt",
                          "body": "So what would this law say? Indefinite support?",
                          "score": -1,
                          "created_utc": 1752287887.0,
                          "replies": [
                            {
                              "id": "n2oiizg",
                              "author": "Higira",
                              "body": "Able to run offline? Or if they do cancel, refund for the product/ payment for alternatives.",
                              "score": 2,
                              "created_utc": 1752297204.0,
                              "replies": [
                                {
                                  "id": "n2omlcj",
                                  "author": "Bob_The_Bandit",
                                  "body": "Then people wouldn’t need to avoid this product category, because it would just go away.",
                                  "score": -1,
                                  "created_utc": 1752299295.0,
                                  "replies": [
                                    {
                                      "id": "n2r0jng",
                                      "author": "Higira",
                                      "body": "Why do the consumer need to have so much foresight? When you buy something, shouldn't you expect it to work? It's YOUR product. It's shouldn't be a corporate decision to cut off something you use, when you bought it with your hard earned cash. That should be the company's problem. Hence, regulations.",
                                      "score": 1,
                                      "created_utc": 1752337554.0,
                                      "replies": [
                                        {
                                          "id": "n2r1e0k",
                                          "author": "Bob_The_Bandit",
                                          "body": "Ok? And said companies have the full right to stop selling shit they deem is unprofitable, and if they need to refund everyone when they wanna shut the servers down, no one is gonna ever bother selling them. Would you?",
                                          "score": -1,
                                          "created_utc": 1752337820.0,
                                          "replies": [
                                            {
                                              "id": "n2t2i9p",
                                              "author": "Higira",
                                              "body": "Oh ok, so they are just gonna go bankrupt then? Fine with me. And we both know they will figure things out and work with or around the regulations. Just look at EU.",
                                              "score": 1,
                                              "created_utc": 1752361397.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2kplss",
                  "author": "S_A_N_D_",
                  "body": "So the solution is to only buy smart devices that have fully local control. \n\nYou can set up your own Home Assistant server to control and automate them. Objectively at this point it' not hard to do. I would say at this point is easy enough that the average person could figure it out. Rather it just takes a little time and effort. \n\nBasically, people are going with the convenient option at this point - and the downside is what we see here where you'll be tied in to the company for support and longevity. \n\nFor context, I have all the standard smart devices that people have, except there is no such thing as \"no longer supported\" because they're all tied into my local server and will keep working in their current capacity as long as I want.",
                  "score": 24,
                  "created_utc": 1752251259.0,
                  "replies": [
                    {
                      "id": "n2m1v5y",
                      "author": "iiiinthecomputer",
                      "body": "So I did this with early Philips Hue.\n\nThey've since forced the use of previously optional cloud accounts and tried to lock the home base station down so it's only controllable via their cloud service.\n\nThey forced a firmware update by making the mobile app disable itself until the base stations were updated.\n\n\"For your security\" of course.\n\nJust because you buy something you can control locally doesn't mean it'll stay that way.\n\nYes I could've blocked its Internet access and used it exclusively via Home Assistant or similar. But FFS all they had to do was not break what was already there.",
                      "score": 3,
                      "created_utc": 1752265139.0,
                      "replies": [
                        {
                          "id": "n2m2gy4",
                          "author": "S_A_N_D_",
                          "body": "> Just because you buy something you can control locally doesn't mean it'll stay that way.\n\nFully local means it's not tied to their cloud. This means there is no way for them to disable/nerf/break it. \n\nSounds like this wasn't fully local. Or if it was, you could have just not updated and everything would have kept working as intended.\n\n>Yes I could've blocked its Internet access and used it exclusively via Home Assistant or similar. But FFS all they had to do was not break what was already there.\n\nEdit, yup. This is the price of convenience. So it was fully local and could still have been. This is precisely why I block internet access and tie everything into my own HA server. Just on principal I disable internet access. There is no need for them to have it.",
                          "score": 4,
                          "created_utc": 1752265315.0,
                          "replies": [
                            {
                              "id": "n2m6zwx",
                              "author": "iiiinthecomputer",
                              "body": "No. The catch is the mobile app upgrade treadmill.\n\nThe mobile control apps for most of these things phone home to check for updates and will disable themselves if they're too old or are told to.\n\nSo the devices themselves were fully local. But became unusable with the official mobile app.\n\nI would've just switched to a 3rd party app but my partner was not willing to. Oh well.\n\nThe point is that I bought a device that was fully capable of wifi only operation and worked that way for years. The vendor then changed the deal 5+ years after I bought it. I hate that they can do that.\n\nIt's also worth noting that you can't be sure that a seemingly fully local device doesn't have a time bomb embedded. I expect three will be devices that seem to operate fully locally then after a few months they complain that they are overdue for their mandatory security update checking schedule and disable themselves \"for your security\". You can lie to them about the clock but this might make them much less useful for the intended purpose, and the clock may be impossible to set without first unblocking the device...",
                              "score": 5,
                              "created_utc": 1752266643.0,
                              "replies": [
                                {
                                  "id": "n2m7lcq",
                                  "author": "S_A_N_D_",
                                  "body": "But that's not fully local then. You're still relying on their web servers for the device to work. \n\nI don't need any of the manufactures mobile apps for any of my local devices. I have local control and rout it all through my HA app which I serve myself. \n\nIf it needs a proprietary app to function - and that app needs internet access to work, it's not fully local, even if all the app is doing is pinging a server for permission to work.",
                                  "score": 3,
                                  "created_utc": 1752266820.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "n2mrwfk",
                          "author": "JewishTomCruise",
                          "body": "Hue bulbs (at least the older ones) are zigbee. You can adopt them into your own zigbee network and forego their hub, app, and everything else.",
                          "score": 1,
                          "created_utc": 1752273230.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "n2l3iws",
                      "author": "Aqualung812",
                      "body": "What are you doing for battery/solar, EV chargers, robomowers, and cooking devices? \n\nThese are all things I have that time trying to get local control of.",
                      "score": 1,
                      "created_utc": 1752255130.0,
                      "replies": [
                        {
                          "id": "n2laohe",
                          "author": "S_A_N_D_",
                          "body": "There are lots of implementations for solar and battery monitoring and control. The key is you need to plan it out ahead of time when you purchase and install it so that you use components that are compatible. Lots of people route all of that through HA though, to the point where it's actually part of the core implementation of HA. There are a ton of options for this one with setups that just monitor, to setups that have full control. I wouldn't know where to start because it would depend on your system and what you have installed already but google will be your friend in this one. \n\nRoboMowers is not one that you'll find good support for - that you got me. Seems like the Husqvarna ones can be monitored and controlled trough HA, but you still need to connect to their cloud service. Robomowers though are still pretty new and aren't all that common yet, so I expect eventually there will be some local only options. \n\nLarge appliances are somewhat hit and miss. Lots of them integrate but need the cloud as a middleman, and there are some active projects designed around eliminating the cloud component but I haven't tried them to see how well they work and those I wouldn't categorize as easy (as per my original comment). It also depends on what you're looking for. If it's power monitoring and the ability to cut power in an emergency, there are lots of options. If it's the smart features that came with the appliance, you won't find much for completely local control - as the cloud is often still needed as a middleman. You'll be able to route them and control them from HA, but you will still be reliant on the cloud. \n\nI guess I should say my original comment was more aimed at the smart devices on the same level as what was being discontinued with Belkin. More about the smaller iot devices like switches, sensors, alarms, cameras etc. Appliances are an issue, and niche things like the robomowers will take time before there are local only options (and I would say that is still niche because it's relatively new and doesn't have a ton of adoption- though I doubt it will be forever). Personally I don't see a use for a lot of the smart features in appliances. I see them as a security vulnerability, and if I'm cooking I'm in the kitchen so being able to control it from my phone is somewhat of a gimmick. I've looked into them from time to time and never seen anything of much interest, and most people who have ones with smart features in my experience rarely use the smart features. For example my dishwasher has smart features, but I never use them and they really offer me nothing of value so I've just ignored them. If anything it's more of an annoyance because a few things that should just be a simple button or indicator are only available through the app. About the only things that are good is the ability to see if something was left on, or if a door is open etc, and all of that can be implemented externally in other ways.",
                          "score": 6,
                          "created_utc": 1752257111.0,
                          "replies": [
                            {
                              "id": "n2lfn70",
                              "author": "Aqualung812",
                              "body": "Yeah, I’ve already got local control in HA for the basic stuff. \n\nI’m looking for smart kitchen appliances because I want to be able to preheat remotely, start dishes from bed when I forget, or really, the most important feature: I don’t want to have to set the damn clocks on my oven & microwave every time the power flickers! \n\nThe privacy stuff is a non-issue when you have local control, I already have a IoT VLAN that I can block to the Internet. \n\nI’ve just got a lot of things that aren’t quite there yet. Ecoflow for my solar & batteries because cost was a bigger factor than local when I bought them. ChargePoint for my EV chargers, same reason. \n\nThe dishwasher is a Bosch, which seems to be a Matter-friendly company. I hope they’ll do Matter as an update, but as you say, kitchen devices aren’t must-have for IoT so I’m not going to be devastated if I don’t get it.  \n\nDon’t have the smart robomower, oven, or microwave right not BECAUSE I’m making local control a non-negotiable. I could maybe try to use my circuit monitoring to tell if the oven is pre-heated, but it takes quite a bit of trial & error to tune the alerts. Matter connectivity would just make it all easier.",
                              "score": 0,
                              "created_utc": 1752258550.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2k1bxr",
                  "author": "drae-",
                  "body": "There are absolutely companies that are more likely to do this than others.\n\nAnd its really not a problem with something like groceries or toilet paper. So no, not like the whole world.\n\nWhy be so sensationalist?",
                  "score": 18,
                  "created_utc": 1752244411.0,
                  "replies": [
                    {
                      "id": "n2kle8j",
                      "author": "famousxrobot",
                      "body": "Agreed. You can choose what companies you support. Personally, I avoid smart products that require an app. The devices I have are either open to Apple/Google/Alexa (better, still not ideal by any means), or are cheap enough that I don’t care if the app support ends (a few smart bulbs that if the app stopped working, they still function as normal light bulbs). Even my smart door lock works locally with a keypad or Bluetooth even if wifi module or app fails, and it has a physical key as a final fallback.",
                      "score": 3,
                      "created_utc": 1752250054.0,
                      "replies": []
                    },
                    {
                      "id": "n2k2mcq",
                      "author": "Leever5",
                      "body": "Why use such a false equivalency? Groceries are wildly different to tech",
                      "score": -13,
                      "created_utc": 1752244783.0,
                      "replies": [
                        {
                          "id": "n2k2v77",
                          "author": "drae-",
                          "body": "The guy I'm responding to literally said \"avoid the *world*\" and \"don't buy *anything*\". \n\nI'm not the one widening the net here brah.",
                          "score": 17,
                          "created_utc": 1752244853.0,
                          "replies": [
                            {
                              "id": "n2kttvd",
                              "author": "Brownt0wn_",
                              "body": "“Anything” was pretty clearly “anything in the category of tech products”.",
                              "score": -6,
                              "created_utc": 1752252464.0,
                              "replies": [
                                {
                                  "id": "n2kvocc",
                                  "author": "drae-",
                                  "body": "No it wasn't.\n\nHe *literally* said don't buy **anything**. Avoid the **world**. That's about as broad a descriptor as you can use.\n\nWords have meaning. *Anything* means *anything*.\n\nIf he meant tech products he could have said \"don't buy any tech products\". And if that's what he meant that's what he should have said.",
                                  "score": 4,
                                  "created_utc": 1752252975.0,
                                  "replies": [
                                    {
                                      "id": "n2l97bd",
                                      "author": "Brownt0wn_",
                                      "body": "Words also have context. Go read a book.",
                                      "score": -4,
                                      "created_utc": 1752256694.0,
                                      "replies": [
                                        {
                                          "id": "n2lavsy",
                                          "author": "drae-",
                                          "body": "Words are used to shift context too bub.\n\nI just finished wind and truth and started back on suneater. My favorite series is mbotf, which I've read 4 times. What are you reading?",
                                          "score": 4,
                                          "created_utc": 1752257170.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2lrxm8",
                  "author": "OutlyingPlasma",
                  "body": "Anything? No. Anything with an app? Yes. \n\nAnything that uses proprietary apps, protocols, frequencies or anything similar should always be avoided.\n\nAll of my switches are zigbee so it doesn't matter if the business dies, my switches will still work. \n\nAny device that functions only with a proprietary app should be considered disposable regardless of price. If you can only change the temperature of your brand new $5000 Samsung fridge or $30,000 furnace with an app, those devices are as disposable as cat litter and WILL(not might) stop functioning in the future when the company drops support for it.",
                  "score": 2,
                  "created_utc": 1752262157.0,
                  "replies": []
                },
                {
                  "id": "n2k3nvd",
                  "author": "UF8FF",
                  "body": "Yeah the whole “vote with your wallet” is kinda bullshit when companies all racing to the bottom together.",
                  "score": 5,
                  "created_utc": 1752245084.0,
                  "replies": []
                },
                {
                  "id": "n2kkroq",
                  "author": "gredr",
                  "body": "I bought Sonoff devices and flashed them with new firmware that is 100% local (ESPHome, but Tasmota also works I believe, and there may be other options as well).\n\nSonoff can disappear forever and it won't affect me.",
                  "score": 2,
                  "created_utc": 1752249874.0,
                  "replies": []
                },
                {
                  "id": "n2lyq76",
                  "author": "kneel23",
                  "body": "thats not a terrible idea....",
                  "score": 0,
                  "created_utc": 1752264210.0,
                  "replies": []
                },
                {
                  "id": "n2m06h9",
                  "author": "youdeepshit",
                  "body": "Buy your own microcontroller,  write your own firmware, solder your own electronic and mechanical components",
                  "score": 0,
                  "created_utc": 1752264642.0,
                  "replies": []
                },
                {
                  "id": "n2nhozd",
                  "author": "rudyattitudedee",
                  "body": "It’s exclusive to crappy companies. Don’t buy products from crappy companies that sell knockoff non legacy products.",
                  "score": -1,
                  "created_utc": 1752282324.0,
                  "replies": []
                },
                {
                  "id": "n2o3qfp",
                  "author": "yacht_enthusiast",
                  "body": "Yes. Smart homes are stupid, stop wasting your time and money with this nonsense",
                  "score": -1,
                  "created_utc": 1752290646.0,
                  "replies": [
                    {
                      "id": "n2zc2uq",
                      "author": "TheAussieTico",
                      "body": "what",
                      "score": 1,
                      "created_utc": 1752447704.0,
                      "replies": [
                        {
                          "id": "n2zxdy9",
                          "author": "yacht_enthusiast",
                          "body": "What part is confusing you?",
                          "score": 1,
                          "created_utc": 1752455144.0,
                          "replies": [
                            {
                              "id": "n2zxkbu",
                              "author": "TheAussieTico",
                              "body": "I’m not at all confused. I love my smart home",
                              "score": 1,
                              "created_utc": 1752455206.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "n2mq5hs",
              "author": "Lumberjack_Plaid",
              "body": "Don't buy Google devices either... They pull support and shut down products frequently.",
              "score": 2,
              "created_utc": 1752272634.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2okinl",
          "author": "TheCriticalGerman",
          "body": "Best chance if European Union takes a look at that",
          "score": 2,
          "created_utc": 1752298212.0,
          "replies": []
        },
        {
          "id": "n2lynx5",
          "author": "kneel23",
          "body": "i had stopped buying them ages ago they were garbage compared to other smartbulbs i had.   I still have them in a drawer if anyone wants em lol",
          "score": 1,
          "created_utc": 1752264191.0,
          "replies": []
        },
        {
          "id": "n2n3sc9",
          "author": "Optimus_Prime_Day",
          "body": "Sue them. They sold you a product then bricked it.",
          "score": 1,
          "created_utc": 1752277306.0,
          "replies": []
        },
        {
          "id": "n2ood7d",
          "author": "Kep0a",
          "body": "we do but technically it is dealt with by the free market. Like android and windows laptop reputation is so poor, because for years OEMs made dogshit products. This is why apple, a sole company owns 15% of laptop marketshare, and nearly 30% of the global smartphone market\n\nCompanies that make terrible products typically end up losing.",
          "score": 1,
          "created_utc": 1752300234.0,
          "replies": []
        },
        {
          "id": "n2pt47t",
          "author": "None",
          "body": "It’s basically the same thing citizens in EU are now trying g to force through for games.",
          "score": 1,
          "created_utc": 1752322742.0,
          "replies": []
        },
        {
          "id": "n2jzbgb",
          "author": "bezerko888",
          "body": "Corrupt politicians are busy destroying the economy and society while getting rich. Sorry.",
          "score": -2,
          "created_utc": 1752243826.0,
          "replies": [
            {
              "id": "n2kbipy",
              "author": "t4thfavor",
              "body": "Kind of like they were back before cameras like this and wifi even existed? completely irrelevant and unhelpful to the conversation.",
              "score": 1,
              "created_utc": 1752247294.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2p2d8b",
          "author": "DeusScientiae",
          "body": "Lol like what. Do you expect cloud services to last forever?",
          "score": 0,
          "created_utc": 1752308192.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2jw0pb",
      "author": "Nunwithabadhabit",
      "body": "A law could require companies to buy back these devices and pay a landfill fee for the harm they'll do the environment and future generations. They do this stuff because we make it easy.",
      "score": 1104,
      "created_utc": 1752242853.0,
      "replies": [
        {
          "id": "n2k60fo",
          "author": "PGnautz",
          "body": "Or force them to release firmware and server software as open source software.",
          "score": 86,
          "created_utc": 1752245751.0,
          "replies": [
            {
              "id": "n2oldmu",
              "author": "TheTerrasque",
              "body": "Would matter support solve this? That's supposed to be an open standard, isn't it?",
              "score": 5,
              "created_utc": 1752298662.0,
              "replies": [
                {
                  "id": "n2orweq",
                  "author": "PGnautz",
                  "body": "Yes. If the EU can force Apple to switch to USB-C, then they can also demand Matter for all smart home devices (that don‘t use other open standards).",
                  "score": 7,
                  "created_utc": 1752302170.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2kcgep",
              "author": "sofixa11",
              "body": "That might be very hard to impossible (depending on licenses, e.g. often weird hardware has very shitty and restrictive firmware licenses). It should still be the law as a preferred option, but it's just not always realistic.",
              "score": 6,
              "created_utc": 1752247555.0,
              "replies": [
                {
                  "id": "n2kpyhz",
                  "author": "ExdigguserPies",
                  "body": "It's completely possible if the device is built from the ground up with this end in mind.",
                  "score": 23,
                  "created_utc": 1752251360.0,
                  "replies": []
                },
                {
                  "id": "n2m4jl0",
                  "author": "TheSpatulaOfLove",
                  "body": "If the law is placed on the device manufacturer, then it’s *their* problem to figure out the EOL.    It would drive design to take EOL into consideration.   \n\nI don’t want to hear lazy excuses about licenses preventing responsible post sale support.",
                  "score": 14,
                  "created_utc": 1752265920.0,
                  "replies": []
                },
                {
                  "id": "n2kshfs",
                  "author": "S_A_N_D_",
                  "body": "There probably could be a way to do it. \n\nFor example, the licences would probably still be valid. Whether it's someone on github writing the code, or someone in their own company, the landscape doesn't change because the licensing fee has already been paid for that device. Basically, as long as it's not being used for a new device then it wouldn't necessarily violate the spirit of the licensing agreement and no harm comes to those to own the licence, and the law could effectively just take that into account. It might violate some current agreements the way they're currently written, but the law could just require that this be an option and therefore any clauses that prevent it are null and void.  \n\nMore importantly, they don't need to fully open-source all the code and firmware. Rather they just need to implement some sort of open protocol that lets another server control the device. Lots of smart devices already do this, where the firmware is proprietary, but it's implemented in such a way that it can be paired/controlled with any server and isn't limited to the manufactures cloud provider.  Basically, you don't need to give people the ability to write their own firmware, rather you just need to let people continue to use the device using their own server instead of the cloud provider if they're so motivated. \n\nIt essentially needs to be how old software was handled (before everything was a subscription service). You didn't lose access to the software, rather it just stopped receiving updates. If you wanted to keep using it that was up to you, and there might be inherent risks due to security flaws, but you weren't denied anything. Eventually it would stop working because it was incompatible with the current OS, but usually by then the software was so old that few people were using it anymore, and those that did want to still use it could usually set up a VM to run it.",
                  "score": 0,
                  "created_utc": 1752252085.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2jxhvz",
          "author": "scotishstriker",
          "body": "We don't have good consumer protection in the USA, and it's been getting worse under this administration. We need the EU to make these tech companies knock shit like this off.",
          "score": 280,
          "created_utc": 1752243293.0,
          "replies": [
            {
              "id": "n2k4uij",
              "author": "MercenaryCow",
              "body": "We would have better consumer protection if people actually voted. All the people who sell us out for pitiful amounts of money run unopposed in elections and keep their positions for ungodly amounts of time.\n\nThe only thing people care about in the United States is the president. But that doesn't really do anything because our government is much much more than just the 1 person\n\n[here is a famous example](https://wccftech.com/isps-paid-lawmakers-net-neutrality-repeal/)\n\nEvery single one of these people are voted in, and they do not act for the good of the people. Their actions are to whoever pays them more money. A lot of these people still serve today, when something like this should have been the end of them. For the people who don't know, they can serve an unlimited number of 2 year terms. These people matter but nobody cares about anything but the president. So we have corrupt crooks running the country here and we willingly do it to ourselves.",
              "score": 75,
              "created_utc": 1752245421.0,
              "replies": [
                {
                  "id": "n2k98gz",
                  "author": "baumpop",
                  "body": "i’m thinking we abolish the senate the electoral college and expand the house to the proportion of population ",
                  "score": 23,
                  "created_utc": 1752246660.0,
                  "replies": [
                    {
                      "id": "n2kb4i4",
                      "author": "Space_Pirate_Roberts",
                      "body": "r/uncapthehouse",
                      "score": 19,
                      "created_utc": 1752247184.0,
                      "replies": []
                    },
                    {
                      "id": "n2ni07i",
                      "author": "EnglishMobster",
                      "body": "Expanding the House would make the electoral college more fair automatically.\n\nThe EC is just the number of Reps + the number of Senators + 3 (for DC). Giving more Reps would also mean that the EC is more representative of population automatically.\n\nThe easiest thing to do would be [to lobby your state to ratify the Congressional Apportionment Amendment](https://en.wikipedia.org/wiki/Congressional_Apportionment_Amendment), which was approved by Congress but is still pending ratification by the states. There is no end date on when ratification can happen, so it's still valid.",
                      "score": -1,
                      "created_utc": 1752282439.0,
                      "replies": [
                        {
                          "id": "n2njaeg",
                          "author": "baumpop",
                          "body": "did they not set that in the permanent non ratified pile when capping the house in 1920 or would that automatically repeal that ",
                          "score": 2,
                          "created_utc": 1752282909.0,
                          "replies": [
                            {
                              "id": "n2njw90",
                              "author": "EnglishMobster",
                              "body": "Capping the House was a law; this is an Amendment. Since Amendments supercede laws, this would uncap the House and force it to be tied to population no matter what.",
                              "score": -1,
                              "created_utc": 1752283129.0,
                              "replies": [
                                {
                                  "id": "n2nk5yq",
                                  "author": "baumpop",
                                  "body": "well well well. maybe we could get our citizens united. ",
                                  "score": 1,
                                  "created_utc": 1752283228.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "n2kez7q",
                  "author": "ItsNoblesse",
                  "body": "Both parties in the US are bought by big tech lobbyists. The only chance you guys have at resolving this through electoralism is if Zohran Mamdani's election somehow triggers a wave of social democratic victories across the country and a mass shift away from neoliberalism in the democratic party.\n\nThis won't happen, agitation outside the ballot box is 1000% necessary.",
                  "score": 6,
                  "created_utc": 1752248255.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2kesil",
              "author": "Cold_Dot_Old_Cot",
              "body": "That’s because we all weren’t taught consumer science. We all dismissed it because home economics is dismissed due to misogyny.",
              "score": 5,
              "created_utc": 1752248204.0,
              "replies": []
            },
            {
              "id": "n2koiff",
              "author": "TUNGSTEN_WOOKIE",
              "body": "We used to protect consumers from the shady and unethical business practices of companies. \n\nNow, we protect the companies from the demands of the consumer.",
              "score": 4,
              "created_utc": 1752250947.0,
              "replies": []
            },
            {
              "id": "n2npx0a",
              "author": "kurisu7885",
              "body": "We started to get it, now what little we had gotten has been trashed.",
              "score": 1,
              "created_utc": 1752285333.0,
              "replies": []
            },
            {
              "id": "n2nyhbx",
              "author": "126270",
              "body": "Eerrmm, technology advances so fast that products are very often obsolete by the time they have been designed, produced, packaged, shipped  \n\nConsumers could do I tiny bit of due diligence and realize “ohhhh, there will be an even fancier model in 6 months? Ok I’ll wait” - but we’re a world of consumerism and impulse - people want what they want and they want it now  \n\nThere are already plenty of informed consent regulations, there are already plenty of consumers who do not read the fine print before signing  \n\nWhat’s your proposal? Manufactures have to prefect the future, have foreknowledge of new technologies, new regulations, new costs, potential issues, build that all into the sell price and guarantee it all works perfectly for the next 5 years? 10 years? Regardless of what happens in the world?  \n\nOk cool, on the left - a fancy 4k night vision security camera - $2,850 - will work perfectly for 10 years and comes with unlimited cloud based storage and functionality… On the right - same exact security camera - $24.95 but only limited warranty of 12 months and the cloud functionality and storage is all separate….  \n\nYea, sorry, haven’t been able to sell any of those $2,850 versions, not sure why….",
              "score": -2,
              "created_utc": 1752288547.0,
              "replies": []
            },
            {
              "id": "n2khzv0",
              "author": "StanielReddit",
              "body": "#MAGA",
              "score": -8,
              "created_utc": 1752249092.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2k1y4u",
          "author": "DaoFerret",
          "body": "Yeah, but they’d probably just spin off the company discontinuing the devices to avoid the fee and let it go bankrupt and continue on their merry way.",
          "score": 9,
          "created_utc": 1752244588.0,
          "replies": []
        },
        {
          "id": "n2k9f7f",
          "author": "e430doug",
          "body": "There are already laws that require electronics manufacturers to charge recycling fee fees. There’s no notion of forever support on cheap consumer electronics.",
          "score": 3,
          "created_utc": 1752246711.0,
          "replies": []
        },
        {
          "id": "n2l8i4v",
          "author": "New_git",
          "body": "At this point as a consumer, you're looking at replacing your entire setup in 5-10 years, at best, if you plan to do anything \"smart\" in a permanent project. Companies want you to buy their latest and \"greatest\" so they will kill off obsolete equipment and products to force you to \"upgrade\". Just like how software are now subscriptions instead of you owning the working license. There are perpetual licensing but they're \"outdated\" with compatibility requirement in a year or two that will force you to pay to comply. The people that are supposed to be creating laws and protecting the publics are stock owners and investors in the companies that are using these business practices. Be mindful and don't buy or support any business like this.",
          "score": 3,
          "created_utc": 1752256500.0,
          "replies": []
        },
        {
          "id": "n2m0uwj",
          "author": "JunkiesAndWhores",
          "body": "In the EU we have [WEEE](https://environment.ec.europa.eu/topics/waste-and-recycling/waste-electrical-and-electronic-equipment-weee_en). Every electrical item sold has a small fee to help cover recycling costs.",
          "score": 2,
          "created_utc": 1752264844.0,
          "replies": []
        },
        {
          "id": "n2mg56j",
          "author": "droneb",
          "body": "A EU petition was raised for games recently, a similar could be created for IoT as well",
          "score": 2,
          "created_utc": 1752269417.0,
          "replies": []
        },
        {
          "id": "n2obgjx",
          "author": "Heroic_Lime",
          "body": "There's a better chance my tax dollars somehow end up paying for Belkin's court fees ",
          "score": 2,
          "created_utc": 1752293900.0,
          "replies": []
        },
        {
          "id": "n2ojmfg",
          "author": "Teftell",
          "body": "The lawmakers usually just issue \"landfill\" tax, which will be paid by customers in the end, and that is all.",
          "score": 2,
          "created_utc": 1752297753.0,
          "replies": []
        },
        {
          "id": "n2kmyi5",
          "author": "PartyRyan",
          "body": "Dodge v Ford",
          "score": 1,
          "created_utc": 1752250502.0,
          "replies": [
            {
              "id": "n2lio5a",
              "author": "CreeperslayerX5",
              "body": "One of the worst case rulings in the US\n\nDodge Brothers should have been ashamed, ruined millions of people’s lives by not letting companies give better salaries or benefits, or caring for the consumers. They legally have no choice other than to squeeze every penny",
              "score": 2,
              "created_utc": 1752259431.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2ut3ny",
          "author": "TiogaJoe",
          "body": "California has laws on the books for electronics and appliances. It is three years after stopping manufacturing for less than $100, and seven for $100+. This is why when Sirius (I think?) Was going to \"turn off\" its car radio device it sold, people in California got a refund. People elsewhere did not.",
          "score": 1,
          "created_utc": 1752386946.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k2gdr",
      "author": "reddcube",
      "body": "This is why local hosting is so important. Companies wouldn’t support their servers indefinitely. HomeKit is more annoying to setup, but least it’s all locally hosted.",
      "score": 90,
      "created_utc": 1752244735.0,
      "replies": [
        {
          "id": "n2klxv2",
          "author": "gredr",
          "body": "And if you're like me and assumed HomeKit was an Apple-exclusive thing, you might be interested to know what I just learned, which is that it's not! The HomeKit protocol itself does *not* require any Apple devices (generally; there may be specific, possibly obscure devices that require an Apple device to get it connected to your WiFi), and Home Assistant with the HomeKit Controller integration can talk directly to HomeKit devices.",
          "score": 44,
          "created_utc": 1752250210.0,
          "replies": [
            {
              "id": "n2l02kz",
              "author": "IllBiteYourLegsOff",
              "body": "All you need to set up a smart home is a shitty old laptop, a $20 usb radio dongle, a decent online guide, and a free afternoon. Then you can add whatever devices you want. It's surprisingly easy to do as a noob if you have any amount of computer literacy. ",
              "score": 7,
              "created_utc": 1752254186.0,
              "replies": [
                {
                  "id": "n2l6mbw",
                  "author": "gredr",
                  "body": "Sure, I run HA myself on an old Lenovo micro-PC. I have a mix of Lutron, Ikea (zigbee), and ESPHome (some self-built, some reflashed Sonoff devices) stuff.\n\nI'd just always stayed away from any \"homekit\" label because I assumed it was all Apple-specific.",
                  "score": 9,
                  "created_utc": 1752255981.0,
                  "replies": []
                },
                {
                  "id": "n2l75fo",
                  "author": "Frodojj",
                  "body": "Do you have a link to the USB radio dongle and a decent online guide, please?",
                  "score": 1,
                  "created_utc": 1752256127.0,
                  "replies": [
                    {
                      "id": "n2mtg93",
                      "author": "IllBiteYourLegsOff",
                      "body": "If you can't find either on your own you're going to have a hard time setting it up and maintaining it since you'll have to do some difficult troubleshooting at some point or another. There is a *fuckton* of available information about home assistant on the internet. \n\nYou want to install the home assistant OS. I dont know what kind of smart product you have but I use a zigbee radio dongle to control a ton of different ikea lightbulbs and zigbee LED strips around the house. I was even able to get an old nest mini to work for voice commands. You can make as simple or complex of a system as you want, really. ",
                      "score": -3,
                      "created_utc": 1752273765.0,
                      "replies": [
                        {
                          "id": "n2n5r4j",
                          "author": "Frodojj",
                          "body": "I didn't know about zigbee radio dongles. I've used Philips Hue lights for about a decade now. They use zigbee, though I will have to figure out how to pair them.\n\nPlease don't underestimate me. You said it was \"surprisingly easy to do as a noob if you have any amount of computer literacy\" then said \"if you can't find either on your own you're going to have a hard time...\" I can figure it out. I just wanted to know what specific sources and devices you were referring to, so I could check them out for myself.",
                          "score": 2,
                          "created_utc": 1752277991.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2k5ov1",
      "author": "hyrumwhite",
      "body": "We’re entering the Internet of Dead Things era",
      "score": 62,
      "created_utc": 1752245661.0,
      "replies": []
    },
    {
      "id": "n2jvotj",
      "author": "chrisdh79",
      "body": "From the article: Belkin has announced that it’s made the “difficult decision” to end support for almost its entire line of Wemo smart home devices from January 31st, 2026. The only models that will continue to work after that date are those that have been configured through Apple HomeKit.\n\nThe news was shared in an email to customers and on Belkin’s website, and confirms that from next February onwards, “Any features that rely on cloud connectivity, including remote access and voice assistant integrations, will no longer work.” The company will also stop providing technical support and troubleshooting assistance after that date, and the Wemo app will no longer receive updates.\n\nSome Wemo devices will continue to work. Three Wemo products (SKUs WLS0503, WSC010, WSP100) based on the Thread protocol, and its video doorbell (WDC010) will work as normal through HomeKit. Other Wemo products that are compatible with HomeKit will also carry on working through the Apple network so long as they’re configured before January 31st.\n\nBelkin says that if your Wemo product is still under warranty when support ends, you may be eligible for a “partial refund,” though it won’t begin processing those refunds before that date.\n\nThis doesn’t come as a total surprise. Belkin backed away from its support of the Matter smart home standard in 2023, announcing it would “take a big step back, regroup, and rethink” its approach to smart home hardware. It hasn’t released any new Wemo products since then.",
      "score": 35,
      "created_utc": 1752242753.0,
      "replies": [
        {
          "id": "n2k5dax",
          "author": "MrThickDick2023",
          "body": "So if you don't configure these with HomeKit in time, they're just bricked? And I assume that also means resetting them or moving them to another network is also out? That's insane.",
          "score": 16,
          "created_utc": 1752245570.0,
          "replies": [
            {
              "id": "n2lihlb",
              "author": "SoapyMacNCheese",
              "body": "yup, Homekit does the control locally, so it doesn't need to talk to Belkin's servers to work. But those non-thread devices require communicating with the server to setup with Homekit.",
              "score": 3,
              "created_utc": 1752259379.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2jz4m1",
          "author": "deejeycris",
          "body": "Yeah a partial refund good luck with those who bought the product recently in the EU",
          "score": 10,
          "created_utc": 1752243771.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k6ry6",
      "author": "fr4nk_j4eger",
      "body": "I think these devices need a similar initiative as \"stop killing games\"",
      "score": 32,
      "created_utc": 1752245966.0,
      "replies": [
        {
          "id": "n2kc7io",
          "author": "jayfactor",
          "body": "Came here to say this, gamers have been dealing with this for years now lol",
          "score": 5,
          "created_utc": 1752247485.0,
          "replies": []
        },
        {
          "id": "n2kzd0g",
          "author": "markbraggs",
          "body": "Yep exactly. This is why I still buy physical media for gaming. Too many stores getting shut down, games disappearing, etc. Now that practice is bleeding into server support for smart home devices. Google is a big offender too. \n\nUnless devices can be hosted locally then I think I’m out on everything “smart”",
          "score": 4,
          "created_utc": 1752253989.0,
          "replies": [
            {
              "id": "n2n5efp",
              "author": "mickeycoolmouse",
              "body": "Funny. I bought The Crew physical for my 360 and then my PS4. Can't use either copy. \n\nBuying physical just isn't going to do ensure anything these days. A lot of physical games these days just need an online connection to download the rest or to even start the game. \n\nI'm really hoping the discussions the initiative leads to brings about meaningful change to end of life support.",
              "score": 4,
              "created_utc": 1752277867.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2k6f5w",
      "author": "PMacDiggity",
      "body": "My hard requirement for just about any new tech I buy is it can only be cloud-depended if there is a very good reason for it. Streaming services for example store and serve all their content for me, but home automation tech, or health monitoring gadgets, or cooking tech all must be able to run locally and can't be shut down by a company going belly up overnight or I won't buy them.",
      "score": 23,
      "created_utc": 1752245868.0,
      "replies": [
        {
          "id": "n2kc50a",
          "author": "jayfactor",
          "body": "10000% imagine not being able to use your kitchen because the software is out of date, outrageous.",
          "score": 9,
          "created_utc": 1752247466.0,
          "replies": [
            {
              "id": "n2kv2kb",
              "author": "beheadthedonald",
              "body": "Cory Doctorow wrote a pretty good short story about this concept called Unauthorized Bread. You can read it for free here:\n\nhttps://arstechnica.com/gaming/2020/01/unauthorized-bread-a-near-future-tale-of-refugees-and-sinister-iot-appliances/",
              "score": 4,
              "created_utc": 1752252809.0,
              "replies": [
                {
                  "id": "n2lhzuz",
                  "author": "SkollFenrirson",
                  "body": "Man never misses. He also coined the [term for Enshittification](https://en.wikipedia.org/wiki/Enshittification)",
                  "score": 2,
                  "created_utc": 1752259236.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2meww3",
          "author": "lunasdude",
          "body": "See that's the thing is that technically they're not disabling them at least physically. \n\nI have several of their smart switches which now I'm going to have to unwire and rewire some new stuff in and several of their smart plugs and they will still \"physically\" work they just won't have any connection to voice activation because they will have no external cloud support and they won't have remote capabilities because again no cloud support. \n\nI have at one time set up a personal email server and I guess I could set one up manually for this stuff but really it's too much trouble and I don't want to do it.",
          "score": 1,
          "created_utc": 1752269033.0,
          "replies": [
            {
              "id": "n2olwyx",
              "author": "TheTerrasque",
              "body": "I'd recommend setting up Home Assistant and use Zigbee stuff.",
              "score": 1,
              "created_utc": 1752298943.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n2tex7o",
          "author": "Old_Instance_2551",
          "body": "This is nothing. Small EV companies in China have being selling vehicle that requires connectivity and routinely bricking them when the company goes bankrupt. There were also reported cases of BYD car shutting themselves down in the middle of the highway because the company pushed out a new update.",
          "score": 1,
          "created_utc": 1752365820.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k3ne2",
      "author": "chrissamperi",
      "body": "Absolutely insane. I have so many Wemo devices. So angry",
      "score": 15,
      "created_utc": 1752245080.0,
      "replies": [
        {
          "id": "n2lckj0",
          "author": "Sick_Wave_",
          "body": "Time to spin up Home Assistant and get them connected to run locally.",
          "score": 3,
          "created_utc": 1752257658.0,
          "replies": [
            {
              "id": "n2lhksn",
              "author": "chrissamperi",
              "body": "I have them on HomeKit already, but a couple have disconnected and it’s already the dickens to try to reconnect them. I shudder to think about what it will be like without the Wemo app",
              "score": 4,
              "created_utc": 1752259114.0,
              "replies": [
                {
                  "id": "n2n2fpu",
                  "author": "Sick_Wave_",
                  "body": "That sucks. I'm sorry. ",
                  "score": 1,
                  "created_utc": 1752276838.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2lha7h",
              "author": "doctorzeromd",
              "body": "Will they still work when connected that way?",
              "score": 1,
              "created_utc": 1752259028.0,
              "replies": [
                {
                  "id": "n2n2ja6",
                  "author": "Sick_Wave_",
                  "body": "That's what the article says, but people are saying the devices suck for it",
                  "score": 1,
                  "created_utc": 1752276872.0,
                  "replies": [
                    {
                      "id": "n2n7j6j",
                      "author": "doctorzeromd",
                      "body": "Oh really? I didn't see any mention of home assistant.\n\nI have 3 wemo devices connected to my HA server and they work great!",
                      "score": 1,
                      "created_utc": 1752278626.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "n6ecimp",
          "author": "Fit-Flamingo9050",
          "body": "Like wtf",
          "score": 1,
          "created_utc": 1754074165.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k8lbd",
      "author": "Phantasmio",
      "body": "More e-waste. Great.",
      "score": 8,
      "created_utc": 1752246480.0,
      "replies": []
    },
    {
      "id": "n2ki8mk",
      "author": "Flusterfuzz",
      "body": "**For UK Consumers.....**\n\n\\[Your Address\\]\n\n\\[Date\\]\n\nCustomer Service Department\n\n\\[Retailer Name\\]\n\n\\[Retailer Address\\]\n\nDear Sir/Madam,\n\nRe: Refund Request for Wemo Smart Home Device\n\nI am writing to request a full refund for my Wemo smart home device purchased from your store on \\[purchase date\\].\n\nBelkin has announced that they will end all support for Wemo devices on January 31, 2026, after which the device will lose its core functionality including cloud features, remote access, and app control. This effectively means the product will become unusable for its intended purpose.\n\nUnder the Consumer Rights Act 2015, products must be:\n\n\\- Of satisfactory quality\n\n\\- Fit for purpose\n\n\\- Last for a reasonable length of time\n\nA smart home device that becomes non-functional due to manufacturer-imposed software discontinuation does not meet these requirements, particularly the \"reasonable length of time\" provision. The Act provides consumer protection for up to 6 years in England and Wales (5 years in Scotland), and I believe this premature end of service represents a breach of these statutory rights.\n\nWhile I understand this situation stems from Belkin's decision rather than yours as the retailer, under UK consumer law, my contract is with you as the seller, and you are responsible for ensuring products meet their statutory requirements.\n\nI therefore request a full refund of the purchase price of \\[amount\\]. I have attached a copy of my receipt for your reference.\n\nI look forward to your response within 14 days.\n\nYours faithfully,\n\n\\[Your name\\]\n\nEncl: Copy of receipt",
      "score": 21,
      "created_utc": 1752249162.0,
      "replies": [
        {
          "id": "n2kin43",
          "author": "Flusterfuzz",
          "body": "\\[Your Address\\]\n\n\\[Date\\]\n\n\n\nCustomer Service Department\n\n\\[Retailer Name\\]\n\n\\[Retailer Address\\]\n\n\n\nLETTER BEFORE ACTION\n\nWITHOUT PREJUDICE\n\n\n\nDear Sir/Madam,\n\n\n\nRe: Wemo Smart Home Device - Final Notice Before Legal Proceedings\n\n\n\nI wrote to you on \\[date of first letter\\] regarding a refund for my Wemo smart home device, citing my rights under the Consumer Rights Act 2015. I have not received any response to this correspondence within the requested 14-day timeframe.\n\n\n\nThis letter serves as my final notice before I initiate legal proceedings through the Small Claims Court.\n\n\n\nTo reiterate:\n\n1. The product will become non-functional on January 31, 2026, due to Belkin's discontinuation of essential services\n\n2. This breaches my statutory rights under the Consumer Rights Act 2015, specifically:\n\n   \\- The requirement for goods to be fit for purpose\n\n   \\- The requirement for goods to last a reasonable time\n\n3. The purchase price paid was \\[amount\\]\n\n4. I have provided proof of purchase\n\n\n\nUnless I receive a full refund within 14 days from the date of this letter, I will have no choice but to:\n\n1. Initiate proceedings in the Small Claims Court\n\n2. Seek to recover the purchase price plus court fees and any reasonable costs incurred\n\n\n\nI remain open to alternative dispute resolution methods, including mediation, should you wish to discuss this matter further. However, time is now of the essence.\n\n\n\nPlease note that this letter may be used in court proceedings as evidence of my reasonable attempt to resolve this matter.\n\n\n\nI look forward to your urgent response.\n\n\n\nYours faithfully,\n\n\\[Your name\\]\n\n\n\nEncl: \n\n\\- Copy of original letter dated \\[date\\]\n\n\\- Copy of original receipt\n\n\\- Details of Belkin's announcement regarding service discontinuation",
          "score": 18,
          "created_utc": 1752249274.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2kgjn7",
      "author": "ToMorrowsEnd",
      "body": "They should be forced to open source the firmware.",
      "score": 7,
      "created_utc": 1752248687.0,
      "replies": []
    },
    {
      "id": "n2k8gx5",
      "author": "petermadach",
      "body": "Stop Killing Smart Home Devices initiative coming up after Stop Killing Video Games succeeded?",
      "score": 12,
      "created_utc": 1752246446.0,
      "replies": []
    },
    {
      "id": "n2kwdpt",
      "author": "slickmitch",
      "body": "Note to self, add Belkin to my never buy list. \n\n![gif](giphy|KavG3AruG3gAXKkswv)",
      "score": 6,
      "created_utc": 1752253165.0,
      "replies": []
    },
    {
      "id": "n2libn9",
      "author": "tslnox",
      "body": "I hate that word. They're not *ending support*, they're **artificially killing devices you bought**. Ending support would only mean they wouldn't support you if something went wrong on your side.\n\nForce those companies to build their devices with a completely open API (and don't forget to include clauses against any kind of \"technically we have public API but you have to jump through this many hoops and it still won't work unless you're certified or whatever\"), that's the only way.",
      "score": 7,
      "created_utc": 1752259331.0,
      "replies": []
    },
    {
      "id": "n2m1ra9",
      "author": "Shadow647",
      "body": "Remember - the L in IoT stands for longevity.",
      "score": 6,
      "created_utc": 1752265108.0,
      "replies": [
        {
          "id": "n2najkz",
          "author": "Neo_Techni",
          "body": "And the S stands for Security!",
          "score": 4,
          "created_utc": 1752279712.0,
          "replies": [
            {
              "id": "n2u6hnw",
              "author": "brocococonut",
              "body": "And the R stands for Reliability!",
              "score": 2,
              "created_utc": 1752376396.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2mar09",
      "author": "The-Riskiest-Biscuit",
      "body": "I’m awaiting communication from Belkin on how I can return all of their cyber waste to them and get refunds. I’ll try to remember to report back here if it works.",
      "score": 6,
      "created_utc": 1752267753.0,
      "replies": []
    },
    {
      "id": "n2mi82r",
      "author": "Rude_Citron9016",
      "body": "Assholes",
      "score": 6,
      "created_utc": 1752270073.0,
      "replies": []
    },
    {
      "id": "n2k6oqf",
      "author": "sgtcarrot",
      "body": "Welp, I guess I never will buy Belkin again.  \nI have at least a dozen WEMO products, mostly smart plugs.   \nAnd apparently only Homekit users get any recourse; I am Android and PC.   \nSMH.",
      "score": 4,
      "created_utc": 1752245941.0,
      "replies": [
        {
          "id": "n2medph",
          "author": "lunasdude",
          "body": "I'm in the same boat, pinned all my \" smart home \" products on WeMo. \n\nWhen I got my email from Belkin after cussing them heavily I jumped on and started doing some research. \n\nAlmost all of my WeMo products are either Smart switches or smart plugs so since I have several Amazon Alexa's which are used to control my Smart switches I came up with Amazon's smart offerings which covered everything I needed and a bonus they're on sale right now because of Amazon's prime week. \n\nIt really sucks so because I liked my WeMo products they worked pretty well, bastards.",
          "score": 2,
          "created_utc": 1752268867.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k9boo",
      "author": "count_chocul4",
      "body": "WEMO HomeKit switches suck. I need to reset and reprogram them weekly. Utter garbage",
      "score": 5,
      "created_utc": 1752246684.0,
      "replies": []
    },
    {
      "id": "n2kbx7v",
      "author": "jayfactor",
      "body": "This is why I will never rely on the internet or subscriptions for physical services - you’re at the mercy of the company.",
      "score": 5,
      "created_utc": 1752247406.0,
      "replies": []
    },
    {
      "id": "n2kc0i8",
      "author": "RaccoonDu",
      "body": "And I thought Google was bad with killing their products. I can totally see Google killing their nest cameras in the future. What's a brand of cameras that isn't Ring and SHOULD have a long life span?",
      "score": 4,
      "created_utc": 1752247431.0,
      "replies": [
        {
          "id": "n2kzw6p",
          "author": "markbraggs",
          "body": "Anything that doesn’t rely on a subscription and has the ability to store video locally on a SD card. I think eufy is one.",
          "score": 4,
          "created_utc": 1752254137.0,
          "replies": []
        },
        {
          "id": "n2ldk9y",
          "author": "elanorym",
          "body": "Unifi",
          "score": 1,
          "created_utc": 1752257948.0,
          "replies": []
        },
        {
          "id": "n2mchfl",
          "author": "lunasdude",
          "body": "I could not agree more which is why I have avoided Google products in general, their phones, they're smart products etc. \n\nAlthough like most humans on this planet I do rely on Gmail and a few other Google products but overall especially when it comes to hardware they've killed way too many things for me to trust them at this point. \n\nI thought wemo was a pretty good bet because they have been around for quite a while and when Belkin bought them I thought it was even a better fit but obviously I was stoned dead wrong. \n\nI have several smart plugs and wall switches from wemo and after doing research decided to go with Amazon's branded devices. \n\nI already have several Amazon ALEXA devices which is what I use to interface with my Smart switches so for me and since Amazon is such a large company hopefully that will work for me in the future. \n\nAnother plus right now is Amazon devices are on prime days specials so I was able to replace multiple smart plugs and wall switches for a very good price.",
          "score": 1,
          "created_utc": 1752268284.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2ktvom",
      "author": "sasquatch_melee",
      "body": "Companies who do this should be required to as a last step, provide software that allows for self hosting. I'm happy to have a PI or windows box run my home devices",
      "score": 5,
      "created_utc": 1752252477.0,
      "replies": [
        {
          "id": "n2m5clb",
          "author": "iiiinthecomputer",
          "body": "They'd just spin off a division that would then conveniently go bankrupt.",
          "score": 3,
          "created_utc": 1752266158.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2lvmqf",
      "author": "joj1205",
      "body": "Got to hold these billionaires accountable. \n\nWe buy the product. Then they decided they can't shaft us so they discontinue it. The f is wrong with this planet.",
      "score": 6,
      "created_utc": 1752263278.0,
      "replies": []
    },
    {
      "id": "n2m8ydt",
      "author": "kclongest",
      "body": "This is part of the reason I prefer not to buy smart anything.",
      "score": 5,
      "created_utc": 1752267223.0,
      "replies": []
    },
    {
      "id": "n2nj8fn",
      "author": "Bulldog8018",
      "body": "I put off buying this crap long enough that now I’m relieved that I won’t have to loathe myself for trusting them. If I want home security I just lock the door.",
      "score": 5,
      "created_utc": 1752282889.0,
      "replies": []
    },
    {
      "id": "n2rhhap",
      "author": "chronicnerv",
      "body": "The only way to stop this happening again is to bring in laws against planned obsolescence. These devices should still work on local Wi-Fi without needing to connect to company servers, especially if the company’s going to stop support.\n\nGamers are fighting for the same thing with the \"Stop Killing Games\" campaign. Same idea really, if you’ve paid for something, you should be able to keep using it.",
      "score": 4,
      "created_utc": 1752342717.0,
      "replies": []
    },
    {
      "id": "n2kcevb",
      "author": "TheKensei",
      "body": "Theses kind of devices should comply to an open protocol making it possible to operate outside of the company's servers.",
      "score": 3,
      "created_utc": 1752247543.0,
      "replies": []
    },
    {
      "id": "n2lxkoo",
      "author": "intellifone",
      "body": "This is why I no longer buy smart home devices that do not support matter or matter over thread. Proprietary connectivity standards are bullshit.",
      "score": 5,
      "created_utc": 1752263864.0,
      "replies": []
    },
    {
      "id": "n2k1isn",
      "author": "Zedris",
      "body": "I dont buy anything anymore that isn’t either zigbee or matter/thread. This behavior is ridiculous",
      "score": 7,
      "created_utc": 1752244466.0,
      "replies": [
        {
          "id": "n2q0gab",
          "author": "patryuji",
          "body": "Just recently (last Black Friday), I decided that going forward everything in our house should support Matter as a just in case.  I think it was Google announcing the end of support for some Nest devices that pushed us toward that.  We'll still have some items bricked if our selected brand goes out of business or decides to end a product line, but it won't be as bad as it could have been had we not started ensuring Matter compatibility.",
          "score": 1,
          "created_utc": 1752325659.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2k3n3i",
      "author": "DBT85",
      "body": "This is why I reolink. Company can explode tomorrow and all my shit still works locally.",
      "score": 7,
      "created_utc": 1752245078.0,
      "replies": [
        {
          "id": "n2mfqge",
          "author": "lunasdude",
          "body": "Isn't Riolink security cameras and such? \n\nWhen I looked them up and clicked on their website that's all that came up. \n\nA lot of people are discussing the fact that like me they have smart wall switches and plugs to control lights and other things which after Belkin shuts the servers down will still physically function but won't have any remote smart capabilities. \n\nLike you I have a couple of security cameras that do not rely on a web interface.",
          "score": 2,
          "created_utc": 1752269290.0,
          "replies": [
            {
              "id": "n2mlto1",
              "author": "DBT85",
              "body": "Yes that's all they do I think. I'd not honestly looked at belkons stuff much and just went off the image of the camera. \n\nThe rest of my smart home stuff is all local. Doesn't seem any point in having a smart home if it's useless without outside help.",
              "score": 1,
              "created_utc": 1752271212.0,
              "replies": [
                {
                  "id": "n2mon3f",
                  "author": "lunasdude",
                  "body": "Agreed, and there's the catch, if you want the cool features of a smart home such as telling Alexa or Google to turn on your lights, monitor you washing machine etc or you like the remote capability of being able to turn on your heating or AC remotely before you get home then you have to have either a home-built internal server which I did many years ago and trust me it is a pain in the ass to maintain or you have to rely on a company to maintain its servers. \n\n\nThis is one of the cautionary tales of what happens when they abandon those very servers You're stuck with a heavy manual paperweight",
                  "score": 1,
                  "created_utc": 1752272131.0,
                  "replies": [
                    {
                      "id": "n2msxqx",
                      "author": "DBT85",
                      "body": "I have to say, maintaining a HA instance is not that difficult and it can scale as slowly or as quickly as you are prepared to put the effort in and with the new voice capabilities it won't be long before you can send Amazon and Google all their shite back too. Plus it'll run on nearly anything, be entirely local and do so much more beyond standard \"smart home\" stuff.",
                      "score": 1,
                      "created_utc": 1752273587.0,
                      "replies": [
                        {
                          "id": "n2naur1",
                          "author": "lunasdude",
                          "body": "see, I'm mid tier technically capable and while I can, and have done it, I got tired of constantly updating drivers, security patches, API's router settings etc.\n\nit became very tedious for me.\n\n  \nI can do it, I just choose not to and im older now and more grumpy 🙄🤣🤣",
                          "score": 0,
                          "created_utc": 1752279825.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n2k4tlr",
      "author": "O-parker",
      "body": "I bought a couple devices about 2 yrs ago …total crap ..they maybe worked 1/2 the time.",
      "score": 3,
      "created_utc": 1752245414.0,
      "replies": []
    },
    {
      "id": "n2kcigd",
      "author": "richcournoyer",
      "body": "Well, THIS SUCKS!   Thanks!",
      "score": 3,
      "created_utc": 1752247570.0,
      "replies": []
    },
    {
      "id": "n2ki7z2",
      "author": "magichands88",
      "body": "Stop Killing Hardware",
      "score": 3,
      "created_utc": 1752249156.0,
      "replies": []
    },
    {
      "id": "n2knx7b",
      "author": "Curious_Document_956",
      "body": "Apple is better than the orange Homekit. The house of white probably has this shit lol",
      "score": 3,
      "created_utc": 1752250777.0,
      "replies": [
        {
          "id": "n2zfwfm",
          "author": "TheAussieTico",
          "body": "what",
          "score": 1,
          "created_utc": 1752448992.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2lmyog",
      "author": "DeeWoogie",
      "body": "I have had no benefit from any smart devices. A few lightbulbs have been a cool gimmick. The smart home idea is more hassle than it is worth",
      "score": 3,
      "created_utc": 1752260680.0,
      "replies": [
        {
          "id": "n2lrk6p",
          "author": "snow288",
          "body": "Yep and once you start buying into it, it is a never ending cycle of purchases due to older hardware not being supported.",
          "score": 3,
          "created_utc": 1752262045.0,
          "replies": [
            {
              "id": "n2lv4of",
              "author": "DeeWoogie",
              "body": "Agreed, plus with companies not wanting to integrate and everyone wanting to have their own app and ecosystem it is a real hassle. Nothing makes my family more angry than installing another smart home product",
              "score": 2,
              "created_utc": 1752263126.0,
              "replies": [
                {
                  "id": "n2zgcig",
                  "author": "TheAussieTico",
                  "body": "It’s quite easy to avoid the multiple app thing though",
                  "score": 2,
                  "created_utc": 1752449146.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "n2pjm6l",
              "author": "Djentleman5000",
              "body": "I’ve had the Eufy suite for a few years and it has been fine save one update that wiped all cameras from my home base. Since then, no issues. Our house came with the autolock, garage door, and thermostat thing. They tried to get me into adt but I wasn’t trying to be locked into anything. Best decision I made after talking with neighbors.",
              "score": 1,
              "created_utc": 1752318320.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n2lzl2r",
      "author": "tallest_chris",
      "body": "I love technology but am becoming dedicated to never buy things with unnecessary screens, servers, or batteries. Anything that can be disabled by someone else deciding that they no longer want to produce the supply of consumables or complicated replacement parts. It’s all future garbage and the plastic parts will outlive the functionality by huge margins.",
      "score": 3,
      "created_utc": 1752264464.0,
      "replies": []
    },
    {
      "id": "n2m0l0a",
      "author": "ImpossibleIndustries",
      "body": "Jokes on them... Mine hasn't worked in 3 years bc I threw them in a drawer bc they are shit.",
      "score": 3,
      "created_utc": 1752264763.0,
      "replies": []
    },
    {
      "id": "n2meeb8",
      "author": "ProofNo9183",
      "body": "Wemo devices worked at some point?",
      "score": 3,
      "created_utc": 1752268872.0,
      "replies": []
    },
    {
      "id": "n2st1f3",
      "author": "53-44-48",
      "body": "The curtain call for devices should be an open-sourcing of the code that supports them.  It gives the purchaser the ability to use the device after the company abandons it",
      "score": 3,
      "created_utc": 1752358093.0,
      "replies": []
    },
    {
      "id": "n2kchj4",
      "author": "jawshoeaw",
      "body": "Just got the email :(",
      "score": 2,
      "created_utc": 1752247564.0,
      "replies": []
    },
    {
      "id": "n2kcvih",
      "author": "DrCheezburger",
      "body": "I have a few Wemo smart plugs, but they just use wifi; I don't understand how they can disable them remotely.",
      "score": 2,
      "created_utc": 1752247673.0,
      "replies": [
        {
          "id": "n2kjjyz",
          "author": "nerdyintentions",
          "body": "That doesn't mean that all communication happens over your local network. They aren't disabling anything. It's more likely that some of their devices can't function without first connecting to their servers. And they are shutting down their servers.",
          "score": 5,
          "created_utc": 1752249531.0,
          "replies": [
            {
              "id": "n2kn0zn",
              "author": "DrCheezburger",
              "body": "As far as I know, these smart plugs don't connect to any servers. Am I mistaken?",
              "score": 1,
              "created_utc": 1752250521.0,
              "replies": [
                {
                  "id": "n2m569n",
                  "author": "iiiinthecomputer",
                  "body": "Probably, yes. Try disconnecting your Internet service temporarily or adding a block in your router to stop them using the Internet. Most likely they won't work.\n\nMost of these things call out to Internet based servers then back into your home, rather than using point to point communication over wifi.",
                  "score": 3,
                  "created_utc": 1752266107.0,
                  "replies": []
                },
                {
                  "id": "n2mbqkz",
                  "author": "lunasdude",
                  "body": "All WeMo products connect to servers which is how you get the remote capabilities and the voice activation through ALXEA and Google also home kit as well. \n\nWhat they're doing is stopping that support so while our plugs and wall switches will continue to physically work with a push of a button everything else will stop working.",
                  "score": 2,
                  "created_utc": 1752268055.0,
                  "replies": []
                },
                {
                  "id": "n2nbpxh",
                  "author": "Neo_Techni",
                  "body": "> Am I mistaken?\n\nyes",
                  "score": 2,
                  "created_utc": 1752280142.0,
                  "replies": []
                },
                {
                  "id": "n2o553b",
                  "author": "DrCheezburger",
                  "body": "Thanks for the enlightenment, folks. This explains why the plugs are so flaky. Gotta reset 'em every few weeks. \n\nThe price we pay for convenience ...",
                  "score": 1,
                  "created_utc": 1752291227.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n2mbh7v",
          "author": "lunasdude",
          "body": "They're not going to be disabling them remotely. \n\nWhat's happening is they are stopping their support through their cloud-based computers so what that means to you is that while your device will still connect to your Wi-Fi they really won't be able to do anything unless you have a manual server on a computer or you have Apple HomeKit which will support a few of the devices not all of them. \n\nWhat that means to most of us is that they will essentially neuter the devices by not supporting them so no voice activation by ALXEA or Google and no remote functions whatsoever.\n\nYou will still be able to press the physical button on the wall switches and on the plugs etc and it will function as a really expensive dumb switch.",
          "score": 3,
          "created_utc": 1752267975.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2kkz07",
      "author": "havingpun",
      "body": "So if I need to reset my plug that’s on Apple HomeKit, which happens often, I’m fucked?!",
      "score": 2,
      "created_utc": 1752249934.0,
      "replies": []
    },
    {
      "id": "n2lkciw",
      "author": "RoganDawes",
      "body": "Atone prepared to tear the devices down and see what microcontrollers they are based on? Then we can see what alternatives exist, in terms of making replacement firmware for them.\n\nEsphome already supports esp8266 and esp32 (obviously), but also rp2040, bk7231, rtl8710, and probably more in progress (eg stm32 and Nordic nrf52840) and others.",
      "score": 2,
      "created_utc": 1752259917.0,
      "replies": []
    },
    {
      "id": "n2lqjsg",
      "author": "veteran_squid",
      "body": "Question: after support stops, if I factory reset a smart plug, will I be unable to add it back to HomeKit?",
      "score": 2,
      "created_utc": 1752261742.0,
      "replies": [
        {
          "id": "n2maguz",
          "author": "lunasdude",
          "body": "That's a very good question, my understanding is that some devices, read some devices will continue to work with home kit but not all so if I were you I would reach out to Belkin right now or Apple and get that question answered so if you need to find a replacement you can do it now and not after it's too late. \n\nGood luck",
          "score": 3,
          "created_utc": 1752267668.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2mfk30",
      "author": "po3smith",
      "body": "Oh trust me if that company makes any other products I'll be certainly getting a nice bump in the amount that I own by not paying for them seeing how they refuse to give me a refund on this product.",
      "score": 2,
      "created_utc": 1752269234.0,
      "replies": []
    },
    {
      "id": "n2o5oaa",
      "author": "seamonkey420",
      "body": "homebridge is your friend.",
      "score": 2,
      "created_utc": 1752291448.0,
      "replies": []
    },
    {
      "id": "n2rvthl",
      "author": "Siege_Storm",
      "body": "This is why I bought a closed loop system with no subscription or reliance on the parent company",
      "score": 2,
      "created_utc": 1752347231.0,
      "replies": []
    },
    {
      "id": "n2tg5xf",
      "author": "fferreira007",
      "body": "You know what we need? A \"Stop killing games\" for this type of product",
      "score": 2,
      "created_utc": 1752366285.0,
      "replies": []
    },
    {
      "id": "n2k1xah",
      "author": "Ok-disaster2022",
      "body": "And this is why I have never invested in smart home technology: lack of confidence in long term support and lack of confidence in security. ",
      "score": 3,
      "created_utc": 1752244581.0,
      "replies": [
        {
          "id": "n2zhg5g",
          "author": "TheAussieTico",
          "body": "You just have to be smart about what you invest in. The majority of my smart home products work locally",
          "score": 1,
          "created_utc": 1752449523.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2lisqf",
      "author": "zomboscott",
      "body": "They got the data they wanted.",
      "score": 1,
      "created_utc": 1752259467.0,
      "replies": []
    },
    {
      "id": "n2orgcy",
      "author": "dnuohxof-2",
      "body": "Google is dropping Gen 1 (and I think Gen 2) Nest users.\n\nMy nest is perfectly good. They just don’t want to keep running the servers for some reason so come Oct my Nest thermostat I’ve had for a decade is going to be bricked…..\n\nFucking tired of this blatantly forced obsolescence",
      "score": 1,
      "created_utc": 1752301923.0,
      "replies": []
    },
    {
      "id": "n2q0qw1",
      "author": "KrackSmellin",
      "body": "Guess they watched Google end the Nest Protect with no consequences other than upset customers… so they took a page from that playbook.",
      "score": 1,
      "created_utc": 1752325771.0,
      "replies": []
    },
    {
      "id": "n2t4ti1",
      "author": "Used-Journalist-36",
      "body": "Yup, not buying any belkin stuff anymore.",
      "score": 1,
      "created_utc": 1752362201.0,
      "replies": []
    },
    {
      "id": "n2tqnoa",
      "author": "zebonaut5",
      "body": "The Wemo app has been shit for a long time; but all my modules work fine through the homekit app; and should continue to do so?",
      "score": 1,
      "created_utc": 1752370250.0,
      "replies": []
    },
    {
      "id": "n2uf1yw",
      "author": "dlc741",
      "body": "Wink taught me never to trust my home automation to someone else. I’ve been generic Z-Wave and WiFi on Home Assistant for years.",
      "score": 1,
      "created_utc": 1752380074.0,
      "replies": []
    },
    {
      "id": "n2wi54f",
      "author": "baberim",
      "body": "Damn I guess my first gen light switch configured through homebridge won’t count. Lame",
      "score": 1,
      "created_utc": 1752416751.0,
      "replies": []
    },
    {
      "id": "n36q3rm",
      "author": "ptoadstools",
      "body": "My Wemo smart switches have been problematic already.  They're going into the e-waste.  Most controlled lighting, but smart bulbs are the better option now.",
      "score": 1,
      "created_utc": 1752543845.0,
      "replies": []
    },
    {
      "id": "n6ebokk",
      "author": "Fit-Flamingo9050",
      "body": "Like wtf now my camera is just junk?",
      "score": 1,
      "created_utc": 1754073917.0,
      "replies": []
    },
    {
      "id": "n2kd9kg",
      "author": "kapege",
      "body": "No symphaty for those folks that bought that cloud crap. Now you got your payoff.",
      "score": -4,
      "created_utc": 1752247782.0,
      "replies": []
    }
  ]
}