{
  "post": {
    "title": "Insta360 zooms into mini cameradrone space with Antigravity",
    "author": "chrisdh79",
    "id": "1mbhg0v",
    "score": 147,
    "created_utc": 1753712365.0,
    "selftext": "",
    "num_comments": 12,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1mbhg0v/insta360_zooms_into_mini_cameradrone_space_with/"
  },
  "comments": [
    {
      "id": "n5m2lol",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1753712365.0,
      "replies": []
    },
    {
      "id": "n5mmp7j",
      "author": "irishhighviking",
      "body": "I'm glad to see another drone in this space. My Neo is great, but could certainly be better. I'd like to see better resolution in portrait mode, fewer fly-aways, and any competitor should also have prop guards.\n\nA Neo can be had for under $500 with all the accessories you need. Hopefully, this creates even better pricing.",
      "score": 4,
      "created_utc": 1753718144.0,
      "replies": []
    },
    {
      "id": "n5mbzn7",
      "author": "H_S_P",
      "body": "Sounds cool but it sucks they’re designing it with features to prevent you from being able to modify a thing you own",
      "score": 4,
      "created_utc": 1753715114.0,
      "replies": [
        {
          "id": "n5mfiw0",
          "author": "nitrofan111",
          "body": "That’s pretty much any off the shelf drone. If you want to modify, DIY from the ground up.",
          "score": 4,
          "created_utc": 1753716123.0,
          "replies": [
            {
              "id": "n5mrdm0",
              "author": "wannaseeawheelie",
              "body": "There’s tons of BnF drones out there that are easy to modify and readily available",
              "score": 1,
              "created_utc": 1753719463.0,
              "replies": []
            }
          ]
        },
        {
          "id": "n5mhs8o",
          "author": "garyb50009",
          "body": "they explicitly state that the first drone will not be for tinkerer's. which is a pretty obvious way of saying the next iteration will, without explicitly legally promising it.",
          "score": 2,
          "created_utc": 1753716768.0,
          "replies": [
            {
              "id": "n5mjv2j",
              "author": "New2thegame",
              "body": "Except it says, \"like upcoming models.\"",
              "score": 6,
              "created_utc": 1753717354.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "n5mo924",
      "author": "chrisdh79",
      "body": "From the article: On specs, we don't have a great deal of information on the brand's first release yet. But we can confirm that it will take off at under 249 g (8.8 oz) so pilots won't need to register the cameradrone for recreational use. The \"true immersive capture\" camera will boast an 8K resolution. Antigravity is promising a few world-firsts in drone design too, \"that enable pilots to experience and capture the world in ways that weren’t possible before.\"\n\nAnd 360-degree videography will be made simple so that \"beginners, experts, and everyone in between\" can get creative. Clearly that means the cameradrone will include a bunch of sensors to enable automated flight modes and obstacle avoidance, with a live video feed streamed to a dedicated remote or a mobile control app.\n\n\"Antigravity drones are made for the curious and the adventurous,\" reads the press release. \"Creators. Travelers. Families. People with bold ideas but with limited time to learn complex flight controls and aerial content creation. It's for anyone who's ever wanted a drone, but felt it would be too big of an investment for something they may never be able to use to its full potential.\"\n\nLike upcoming models in the fleet, the first drone is not for hardware tinkerers, and will include \"smart safety features such as payload detection to prevent misuse or unauthorized modifications.\"\n\nThe brand is also setting up an online community hub where users will be able to share thoughts and experiences that could impact future product development. The co-creation platform intends to reward contributors who come up with ideas that make it through to new drones. \"Every idea is read and considered, and those that inspire future products or features will be rewarded accordingly. Every contribution will be helpful in understanding what matters to users.\"\n\nThat's about all we know for the moment. Is the mini flyer set to duke it our for aerial supremacy with the likes of DJI? Maybe. But the immersive video chops are aimed at setting Antigravity's releases far apart from the other players, so a one-on-one dogfight may not be possible. We'll bring you all the details on the brand's first 360-degree cameradrone when it's ready for take-off.",
      "score": 1,
      "created_utc": 1753718578.0,
      "replies": []
    },
    {
      "id": "n5no7f8",
      "author": "Certain_Moose_2284",
      "body": "What 45 days now?",
      "score": 1,
      "created_utc": 1753728585.0,
      "replies": []
    },
    {
      "id": "n5on6je",
      "author": "BergaDev",
      "body": "So we’ve had DJI go drones to small sports cams, and now Insta360 go 360 to sports cams to drones \n\nHopefully doesn’t end as bad as GoPros attempt did",
      "score": 1,
      "created_utc": 1753738669.0,
      "replies": []
    },
    {
      "id": "n5r9f43",
      "author": "Shadow647",
      "body": "That name and logo is cyberpunk as fuck, and I love it.\n\nNot sure if I will love the actual product, but branding is on point.",
      "score": 1,
      "created_utc": 1753776136.0,
      "replies": []
    }
  ]
}