{
  "post": {
    "title": "Sony was working on the PS5 Pro before the PS5 even launched: \"We design everything with having 1 ahead in our mind\"",
    "author": "a_Ninja_b0y",
    "id": "1ghcjv5",
    "score": 2168,
    "created_utc": 1730486271.0,
    "selftext": "",
    "num_comments": 179,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ghcjv5/sony_was_working_on_the_ps5_pro_before_the_ps5/"
  },
  "comments": [
    {
      "id": "luwfb08",
      "author": "wicktus",
      "body": "When Nvidia release their new Blackwell gaming GPU next year they would have already developed extensively the architecture after it.\n\nThose things take a lot of time, errors, trials, tests, engineering samples etc\n\nIt's not different for Playstation. The PS6 is already in development for sure",
      "score": 293,
      "created_utc": 1730486917.0,
      "replies": [
        {
          "id": "luwtpkb",
          "author": "AuroraFinem",
          "body": "A lot of the stuff here is mostly design goals than actual design. Generally they’re waiting on the parts to either become cheap enough or become available at all. They design around unreleased expected processors and graphics cards, once those upgraded chips are actually either released or become cheap enough they have the design ready to go and just need to initiate orders for manufacturing.",
          "score": 40,
          "created_utc": 1730491476.0,
          "replies": []
        },
        {
          "id": "luz38xe",
          "author": "AGuyWhoBrokeBad",
          "body": "I hope they include a DisplayPort in the next gen.",
          "score": 7,
          "created_utc": 1730522843.0,
          "replies": [
            {
              "id": "luzn2ba",
              "author": "Eruannster",
              "body": "Unlikely. The Playstation is designed as a TV-first device. It will very likely have whatever the latest version of HDMI is, though.",
              "score": 17,
              "created_utc": 1730536120.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lv0gyby",
          "author": "PetyrDayne",
          "body": "PS6 has a nice ring to it.",
          "score": 2,
          "created_utc": 1730553490.0,
          "replies": []
        },
        {
          "id": "lv8a486",
          "author": "dekusyrup",
          "body": "Yeah it's called the product pipeline.  Sony probably has some first round sketches and market research of what the PS7 looks like too.  These things take a long time between research, design, prototyping, more design, testing, regulatory approvals, procurement, fabrication, marketing, shipment, and sale.\n\nEven apple iphones are mostly a copy and paste exercise would have like a 4 year development cycle.",
          "score": 2,
          "created_utc": 1730663055.0,
          "replies": []
        },
        {
          "id": "luz0xz1",
          "author": "blanketstatement",
          "body": ">The PS6 is already in development for sure\n\nYup. They've historically started on next gen two years into the current gen.",
          "score": 3,
          "created_utc": 1730521598.0,
          "replies": [
            {
              "id": "lv7uu2n",
              "author": "Avenger12PR",
              "body": "Sure it is already designed. They just waiting.",
              "score": 1,
              "created_utc": 1730658465.0,
              "replies": [
                {
                  "id": "lv8sef2",
                  "author": "blanketstatement",
                  "body": "* 2022-2024 - Core Hardware Development and Prototyping\n\n* 2024-2025 - Industrial Design and System Integration\n\n* 2025-2026 - Testing and Refinement\n\n* 2026-2027 - Manufacturing Preparation and Mass Production\n\n* Late 2027/Early 2028 - Launch?",
                  "score": 1,
                  "created_utc": 1730668629.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv14e5j",
          "author": "Resident-Ant-5504",
          "body": "There is probably already a working PS6 right now that is being playtested with real games. In some random Sony office somewhere.",
          "score": 1,
          "created_utc": 1730561826.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwdyyd",
      "author": "MCA2142",
      "body": "As does every other company.  \n\nYou don’t hear about Audi engineers being completely surprised at being told to make an S version of their cars, all of a sudden.  \n\nIt’s all designed with the upgrades in mind, every time.",
      "score": 1000,
      "created_utc": 1730486504.0,
      "replies": [
        {
          "id": "luwgkgw",
          "author": "131sean131",
          "body": "Fr it is almost like the market is mature and there is little external competition to the established providers. If there design team was not an iteration ahead then what have they been doing. Really \"games media\" will turn any comment into a nothing burger of a artical for click and up votes.",
          "score": 153,
          "created_utc": 1730487307.0,
          "replies": [
            {
              "id": "luwvtj5",
              "author": "JukePlz",
              "body": "Because they hire the cheapest writers, that probably don't even enjoy playing videogames, and tell them to make clickbait headlines to sub-500 words articles and to pump out as many as possible.\n\nIf you're lucky you get some barely related stock image inserted into it along their shitty auto-playing videos, massive advertisements and newsletter subscription banners.\n\nThey have zero inventive, make zero effort and don't even remotely put the time to make an interesting read. Gaming journalism is just regurgitated trash you could find in a better format from news aggregators, social media and youtubers.",
              "score": 39,
              "created_utc": 1730492152.0,
              "replies": [
                {
                  "id": "lux1zxd",
                  "author": "131sean131",
                  "body": "Is mostly AI slop now lol. \n\nBack in my day we had humans who where payed to lie to us at IGN, now they just have machines do it on twitter.",
                  "score": 20,
                  "created_utc": 1730494139.0,
                  "replies": [
                    {
                      "id": "lux7axd",
                      "author": "JukePlz",
                      "body": "I'm sure there's a lot of that too, but sites like Kotaku and IGN have been writing shit articles waaaaay before ChatGPT exploded in popularity. Don't think it's only AI to blame here.",
                      "score": 3,
                      "created_utc": 1730495872.0,
                      "replies": []
                    },
                    {
                      "id": "luzlihj",
                      "author": "locklochlackluck",
                      "body": "Prefer decent ai summaries of facts edited by someone passionate than whatever it was produced by gigging writers tbf. The content quality being so poor (and an element of writers feeling they're \"too good\" to be a games journalist) is what killed the games press.",
                      "score": 1,
                      "created_utc": 1730534977.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luz0ubd",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1730521545.0,
              "replies": [
                {
                  "id": "lv0e169",
                  "author": "None",
                  "body": "PC boxes are not even close to being 4k AAA capable for 500-800. No one's taking the losses to make such pipe dreams possible. I swear reddit and their \" I know better than a multimillion dollar business\" takes. And then you want game pass on a STEAM machine, when their whole point is selling HW at a loss to get people to buy games.",
                  "score": 1,
                  "created_utc": 1730552281.0,
                  "replies": [
                    {
                      "id": "lv2hr91",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 1,
                      "created_utc": 1730577602.0,
                      "replies": [
                        {
                          "id": "lvknqn1",
                          "author": "None",
                          "body": "And yet the next greatest APU scheduled to come out can barely play wukong at 60fps low 1080p. Some of you are so misinformed, ignorant and detached from reality.",
                          "score": 1,
                          "created_utc": 1730835049.0,
                          "replies": [
                            {
                              "id": "lvkrgx1",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 1,
                              "created_utc": 1730836146.0,
                              "replies": [
                                {
                                  "id": "lvt93im",
                                  "author": "None",
                                  "body": "Ok in 2026 a price comparable PS5 sized Steam box for 800 IS  plausible. And AMD have \"custom\" design history with Steam. We will see how big anti cheat using companies handle Linux.",
                                  "score": 1,
                                  "created_utc": 1730938383.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luwsbnl",
          "author": "TheSchlaf",
          "body": "Tick, tock, tick, tock",
          "score": 7,
          "created_utc": 1730491035.0,
          "replies": []
        },
        {
          "id": "luy2jwh",
          "author": "None",
          "body": "Yep. Toyota released the new 6th gen 4Runner this year? Guess what - they're already working on the 7th gen design and engineering.",
          "score": 3,
          "created_utc": 1730506977.0,
          "replies": []
        },
        {
          "id": "luxkvi3",
          "author": "CreaminFreeman",
          "body": "Go look at MINI’s newest.  \n  \nLooks like they forgot they were going to be asked to make an S.",
          "score": 2,
          "created_utc": 1730500571.0,
          "replies": []
        },
        {
          "id": "luxxbwx",
          "author": "-iamai-",
          "body": "yea shit version easy production design/costs first then something refined. With fore-thought built in. It's not anti-consumerism just simply let's see how this goes first.",
          "score": 1,
          "created_utc": 1730505055.0,
          "replies": []
        },
        {
          "id": "luysu24",
          "author": "BigCommieMachine",
          "body": "Typically the upgraded version is the original version before the business/accounting team gets their hands on it",
          "score": 1,
          "created_utc": 1730517674.0,
          "replies": []
        },
        {
          "id": "luzms80",
          "author": "Telesto1087",
          "body": "The versions are designed, prototyped and tested at the same time as the base models, they just have different release dates and production schedules. Sometimes they'll have a different prototype/test cycle if they come later in the life of the model or if the modifications are extensive enough to have a huge impact on production methods.",
          "score": 1,
          "created_utc": 1730535909.0,
          "replies": []
        },
        {
          "id": "lv0n6yw",
          "author": "ADHD_Supernova",
          "body": "I didn't realize the S versions were a timed release after the lower end models were available for a few months/years.",
          "score": 1,
          "created_utc": 1730555901.0,
          "replies": []
        },
        {
          "id": "luxmaqh",
          "author": "cbzoiav",
          "body": "At least Audi have several models / could pivot to a different one.\n\nFor Sony, the hardware teams will have their side finalised weeks if not months before launch. If they weren't already thinking on how to improve it what would they be doing?",
          "score": 1,
          "created_utc": 1730501087.0,
          "replies": []
        },
        {
          "id": "luxo9qq",
          "author": "m_bob01",
          "body": "I feel like it’s easier to dumb a car/product down once you know the best it can be rather than start out with something on the lower end and try to think of ways to improve it. IMO it’s what apple did with the iPhone 5c almost a decade back and what they do now with old chipsets to “refresh” older tech",
          "score": 0,
          "created_utc": 1730501802.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwe6up",
      "author": "klonkrieger43",
      "body": "who is suprised by this? Do you think the design and concept teams work fully on one product to the day it is launched? A concept team creates concept and when that is done they move on to the next. Even then having a lineup where you know you will get out an improved version later you'd be an idiot not to design them together.\n\n  \nHow is this news?",
      "score": 118,
      "created_utc": 1730486571.0,
      "replies": [
        {
          "id": "lv0pws7",
          "author": "coocookerfloo",
          "body": "I can't recall how candid they are in recent memory. They're not even trying to trick us anymore.",
          "score": 1,
          "created_utc": 1730556896.0,
          "replies": []
        },
        {
          "id": "lv3dplv",
          "author": "dat_oracle",
          "body": "PS5 after launch day meeting:\n\nJosh: guys guys... what about a PS5 pro?\n\nManager: glad we have you on board, Jeff.  I'll send the idea to HQ asap!  Now, let's continue to talk about the shit stain issue in the bathroom.",
          "score": 1,
          "created_utc": 1730588538.0,
          "replies": []
        },
        {
          "id": "luww0xn",
          "author": "Fredasa",
          "body": "What I'm mostly surprised by is the fact that even though consoles have been low- to mid-range PCs for the last two gens, it still makes sense to at least some people to refer to the process of cobbling a mid-range PC as \"working on the design.\"",
          "score": -29,
          "created_utc": 1730492218.0,
          "replies": [
            {
              "id": "lux16ch",
              "author": "YouLostTheGame",
              "body": "Yeah? Did they just pick up the PS5 case off of a shelf? Are they just buying the parts off Amazon and putting them together in their living rooms?\n\nDon't be so fucking stupid.",
              "score": 24,
              "created_utc": 1730493876.0,
              "replies": [
                {
                  "id": "lux9aky",
                  "author": "Fredasa",
                  "body": "Keep firmly in mind that right up until approximately the advent of the PS3, consoles were what a gamer had to buy if they wanted the absolute best gaming experience they could get.  In order to achieve this, console designers had to be innovative and push boundaries.\n\nToday's consoles are about 90% aligned with PC architecture.  Nobody is pretending anymore.  \"Working on the design\" in this context means very little more than sussing out with AMD what minor tweaks to implement for what is fundamentally yesteryear PC hardware—whereas it used to literally mean \"design\" in the exact sense that you, I and the casual reader understand the word.\n\nI'm not saying you have to be comfortable with this reality but it is what it is.  And the trajectory of this trend hasn't settled, either; don't be surprised if the PS6 ends up being a Steamdeck knockoff launched alongside Sony's own PC-compatible Gamepass knockoff.",
                  "score": -26,
                  "created_utc": 1730496534.0,
                  "replies": [
                    {
                      "id": "luxkmyw",
                      "author": "YouLostTheGame",
                      "body": "You are an absolute buffoon. Open up a PS5 and you're not going to find a GPU that you can just swap for a new one, are you? \n\nSure maybe some of the circuitry is similar to what you'd find in the components of a PC, but you cannot go out there any buy those components yourself. They're not working away on PC partpicker. \n\nAll of those components are custom. It's a zen 2 processor but it's one that's unique to the PS5. \n\nThose components need to be designed. They need to fit the form factor they're going for. They need to fit their cooling requirements. They need to be easy to manufacture at scale and at reasonable cost. That's what designers do, they work all that out. \n\nHave a fun thought for you - if so little 'design' goes into a PS5 or any modern console, presumably you'd be able to produce one very easily? You'd make a shit load of money.\n\nTake your cretinous thoughts elsewhere.",
                      "score": 22,
                      "created_utc": 1730500486.0,
                      "replies": []
                    },
                    {
                      "id": "luxn9x2",
                      "author": "None",
                      "body": "> Keep firmly in mind that right up until approximately the advent of the PS3, consoles were what a gamer had to buy if they wanted the absolute best gaming experience they could get.\n\nI've been playing games for 42 of my 45 years and that's simply not true. PCs have pretty much always been ahead of consoles. Where consoles shine is ease of use and setup, and price. And those basic advantages have basically never changed.\n\nAnd for the record I have built my own PCs AND owned game consoles starting with the Atari back then. And I love PCs and consoles, I'm not biased here.",
                      "score": 10,
                      "created_utc": 1730501445.0,
                      "replies": [
                        {
                          "id": "luxoaq1",
                          "author": "Fredasa",
                          "body": "> I've been playing games for 42 of my 45 years and that's simply not true. PCs have pretty much always been ahead of consoles.\n\nDon't misunderstand what I said.\n\nIf you wanted hardware that was theoretically the most capable, fine, you could probably get it with a PC.\n\nBut if you actually take a look at the top 50 games for any given year, until basically the end of the Xbox 360 era, 9 out of 10 times it was console exclusive.  And it's not as though it was \"on console but would have been way better on PC\", either.  As a quick and succinct example, when the Jak & Daxter series came out, there's absolutely zero way I would have expected a PC to be able to reproduce that kind of game.  It's 2001 and there's a game that runs at a rock solid 60fps and still looks as good as that.  No—PC had nothing to compare.  That's the phenomenon I'm referring to.",
                          "score": -7,
                          "created_utc": 1730501812.0,
                          "replies": [
                            {
                              "id": "luyhl2v",
                              "author": "None",
                              "body": "Oh sure, if you're talking about sales power, consoles have pretty much always been in the lead and yeah, the PS3 era is where that really ended. My biggest PC gaming time era was then, so I know how big a change it was.",
                              "score": 1,
                              "created_utc": 1730512872.0,
                              "replies": []
                            },
                            {
                              "id": "luxs6mg",
                              "author": "One_Minute_Reviews",
                              "body": "Im sorry you are being downvoted and called an idiot so aggressively by some toxic users here. Reading a thread like this makes me not ever want to visit places like r/gadgets if this is what counts as people having a discussion. Some of your points are valid, a cel processor was custom silicon, as was everything ps3 and prior. Sony even wanted to design their own gpu for the ps3 & had to turn to nvidia at the last minute. Nowadays its all light customization by comparison and people who say otherwise probably havent read up enough but for some reason have very strong opinions on your intellect and moral fibre. Shame on them for addressing you so rudely.",
                              "score": -8,
                              "created_utc": 1730503207.0,
                              "replies": [
                                {
                                  "id": "luxsxt6",
                                  "author": "Fredasa",
                                  "body": "Sony's hardware division adamantly wanted to make the PS3 as custom as they possibly could.  It's a rather infamous story.  Sony let them have at it, and unfortunately what they came up with was so hard to develop for that it took quite a long time for multiplatform (Xbox 360 & PS3) games to start reaching parity rather than simply being better on Xbox 360.  And in many cases (like Bethesda games and others of that type) that never actually happened, due to an unfortunate design choice regarding the PS3's RAM.\n\nI think the shell shock of that episode is what led to Sony finally deciding that simpler PC architecture would be the way forward.",
                                  "score": 3,
                                  "created_utc": 1730503479.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "luxlgsj",
                      "author": "TheNorthComesWithMe",
                      "body": "> Keep firmly in mind that right up until approximately the advent of the PS3, consoles were what a gamer had to buy if they wanted the absolute best gaming experience they could get.\n\nConsoles were competitive with PCs until around the PS**1**, not the PS3. Even then, it was more of a genre split with consoles having dedicated graphics processing to handle sprites while PCs had more CPU power and memory.",
                      "score": 4,
                      "created_utc": 1730500786.0,
                      "replies": [
                        {
                          "id": "luxnj2d",
                          "author": "Fredasa",
                          "body": "> Consoles were competitive with PCs until around the PS1, not the PS3.\n\nI said precisely what I meant.  The best games were almost entirely exclusive to consoles, _plus_ those consoles almost invariably provided the best gaming experience.  I'm not arguing pure theoretical power—I'm talking about the reality that single platforms retained an undeniable advantage for a good couple of generations.  It took the advent of the PS3 for most devs (in the West) to finally start paying attention to their multiplatform options.  A phenomenon which finally seems to be catching up to Japanese devs, 15+ years later.",
                          "score": -6,
                          "created_utc": 1730501537.0,
                          "replies": [
                            {
                              "id": "luxqxbh",
                              "author": "TheNorthComesWithMe",
                              "body": "Well that's *also* wrong.\n\nedit: blocking after replying is incredibly sad behavior",
                              "score": 8,
                              "created_utc": 1730502754.0,
                              "replies": [
                                {
                                  "id": "luxs4kg",
                                  "author": "Fredasa",
                                  "body": "Let's take a look at the last year before PS3 launched and see if the top-rated games are mostly console exclusive:\n\n---\n\n**Top 20 Games of 2006**  \nThe Legend of Zelda: Twilight Princess - GameCube, Wii (Platform Exclusive - Nintendo)  \nGears of War - Xbox 360 (Platform Exclusive - Xbox)  \nElder Scrolls IV: Oblivion - PC, Xbox 360 (Non-Exclusive)  \nFinal Fantasy XII - PlayStation 2 (Platform Exclusive - PlayStation)  \nOkami - PlayStation 2 (Platform Exclusive - PlayStation)  \nTom Clancy's Ghost Recon Advanced Warfighter - Xbox 360, PC (Non-Exclusive)  \nCompany of Heroes - PC (Platform Exclusive - PC)  \nGuitar Hero II - PlayStation 2 (Platform Exclusive - PlayStation)  \nDead Rising - Xbox 360 (Platform Exclusive - Xbox)  \nResistance: Fall of Man - PlayStation 3 (Platform Exclusive - PlayStation)  \nHalf-Life 2: Episode One - PC (Platform Exclusive - PC)  \nHitman: Blood Money - PC, Xbox 360, PS2, Xbox (Non-Exclusive)  \nNew Super Mario Bros. - Nintendo DS (Platform Exclusive - Nintendo)  \nTom Clancy's Rainbow Six: Vegas - Xbox 360, PS3, PC (Non-Exclusive)  \nViva Piñata - Xbox 360 (Platform Exclusive - Xbox)  \nMedieval II: Total War - PC (Platform Exclusive - PC)  \nTomb Raider: Legend - PC, PS2, Xbox, Xbox 360 (Non-Exclusive)  \nLocoRoco - PSP (Platform Exclusive - PlayStation)  \nUltimate Ghosts 'n Goblins - PSP (Platform Exclusive - PlayStation)  \nYakuza - PlayStation 2 (Platform Exclusive - PlayStation)\n\n🤔",
                                  "score": -1,
                                  "created_utc": 1730503185.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lux0hja",
              "author": "alexson8",
              "body": "I’m not sure the best way to put this into words but they are working on low to midrange computers of the future and there is lot of work and educated guesses that go into that. I can almost guarantee that low cost chrome books manufacturers aren’t in active talks with amd, while sony has a pretty good idea of there 5 year roadmap",
              "score": 4,
              "created_utc": 1730493654.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luwfdio",
      "author": "BluePeriod_",
      "body": "Yeah and nowhere in the process did those assholes decide to include Dolby Vision for 4K BD movies.",
      "score": 73,
      "created_utc": 1730486938.0,
      "replies": [
        {
          "id": "luwlfsr",
          "author": "acrobat2126",
          "body": "LMAO. Damn man...",
          "score": 12,
          "created_utc": 1730488849.0,
          "replies": [
            {
              "id": "luwmsi0",
              "author": "BluePeriod_",
              "body": "I mean, shame on me for not doing the research. But how was I supposed to know that the damn thing can’t even play a music CD? How the hell did we go from a PS3 that could do practically everything to a PS5 that just plays games. \n\nI mean, at least Xbox has this kind of license activation thing",
              "score": 19,
              "created_utc": 1730489279.0,
              "replies": [
                {
                  "id": "luxwnrh",
                  "author": "Kuli24",
                  "body": "Weird fact: The fat model ps3 can do blurays on a CRT.  The slim and super slim have been neutered so they can't.",
                  "score": 8,
                  "created_utc": 1730504812.0,
                  "replies": []
                },
                {
                  "id": "luxgnjk",
                  "author": "acrobat2126",
                  "body": "What do you mean it can't play a CD. Doesn't Sony own the patent? What you talking bout Willis?",
                  "score": 5,
                  "created_utc": 1730499065.0,
                  "replies": [
                    {
                      "id": "luxmpwb",
                      "author": "BluePeriod_",
                      "body": "The PS4 couldn't either. I guess they want to focus on Crackle+ or whatever their streaming service is.",
                      "score": 13,
                      "created_utc": 1730501243.0,
                      "replies": []
                    },
                    {
                      "id": "luy2ixy",
                      "author": "irregularjosh",
                      "body": "I think here it's because the drives only have a violet laser, which are incapable of reading CDs",
                      "score": 5,
                      "created_utc": 1730506967.0,
                      "replies": [
                        {
                          "id": "luyj7pi",
                          "author": "caleb39411",
                          "body": "Every Blu-Ray drive (consumer grade, at least) has a red laser, because they, and this is also true for the PS5, can play DVDs.",
                          "score": 10,
                          "created_utc": 1730513539.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lvhlhat",
                  "author": "None",
                  "body": "The Xbox only needs license for DTS:X, it works natively with Dolby Vision and Dolby Atmos if you have hardware that supports it.\n\nSource: I have a Series X and I play with Dolby Atmos and watch content either streamed or bluray with it working without paying anything extra.",
                  "score": 1,
                  "created_utc": 1730791412.0,
                  "replies": []
                },
                {
                  "id": "luydfxr",
                  "author": "PotatEXTomatEX",
                  "body": "Why would it read CDs tho? Only thing CDs and Blue Ray's have in common is the shape. Lol",
                  "score": -2,
                  "created_utc": 1730511205.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lv0rmc7",
          "author": "IT_techsupport",
          "body": "Money is expensive man!!!",
          "score": 2,
          "created_utc": 1730557507.0,
          "replies": []
        },
        {
          "id": "luwlte1",
          "author": "CatProgrammer",
          "body": "Because licensing costs.",
          "score": 5,
          "created_utc": 1730488969.0,
          "replies": [
            {
              "id": "luwoqev",
              "author": "_RADIANTSUN_",
              "body": "They are literally selling a marked up optical drive for it, least they can do is do the old \"build in the capability to unlock with license cost bearing accessory\" trick like the OG Xbox remote for playing DVDs, except attached to the drive.",
              "score": 17,
              "created_utc": 1730489903.0,
              "replies": [
                {
                  "id": "luwpgy4",
                  "author": "CatProgrammer",
                  "body": "But are there enough people who would actually buy the drive specifically because of that? Like, I'd love for them to support it too, but it's clearly not a priority for them.",
                  "score": 0,
                  "created_utc": 1730490135.0,
                  "replies": [
                    {
                      "id": "lux3jbw",
                      "author": "_RADIANTSUN_",
                      "body": "Why does it matter if a lot of people are buying the drive SPECIFICALLY because of that? It's a drive. They should make it a really good BD drive, PlayStation has always benefitted from being an exceptional value as a home entertainment center. It would be a really nice bonus if it played 4K DV, supported 7.1 surround including Atmos etc I mean that would def be a selling point for SOME people .",
                      "score": 5,
                      "created_utc": 1730494633.0,
                      "replies": []
                    },
                    {
                      "id": "luz8jiz",
                      "author": "regenerated-hymen",
                      "body": "Yes there is market for that, it's what helped the PS3 sell more units. How old are you 😭",
                      "score": 0,
                      "created_utc": 1730525947.0,
                      "replies": [
                        {
                          "id": "luz8vjh",
                          "author": "CatProgrammer",
                          "body": "There *was* a market for that when the PS3 came out. I already covered how the current market is different in r/gadgets/comments/1ghcjv5/sony_was_working_on_the_ps5_pro_before_the_ps5/luwp0hw/\n\nPlus a PS5 will still play 4K UHD discs just fine, it just won't use the Dolby Vision dynamic metadata layer. So you'll still get HDR but not as good as it could be. People who care specifically about DV support are likely to look into dedicated players too due to the issues many lower-end ones have with three-layer discs (PS5 included!).",
                          "score": 3,
                          "created_utc": 1730526155.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "luwmn30",
              "author": "BluePeriod_",
              "body": "Yeah, I’m sure Sony can’t afford it. It must be incredibly out of their grasp. It must be so incredibly unobtainable to them that it would completely shift the way the company operates.",
              "score": 7,
              "created_utc": 1730489232.0,
              "replies": [
                {
                  "id": "luwp0hw",
                  "author": "CatProgrammer",
                  "body": "No, it's because the cost of including it would not provide any significant benefit to Sony as unlike in the PS3 era with BD there are a lot of cheaper 4K players with DV support. Hell, Sony TVs didn't even have full DV support until 2021.",
                  "score": 2,
                  "created_utc": 1730489991.0,
                  "replies": [
                    {
                      "id": "luwt73g",
                      "author": "Pretendo27",
                      "body": "I wish we could have the option to pay for the license ourselves. Don’t they do that option for headsets on Xbox? I remember having a code to redeem atmos which was like $10 or something.",
                      "score": 8,
                      "created_utc": 1730491312.0,
                      "replies": [
                        {
                          "id": "luxkr1l",
                          "author": "sunkenrocks",
                          "body": "That's why the original Xbox sold the DVD remote seperate. \n\nSony kind of cheated on the PSP also where you had to download/enable some codecs",
                          "score": 8,
                          "created_utc": 1730500526.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "luwtehc",
                      "author": "joewHEElAr",
                      "body": "lol comparing shit from 18 years ago",
                      "score": 0,
                      "created_utc": 1730491378.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "luxrsrj",
                  "author": "Usernametaken1121",
                  "body": "Sony can't afford it? They literally own the patent for blue rays (aka licensing fees on every blue rays sold). They can certainly afford it. People need to get this narrative of Sony being a poor company only able to barely hang on by releasing hit after hit. That narrative is the furthest from reality. They just spent half a billion dollars on a complete flop of a game and still posted record profit.",
                  "score": -3,
                  "created_utc": 1730503068.0,
                  "replies": [
                    {
                      "id": "luy225p",
                      "author": "lucidludic",
                      "body": "Sony doesn’t own Dolby Vision (the clue is in the name). Also, the person you’re arguing with was clearly being sarcastic.",
                      "score": 4,
                      "created_utc": 1730506793.0,
                      "replies": [
                        {
                          "id": "luy5z0t",
                          "author": "Usernametaken1121",
                          "body": "You're sarcastic",
                          "score": 4,
                          "created_utc": 1730508260.0,
                          "replies": []
                        },
                        {
                          "id": "luz91uk",
                          "author": "CatProgrammer",
                          "body": "More facetious but I do think it's one of the reasons why Sony didn't include it, especially given their lateness in implementing Dolby Vision in their TVs and such. They wanted to push other enhanced HDR formats like HDR10+.",
                          "score": 1,
                          "created_utc": 1730526265.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "luykkfn",
          "author": "SeaBisquit_",
          "body": "Because they don't have a Dolby license",
          "score": 1,
          "created_utc": 1730514097.0,
          "replies": [
            {
              "id": "luzncwj",
              "author": "Semyonov",
              "body": "I mean neither did the Xbox, you had to buy the Xbox Dolby license in the store.",
              "score": 1,
              "created_utc": 1730536338.0,
              "replies": [
                {
                  "id": "lv1fmgm",
                  "author": "SeaBisquit_",
                  "body": "Bro Sony is not licensed to sell Dolby",
                  "score": 1,
                  "created_utc": 1730565513.0,
                  "replies": [
                    {
                      "id": "lv1gd8f",
                      "author": "Semyonov",
                      "body": "Oh I didn't realize that, that sucks.",
                      "score": 1,
                      "created_utc": 1730565753.0,
                      "replies": [
                        {
                          "id": "lv1q8ox",
                          "author": "SeaBisquit_",
                          "body": "It's unfortunate cuz Dolby vision would be cool. Sony uses their own HDR code for games but standard HDR for blurays",
                          "score": 1,
                          "created_utc": 1730568836.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "luwfugk",
      "author": "CMDR_omnicognate",
      "body": "This doesn't really seem all that surprising, chances are they've got a rough outline of what the PS7 will be and when it will launch too, maybe even beyond that",
      "score": 14,
      "created_utc": 1730487083.0,
      "replies": [
        {
          "id": "luwjzig",
          "author": "DaoFerret",
          "body": "I mean they’ve already shown us some the things on the roadmap for the PS 9: https://youtu.be/IyPQVsdCuRk",
          "score": 4,
          "created_utc": 1730488389.0,
          "replies": [
            {
              "id": "luywz7g",
              "author": "Oulixonder",
              "body": "My buddy Austin has the PS9. His family calls it schizophrenia but I think they’re just stuck in the past.",
              "score": 7,
              "created_utc": 1730519615.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luwlkjd",
      "author": "MooseBoys",
      "body": "That’s why it’s called a product pipeline. You don’t have your design and engineering teams go on vacation for a year while marketing and manufacturing finish things up.",
      "score": 19,
      "created_utc": 1730488890.0,
      "replies": []
    },
    {
      "id": "luwpn5p",
      "author": "FayezButts",
      "body": "Not too surprising. Now if only they had designed some good games to go with it",
      "score": 7,
      "created_utc": 1730490189.0,
      "replies": []
    },
    {
      "id": "luwmhtg",
      "author": "Snacks612",
      "body": "Well yeah you would hope so.",
      "score": 5,
      "created_utc": 1730489185.0,
      "replies": []
    },
    {
      "id": "luws8oi",
      "author": "spreadthaseed",
      "body": "The way most engineers and product managers work, is by designing the target end state and then businessing the hell out of it. \n\nWhat that means is you design the target and start to dissect customer segments, price points, go to market strategy etc. \n\nSo they designed the pro and then worked backwards",
      "score": 5,
      "created_utc": 1730491008.0,
      "replies": [
        {
          "id": "luy1kp0",
          "author": "Infamous_Process5558",
          "body": "Yeah that should be illegal. It's one thing to have a product be bulky to hardware limitations, and its another to do it for the sake of money. What a waste of resources.\nAlso, I don't believe the ps3 and ps2 had these pre done before launch. This generation is just a joke. It's all about money now. Innovation is no more.",
          "score": -5,
          "created_utc": 1730506615.0,
          "replies": [
            {
              "id": "luy3fib",
              "author": "AldermanAl",
              "body": "Lol it should be illegal at all. It should be encouraged. Responsible development cycles with a product that is ready to be launched.",
              "score": 2,
              "created_utc": 1730507308.0,
              "replies": [
                {
                  "id": "luyuzmh",
                  "author": "Infamous_Process5558",
                  "body": "So you're saying you want to be cheated?\n\nLook, I'm all for responsible development cycles but intentionally making the first iteration bigger then the previous when they can easily make it smaller is just scum.",
                  "score": -6,
                  "created_utc": 1730518680.0,
                  "replies": [
                    {
                      "id": "luzt1nb",
                      "author": "karakter222",
                      "body": "Do you mean physically bigger? \n\nThe PS4 drew 100-150 watts while the PS5 draws 160-200 watts, that alone is a significant reason why it needs to be bigger, heat dissipation is pretty important.",
                      "score": 2,
                      "created_utc": 1730540447.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "luydmgm",
              "author": "PotatEXTomatEX",
              "body": "Lmao",
              "score": 1,
              "created_utc": 1730511279.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lux0jcu",
      "author": "hawksdiesel",
      "body": "Cool, still wont buy it.",
      "score": 5,
      "created_utc": 1730493670.0,
      "replies": []
    },
    {
      "id": "luyr91n",
      "author": "None",
      "body": "I think the PS5 Pro was designed in advance to please scalpers with the idiotic decision to not include a drive.",
      "score": 3,
      "created_utc": 1730516959.0,
      "replies": []
    },
    {
      "id": "luwf1lw",
      "author": "meeeehhhh2",
      "body": "Wonder if they always had that price point or waited until Microsoft to shit the bed so they can jack the price up",
      "score": 20,
      "created_utc": 1730486834.0,
      "replies": [
        {
          "id": "luwlh9w",
          "author": "Dairunt",
          "body": "Maybe the writing was on the wall that selling at a loss is not viable anymore.",
          "score": 12,
          "created_utc": 1730488862.0,
          "replies": [
            {
              "id": "luwzqdy",
              "author": "Heliosvector",
              "body": "I know right? Sony and Microsoft must be struggling soooooo hard now in this economy of monthly subscription fees. Gone are the days of making money from disc sales only and people vying games secondhand that Microsoft and Sony would make no money on. Poor Sony and Microsoft :(",
              "score": 2,
              "created_utc": 1730493411.0,
              "replies": [
                {
                  "id": "lv2fzbm",
                  "author": "Dairunt",
                  "body": "I understood the sarcasm. I'm not saying they didn't ask for it, the fact that Sony is releasing a console at $700 with LESS features is more of a symptom of the way they do business rather than the harsh economies of video games.\n\nOne of the few things I like about the Series S is that, while it is mostly subscription-dependent, the competitive price and the price-to-performance is spot on. Sony is trying to be the new Apple by dividing their user base into people who look for value (the majority) and the ones that want the premium (the ones that spend the most). If they want to make more profit while user base is not growing is charging more to the people that will spend. I also think the price raise from $400 to $450 has something to do with it. \n\nOnce you make more and more predatory monetization schemes there will be a ceiling to how much you can pocket out of your user base, they've already raised the prices to $70, they've limited their working IPs, they slashed backwards compatibility for their first three consoles, they're doing remakes and remasters of games that run perfectly fine on new hardware (and charging a premium for it), they're making log ins with PlayStation accounts mandatory even for single-player games, they're shoving every game with DLCs and micro transactions, it was a matter of time they charge a premium for their Pro models. If this continues on I can bet the Base PS6 will have ads while installing games and you have to buy the PS6 Pro for $999 to get rid of any ads.\n\nThe only way they course-correct is by simply shutting down their influx of money. Don't give in to Pro models, don't buy DLCs that don't give games any value, don't preorder, cancel any subscription you don't use and spread your opinion on the internet if they go too far. It worked with the Xbox One.",
                  "score": 1,
                  "created_utc": 1730577027.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "luwlrjg",
          "author": "Abba_Fiskbullar",
          "body": "From what I understand the Pro was designed to be profitable at a $600 price point to compete with the cancelled Xbox Elite. The increase in BoM over the base PS5 is marginal, so I wouldn't be surprised by a price drop within a year.",
          "score": 4,
          "created_utc": 1730488952.0,
          "replies": []
        },
        {
          "id": "luypaw0",
          "author": "SomeBoxofSpoons",
          "body": "I have a feeling that they counted on component costs dropping more than they have, considering this generation has been an outlier in that regard. Even since the reveal though I can’t help but think that if the console they designed could only profitably be sold at $700, then maybe the console they designed just… isn’t the best idea?",
          "score": 1,
          "created_utc": 1730516100.0,
          "replies": []
        },
        {
          "id": "luwolux",
          "author": "Zomunieo",
          "body": "They probably just planned for Microsoft to shit the bed. It’s a safe bet.\n\n(Unless you’re betting against Azure or enterprise Windows. Then they’re eating your lunch.)",
          "score": -1,
          "created_utc": 1730489862.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwxv99",
      "author": "GiltCityUSA",
      "body": "Remind me not to buy the PS6 when it releases",
      "score": 3,
      "created_utc": 1730492810.0,
      "replies": []
    },
    {
      "id": "lux92l4",
      "author": "Dodel1976",
      "body": "This isn't new.",
      "score": 3,
      "created_utc": 1730496461.0,
      "replies": []
    },
    {
      "id": "luwpot2",
      "author": "Ruttagger",
      "body": "Yet they couldn't figure out how to make plates fit both models.",
      "score": 4,
      "created_utc": 1730490204.0,
      "replies": []
    },
    {
      "id": "luwz9uw",
      "author": "Heliosvector",
      "body": "Cool. So what are the expected specs of the ps6 then?",
      "score": 2,
      "created_utc": 1730493262.0,
      "replies": [
        {
          "id": "luy355b",
          "author": "AldermanAl",
          "body": "They know for sure. Well down the development path to be sure.",
          "score": 1,
          "created_utc": 1730507197.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxczm5",
      "author": "D_Winds",
      "body": "I assume that I had loftier ambitions during the planning phase, as the Pro seems more like a PS5.2",
      "score": 2,
      "created_utc": 1730497783.0,
      "replies": []
    },
    {
      "id": "luxpewb",
      "author": "N3M3S1S75",
      "body": "Should have been working on putting in a disc drive",
      "score": 2,
      "created_utc": 1730502212.0,
      "replies": []
    },
    {
      "id": "luxt228",
      "author": "Ctotheg",
      "body": "Do they think buyers think they design these things a few weeks before release? ",
      "score": 2,
      "created_utc": 1730503521.0,
      "replies": [
        {
          "id": "luy2s6a",
          "author": "AldermanAl",
          "body": "No. It's opposite. Group of buyers seriously believe that a company presses a button and a box starts popping out.",
          "score": 1,
          "created_utc": 1730507063.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luyb52a",
      "author": "ImAtLeast12",
      "body": "Holy shit, next thing your gonna tell me that Apple is working on the iPhone 17 right now",
      "score": 2,
      "created_utc": 1730510292.0,
      "replies": []
    },
    {
      "id": "luyblb4",
      "author": "jackofslayers",
      "body": "No shit",
      "score": 2,
      "created_utc": 1730510469.0,
      "replies": []
    },
    {
      "id": "lv08sl4",
      "author": "MrMunday",
      "body": "Definitely working on ps6 right now",
      "score": 2,
      "created_utc": 1730549882.0,
      "replies": [
        {
          "id": "lv0hbhk",
          "author": "motech",
          "body": "PS 6 pro ..",
          "score": 1,
          "created_utc": 1730553637.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv0hhag",
      "author": "da_apz",
      "body": "Only people surprised about this seems to be tech bloggers, who a month before next iPhone launch report that Apple is still deciding the specs and features.",
      "score": 2,
      "created_utc": 1730553700.0,
      "replies": []
    },
    {
      "id": "lv29vp8",
      "author": "ishsreddit",
      "body": "Usually its at least a 2 year tape up for the arch followed by everything else. 5 years is quite extensive actually. I dont think its the norm.\n\nThis is good though. Can mean quick and wide adoption of PS5 Pro additional capabilities.",
      "score": 2,
      "created_utc": 1730575038.0,
      "replies": []
    },
    {
      "id": "luweyum",
      "author": "prey169",
      "body": "Cool next time I'll wait for the ps6 pro to make my purchase",
      "score": 6,
      "created_utc": 1730486811.0,
      "replies": [
        {
          "id": "luwic9b",
          "author": "RedIndianRobin",
          "body": "Yup. Learnt my lesson with this generation. My base PS5 is now essentially a brick as I'm not buying games to play at 30 FPS. Will stick to my PC.",
          "score": -6,
          "created_utc": 1730487863.0,
          "replies": [
            {
              "id": "luwmkmo",
              "author": "prey169",
              "body": "Same. It's not like there's any exclusives anyways outside of timed exclusives and maybeeeee astro bot?",
              "score": 0,
              "created_utc": 1730489210.0,
              "replies": [
                {
                  "id": "luwn10o",
                  "author": "RedIndianRobin",
                  "body": "Yeah first party exclusives are lackluster. But we got two good ones coming next year with ghost of yotei and death standing 2.",
                  "score": -1,
                  "created_utc": 1730489354.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "luwqx0z",
              "author": "None",
              "body": "Almost got one but sat it out once they announced releasing Ratchet and Clank on the PC. Hopefully they do that for future versions.\n\nBetter gameplay on a PC then console any day. Nothing else Redeeming on the PS5 at that point except warmed over sports games and whatever anime schlock is dumped out there.\n\nHeyday of the PS platform was the PS1, so many multi player games like Twisted Metal. Now subscriptions/consoles/etc are required, and the games aren't all that if they do have multiplayer support. Try finding Couch Co-Op games. Rare as a fully polished game on release day, doesn't make anyone money via subscription traps and other scams",
              "score": 1,
              "created_utc": 1730490591.0,
              "replies": []
            }
          ]
        },
        {
          "id": "luxpun8",
          "author": "jyanjyanjyan",
          "body": "After they came out with the PS4 Pro, I knew the PS5 Pro was inevitable and decided to just wait for that instead, with the benefit of all the cheaper games too that have already been released. I wonder how much they benefit from having two versions within the same generation.",
          "score": 0,
          "created_utc": 1730502369.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lux8cw4",
      "author": "Gr0kthis",
      "body": "Stupidest title ever.",
      "score": 2,
      "created_utc": 1730496222.0,
      "replies": []
    },
    {
      "id": "luzb67v",
      "author": "Sasquatters",
      "body": "That’s the biggest half truth I’ve heard in a while. They designed the pro version first and then downgraded the hardware so they could release it at a higher cost years later.",
      "score": 2,
      "created_utc": 1730527653.0,
      "replies": [
        {
          "id": "lv08q08",
          "author": "None",
          "body": "[deleted]",
          "score": 0,
          "created_utc": 1730549847.0,
          "replies": [
            {
              "id": "lv0dics",
              "author": "Sasquatters",
              "body": "I never considered that. As a gamer, I hate DLC and would never buy into it.",
              "score": 0,
              "created_utc": 1730552056.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luwf1jr",
      "author": "None",
      "body": "Wow, groundbreaking! I can’t believe no one has ever thought of this approach before.",
      "score": 3,
      "created_utc": 1730486833.0,
      "replies": []
    },
    {
      "id": "luxcr7c",
      "author": "qpwoeor1235",
      "body": "Do any people think apple immediately works on the next iPhone only after the one before launches?",
      "score": 1,
      "created_utc": 1730497704.0,
      "replies": []
    },
    {
      "id": "luxy7bd",
      "author": "dramafan1",
      "body": "Reminds me of how Apple supposedly said they designed the 2022 MacBook Air first and then designed the MacBook Pro but the MacBook Pro 2021 was released first.",
      "score": 1,
      "created_utc": 1730505376.0,
      "replies": []
    },
    {
      "id": "luy59zy",
      "author": "Dr_Opadeuce",
      "body": "Planned obsolescence. Nice.",
      "score": 1,
      "created_utc": 1730507998.0,
      "replies": []
    },
    {
      "id": "luyieqd",
      "author": "mgnorthcott",
      "body": "Thick, thin… thick, thin… rinse repeat.   \n\nWhy can’t the first iteration be thin?   Ideally… that’s just common sense?",
      "score": 1,
      "created_utc": 1730513210.0,
      "replies": []
    },
    {
      "id": "luynsyg",
      "author": "InfoSuperHiway",
      "body": "Do you suppose they’ll ever have a feature to disable IPV6 in mind? It would be cool if it worked with google fiber. Either disable it or let PSN use it. Something.",
      "score": 1,
      "created_utc": 1730515453.0,
      "replies": []
    },
    {
      "id": "luyruxd",
      "author": "NeofelisNight",
      "body": "Dumbest title ever",
      "score": 1,
      "created_utc": 1730517230.0,
      "replies": []
    },
    {
      "id": "luyx6np",
      "author": "finalmattasy",
      "body": "Rainbows out da butt!",
      "score": 1,
      "created_utc": 1730519710.0,
      "replies": []
    },
    {
      "id": "luz0wt2",
      "author": "palming-my-butt",
      "body": "Like a carpenter that makes stairs",
      "score": 1,
      "created_utc": 1730521581.0,
      "replies": []
    },
    {
      "id": "luz6ebu",
      "author": "fusionsofwonder",
      "body": "It takes so long to bring these things to mass market they'd be negligent if they didn't.",
      "score": 1,
      "created_utc": 1730524634.0,
      "replies": []
    },
    {
      "id": "luz7is3",
      "author": "biznash",
      "body": "damn and they really went with that form factor on both?",
      "score": 1,
      "created_utc": 1730525312.0,
      "replies": []
    },
    {
      "id": "luzdf3q",
      "author": "CrotasScrota84",
      "body": "PS6 is already probably past concept phase",
      "score": 1,
      "created_utc": 1730529180.0,
      "replies": []
    },
    {
      "id": "luzkizx",
      "author": "abjedhowiz",
      "body": "Wtf. Did this need an article? So dumb",
      "score": 1,
      "created_utc": 1730534265.0,
      "replies": []
    },
    {
      "id": "luznbil",
      "author": "pandaSmore",
      "body": "Bastards. This is why I stick to PC.",
      "score": 1,
      "created_utc": 1730536309.0,
      "replies": []
    },
    {
      "id": "luzo688",
      "author": "gohan9689",
      "body": "This is a pointless statement but will make sony fanboys think only sony does this and they will say how great sony is.",
      "score": 1,
      "created_utc": 1730536934.0,
      "replies": []
    },
    {
      "id": "luzrl82",
      "author": "Chocolatepersonname",
      "body": "It’s good business practise",
      "score": 1,
      "created_utc": 1730539415.0,
      "replies": []
    },
    {
      "id": "luzwh7g",
      "author": "TheWest_Is_TheBest",
      "body": "This is dumb",
      "score": 1,
      "created_utc": 1730542772.0,
      "replies": []
    },
    {
      "id": "lv06tcz",
      "author": "None",
      "body": "They almost say it with pride….",
      "score": 1,
      "created_utc": 1730548892.0,
      "replies": []
    },
    {
      "id": "lv0byd2",
      "author": "thats_classick",
      "body": "Uhh oh, I see. So, the PS5 was the stable production model, while the PS5 Pro was in the developmental or prototype stage at one point. Got it. This isn’t exactly groundbreaking, Sony—everyone in the industry is doing the same. So, what’s the big takeaway here?",
      "score": 1,
      "created_utc": 1730551373.0,
      "replies": []
    },
    {
      "id": "lv0cife",
      "author": "GuiltyGhost",
      "body": "Did they think this was a flex?",
      "score": 1,
      "created_utc": 1730551622.0,
      "replies": []
    },
    {
      "id": "lv0d7g6",
      "author": "Blackdoomax",
      "body": "So they thought of a final version, then downgraded it after.",
      "score": 1,
      "created_utc": 1730551925.0,
      "replies": []
    },
    {
      "id": "lv0iu1v",
      "author": "cold_iron_76",
      "body": "Yes, this is how it works. Companies are always planning multiple versions and improvements ahead of time. Lol",
      "score": 1,
      "created_utc": 1730554240.0,
      "replies": []
    },
    {
      "id": "lv0v2g1",
      "author": "Mal-De-Terre",
      "body": "That's just basic product development strategy.",
      "score": 1,
      "created_utc": 1730558677.0,
      "replies": []
    },
    {
      "id": "lv15j1o",
      "author": "silentstorm2008",
      "body": "Not a gamer, but aren't console just computers with excellent graphics processing?",
      "score": 1,
      "created_utc": 1730562208.0,
      "replies": [
        {
          "id": "lvcuc0m",
          "author": "Intelligent_League_1",
          "body": "Any computer can have excellent graphics, but consoles are meant only to game and not for any other use",
          "score": 1,
          "created_utc": 1730732583.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lv41zni",
      "author": "thispersonexists",
      "body": "I just won’t buy the launch product and wait for a pro then",
      "score": 1,
      "created_utc": 1730597373.0,
      "replies": []
    },
    {
      "id": "lv4nz8b",
      "author": "steeze_d",
      "body": "put a web browser on it. then let us talk",
      "score": 1,
      "created_utc": 1730606271.0,
      "replies": []
    },
    {
      "id": "lv5mdke",
      "author": "onaropus",
      "body": "Most PC tech in development 3years before release",
      "score": 1,
      "created_utc": 1730627777.0,
      "replies": []
    },
    {
      "id": "lv87qkq",
      "author": "Portatort",
      "body": "I wanna play the new gta whenever that gets released. \n\nShould I buy a ps5 or ps5 pro?\n\nI currently have a ps4 and an Xbox that I got to play Starfield (very disappointed)\n\nI’d love to just own one console ahaon",
      "score": 1,
      "created_utc": 1730662326.0,
      "replies": []
    },
    {
      "id": "luwlbah",
      "author": "acrobat2126",
      "body": "LOL.. OK. Sure. I also have doubles of every classic car.",
      "score": 1,
      "created_utc": 1730488810.0,
      "replies": []
    },
    {
      "id": "lux1gt9",
      "author": "chrisagiddings",
      "body": "So they already have a PS6 ready?",
      "score": 1,
      "created_utc": 1730493969.0,
      "replies": [
        {
          "id": "luy3281",
          "author": "AldermanAl",
          "body": "Ready? Probably not. We'll into development. Absolutely.",
          "score": 1,
          "created_utc": 1730507167.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luy07yk",
      "author": "Shinagami091",
      "body": "It’s called a pipeline for a reason. I suspect Nintendo didn’t do this with the Switch though because it sure is taking them quite awhile to come out with the next iteration",
      "score": 1,
      "created_utc": 1730506117.0,
      "replies": []
    },
    {
      "id": "luyxqs7",
      "author": "LacusClyne",
      "body": "So they could've designed the faceplates to be intercompatible then...",
      "score": 1,
      "created_utc": 1730519979.0,
      "replies": []
    },
    {
      "id": "luwfbrf",
      "author": "None",
      "body": "[deleted]",
      "score": -4,
      "created_utc": 1730486923.0,
      "replies": [
        {
          "id": "luwh1po",
          "author": "geminijono",
          "body": "Can attest to dueling with bean counters in software and hardware development in exactly this manner. Sucks every time.",
          "score": 1,
          "created_utc": 1730487456.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luxrzqp",
      "author": "Oeno_56",
      "body": "Planned obsolescence. Should be illegal.",
      "score": 0,
      "created_utc": 1730503137.0,
      "replies": [
        {
          "id": "luy2xfd",
          "author": "AldermanAl",
          "body": "Wut? Running a for profit consumer electronics business requires making money.",
          "score": 2,
          "created_utc": 1730507118.0,
          "replies": [
            {
              "id": "luzh929",
              "author": "Oeno_56",
              "body": "By building an upgradeable platform, like PC:s have been doing since 1983, not by building entire new machines every year, which is death for the planet.",
              "score": 0,
              "created_utc": 1730531889.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "luwpuo5",
      "author": "shitballstew",
      "body": "Makes me want to buy stock in Sony",
      "score": -1,
      "created_utc": 1730490254.0,
      "replies": []
    },
    {
      "id": "luwfskp",
      "author": "pukem0n",
      "body": "They are constantly working on iterations of their consoles. What else would the engineers do between console releases?",
      "score": 0,
      "created_utc": 1730487068.0,
      "replies": []
    },
    {
      "id": "luwkeea",
      "author": "SeKiyuri",
      "body": "Common things, we knew all about iPhone 17 before 16 was released.",
      "score": 0,
      "created_utc": 1730488520.0,
      "replies": []
    },
    {
      "id": "luzs7ze",
      "author": "ButtonPusherDeedee",
      "body": "Sony laughing a PS5 pro pissed off my BF enough he’s finally getting a PC with me. Thanks Sony! I couldn’t have done it without you 😁",
      "score": 0,
      "created_utc": 1730539868.0,
      "replies": []
    },
    {
      "id": "lv28ha7",
      "author": "None",
      "body": "this is why their shit sucks though… way too much time and resources devoted to new hardware with nothing to run on the new hardware. and yes every company starts working on the next thing immediately but sony needs to consider how much new upgrades actually improve the experience. the ps5 is just fine doing every game (all 5 of them) and the upgrade isnt even worth selling the ps5",
      "score": 0,
      "created_utc": 1730574588.0,
      "replies": []
    },
    {
      "id": "luwffb7",
      "author": "anonssr",
      "body": "I remember years ago some random anon in 4chan telling he worked in Nvidia and they already had the technology and the roadmap for the next 3 gens. This was before the 20 series launched.\n\nOf course, grain of salt, 4chan being 4chan. But they rolled out the 30s, 40s, and 50s series rather quickly compared to previous gens.",
      "score": -2,
      "created_utc": 1730486953.0,
      "replies": [
        {
          "id": "luwy6x2",
          "author": "Nafferty",
          "body": "Nvidia has actually slowed down historically. A lot of the series in the mid 2000s were yearly. 10, 20, 30, and 40 series have all been 2 years apart. 50 series is taking even longer and isn’t even out yet. Not sure what you mean by the last line.",
          "score": 1,
          "created_utc": 1730492914.0,
          "replies": []
        }
      ]
    },
    {
      "id": "luwjavs",
      "author": "None",
      "body": "Should works on making nice exclusives games.",
      "score": -5,
      "created_utc": 1730488169.0,
      "replies": []
    }
  ]
}