{
  "post": {
    "title": "From June 20: EU gives smartphones a label and a guaranteed update time",
    "author": "diacewrb",
    "id": "1l36d2d",
    "score": 1358,
    "created_utc": 1749045733.0,
    "selftext": "",
    "num_comments": 169,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l36d2d/from_june_20_eu_gives_smartphones_a_label_and_a/"
  },
  "comments": [
    {
      "id": "mvyzkru",
      "author": "nikhilsath",
      "body": "Ohhh these guys a pushing it, no access without cookies is under investigation by the EU right now  ironic",
      "score": 275,
      "created_utc": 1749052572.0,
      "replies": [
        {
          "id": "mw0y9la",
          "author": "alexanderpas",
          "body": "There is a way to access without unneeded cookies... by subscribing.",
          "score": 24,
          "created_utc": 1749072637.0,
          "replies": [
            {
              "id": "mw15irs",
              "author": "sersoniko",
              "body": "Unfortunately this is somehow okay for the EU. Even tho a subscription may cost 20$/month while the value of me allowing a cookie can be around 10 cents for the entire year",
              "score": 14,
              "created_utc": 1749074864.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvyehx3",
      "author": "umataro",
      "body": "But when do we get swappable batteries again? That is the planned obsolescence in most phones. With a swappable battery, my phone would last me a decade. Also, lugging around chargers and power banks sucks compared to just popping a fresh battery in, like we used to.",
      "score": 318,
      "created_utc": 1749046551.0,
      "replies": [
        {
          "id": "mvygyu0",
          "author": "L444ki",
          "body": "2027 is the year EU starts requiring all phones to have user replaceable batteries.",
          "score": 254,
          "created_utc": 1749047273.0,
          "replies": [
            {
              "id": "mvykcxq",
              "author": "Enough-Meaning1514",
              "body": "\"User swappable\" doesn't mean toolless swaps. It means, the supplier also needs to sell the necessary tools to open and close the phones. Modern phones are a pain to open, even with heatguns. I don't think this bill will make any impact to Apple or Samsung.",
              "score": 152,
              "created_utc": 1749048257.0,
              "replies": [
                {
                  "id": "mvz4n8g",
                  "author": "Happy-go-lucky-37",
                  "body": "It’s a start.",
                  "score": 86,
                  "created_utc": 1749054016.0,
                  "replies": []
                },
                {
                  "id": "mw081la",
                  "author": "GrynaiTaip",
                  "body": "If it's a pain to open, then it will probably be deemed \"Not user-swappable\".",
                  "score": 20,
                  "created_utc": 1749065079.0,
                  "replies": []
                },
                {
                  "id": "mvyqlfn",
                  "author": "Sagybagy",
                  "body": "Not with keeping water resistance at least.  I do love that if I drop my phone in the pool it’s not just straight done for.",
                  "score": 53,
                  "created_utc": 1749050027.0,
                  "replies": [
                    {
                      "id": "mvzvj4f",
                      "author": "Mizz141",
                      "body": "Samsung Galaxy S5 would like to know your location",
                      "score": 10,
                      "created_utc": 1749061517.0,
                      "replies": [
                        {
                          "id": "mw1r7e9",
                          "author": "Lysergial",
                          "body": "I had a Samsung Galaxy S1 in a water fountain for 30 minutes and obviously thought it was gone. Dried up, worked fine, that is something!",
                          "score": 3,
                          "created_utc": 1749082040.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mvz5mxu",
                      "author": "BenadrylChunderHatch",
                      "body": "It really depends how old it is. No manufacturer warranty covers water damage, and the glue they use to seal the phone degrades over time.",
                      "score": 39,
                      "created_utc": 1749054300.0,
                      "replies": [
                        {
                          "id": "mvz7tx1",
                          "author": "tinglySensation",
                          "body": "There are some phones out there that can be opened with just a screwdriver and have their battery replaced without ruining the water seal. The one I know of is chonky AF but uses a gasket and even has a projector.\nTank 3 pro on Amazon, Jerry rig everything does a teardown on it",
                          "score": 26,
                          "created_utc": 1749054929.0,
                          "replies": [
                            {
                              "id": "mw0pqo3",
                              "author": "nagi603",
                              "body": "Yes, but woe unto you if you dare to suggest phones could be more than <insert current marketing metric> thick for repairability or battery life.",
                              "score": 17,
                              "created_utc": 1749070130.0,
                              "replies": [
                                {
                                  "id": "mw3xq9i",
                                  "author": "zolikk",
                                  "body": "Don't you just love phones that are so wide you can barely hold them in your hand, and so thin that they slip out easily and bend easily? Extremely friendly design... for the company, because they break more often.",
                                  "score": 5,
                                  "created_utc": 1749118039.0,
                                  "replies": [
                                    {
                                      "id": "mw6k66x",
                                      "author": "nagi603",
                                      "body": "I loved when I could securely hold and operate a phone with one hand... and use the other for e.g.: hanging on to dear life on public transport.",
                                      "score": 2,
                                      "created_utc": 1749148934.0,
                                      "replies": [
                                        {
                                          "id": "mwaqmjl",
                                          "author": "zolikk",
                                          "body": "Still using a galaxy S9 for this reason, almost everything new is unusable.",
                                          "score": 3,
                                          "created_utc": 1749209040.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "mw2ss44",
                          "author": "TooStrangeForWeird",
                          "body": ">Galaxy S4 Active: Water-resistant and dust-resistant with an IP67 rating. \n\nIt's called a rubber seal. It's not difficult.",
                          "score": 8,
                          "created_utc": 1749095795.0,
                          "replies": [
                            {
                              "id": "mw3orgp",
                              "author": "BenadrylChunderHatch",
                              "body": "The IP rating only tells you what the phone could withstand when it was tested at the factory. It will not necessarily withstand the same thing after owning it for a year. \n \nMaybe the waterproofing on an S4 Active lasts longer than on modern phones, but unless the manufacturer is willing to back up the waterproofing claims by honouring warranties for water damage then I wouldn't count on it.",
                              "score": 1,
                              "created_utc": 1749112767.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mvzm0ph",
                      "author": "RegretAggravating926",
                      "body": "Curious question, how often does this happen?\n\nI only lost 1 phone to water in my entire life, ironically a water “resistant” phone.\n\nHaven’t dropped a phone in the water before or after. Personally I would prefer a swappable battery  instead of water resistance if I had a choice.",
                      "score": 17,
                      "created_utc": 1749058850.0,
                      "replies": [
                        {
                          "id": "mvzsggs",
                          "author": "Cynical_Manatee",
                          "body": "I like the fact that I can just rinse my phone if I accidentally spill something on it and not worry at all .\n\nI don't think plunging it in a pool is a necessary requirement.\n\nTho end of the day, I just want reasonable battery replacement costs. I don't really care if I do it myself or not, but just charge me a fair price for the battery and the 20 minute labour cost of getting someone to replace it properly.",
                          "score": 17,
                          "created_utc": 1749060638.0,
                          "replies": [
                            {
                              "id": "mw0grno",
                              "author": "dabbax",
                              "body": "funny story. My wife has an iPhone which is stated as waterproof. Display broke, had it replaced at authorized Apple Service provider. Few months after my wife spills something on the phone and gives it a quick rinse, phone goes out and is dead. \n\nFound out that the technician back then when changing the display has forgotten to put the two bottom screws beside the charging port back in. Which is where water could enter. \n\nYou would not believe how long I had to discuss with Apple and the service provider until they agreed to fix their fuckup. „Water damage is not covered by warranty blahblah“\n\nThey agreed when I asked them „how high is the possibility of both bottom screws unscrewing themselves and falling out without anyone noticing?“ which they had to admit was nearly impossible.",
                              "score": 12,
                              "created_utc": 1749067598.0,
                              "replies": [
                                {
                                  "id": "mw2aoff",
                                  "author": "SpidermanAPV",
                                  "body": "I just had a very similar situation myself. I had the battery replaced and after that water got splashed on it at the pool. They said it was their fault and that the techs hadn’t fully sealed the phone down. Came back in a week to pick it up and they said I needed to pay $750. Said why when they told me it was free. They said that it was only free if I could prove their technicians caused the problem. Except they had already shipped my old phone out for refurbishment so it couldn’t be proved anymore. I would’ve fought harder, but I had medical work that needed doing and couldn’t go without my phone for another week.",
                                  "score": 3,
                                  "created_utc": 1749088873.0,
                                  "replies": [
                                    {
                                      "id": "mw2syf8",
                                      "author": "TooStrangeForWeird",
                                      "body": "Buy a cheaper phone in the meantime? Goddamn lol",
                                      "score": 1,
                                      "created_utc": 1749095870.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mw3rt20",
                              "author": "kurtgustavwilckens",
                              "body": "I plunged into a pool with my Gallaxy A53 twice and it survived just fine (I didn't swim around, it was inside less than a minute, but still! I was impressed)",
                              "score": 1,
                              "created_utc": 1749114618.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mw0pxiq",
                          "author": "nagi603",
                          "body": "> Curious question, how often does this happen?\n\nYou are probably a guy. Ask a woman about the insanity of women's pockets. And then think about a toilet.",
                          "score": 3,
                          "created_utc": 1749070184.0,
                          "replies": [
                            {
                              "id": "mw31twl",
                              "author": "CormoranNeoTropical",
                              "body": "I dropped a phone in the toilet once. Killed it dead.",
                              "score": 1,
                              "created_utc": 1749099923.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mw0ok4d",
                      "author": "nicman24",
                      "body": "It is called a fucking o ring. The water resistance is a joke.",
                      "score": 5,
                      "created_utc": 1749069797.0,
                      "replies": []
                    },
                    {
                      "id": "mw1pfgf",
                      "author": "thecanadiansniper1-2",
                      "body": "Samsung Galaxy S5 invalidates your arguments.",
                      "score": 2,
                      "created_utc": 1749081417.0,
                      "replies": []
                    },
                    {
                      "id": "mxiyk44",
                      "author": "F-21",
                      "body": "It's seriously not a big deal. You do not need to design the phone in the exact same way as they were 20 years ago. A phone can actually be designed so that everything except the battery is sealed and if it is dropped in water, the battery might get damaged or die but not any other component of the phone.",
                      "score": 2,
                      "created_utc": 1749800859.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw0zzwa",
                  "author": "TheTinRam",
                  "body": "And the next gen requires different tools.",
                  "score": 3,
                  "created_utc": 1749073169.0,
                  "replies": []
                },
                {
                  "id": "mw0xjxt",
                  "author": "Kyrond",
                  "body": "Batteries should be replaceable “with no tool, a tool or set of tools that is supplied with the product or spare part, or basic tools.” - [In the Annex](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/12797-Designing-mobile-phones-and-tablets-to-be-sustainable-ecodesign_en) \n\nEU isn't kind to malicious compliance, Apple can't just price battery replacement kit at 500$.",
                  "score": 7,
                  "created_utc": 1749072420.0,
                  "replies": [
                    {
                      "id": "mw1phnw",
                      "author": "swisstraeng",
                      "body": "I mean, I replaced my Iphone 8's battery with a 20$ ifixit battery kit and my hairdryer. It's far from impossible, but does require care and I agree not everyone can do it.",
                      "score": 3,
                      "created_utc": 1749081438.0,
                      "replies": [
                        {
                          "id": "mxj2i0j",
                          "author": "F-21",
                          "body": "Apple will not include a hairdryer with the phone though. I think that's the idea...",
                          "score": 1,
                          "created_utc": 1749803218.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mw3gqjl",
                      "author": "Enough-Meaning1514",
                      "body": "They don't have to. They will sell the kit/spare part and ask the user to heat the phone with a hairdryer. What will happen next is someone will apply too much force to pry it open and break the front or back glass. Apple/Samsung, these guys are clever enough to bend the regulations to the maximum effect.",
                      "score": -2,
                      "created_utc": 1749107932.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw0sc6w",
                  "author": "kamekaze1024",
                  "body": "I don’t really think that matters. Them being repairable in general is what people want. If you have to buy tools to do it, that’s fine. Even if it’s hard to do, making it more feasible is the end goal. Like most things, if you are unable to or feel uncomfortable fixing something, the pros will always be there for you anyway.",
                  "score": 1,
                  "created_utc": 1749070863.0,
                  "replies": []
                },
                {
                  "id": "mw1rtbr",
                  "author": "zushini",
                  "body": "Yes it will, if it’s too difficult to open the Apple or Samsung we can sue. And if they include a toolkit they’ll have to weigh up costs for how complicated it needs to be",
                  "score": 1,
                  "created_utc": 1749082254.0,
                  "replies": []
                },
                {
                  "id": "mw0ados",
                  "author": "None",
                  "body": "Most likely they make it easy because if it’s not it’s on them.",
                  "score": 1,
                  "created_utc": 1749065751.0,
                  "replies": []
                },
                {
                  "id": "mvz1tcp",
                  "author": "liquidphantom",
                  "body": "Apple is going to love that, they will develop something that will require a tool that costs $100.... speaking as an Apple user 🙈",
                  "score": -5,
                  "created_utc": 1749053213.0,
                  "replies": [
                    {
                      "id": "mvz392k",
                      "author": "Nolanthedolanducc",
                      "body": "No its 49$ rentals they already [offer this service](https://www.apple.com/newsroom/2022/04/apples-self-service-repair-now-available/)",
                      "score": 10,
                      "created_utc": 1749053624.0,
                      "replies": [
                        {
                          "id": "mw0sp7w",
                          "author": "nagi603",
                          "body": "[With how much in security deposit for tools if you want to do it yourself,](https://www.theverge.com/2022/5/21/23079058/apple-self-service-iphone-repair-kit-hands-on) like how you could with off-the-shelf tools for most other brands? Oh, $1200. And you have a week or two to do it.\n\n&nbsp;\n\nAlso, didn't they rescinded the $49 offer basically as soon as they could? Plus it was only valid if you have an official store nearby enough. Not everyone does. (At least no partner here offers it for that cheap, and there aren't any apple places in the country. So instead of $49 equivalent, try double or triple.)",
                          "score": 6,
                          "created_utc": 1749070969.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwao7so",
              "author": "deathhead_68",
              "body": "Good lord I hope the UK does it too. Fucking brexit",
              "score": 1,
              "created_utc": 1749207947.0,
              "replies": []
            },
            {
              "id": "mvyhfwz",
              "author": "Drew__Drop",
              "body": "Source?",
              "score": 0,
              "created_utc": 1749047410.0,
              "replies": [
                {
                  "id": "mvykkcn",
                  "author": "L444ki",
                  "body": "[https://repair.eu/news/making-batteries-removable-and-replaceable-a-closer-look-at-the-new-eu-guidelines/](https://repair.eu/news/making-batteries-removable-and-replaceable-a-closer-look-at-the-new-eu-guidelines/)",
                  "score": 11,
                  "created_utc": 1749048316.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvyibwd",
          "author": "lordraiden007",
          "body": "While you may be able to physically use a decade+ old device, I’d caution against doing so with smart phones. Security vulnerabilities are a serious threat, and most of the time phones don’t get feature or security support for that long.",
          "score": 16,
          "created_utc": 1749047671.0,
          "replies": [
            {
              "id": "mvzqddz",
              "author": "DanTheMan827",
              "body": "That’s why this requires at minimum the device be supported for 5 years once it stops being sold.\n\nIt’s still not going to get updates for 10 years, but it’s a start",
              "score": 11,
              "created_utc": 1749060046.0,
              "replies": []
            },
            {
              "id": "mvyllrj",
              "author": "umataro",
              "body": "I'm fortunate enough to have always had phones where lineageos (and before it, cyanogenmod) worked almost flawlessly once support had been dropped by the manufacturer.",
              "score": 6,
              "created_utc": 1749048610.0,
              "replies": [
                {
                  "id": "mvypxwg",
                  "author": "aretokas",
                  "body": "cyanogenmod is a name I haven't heard in years. HTC Desire user represent!",
                  "score": 12,
                  "created_utc": 1749049840.0,
                  "replies": [
                    {
                      "id": "mvza7z3",
                      "author": "Vexonar",
                      "body": "I miss my Gallaxy 3 with Cyanogen. Physically the hardware simply couldn't keep up but it was amazing and I had 3 batteries to swap at any time. The charger port crapped out within a year of purchase so....",
                      "score": 3,
                      "created_utc": 1749055598.0,
                      "replies": []
                    },
                    {
                      "id": "mvzqznt",
                      "author": "DanTheMan827",
                      "body": "I was unfortunate enough to have the CDMA version of that phone… 90MB of space for apps, and CyanogenMod didn’t improve that too much … I ended up making a custom build that changed the mount points for user data so they pointed to additional partitions on my MicroSD card.",
                      "score": 1,
                      "created_utc": 1749060221.0,
                      "replies": []
                    },
                    {
                      "id": "mvz81x9",
                      "author": "rlnrlnrln",
                      "body": "HTC Dream owner here!",
                      "score": 1,
                      "created_utc": 1749054992.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mvzb1wc",
                  "author": "Blergonos",
                  "body": "Currently using a 10 yr old phone with lineageos. Although now its really becoming a pain.",
                  "score": 2,
                  "created_utc": 1749055828.0,
                  "replies": [
                    {
                      "id": "mw0u0a3",
                      "author": "nagi603",
                      "body": "My type C port died before I the rest of the phone did. And there was literally no first party replacement, and third party ones were unconnected passive charging only with no data connections.\n\nMight have to try the next fairphone one of these days, provided it's popular enough for non-stock ROMs.",
                      "score": 1,
                      "created_utc": 1749071355.0,
                      "replies": [
                        {
                          "id": "mw3t42x",
                          "author": "Blergonos",
                          "body": "I'm telling you the main bane of old phones is the ports. I have lost 3 phones due to the damn micro-usb ports, and they were quite ok otherwise.",
                          "score": 2,
                          "created_utc": 1749115407.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvyunmk",
                  "author": "Yancy_Farnesworth",
                  "body": "LineageOS is not a replacement for official device support. Most LineageOS builds will not pass Google's Android automated tests (which tests security, stability, etc) that all officially supported builds must pass. It's better than no support, but it's not a silver bullet.",
                  "score": 6,
                  "created_utc": 1749051183.0,
                  "replies": [
                    {
                      "id": "mw0tgfw",
                      "author": "nagi603",
                      "body": "> LineageOS is not a replacement for official device support. \n\nIn fact, it WAS the official device support for some.\n\n> Most LineageOS builds will not pass Google's Android automated tests\n\nThat's mostly have to do with Google trying to go walled garden and lock you in. And valid only if by \"most\" you mean every random custom one-person ROM that you can google. In my experience since the start of Android, many official releases had far worse stability problems.",
                      "score": 2,
                      "created_utc": 1749071191.0,
                      "replies": [
                        {
                          "id": "mw22zgq",
                          "author": "Yancy_Farnesworth",
                          "body": "> In fact, it WAS the official device support for some.\n\nCitation on official support Lineage gets from SoC manufacturers for drivers for their SoC? Because absent that, it is quite literally not official support. It's community support using reverse engineered SoC drivers.\n\n> That's mostly have to do with Google trying to go walled garden and lock you in\n\nCitation? Every complex piece of software utilizes a suite of tests designed to catch, among other things, regression bugs and ensure things like past security fixes continue to work. That's what this suite of tests is for. To my knowledge this suite of tests deal with the OS itself, not the Google Play services which are the closed source components of Google's \"walled garden\".\n\nBut hey, don't take my word for it. A company called Fairphone documented their journey to extend support for their devices and documented their partnership with LineageOS to deliver official support for their devices as Qualcomm refused to allow them to use official drivers for their SoC. It was not trivial and one of the hardest parts was making sure their updates still passed those automated tests for quality.\n\nhttps://www.fairphone.com/en/2020/06/18/fairphone-2-gets-android-9/",
                          "score": 0,
                          "created_utc": 1749086184.0,
                          "replies": [
                            {
                              "id": "mw354wi",
                              "author": "nagi603",
                              "body": "> Citation on official support Lineage gets from SoC manufacturers for drivers for their SoC? Because absent that, it is quite literally not official support. It's community support using reverse engineered SoC drivers.\n\nCheck out the original, official ROM for the venerable Oneplus One. >!But I guess you are gonna say it's a totally different thing and does not count!<",
                              "score": 2,
                              "created_utc": 1749101581.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mvygpew",
          "author": "WelpSigh",
          "body": "It's not planned obsolescence, or at least not entirely. Swappable batteries come at the cost of water resistance.",
          "score": 4,
          "created_utc": 1749047196.0,
          "replies": [
            {
              "id": "mvyj5os",
              "author": "umataro",
              "body": "My old Galaxy S5 with ip67 rating says you don't know what you speak of. My wife's Galaxy XCover 6 has ip68 rating and batteries are just as easily swappable.",
              "score": 23,
              "created_utc": 1749047913.0,
              "replies": [
                {
                  "id": "mwdy5bw",
                  "author": "mailslot",
                  "body": "Those seals on the S5 were problematic to line up and the USB cover broke off easily. Then, the constant warning to check the seals even if they’re perfect were annoying. In practice, the water proofing didn’t even last long.\n\nThe back cover would also pop off with the slightest provocation, ejecting the battery across the room. I reinserted the battery multiple times but never had to replace it once.\n\nThe S5 is the worst example of waterproofing and a good justification for not doing what they did. The subsequent fully sealed S7 was fantastic, no replaceable battery, but the battery also can’t fly out of the phone or rattle.",
                  "score": 1,
                  "created_utc": 1749244985.0,
                  "replies": []
                },
                {
                  "id": "mvzps7c",
                  "author": "Shadow647",
                  "body": "XCover 6 Pro has a 4050 mAh battery. Significantly thinner A56 has a 5000 mAh battery.",
                  "score": -2,
                  "created_utc": 1749059882.0,
                  "replies": [
                    {
                      "id": "mvzvfl8",
                      "author": "umataro",
                      "body": "Spare battery is 25 euro and can be swapped in 10 seconds. In a56, if I want the phone to last me years, I have to enable \"maximum battery protection\", which caps the battery at 80% anyway.\n\nSamsung Xcover phones are also semi rugged and don't need a case.",
                      "score": 1,
                      "created_utc": 1749061489.0,
                      "replies": [
                        {
                          "id": "mw3sfw0",
                          "author": "Shadow647",
                          "body": "The point is that you sacrifice battery life by 20% every single day, to speed up by an hour a battery replacement that is needed once in 3-4 years (if it is a good battery).",
                          "score": 1,
                          "created_utc": 1749115001.0,
                          "replies": [
                            {
                              "id": "mw9tq6i",
                              "author": "KunashG",
                              "body": "And why does this happen, exactly? Because as far as I can tell the batteries are actually swappable, they're just hiding behind proprietary screws and a glue strip was used. I think that's fine, as long as they sell the battery by itself and change the screws. ",
                              "score": 1,
                              "created_utc": 1749190565.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvym0xs",
                  "author": "crasscrackbandit",
                  "body": "But they are both Samsungs…",
                  "score": -17,
                  "created_utc": 1749048729.0,
                  "replies": [
                    {
                      "id": "mvymhfu",
                      "author": "umataro",
                      "body": "Oh, no! That changes things entirely!",
                      "score": 18,
                      "created_utc": 1749048858.0,
                      "replies": []
                    },
                    {
                      "id": "mw0cvo6",
                      "author": "Alortania",
                      "body": "Don't worry, I'm sure Apple will catch up someday~",
                      "score": -1,
                      "created_utc": 1749066468.0,
                      "replies": [
                        {
                          "id": "mw0i3oa",
                          "author": "crasscrackbandit",
                          "body": "To what? Something that has absolutely no advantage or need whatsoever? \n\nIf you need to hot swap batteries on the regular, you have an addiction problem, not a battery problem.",
                          "score": -1,
                          "created_utc": 1749067982.0,
                          "replies": [
                            {
                              "id": "mw0iuxk",
                              "author": "Alortania",
                              "body": "I mean, Apple has a history of \"look what we added that's been out on (at least some) android phones for years!\" announcements... hardware as well as software. \n\nSo like I said, no worries, they'll likely (eventually) catch up and make an Irugged and everyone will lose their minds.\n\n\nSorry that Samung has options - I know those can be scary for you. \n\n\n> If you need to hot swap batteries on the regular, you have an addiction problem, not a battery problem.\n\nOoooor you're regularly somewhere that doesn't let you charge but does require phone use... not everyone is just gaming to kill their batteries.",
                              "score": 0,
                              "created_utc": 1749068198.0,
                              "replies": [
                                {
                                  "id": "mw0kc81",
                                  "author": "crasscrackbandit",
                                  "body": "I got an Android, just not a Samsung. There are other phone brands, you know. Samsung is the worst, for Android.\n\nI don't need a rugged phone, I just buy a rugged case. Easy-peasy.\n\nIt's not something to be caught up with, it's a niche obsession for some weird people who can't get along with the times. Like those folks who refused buying CDs and kept using cassettes.\n\n>Ooooor you're regularly somewhere that doesn't let you charge but does require phone use\n\nOK, give me 3 examples of what they can be.\n\nBesides, if you can carry extra batteries... you can carry power banks and other sources of power. We have vehicles, they provide power.",
                                  "score": 1,
                                  "created_utc": 1749068613.0,
                                  "replies": [
                                    {
                                      "id": "mw0li6z",
                                      "author": "Alortania",
                                      "body": "> If you can carry extra batteries... you can carry power banks.\n\nPower banks require down time; you need to plug your phone in, and keep it plugged in. There's also power lost through the transfer.\n\nBatteries make your phone go from (near) 0 to 100% instantly. \n\nIf you use your phone as part of your job, or hell just take lots of pics/vids/etc, having it attached to a brick and cable might make things less efficient, or annoyingly bulky, etc.\n\nAFAIK (haven't had ext batteries for a very long time now >_>) the batteries are also lighter than comparable powerbanks.",
                                      "score": -1,
                                      "created_utc": 1749068941.0,
                                      "replies": [
                                        {
                                          "id": "mw0mgo2",
                                          "author": "crasscrackbandit",
                                          "body": "You haven't given any examples where you need to be constantly on the phone yet have no access to electricity for extended periods. \n\nMany people use phones as part of their jobs. Professionals who need cameras use cameras, not phones, tho.",
                                          "score": 2,
                                          "created_utc": 1749069209.0,
                                          "replies": [
                                            {
                                              "id": "mw0nyze",
                                              "author": "Alortania",
                                              "body": "Actually, more and more people use phones vs cameras when the pictures aren't for photography. Phone cameras are more than sufficient nowadays, and the instant upload is a big bonus you don't find on lower-tier cameras (plus they're lighter, and it's less equipment you have to buy). \n\nI know many jobs that have you use your phones as scanners (so screen on, camera, +/- internet connection), either for retail jobs (vs giving you dedicated scanners, etc... and on those despite access you don't have time to stop and charge your phone mid-shift) or maintenance with bar/QR/etc codes keeping track of things or apps on said phones linking to said equipment in leu of dedicated diagnostics tools (most really just need a screen, bit of computing power and some security handshake thing, easy enough to add an app for and maybe a dedicated cable for older things expecting a certain plug).\n\nI haven't worked enough of those jobs to really tell you more, TBH, but I know enough to know they exist.",
                                              "score": 1,
                                              "created_utc": 1749069632.0,
                                              "replies": [
                                                {
                                                  "id": "mw3bewj",
                                                  "author": "crasscrackbandit",
                                                  "body": "“Ackchyually”\n\nYeah, you talk a lot crap.",
                                                  "score": 1,
                                                  "created_utc": 1749104920.0,
                                                  "replies": [
                                                    {
                                                      "id": "mw3cqnk",
                                                      "author": "Alortania",
                                                      "body": "You asked for examples, I give examples...\n\nWho's talking crap?",
                                                      "score": 1,
                                                      "created_utc": 1749105665.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvyj9my",
              "author": "ArdiMaster",
              "body": "The EU has just mandated that manufacturers must figure out how to do both by 2027.\n\nWorst case, this means the only phone you’ll be able to get by then will be ruggedized Galaxy-XCover-alikes.",
              "score": 7,
              "created_utc": 1749047944.0,
              "replies": [
                {
                  "id": "mvyrabd",
                  "author": "NorysStorys",
                  "body": "As much as I respect the points people make about user swappable batteries and essentially a return to a removable back case with a battery compartment but phones like that exist on the market and other types shouldn’t be banned, that’s something the market should more or less decide.\n\nHaving phones be reasonably user serviceable is something that should fundamentally be required as it is a complete ballache to get into most phones to swap a battery but something being reasonably user-serviceable doesn’t mean brain dead simple either. Most PCs and Laptops are user-serviceable and the vast majority of people still refuse to do it themselves.",
                  "score": 10,
                  "created_utc": 1749050227.0,
                  "replies": [
                    {
                      "id": "mvz09va",
                      "author": "applechuck",
                      "body": "A big difference is laptop and desktops are not water or dust resistant. The form factor of a phone, coupled with IPX ratings, makes it darn hard to have easily swappable internals.",
                      "score": 2,
                      "created_utc": 1749052769.0,
                      "replies": [
                        {
                          "id": "mw25sup",
                          "author": "m3galinux",
                          "body": "Samsung Galaxy S5 is proof otherwise. IP67 with a removable battery, made 11 years ago. Tell me you couldn't use the same basic design today but with modern components and I wont believe you.",
                          "score": 0,
                          "created_utc": 1749087175.0,
                          "replies": [
                            {
                              "id": "mw8woz4",
                              "author": "AmarDikli",
                              "body": "You certainly can, but most phones now are IP68 and even IP69 which can't be done with a detachable back. Also, s5 was thick and made of plastick.",
                              "score": 1,
                              "created_utc": 1749176194.0,
                              "replies": [
                                {
                                  "id": "mw92631",
                                  "author": "m3galinux",
                                  "body": "Galaxy S5 is 8.1mm thick. Galaxy S25 is 7.2mm. That's a 0.9mm difference.  I'd gladly trade a millimeter of thickness for a user replaceable battery.\n\nSamsung Xcover Pro 6 has a removeable battery back and is IP68. I'm sure it's not the only example. Point is, it can be done, and has.",
                                  "score": 1,
                                  "created_utc": 1749178241.0,
                                  "replies": [
                                    {
                                      "id": "mw92mv4",
                                      "author": "AmarDikli",
                                      "body": "I would love it as well but I don't see the general market going that route, it's more niche. Same reason why OnePlus decides to go high end mainstream pricing instead of the flagship they have been. It's not gonna sell as much as a regular phone.",
                                      "score": 1,
                                      "created_utc": 1749178419.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mxvatjw",
                      "author": "Perfect_Opinion7909",
                      "body": "If we let the market decide things we’d have children working in mines and factories again. Rather (un-)ironically that’s what happening in the USA right now.",
                      "score": 1,
                      "created_utc": 1749968813.0,
                      "replies": [
                        {
                          "id": "mxvha3f",
                          "author": "NorysStorys",
                          "body": "I’m not talking about letting the market decide everything",
                          "score": 1,
                          "created_utc": 1749972532.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mvyoc9h",
                  "author": "matteventu",
                  "body": "As another commentor above has said,\n\n>\"User swappable\" doesn't mean toolless swaps. It means, the supplier also needs to sell the necessary tools to open and close the phones. Modern phones are a pain to open, even with heatguns. I don't think this bill will make any impact to Apple or Samsung.",
                  "score": 10,
                  "created_utc": 1749049385.0,
                  "replies": [
                    {
                      "id": "mvypbcz",
                      "author": "ArdiMaster",
                      "body": "I’ll have to look up the letter of the law as it stands today but I recall it having a requirement of “swappable without uncommon tools”. If that’s still in there then Apple’s Pentalobe screws are probably out and even tiny Torx may not be permitted if the commission is in a bad mood.",
                      "score": 5,
                      "created_utc": 1749049662.0,
                      "replies": [
                        {
                          "id": "mvyr6sm",
                          "author": "matteventu",
                          "body": "You can find a set of torx screwdrivers in any supermarket or discount store for less than £10.\n\nNow let's not pretend that's not \"common\".",
                          "score": 14,
                          "created_utc": 1749050199.0,
                          "replies": [
                            {
                              "id": "mvyzsmb",
                              "author": "Muslim_Wookie",
                              "body": "\"Let's not pretend\" why do you have to be like that?",
                              "score": -13,
                              "created_utc": 1749052634.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mw0d85r",
                          "author": "Alortania",
                          "body": "I'm hoping it also includes the swap not be a risk to the phone (i.e. heat gun melting glue and you hoping pulling the screen doesn't crack it)...",
                          "score": 1,
                          "created_utc": 1749066568.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvypjm6",
              "author": "MrmarioRBLX",
              "body": "Sony Xperia ZR says hi.",
              "score": 7,
              "created_utc": 1749049727.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvyse2t",
          "author": "MrMikeJJ",
          "body": "I bought the Samsung Xcover series phone because it has a replaceable battery :)",
          "score": 3,
          "created_utc": 1749050541.0,
          "replies": [
            {
              "id": "mvz34w0",
              "author": "SaraAB87",
              "body": "This is what I did. Its literally the only removable battery phone on the market.",
              "score": 1,
              "created_utc": 1749053591.0,
              "replies": [
                {
                  "id": "mw01l5d",
                  "author": "paaaaatrick",
                  "body": "How many times will you need to replace your battery? I feel the market has spoken that people are okay paying $100 every 3 years to replace their batteries.",
                  "score": 1,
                  "created_utc": 1749063235.0,
                  "replies": [
                    {
                      "id": "mw0ovqk",
                      "author": "nicman24",
                      "body": "Shut",
                      "score": 1,
                      "created_utc": 1749069887.0,
                      "replies": []
                    },
                    {
                      "id": "mw02pdi",
                      "author": "SaraAB87",
                      "body": "Its just so convenient to have a spare battery on hand when your phone dies at 4pm so you don't have to plug it in, you can just swap and keep going.",
                      "score": 1,
                      "created_utc": 1749063552.0,
                      "replies": [
                        {
                          "id": "mw0drqb",
                          "author": "Alortania",
                          "body": "What are you doing that your phone dies at 4pm?\n\nI have days where I'm taking tons of pics or w/e but at that point, you can usually plan and grab a powerbank vs having to buy and keep batteries charged all the time.",
                          "score": 5,
                          "created_utc": 1749066723.0,
                          "replies": [
                            {
                              "id": "mw0hpbg",
                              "author": "SaraAB87",
                              "body": "Pokemon go",
                              "score": 1,
                              "created_utc": 1749067867.0,
                              "replies": []
                            },
                            {
                              "id": "mw1j2lg",
                              "author": "bigsquirrel",
                              "body": "Exactly people with these extreme use cases want to force their crap on everyone. I don’t want a thicker phone or one more prone to failure.  Even using Apple parts a new battery installed is cheap as chips.",
                              "score": 1,
                              "created_utc": 1749079260.0,
                              "replies": [
                                {
                                  "id": "mw1lqn2",
                                  "author": "Alortania",
                                  "body": "I mean... usually what happens is that there's options. Maybe not apple, but even they stopped doing the one-size-fits-all thing and made cheaper phones.",
                                  "score": 1,
                                  "created_utc": 1749080155.0,
                                  "replies": [
                                    {
                                      "id": "mw1rlui",
                                      "author": "bigsquirrel",
                                      "body": "I agree ultimately it’s the market that will decide.  Reddit always whines about these sorts of things but when manufacturers make these phones no one buys them. \n\nI think there is a serious monopoly issue but at this point it’s almost more on the parts manufacturers than the device manufacturers.  It’s rarely discussed but with so many parts coming out of so few companies it’s like manufacturers are just playing Jenga with what’s out there.  Cell phones are becoming like Taco Bell.  A huge menu but it’s all really the same ingredients.",
                                      "score": 3,
                                      "created_utc": 1749082181.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw2x9lx",
          "author": "Competitive-Cup-2615",
          "body": "We used to be a proper country",
          "score": 1,
          "created_utc": 1749097759.0,
          "replies": []
        },
        {
          "id": "mw8b593",
          "author": "Philip250",
          "body": "I got a Fairphone 5 last year, as a promo deal I got an extra free swappable battery and it has Android updates until at least 2030. They even give you the option to buy a screwdriver to enable you to replace any parts that do go wrong.\nP.S. it replaced a Nokia.",
          "score": 1,
          "created_utc": 1749168309.0,
          "replies": []
        },
        {
          "id": "mwe03ry",
          "author": "mailslot",
          "body": "Why not just add a battery case when the phone’s battery begins to degrade? It makes it a little thicker, but can add a considerable amount of extra power over even a new battery.\n\nYou don’t even need to shutdown or open the phone to swap.",
          "score": 1,
          "created_utc": 1749245628.0,
          "replies": []
        },
        {
          "id": "mvz330r",
          "author": "SaraAB87",
          "body": "The Samsung Galaxy Xcover has entered the chat",
          "score": 1,
          "created_utc": 1749053576.0,
          "replies": []
        },
        {
          "id": "mvzeefd",
          "author": "Luxuriosa_Vayne",
          "body": "and headphone jack",
          "score": 1,
          "created_utc": 1749056756.0,
          "replies": []
        },
        {
          "id": "mvz1o6g",
          "author": "zeelbeno",
          "body": "Yeah i used to go out with 10 extra batteries in my bag just in case.\n\nMuch better than needing a power bank.",
          "score": -1,
          "created_utc": 1749053172.0,
          "replies": [
            {
              "id": "mw00qkg",
              "author": "AuroraFinem",
              "body": "Honestly, for me personally I see that as a significant downgrade. The only reason I’d want swappable batteries is if mine degrades significantly and the law as written isn’t likely going to make many manufacturers give you the old on the fly swappable battery. It will be them providing the tools to do it officially rather than formed batteries in fully sealed/glued casings that need specialty training/equipment to replace.\n\nI don’t see anyone taking out a screwdriver or something to take the back off and replace a battery on the fly when you can just carry a single power bank and exchange your phone in your bag/purse a half dozen times on a full charge.",
              "score": 5,
              "created_utc": 1749062996.0,
              "replies": [
                {
                  "id": "mw08hcb",
                  "author": "zeelbeno",
                  "body": "Especially when a power bank can do 2-3 rechargers depending on capacity.\n\nDefinitely for the option of repalcing a degraded phone battery... but to call power banks a downgrade is an interesting take",
                  "score": 6,
                  "created_utc": 1749065204.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvze6tv",
          "author": "Akeddia",
          "body": "EU loves over regulating so I imagine this will happen soon",
          "score": -5,
          "created_utc": 1749056696.0,
          "replies": [
            {
              "id": "mw0e423",
              "author": "Alortania",
              "body": "Oh yes, [how dare they](https://m.media-amazon.com/images/I/61HIrUzX2nL.jpg)",
              "score": 1,
              "created_utc": 1749066820.0,
              "replies": [
                {
                  "id": "mw0eyap",
                  "author": "Akeddia",
                  "body": "Yeah just don’t buy it if you don’t like it.",
                  "score": -1,
                  "created_utc": 1749067062.0,
                  "replies": [
                    {
                      "id": "mw0gwed",
                      "author": "Alortania",
                      "body": "You don't buy what? A smart phone? \n\nThey were all equally messy, and created so much e-waste as well as confusion. \n\nYou know they also used the chargers and locking other brands from working (i.e. only apple watch worked with Apple at one point) with their phones as a way to stop you from swapping, yes? Even if a different brand came out with something better, because of the sunk cost. And that's not even counting when you had brands do different chargers for different things, so even if you stayed 'loyal' the cable changed often and the phone didn't charge with the same thing the tablet did, etc.\n\nSo what, you like a brand, but damnit, all your stuff is for the *older* version of it, so now you need all new chargers and stuff... and shit, your friend likes a different brand, so like, no, you *can't* just ask him to charge your phone when you forgot your cable... because damnit, you made the 'wrong choice' vs that particular event and gosh-darnit, you decided you didn't want the charge-all dongle that takes half your bag. \n\n\nApple *especially* would have never swapped to USB C without being forced to do so by the EU, and you know it, and we would still be stuck in the tangle of useless PitA wires everyone had from various old phones and other stuff because everything had its own 'solution'. \n\nIt's very naive to think companies would do something pro-consumer out of the goodness of their hearts.\n\nFood companies would *totally* give ingredient lists and calories if they didn't have to... and cigarette companies would *totally* add those fun black box warnings if they didn't have to... and cell companies would just create phones with options as to which charger it comes with, just so you have a 'choice'.",
                      "score": 0,
                      "created_utc": 1749067636.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mw1il36",
          "author": "bigsquirrel",
          "body": "Terrible idea. Not only are you making design sacrifices the government shouldn’t be regulating this sort of thing. \n\nI can get my battery replaced (after years of use) for less than 1/10 the price I paid for the phone. \n\nYou are like they guys screaming for smaller phones. If there was a market people would buy them.  People don’t buy them so don’t force it on us.",
          "score": -1,
          "created_utc": 1749079097.0,
          "replies": [
            {
              "id": "mxvb9rd",
              "author": "Perfect_Opinion7909",
              "body": "Of course should a government regulate things like that. If it doesn’t we’d have heroin as cold remedy and people huffing asbestos for funsies again. Or children working in in mines and factories … wait nevermind … that’s actually what’s happening in the USA right now.",
              "score": 0,
              "created_utc": 1749969068.0,
              "replies": [
                {
                  "id": "mxw29sc",
                  "author": "bigsquirrel",
                  "body": "Swappable batteries = heroin. \n\nYou can’t be serious.",
                  "score": 1,
                  "created_utc": 1749985028.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvylrcp",
          "author": "crasscrackbandit",
          "body": "You can get a battery replacement whenever you like. Does not affect obsolescence in any way. \n\nPhones have evolved a long way, swappable battery is not really necessary. Modern chargers are light, phones use a much limited variety of ports compared to olden days where we had 16 different charger ports. \n\n“Do you have a Nokia charger? No not *that* Nokia charger.”",
          "score": -11,
          "created_utc": 1749048654.0,
          "replies": [
            {
              "id": "mvynenu",
              "author": "HopingillWin",
              "body": "You're missing the point I think. It's not about having a charger if the battery either swells or no longer holds a charge for a reasonable time, then the charger doesn't help but a replacement battery would.",
              "score": 2,
              "created_utc": 1749049118.0,
              "replies": [
                {
                  "id": "mvyo58c",
                  "author": "crasscrackbandit",
                  "body": "And you can get the battery replaced? \n\nI still have my iPhone 6s, got the battery replaced once. It has been 10 years. Even got a security update last year.\n\nNever had an old phone with swappable battery that lasted 10 years. We used to replace them every few years. Phones have never been this sturdy and long lasting.",
                  "score": -5,
                  "created_utc": 1749049329.0,
                  "replies": [
                    {
                      "id": "mvyoik9",
                      "author": "HopingillWin",
                      "body": "Isn't that the whole point of the legislation?",
                      "score": 3,
                      "created_utc": 1749049436.0,
                      "replies": [
                        {
                          "id": "mvyrs5i",
                          "author": "crasscrackbandit",
                          "body": "Yup, not all manufacturers care about updates. Android phones have a tendency of dropping software support in a few years, they keep flagship models updated longer. \n\nSecurity updates and software updates are different concepts.\n\nLegislation seeks guarantees, which no manufacturer provides as of now.",
                          "score": 1,
                          "created_utc": 1749050368.0,
                          "replies": [
                            {
                              "id": "mvysn6k",
                              "author": "HopingillWin",
                              "body": "Yes, and I'm totally in agreement.",
                              "score": 2,
                              "created_utc": 1749050614.0,
                              "replies": [
                                {
                                  "id": "mvyvbau",
                                  "author": "crasscrackbandit",
                                  "body": "And we don't throw out a perfectly functioning phone when the battery dies, we get it replaced. Swappable and replaceable is not the same thing, i.e. does not affect obsolescence. \n\nI can in theory replace my car's battery, but I'm no expert and do not wish to void any warranties or mess anything up, so I get it replaced in a shop. They don't charge for replacing it when you buy the battery from the same shop. Works same for phones these days.",
                                  "score": 1,
                                  "created_utc": 1749051369.0,
                                  "replies": [
                                    {
                                      "id": "mvz4z69",
                                      "author": "HopingillWin",
                                      "body": "That's not a good example because replacing car batteries is perfectly normal and common place in constrast to phones where is *was* common place, and is now rare today.",
                                      "score": 2,
                                      "created_utc": 1749054111.0,
                                      "replies": [
                                        {
                                          "id": "mvzbmpt",
                                          "author": "crasscrackbandit",
                                          "body": "No it's not rare.\n\nPhone battery replacement is the most common phone repair/service in the world, closely followed by screen replacement. Every manufacturer offers battery replacement services, it's literally legally enforced, lol. I know in US nothing is enforced with regards to consumer protection but since these brands also sell their devices elsewhere, they have to comply.",
                                          "score": 2,
                                          "created_utc": 1749055987.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mvz4l71",
              "author": "SaraAB87",
              "body": "Talk to me when the battery swells, cracks the back one day and there are no usable replacement batteries left on the market. Also in the USA, we don't really have battery repair places around. If you want your battery replaced in a non-apple device, its probably about $100-200 to do that at a shop and most shops won't do that. You will also probably have to leave the phone at the shop for a week or 2 while they get to it.\n\nAnd they put in a crappy 3rd party battery that they source from amazon, not the OEM stuff, that will die in a month or 2, start a house fire, or swell up in a month or 2.\n\nMy phones start losing battery life after a year or 2. Some phones swell up within a few months of use, I've seen it happen. So I am creating a lot of e-waste when I could just be swapping the battery.\n\nNote that I bought the only swappable battery phone on the market, the Samsung Galaxy Xcover, so that I am not creating e-waste every 1-2 years when my battery starts lasting 2 hours at a time and becomes unusable.\n\nA portable charger doesn't help when your battery drops like a rocket, because when you connect the charger the phone heats up like crazy when charging and becomes impossible to use slow and laggy, its best to be able to swap to a fresh battery.",
              "score": 1,
              "created_utc": 1749054001.0,
              "replies": [
                {
                  "id": "mvzav1r",
                  "author": "crasscrackbandit",
                  "body": ">there are no usable replacement batteries left on the market.\n\nAnd what guarantees swappable batteries staying on the market indefinitely?\n\n>Some phones swell up within a few months of use, I've seen it happen. \n\nThat's within warranty period. You take it back to where you got it? Swappable or replaceable, it's the same lithium-ion battery so they carry similar amount of risk. Swappable battery malfunction can damage a mobile device just the same.\n\nPhone battery replacement is extremely common. It takes minutes if they have the battery in stock. \n\n>So I am creating a lot of e-waste when I could just be swapping the battery.\n\nIf your swappable battery is damaged that still goes to waste?\n\nIf you are throwing phones out due to battery issues that's on you, not on the phone. I am 40 and I have never done that, ever. We just get a new battery. \n\nEvery phone manufacturer performs battery replacement. Some do it online even, like you mail it in and get it back same way.\n\nI'm sorry but you are talking absolute nonsense. And basically describing your personal inability to perform basic tasks such as getting a device serviced.\n\nApple charges 49-99 dollars to replace a battery, Android devices cannot be 100-200 dollars. Swappable batteries are not handed out free of charge, are they? \n\n>because when you connect the charger the phone heats up like crazy when charging and becomes impossible to use slow and laggy\n\nWhat sort of phone is that? Never experienced it lol, besides we got fast charging these days, 10-20 mins and you are done for a while. You can survive without using your phone for 10-30 minutes in a day, maybe more. I think you have a problem. Not the charging or phone. \n\nWe got charging in cars, we got wireless chargers for desks. If I got my laptop with me I can plug it in there.  ",
                  "score": 2,
                  "created_utc": 1749055775.0,
                  "replies": []
                },
                {
                  "id": "mw0elqq",
                  "author": "Alortania",
                  "body": "> Also in the USA, we don't really have battery repair places around. \n\nI've gone to official and unofficial ones in California within the last 5 years to get my dad's phone swapped, as well as my old phone before giving it to my gran.\n\n> If you want your battery replaced in a non-apple device, its probably about $100-200 to do that at a shop and most shops won't do that.\n\nMost of the shops I went to did it (ironically, the official ifixit wouldn't because dad's battery was swollen. Indi? No prob). $75 - though that was years ago...",
                  "score": 1,
                  "created_utc": 1749066961.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mvzup0o",
          "author": "Gloriathewitch",
          "body": "this isn't going to happen without compromising ip ratings just so you know there is a tradeoff",
          "score": -4,
          "created_utc": 1749061278.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvzpsir",
      "author": "DanTheMan827",
      "body": "5 years of guaranteed software updates after the phone stops being sold would be huge for Android users.  7 years of spare parts and non-discriminatory access to repair software would be huge for everyone\n\nI think it should be 10 years all around though…",
      "score": 46,
      "created_utc": 1749059884.0,
      "replies": [
        {
          "id": "mw090h4",
          "author": "idontwanttofthisup",
          "body": "Pushing items for 10 years begs for a replacement. I know because I was pushing electronics for longer. 7 years is alright. By that time the market is full of second hand spare parts.",
          "score": 11,
          "created_utc": 1749065358.0,
          "replies": [
            {
              "id": "mw0qvge",
              "author": "DanTheMan827",
              "body": "10 years for software at least.\n\nA computer from 2015 is still more than usable for most people.\n\nAn iPhone 6s would probably still be fine for what most people use it for, but it has long since lost OS support.\n\nWould I say make all the replacement parts available? No, but at minimum, battery and screen given they can’t be harvested from other iPhones\n\nAfter the manufacturer has dropped OS support, they should also be required to provide the ability to reflash a device with something else.  This should apply to _everything_ capable of being updated.",
              "score": 6,
              "created_utc": 1749070448.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mw1jhqw",
          "author": "bigsquirrel",
          "body": "This I get behind for sure. The battery stuff is nonsense but I think it’s criminal to abandon support for devices so soon after they launch them. \n\nI had an LG back in the day I got burnt on like this.",
          "score": 2,
          "created_utc": 1749079400.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvyykf5",
      "author": "Pupperoni__Pizza",
      "body": "Coming from a country with strong consumer protections (Australia), I like seeing the EU take the lead with consumer-centric rules. However, I do worry that they may be starting to overreach with lawmakers mandating things that may not be feasible. \n\nIn this example, if a user replaces their own battery and does not reassemble the device in a way that creates a sufficient seal against water ingress (which is highly likely given the demand to not require specialist tools, and knowing the average person) then we will inevitably see a large number of devices being damaged by simple water exposure that would have otherwise been no risk. Apart from the fact that this may lead to unnecessary e-waste, I wonder how the EU will rule where liability of the water damage lies in such a circumstance. A sensible approach would suggest it’s on the consumer who performed the faulty reassembly (and I say this as an extremely pro-consumer person) but, judging by the EU’s actions thus far, I daresay they’ll be pinning it on the manufacturers which is rather stupid and demonstrates a lack of understanding of how things work. \n\nMany modern devices more closely resemble a mechanical watch than a combustion car. Intricate and delicate parts are inextricably linked to the function of the device, and come with cons. Curiously, we don’t see the EU mandating the same protections for said automatic watch mechanisms (or similar devices), though.",
      "score": 33,
      "created_utc": 1749052288.0,
      "replies": [
        {
          "id": "mw0ycof",
          "author": "Kyrond",
          "body": "Any water resistance is only valid for a limited time, over time the rubber becomes brittle and doesn't actually seal perfectly. Also reason why no manufacturer gives any warranty on water damage. \n\nIP68 is already \"it will help it survive a drop in the pool\", not \"go swimming with it after 5 years\".",
          "score": 9,
          "created_utc": 1749072664.0,
          "replies": []
        },
        {
          "id": "mvz47ei",
          "author": "Cool_Being_7590",
          "body": "Phones, tablets the screens of laptops are currently either glued or welded shut and phones being made of glass making a vast amount of repairs impossible to users without destroying the screen.\n\nThese design elements are supposed to help the devices be thinner etc. however anyone who has ever opened a phone knows it's bs.\n\nMany things can compromise the waterproofing on devices, including drying too vigorously, salt water, general use etc.\n\nConsidering the plateau in regard to design progress, maintaining waterproofing while providing replaceable batteries is a welcome refresh to an otherwise stagnant design.",
          "score": 12,
          "created_utc": 1749053892.0,
          "replies": [
            {
              "id": "mvzace6",
              "author": "510Goodhands",
              "body": "The folks that I fixit.com would disagree with you.",
              "score": -6,
              "created_utc": 1749055632.0,
              "replies": [
                {
                  "id": "mvzi32r",
                  "author": "Cool_Being_7590",
                  "body": ">making a vast amount of repairs impossible to users without destroying the screen.\n\nI guess you missed when I specified users repairing parts themselves. Paying someone else to fix your device is not the same as doing it yourself. Getting a broken screen fixed nowadays is more than €300 while doing it yourself is about €80.\n\nAnd please do ask Ifixit, they will tell you devices like a lot of Surface Pros and Samsung tablets are designed to be disposable instead of repairable.",
                  "score": 3,
                  "created_utc": 1749057773.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mw00iw8",
          "author": "darkmacgf",
          "body": "The Galaxy S5 managed it a decade ago.",
          "score": 2,
          "created_utc": 1749062936.0,
          "replies": []
        },
        {
          "id": "mw16o25",
          "author": "kat1795",
          "body": "\"Strong consumer protection \" got me laughing 😂, I am also from Australia and there's no outstanding consumer protection, if that is not worse than majority of the countries around the world.\n\nLike if there are downgrades happening to iphones, Australia is the first in the line to happen cause nobody complains ever here.",
          "score": -1,
          "created_utc": 1749075224.0,
          "replies": []
        },
        {
          "id": "mw3aq7b",
          "author": "elderlybrain",
          "body": "The eu is made of multiple member states that endlessly debate for years before anything gets passed.\n\nSaying consumer protection standards are over reach is unwarranted fear, honestly.\n\nIf you look at the guidelines, it's pretty clear that it's a win for right to own.",
          "score": -2,
          "created_utc": 1749104542.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mw1c0d1",
      "author": "None",
      "body": "[removed]",
      "score": 5,
      "created_utc": 1749076959.0,
      "replies": [
        {
          "id": "mw3lco0",
          "author": "Blonde_rake",
          "body": "\t\nThat is addressed in the law \n\n“In order to ensure that devices are able to be effectively repaired, the price of spare parts should be reasonable and should not discourage repair. To create transparency and incentivise the setting of reasonable prices, the indicative pre-tax price for spare parts provided pursuant to this Regulation should be accessible on a free access website.”",
          "score": 8,
          "created_utc": 1749110686.0,
          "replies": [
            {
              "id": "mw3paia",
              "author": "None",
              "body": "[removed]",
              "score": 0,
              "created_utc": 1749113094.0,
              "replies": [
                {
                  "id": "mwpnobc",
                  "author": "Immudzen",
                  "body": "To be fair the EU normally does suggestions first and if there is abuse then they start nailing down details. It is in companies best interests if they play nice with the spirit of the law.",
                  "score": 1,
                  "created_utc": 1749413089.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n3jk18q",
      "author": "weaponsied_autism",
      "body": "Full legislation is here. \n\nPop quiz:\n\nHow does the Motorola Razr 60 have a rating of D for the drop test, when the Z-Flip 7 had a drop rating of A, even though they have frames and screens made by Samsung...\n\nmethinks Samsung are manipulating their tests.",
      "score": 1,
      "created_utc": 1752710920.0,
      "replies": []
    },
    {
      "id": "mvysg35",
      "author": "Tikkinger",
      "body": "Tbf 10 years would be too long. Samsungs 7 is a sweetspot",
      "score": -1,
      "created_utc": 1749050557.0,
      "replies": [
        {
          "id": "mvzr1hu",
          "author": "kopperman",
          "body": "Why though? Windows can do?",
          "score": 3,
          "created_utc": 1749060236.0,
          "replies": [
            {
              "id": "mvzrb43",
              "author": "Tikkinger",
              "body": "Smartphones are not PC's",
              "score": 9,
              "created_utc": 1749060312.0,
              "replies": [
                {
                  "id": "mw00plx",
                  "author": "darkmacgf",
                  "body": "Smartphones change a lot less than they used to.",
                  "score": 7,
                  "created_utc": 1749062989.0,
                  "replies": [
                    {
                      "id": "mw064q8",
                      "author": "Tikkinger",
                      "body": "Ah yes, that's why every android version that comes out needs more than a year testing of the manufacturer himself that should know exactly what hardware he uses.",
                      "score": 0,
                      "created_utc": 1749064535.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mw3ac68",
                  "author": "benanderson89",
                  "body": ">Smartphones are not PC's\n\nThey are. It's just very small so it fits in your pocket.",
                  "score": 3,
                  "created_utc": 1749104328.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mw14p3c",
              "author": "MathematicXBL",
              "body": "No laptop I've ever had could do anything more than surface the web or open Microsoft office after being 5 years old u less you buy the top of the line. If you buy the mid-tier or low-tier you're already using years old tech. I could see these bills causing the budget electronics to disappear giving consumers the only option of buying the premium tier.",
              "score": -2,
              "created_utc": 1749074607.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mw2jdat",
      "author": "eX_Ray",
      "body": "Does this include already released products (which are still being sold)?",
      "score": 1,
      "created_utc": 1749092027.0,
      "replies": [
        {
          "id": "mw4k4px",
          "author": "Tomi97_origin",
          "body": "No, it only applies for models put on the market after the date.",
          "score": 2,
          "created_utc": 1749127747.0,
          "replies": []
        },
        {
          "id": "mwpnusn",
          "author": "Immudzen",
          "body": "This is why I am going to wait until some new phones come out. I need to replace my current phone but if I wait a bit longer then I will get MUCH better software support and battery replacement.",
          "score": 1,
          "created_utc": 1749413145.0,
          "replies": []
        },
        {
          "id": "mw3182z",
          "author": "yp261",
          "body": "that’s a very stupid question",
          "score": -1,
          "created_utc": 1749099627.0,
          "replies": [
            {
              "id": "mw3pjjx",
              "author": "eX_Ray",
              "body": "I'm not sure how asking if this counts retroactively for phones currently being sold is stupid?",
              "score": 4,
              "created_utc": 1749113245.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mvzkj30",
      "author": "DonutConfident7733",
      "body": "What if manufacturers will just stop selling in Europe the more affordable models, blaming the decision on too much hassle for too little profit and just increase price of flagship phones? That would force consumers to import the cheaper phones from other countries and even settle for no warranty at all, if it is region locked.",
      "score": -10,
      "created_utc": 1749058440.0,
      "replies": [
        {
          "id": "mvzl0oc",
          "author": "horticulturistSquash",
          "body": "thats a solid 30% of worldwide sales if not more\n\nno way in hell its gonna be worth it to stop selling just to save pennies on avoiding pushing updates",
          "score": 20,
          "created_utc": 1749058574.0,
          "replies": [
            {
              "id": "mw45v95",
              "author": "shitposts_over_9000",
              "body": "it is about 30 for most tech verticals but only 15-20% of the profit under the current prohibitions plus regulatory and tax overhead.\n\nthis particular change probably wont be the tipping point, but when the bottom end of that range hits 10% something is going to change because the companies are going to be in a situation where they would be risking underperforming the market just by selling in the EU.\n\nsmartphones being viewed as a necessity by the people with the most disposable income I would expect EU only models with significantly higher prices for a while before any of the large vendors exit the market though.",
              "score": -1,
              "created_utc": 1749122062.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mvzqcxz",
          "author": "None",
          "body": "Too big of a market",
          "score": 6,
          "created_utc": 1749060042.0,
          "replies": []
        },
        {
          "id": "mw176km",
          "author": "kat1795",
          "body": "No, I am from Australia and planning to buy my phones from EU from 2027.\n\nIf so, it will actually increase their sales in EU not decrease it",
          "score": 2,
          "created_utc": 1749075386.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mvzezk8",
      "author": "PsyJak",
      "body": "*20th June",
      "score": -2,
      "created_utc": 1749056921.0,
      "replies": []
    },
    {
      "id": "mvz6luq",
      "author": "jackhab",
      "body": "So much talk recently about how the EU  needs to build its own independent IT infrastructure and then - boom - they add a label to cellphones. Well done, baby steps, I get it...",
      "score": -18,
      "created_utc": 1749054576.0,
      "replies": [
        {
          "id": "mvzf5so",
          "author": "PsyJak",
          "body": "*mobile phones",
          "score": 6,
          "created_utc": 1749056968.0,
          "replies": []
        }
      ]
    }
  ]
}