{
  "post": {
    "title": "Used Seagate drives sold as new traced back to crypto mining farms | Seagate distances itself as retailers scramble to address fraud",
    "author": "chrisdh79",
    "id": "1ilpje3",
    "score": 5832,
    "created_utc": 1739135992.0,
    "selftext": "",
    "num_comments": 334,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ilpje3/used_seagate_drives_sold_as_new_traced_back_to/"
  },
  "comments": [
    {
      "id": "mbwv5nj",
      "author": "jiggscaseyNJ",
      "body": "I worked in IT sales for years going back to 1999. It was a VERY common practice. Consider a stick of RAM. There is absolutely no way to tell if it’s been used.",
      "score": 624,
      "created_utc": 1739138487.0,
      "replies": [
        {
          "id": "mbwwfmq",
          "author": "None",
          "body": "well, assuming they cleaned it well after using it, and also assuming they have manufacturer level repackaging equipment",
          "score": 241,
          "created_utc": 1739138873.0,
          "replies": [
            {
              "id": "mby0pfz",
              "author": "jiggscaseyNJ",
              "body": "It’s illegal to sell a used item as new under the FTC Act. Of course that doesn’t stop resellers and manufacturers from doing it if they can get away with it.",
              "score": 243,
              "created_utc": 1739151877.0,
              "replies": [
                {
                  "id": "mbzb31e",
                  "author": "chillaban",
                  "body": "It's illegal but I'm not sure as a consumer what can be done. Amazon has sold me \"new\" NVME drives with previous customer data to me and even when I complained to state and federal regulators they just contacted Amazon on my behalf who gave me a refund and an extra month of Prime for free. And after that the regulators simply told me they found that the resolution was satisfactory. \n\nI even hired my employer's free personal legal services to consult with an attorney who didn't think I had a case either. \n\n\nIt's super frustrating when the law is written in black and white but large companies seem to have figured out a way to automate paltry settlements and call it a day.",
                  "score": 91,
                  "created_utc": 1739171331.0,
                  "replies": [
                    {
                      "id": "mc0kc73",
                      "author": "BetterThanAFoon",
                      "body": "Curious.  What outcome were you looking for?",
                      "score": 9,
                      "created_utc": 1739195912.0,
                      "replies": [
                        {
                          "id": "mc0w8br",
                          "author": "chillaban",
                          "body": "Some sort of criminal charges or escalating punitive charges in line with me as a civilian breaking the law?\n\nIf I have to discover something is used, then fill out 5 pages of forms and wait for 6 months of bureaucracy, and all Amazon loses is 4 dollars in monthly payments from me, it feels like Amazon is gonna profit more from breaking the law than obeying it. It’s kind of moot claiming that selling me used shit as new is illegal. \n\n\nIf I run a red light or litter, the punishment is way more than delaying my commute by 30 seconds or picking up the trash I dropped, as an incentive to make sure I don’t break the law. Why shouldn’t that be the case for a trillion dollar company?",
                          "score": 80,
                          "created_utc": 1739200048.0,
                          "replies": [
                            {
                              "id": "mc26fly",
                              "author": "igolowalways",
                              "body": "Spot on… unfortunately it seems that the trend these days is to ignore the law and the rules… pick and choose. They please get a pick and choose who they want to protect. They get to pick and choose as they want to prosecute.\n\nIf somebody clearly breaks the law, the police can just say they didn’t see it",
                              "score": 19,
                              "created_utc": 1739213573.0,
                              "replies": []
                            },
                            {
                              "id": "mc117hs",
                              "author": "Sure-Temperature",
                              "body": "Because you're not the one writing the laws",
                              "score": -3,
                              "created_utc": 1739201616.0,
                              "replies": [
                                {
                                  "id": "mc1bchb",
                                  "author": "chillaban",
                                  "body": "Oh don't get me wrong, I wasn't born yesterday, it's not like I am shocked it works this way.\n\n  \nMy original response was to the person pointing out that selling used things as new is \"illegal\" under business code / federal law -- it might be true, but in practice it means nothing for a big box retailer, as long as they honor their standard return policy it's really unlikely that the AG is going to press charges or sue them.",
                                  "score": 5,
                                  "created_utc": 1739204653.0,
                                  "replies": [
                                    {
                                      "id": "mc1mm17",
                                      "author": "Sure-Temperature",
                                      "body": "Oh yeah, I was agreeing with you. But the more we all point out this sort of shit, the faster people will want to act to fix it",
                                      "score": 1,
                                      "created_utc": 1739207908.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mc2m92m",
                              "author": "Wishihadcable",
                              "body": "Your analogy to a red light or litter is apt. Every day people litter and run red lights. They do it because there is no enforcement of the laws. I’m sure you littered in the past and accidentally run a red light.  I doubt you got a ticket unless you hit a car running the red. Nothing happens to the companies when the violate the law like nothing happens to you when you violate the law.",
                              "score": -2,
                              "created_utc": 1739218790.0,
                              "replies": [
                                {
                                  "id": "mc2s45d",
                                  "author": "chillaban",
                                  "body": "I don't know where you live where littering and red light running isn't regularly enforced, but where I live there's a pretty significant chance that you will get pulled over and ticketed for that.\n\nAs you said, when there's no enforcement of the laws or not grave enough of a punishment for said enforcement, then there's no incentive to avoid illegal behavior. That is exactly what's happening with Amazon and Newegg moving gray inventory.\n\nFor one of my jobs I moved to a state that requires a front license plate but the ticket for not having it was only $75. My car had an adaptive cruise radar where the front plate would go, and it's an entire front fascia swap for front plate compatibility, around $3500 in 2005 money. I half jokingly told a cop as he's writing a ticket that he needs to write 45 more of those to make me even think about paying for the front plate fix.",
                                  "score": 2,
                                  "created_utc": 1739221294.0,
                                  "replies": [
                                    {
                                      "id": "mc3lsrl",
                                      "author": "Wishihadcable",
                                      "body": "What’s your definition of regularly enforced? I doubt the ticketing rate for littering is 0.1% or 1/1000.",
                                      "score": 1,
                                      "created_utc": 1739234193.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbzpoma",
                      "author": "RealDickGrimes",
                      "body": "They didn't figure out a way around it. They just have common and mutual interests. You cannot hurt anyone or anything that is generating millions of dollars. Gov would not go after the company. \nThe power is to fuck up those companies, make em lose money either legally or illegally. We all heard that dude who modified his wheel loader to be bulletproof and explosive proof and went after the business that opened next to him and stole his customers, and im sure he went with the legal route first.",
                      "score": 1,
                      "created_utc": 1739180465.0,
                      "replies": []
                    },
                    {
                      "id": "mc34acj",
                      "author": "Zealousideal_Brush59",
                      "body": "Amazon's billion dollar legal department would have slaughtered your free attorney. It was for the best",
                      "score": 1,
                      "created_utc": 1739226870.0,
                      "replies": [
                        {
                          "id": "mc3e97u",
                          "author": "chillaban",
                          "body": "Oh trust me, I wasn't thinking my company's free legal aid service would actually be able to do much, I just wanted an excuse to use that corporate benefit and figured a lawyer would be better than Google for actually explaining to me what my legal options are.\n\n  \nMost people use it to draft a will or write angry letters to their neighbors.",
                          "score": 1,
                          "created_utc": 1739231558.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mcgsat6",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 0,
                      "created_utc": 1739406479.0,
                      "replies": [
                        {
                          "id": "mcgte7r",
                          "author": "chillaban",
                          "body": "Amazon Prime costs $14.99 a month or $140 a year, it used to be more like $100 a year when I went through the above situation in like 2019.\n\n  \nPerhaps you are a student or in another discounted group? I'm not sure Amazon offers free Prime anymore to anyone, at best like half off.",
                          "score": 2,
                          "created_utc": 1739406828.0,
                          "replies": [
                            {
                              "id": "mcguaom",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 2,
                              "created_utc": 1739407116.0,
                              "replies": [
                                {
                                  "id": "mcgx9zw",
                                  "author": "chillaban",
                                  "body": "Oh wow, that's amazing! Hope you get to keep it, that's like over a thousand bucks you saved right there.\n\n  \nI actually had free Comcast for a few years because a technician did the wrong thing to activate a self-purchased modem and it somehow just became permanently allowed and not tied to my payments. I found out after moving apartments and hooking up the modem without calling Comcast and to my surprise the modem worked. It stopped working quite a while later.",
                                  "score": 1,
                                  "created_utc": 1739408065.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbyn9r0",
                  "author": "Razor1834",
                  "body": "How long til the FTC “no longer exists”?",
                  "score": 116,
                  "created_utc": 1739160054.0,
                  "replies": [
                    {
                      "id": "mbyrcj1",
                      "author": "woliphirl",
                      "body": "The CFPB just had its throat cut tonight\n\nThe FTCs days are numbered\n\nThis country is being dismantled by men with no authority to do so, and everyone's just watching",
                      "score": 121,
                      "created_utc": 1739161665.0,
                      "replies": [
                        {
                          "id": "mbyuwbr",
                          "author": "Edythir",
                          "body": "\"The CFPB is redundant and it's duties should be handled by the FTC\"\n\n\"And what are your opinions on the FTC?\"\n\n\"Well, they're redundant too. Customers should just know better.\"",
                          "score": 65,
                          "created_utc": 1739163164.0,
                          "replies": [
                            {
                              "id": "mbyw2qz",
                              "author": "None",
                              "body": "who needs a federal trade commission if there is no fed?",
                              "score": 20,
                              "created_utc": 1739163674.0,
                              "replies": [
                                {
                                  "id": "mbzcy2r",
                                  "author": "kurotech",
                                  "body": "When the free in free trade means free for government use that's when capitalism reaches peak dystopia",
                                  "score": 3,
                                  "created_utc": 1739172423.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mc224na",
                              "author": "AlphaTangoFoxtrt",
                              "body": "[Sorry, I had to](https://imgflip.com/i/9jqoo0)",
                              "score": 3,
                              "created_utc": 1739212349.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mc0dlf1",
                          "author": "None",
                          "body": "What about all the gun owning citizens? \n\nThey are just watching lmao.",
                          "score": 2,
                          "created_utc": 1739193302.0,
                          "replies": []
                        },
                        {
                          "id": "mc0n8ld",
                          "author": "BetterThanAFoon",
                          "body": "It's a shame too.  CFPB is one of the regulatory bodies where you could resolve banking issues that banks themselves did not want to resolve.",
                          "score": 1,
                          "created_utc": 1739196980.0,
                          "replies": []
                        },
                        {
                          "id": "mbz7k19",
                          "author": "alidan",
                          "body": "like it or not, they were elected on a mandate, and told you exactly what they were going to do ahead of time. \n\nbut going to be honest, just looking at the ftc budget, they are lower on the totem pole of full a full audit as I don't think they were involved in partisan bullshit the way other departments are.",
                          "score": -27,
                          "created_utc": 1739169356.0,
                          "replies": [
                            {
                              "id": "mbz7pnp",
                              "author": "OrganizeYourHospital",
                              "body": "What partisan bullshit was the CFPB doing?",
                              "score": 18,
                              "created_utc": 1739169441.0,
                              "replies": [
                                {
                                  "id": "mbzbent",
                                  "author": "alidan",
                                  "body": "> CFPB \n\nas far as I can tell, its part of the audit.\n\nif you tell people ahead of time or let them continue to work, they are capable of hiding/destroy evidence of malfeasance. one of the early interviews with a usaid worker she specifically said they took crap down and removed books to hide incriminating evidence, granted I think that was partisan bullshit she was referring to.\n\njust remember, we are dealing with a bureaucracy that pays 800$ for 2$ plungers, elon isn't the best arbiter of the audit, there is a lot of potential for corruption there as well, but it's the best we are ever going to get sadly.",
                                  "score": -22,
                                  "created_utc": 1739171521.0,
                                  "replies": [
                                    {
                                      "id": "mc05hl0",
                                      "author": "CatholicSquareDance",
                                      "body": "so you can't actually say anything the CFPB did?",
                                      "score": 9,
                                      "created_utc": 1739189706.0,
                                      "replies": [
                                        {
                                          "id": "mc07mby",
                                          "author": "alidan",
                                          "body": "I can say they got hit with an audit and weren't given advanced knowledge to potentially hide things. \n\nthe government is being treated like a criminal organization, likely with a priority to things that seem to be one sided or wasting money, again, we are dealing with a bureaucracy that pays 800$ for a 2$ plunger.",
                                          "score": -10,
                                          "created_utc": 1739190714.0,
                                          "replies": [
                                            {
                                              "id": "mc08ywm",
                                              "author": "CatholicSquareDance",
                                              "body": "If you assume everything is fraud without evidence, it's very easy to find, I imagine",
                                              "score": 7,
                                              "created_utc": 1739191333.0,
                                              "replies": [
                                                {
                                                  "id": "mc0ccu2",
                                                  "author": "alidan",
                                                  "body": "the last time the government was audited, god I don't even remember how long ago it was, but what was found was 8-9 figures of money were just completely un accounted for and the news about it was slowly swept away and no one talked about it anymore. \n\nwhen a plunger costs 800$, and I will say this incase you don't know, it's one of the actual prices of shit the government actually pays for, why does it cost 800$, someone either got a real fucking good deal on a contract for the plunger in which case I want the people who okayed that contract fired and out, or the 800$ plunger is a way to syphon money into someone else's hand and I want someone in jail. \n\nI don't think any government is clean of corruption, but as long as ours is technically by and for the people, I would love to have a transparent audit of where the money is going, we don't need to be told top secret projects, but an accnolagemnet of we know where the money went would be nice, and to anything not top secret I would love to know exactly money I had to pay in goes. \n\nI mean you want corruption, the fact they cant pass a law on insider trading and the nancy pelosi stock bot quadrupled its money last I checked, but oh, they can put off telling you what money goes were for 180 days or so, tells me corruption isn't hard to find its just that its not by the letter of the law illegal.",
                                                  "score": 0,
                                                  "created_utc": 1739192788.0,
                                                  "replies": [
                                                    {
                                                      "id": "mc0dtg8",
                                                      "author": "CatholicSquareDance",
                                                      "body": "you're tilting at windmills just because you're fucking obsessed with plungers, and the idiots in office will destroy some of our most consumer friendly and citizen friendly institutions in US government (instead of something like the US military, the actual biggest source of government waste) to appease your completely unfounded insecurities and those of uninformed voters like you in this \"audit.\" which, as an accountant, I can say isn't even a fucking audit. it's just an inquisition.",
                                                      "score": 3,
                                                      "created_utc": 1739193393.0,
                                                      "replies": [
                                                        {
                                                          "id": "mc0e8vm",
                                                          "author": "CatholicSquareDance",
                                                          "body": "You still haven't said a single specific thing at all, also. You just think that every government institution must be wasteful because you're probably some free market paranoiac.",
                                                          "score": 3,
                                                          "created_utc": 1739193567.0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "mc0matz",
                                                      "author": "BetterThanAFoon",
                                                      "body": "> the last time the government was audited, god I don't even remember how long ago it was, but what was found was 8-9 figures of money were just completely un accounted for and the news about it was slowly swept away and no one talked about it anymore\n\nFair redditor you cannot remember past a year?   Every year, every federal agency is audited by 3rd party independent auditors as required by law.  \n\nEach agency posts their results on their website as required for transparency sake.  \n\nEvery year they post their Financial report which includes their report for how they executed the previous year, and their budget for the upcoming year.  \n\nOn top of that, any dollar that leaves the public coffers is required to be publicly disclosed provided it is not a no kidding secret program.   \n\nFinally, you have GAO, the Legislative branch watchdog that reviews each agency and provides their own independent reports.  \n\nIt is not uncommon to see findings of poor controls or poor accounting procedures of government programs, but that does not equal fraud.  Many times it is administrative issues.  Regardless getting a clean opinion on your audits is important.....and if there are issues those are also published annually.  \n\nThe idea that there isn't transparency in how the government spends money is pure BS.  Those that do not wish to be spoon fed by Fox News or conspiracy theorists on Twitter can easily find this information.   It would be great if more people read and came up with informed opinions.",
                                                      "score": 5,
                                                      "created_utc": 1739196643.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mbz8tto",
                              "author": "woliphirl",
                              "body": "Name a single department involved in \"partisan bullshit\"\n\nI have yet to see anything of meaning targeted by trumps blatantly illegal executive orders.\n\nMandate or not, these policies are unhinged and clearly serve his benefactors and not the people.",
                              "score": 18,
                              "created_utc": 1739170057.0,
                              "replies": [
                                {
                                  "id": "mbzbw9k",
                                  "author": "alidan",
                                  "body": "usaid funded organizations who directly attacked gamers for calling out the crap they see in modern games, probably as the most direct partisan bullshit they funded so far that was used against Americans, they also funded left leaning news outlets. along with seemingly exclusively funding left to far left initiatives round the world that at least half the country doesn't want to see their tax money go to. a budget of 50 billion dollars... will be fun to see where the money went and if there were kick back to people in power. \n\npersonally I see partisan bullshit being issue number one on why a place gets audited, and how much they potentially waste being a second.",
                                  "score": -21,
                                  "created_utc": 1739171806.0,
                                  "replies": [
                                    {
                                      "id": "mbzfgxl",
                                      "author": "Zealousideal_Rate420",
                                      "body": "> usaid funded organizations who directly attacked gamers for calling out the crap they see in modern games,\n\nI thank you for making it clear there's no need to read the whole comment so early on it.",
                                      "score": 14,
                                      "created_utc": 1739173958.0,
                                      "replies": [
                                        {
                                          "id": "mbzg1vz",
                                          "author": "alidan",
                                          "body": "you asked for partisan bullshit and I gave it to you.",
                                          "score": -6,
                                          "created_utc": 1739174315.0,
                                          "replies": [
                                            {
                                              "id": "mbzjhek",
                                              "author": "MXMCrowbar",
                                              "body": "I’m going to be 100% honest with you man. If you really believe this, it’s time you seriously reconsider where your information is coming from and why you trust the sources you do.\n\n“USAID is going after gamers” is such an obvious piece of propaganda that it actually made me laugh the first time I read it. I don’t blame you for buying into it - that’s what it’s engineered to do, after all. But I’m just asking you to think hard about who is telling you this and how they might benefit from lying to you.\n\nIf you want to drop the sources you’re using here I’d be happy to see them.",
                                              "score": 8,
                                              "created_utc": 1739176465.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "mbzmxk6",
                                              "author": "Zealousideal_Rate420",
                                              "body": "I didn't ask for anything, but if you're offering anyway... Try to detox a bit from the media you're consuming. Just for a bit. That usually helps you see things in a less polarizing way.",
                                              "score": 5,
                                              "created_utc": 1739178696.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mbzxue2",
                                      "author": "Dhaupin",
                                      "body": "Lol.",
                                      "score": 2,
                                      "created_utc": 1739185562.0,
                                      "replies": []
                                    },
                                    {
                                      "id": "mc07zdm",
                                      "author": "jimgolgari",
                                      "body": "Wait, who did they attack? With what? And what did the gamers call out? Lots of posturing happening here with no actual names of the anti-gamer militias they’re funding.",
                                      "score": 2,
                                      "created_utc": 1739190880.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mc05z59",
                              "author": "glitchvid",
                              "body": "Doing bad things is bad, actually, regardless of \"electoral consent\".",
                              "score": 1,
                              "created_utc": 1739189939.0,
                              "replies": [
                                {
                                  "id": "mc07upn",
                                  "author": "alidan",
                                  "body": "we were told what he was planning to do, who was going to do it, he won not only the electoral collages but the popular vote as well, along with a seeming majority in favor of his audit, where only 30% are hard against it, that is split between a 10% republican and 20% democrat, everyone else is more or less squabbling about to the extent of the audit.",
                                  "score": 1,
                                  "created_utc": 1739190821.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mcaj1jh",
                              "author": "gdsmithtx",
                              "body": "![gif](giphy|sRLpsHEM8eTOPxWdtX)",
                              "score": 0,
                              "created_utc": 1739324017.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbytvtj",
                      "author": "joomla00",
                      "body": "Why would they shut it down when they can install trump/musk loyalists to go after their competitors?",
                      "score": 5,
                      "created_utc": 1739162729.0,
                      "replies": [
                        {
                          "id": "mc05ib6",
                          "author": "nagi603",
                          "body": "You assume competition, when collusion and eventual monopoly is the unregulated end-game.\n\nAlso there is no need for regulatory ban on a competitor when you can just call friends to cut them off from infrastructure overnight, be it banking, electricity or internet. Or make sure their service is degraded enough that customers \"voluntarily\" leave their service.",
                          "score": 1,
                          "created_utc": 1739189717.0,
                          "replies": [
                            {
                              "id": "mc063o4",
                              "author": "joomla00",
                              "body": "You have to kill the competition first before you can get to end game",
                              "score": 1,
                              "created_utc": 1739189999.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbyw2oo",
                  "author": "notredditbot",
                  "body": "Most things on Amazon are used in the sense that it's a return. I've bought so many new items that had it's packaging open and seals cut",
                  "score": 4,
                  "created_utc": 1739163673.0,
                  "replies": [
                    {
                      "id": "mbyy4pg",
                      "author": "Far-Scallion7689",
                      "body": "I no longer use Amazon. Good riddance.",
                      "score": 7,
                      "created_utc": 1739164600.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbxhtna",
              "author": "Kellic",
              "body": "LOL.  All of which is stupidly simple.  You just need to backtrace who the manufactuer used in China, contact them and ask for 1,000 copies of X product.  If you are offering money they will probably sell it to you.  Or, you simply hire someone to print out the backing and then create the plastic Clamshell.  Seriously.  If you have the hardware already, everything else would be a web search away.  [https://www.taylorpackaging.com/clamshell-packaging/](https://www.taylorpackaging.com/clamshell-packaging/)",
              "score": 34,
              "created_utc": 1739145835.0,
              "replies": []
            },
            {
              "id": "mbyo933",
              "author": "Tibbaryllis2",
              "body": "> well, assuming they cleaned it well after using it\n\nThat Cheeto dust is a dead giveaway every time,",
              "score": 8,
              "created_utc": 1739160435.0,
              "replies": []
            },
            {
              "id": "mbzwjuv",
              "author": "Diggerinthedark",
              "body": "Cleaning is easy, and repackaging isn't exactly difficult. Not that you even need to - just sell it as an OEM pack",
              "score": 5,
              "created_utc": 1739184794.0,
              "replies": []
            },
            {
              "id": "mc1cv6j",
              "author": "pak9rabid",
              "body": "Is there really a need to “clear” RAM?  Isn’t it volatile memory?",
              "score": 1,
              "created_utc": 1739205095.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbxt9ox",
          "author": "killamcleods",
          "body": "Very true. It’s tough when authorized seagate distribution has a drive for $195 and Amazon has it for $150. The customer thinks you’re scamming them",
          "score": 37,
          "created_utc": 1739149487.0,
          "replies": [
            {
              "id": "mbycx06",
              "author": "TheConnASSeur",
              "body": "I would **gladly** pay 20% more for a guarantee that I was getting a reliable 100% new OEM product that matches the listed specs *exactly*. Buying any electronics or pc parts from online retailers has become increasingly frustrating. Fraud is so commonplace that actually getting the product you paid for in the condition you paid for is like winning the lottery. I've had to completely stop using Amazon for purchases over $50.",
              "score": 31,
              "created_utc": 1739156351.0,
              "replies": [
                {
                  "id": "mbz5mrl",
                  "author": "UninsuredToast",
                  "body": "If I ever have to buy a PC part through Amazon I never buy anything that is shipped by Amazon. That’s where they screw you over. I only ever buy if it’s shipped by the manufacturer.",
                  "score": 11,
                  "created_utc": 1739168315.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbya9fo",
          "author": "Spectrum1523",
          "body": "Question - does a stick of ram suffer any wear by being used?",
          "score": 12,
          "created_utc": 1739155487.0,
          "replies": [
            {
              "id": "mbyn8o1",
              "author": "ilep",
              "body": "Unless you overclock and increase voltage by a lot, in which case it might cause a short circuit somewhere. Otherwise it should last until it becomes obsolete anyway.",
              "score": 16,
              "created_utc": 1739160042.0,
              "replies": []
            },
            {
              "id": "mbycfpa",
              "author": "riskyClick420",
              "body": "A lot of them have lifetime warranty, if that's indicative...",
              "score": 9,
              "created_utc": 1739156186.0,
              "replies": []
            },
            {
              "id": "mbydper",
              "author": "jiggscaseyNJ",
              "body": "No. The only thing you might see is a little bit of wear on the contacts but that can be chalked up to being run through a tester. RAM is considered volatile so no data is retained when there isn’t any power supplied to it. There’s NVRAM which can hold data without power.",
              "score": 2,
              "created_utc": 1739156621.0,
              "replies": [
                {
                  "id": "mbz8639",
                  "author": "alidan",
                  "body": "ram can retain its data if you flash freeze it, but you are likely a criminal if you have to worry about that.",
                  "score": 3,
                  "created_utc": 1739169691.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbz3nqa",
              "author": "TheActualDonKnotts",
              "body": "Depends heavily on the quality of the components it's connected to, particularly the power supply and motherboard.",
              "score": 1,
              "created_utc": 1739167287.0,
              "replies": []
            },
            {
              "id": "mbz80vk",
              "author": "alidan",
              "body": "every pc part has wear and tear if used, however wear on ram will, in most cases barring motherboards sending to much voltage, will outlive the spec of the ram being sold and will be ligitimately obsolete before it shows problems.",
              "score": 1,
              "created_utc": 1739169610.0,
              "replies": []
            },
            {
              "id": "mbzr2uf",
              "author": "subaru5555rallymax",
              "body": "You’ll often see wear on the individual pins of the connector; the plating begins to wear with each insertion.",
              "score": 1,
              "created_utc": 1739181351.0,
              "replies": []
            },
            {
              "id": "mbzxq53",
              "author": "guyblade",
              "body": "The way a consumer uses it in their desktop; probably not. The way a cloud provider uses it; probably.\n\nThink about what percentage of the time your desktop is making maximum usage of its hardware. For most people, that's going to be almost none of the time. For a cloud provider, they are trying to squeeze every bit of value out of their hardware. That tends to mean that the average utilization is very high. The reality is that silicon is less a question of \"wearing out\" than it is of \"the weakest piece fails\". Heavy utilization does seems to be correlated with error rate (at least based on [this decade-old paper](https://www.cs.toronto.edu/~bianca/papers/sigmetrics09.pdf) which is the best source that I'm aware of for large-scale ram analysis).\n\nAlso, that paper notes that older dimms seem to have higher error rates which implies that _something_ is happening.",
              "score": 1,
              "created_utc": 1739185493.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mby0rdp",
          "author": "None",
          "body": "[deleted]",
          "score": 9,
          "created_utc": 1739151897.0,
          "replies": [
            {
              "id": "mbytlxi",
              "author": "Hkshooter",
              "body": "No need to worry about them. They are out of business",
              "score": 5,
              "created_utc": 1739162613.0,
              "replies": [
                {
                  "id": "mbz4atg",
                  "author": "LivesDoNotMatter",
                  "body": "I remember back whey Fry's was good (I'm thinking SoCal, early 2000's).  Then they became best-buy, then they became worse than best-buy...  and now I hear they are gone.   Not surprised. \n\nThey took a fall pretty quickly, too.  I remember telling people how cool fry's was, and they went down and were like \"uhh... wtf are you smoking...?\", and later, I went down there with them, and was shocked at how much it changed.  Their selection diminished like 90%, half the shelves were empty, and what was left had a 2-300% markup of what Amazon would be priced.\n\nAlso, last time I remember buying something there, I discovered it was an open-box of a non-working item after I got home, and they gave me a bunch of hassle when I went to return it.",
                  "score": 5,
                  "created_utc": 1739167618.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mbykz0a",
          "author": "VoidOmatic",
          "body": "Yup, saw tons of used drives that were delivered as \"new.\"",
          "score": 1,
          "created_utc": 1739159189.0,
          "replies": []
        },
        {
          "id": "mbzvr9h",
          "author": "Grandpaw99",
          "body": "Interesting side note, Ram is just about the only component in a computer that does not have a direct driver.",
          "score": 1,
          "created_utc": 1739184301.0,
          "replies": []
        },
        {
          "id": "mcew0fd",
          "author": "AdmiralTassles",
          "body": "I actually had this with RAM! Bought 32gb from G.Skill and wondered why it would never reach claimed clock speeds.\n\nYears later I found out that they were apparently old Samsung chips and a handful of people had the same issue. Couldn't find any info about that right after I bought them, of course. Thought it was my motherboard.",
          "score": 1,
          "created_utc": 1739386755.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbwpw2s",
      "author": "earthman34",
      "body": "More scams involving crypto, how could that be?",
      "score": 684,
      "created_utc": 1739136948.0,
      "replies": [
        {
          "id": "mbxi28z",
          "author": "DoubleJumps",
          "body": "I remember when people first started talking about cryptocurrency and how it was going to do all of these great things for society, and a like 15 or 16 years later I've only seen it used for either outright scams or to buy illegal shit.",
          "score": 239,
          "created_utc": 1739145914.0,
          "replies": [
            {
              "id": "mbxla0i",
              "author": "earthman34",
              "body": "It's mainly served a couple functions: providing a method to transfer large sums of wealth anonymously, usually for, as you say, illegal shit, like laundering money, and it's also functioned as an ideal pump-and-dump mechanism to keep sucking in money from rubes...like the rubes that bought Hawk Tuah or TRUMP. Forensic examination of wallets show that TRUMP buyers have lost $2 billion dollars since it was introduced. How is this helping society? It's not. Crypto is nothing, it's imaginary leprechaun gold, somewhere over the rainbow. It's nothing but a tool of exploitation and manipulation.",
              "score": 134,
              "created_utc": 1739146993.0,
              "replies": [
                {
                  "id": "mc04r32",
                  "author": "nagi603",
                  "body": "It had such nice lofty goals when introduced. I even liked the idea of \"provide funding for opposition in repressive regimes\" and \"a bit more anonymity and thus security for.. online adult entertainment workers\". Oh and the \"perhaps get paid to donate gpu cycles to BOINC project-like stuff\". But during the years, most used the same mechanisms for just what you describe and made sure altruistic goals like the ones I mentioned are way harder and less supported.\n\nOh and of course it Just Does Not Scale, of course. The insane waste of energy and material that goes into it is truly mind-boggling.",
                  "score": 3,
                  "created_utc": 1739189341.0,
                  "replies": [
                    {
                      "id": "mc278qs",
                      "author": "earthman34",
                      "body": "Shit like Silk Road and the dark web tainted it forever.",
                      "score": 0,
                      "created_utc": 1739213804.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbzcm59",
                  "author": "MinchinWeb",
                  "body": "You forgot about paying off those guys from eastern Europe that encrypted your hand drive...",
                  "score": 5,
                  "created_utc": 1739172228.0,
                  "replies": []
                },
                {
                  "id": "mbypv0d",
                  "author": "darthcaedusiiii",
                  "body": "It's helping society by sucking the rubes dry so they can't buy a plane ticket for the next snowflake rally.",
                  "score": 11,
                  "created_utc": 1739161069.0,
                  "replies": [
                    {
                      "id": "mc0bi27",
                      "author": "RapNVideoGames",
                      "body": "Bold of you to assume they won’t have a bus in every city to let people get to “the talks”",
                      "score": 3,
                      "created_utc": 1739192426.0,
                      "replies": []
                    },
                    {
                      "id": "mc3plk2",
                      "author": "Fenix_one",
                      "body": "Whether you are a hedge fund or a working class person, if you held bitcoin for the year 2024 you got the same performance (100%+)",
                      "score": 1,
                      "created_utc": 1739235488.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbz7s0z",
                  "author": "DamnAutocorrection",
                  "body": "How much did the winners gain with trump coin? 2 billion?",
                  "score": 1,
                  "created_utc": 1739169476.0,
                  "replies": [
                    {
                      "id": "mbzed0v",
                      "author": "earthman34",
                      "body": "Trump gained about $100 million from transfer fees, that much is known.",
                      "score": 3,
                      "created_utc": 1739173279.0,
                      "replies": [
                        {
                          "id": "mc48b78",
                          "author": "DamnAutocorrection",
                          "body": "How would he get paid in fees? What kind of coin was it?",
                          "score": 1,
                          "created_utc": 1739241753.0,
                          "replies": [
                            {
                              "id": "mc4ejzb",
                              "author": "earthman34",
                              "body": "Trump coin.",
                              "score": 1,
                              "created_utc": 1739243880.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mg3z4x3",
                  "author": "jerrys_briefcase",
                  "body": "It’s faith. Just like cash is faith in gov. I think I have more faith in crypto than my gov rn",
                  "score": 1,
                  "created_utc": 1741158517.0,
                  "replies": [
                    {
                      "id": "mg85kb7",
                      "author": "earthman34",
                      "body": "That's because you're not very bright. US dollars have been the defining currency for a hundred years. I can spend them anywhere. Crypto? LOL, assuming somebody doesn't pump and dump it, and assuming you can find a way to transfer it, and assuming you don't mind the 50% transfer fee, hey, it's great. Me, I'll stick with dollars.",
                      "score": 1,
                      "created_utc": 1741212536.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbxrvqg",
                  "author": "None",
                  "body": "[deleted]",
                  "score": -27,
                  "created_utc": 1739149051.0,
                  "replies": [
                    {
                      "id": "mbxsa12",
                      "author": "vastle12",
                      "body": "They're both fiat currencies but the dollar is backed by the collective economic output and influence of the US economy. Crypto is based on hype",
                      "score": 38,
                      "created_utc": 1739149172.0,
                      "replies": [
                        {
                          "id": "mbxt3ss",
                          "author": "brotherdaru",
                          "body": "Look, I’m probably being pedantic but how is that different? Both just use influence to make purchases, the Trump meme coin used Trump as its influence, the dollar uses the economic influence of a country that is really looking more and more in trouble, if someone says pay me what you owe, do we just print more money and say here? What if they want their payment in gold or lithium or land? How do we back our cash?",
                          "score": -24,
                          "created_utc": 1739149433.0,
                          "replies": [
                            {
                              "id": "mbxvs83",
                              "author": "vastle12",
                              "body": "Because the country is composed of people and things that actually produce value. crypto doesn't produce shit",
                              "score": 32,
                              "created_utc": 1739150220.0,
                              "replies": [
                                {
                                  "id": "mbxy6ea",
                                  "author": "DoubleJumps",
                                  "body": "They won't understand this.  They never understand this.",
                                  "score": 17,
                                  "created_utc": 1739150984.0,
                                  "replies": []
                                },
                                {
                                  "id": "mbxxooq",
                                  "author": "brotherdaru",
                                  "body": "I own one bitcoin, bought it when i was 14 was going to buy pizza with it, never did but now it’s worth 100 grand.  How is that not producing value?",
                                  "score": -10,
                                  "created_utc": 1739150811.0,
                                  "replies": [
                                    {
                                      "id": "mbxz57u",
                                      "author": "radicalelation",
                                      "body": "Increasing value isn't producing value. \n\nNFTs or art dealing, same deal. Saying something is worth 100k only makes it worth 100k if someone buys it for that. What value has been produced? It's merely increased. \n\nYou're right that similar could be said about the US dollar, except for the fact that most of the entire world is on that system and tie their actual production of goods to that value. \n\nSure, you could swap Bitcoin for it, to just end up with essentially the same system in the end except whoever got in at ground will take the lions share. That's why this is an actual power grab, toppling the US dollar and replacing it with Bitcoin or other crypto would be a massive transfer of wealth and power to those who already hold enough. It's literally Peter Thiel's whole deal, why he wanted PayPal (replace the US dollar with a currency \"powered by individuals\"), but of course he and other tech bros making this happen already have so much of the share. \n\nIt's an attempt to throw the game board and replace the pieces in a more favorable way. That's all.",
                                      "score": 21,
                                      "created_utc": 1739151325.0,
                                      "replies": [
                                        {
                                          "id": "mby0ma9",
                                          "author": "brotherdaru",
                                          "body": "Got it!!!! Ok this makes sense",
                                          "score": 2,
                                          "created_utc": 1739151848.0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "mbyglbh",
                                      "author": "earthman34",
                                      "body": "It's not ***producing*** anything. It's ***inducing*** people to buy it at increasing prices and then sell it for profit...in ***dollars***. If you bought an ounce of gold in the '20s for $35 and sold it now for $2500, did it produce value? No, it produced nothing. You gained money because an asset increased in perceived value, not because anything was produced. An ounce of gold doesn't give birth to little ouncelets. Dollars tend to decrease in value slightly over time, because the population increases, the economy grows in size, and more dollars are introduced into circulation to ensure a money supply. If you choke the money supply by restricting it, it shrinks the economy and makes most people poorer. Bitcoin and other crypto are intangible and backed by nothing. How much are those Hawk Tuah coins worth right now? How are those TRUMP and MELANIA investors doing?",
                                      "score": 3,
                                      "created_utc": 1739157603.0,
                                      "replies": [
                                        {
                                          "id": "mbyji5j",
                                          "author": "brotherdaru",
                                          "body": "First, chill, you’re gonna poop yourself, second, I already got my question answered. I understand the reason behind it now so you’re wayyyyy late to the party.",
                                          "score": -4,
                                          "created_utc": 1739158647.0,
                                          "replies": [
                                            {
                                              "id": "mc02k2l",
                                              "author": "Murky_Macropod",
                                              "body": "This is a childish response",
                                              "score": 3,
                                              "created_utc": 1739188213.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mbxxhvl",
                                  "author": "brotherdaru",
                                  "body": "But one bitcoin is worth over 100k? How is people producing value if the money looses its value like in the Congo or Venezuela or other places where one egg is a million devalued currency, if DOGE messes up the economic backbone of the USA and its currency by destroying the trust in the dollar and our economy collapses how is that not the same as a crypto loosing value?",
                                  "score": -10,
                                  "created_utc": 1739150751.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mbxya4y",
                              "author": "24111",
                              "body": "Because economic at its core is to facilitate the transfer of goods and services, and we still need a mechanism of an objectively worthless relatively convenient method to exchange goods and services.\n\nThe \"best\" way to see/do this is debt - by making money - a.k.a contributing your effort/capital/labor, society thus owes you and will provide you with goods and services in exchange. This gets bothersome quite quickly without a common unit.\n\nSo, gold and precious metals came to be. Still relatively objectively worthless. What if the future generation says fuck that, stop trading gold/receiving gold in exchange for feeding the geriatrics? Well, this illusion of wealth is strong enough that gold going out of style is borderline unthinkable. Sadly, humans are stupid and is willing to chase essentially virtual gold to date.\n\nFiat currency from a stable nation at the very least, try to capture the actual debt-recording nature of currency. The money supply is regulated and controlled to facilitate strong economic growth. Something that gold could not accomplish as the fundamental nature of gold - hard to acquire - hinders trade as the economy scales. Something that crypto very much does not aim to, nor is even capable of, doing.",
                              "score": 5,
                              "created_utc": 1739151022.0,
                              "replies": [
                                {
                                  "id": "mby07z8",
                                  "author": "brotherdaru",
                                  "body": "Ok this makes some more sense, so a bitcoin is worth 100k because it’s just inflated by people believing that it holds value, but the dollar even though it’s also a nebulous paper debt holder is kept in value by creating a set of checks in the supply of money but is ultimately able to loose its value if too many bills are printed but crypto with a set number of coins is volatile because the fiat government will not recognize it as competing currency and this is not able to hold a fixed value?",
                                  "score": 0,
                                  "created_utc": 1739151689.0,
                                  "replies": [
                                    {
                                      "id": "mby28fc",
                                      "author": "24111",
                                      "body": "That's why we have hyper inflation - when the regulators saw the money printer and go ham.\n\nThe bitcoin problem is even more nefarious - though it's the same problem with overinflated stock market and other asset market. We have a metric ton of \"imaginary\" wealth and it's frankly scary if/when the wake-up call happens.\n\nImagine two hobos. One picks up a rock, proclaims it's an alien artifact, worth 1 million dollars. The others agreed. Thinks a bit. Then said, I like it, I'll buy it off of you. Then he pays 1 million in IOU (I Owe You - actual financial term, and the precursor to modern paper money) and picks up the rock. Then the first one changes his mind, saying that it actually worth more, wants it back, and pays back 2 million IOU. The end result of this convoluted mess? Two millionaire hobos. One with 1 million in IOU, one with 2 million in asset and 1 million liability. Introduced by the newly discovered 2 million-worth(less) asset of the rock in an alleyway!\n\nIn practice, with real money, the one losing is the one holding the asset at the end. Replace it with real money and actual millionaires, one guy is indeed 1M richer. And the other is presumably 1M richer as long as the asset holds value.\n\nApply said picture to crypto, and go figure. Everyone's rich... til the bubble crashes.",
                                      "score": 3,
                                      "created_utc": 1739152499.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "mbzqc9b",
                              "author": "afurtivesquirrel",
                              "body": "The cash of the US is backed by the might of the US. Particularly, it's backed by a stable demand for USD. \n\nMoney is only valuable so long as people want it. \n\nIn a sense, you're right in that people want dollars = people want bitcoin = both are valuable.\n\nBut the difference comes from _why_ they want them. \n\nThe main reason people want crypto for speculation purposes. Thats a very unstable demand which means a very unstable price.\n\nThe main reason people want USD is to pay for real shit in their lives and - crucially - to pay their taxes. Uncle Sam taxes everything and he only accepts payment in USD.\n\nAs long as the federal government exists, collects taxes, and only accepts payment in USD, then there will always be demand for USD and thus it will always have value.",
                              "score": 1,
                              "created_utc": 1739180887.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mbyrewe",
                      "author": "ritchie70",
                      "body": "It’s “trust me bro” from the government of the biggest economy in the world, with the most capable military in the world.\n\nThat’s a little different from the collective delusion that a unique scrap of data and math is somehow worth $97,000.",
                      "score": 5,
                      "created_utc": 1739161692.0,
                      "replies": []
                    },
                    {
                      "id": "mbz6526",
                      "author": "ManOf1000Usernames",
                      "body": "Its backed by peoples faith in the nation issuing it, divided by how much they print. Plus the fact you have to pay taxes in dollars.\n\n\nAlso, every electronic coin is denonimated in dollars, is that not proof enough of the value of the dollar?",
                      "score": 2,
                      "created_utc": 1739168590.0,
                      "replies": []
                    },
                    {
                      "id": "mc0nne2",
                      "author": "farrago_uk",
                      "body": "Other replies miss the two most important drivers of stability in the dollar:\n\n1. You must pay your US taxes in dollars.\n2. The US government pays its bills in dollars.\n\n(1) means there is a steady demand for dollars from everyone (companies and people), and (1) & (2) mean the US government has a vested interest in the USD remaining strong (hence eg the application of soft & hard power to retain the primacy of the petrodollar, laws against forgery, management of interest rates & government debt, etc). \n\nCrypto, lithium futures, etc have none of those underpinnings.",
                      "score": 1,
                      "created_utc": 1739197129.0,
                      "replies": []
                    },
                    {
                      "id": "mbxy710",
                      "author": "possibly_oblivious",
                      "body": "> But so is the dollar? \n\ngold? idk about trust me bro on that one.",
                      "score": -4,
                      "created_utc": 1739150991.0,
                      "replies": [
                        {
                          "id": "mbxyzb3",
                          "author": "brotherdaru",
                          "body": "What I was saying and I said badly is that the dollar is just working on trust, not anything tangible, I’ve been told that it’s based on products made, but there are other countries where their money became worthless even with product, they have resources, they have gold but their economy is in the toilet and their money has no value anymore, how is paper money not the same as crypto? Aren’t they both just holding value as long as there is trust in it?",
                          "score": 3,
                          "created_utc": 1739151269.0,
                          "replies": [
                            {
                              "id": "mbyh52w",
                              "author": "earthman34",
                              "body": "Because the dollar is backed by the vast wealth and economic power of the United States, not some 3rd world pissant dictatorship that prints and hands out money like candy. The US government is actually pretty stingy with money. Ask anybody on Social Security.",
                              "score": 1,
                              "created_utc": 1739157797.0,
                              "replies": [
                                {
                                  "id": "mbyjolv",
                                  "author": "brotherdaru",
                                  "body": "Dude ohh my god could you be more “ merica! White power!!” Chill with the name calling.",
                                  "score": 0,
                                  "created_utc": 1739158712.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mby4jp0",
                  "author": "money_loo",
                  "body": "You calling it anonymous really hammers home you have no fucking clue what you’re talking about and are only ignorantly spitting the common provocative talking points around it. \n\nNo worries though you’re in r/Gadgets , a bastion of gadget and technology *hate* that will cloak and protect you here in your safe space, so go off then.",
                  "score": -30,
                  "created_utc": 1739153524.0,
                  "replies": [
                    {
                      "id": "mby7cnc",
                      "author": "None",
                      "body": "> You calling it anonymous really hammers home you have no fucking clue what you’re talking about and are only ignorantly spitting the common provocative talking points around it. \n\nWhat a low effort crypto apologist post. \n\nAll scammers use crypto.  It can easily be transferred pseudonymously in ways that can't be frozen by governments.  Bitcoin may not be anonymous but it can easily be used by scammers with a little bit of effort to launder it.  It costs like 1-2% to launder stolen bitcoin.  \n\nPeople call it anonymous as a short hand.  Because, with a little bit of effort, it is anonymous.  \n\nThe only thing crypto is good for is scams and illegal activity, and speculation.  Any real world use cases are few and far between.  The one that gets trotted out like a show pony every time someone needs a straw to grasp at is remittances - again, because crypto makes it easier to avoid government scrutiny if thats needed.",
                      "score": 11,
                      "created_utc": 1739154532.0,
                      "replies": []
                    },
                    {
                      "id": "mby7hwj",
                      "author": "earthman34",
                      "body": "Monero isn't anonymous? They're going to be disappointed to hear that.",
                      "score": -1,
                      "created_utc": 1739154582.0,
                      "replies": [
                        {
                          "id": "mby94v0",
                          "author": "money_loo",
                          "body": "I feel like intentionally picking the one crypto designed to be “anonymous” really only proves my point further…\n\nIt’s like saying “SMS isn’t encrypted? Well Signal is going to be really disappointed to hear that!”  \n\nAlso, even Monero admits that 100% anonymity cannot be guaranteed. \n\nThink about it you silly goose, the entire block chain is a long digital ledger that supports itself, and verifies itself. Being “anonymous” was NEVER THE POINT you pillocks.",
                          "score": -3,
                          "created_utc": 1739155134.0,
                          "replies": [
                            {
                              "id": "mbyb0k4",
                              "author": "earthman34",
                              "body": "There are others besides Monero. Anyway, so name the top ten individual holders of Bitcoin, and the countries they live in. Since it's not anonymous, and nobody is trying to hide anything, this should be easy. Should be public information, in fact.",
                              "score": 0,
                              "created_utc": 1739155722.0,
                              "replies": [
                                {
                                  "id": "mbygvmt",
                                  "author": "morgecroc",
                                  "body": "Who is Satoshi?",
                                  "score": 1,
                                  "created_utc": 1739157705.0,
                                  "replies": [
                                    {
                                      "id": "mbyhc07",
                                      "author": "earthman34",
                                      "body": "When's the last time you ***saw*** Satoshi? LOL. Who are the other 9?",
                                      "score": 1,
                                      "created_utc": 1739157865.0,
                                      "replies": [
                                        {
                                          "id": "mbyuj8d",
                                          "author": "morgecroc",
                                          "body": "I was agreeing with you with that comment noone knows for certain who Satoshi is.",
                                          "score": 1,
                                          "created_utc": 1739163008.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "mbydf7v",
                                  "author": "money_loo",
                                  "body": "Here you go dude. \n\nhttps://river.com/learn/who-owns-the-most-bitcoin/",
                                  "score": 1,
                                  "created_utc": 1739156523.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbxzub8",
              "author": "SnekyKitty",
              "body": "Got banned from the bitcoin subreddit for pointing this out",
              "score": 13,
              "created_utc": 1739151556.0,
              "replies": [
                {
                  "id": "mc5byum",
                  "author": "paulisaac",
                  "body": "the buttcoin subreddit will prolly be good for ya",
                  "score": 1,
                  "created_utc": 1739258636.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbxtbih",
              "author": "FUTURE10S",
              "body": "Nah, I've used it legit once.\n\n\nI bough 20 bucks of dogecoin and then used to tip redditors back in the day. That's what it was meant for.",
              "score": 12,
              "created_utc": 1739149503.0,
              "replies": [
                {
                  "id": "mby0xex",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1739151960.0,
                  "replies": [
                    {
                      "id": "mby17tw",
                      "author": "FUTURE10S",
                      "body": "How do I donate 7.2 us cents to a random Redditor through a bot that lets them withdraw their money from their DMs without paying any fees though",
                      "score": 2,
                      "created_utc": 1739152073.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mby1l1t",
                  "author": "HughJorgens",
                  "body": "Hmm that happened to me once.  I wonder if it was you.",
                  "score": 1,
                  "created_utc": 1739152228.0,
                  "replies": [
                    {
                      "id": "mby2eon",
                      "author": "FUTURE10S",
                      "body": "50/50 odds, either it was me or it wasn't, but definitely wasn't on this account",
                      "score": 2,
                      "created_utc": 1739152573.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mc1o49m",
                  "author": "adultbaluga",
                  "body": "and then that reddit user stole all of the DOGE",
                  "score": 1,
                  "created_utc": 1739208347.0,
                  "replies": [
                    {
                      "id": "mc30v02",
                      "author": "FUTURE10S",
                      "body": "oh no back then that was like, what, $80 of DOGE? Nobody tipped more than a few cents at a time and I presume people withdrew moneys",
                      "score": 1,
                      "created_utc": 1739225225.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbyqkpq",
              "author": "ritchie70",
              "body": "You forgot about using absolutely insane amounts of energy.",
              "score": 5,
              "created_utc": 1739161353.0,
              "replies": []
            },
            {
              "id": "mc3n35c",
              "author": "Fenix_one",
              "body": "You know what bitcoin ETFs are, right?",
              "score": 2,
              "created_utc": 1739234636.0,
              "replies": []
            },
            {
              "id": "mby3phs",
              "author": "PM_ME_YOUR_PAUNCH",
              "body": "I think crypto that's actually used as currency only accounts for something like 4% off all existing cryptocurrency.",
              "score": 2,
              "created_utc": 1739153161.0,
              "replies": [
                {
                  "id": "mc3nfn6",
                  "author": "Fenix_one",
                  "body": "Look up Gresham's law, genius",
                  "score": 1,
                  "created_utc": 1739234753.0,
                  "replies": []
                },
                {
                  "id": "mby4roq",
                  "author": "money_loo",
                  "body": "According to the latest data it’s being used for something like 10% of all transactions in El Salvador. \n\nThe Central African Republic has made it legal tender and use it as well. \n\nPeople just like to hate on stuff because it makes them feel things, and that’s better than being numb all the time I guess.",
                  "score": -8,
                  "created_utc": 1739153627.0,
                  "replies": [
                    {
                      "id": "mbyavz5",
                      "author": "baithammer",
                      "body": " Because it's not a secured currency, it's a speculative commodity.",
                      "score": 10,
                      "created_utc": 1739155681.0,
                      "replies": [
                        {
                          "id": "mc3p65i",
                          "author": "Fenix_one",
                          "body": "Which currencies are \"secured\"?",
                          "score": 2,
                          "created_utc": 1739235344.0,
                          "replies": []
                        },
                        {
                          "id": "mbyd3jb",
                          "author": "money_loo",
                          "body": "Doesn’t the SEC treat it like one? Or at the very least is legally leaning in that direction?\n\n>\tSecurities vs. Commodities: The SEC has taken the stance that many cryptocurrencies, especially those issued through Initial Coin Offerings (ICOs), could be classified as securities. This determination is often based on the Howey Test, which defines a security as an investment of money in a common enterprise with an expectation of profits to be derived from the efforts of others.\n\t•\tExample: In the case of SEC v. W.J. Howey Co., if a token or coin sale meets these criteria, it might be regulated as a security.",
                          "score": -6,
                          "created_utc": 1739156413.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mbyf1ar",
                      "author": "belavv",
                      "body": "10% of all transactions in El Salvador? That's a load of bullshit. They are basically abandoning it.",
                      "score": 7,
                      "created_utc": 1739157074.0,
                      "replies": [
                        {
                          "id": "mbyg6hc",
                          "author": "money_loo",
                          "body": "The exact number last year was 8%, and it’s been declining year over year, lol, so it’s not looking great, but people are for sure using it. \n\nI also just read Japan uses it as a legal tender, so that’s pretty neat.",
                          "score": -5,
                          "created_utc": 1739157462.0,
                          "replies": [
                            {
                              "id": "mbyqkoe",
                              "author": "belavv",
                              "body": "I googled it. 8% of residents used Bitcoin for a transaction last year in El Salvador. That is a lot different than 8% of ALL transactions in El Salvador were done using Bitcoin.",
                              "score": 10,
                              "created_utc": 1739161353.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mc2mfb9",
              "author": "None",
              "body": "Fun fact: Bitcoin mining accounts for close to 1% of the entire planet's electricity usage.",
              "score": 2,
              "created_utc": 1739218862.0,
              "replies": [
                {
                  "id": "mc3nj15",
                  "author": "Fenix_one",
                  "body": "What's the problem with that?",
                  "score": 0,
                  "created_utc": 1739234785.0,
                  "replies": [
                    {
                      "id": "mc3ppx5",
                      "author": "None",
                      "body": "It's usage is still firmly in the realm of scams, illegal stuff, and just making money by trading on perceived value. That's a lot of energy use for something that doesn't add much value to society.",
                      "score": 2,
                      "created_utc": 1739235529.0,
                      "replies": [
                        {
                          "id": "mc3qkm2",
                          "author": "Fenix_one",
                          "body": "Bitcoin is used as a savings vehicle by several hundreds of millions of people. Lots of speculation too, I will concede that. \nBitcoin will probably take away monetary premium from other assets e.g. gold and also real estate - making it affordable again!",
                          "score": 1,
                          "created_utc": 1739235819.0,
                          "replies": [
                            {
                              "id": "mc3ruug",
                              "author": "None",
                              "body": "It existing primarily as a medium for monetary gain based on perceived value, I'd call that a useless commodity. And I say this as someone who has been involved with Bitcoin since before the Mt Gox scandal.\n\nAnd no, that won't make assets like real estate affordable again. Better regulation from the local, state, and federal government is the only thing that will fix that. \n\nGold is fine. It's the literal most stable commodity there is, that's why people invest in it at pretty much all income levels.",
                              "score": 0,
                              "created_utc": 1739236248.0,
                              "replies": [
                                {
                                  "id": "mc3su3s",
                                  "author": "Fenix_one",
                                  "body": "How is gold stable if its price was 1 200 dollars a few years ago and now it is almost 3 000? But I guess volatility to the upside is ok. Maybe that's why people like bitcoin too",
                                  "score": 2,
                                  "created_utc": 1739236574.0,
                                  "replies": [
                                    {
                                      "id": "mc40rlu",
                                      "author": "None",
                                      "body": "Yes, that's how investing works. It's a commodity that steadily rises in value at a slightly faster pace than inflation. Volatility implies unpredictability, and gold's value as an investment is its predictability and lack of aggressive up/down swings.\n\nIf the value of gold didn't increase faster than inflation, it wouldn't be an investment..",
                                      "score": 1,
                                      "created_utc": 1739239236.0,
                                      "replies": [
                                        {
                                          "id": "mc41fzp",
                                          "author": "Fenix_one",
                                          "body": "So what happened to gold between 1980 and 2000?",
                                          "score": 2,
                                          "created_utc": 1739239464.0,
                                          "replies": [
                                            {
                                              "id": "mc42t0g",
                                              "author": "None",
                                              "body": "We had a very stable outlook on the stability of Western economies and currencies. Gold prices get volatile when the economy is safe, and steadily rise when it's not. I didn't say it has always been safe and stable, but it's quite literally used as a safe-haven investment. Right now there's an enormous amount of uncertainty, inflation, and global turmoil which means gold is going to be on a slow and steady rise",
                                              "score": 1,
                                              "created_utc": 1739239916.0,
                                              "replies": [
                                                {
                                                  "id": "mc79ogm",
                                                  "author": "Fenix_one",
                                                  "body": "> If the value of gold didn't increase faster than inflation, it wouldn't be an investment..\n\n\nWhat was the cumulative inflation between the years 1980 and 2000?",
                                                  "score": 2,
                                                  "created_utc": 1739289854.0,
                                                  "replies": [
                                                    {
                                                      "id": "mc7sw1p",
                                                      "author": "None",
                                                      "body": "> I didn't say it has always been safe and stable, but it's quite literally used as a safe-haven investment.\n\nIf you don't believe me, Google \"what is the most common safe-haven commodity in the world?\"",
                                                      "score": 1,
                                                      "created_utc": 1739295287.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbzcmfp",
              "author": "Omaha_Poker",
              "body": "To be fair, Bitcoin was the only thing that allowed me to pay my bills and mortgage in the UK when I was falsely accused of money laundering whilst abroad. I had no access to my bank account, credit card or any other assets. I couldn't even buy a plane ticket. In the end, I was found not guilty but still, it was a very stressful experience.",
              "score": 2,
              "created_utc": 1739172232.0,
              "replies": [
                {
                  "id": "mc22z8t",
                  "author": "BevansDesign",
                  "body": "99% of Bitcoin usage gives the other 1% a bad reputation.",
                  "score": 2,
                  "created_utc": 1739212596.0,
                  "replies": [
                    {
                      "id": "mc3nn5d",
                      "author": "Fenix_one",
                      "body": "You know that bitcoin ETFs are popular, right?",
                      "score": 2,
                      "created_utc": 1739234824.0,
                      "replies": []
                    },
                    {
                      "id": "mc3aasa",
                      "author": "Omaha_Poker",
                      "body": "I guess we shouldn't look too deeply into how US dollars are used to buy drugs, launder or used for corruption ;)",
                      "score": 1,
                      "created_utc": 1739229881.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbz8ff6",
              "author": "alidan",
              "body": "go look at the bullshit that credit card companies and banks to to people running legitimate businesses, cryptocurrency is a great way to transfer monetary value though there are issues with that as well, its less fucking with you because they hate you issues and more just shit is complex issues.",
              "score": 0,
              "created_utc": 1739169834.0,
              "replies": [
                {
                  "id": "mbz9g4k",
                  "author": "DoubleJumps",
                  "body": "Credit card companies and Banks being shit doesn't suddenly make cryptocurrency be the thing that people told us it would be 16 years ago.\n\nWe've all heard the sales pitch. It never happened.",
                  "score": 9,
                  "created_utc": 1739170399.0,
                  "replies": [
                    {
                      "id": "mbzc28d",
                      "author": "alidan",
                      "body": "crypto was sold as a replacement for money in digital transactions, after that it rebranded to block chain for nearly every other stupid as hell function like nfts.\n\nits use as an intermediary for monetary transactions is still the one place crypto can/does excel at.",
                      "score": -1,
                      "created_utc": 1739171903.0,
                      "replies": [
                        {
                          "id": "mbztj8v",
                          "author": "Pizza_Low",
                          "body": "My objection with crypto is a few reasons.\n\n1. as others have pointed out, it's almost impossible today to have retail transactions with crypto. With massively wild swings in value, it's a poor place to story money. \n\n2. Which coin do you trust and use for transactions? There are a lot of completing crypto currencies. https://crypto.com/price for example. Some of them make investing in Zimbabwean dollar\na safer bet. \n\n3. With fiat currency such as ones backed by the faith in the government or one backed by hard commodities. Government either prints more money to replace money stored under a mattress and lost in a house fire, or prints more money to keep liquidity or inflation at a target rate (in theory) Or the gold is always recoverable.\n\nWhat happens with crypto wallets lost to forgotten passwords, data loss/corruption, etc? Over a sufficient timeline the available supply approaches zero. How is that a good thing?",
                          "score": 1,
                          "created_utc": 1739182913.0,
                          "replies": [
                            {
                              "id": "mc0au1y",
                              "author": "alidan",
                              "body": "you don't keep money in crypto you trade and cash out immediately. granted I don't know which one is currently the best one for doing this, looking at a site which only takes crypto, these are the ones it trades in\n\nBitcoin, Bitcoin Cash, Dai, Dogecoin, Ethereum, Litecoin, and USDC.\n\nanother one only works in bitcoin cash, \n\n>What happens with crypto wallets lost to forgotten passwords, data loss/corruption\n\nwhat happens to cash that falls out of your pocket? that gets lost in a fire?\n\nin a crypto that is limited in amount, it makes the rest more valuable in theory, in one where they can dump more in (if there is one like this) nothing really happens. I know there were a few that tied their worth to the usd but don't know if anything came of those. \n\nI personally don't like that crypto became a reliable backup currency method, credit card companies and banks forced this by demanding people bend to their morals, not legal requirements or laws. \n\nthen if you go with a payment processor who isnt one of the major what, 5, you pay more money for worse service, the only industry where the best service is the cheapest to use but will drop you for any reason they see fit.",
                              "score": 1,
                              "created_utc": 1739192144.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mby8bae",
              "author": "gratefulyme",
              "body": "I've had 2 major sales where using bitcoin would have been much better than what I had to do. The first was a car purchase. I had to go to the bank and get money out of my account to hand the dealer a check, then had to wait for them to clear it before they'd tell me it was good for the downpayment. If they accepted bitcoin I would have been cleared in 1 hour. The next was my house downpayment. Same sort of situation, large money transaction, had to pay someone to middleman the finances basically and it was a multiple day long process involving fees. With bitcoin it would have been 1 hour and cost maybe a few bucks in fees.  \n\nIf bitcoin were widely used, it'd have great applications all over especially for businesses and for larger transactions. Banks don't want to lose their share of transaction fees, so they're doing their damndest to keep people away from it.",
              "score": -10,
              "created_utc": 1739154855.0,
              "replies": [
                {
                  "id": "mbzrdpa",
                  "author": "afurtivesquirrel",
                  "body": "This is so wrong, I'm sorry.\n\nIt's not about transaction fees and the banks keeping them. It's about KYC and AML legislation. With a side of general Fraud prevention. \n\nThe reason you pay a middleman when buying your house isn't \"so the bank can collect its fees\", it's so that when you transfer $20k of cash, you can be reasonably confident that the other person won't just skip off with your money and rip you off.\n\nTechbros *love* how easy and regulation-free it is to make huge transfers of money with crypto until something goes wrong and suddenly it's all \"why is there no one I can turn to to for help\" and \"there should be a rule that protects people from this\".\n\nWhich, guess what, there was. You just went out of your way to circumvent it by using crypto.",
                  "score": 3,
                  "created_utc": 1739181542.0,
                  "replies": [
                    {
                      "id": "mc35cy7",
                      "author": "gratefulyme",
                      "body": "KYC is in place with bitcoin. When you're transferring 20k of cash, you have a contract in place, if someone skipped off with your money they'd be prosecuted for that, same way as if a bank did it. You don't just get rid of a contract because you're changing how you're paying... When people are falling for crypto scams, there are people to turn to and there are rules to protect people, have you not read the news about what happens next? There's multiple people in trouble for crypto issues, what world do you live in where you think nobody gets in trouble for financial schemes?",
                      "score": 1,
                      "created_utc": 1739227392.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mby921i",
                  "author": "DoubleJumps",
                  "body": "But it's not used for those things. That's the point. What it is used for is investment scams and illegal purchases, and institutions that deal in big money purchases don't want your Bitcoin at all.\n\nHell I can't go down to my grocery store and pick up food with Bitcoin.  \n\nIf this was going to do what people had promised it would have done way back when it started, we would be somewhere by now other than seeing new crypto scams every few hours, and investment cults.",
                  "score": 9,
                  "created_utc": 1739155109.0,
                  "replies": [
                    {
                      "id": "mbya4sk",
                      "author": "money_loo",
                      "body": "You’re just all up in this thread proving how little you know about this whole subject my dude. \n\nTons of business accept crypto. \n\nMicrosoft accepts it for some services. \n\nAT&T has been taking crypto since 2019. \n\nAMC Movie theaters takes it for tickets and concessions. \n\nOverstock, Home Depot, Whole Foods, all of these places and more will happily take your “worthless” crypto that only scammers apparently need or want.",
                      "score": -5,
                      "created_utc": 1739155448.0,
                      "replies": []
                    },
                    {
                      "id": "mbyduuu",
                      "author": "gratefulyme",
                      "body": "Yes, but they COULD do this. In fact, if I had been able to use btc for my car, they would have gotten 3 bitcoins, and if my mortgage company had accepted it they'd have gotten 10+. Instead I just used money I had in my bank account. You'd think a few transactions like that they'd have looked into it by now...Worked out for me in the end, but to say it's pointless to use bitcoin for certain transactions when there's plenty of examples of good uses for it is just untrue. Anything you had to wait for more than an hour to verify funds, bitcoin fixes that. Anything where you pay more than a dollar or two on a transaction fee, bitcoin fixes that. If there was widespread adoption, you COULD go to your grocery store and use it for food. Things haven't gone down that way because oh, credit card and banks LOVE the transaction fees they get and would lose if btc became a common payment method.",
                      "score": -7,
                      "created_utc": 1739156675.0,
                      "replies": [
                        {
                          "id": "mbye8lz",
                          "author": "DoubleJumps",
                          "body": "They could also start accepting rare Pokemon cards for groceries, but they're not.  \n\nHell even some companies that have started taking Bitcoin have had to stop for periods because of the volatility.  \n\nIt's been long enough. If this was going to do what people fantasized about it doing, we'd see more than this, but we don't.  Cryptocurrency as a whole is buried under a cloud of scams and fraud.  That's where it went.\n\nI also didn't say it was pointless, you put that in my mouth, I just said that cryptocurrency has never lived up to the promise of cryptocurrency.",
                          "score": 9,
                          "created_utc": 1739156804.0,
                          "replies": [
                            {
                              "id": "mbykk4t",
                              "author": "gratefulyme",
                              "body": "Pokemon cards are not currency. Cryptocurrency is currency. You're conflating trading things of value with currency. Also, pokemon cards don't move as easily as currency, so that's also just silly.... \n\n  \nThe longer companies hold off not using crypto, the more the smaller businesses that do accept it gain. Once enough realize they're missing out, it'll become more and more widespread. There's a reason so many countries are keeping it whether public or not.",
                              "score": -4,
                              "created_utc": 1739159034.0,
                              "replies": [
                                {
                                  "id": "mbyl3nj",
                                  "author": "DoubleJumps",
                                  "body": "Cryptocurrency doesn't move as easily as currency. That's the entire point. I can't use cryptocurrency the same places and the same way I use money after more than a decade and a half. It's not gaining real traction as a currency for regular use, but it is as a pseudocultish investment vehicle and a methodology for scams.  You're not going to really get people on board with using this as an interchangeable replacement for a dollar when there's a new story about people getting ripped off because of crypto scams every few days.  \n\nI don't know how many more times I have to keep saying that before you notice.\n\nPointing out that people could use it in one way has literally no value when people aren't using it that way and aren't really making a real effort to do so.  So long is the easiest way to use cryptocurrency as money is to just turn it into actual currency first, then materially it's no different than any other non-cutrency item you can sell for cash to fuel a purchase.",
                                  "score": 6,
                                  "created_utc": 1739159237.0,
                                  "replies": [
                                    {
                                      "id": "mbytzdl",
                                      "author": "gratefulyme",
                                      "body": "Crypto, more specifically btc, moves EASIER than regular currency. It's all digital, always. There's nothing more you need to do than log into your account and send it to another account/wallet. You never have to go to a bank, you never need a physical card, you never have to go to an ATM. For every crypto scam, there's thousands more with FIAT currency. Don't want scammed, don't fall for scams right? If you look at the scammy crypto, it's the same as every other FIAT scam, you think it was a good idea to put money into hawk tuah coin? Trump coin? You think it's smart to send money to a Nigerian prince? \n\nPeople didn't like credit cards when they came out either. They liked cash and checks. The only reason banks pushed credit cards was because they made money on them. The reason banks don't like crypto is because they don't make money on it every time it's used. Same situation. You might personally not like crypto, maybe you feel you missed the boat or fell for a scam at some point. Being adamantly against crypto for no reason other than 'WELL YOU CAN'T USE IT BECAUSE YOU CAN'T USE IT!' is another way of saying 'the banks are winning so let's not change things', while also being untrue.",
                                      "score": -1,
                                      "created_utc": 1739162771.0,
                                      "replies": [
                                        {
                                          "id": "mbyuauz",
                                          "author": "DoubleJumps",
                                          "body": "Again, if I want to go use crypto to buy my groceries I've got to go turn that shit into actual money. \n\nYou can talk about how great it could be or how easy it is, but at the end of the day that's what I have to do to turn crypto into some milk and cereal at my grocery store.  \n\nYou're just pushing the same pitch that you guys had 16 years ago that never came to pass.",
                                          "score": 6,
                                          "created_utc": 1739162907.0,
                                          "replies": [
                                            {
                                              "id": "mc3ojxk",
                                              "author": "Fenix_one",
                                              "body": "Bitcoin is more accepted than gold which has been around for 6 000 years and has 10x  larger market cap than bitcoin.\nWe'll get there",
                                              "score": 2,
                                              "created_utc": 1739235135.0,
                                              "replies": []
                                            },
                                            {
                                              "id": "mc35tef",
                                              "author": "gratefulyme",
                                              "body": "If you want to go to the grocery store and pay in cash but you don't have cash what do you do then? The exact same thing you'd have to do if you wanted to pay with crypto but the grocer doesn't accept it. What do you do if you want to pay in cash but the grocer doesn't accept cash?  \n\nI'm fine with having the same pitch for the last 16 years, folks who got into crypto 16 years ago are doing a lot better than the folks who have naysaid it for 16 years. In the end it worked out pretty well that I couldn't pay for my car with a few bitcoins, worked out pretty well I couldn't put a down payment down on my house with 10 bitcoins. It'd be great if the system changed overnight, but while it's not, things are working out alright in the meantime :)",
                                              "score": 1,
                                              "created_utc": 1739227615.0,
                                              "replies": [
                                                {
                                                  "id": "mc366vi",
                                                  "author": "DoubleJumps",
                                                  "body": "> If you want to go to the grocery store and pay in cash but you don't have cash what do you do then? The exact same thing you'd have to do if you wanted to pay with crypto but the grocer doesn't accept it.\n\nI use my debit card, which is functionally the same as cash.  \n\nYou can take everything I just used and replace it with debit cards and it still stands.  My grocery store takes it, they don't take crypto.  \n\nAlso, they all take cash.  They all take cash and cards.  Your hypotheticals keep being \"WELL IF THINGS WERE TOTALLY DIFFERENT THEN CRYPTO WOULD MAKE SENSE!\" which doesn't work because they aren't totally different and crypto doesn't make sense. \n\n>I'm fine with having the same pitch for the last 16 years\n\nThat's cool.  After a point I start to suspect whether people lied to me about what crypto would actually be for, but you do you.  Hey, some people still think trickle down economics needs more time, too.",
                                                  "score": 1,
                                                  "created_utc": 1739227799.0,
                                                  "replies": [
                                                    {
                                                      "id": "mc371n3",
                                                      "author": "gratefulyme",
                                                      "body": "So if they don't have a card reader, you just wave your card and it works somehow? They do not all take cash, and some places do not take cards at all still. The city I'm in has both options, cashless and cash only, for basically everything from groceries to bars. And yes, the conversation is 'if things were different, they'd be different'. Your argument seems to be 'they'll never be different, there's no point, it's not that way', mine is 'they could be different, it'd be better'.  \n\nCrypto is a form of currency. Until that is widely accepted, it's being used as a store of wealth. Maybe it'll catch on as a more widespread form of currency the same way credit did, until then it stores wealth in a similar way as gold. Gold started off as a currency then moved to a store of wealth, crypto is used as a currency and as a store of wealth.",
                                                      "score": 1,
                                                      "created_utc": 1739228225.0,
                                                      "replies": [
                                                        {
                                                          "id": "mc37d4p",
                                                          "author": "DoubleJumps",
                                                          "body": "You've hit the point where you're trying to make up a scenario where a modern grocery store in the United States doesn't take card and I have to completely forget to bring cash with me.  And you're doing this to try to make some point about how crypto actually is fine. Even though factually, in the reality we both live in, I can't go to a grocery store and get my groceries with crypto, but the nearest 1000 grocery stores to me all take cards and cash. \n\nHell, your situation is essentially just arguing that if I have no money I would have the exact same problem buying groceries as I would buying groceries with crypto, which just shows how worthless it is as money. \n\nYes, you're right, if I go to a grocery store with no way to pay, I'd be in the same position as if I went to the grocery store with crypto to try and buy groceries.  Good job, you've proven my point. \n\nI shouldn't have to explain how ridiculous this is, but at this point I don't know if you'd understand it if I tried.\n\nMy argument was that 16 years ago you guys were telling us that this would be usable just like money, and 16 years later it's not and it's primary purpose seems to actually be to fleece rubes in investment scams.  \n\nThat's the point. That the future of crypto you all tried to sell everybody on isn't the future you guys built for crypto, but you're still trying to sell us the same story.",
                                                          "score": 1,
                                                          "created_utc": 1739228384.0,
                                                          "replies": [
                                                            {
                                                              "id": "mc38ev6",
                                                              "author": "gratefulyme",
                                                              "body": "I'm making the point that there are situations with FIAT that are identical to the situations with crypto. I actually can go to the grocery store and pay with crypto, I can also go to multiple stores and turn my crypto into cash, or purchase crypto. By saying that you're always 100% able to pay in 100% of situations and with crypto you can't ever use it to pay for anything everywhere, you're making a false assumption. Crypto is just as easily turned into FIAT as it is with the banking industry, and there are situations where the hurdles for doing so are identical to the banking industry. \n\n  \nI don't think anyone who's being fleeced by bitcoin scams are any different than people who would be fleeced by FIAT scams. FIAT scams have always existed, they still do. I highly highly doubt that financial scams have increased or decreased in recent times, I'd bet there's a pretty straight timeline on victims of financial crimes, possibly with FIAT schemes rising due to the older generation falling for them more often. Nothing will ever get rid of financial schemes, there has always been ways to part a fool with their money, the form of money doesn't change the equation. \n\n  \nThe story with crypto has always been the same. It's in the name, cryptoCURRENCY. It's meant to be used as a currency. It's easy to move around, it's low cost to move around, which if you check my original comment is how this conversation started.",
                                                              "score": 1,
                                                              "created_utc": 1739228911.0,
                                                              "replies": [
                                                                {
                                                                  "id": "mc38s47",
                                                                  "author": "DoubleJumps",
                                                                  "body": "You're ultimately arguing that if I go to a store that doesn't take ubiquitous forms of money or I go without money that I'd have just as hard a time paying as I do if I was trying to pay with crypto now.  You're arguing that crypto is as viable as going to the store without money, you just don't know it, somehow. \n\nThat just proves my point that crypto isn't what you all sold us on it being 16 years ago, when you were saying it would be a viable alternative to actual money.  It's not.  You guys specifically built it up as an investment vehicle and not an actual viable currency.",
                                                                  "score": 1,
                                                                  "created_utc": 1739229101.0,
                                                                  "replies": [
                                                                    {
                                                                      "id": "mc3d9vu",
                                                                      "author": "gratefulyme",
                                                                      "body": "I'm not arguing that at all. You brought up that crypto is difficult to utilize, and that it's not usable. I pointed out that in some situations, FIAT is equally as difficult to utilize. You said that to use crypto, I have to first turn it into FIAT, then use the FIAT to pay. I pointed out that to use FIAT, there are situations where you have to first translate it into another form of FIAT, the same way crypto would need translated into a form of FIAT. The situations are identical, you are ignoring that rather than admitting 'yes, there are situations where FIAT has gaps'. Ever want to pay your friend but don't have cash? Now you're using a transaction service. You understand that you could just as easily use crypto in that situation right? It's the exact same situation as if you're at a business and they only/don't take cash. Sure you can turn around and go to another business. Same as if a business only accepted crypto. Just because you can't grasp that the difficulties of using crypto are identical to the difficulties with using FIAT in those situations does not mean they do not exist. I've personally be in a situation where I HAD to have cash and didn't, so I couldn't buy something. I've also been in a situation where I HAD to have card and didn't, so I couldn't buy something. You might not have ever experienced those situations, but to deny their existence does not mean they don't exist. FIAT has gaps, as does all methods of transacting business. Saying crypto isn't a viable form of currency because it has situations where its use can be a hurdle is the same as saying FIAT isn't a viable form of currency because it has situations where its use can be a hurdle. \n\n  \nI don't know who you're saying as 'you guys', but bitcoin has heavily been pushed as a currency more than a store of value. What's the most famous news story about bitcoin that immediately comes to mind? For most people that's going to be the news story of someone buying a pizza with bitcoin, or people buying drugs with bitcoin. Both of those are examples of bitcoin being used as currency. The store of value has been a recent adaptation, mostly pushed by finance people in the last 5 or so years.",
                                                                      "score": 1,
                                                                      "created_utc": 1739231202.0,
                                                                      "replies": [
                                                                        {
                                                                          "id": "mc3fdng",
                                                                          "author": "DoubleJumps",
                                                                          "body": "> You brought up that crypto is difficult to utilize, and that it's not usable. I pointed out that in some situations, FIAT is equally as difficult to utilize. \n\nYes, by creating a hypothetical so outlandish you'd have to go to extreme effort to encounter it.\n\nTrust me, you convinced me.  You made a stunning argument to crypto being just as useful in real life applications as leaving the house with no means to pay at all. \n\n> the same way crypto would need translated into a form of FIAT.\n\nlol \"crypto is usable as money!  You just have to turn it into useful money first!\"\n\nHahaha, wow. \n\nGood job.",
                                                                          "score": 1,
                                                                          "created_utc": 1739231958.0,
                                                                          "replies": [
                                                                            {
                                                                              "id": "mc3gd1m",
                                                                              "author": "gratefulyme",
                                                                              "body": "These are all hypotheticals... Hypothetically, all businesses take cash and card and crypto. That's not reality. Reality is some business takes all options, some take one option, some take two options. Maybe if you're in a rural town you'd have to go to extreme effort to encounter a variety of these options, but when you live in a city area, all of these options exist, all over.  \n\nIf only you had listened 16 years ago and bought a bit of crypto too eh? You'd be real upset having to turn it into FIAT I'm sure.",
                                                                              "score": 1,
                                                                              "created_utc": 1739232309.0,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "mc3gx9o",
                                                                                  "author": "DoubleJumps",
                                                                                  "body": "My grocery store, in reality, doesn't take crypto.  None of them around me do.  \n\nThat's reality.\n\nAll of them take cash and cards.  \n\nThat's reality.  \n\nI'm not even in a rural area.  \n\nYou are literally writing out arguments for crypto as an alternative currency where you have to turn it into actual money first for it to be useful and think you're doing a good job.",
                                                                                  "score": 0,
                                                                                  "created_utc": 1739232510.0,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "mc44y3m",
                                                                                      "author": "gratefulyme",
                                                                                      "body": "My grocery store does take crypto. So does the gas station around the corner from me. Both also sell crypto. The gas station doesn't take cash though. The smoke store around the corner doesn't take card. The farmer's market doesn't take cards. These are all realities.\n\nYou're literally arguing against having a third option. What's the problem with not having an additional option that's usable in all the current options, with lower costs, easier access for small businesses, faster use for large transactions, and while adoption is taking place is actively increasing in value? This isn't even taking into account the use cases for travel and international business...",
                                                                                      "score": 2,
                                                                                      "created_utc": 1739240633.0,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "mc7y2l6",
                                                                                          "author": "money_loo",
                                                                                          "body": "It’s amazing you’re even still here arguing with a dude so stupid he thinks everyone else is stupid because they understand how crypto works and he’s stuck on how gold **used** to work. \n\nLike, literally we had a dude show up saying everything you already have at the very beginning here, and he STILL thought that guy was being facetious. \n\nLike, what’s even the point of carrying a conversation on with pigeons? Meanwhile my crypto is up 25% just for the week, and we can cash it out anytime to buy shit, or leave it there to go up way more than other investments. \n\nOnly to this person is 5k dollars of crypto suddenly not worth anything. \n\n🙄🙄🙄🙄",
                                                                                          "score": 2,
                                                                                          "created_utc": 1739296733.0,
                                                                                          "replies": []
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbyhi8t",
              "author": "None",
              "body": "[removed]",
              "score": 0,
              "created_utc": 1739157926.0,
              "replies": [
                {
                  "id": "mbyikzx",
                  "author": "DoubleJumps",
                  "body": "Gee, I don't know where I said cash couldn't be used in a scam in that post.  That's weird. \n\nYou know where I can use cash? My fucking grocery store.  You know where I can't use cryptocurrency?  My fucking grocery store.  Or to pay my bills, or to pay my suppliers, but I can use it to buy drugs anonymously online I guess...",
                  "score": 2,
                  "created_utc": 1739158309.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbxwnrk",
              "author": "money_loo",
              "body": "That’s weird because you can literally use ATMs here in the USA that let you convert your crypto into cash and buy stuff at malls and I see it all the time. \n\nAlso, there’s like, that whole country that is running its money with crypto as well, where people are using it literally all the time alongside physical money. \n\nAlso, it’s been a pretty solid investment. Over the last five years bitcoin is up 850%, Ethereum is up 1,042%(!!). \n\nHell, even Litecoin, a less popular crypto, is up almost 60% over five years, which is well above market averages.\n\nSo yeah, maybe they were talking about those things for a reason?",
              "score": -6,
              "created_utc": 1739150494.0,
              "replies": [
                {
                  "id": "mbxxhz3",
                  "author": "bigskymind",
                  "body": "Which country are you referring to? Surely not El Salvador?\n\nhttps://ticotimes.net/2025/02/02/el-salvador-abandons-bitcoin-as-legal-tender-after-failed-experiment\n\n“Literally all the time”?",
                  "score": 8,
                  "created_utc": 1739150752.0,
                  "replies": [
                    {
                      "id": "mbxzpeo",
                      "author": "money_loo",
                      "body": "Thanks for that article, it’s news to me. \n\nIt looks like they are still going to use it and invest in it, they just removed the legal obligation to do so, because they were forced to by the IMF. \n\nSo yes, still literally all the time.\n\n\n>\tBut officials ensure that the government will continue betting on this cryptocurrency, whose price currently exceeds $100,000. El Salvador’s ambassador to the United States, Milena Mayorga, told journalists Thursday, during a bitcoin event in San Salvador, that the law reforms should be seen as an adaptation “to the circumstances.”",
                      "score": -5,
                      "created_utc": 1739151512.0,
                      "replies": [
                        {
                          "id": "mby4v31",
                          "author": "DoubleJumps",
                          "body": "https://reason.com/2024/10/31/a-week-of-failing-to-pay-with-bitcoin-in-el-salvador/\n\nHere's an account from someone who went to El Salvador to try and use bitcoin as money. \n\nSurprise, people didn't want it.",
                          "score": 6,
                          "created_utc": 1739153671.0,
                          "replies": [
                            {
                              "id": "mby7lzs",
                              "author": "money_loo",
                              "body": "That’s unfortunate. \n\nThe reasons they give were: \n\n>\tSome locals shared their reasons for opting out. At Lake Coatepeque, one waiter told me he skipped downloading the app entirely because he \"didn't want to give his personal information to the government.\" In Santa Ana, another waiter said he wasn't interested in bitcoin because he \"didn't understand how it worked\" and had \"no intention of learning.\" Others admitted they were scared by the technical glitches in the Chivo wallet. \n\nWhich will improve with time, thankfully! \n\nIt also mentions in that article that around 10% of people were still using it, so that’s not zero, lol.",
                              "score": -1,
                              "created_utc": 1739154620.0,
                              "replies": [
                                {
                                  "id": "mby8l0c",
                                  "author": "DoubleJumps",
                                  "body": "I feel like you're really hoping people won't read the articles. People keep linking you, because they always say things that are dramatically more negative than you try to spend and you deliberately cut those out. \n\nLike \n\n>A recent survey conducted by Francisco Gavidia University in San Salvador found that 92 percent of Salvadorans don't use bitcoin. This marks an increase from the 88 percent found in a similar study conducted by the Central American University, San Salvador last year.\n\nThe amount of people in the country that used Bitcoin in any capacity fell by a third in a year.  The government gave everybody free Bitcoin to use and even then use still dropped.",
                                  "score": 8,
                                  "created_utc": 1739154947.0,
                                  "replies": [
                                    {
                                      "id": "mbybw56",
                                      "author": "money_loo",
                                      "body": ">\tI feel like you’re really hoping people won’t read the articles. People keep linking you, because they always say things that are dramatically more negative than you try to spend and you deliberately cut those out.\n\n\nThis is ironic! I could say the same for you!\n\n>\t\n>\n>\tLike\n>\n>\t\n>\n>\t\tA recent survey conducted by Francisco Gavidia University in San Salvador found that 92 percent of Salvadorans don’t use bitcoin. This marks an increase from the 88 percent found in a similar study conducted by the Central American University, San Salvador last year.\n\n\nNow you’re just quoting what I pointed out? I said nearly 10% of people were still using it, are you agreeing with me or arguing with me that when I mention that people are technically still using it?\n\n>\tThe amount of people in the country that used Bitcoin in any capacity fell by a third in a year.  The government gave everybody free Bitcoin to use and even then use still dropped.\n\n\nYes, they had many reservations about the amount of information required to sign up and prevent the rampant identify theft of people trying desperately to steal this apparently worthless item no one wants or uses.  \n\nIsn’t that odd? How nobody wanted it so much they were just stealing it like crazy!",
                                      "score": 0,
                                      "created_utc": 1739156005.0,
                                      "replies": [
                                        {
                                          "id": "mbyca33",
                                          "author": "DoubleJumps",
                                          "body": "I'm not going to keep feeding you after this, but you framed it as if this was on an upward trend when the actual data shows a decline. \n\nThis is why you're not doing well here.  Other people can read and you're just pretending presented information says the opposite of what it actually does.",
                                          "score": 4,
                                          "created_utc": 1739156134.0,
                                          "replies": [
                                            {
                                              "id": "mbyfk6e",
                                              "author": "money_loo",
                                              "body": "“You framed it like it was an upwards trend!” - the guy who started this conversation and every other one ITT by claiming that it’s only used for scams or illegal shit, now backpedaling after having to admit it’s being used at all. \n\nI can see why you’d be upset at me for pointing these facts out against your narrative.",
                                              "score": 0,
                                              "created_utc": 1739157249.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mby1gdy",
                  "author": "treesonmyphone",
                  "body": "Heh all these people are so wrong about not being able to use crypto to buy things. Why I regularly trade crypto for a useful currency and make purchases in that. Pay no attention to the middle man in the transaction who makes my crypto usable.",
                  "score": 6,
                  "created_utc": 1739152172.0,
                  "replies": [
                    {
                      "id": "mby36ig",
                      "author": "money_loo",
                      "body": "For real. \n\nAnd I guess we’re also supposed to be angry crypto hasn’t completely changed all of society in 15 years. \n\nThese people are just bitter they didn’t get in on the ground floor. Notice nobody mentions the investment part being way above market averages.  \n\n“WhAt iS It fOr” -these SpongeBob lookin mfers",
                      "score": -3,
                      "created_utc": 1739152935.0,
                      "replies": [
                        {
                          "id": "mby4kl2",
                          "author": "DoubleJumps",
                          "body": "That person was making fun of you and you didn't even notice.",
                          "score": 5,
                          "created_utc": 1739153535.0,
                          "replies": [
                            {
                              "id": "mby5ivb",
                              "author": "JoeyBigtimes",
                              "body": "Because he’s the rube we’re talking about.",
                              "score": 2,
                              "created_utc": 1739153926.0,
                              "replies": [
                                {
                                  "id": "mby9i3h",
                                  "author": "DoubleJumps",
                                  "body": "Even when it was pointed out to him, he still thinks the guy was agreeing with him.",
                                  "score": 4,
                                  "created_utc": 1739155251.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "mby6x00",
                              "author": "money_loo",
                              "body": "The dude talking about everyone here being wrong because he uses crypto to convert to cash and buy things, the very thing I said people are doing, is somehow making fun of me?\n\nSure thing bud.",
                              "score": 1,
                              "created_utc": 1739154383.0,
                              "replies": [
                                {
                                  "id": "mby8eln",
                                  "author": "DoubleJumps",
                                  "body": "The joke was that he's using money to buy things and not crypto and even put the entire last sentence in there to directly highlight the fact that this was a joke and that he wasn't actually using crypto to buy anything.\n\nWhy do you think he was saying to ignore the middleman?",
                                  "score": 2,
                                  "created_utc": 1739154886.0,
                                  "replies": [
                                    {
                                      "id": "mbyc8uo",
                                      "author": "money_loo",
                                      "body": "Them: “Why I regularly trade crypto for a useful currency and buy things with that”\n\nMe: “I see people trade their crypto at atms for cash and buy things in the mall all the time” \n\nYou: “haha they’re making fun of you!”\n\nOkay then.",
                                      "score": 1,
                                      "created_utc": 1739156123.0,
                                      "replies": [
                                        {
                                          "id": "mbycetn",
                                          "author": "DoubleJumps",
                                          "body": "why do you think they said \n\n>Pay no attention to the middle man in the transaction who makes my crypto usable.",
                                          "score": 2,
                                          "created_utc": 1739156178.0,
                                          "replies": [
                                            {
                                              "id": "mbyfrkp",
                                              "author": "money_loo",
                                              "body": "Dude, nearly all transaction services have fees for the convenience, so I’m not sure what you’re getting at.",
                                              "score": 0,
                                              "created_utc": 1739157317.0,
                                              "replies": [
                                                {
                                                  "id": "mbyfx2k",
                                                  "author": "DoubleJumps",
                                                  "body": "Oh man, life has to be really hard for you.",
                                                  "score": 1,
                                                  "created_utc": 1739157370.0,
                                                  "replies": [
                                                    {
                                                      "id": "mbygn33",
                                                      "author": "money_loo",
                                                      "body": "Naw I’m pretty wealthy, healthy and happy! \n\nI’m about to go work out with my wife at the moment, so sorry if I can’t answer you back anymore tonight. \n\nAppreciate your concern though, and I enjoyed this little back and forth we had, even if I don’t agree with pretty much anything you feel or believe, it was still nice to pass the time with some different opinions!\n\nHope you have a good one, as well my dude!",
                                                      "score": 1,
                                                      "created_utc": 1739157620.0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbx5vwy",
          "author": "maharg2017",
          "body": "lol",
          "score": 11,
          "created_utc": 1739141836.0,
          "replies": []
        },
        {
          "id": "mbx63ji",
          "author": "xShooK",
          "body": "China, crypto, scam. The holy trinity.",
          "score": 12,
          "created_utc": 1739141905.0,
          "replies": [
            {
              "id": "mc2hklu",
              "author": "OkOutlandishness6001",
              "body": "Plenty of homegrown crypto scams here. Like from the president for example",
              "score": 1,
              "created_utc": 1739216921.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbxydp4",
          "author": "kungfungus",
          "body": "![gif](giphy|fgKfR2rgRyebu)",
          "score": -2,
          "created_utc": 1739151058.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbwxhqo",
      "author": "ACasualRead",
      "body": "So this article is click baity here. \n\nRetail stores were selling these as new, presumably not knowing they were wiped and rewritten to appear as new when they were in fact used. Seagate did not sell these drives for distribution so idk why they would need to even be involved in this story. \n\nThe real store is who at the retail level bought these used drives from a shady source or who poisoned the supply chain with used drives.",
      "score": 294,
      "created_utc": 1739139193.0,
      "replies": [
        {
          "id": "mbx9s8i",
          "author": "HateChoosing_Names",
          "body": "“Who poisoned the supply chain”. Do you realize the issue here? This is a massive scandal - what if they inserted a virus? What about data exfil, or a known encryption key? Ransomware at the firmware level?\n\nThis is all possible and a tremendous threat to cybersecurity worldwide.",
          "score": 141,
          "created_utc": 1739143155.0,
          "replies": [
            {
              "id": "mbxd8v5",
              "author": "ACasualRead",
              "body": "This isn’t the first time this has happened. Supply chain attacks have occurred before which is why there is greater need to lock it down. Because yes you’re right this is an issue and it does happen. I this cause it was fraud. But it could have been worse.",
              "score": 44,
              "created_utc": 1739144356.0,
              "replies": [
                {
                  "id": "mbxhnlw",
                  "author": "uhgletmepost",
                  "body": "Isn't that how the pager bombs thing happened last year?",
                  "score": 16,
                  "created_utc": 1739145781.0,
                  "replies": [
                    {
                      "id": "mbxhxoa",
                      "author": "ACasualRead",
                      "body": "Exactly how that happened. I worked for a company that produced an AI model a lot of people use right now and I know their security protocols when ordering new servers involves stripped the server down and analyzing every component under a microscope to verify no additional parts were maliciously added during production. \n\nEven when the server is running, it sandboxes the data requests with a security protocol in place that protects against even if the server hardware was compromised. \n\nJust wild stuff. Attacks on the supply chains is a real issue.",
                      "score": 34,
                      "created_utc": 1739145873.0,
                      "replies": [
                        {
                          "id": "mbyf53r",
                          "author": "TheDreamWoken",
                          "body": "Hmm",
                          "score": -2,
                          "created_utc": 1739157108.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mbykj94",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 4,
                  "created_utc": 1739159025.0,
                  "replies": [
                    {
                      "id": "mbzb2jq",
                      "author": "Practical-Custard-64",
                      "body": "It would only wipe the storage. It would not wipe anything malicious in the disk's firmware, so no, a full format would not be enough to eliminate all risk.",
                      "score": 3,
                      "created_utc": 1739171324.0,
                      "replies": []
                    },
                    {
                      "id": "mc1arwl",
                      "author": "AssociateDeep2331",
                      "body": "The NSA had a HDD rootkit in the wild for 15 years before it was detected. You notice some suspicious traffic, conclude you're infected, wipe all your disks, re-install, then get re-infected from malware hiding in the HDD firmware.\n\nThey infected tens of thousands of systems all over China, Russia, etc from the early 00s til it was discovered in 2015. Don't be surprised if China aim to return the favor.\n\nAny serious company will buy direct from the manufacturer or an authorized distributor. However in this case it seems the supply chain of an authorized distributor was compromised. Worrying indeed.",
                      "score": 3,
                      "created_utc": 1739204488.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbxkt7s",
                  "author": "None",
                  "body": "Israel pagers are a good supply chain example 🤗",
                  "score": 5,
                  "created_utc": 1739146838.0,
                  "replies": [
                    {
                      "id": "mbzcwiy",
                      "author": "fckingmiracles",
                      "body": "They were actually produced right with the explosive in it.",
                      "score": 0,
                      "created_utc": 1739172397.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbyhqte",
                  "author": "HateChoosing_Names",
                  "body": "Fraud would be a wonderful cover for something more nefarious.",
                  "score": 2,
                  "created_utc": 1739158012.0,
                  "replies": []
                },
                {
                  "id": "mc2ixvh",
                  "author": "BrickGun",
                  "body": "> Supply chain attacks have occurred before\n\nTechnically, every time my uncle had a bunch of cartons of cigarettes that \"fell off a truck\" in the 70s that was supply chain attack. :P",
                  "score": 1,
                  "created_utc": 1739217446.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbxbg7q",
              "author": "Dick_Lazer",
              "body": "Wait til you learn about Amazon.",
              "score": 11,
              "created_utc": 1739143733.0,
              "replies": []
            },
            {
              "id": "mbxi0lg",
              "author": "ChickenMathematician",
              "body": "Mining ops are looking for new keys",
              "score": 2,
              "created_utc": 1739145899.0,
              "replies": []
            },
            {
              "id": "mc114at",
              "author": "LA_Nail_Clippers",
              "body": "The grey market around electronics has existed for decades. While it could be a vector for attack, the vast majority of the time it's just used for generating profit.\n\nIt's certainly a concern but it's hardly a massive scandal, considering this is one of hundreds of similar supply chain oddities a year.",
              "score": 2,
              "created_utc": 1739201589.0,
              "replies": []
            },
            {
              "id": "mbxt7he",
              "author": "Simmangodz",
              "body": "Yeah it's pretty insane when you take a step back and realize the massive ramifications of this.",
              "score": 1,
              "created_utc": 1739149467.0,
              "replies": []
            },
            {
              "id": "mbytkm9",
              "author": "newInnings",
              "body": "NSA have done that , probably for new drives too",
              "score": 1,
              "created_utc": 1739162598.0,
              "replies": []
            },
            {
              "id": "mc3837y",
              "author": "joeChump",
              "body": "I mean poisoned seems like a good word.",
              "score": 1,
              "created_utc": 1739228747.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbxpusv",
          "author": "PlayingDoomOnAGPS",
          "body": "Tiger Direct stores definitely did shit like this. Almost everything we got was shady as hell. They'd let us run out of hard drives and that aisle would be bare for weeks and then we'd get massive shipments of drives in ESD bags in a plastic clamshell with a paper insert with the barcode and stuff. \n\nOstensibly they were all just OEM, not retail, drives but we always speculated that the reason we didn't have a normal replenishment cycle was because they were buying up massive lots of stuff that failed QC, had been returned or used, fell off a truck, etc. And it wasn't just hard drives. All the DIY PC parts we carried were like that.",
          "score": 12,
          "created_utc": 1739148429.0,
          "replies": []
        },
        {
          "id": "mbxg3qh",
          "author": "Intrepid_Plankton_91",
          "body": "i mean that kind of sounds like what the headline was saying… am i missing something?",
          "score": 16,
          "created_utc": 1739145258.0,
          "replies": [
            {
              "id": "mbxjd2r",
              "author": "VenomsViper",
              "body": "Funny thing is every other time before this that this story came up all the comments were blaming Seagate and anyone that suggested it could be retailers or a bad actor would be down voted to hell and called a shill.",
              "score": 9,
              "created_utc": 1739146350.0,
              "replies": []
            },
            {
              "id": "mbxgupd",
              "author": "ACasualRead",
              "body": "“Seagate distanced itself” I find to be the intentional clickbait. This has nothing to do with Seagate except for it being their brand of drive. They literally have zero reason to accept any responsibility here",
              "score": 1,
              "created_utc": 1739145515.0,
              "replies": [
                {
                  "id": "mbxhi5s",
                  "author": "Intrepid_Plankton_91",
                  "body": "hence them distancing themselves…",
                  "score": 10,
                  "created_utc": 1739145732.0,
                  "replies": []
                },
                {
                  "id": "mbz24qf",
                  "author": "iiiinthecomputer",
                  "body": "If nothing else, if they'd done it they probably would've done it better.\n\nI don't think for a moment they're in any way ethical or decent. But I guarantee they'd flash the drives with a private firmware that reset or hid and adjusted the internal service counters if they did it.",
                  "score": 1,
                  "created_utc": 1739166520.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbx4egv",
      "author": "leuk_he",
      "body": "Why  did crypto farms need large hdd? Were there algorithm that used disk space instead of solving some math algorithm?",
      "score": 22,
      "created_utc": 1739141353.0,
      "replies": [
        {
          "id": "mbxihgb",
          "author": "Kellic",
          "body": "They switched over in 2023 I think to Chia which requires large fast drives over high performance GPU's.",
          "score": 20,
          "created_utc": 1739146051.0,
          "replies": []
        },
        {
          "id": "mbx6jh9",
          "author": "zz9plural",
          "body": "Chia.",
          "score": 12,
          "created_utc": 1739142052.0,
          "replies": [
            {
              "id": "mbzkqri",
              "author": "teovilo",
              "body": "Sesame.",
              "score": 0,
              "created_utc": 1739177277.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbz4kqh",
          "author": "7FFF00C",
          "body": "https://en.wikipedia.org/wiki/Proof_of_space",
          "score": 4,
          "created_utc": 1739167758.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbxfz2k",
      "author": "firedrakes",
      "body": "FYI wd had a issue like this and did a silent national recall of affect USB hdd . Like 2 years ago",
      "score": 12,
      "created_utc": 1739145213.0,
      "replies": []
    },
    {
      "id": "mbytqsg",
      "author": "Doom2pro",
      "body": "Hard drive manufacturers that allow SMART data to be written instead of read only are just as bad as Flash manufacturers that allow capacity to be written instead of read only. What a joke.",
      "score": 7,
      "created_utc": 1739162670.0,
      "replies": [
        {
          "id": "mbzv82q",
          "author": "N2-Ainz",
          "body": "Removing it would be dumb. What if your connection is broken and now your HDD throws tantrums because it thinks sth horrobly went wrong with it? That's why you can wipe SMART data, otherwise large datacenters wouldn't be very happy with sending stuff back to Seagate for simply wiping SMART data.",
          "score": 4,
          "created_utc": 1739183971.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbxpvyx",
      "author": "Dazd_cnfsd",
      "body": "The suppliers that provided the drives are not named in the article.",
      "score": 8,
      "created_utc": 1739148439.0,
      "replies": [
        {
          "id": "mbyvzoc",
          "author": "hindusoul",
          "body": "Named, blamed and written off as reliable places to buy…",
          "score": 2,
          "created_utc": 1739163637.0,
          "replies": [
            {
              "id": "mbznljc",
              "author": "XandaPanda42",
              "body": "Sure wish I knew who to do that to then. Or are they just gonna keep getting away with this crap?",
              "score": 2,
              "created_utc": 1739179124.0,
              "replies": [
                {
                  "id": "mbzvep1",
                  "author": "N2-Ainz",
                  "body": "Literally everyone in Germany had this issue. Even official partners which meant you couldn't buy from any shop at all in Germany. The question is what distributor sold them and how literally every major shop had these drives.",
                  "score": 4,
                  "created_utc": 1739184085.0,
                  "replies": [
                    {
                      "id": "mc01on4",
                      "author": "XandaPanda42",
                      "body": "Yeah I'd read something about that. The article mentions it had been happening in other countries as well, including Aus. I hadn't seen anyone here reporting on it, so I was looking for any reference to it being done by any of the major retailers here.",
                      "score": 1,
                      "created_utc": 1739187747.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbzrrai",
                  "author": "hindusoul",
                  "body": "Can’t expect the government to help right now when it’s slowly being dismantled.. give it 4 years? 🤷‍♂️",
                  "score": 2,
                  "created_utc": 1739181781.0,
                  "replies": [
                    {
                      "id": "mbzs3nn",
                      "author": "XandaPanda42",
                      "body": "I'm not in America, so the American government can't do shit for me, even if it wasn't run by twats. \n\nI mean I want to know the names of the companies who sold the dodgy drives, so I never give them any of my money ever again.",
                      "score": 0,
                      "created_utc": 1739182000.0,
                      "replies": [
                        {
                          "id": "mbzs8jd",
                          "author": "hindusoul",
                          "body": "Need to do a deep dive of the many articles you can find and see if any of them name names… can also look up SSD makers and slowly cross one off if you ever find anything negatively related to them",
                          "score": 2,
                          "created_utc": 1739182088.0,
                          "replies": [
                            {
                              "id": "mbzt7bg",
                              "author": "XandaPanda42",
                              "body": "This is such bull, half of these articles just are reporting off what the others have said. None that I've read have said who actually sold the drives here.\n\nIt's ridiculous. They call this journalism? \"BREAKING: Someone did something they should get in trouble for. They won't, and we're complicit in this because we won't tell you who they are!\"",
                              "score": 2,
                              "created_utc": 1739182704.0,
                              "replies": [
                                {
                                  "id": "mbzu3xa",
                                  "author": "hindusoul",
                                  "body": "https://www.heise.de/news/Betrug-mit-Seagate-Festplatten-Haendler-tauschen-Seagate-untersucht-10274745.html\n\nStatements of the dealers:\n\nAlternate writes that they have obtained the goods from established German suppliers with whom they have been in a business relationship for some time. You have not been informed that the products are not new. According to their statement, their suppliers also had no knowledge of this and sold the goods to Alternate as new goods. Affected customers should contact seagate@alternate.de by e-mail; the company offers both an exchange (if available) and a refund.\nBechtle writes that in justified cases the statutory warranty takes stay.\nCTN system proceeds in two tracks for complaints. Customers could keep the hard drives and would receive a 3- or 5-year warranty from the dealer, as shown on the website, or they would be refunded the purchase price upon return of the hard drive.\nGalaxus refers to its customer service as well as a help page for the cases.\nKosatec examines the requests of affected customers and wants to find a solution for the customers as quickly as possible after an examination. Dealer customers should open an RMA ticket via the route known to them.\nMaingau has contacted affected customers.\nOffice Partner wants to fully compensate the affected customers.\nProshop customers can return the hard drives free of charge and receive a replacement (if possible) or a full refund. Customers should contact us by e-mail or via the contact form on the website.\nReichelt customers can return the affected goods and receive the purchase price back, an exchange is also possible if available.\nWortmann would like to check the drive in case of suspicion and react depending on the result.\n\nI clicked a link from the site and found this.. you’re welcome for doing your work for you.",
                                  "score": 3,
                                  "created_utc": 1739183275.0,
                                  "replies": [
                                    {
                                      "id": "mc00nif",
                                      "author": "XandaPanda42",
                                      "body": "Oh damn, yeah thanks mate, I would never have thought to check a link in the source article. Especially since back when I first looked at it, the page kept translating into english, refreshing and reverting back to German every time the cookie notice popped up, making it damn difficult to read.\n\nI would have appreciated the help, but the last sentence was rude and unneccesary. \n\nNow instead of thinking \"hey that person's cool, they helped me out when I wasn't able to find the right info myself\" now it's just \"wow, they were sarcastic, and kind of a dick.\" \n\nGonna go look up the businesses to see if any of them actually ship to my country. In the meantime, maybe have a think about why no one wants to figure this stuff out for themselves. Maybe it's because when they try, they're met with sarcasm, indifference and impatience by the people who already know how to. \n\nIf you want to encourage people to do it, maybe don't be rude to people who are trying? \n\nJust a thought.",
                                      "score": 0,
                                      "created_utc": 1739187183.0,
                                      "replies": [
                                        {
                                          "id": "mc0435a",
                                          "author": "hindusoul",
                                          "body": "We spent many minutes conversing. I even expressed looking at websites that had similar articles regarding this. You come back with aghhhhhhh… they can’t even give us anything. \n\nI SPENT 1 minute on the site and found your retailers… \n\nMaybe some people are tired of everything being given to them instead of doing the work…\n\nFood for thought.",
                                          "score": 2,
                                          "created_utc": 1739189005.0,
                                          "replies": [
                                            {
                                              "id": "mc0860e",
                                              "author": "XandaPanda42",
                                              "body": "No, you spent 1 minute on the site and found a bunch of German retailers. \n\nAgain, given that I'm not IN Germany and thus rarely (if ever) buy hard drives from German businesses, a list of German retailers is not helpful to me in the slightest. \n\nI was trying to find resources on where and when they were sold in my country, and was expressing dissatisfaction at the lack of decent local articles. \n\nSo feel free to act all superior. But twice now you've just assumed that I'm in whatever country you're talking about at the time. Other countries exist too, you know.\n\nWho knows, maybe more articles would be available here if every \"journalist\" here wasn't constantly ranting about whatever the fuck is going on in America at any given moment. For every article about the hard drive issue, there are 300 talking about American politics, sport or whatever some random rich fuck ate for breakfast last Tuesday.\n\nSo yeah, in my opinion, I'm actually kinda justified in being a little pissed off at the media here.",
                                              "score": 1,
                                              "created_utc": 1739190966.0,
                                              "replies": [
                                                {
                                                  "id": "mc08xij",
                                                  "author": "hindusoul",
                                                  "body": "Have a good day.",
                                                  "score": 2,
                                                  "created_utc": 1739191317.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbwpkql",
      "author": "Scared_of_zombies",
      "body": "What a stupid reason for consumers and users to lose more faith in your company.",
      "score": 42,
      "created_utc": 1739136856.0,
      "replies": [
        {
          "id": "mbwu3zl",
          "author": "one_ball_in_a_sack",
          "body": "How was it Seagate's fault? They didn't sell the drives as used. The crypto scammers reset the SMART data then sold the drives.",
          "score": 80,
          "created_utc": 1739138179.0,
          "replies": [
            {
              "id": "mbx0tuf",
              "author": "slipperyMonkey07",
              "body": "It's not. But I think the previous user meant it's stupid that customers will immediately blame seagate, over the fact they bought the cheapest drive they could from a shady reseller. \n\nA lot of people don't look for official sellers, they just see somewhere selling a cheap drive and grab it. Second issue is a few of their official sellers do have third party sellers, like amazon. So stock may of been mixed in together, or they don't pay close enough attention to the seller actually selling the drive.\n\nUsually amazon will refund and alerting seagate helps. But people's first instinct will never be they fucked up it, it will be seagate drives are garbage and then spread it. It's stupid, but so are people.",
              "score": 15,
              "created_utc": 1739140217.0,
              "replies": [
                {
                  "id": "mbx4pwh",
                  "author": "LeBobert",
                  "body": "Read what he says again:\n\n>What a stupid reason for consumers and users to lose ***more*** faith in your company.\n\nNo, he is one of the stupids you mentioned. Thinks Seagate officially tried to sell used drives.",
                  "score": 12,
                  "created_utc": 1739141455.0,
                  "replies": [
                    {
                      "id": "mby6rq6",
                      "author": "aveugle_a_moi",
                      "body": "https://en.wikipedia.org/wiki/ST3000DM001",
                      "score": 2,
                      "created_utc": 1739154333.0,
                      "replies": [
                        {
                          "id": "mbydblo",
                          "author": "LeBobert",
                          "body": "Want to elaborate? Were those drives used and being sold as new?",
                          "score": 1,
                          "created_utc": 1739156489.0,
                          "replies": [
                            {
                              "id": "mbyj142",
                              "author": "aveugle_a_moi",
                              "body": "> > >What a stupid reason for consumers and users to lose **more** faith in your company.\n\n> >Prior major event with the company that caused a lot of people to lose faith in the company\n\n> Stupid thing is happening, causing more people to lose faith in the company (even though it's not real)",
                              "score": -1,
                              "created_utc": 1739158473.0,
                              "replies": [
                                {
                                  "id": "mbyni2r",
                                  "author": "LeBobert",
                                  "body": "Congratulations this also applies to you and your reading comprehension. \n\n>No, he is one of the stupids you mentioned. **Thinks Seagate officially tried to sell used drives**.",
                                  "score": 0,
                                  "created_utc": 1739160143.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbxfh9v",
              "author": "ShaulaTheCat",
              "body": "Why is it even possible to rewrite that data? Isn't that something that Seagate has direct control over?",
              "score": -1,
              "created_utc": 1739145044.0,
              "replies": [
                {
                  "id": "mbxiq6f",
                  "author": "Kellic",
                  "body": "Because all drives with the right tools can have SMART data reset.  This is not new.",
                  "score": 13,
                  "created_utc": 1739146133.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mby5mom",
              "author": "reeeelllaaaayyy823",
              "body": "They were being sold by Seagate official retailers.",
              "score": -1,
              "created_utc": 1739153962.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbwtl5c",
          "author": "None",
          "body": "[deleted]",
          "score": 42,
          "created_utc": 1739138023.0,
          "replies": [
            {
              "id": "mbwxdu1",
              "author": "NeglectedOyster",
              "body": "Even official distributors like Amazon have this problem. People ship back broken drives as new and get a refund. \n\nYes, Amazon will refund you but it’s a ballache.",
              "score": 23,
              "created_utc": 1739139160.0,
              "replies": [
                {
                  "id": "mbxc2yq",
                  "author": "karateninjazombie",
                  "body": "Amazon has been return scam central for YEARS. \n\nThere's multiple posts on Reddit a day in various subs or order X from Amazon, opened it and got Y. With Y being something of much less value.\n\nOr posts about new things arriving and clearly being used. My favourite one of those I saw recently was a coat someone brought new that had a set of car + house  keys in a pocket.  \"New\"",
                  "score": 10,
                  "created_utc": 1739143949.0,
                  "replies": [
                    {
                      "id": "mbxqcrn",
                      "author": "MWink64",
                      "body": "I've had multiple \"new\" items purchased from Amazon that were clearly returns. In once case, I didn't even get product \"Y.\" It was literally an empty case. The worst part is I paid extra for a \"sold and shipped by Amazon\" item. Amazon has become a terrible place to buy things. It looks like Dell is also selling returned (potentially even defective) items as new.",
                      "score": 5,
                      "created_utc": 1739148584.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbwz4zl",
                  "author": "ButteryFlapjacks4eve",
                  "body": "Amazon is the *only* place I've ever gotten an old drive sold as new.",
                  "score": 17,
                  "created_utc": 1739139695.0,
                  "replies": []
                },
                {
                  "id": "mc11xl2",
                  "author": "Txphotog903",
                  "body": "I was about to Google the last word of your post, then looked at it again. 😂",
                  "score": 3,
                  "created_utc": 1739201841.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mbx2k3v",
              "author": "None",
              "body": "[deleted]",
              "score": 6,
              "created_utc": 1739140768.0,
              "replies": [
                {
                  "id": "mbx9kao",
                  "author": "Martin_Aurelius",
                  "body": "24tb Exos factory rebuilt for $280? Yes please.",
                  "score": 6,
                  "created_utc": 1739143079.0,
                  "replies": [
                    {
                      "id": "mbyc537",
                      "author": "Esseth",
                      "body": "That's what I'll be filling my NAS with, nothing wrong with refurbed drives as long as you are paying refurbed prices.",
                      "score": 5,
                      "created_utc": 1739156088.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mbx60ps",
              "author": "zz9plural",
              "body": "The drives were sold as new. By official resellers.\n\nNice. Don't believe me, read the articles by heise.de:\nhttps://www.heise.de/en/news/Hard-disk-fraud-Increasing-evidence-of-origin-in-China-10269059.html\n\n\"Official Seagate dealers are also affected.\"",
              "score": -1,
              "created_utc": 1739141879.0,
              "replies": [
                {
                  "id": "mbxc2vr",
                  "author": "Dick_Lazer",
                  "body": "The article states otherwise\n\n> While Seagate maintains that these products did not come from its official distribution channels, the scandal raises serious concerns about unauthorized resellers and supply chain security.",
                  "score": 5,
                  "created_utc": 1739143947.0,
                  "replies": [
                    {
                      "id": "mby4kor",
                      "author": "Eddagosp",
                      "body": "It helps if you read the whole thing.  \nThese were retailers' stock that was injected with heavily used HDDs that had altered metadata to appear \"new\". If you've seen Matilda, imagine the scene where Danny DeVito resets the car's odometer. \n\n>It now appears that some of these used drives were relabeled and resold as new, deceiving both retailers and consumers.  \n\n>Although standard SMART parameters track HDD usage, these values were reset to obscure the actual wear and tear. However, a more in-depth check using FARM (Field-Accessible Reliability Metrics) values can reveal a drive's true operational history   \n\n>Many retailers stress that they purchased these HDDs from suppliers they trusted, and they were unaware of any tampering before selling them to consumers.",
                      "score": 2,
                      "created_utc": 1739153536.0,
                      "replies": []
                    },
                    {
                      "id": "mbzfis5",
                      "author": "zz9plural",
                      "body": "\"Official Seagate dealers are also affected.\"\n\nhttps://www.heise.de/en/news/Hard-disk-fraud-Increasing-evidence-of-origin-in-China-10269059.html",
                      "score": 1,
                      "created_utc": 1739173990.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbxb2c0",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 2,
                  "created_utc": 1739143599.0,
                  "replies": [
                    {
                      "id": "mbzf3iy",
                      "author": "zz9plural",
                      "body": "It's not in that article, but in the original reporting from reputable heise.de",
                      "score": 1,
                      "created_utc": 1739173730.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbz1o8m",
          "author": "LivesDoNotMatter",
          "body": "As if there was any faith left... That's probably the worst company you could buy a drive from.",
          "score": 1,
          "created_utc": 1739166294.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbwt1ws",
      "author": "Maraca_of_Defiance",
      "body": "The PNY store on Amazon sold me used cards stuffed to the gills with Chinese dandruff, as new. \n\nI put on a mask and gloves to detox them , maybe I should have returned them but that’s a bigger hassle than I have time for. Now they are backup cards because they do work but I don’t trust them.\n\nI’m not a gamer, I run a media server business. \n\nThis is a wide spread occurrence these days.",
      "score": 16,
      "created_utc": 1739137866.0,
      "replies": [
        {
          "id": "mbwuy4e",
          "author": "OperatorJo_",
          "body": "Last time I bought PNY was a pack of 16gb Pen drives at OfficeMax. \n\nPlugged them in aaaand they read 28gb. \n\nPNY has missed controls for a while",
          "score": 14,
          "created_utc": 1739138426.0,
          "replies": []
        },
        {
          "id": "mby1m2s",
          "author": "hitemlow",
          "body": "It's because of Amazon's propensity to pool \"identical\" items. Samsung sends 100,000 units to Amazon and \"Cheap SDcard Market\" sends 1,000 of units sporting the same UPC to Amazon, and Amazon treats them as the same product.\n\nBuying from either store will result in a ~1% chance of receiving a counterfeit regardless of which store you clicked 'add to cart' from. It's a real problem and some manufacturers have started working with Amazon to create a program dubbed 'Transparency' specifically to *stop* Amazon from pooling legitimate items from counterfeit ones (with a sticker, no less).",
          "score": 14,
          "created_utc": 1739152241.0,
          "replies": []
        },
        {
          "id": "mbwxalo",
          "author": "Katie_or_something",
          "body": ">I run a media server business\n\n>The PNY store on Amazon\n\nWhy aren't you buying through official channels for your business? You cut corners and you paid the price.",
          "score": 4,
          "created_utc": 1739139133.0,
          "replies": [
            {
              "id": "mbwxt6s",
              "author": "Maraca_of_Defiance",
              "body": "It’s Amazon business not normie Amazon. I’d expect better service to be sure. I ended up buying new ADA cards from B&H because they were much cheaper than new egg. \n\nI hate supporting bezos these days but Amazon is usually faster, cheaper and not closed .\n\nPlus this was supposedly the official PNY vendor. I’ve never had this problem before. Seemed very legit until it wasn’t. Just sharing so folks know.",
              "score": 0,
              "created_utc": 1739139293.0,
              "replies": [
                {
                  "id": "mbx7ucj",
                  "author": "half3clipse",
                  "body": ">It’s Amazon business not normie Amazon. \n\nSame warehouse, same bin.",
                  "score": 14,
                  "created_utc": 1739142494.0,
                  "replies": []
                },
                {
                  "id": "mbxcevv",
                  "author": "karateninjazombie",
                  "body": "It's the same crock of shit Amazon is. Just slightly bluer branding on the website iirc.",
                  "score": 4,
                  "created_utc": 1739144064.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbx90sx",
      "author": "imakesawdust",
      "body": "> Seagate has distanced itself from the fraudulent sales\n\nBullshit.  By allowing SMART data to be reset, Seagate has allowed this fraud to take place.  They're complicit.\n\nHow would we view an auto manufacturer who provided tools so that used car dealerships could reset the odometer?\n\nETA: I should note that it's not just Seagate.  Tools exist that can reset SMART data for Toshiba and HGST drives.  And resellers like ServerPartDeals sell \"refurb\" enterprise WD drives with wiped SMART data.",
      "score": 15,
      "created_utc": 1739142896.0,
      "replies": [
        {
          "id": "mbxi86d",
          "author": "Kellic",
          "body": "Resetting referbed or factory re-certified hardware is normal practice.  I've been buying manufacturer re-certified drives for 25 years at this point and this ALWAYS happens.",
          "score": 13,
          "created_utc": 1739145967.0,
          "replies": [
            {
              "id": "mbxwovx",
              "author": "imakesawdust",
              "body": "Agreed.  For some reason we consider it to be \"normal practice\" for re-certified hard drives.  But we don't consider normal practice for anything else.  Used vehicle odometers aren't reset when re-sold.  In fact, in the US it's a crime.  Power-on hours aren't reset for equipment.  Why is it acceptable to do it for computer gear?",
              "score": 12,
              "created_utc": 1739150503.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbz9pbj",
          "author": "viperfan7",
          "body": "Should be treated the same as car odometers",
          "score": 2,
          "created_utc": 1739170542.0,
          "replies": []
        },
        {
          "id": "mc23hl5",
          "author": "rasz_pl",
          "body": "Afaik SMART is being reset using HDD repair tools (russian PC-3000).\n\nYou really cant make a drive where this would be impossible.",
          "score": 1,
          "created_utc": 1739212735.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mc2uj8f",
      "author": "Time-Stood-Still",
      "body": "I can confirm companies complete risk analysis before they break the law to understand the cost if caught. They include financial, reputation, civil and criminal lawsuits.  If they feel they can profit more than the inherent risk, they break the law.",
      "score": 2,
      "created_utc": 1739222356.0,
      "replies": []
    },
    {
      "id": "mc4cgoo",
      "author": "slvrscoobie",
      "body": "Glad i just bought 2 WD 12TB hdd - course i also bought them ‘used’ so",
      "score": 2,
      "created_utc": 1739243158.0,
      "replies": []
    },
    {
      "id": "mbzxjrl",
      "author": "Average_RedditorTwat",
      "body": "Not like anyone needed any more reasons to not buy Seagate, new or used.",
      "score": 3,
      "created_utc": 1739185390.0,
      "replies": []
    },
    {
      "id": "mbwqhcs",
      "author": "Harambesic",
      "body": "Wow, how brazenly shifty. Well, I typed shitty,  but that works, too.\n\nI'm about to buy a new drive. Probably WD, unless someone here has a better suggestion.",
      "score": 6,
      "created_utc": 1739137119.0,
      "replies": [
        {
          "id": "mbww31a",
          "author": "None",
          "body": "Seagate did not do this, the reseller did. Buying a seagate brand new from an official vendor will not cause any problem",
          "score": 14,
          "created_utc": 1739138768.0,
          "replies": [
            {
              "id": "mbwzq48",
              "author": "XPLR_NXT",
              "body": "Arent the resellers official vendors?",
              "score": 6,
              "created_utc": 1739139875.0,
              "replies": []
            },
            {
              "id": "mbx6ehj",
              "author": "zz9plural",
              "body": "Seagate didn't do this, but the drives were sold as brand new by official vendors. That's the scandal in this.",
              "score": 3,
              "created_utc": 1739142006.0,
              "replies": [
                {
                  "id": "mbxcxfi",
                  "author": "None",
                  "body": "While Seagate maintains that these products did not come from its official distribution channels, the scandal raises serious concerns about unauthorized resellers and supply chain security.\n\nAs per the article, it seems that these were sold by unofficial vendor so no, not from official sellers",
                  "score": -2,
                  "created_utc": 1739144244.0,
                  "replies": [
                    {
                      "id": "mbzfh7g",
                      "author": "zz9plural",
                      "body": "https://www.heise.de/en/news/Hard-disk-fraud-Increasing-evidence-of-origin-in-China-10269059.html\n\n\"Official Seagate dealers are also affected.\"",
                      "score": 2,
                      "created_utc": 1739173962.0,
                      "replies": [
                        {
                          "id": "mc0qxp1",
                          "author": "None",
                          "body": "Sorry i will learn to read appropriately lol, i did not want to misinform guys !",
                          "score": 1,
                          "created_utc": 1739198275.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mbxgh6j",
          "author": "Zoratt",
          "body": "I have had WD Red Plus and Pro and they have worked well and been like tanks. At this point, I would keep using WD. I have used their M.2 drives too and they have been fast and haven’t degraded.",
          "score": 3,
          "created_utc": 1739145388.0,
          "replies": []
        },
        {
          "id": "mbwx4l2",
          "author": "agaloch2314",
          "body": "While not Seagate’s fault, you’re still better off with a WD.",
          "score": 1,
          "created_utc": 1739139082.0,
          "replies": [
            {
              "id": "mbx6n3r",
              "author": "Jack123610",
              "body": "As long as it's not an SSD, from what I've heard WD/Sandisk have had their issues.",
              "score": 4,
              "created_utc": 1739142086.0,
              "replies": [
                {
                  "id": "mbxbcfg",
                  "author": "Harambesic",
                  "body": "My Sandisk SSD just recently crashed (instantly and totally) after three years, but it was under a five year warranty and they honored it! Got the new one in about a week.",
                  "score": 2,
                  "created_utc": 1739143695.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mbwxq8z",
      "author": "Riot55",
      "body": "Can we call this scandal SeagateGate?",
      "score": 9,
      "created_utc": 1739139268.0,
      "replies": [
        {
          "id": "mbxfa1c",
          "author": "hates_writing_checks",
          "body": "Just \"SeaGate.\"  Drop the \"gate.\"  It's cleaner.",
          "score": -3,
          "created_utc": 1739144983.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mbz0d6j",
      "author": "kid_cannabis_",
      "body": "Hasn’t Seagate done this before? Back in ‘97 they had faulty drives they refused to warranty and then a bit later in the early-mid 2000s they also sold used drives as “new”. Seagate is a super shady company. Seems they are surrounded in controversy and scandals.",
      "score": 4,
      "created_utc": 1739165658.0,
      "replies": [
        {
          "id": "mbz4dyt",
          "author": "swiftb3",
          "body": "Yeah, I was going to say, I've explicitly avoided Seagate since the 90s.",
          "score": 1,
          "created_utc": 1739167662.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mby8n1z",
      "author": "novachamp",
      "body": "I’d be pissed getting a _new_ Seagate drive, much less a used one.",
      "score": 2,
      "created_utc": 1739154966.0,
      "replies": []
    },
    {
      "id": "mbwt091",
      "author": "None",
      "body": "Crypto ponzi scheme",
      "score": 2,
      "created_utc": 1739137853.0,
      "replies": []
    },
    {
      "id": "mbz1roy",
      "author": "LivesDoNotMatter",
      "body": "I'm amazed that there are still people out there who don't already realize seagate is trash.",
      "score": 3,
      "created_utc": 1739166342.0,
      "replies": []
    },
    {
      "id": "mbwqr80",
      "author": "meunbear",
      "body": "I’ve only had two hard drives fail on me ever, and both were Seagate. Not even a lot of hours according to SMART.  No trust in them, and this is just affirming.",
      "score": 3,
      "created_utc": 1739137201.0,
      "replies": [
        {
          "id": "mbwu4q2",
          "author": "kanakalis",
          "body": "i've had 3 drives fail on me having owned ~10 HDDs. 2 WD internals lasting 12 years each, and a seagate external lasting ~8 years. i'd say they lasted pretty well the rest half are pushing 10 years and the other half 5 years",
          "score": 4,
          "created_utc": 1739138185.0,
          "replies": []
        },
        {
          "id": "mbxaf6a",
          "author": "NotAPreppie",
          "body": "I had 4 out of 5 [IBM DeathStar](https://en.wikipedia.org/wiki/Deskstar?wprov=sfti1#IBM_Deskstar_75GXP_failures) drives each fail in under a few months.\n\nLater they were called Hitachi Global Storage Solutions (HGST), which were owned by WD before they spun the brand down.",
          "score": 3,
          "created_utc": 1739143375.0,
          "replies": [
            {
              "id": "mbxg1vi",
              "author": "versello",
              "body": "All of my DeathStars failed on me. Even the replacements. I had 4 iirc.",
              "score": 2,
              "created_utc": 1739145240.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mbwth4f",
          "author": "wjean",
          "body": "Did you check the farm data. Were they refurbs?\n\nPersonally in the US id buy some WDC or Seagate ext drives on sale and shuck them. Right now I'm seeing best buy selling 20TB external Seagates (full retail packaging so no old shit here) as cheap as $230 and 24TB for $280",
          "score": 2,
          "created_utc": 1739137990.0,
          "replies": []
        },
        {
          "id": "mbzgxze",
          "author": "CCriscal",
          "body": "So young- in the 2000s before selling the hard disk business to Hitachi,  IBM had massive issues with actually new disks. I knew half a dozen people personally who had a disk that died within a year or had massive problems with faulty sectors.",
          "score": 1,
          "created_utc": 1739174865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mby8or8",
      "author": "Generico300",
      "body": "Retailers do this all the time.  There's every incentive to do it and very little chance of real consequences for getting caught.  All they have to do is pretend they didn't know about the fraud.",
      "score": 1,
      "created_utc": 1739154982.0,
      "replies": []
    },
    {
      "id": "mbyjub9",
      "author": "MrTestiggles",
      "body": "Shoutout to SanDisk too for this clearly used dirty “new” sd card I just bought too",
      "score": 1,
      "created_utc": 1739158770.0,
      "replies": []
    },
    {
      "id": "mc37c9a",
      "author": "desexmachina",
      "body": "What exactly were these drives used for in crypto farms though?  HD mining?",
      "score": 1,
      "created_utc": 1739228371.0,
      "replies": []
    },
    {
      "id": "mc3b2if",
      "author": "RetinaJunkie",
      "body": "Fraud ready made in name \"Sea-gate\"",
      "score": 1,
      "created_utc": 1739230275.0,
      "replies": []
    },
    {
      "id": "mbx5mlw",
      "author": "glizard-wizard",
      "body": "so can I steal the keys off these drives",
      "score": 1,
      "created_utc": 1739141751.0,
      "replies": [
        {
          "id": "mbz1w85",
          "author": "LivesDoNotMatter",
          "body": "You could try.  If they're using on mining farms, odds are, the private key wasn't even stored on them, let alone stored unencrypted.",
          "score": 2,
          "created_utc": 1739166403.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mby9vq4",
      "author": "None",
      "body": "Can any PC genius tell give me one answer to a question. \n\nIs it even worth it to stress out a purchase? I just want a pc that plays the games I want at 60fps. Is that seriously too much to ask for",
      "score": -1,
      "created_utc": 1739155373.0,
      "replies": []
    },
    {
      "id": "mbyo45v",
      "author": "TallDankandHandsome",
      "body": "It was pens for me. I'm really picky about the pens I like, and every time I'd buy a set from Amazon they would be s*****. S*****. When I'd buy them from Walmart or office Depot they'd be great. That's when I learned that it's hard to tell",
      "score": -1,
      "created_utc": 1739160382.0,
      "replies": []
    }
  ]
}