{
  "post": {
    "title": "iPhone SE 4 appears in new photos and video, notch and all / Apple’s next affordable phone has been shown off by a leaker, and there’s no sign of the Dynamic Island.",
    "author": "a_Ninja_b0y",
    "id": "1ib9shs",
    "score": 876,
    "created_utc": 1737986615.0,
    "selftext": "",
    "num_comments": 225,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1ib9shs/iphone_se_4_appears_in_new_photos_and_video_notch/"
  },
  "comments": [
    {
      "id": "m9gglfe",
      "author": "Vitss",
      "body": "Shame it's so large; the main reason I liked the older SE was its smaller footprint.",
      "score": 395,
      "created_utc": 1737988485.0,
      "replies": [
        {
          "id": "m9gr2c8",
          "author": "Vee8cheS",
          "body": "Yeah, this is a bummer. Was hoping something akin to the Mini. Alas, I think we’ll never see that form factor again and I’ll just have to clutch onto my iPhone 13 Mini until it no longer receives updates.",
          "score": 178,
          "created_utc": 1737991750.0,
          "replies": [
            {
              "id": "m9gv7rx",
              "author": "sambonidriver",
              "body": "I love my mini. Why do you think we’ll never see a phone this small again?",
              "score": 51,
              "created_utc": 1737992957.0,
              "replies": [
                {
                  "id": "m9gwkm9",
                  "author": "Nosib23",
                  "body": "Because no one buys them. https://www.macrumors.com/2022/04/21/iphone-13-mini-unpopular-march-quarter/\n\nThe people who love them are very vocal about it but the sales figures indicate there just isn't a big enough market.",
                  "score": 86,
                  "created_utc": 1737993346.0,
                  "replies": [
                    {
                      "id": "m9h2rcy",
                      "author": "thisischemistry",
                      "body": "The SE and the mini competed for similar markets, a small form-factor phone. The SE had an advantage in that it was the last Apple phone to have TouchID and it was low-cost, so they sold a ton of them.\n\nIMO, they should have just combined the SE and the mini so they didn't take sales from each other. A SE the size of the mini with a full-phone display would have been a sweet spot for a phone.",
                      "score": 70,
                      "created_utc": 1737995111.0,
                      "replies": [
                        {
                          "id": "m9hf38r",
                          "author": "coalForXmas",
                          "body": "That’s exactly what happened to me. I wasn’t aware of the upcoming mini at the time and purchased the SE so there was no point in getting the mini",
                          "score": 21,
                          "created_utc": 1737998551.0,
                          "replies": []
                        },
                        {
                          "id": "m9ibt3n",
                          "author": "rogue_giant",
                          "body": "I’m still rocking the SE because of the home button. I really couldn’t care about the larger screen on the newer phones so I’m hanging on to this bad boy until it physically won’t work anymore. I’ve also got an 8 that needs a new digitizer so I’ve got that as a backup.",
                          "score": 17,
                          "created_utc": 1738007632.0,
                          "replies": [
                            {
                              "id": "m9licjk",
                              "author": "None",
                              "body": "I’m typing this from my iPhone 8.",
                              "score": 3,
                              "created_utc": 1738045953.0,
                              "replies": [
                                {
                                  "id": "m9sh5fr",
                                  "author": "smilesalways24",
                                  "body": "Me too. I am using an iPhone 8 and my work is pushing me to upgrade if I need access MS office apps. That's why I am looking at SE 4. Otherwise I want to use my 8 for atleast another 2 years.",
                                  "score": 1,
                                  "created_utc": 1738138361.0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "m9jlsyb",
                              "author": "ManlySyrup",
                              "body": "I seriously do not understand why some people just don't want a fullscreen phone only cause it's got no home button. Like, have you even tried a new iPhone? It is literally the same experience, only you swipe up now. That's literally it!\n\nYou're missing out on new phones cause for no good reason. It really blows my mind. It's like saying you don't want a new car cause the windows roll down with the push of a button, instead of having a handle to roll down manually. I seriously don't get it lol.",
                              "score": -2,
                              "created_utc": 1738020914.0,
                              "replies": [
                                {
                                  "id": "m9kqih2",
                                  "author": "rogue_giant",
                                  "body": "I do actually have a newer iPhone for my work phone and I still prefer the SE over it. I also do not like the increasingly larger sizes that the newer phones come out as. It’s all a personal preference.",
                                  "score": 7,
                                  "created_utc": 1738034114.0,
                                  "replies": []
                                },
                                {
                                  "id": "m9ki5wd",
                                  "author": "T-Rex_timeout",
                                  "body": "I loved my SE. I let my husband talk me into getting a 16 since it was covered by a stipend and regret it. I preferred the home button. The full screen is very problematic as my hand keeps touching the edge and switching mid video. The camera button is where I grab my phone out of my scrub pockets and u keep activating the camera every time I tough my phone. Plus the keyboard is just a hair bigger so I keep mistyping things.",
                                  "score": 5,
                                  "created_utc": 1738031330.0,
                                  "replies": []
                                },
                                {
                                  "id": "m9jvz51",
                                  "author": "dandroid126",
                                  "body": "I'm not an iPhone user, but Android has the option where you can either swipe up or have a soft home button on the bottom of your screen. \n\nPersonally, I don't like the swipe because a swipe is always slower than a tap. Plus, in my experience, gestures don't always work on the first attempt (maybe I'm just bad at them).\n\nI greatly prefer a tap over a swipe. But that's just me. To each their own.",
                                  "score": 7,
                                  "created_utc": 1738024192.0,
                                  "replies": [
                                    {
                                      "id": "m9jzmdk",
                                      "author": "thisischemistry",
                                      "body": "> have a soft home button on the bottom of your screen\n\nYep, that's available on iOS too.",
                                      "score": 1,
                                      "created_utc": 1738025357.0,
                                      "replies": [
                                        {
                                          "id": "m9k0n53",
                                          "author": "dandroid126",
                                          "body": "Oh, I didn't know that. That's nice.",
                                          "score": 3,
                                          "created_utc": 1738025683.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "m9mitg3",
                                  "author": "DrunkPyrite",
                                  "body": "I don't want facial ID is my main reason.  I could do without the physical button, but don't want to get rid of touchID",
                                  "score": 1,
                                  "created_utc": 1738067266.0,
                                  "replies": []
                                },
                                {
                                  "id": "m9o9b6c",
                                  "author": "RobotPreacher",
                                  "body": "Swipe gestures are a lot more prone to misinterpretation than physical buttons.\n\nI've been a diehard home button lover, but just switched to a newer iPhone.  There are *way* more accidental gesture errors then when I had the home button. That being said, it's not that bad, and I do think the difference is negligible.",
                                  "score": 1,
                                  "created_utc": 1738087035.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m9ik0oh",
                          "author": "Spazzdude",
                          "body": "Small Android phones also have weak sales. Asus went to smaller phones for the Zenfone 8-10 and they had weaker sales than the generations before that had a larger screen. The base model of Galaxy devices is less popular than the ultra devices. Though I would not call the 6.2 screen size of the base Galaxy small, the data shows that people want the larger screen, increased power, larger battery, or a combination of the three.\n\nI do think that it would benefit companies to at least make a flagship compact phone every 2-3 years. There is not enough demand for a yearly entry but there are clearly people who want flagship specs in a smaller phone.",
                          "score": 4,
                          "created_utc": 1738009956.0,
                          "replies": [
                            {
                              "id": "m9jbhh9",
                              "author": "thisischemistry",
                              "body": "I'm sure that the smaller devices might not sell as well as some of the larger ones but they still might be profitable. The key is to not split that market into multiple models which cannibalize each other's sales.\n\nBoth the mini and the SE were on that low end, they were both small form-factor devices and they cost less than the rest of the lineup. They are bringing back the SE, in some form, but are abandoning the smaller size. I wonder if the form-factor could be viable if they only had a single product at that size.\n\nAnd I agree, it might turn out that they need to go with a longer lifecycle on those devices in order to make the economics work.",
                              "score": 2,
                              "created_utc": 1738017720.0,
                              "replies": []
                            },
                            {
                              "id": "m9m00o7",
                              "author": "Zerfallen",
                              "body": "Zenfone 8-10 were the same size as regular iPhone/Pro and S23/4... That's not a small-phone market they were engaging with, just the lower size end of the regular market. Maybe they would have had more success going *smaller* -- that's why i didn't buy it, the S24 was still the smaller device overall and way better software support and hardware quality.",
                              "score": 1,
                              "created_utc": 1738056698.0,
                              "replies": [
                                {
                                  "id": "m9mrcho",
                                  "author": "Spazzdude",
                                  "body": "They were not the same size? The Zenfone 10 has a 5.9\" screens. The Galaxy and iPhone have 6.1\" screens. Though they were roughly the same height, the Zenfone was also not as wide by about  3mm, making it feel much more compact in the hand. The Zenfone also had flagship specs and ran as close to stock Android I have ever seen a phone get that wasn't a pixel phone. Battery was larger than the other 2 as well. \n\nThe s24 has a better processor than the zen10 because the 10 is competing with the S23. And those have the same chip. The only thing the s23 had in the zen10 was the support as Asus only guaranteed 2 years of updates. Yes, that's super important. But the hardware was neck and neck with the S23.",
                                  "score": 1,
                                  "created_utc": 1738070736.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "m9ik3a8",
                      "author": "David-Ox",
                      "body": "The timing was bad too, and the 12 mini had some problems even tho the 13 fixed them they still killed their sales because of it",
                      "score": 5,
                      "created_utc": 1738009977.0,
                      "replies": []
                    },
                    {
                      "id": "m9j1rqu",
                      "author": "Cookiemonster9429",
                      "body": "The original SE was the best seller and that’s the last one that was actually small.",
                      "score": 3,
                      "created_utc": 1738014919.0,
                      "replies": []
                    },
                    {
                      "id": "m9ju3rr",
                      "author": "fishknight",
                      "body": "Anecdotal, but at my store Id say we even now get asked for minis about twice as often as the plus",
                      "score": 5,
                      "created_utc": 1738023599.0,
                      "replies": []
                    },
                    {
                      "id": "m9ldszu",
                      "author": "Plane-Net-5832",
                      "body": "It’s the same for manual transmissions in vehicles.",
                      "score": 1,
                      "created_utc": 1738043634.0,
                      "replies": []
                    },
                    {
                      "id": "mb3rlfj",
                      "author": "FlyingThunderGodLv1",
                      "body": "I never bought the mini because they didn't make a pro version and I had already bought a new pro iPhone the year before it came out.\n\nHad they made a pro, it would have done better",
                      "score": 1,
                      "created_utc": 1738763323.0,
                      "replies": []
                    },
                    {
                      "id": "m9gwoq8",
                      "author": "sambonidriver",
                      "body": "😢",
                      "score": 1,
                      "created_utc": 1737993378.0,
                      "replies": []
                    },
                    {
                      "id": "m9gyang",
                      "author": "PraetorianAE",
                      "body": "We like the idea of it lol",
                      "score": 1,
                      "created_utc": 1737993842.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9gwmf8",
                  "author": "Vee8cheS",
                  "body": "As much as we love our Minis, it’s a very niche market and considering most of media today is consumed through our smartphones rather than our computers/tvs. People tend to gravitate towards bigger screen estate to enjoy their content which is inclusive of social media (Tik Tok, Instagram, YouTube, etc.). Furthermore, Apple attempted two years of Mini and both did not meet their monetary expectations and sales were not as high as their other devices. Only way I can *possibly* see the Mini making a return is having one iPhone as the standard (which they won’t do) and then the Pro models. I held out hope for the SE considering they can lose some profit there but as we can see, that is not the case and they have doubled down on bigger devices. I do hope they prove me wrong someday.",
                  "score": 11,
                  "created_utc": 1737993360.0,
                  "replies": [
                    {
                      "id": "m9hwjhu",
                      "author": "None",
                      "body": "I get that I’m one person and I’m not mass-consuming media (tv shows, movies, etc.) on my phone. And I’ve owned much larger iPhones, Galaxies, and Pixel, and I don’t miss the large screen at all. ",
                      "score": 2,
                      "created_utc": 1738003371.0,
                      "replies": []
                    },
                    {
                      "id": "m9hj5fy",
                      "author": "IbanezPGM",
                      "body": "I don’t even care about the screen size. Bigger means bigger battery.",
                      "score": 3,
                      "created_utc": 1737999680.0,
                      "replies": [
                        {
                          "id": "m9hkbfo",
                          "author": "Vee8cheS",
                          "body": "And this is what hindered the 12M and was *sort of* rectified in the 13M. Trust me, I get it because I had a 14PM and the battery life was phenomenal. Just couldn’t get used to the size of the thing and being able to easily use the 13M with one hand is more convenient. Battery life isn’t the greatest however, I make sure to keep my MagSafe battery pack on hand in the event I need it. Oddly enough, the battery charged extremely quickly with the MagSafe charger (we’re talking 10% to 45% in about 20 mins or so). I do miss the Dynamic Island, frosted glass back, and Pro-Motion display though.",
                          "score": 1,
                          "created_utc": 1738000001.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9l3utg",
                  "author": "stempoweredu",
                  "body": "To give a little data to the 'people don't want them' comment others are making.  I manage cell phones for a large company.  We have about 1000 phones in deployment.  900 iPhones, 100 Android.  Out of our deployment fleet, the maximum amount of iPhone Minis we purchased represented only 3.5% of our fleet.\n\nThe data on them was pretty solid as well - they're too powerful for their small size and battery.  They were rife with battery issues and often experienced premature death.  The minis had the shortest lifetime out of all of our iPhone models.\n\nThe SE, however, were reasonably popular, but that was more due to pricing (free with contract) than size.  Users often lamented the size, only a minority sought it.  It's a shame, because I prefer the smaller size myself.  I would love a consistent 4.9-5 inch cell phone.",
                  "score": 2,
                  "created_utc": 1738039151.0,
                  "replies": []
                },
                {
                  "id": "m9h0vlv",
                  "author": "PeaceBull",
                  "body": "There’s often a huge chasm between people saying they want something on the internet and what people do with their actual money. \n\nThe mini is one of those things. \n\nEdit: lol I'm very open to any of the downvoters explaining to me where I'm wrong here \n\n– An iPhone 12 mini owner",
                  "score": 0,
                  "created_utc": 1737994579.0,
                  "replies": []
                },
                {
                  "id": "m9ie6pn",
                  "author": "sithelephant",
                  "body": "Why yes, it's half the size, it folds, and it's four times the price!",
                  "score": -1,
                  "created_utc": 1738008301.0,
                  "replies": []
                },
                {
                  "id": "m9hdm23",
                  "author": "SteltonRowans",
                  "body": "Bigger phones have larger battery life and it tends to be consumers #1 complaint. Just look at all the “was my battery life effected 2% by the latest update” posts you constantly see.",
                  "score": -2,
                  "created_utc": 1737998140.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9iuq7x",
              "author": "TheMightosaurus",
              "body": "Also holding onto my 13 mini for dear life. I don’t want a giant phone!",
              "score": 7,
              "created_utc": 1738012955.0,
              "replies": []
            },
            {
              "id": "m9idk0n",
              "author": "BendakSW",
              "body": "And me still over here with my iPhone SE first gen 😫",
              "score": 3,
              "created_utc": 1738008121.0,
              "replies": [
                {
                  "id": "m9ii3k4",
                  "author": "Vee8cheS",
                  "body": "Best SE imo!",
                  "score": 2,
                  "created_utc": 1738009411.0,
                  "replies": []
                },
                {
                  "id": "m9k7vfq",
                  "author": "warp99",
                  "body": "Mine died and was replaced with an SE2 which fixed all the right things like more memory and faster CPU and didn’t remove the fingerprint reader home button or the compact screen.  \n\nNot sure where I would go if this died?!",
                  "score": 1,
                  "created_utc": 1738027991.0,
                  "replies": [
                    {
                      "id": "m9mxshx",
                      "author": "tennesseean_87",
                      "body": "Only smart phones I have had are SE1, 2, and 3. The old ones sit around the house on Wi-Fi and play music, run training app for the garage gym, etc.",
                      "score": 1,
                      "created_utc": 1738073040.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ma5htun",
                  "author": "Space_Lux",
                  "body": "You should seriously upgrade. ",
                  "score": 1,
                  "created_utc": 1738303024.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9kay1z",
              "author": "a_bukkake_christmas",
              "body": "Me too friend.  I already have a laptop.  That’s enough",
              "score": 2,
              "created_utc": 1738028981.0,
              "replies": []
            },
            {
              "id": "m9kllv4",
              "author": "isademigod",
              "body": "Currently typing this on my 10S, which is still receiving updates and functioning perfectly. Youve got time. \n\nAlso, whoever complains about Apple doing planned obsolescence needs to have a closer look at samsung and google. This 7 (8?) year old phone is still kicking where my s21 is starting to show its age",
              "score": 2,
              "created_utc": 1738032476.0,
              "replies": [
                {
                  "id": "m9ks7xx",
                  "author": "Vee8cheS",
                  "body": "The iPhone 10 (Ex as many called it) is one of my favorite phones next to the iPhone 4. I just remember just unboxing it and using Face ID for the first time *in the dark* and being absolutely amazed considering all phones at that time couldn’t capture face recognition well. Same for the iPhone 4 when I first saw that you could do a *video call* (albeit, “anywhere there’s WiFi”) on a *phone* I couldn’t stop smiling. Anyway, iPhone 10/10s are spectacular devices!",
                  "score": 3,
                  "created_utc": 1738034707.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9li2t7",
              "author": "None",
              "body": "I’m typing this from my iPhone 8. It no longer receives updates and I could care less. It works fine and does everything I need it to do.",
              "score": 2,
              "created_utc": 1738045808.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9gv2eo",
          "author": "Flipin75",
          "body": "As my kids are getting older, they are getting to the point that where it makes sense for them to have their own phone (pre-teen) and modern phones are just too large for their pockets. A small SE phone would be perfect for this segment.",
          "score": 8,
          "created_utc": 1737992914.0,
          "replies": [
            {
              "id": "m9i3rwo",
              "author": "Portatort",
              "body": "Should an 11 year old really have an iPhone?\n\nWouldn’t a cellular watch be a better solution?",
              "score": 7,
              "created_utc": 1738005388.0,
              "replies": [
                {
                  "id": "m9k37kg",
                  "author": "vezwyx",
                  "body": "You can lock it down pretty easily using screen time. Lots of settings for what can be installed, who they can talk to, and time limits per app or category",
                  "score": 1,
                  "created_utc": 1738026505.0,
                  "replies": [
                    {
                      "id": "m9m3tqm",
                      "author": "the_fr33z33",
                      "body": "Android can do the same and isn’t tied to the system built-in screen time settings. I’m and iPhone user from day 1 and otherwise a big Mac / Apple user, but I have to admit that Androids child management features are better, easier to use and configure in most part, and most importantly work 100% of the time — unlike screen time which decides to not work properly from time to time.",
                      "score": 3,
                      "created_utc": 1738059126.0,
                      "replies": [
                        {
                          "id": "mbadu7a",
                          "author": "reredef",
                          "body": "But the green bubble. ",
                          "score": 1,
                          "created_utc": 1738848428.0,
                          "replies": [
                            {
                              "id": "mbb5men",
                              "author": "the_fr33z33",
                              "body": "Yup, counters it all",
                              "score": 1,
                              "created_utc": 1738857209.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9iiysl",
          "author": "weeklygamingrecap",
          "body": "Yeah, I used to want a tablet sized, huge phone but for the last 10 years I just want something comfortable and the smaller phones just feel better in my hands.",
          "score": 2,
          "created_utc": 1738009659.0,
          "replies": []
        },
        {
          "id": "m9m0zcc",
          "author": "Curse3242",
          "body": "Apparently smaller screens are slightly more expensive now as most phone use bigger screens.",
          "score": 1,
          "created_utc": 1738057323.0,
          "replies": []
        },
        {
          "id": "m9l4e7x",
          "author": "calcium",
          "body": "Everyone keeps saying this, but the iPhone 16 was one of the *smallest* phones released in 2024. Open GSM Arena and sort by all phones released in 2024 and you’ll find there are something like 30 smartphones that have screen sizes of 6” and smaller. So by this metric, Apple is already making one of the smallest phones on the market, but how many are they selling and is it because they’re smaller than their competitors?",
          "score": 1,
          "created_utc": 1738039373.0,
          "replies": []
        },
        {
          "id": "m9l0h66",
          "author": "ryrobs10",
          "body": "The current SE is nearly the same size as the regular pro irrc. I went from a 6 to X to and they were all nearly the same overall size",
          "score": 0,
          "created_utc": 1738037780.0,
          "replies": []
        },
        {
          "id": "m9l6gp3",
          "author": "ponziacs",
          "body": "I have the SE3 and some apps don't work correctly since the screen is so small.",
          "score": 0,
          "created_utc": 1738040248.0,
          "replies": []
        },
        {
          "id": "m9iw9di",
          "author": "mainguy",
          "body": "Nah big phones always win. More content more practicality. Small phones just feel better in the hand. Thats it..bad tradeoff.",
          "score": -8,
          "created_utc": 1738013383.0,
          "replies": [
            {
              "id": "m9iyfwm",
              "author": "Vitss",
              "body": "Sure, but appealing to you and your mindset group, there’s already every other phone on the market, including every other modern Apple option.",
              "score": 5,
              "created_utc": 1738013989.0,
              "replies": [
                {
                  "id": "m9j0erd",
                  "author": "mainguy",
                  "body": "yeah but more people probably want a big budget apple phone than a small one. It's why the mini didnt sell well.\n\nI had a mini for a bit. The weight was cool, but the compromise versus my old 11 pro max was insane. The screen was terrible for content and the speakers way weaker. Most people rely on phones for content consumpion 1-4h per day, so small phones will remain niche and likely a poor investment for apple.",
                  "score": -4,
                  "created_utc": 1738014541.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9jh0rf",
              "author": "ADHthaGreat",
              "body": "It’s a bad trade off for an object that you constantly hold in your hand..?",
              "score": 3,
              "created_utc": 1738019397.0,
              "replies": [
                {
                  "id": "m9jp7jc",
                  "author": "mainguy",
                  "body": "Yes, because most humans can hold 190g fine compared ro 140g...",
                  "score": -2,
                  "created_utc": 1738022021.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9j3eym",
          "author": "Initial_E",
          "body": "This being said, the SE is not a small phone. I placed it side by side with my iPhone 4 and it’s significantly bigger.",
          "score": -4,
          "created_utc": 1738015378.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9ggqjj",
      "author": "kittykrunk",
      "body": "I love my SE. such a good phone at a great price",
      "score": 76,
      "created_utc": 1737988534.0,
      "replies": [
        {
          "id": "m9hx2ru",
          "author": "None",
          "body": "I absolutely love my SE3! And I switched to this after breaking my 13 Mini, and I’ve owned much larger Pixels, Galaxies, and iPhones.\n\nI’ve never thought “damn it’s slow” and yes the battery life isn’t great, but all of my phones have never lasted me a full day after a few months of use. And it charges fast enough that it’s not an issue (although faster charging would be great).\n\nI love that it’s durable, and small, and I can rock it without a case without feeling bad if I drop it or don’t baby it.",
          "score": 8,
          "created_utc": 1738003519.0,
          "replies": []
        },
        {
          "id": "m9hg65r",
          "author": "Loki-Holmes",
          "body": "I only recently upgraded form my 2nd gen SE primarily because of battery life. Loved it otherwise and I’m sure tue new one will improve on it",
          "score": 4,
          "created_utc": 1737998852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9hyrfz",
      "author": "drunkfishes",
      "body": "The main draw of the SE for me is that it was small, and it kept the button/fingerprint unlock. Now that it doesn’t have either feature, what’s the point?",
      "score": 55,
      "created_utc": 1738003986.0,
      "replies": [
        {
          "id": "m9j1e0f",
          "author": "Stringsandattractors",
          "body": "I was a die hard Touch ID fan. Wouldn’t entertain going to Face ID. Hated the concept. \n\nHad Face ID for two years, now wouldn’t go back.",
          "score": 20,
          "created_utc": 1738014813.0,
          "replies": [
            {
              "id": "m9j27c0",
              "author": "drunkfishes",
              "body": "I’ve been without Touch ID/the button for about the same amount of time, still miss it. With Touch ID you can unlock your phone without looking, turning over in bed to grab your phone, driving (don’t text and drive), just worked better. And the button was so much more intuitive than fully extending your thumb to reach top left/top right of the screen to swipe down\n\nDifferent strokes!",
              "score": 10,
              "created_utc": 1738015037.0,
              "replies": [
                {
                  "id": "m9j2fgq",
                  "author": "Stringsandattractors",
                  "body": "Don’t disagree with the bed part, sometimes have to pull a weird angle.\n\nHaving both would be 👌🏻",
                  "score": 1,
                  "created_utc": 1738015100.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9khi88",
              "author": "eisbock",
              "body": "Face ID is great when it works, but you're lying if you say you don't cuss it out nearly every day. I swear I'm getting carpal tunnel from repeatedly swiping up over and over as it freaks out and fails to scan properly, especially at night or in the morning.\n\nThen I'll be checking my lock screen messages and let it linger too long so it re-locks, and it's THAT moment it decides I need to input my passcode for security purposes. Like I just had it unlocked literal seconds ago wtf.\n\nOne thing I'll never stop missing is the ability to unlock my phone with the thumb scanner as I'm taking it out of my pocket.",
              "score": 2,
              "created_utc": 1738031113.0,
              "replies": [
                {
                  "id": "m9lmhxl",
                  "author": "Stringsandattractors",
                  "body": "I’ve never had it re-lock when looking a notifications. Literally never!",
                  "score": 1,
                  "created_utc": 1738048240.0,
                  "replies": [
                    {
                      "id": "m9mzjwo",
                      "author": "eisbock",
                      "body": "It re-locks after 10 seconds. Pretty easy for that to happen if you've got several long notifications you're reviewing. I have to wiggle the screen to keep it from going dark.",
                      "score": 1,
                      "created_utc": 1738073645.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9gd6bf",
      "author": "ToastedGlass",
      "body": "unite fertile run unused slap obtainable marble gold voracious advise\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "score": 223,
      "created_utc": 1737987337.0,
      "replies": [
        {
          "id": "m9gy8fg",
          "author": "OperatorJo_",
          "body": "Used to think like that too but what I DO appreciate about it now is fast-tapping to my playing background music and the silent battery notification at 20% if I'm playing something on it vs. the full pausing on-screen notification out of nowhere. \n\nWould I prefer just not having the sensors visibly there and have something hidden? Sure. But I have to admit they've done a good job of taking an eyesore and giving it some smooth animations when things pop up on it (like whenever Face ID pops-up. It all looks smooth at least).",
          "score": 41,
          "created_utc": 1737993824.0,
          "replies": []
        },
        {
          "id": "m9hne8u",
          "author": "uncoolcentral",
          "body": "It’s interesting how discreet and discrete mean similar but different things. \n\n(One might say: “discreet” & “discrete” denote discreetly discrete distinctions!) \n\nAnd in this case either work with subtly different ends.",
          "score": 7,
          "created_utc": 1738000842.0,
          "replies": []
        },
        {
          "id": "m9gdev5",
          "author": "edtechman",
          "body": "Eh, the notch is just as annoying in full screen.",
          "score": 44,
          "created_utc": 1737987417.0,
          "replies": [
            {
              "id": "m9h0hr4",
              "author": "Barry_Ribena",
              "body": "I find that most of the time the notch actually doesn’t impose into 16:9 content whereas the Dynamic Island does",
              "score": 42,
              "created_utc": 1737994471.0,
              "replies": [
                {
                  "id": "m9j7jsm",
                  "author": "edtechman",
                  "body": "I mean maybe, but we're talking full screen here.",
                  "score": -6,
                  "created_utc": 1738016569.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9j28w8",
              "author": "Me-Shell94",
              "body": "The notch dissapears as it is not there to catch attention in any case. The island is made to interact, AND it’s surrounded by screen, so it intrudes waaaaaay more in day to day activity than the notch.",
              "score": 12,
              "created_utc": 1738015050.0,
              "replies": [
                {
                  "id": "m9j7e8y",
                  "author": "edtechman",
                  "body": "The notch doesn't disappear on full screen.",
                  "score": -3,
                  "created_utc": 1738016524.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9k69v4",
              "author": "None",
              "body": "The notch is more annoying and the Dynamic Island at least has some useful features.",
              "score": 1,
              "created_utc": 1738027480.0,
              "replies": [
                {
                  "id": "m9k8ekh",
                  "author": "thisischemistry",
                  "body": "So do a dynamic notch then… The only real difference between the notch and the island is that thin line of useless pixels next to the island.",
                  "score": 1,
                  "created_utc": 1738028161.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9gfwqh",
          "author": "joestaff",
          "body": "I had to Google what that even was. So it's just a cheap way to hide the camera hole?",
          "score": 25,
          "created_utc": 1737988255.0,
          "replies": [
            {
              "id": "m9gzser",
              "author": "SuperBAMF007",
              "body": "Sorta. It’s turning a hardware limitation and adding software features to soften the blow",
              "score": 10,
              "created_utc": 1737994273.0,
              "replies": []
            },
            {
              "id": "m9gkjzx",
              "author": "megatronchote",
              "body": "Utimately, yes, but design wise it's very clever.\n\nThey've made it so you can interact with things like the music player, calls, countdowns, etc.",
              "score": 32,
              "created_utc": 1737989765.0,
              "replies": [
                {
                  "id": "m9gm8jn",
                  "author": "RyanOfTheVille",
                  "body": "I just found out I can put live sports scores in the island through the Google app. I added the Commanders/Eagles game to my island yesterday and it was pretty cool",
                  "score": 20,
                  "created_utc": 1737990293.0,
                  "replies": [
                    {
                      "id": "m9h3ovn",
                      "author": "willeyh",
                      "body": "Parking tax meter and train tickets are also a great use for it.",
                      "score": 10,
                      "created_utc": 1737995371.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9ge661",
          "author": "Fearless-Edge714",
          "body": "It’s going to be there regardless with the face id hardware. Before the “dynamic island” it was an even larger notch.",
          "score": 8,
          "created_utc": 1737987674.0,
          "replies": []
        },
        {
          "id": "m9h1u9e",
          "author": "thisischemistry",
          "body": "The few pixels off to the side serve little purpose, they just highlight the fact that there's a hole in the display. I think the dynamic aspect is wonderful but that could have been done with the notch, too.\n\nIMO, if you need to have a cutout in the display then a notch is better than a hole.",
          "score": 6,
          "created_utc": 1737994851.0,
          "replies": []
        },
        {
          "id": "m9hhbtl",
          "author": "CrashingAtom",
          "body": "I have had a smart phone since 2006, and I never notice this stuff. My buddy pointed out the upsetting bezel to me in 2018, and I was so baffled. \n\nI guess growing up watching fuzzy 13” B&W television prepares you for minor inconveniences.",
          "score": 2,
          "created_utc": 1737999175.0,
          "replies": []
        },
        {
          "id": "m9j1ysn",
          "author": "Me-Shell94",
          "body": "I’ve hated it since release and am waiting for it to disappear before getting another iPhone, unless i switch back to android. Blows my tiny mind they put that front and center on a screen made for watching content.",
          "score": 1,
          "created_utc": 1738014972.0,
          "replies": []
        },
        {
          "id": "m9h2utn",
          "author": "metricshadow12",
          "body": "Exactly why I’m still on the old version of iPhones and I’m not upgrading until the notch/island is gone. If the phone breaks oh well maybe time to go to an android lol",
          "score": -1,
          "created_utc": 1737995137.0,
          "replies": []
        },
        {
          "id": "m9hvscb",
          "author": "Geekygamertag",
          "body": "What’s the Dynamic Island?",
          "score": 0,
          "created_utc": 1738003163.0,
          "replies": [
            {
              "id": "m9i1mpv",
              "author": "ToastedGlass",
              "body": "disgusted voracious plants public wine meeting seemly vegetable simplistic spotted\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
              "score": 2,
              "created_utc": 1738004788.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gl6pl",
      "author": "None",
      "body": "[deleted]",
      "score": 23,
      "created_utc": 1737989963.0,
      "replies": []
    },
    {
      "id": "m9i241i",
      "author": "garciawork",
      "body": "I don't know what a dynamic island is, but RIP to the home button. That makes me very sad. Makes me want to buy a couple spare current gen SE's just so I am set for a while.",
      "score": 17,
      "created_utc": 1738004922.0,
      "replies": []
    },
    {
      "id": "m9gtpml",
      "author": "Karu_1",
      "body": "Can they all please stop to let the camera stick out on the phones. It’s so annoying not being able to lay the phone flat on the table without a case. \nI hate using cases but they kinda force me because it’s just wobbling around otherwise.\n\nJust make the whole thing thicker and give it a ton more battery or get rid of some of the zoom",
      "score": 76,
      "created_utc": 1737992523.0,
      "replies": [
        {
          "id": "m9h33k1",
          "author": "thisischemistry",
          "body": "Yep, absolutely do not want a thinner phone with less battery. Also do not want a phone the size of an iPhone 14. Make a thicker, small form-factor phone with better battery!",
          "score": 15,
          "created_utc": 1737995206.0,
          "replies": [
            {
              "id": "m9hl0tx",
              "author": "teamcoltra",
              "body": "I've been asking for a thick phone with huge battery forever. It doesn't need to be old Nokia brick large but you could almost double the thickness of a modern iPhone and let me have 3 days of battery and preferably I can drop it. \n\nI realize that now you can basically charge a phone in 5 minutes so it's less needed.",
              "score": 8,
              "created_utc": 1738000192.0,
              "replies": [
                {
                  "id": "m9hlys7",
                  "author": "thisischemistry",
                  "body": "And folding isn't the answer either. A folding phone doubles the thickness but also doubles the amount of casing for the insides, as well as the hardware to do the folding, plus more screen.\n\nTake the iPhone mini form factor, make it thicker so there's more battery and no camera bump, done.",
                  "score": 4,
                  "created_utc": 1738000450.0,
                  "replies": [
                    {
                      "id": "m9i8kds",
                      "author": "G3N1S1S",
                      "body": "I’d buy this",
                      "score": 2,
                      "created_utc": 1738006728.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mbb1pcs",
                  "author": "Kind_Move2521",
                  "body": "I was a big fan of the Droid Turbo back in the old times",
                  "score": 1,
                  "created_utc": 1738856093.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9gxb83",
          "author": "envybelmont",
          "body": "I’ve been saying this for years. The Pro model should be able to last a day of heavy use. I’m talking a good amount of wifi hotspot with some long conference calls and video calls plus hours of screen time for email/chat/document review/etc. \n \nBack when I traveled regularly for work I would have to charge my phone half way through the day every day. What’s “pro” about that?",
          "score": 19,
          "created_utc": 1737993558.0,
          "replies": [
            {
              "id": "m9h2w96",
              "author": "frank3000",
              "body": "Imagine if Ford had the same Pro philosophy, the F-550 would have a 9 gallon diesel tank.",
              "score": 11,
              "created_utc": 1737995149.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9i4erb",
          "author": "Portatort",
          "body": "I am completely the opposite. \n\nThe bump means it doesn’t lay flat in the table which means it’s easy to pickup.  \n\nI don’t see how my life would be better if it lay perfectly flat",
          "score": 3,
          "created_utc": 1738005566.0,
          "replies": []
        },
        {
          "id": "m9gyuzs",
          "author": "OperatorJo_",
          "body": "Hear me out: a case. \n\nHonestly even if I could lay it flat I don't run phones bareback. My current case allows me to full lay-flat even with the fat camera module on my 14 Pro. And it's protected.",
          "score": 8,
          "created_utc": 1737994006.0,
          "replies": [
            {
              "id": "m9jh2zu",
              "author": "CormoranNeoTropical",
              "body": "For decades I didn’t buy cases for my phone. I also destroyed a phone on average once a year. \n\nNow I always keep my phone in a high end case, and my phones last until I decide to replace them. \n\nSeems kind of stupid not to use a case. \n\n(Why did I not get a case? Bc I was under the mistaken impression that cases were just to protect from scratches. Eventually I got a shock proof case.)",
              "score": 3,
              "created_utc": 1738019417.0,
              "replies": []
            },
            {
              "id": "m9h2bih",
              "author": "zzazzzz",
              "body": "i mean they literaly said they dont want to use a case.. and many ppl dont want an ugly case around their phones.",
              "score": 5,
              "created_utc": 1737994986.0,
              "replies": [
                {
                  "id": "m9h86yq",
                  "author": "OperatorJo_",
                  "body": "I know to each their own but I'll never get using something as volatile as a smartphone caseless. Literally the most fall-prone and scratch-prone piece of daily-use tech on the planet. \n\nA clear case at least detracts nothing from the phone. \n\nAll in all, not having a camera bump or lens protruding just isn't going to happen by any of the big-leaguers with how sensors are.\n\nCompanies aren't going to invest in making a fatter phone for it to be flat when the big companies themselves make cases. It would just make a way larger phone in the end for those that DO use cases. \n\nIf anything, they'll invest in making thinner devices so that when you slap on a case evntually it'll just be a thick as a current caseless phone in dimensions. At a certain thinness using a smartphone as we know it will be uncomfortable anyway on the hand.",
                  "score": 10,
                  "created_utc": 1737996621.0,
                  "replies": [
                    {
                      "id": "m9hihts",
                      "author": "KotaIsBored",
                      "body": "I had a 6s until only a month ago. When I first bought it I got a mophie case with it. Used it for years until the battery in the case stopped working. I didn’t bother getting a new case and still had the phone for a few more years. Now I have a 15 and have no desire to get a case for it. Phones are already too big nowadays and a case just makes them bigger. Pressing the actual buttons on the side of the phone feels a lot better than pressing them through whatever material the case is made out of. It’s a lot easier to clean your phone without a case and I’ve honestly found it much more convenient to just learn to not drop my phone instead of spending even more money on an already too expensive product and hoping that it holds up. I’ve seen plenty of people drop their phone from just a few feet and their phone stop working despite being in a case. It just isn’t worth it me.",
                      "score": 3,
                      "created_utc": 1737999498.0,
                      "replies": []
                    },
                    {
                      "id": "m9hg5mc",
                      "author": "zzazzzz",
                      "body": "there already is multiple phones without any camera bump.. \n\nand you not getting ppl not wanting to use a case is not really relevant tbh. the same way that i have never had a phone break or even shatter a screen in my life isnt relevant because both are just anectotes. \n\nand what ppl want is for phone manufacturers to innovate on the camera bump and flatten it not make phones fatter. \n\nmany ppl dont care the slightest about their phone camera and would gladly take a slightly worse camera in exchange for a flat back/ thinner phone.",
                      "score": 0,
                      "created_utc": 1737998848.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "m9hf2l0",
                  "author": "RedditCollabs",
                  "body": "So don't put an ugly case on it",
                  "score": 2,
                  "created_utc": 1737998546.0,
                  "replies": [
                    {
                      "id": "m9hgg40",
                      "author": "zzazzzz",
                      "body": "then the phone wobbles on the table",
                      "score": 2,
                      "created_utc": 1737998929.0,
                      "replies": [
                        {
                          "id": "m9hk0zb",
                          "author": "RedditCollabs",
                          "body": "Probably depends on the case, mine doesn't wobble",
                          "score": 2,
                          "created_utc": 1737999920.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m9i4me3",
                  "author": "Portatort",
                  "body": "I don’t want a case. \n\nI also don’t want a phone that’s an inch thick",
                  "score": 1,
                  "created_utc": 1738005626.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9hep70",
          "author": "RedditCollabs",
          "body": "Most of us have cases, so that's not really a issue for the majority",
          "score": 2,
          "created_utc": 1737998442.0,
          "replies": []
        },
        {
          "id": "m9hob62",
          "author": "kakey70",
          "body": "Steve Jobs would never...",
          "score": 1,
          "created_utc": 1738001098.0,
          "replies": [
            {
              "id": "m9hrajk",
              "author": "Ryeballs",
              "body": "I would very much argue Steve Jobs especially would!\n\nA big part of his vision was aesthetic and a wobbly-ass phone with an odd bump sticking out of it is antithetical to that.",
              "score": 4,
              "created_utc": 1738001925.0,
              "replies": [
                {
                  "id": "m9hweee",
                  "author": "kakey70",
                  "body": "Which is it? \n\nI'm saying he would never approve of the camera bump. It's a lazy, terrible design.",
                  "score": 1,
                  "created_utc": 1738003333.0,
                  "replies": [
                    {
                      "id": "m9hzh3d",
                      "author": "Ryeballs",
                      "body": "Oh ok yeah! That's what I am saying too... but like... louder!\n\nSeriously though, I was really really hoping the camera module would be a place they cheaped out on even more, I would absolutely trade 2x optical zoom for not having a camera bump.",
                      "score": 3,
                      "created_utc": 1738004181.0,
                      "replies": []
                    },
                    {
                      "id": "m9i5j4a",
                      "author": "Portatort",
                      "body": "Steve jobs would have approved thinness over everything else. \n\nThe only difference is he would have sold the benefits of a camera bump harder than anyone and people probably would have eaten it up.",
                      "score": 1,
                      "created_utc": 1738005879.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m9kedat",
          "author": "None",
          "body": "What do you buy a new phone every time you drop it?\n\nYou rich fuck. Why do you hate cases?",
          "score": 1,
          "created_utc": 1738030086.0,
          "replies": [
            {
              "id": "m9ll5dl",
              "author": "Karu_1",
              "body": "i drop my phone all the time and it not once broke. Had iPhones for 10+ years and i only ever replaced them because the battery was bad.\nNot a single one of them even had a crack on the screen, absolutely nothing.\nThey are durable af, I just used a casing with the 12 mini because of this damn camera sticking out. But i now removed it again because it’s annoying to use the phone when the edges are obscured by the case",
              "score": 1,
              "created_utc": 1738047480.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9j96mr",
      "author": "tofulo",
      "body": "Small phones 4 lyfe",
      "score": 9,
      "created_utc": 1738017046.0,
      "replies": []
    },
    {
      "id": "m9j6izo",
      "author": "RED-DOT-MAN",
      "body": "I am going to miss the home button. Really liked it and one of the reasons I have stuck with the    SE line. Going to keep my SE3 until the wheels fall off.",
      "score": 6,
      "created_utc": 1738016274.0,
      "replies": []
    },
    {
      "id": "m9gqeqh",
      "author": "shoe465",
      "body": "I want my wife to upgrade but she won't if it doesn't have the home button/finger print sensor. They should always keep the SE model with that feature.",
      "score": 19,
      "created_utc": 1737991560.0,
      "replies": [
        {
          "id": "m9hpv0k",
          "author": "thefredwest",
          "body": "I will also die on the home button hill and my husband doesn’t understand",
          "score": 14,
          "created_utc": 1738001529.0,
          "replies": []
        },
        {
          "id": "m9hg3no",
          "author": "Eraser92",
          "body": "FaceID is light years ahead of finger print unlocking. When I first used it I swore to never go back.",
          "score": -3,
          "created_utc": 1737998833.0,
          "replies": [
            {
              "id": "m9hsmqq",
              "author": "Murky_Crow",
              "body": "Face ID took a little bit to get there, but honestly nothing will be better than the fingerprint ID back then.\n\nIt was so nice being able to unlock my phone without looking at it.",
              "score": 7,
              "created_utc": 1738002291.0,
              "replies": [
                {
                  "id": "m9j70y0",
                  "author": "therealgodfarter",
                  "body": "Pretty sure there’s a setting you can turn off so you don’t have to look at it",
                  "score": 1,
                  "created_utc": 1738016417.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m9hek1e",
          "author": "SteltonRowans",
          "body": "Has she used Face ID? I get it if she likes the home button but finger print sensor is a weaker security feature compared to Face ID. It’s easier to spoof and you can physically force someone to unlock their phone. You can’t hold someone’s eyes open without blocking someone’s face.",
          "score": -2,
          "created_utc": 1737998402.0,
          "replies": [
            {
              "id": "m9hxrj3",
              "author": "None",
              "body": "I’ve used Face ID (I downgraded from a 13 Mini to a SE3). I don’t miss FaceID and if someone is going to force my fingerprint, they’re going to force my face to open the phone. I like having a clickable home button and that TouchID seems to work more consistently and reliably for me.\n\nThe other thing I didn’t like with FaceID is that it would Auto Unlock when I picked my phone up (maybe that’s a setting). ",
              "score": 9,
              "created_utc": 1738003711.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gdni9",
      "author": "slavchungus",
      "body": "honestly the design isn't bad maybe one day we'll get the all screen design while keeping some functionality of the dynamic island",
      "score": 19,
      "created_utc": 1737987499.0,
      "replies": [
        {
          "id": "m9gecur",
          "author": "Fearless-Edge714",
          "body": "Under screen camera tech is progressing pretty rapidly so apple will probably find a way to hide it entirely at some point.",
          "score": 8,
          "created_utc": 1737987736.0,
          "replies": [
            {
              "id": "m9gfp3w",
              "author": "MattBrey",
              "body": "Apple has the added problem of wanting to keep the face id camera desperately instead of using a fingerprint sensor. So while normal camera hardware is progressing towards better under display cameras, the specific tech they use is much much harder to get right.",
              "score": 14,
              "created_utc": 1737988184.0,
              "replies": [
                {
                  "id": "m9h7xlf",
                  "author": "IMPolo",
                  "body": "Pixel has the best of both worlds with an ultrasonic fingerprint reader and they made their face unlock secure enough to be used with banking apps and anything else that you can use touch for, without a bar across the screen. The only feature missing compared to TouchID is the infrared sensors that allow you to measure your face, but I don't think 98% of people are going to be doing that.",
                  "score": -1,
                  "created_utc": 1737996549.0,
                  "replies": []
                },
                {
                  "id": "m9ghdr2",
                  "author": "slavchungus",
                  "body": "honestly i dont miss touchid and even the underscreen ones on my old Android  didn't work so well granted they weren't ultrasonic i just feel like display tech is moving so fast but apple hasn't upgraded from face id since the x simply making the notch smaller",
                  "score": -6,
                  "created_utc": 1737988748.0,
                  "replies": [
                    {
                      "id": "m9gj4e4",
                      "author": "MattBrey",
                      "body": "I think the fingerprint sensor on the power button is the easiest and fastest biometric security measure. I agree the underscreen ones are not as fast in general and imo a lot of the time they're not even positioned in a place that's comfortable to press.\n\nAlthough I don't like face id at all. It's nice as an extra but it feels awkward to me as the only security method. And I simply couldn't tolerate the notch. Idk how iphone users do it. The dynamic island version is fine, but the iphone 11-12 was obnoxiously big",
                      "score": 5,
                      "created_utc": 1737989309.0,
                      "replies": [
                        {
                          "id": "m9gktnc",
                          "author": "slavchungus",
                          "body": "i think overtime people got used to it but yeah pre dynamic island was rough i only joined during the dynamic island era with the 15pm after switching between the iphone 7 and couple different Android phones the side fingerprint scanner really is great but  i doubt apple will implement it in their phones despite some ipads having it in the button",
                          "score": -3,
                          "created_utc": 1737989848.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9gek75",
              "author": "slavchungus",
              "body": "that would be nice i wonder if they can find a way to include opticid as well would be a good feature for the 20 series it uses the same sensors as faceid",
              "score": 1,
              "created_utc": 1737987804.0,
              "replies": []
            },
            {
              "id": "m9i5yf4",
              "author": "Portatort",
              "body": "There’s still no way to put a camera behind a display without massively compromising the image capture. \n\nAnd there likely never will be. \n\nCameras are particularly sensitive to anything placed between them and the image they are capturing. \n\nThe transparent OLEDs that are being demoed are extremely cool but I don’t believe they are optically transparent in the lens imaging sense",
              "score": 1,
              "created_utc": 1738005998.0,
              "replies": []
            },
            {
              "id": "m9h4my8",
              "author": "rudimentary-north",
              "body": "Under screen cameras have been around for about half a decade, it’s not an unsolved problem, Apple are just choosing not to do it",
              "score": 1,
              "created_utc": 1737995637.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9jfqyy",
          "author": "skalpelis",
          "body": "That’s a very protuberant camera lens though",
          "score": 1,
          "created_utc": 1738019004.0,
          "replies": [
            {
              "id": "m9jg22o",
              "author": "slavchungus",
              "body": "yeah idk why they insist on having such big camera bumps i doubt its a telephoto most likely will be an ultrawide ans require a case ro remove the desk wobble",
              "score": 1,
              "created_utc": 1738019100.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gkmi4",
      "author": "CaptainR3x",
      "body": "I just want a cheaper iPhone that’ll last 5-6 years and allow me to stay in the apple environment",
      "score": 16,
      "created_utc": 1737989787.0,
      "replies": [
        {
          "id": "m9hl9iy",
          "author": "KotaIsBored",
          "body": "I had a 6s for eight years and only recently switched to a 15. They’re easy to find secondhand and, if you take care of it, will only need a new battery every few years. I’d still be using mine if I hadn’t broken the home button.",
          "score": 3,
          "created_utc": 1738000259.0,
          "replies": [
            {
              "id": "m9jtvbt",
              "author": "CaptainR3x",
              "body": "I'm scared of second hand ngl, especially with a product that expensive. If the new SE is reasonably price I'll buy it, if not I'll definitely go second hand.",
              "score": 1,
              "created_utc": 1738023524.0,
              "replies": [
                {
                  "id": "m9kjgvu",
                  "author": "jdubtrey",
                  "body": "Get a refurb from Apple.com.  It’s essentially good as new (and is even eligible for Apple Pay).",
                  "score": 2,
                  "created_utc": 1738031763.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9lj99w",
              "author": "None",
              "body": "I’m using an 8 as I type.",
              "score": 1,
              "created_utc": 1738046445.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m9jyr16",
          "author": "ashtefer1",
          "body": "I have an XR since 2019. It’s pretty doable with an iPhone.",
          "score": 1,
          "created_utc": 1738025078.0,
          "replies": []
        },
        {
          "id": "m9k31zz",
          "author": "None",
          "body": "money telephone squash bright faulty shaggy chief mourn uppity onerous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "score": 1,
          "created_utc": 1738026455.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9gpwk3",
      "author": "YahYahY",
      "body": "Am I the only here that doesn’t know that tf the Dynamic Island is",
      "score": 15,
      "created_utc": 1737991409.0,
      "replies": [
        {
          "id": "m9grfa8",
          "author": "_Kelly_A_",
          "body": "Similar to a Static Island, but it moves around occasionally. \n\nI absolutely made this up",
          "score": 15,
          "created_utc": 1737991855.0,
          "replies": []
        },
        {
          "id": "m9hg1kb",
          "author": "branflake777",
          "body": "I found this: \n\n> The Dynamic Island is a pill-shaped display on the iPhone that shows alerts, notifications, and updates. It can appear at the top of the Home Screen or the top of an active app.",
          "score": 2,
          "created_utc": 1737998817.0,
          "replies": []
        },
        {
          "id": "m9gv02a",
          "author": "Aramis444",
          "body": "[This should help](https://www.google.com/)",
          "score": -8,
          "created_utc": 1737992895.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9gh33f",
      "author": "resil_update_bad",
      "body": "There's something so appealing about a single camera sensor instead of the hideous multi lens monster that is so commonplace in smartphones. \n\nIf the battery life isn't shit this could be my next phone.",
      "score": 13,
      "created_utc": 1737988651.0,
      "replies": [
        {
          "id": "m9kdmbw",
          "author": "ThrowawayBlueYeti",
          "body": "Coming from a 13 mini, if it had 2 cameras it would be a no brainer. I'm thinking about it but the camera is my most used feature on my phone, especially the zoom and wide angle.",
          "score": 1,
          "created_utc": 1738029843.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9iasrx",
      "author": "zetnomdranar",
      "body": "Time to really consider a dumb phone.  I’ve had my SE for over two years and it’s time to let go.  It’s over for the small form factor",
      "score": 3,
      "created_utc": 1738007350.0,
      "replies": []
    },
    {
      "id": "m9ii51z",
      "author": "gside876",
      "body": "Sadly no more fingerprint sensor.  These post-fingerprint sensor designs suck",
      "score": 3,
      "created_utc": 1738009423.0,
      "replies": []
    },
    {
      "id": "m9jd2z5",
      "author": "JaxAustin",
      "body": "Love my Touch ID and don’t want to part with it. Maybe I’ll just get a new se3",
      "score": 3,
      "created_utc": 1738018197.0,
      "replies": []
    },
    {
      "id": "m9jyeqa",
      "author": "ashtefer1",
      "body": "Damn was hoping it was gonna take the smaller designs of the mini.",
      "score": 3,
      "created_utc": 1738024968.0,
      "replies": []
    },
    {
      "id": "m9hmsue",
      "author": "Walktrotcantergallop",
      "body": "I don’t give a flying fuck about the island",
      "score": 6,
      "created_utc": 1738000679.0,
      "replies": []
    },
    {
      "id": "m9hw82e",
      "author": "None",
      "body": "BOO HISS 👎 \n\nI want a small phone. Sure my SE3’s battery lasts half a day now, but I love not having a case and it charges fast enough that it’s not an issue. \n\nAlso, what are you people doing with your phone that I’m missing out on? (Serious question) There’s nothing about my SE3 that I’ve thought, “Man I wish I had a new iPhone so I could do x, y, and z.” Except the camera, but honestly, are most people really that into photography?",
      "score": 7,
      "created_utc": 1738003283.0,
      "replies": [
        {
          "id": "m9iftd2",
          "author": "bofh000",
          "body": "I don’t know why you are getting downvoted when your are expressing your personal opinion. With which I agree, btw, phones are already ridiculously large. Each new model makes them less portable.",
          "score": 1,
          "created_utc": 1738008767.0,
          "replies": []
        },
        {
          "id": "m9jnd93",
          "author": "Next-Abalone-267",
          "body": "Honestly, people just get bored even if the phone is working perfectly fine. Saying this from experience. I currently have LG G8x which is working perfectly fine but not a single passes without me wanting to upgrade. I f the rumors about iPhone se having dynamic island are true, I might give in.",
          "score": 1,
          "created_utc": 1738021420.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9gvxx2",
      "author": "Liammistry",
      "body": "The Dynamic Island just doesn’t work on the smaller phones… it cuts into all content. Which doesn’t happen on the plus and max phones… bring back the notch!",
      "score": 2,
      "created_utc": 1737993165.0,
      "replies": []
    },
    {
      "id": "m9ltqtx",
      "author": "ciccioig",
      "body": "WE \nWANT \nSMALL\nPHONES.\n\n(#wemasturbateonotherdevices)",
      "score": 2,
      "created_utc": 1738052636.0,
      "replies": []
    },
    {
      "id": "m9gjlm2",
      "author": "SloshedJapan",
      "body": "Glad I bought two SE3s till they bring back the Home button in 2030",
      "score": 5,
      "created_utc": 1737989463.0,
      "replies": [
        {
          "id": "m9h7qn4",
          "author": "treehugger100",
          "body": "I had read the projections for what the next SE would be like. I bought the current one in August because I figured I wouldn’t want the one coming. I might break down and buy another one just to have it for when I need a new one.",
          "score": 2,
          "created_utc": 1737996496.0,
          "replies": []
        },
        {
          "id": "m9govrb",
          "author": "HimikoHime",
          "body": "I already dread the day I have to teach my older family members how to use the phone without home button",
          "score": 2,
          "created_utc": 1737991104.0,
          "replies": []
        },
        {
          "id": "m9lg5we",
          "author": "Tepigg4444",
          "body": "Yeah looks like I'll be upgrading to the SE 3 now since the 4 is a disappointment. Anyone know if its safe to wait for the SE 4 to come out so I can get the SE 3 for cheaper, or does it become really hard to get the old version basically right away? I'd really rather buy one new than a used one or from sketchy reseller",
          "score": 1,
          "created_utc": 1738044812.0,
          "replies": [
            {
              "id": "m9m1d79",
              "author": "SloshedJapan",
              "body": "It will be harder to get a 256gb version",
              "score": 1,
              "created_utc": 1738057572.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gvlcb",
      "author": "nissanfan64",
      "body": "I’ll probably upgrade to this when it comes out. My 13 never impressed me much and its battery capacity is down to like 79%. Tanked super hard this fall. \n\nAlso I kinda despise the camera and the way it post produces the photos. They look awful and fake.",
      "score": 2,
      "created_utc": 1737993065.0,
      "replies": [
        {
          "id": "m9gzdy5",
          "author": "just_chilling_too",
          "body": "Just change the battery , it’s cheaper",
          "score": 6,
          "created_utc": 1737994158.0,
          "replies": [
            {
              "id": "m9h0jfd",
              "author": "nissanfan64",
              "body": "Eh. Hoping to get a better camera too. \n\nAnd I’ll be honest I beat the absolute hell out of my phones. This Spigen tough-armor case I have is gouged to hell. I could just change the battery but paying like $500 for a new SE would be a better option.",
              "score": 3,
              "created_utc": 1737994484.0,
              "replies": [
                {
                  "id": "m9hz2zc",
                  "author": "primaryrhyme",
                  "body": "Not sure the camera would be better than the 13, they have to cut costs somewhere. Also they’ve been careful in the past to kneecap the SE enough so it doesn’t cannibalize flagship sales (which are much more profitable), if they made the camera too good I feel like too many people wouldn’t bother with the regular iPhone.",
                  "score": 2,
                  "created_utc": 1738004075.0,
                  "replies": [
                    {
                      "id": "m9hzrab",
                      "author": "nissanfan64",
                      "body": "I just hate this new post processing shit they do. It looks so bad 90% of the time. If they don’t have that and cut down to one camera I truly think I’d like it more.",
                      "score": 1,
                      "created_utc": 1738004260.0,
                      "replies": []
                    },
                    {
                      "id": "m9kduhl",
                      "author": "PNF2187",
                      "body": "A lot of the rumour mill seems to be pointing towards a single 48MP sensor. They can knee cap the camera compared to the flagships, but it's probably more cost effective at this point to use the sensor from either the 15 or 16 than it is dig up an older 12MP sensor that's inferior to the one on the 13. Not having the Ultra Wide is enough for some people to go straight to the 15 or 16, and while it's technically a downgrade from the 13 in that regard, I personally rarely used the Ultra Wide on my 13 because how lacking it was.",
                      "score": 1,
                      "created_utc": 1738029916.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "m9hx6ek",
              "author": "None",
              "body": "If you swap the battery don’t you lose the water protection?",
              "score": 1,
              "created_utc": 1738003547.0,
              "replies": [
                {
                  "id": "m9i9rvy",
                  "author": "sauprankul",
                  "body": "If it's done by Apple, no.",
                  "score": 1,
                  "created_utc": 1738007064.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m9jgga1",
              "author": "CormoranNeoTropical",
              "body": "This. I’m probably going to get a second new battery for my iPhone 13 Pro this year.",
              "score": 1,
              "created_utc": 1738019223.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gv02l",
      "author": "Game2Late",
      "body": "Bring back the Home button or I switch to Android.",
      "score": 6,
      "created_utc": 1737992895.0,
      "replies": [
        {
          "id": "m9hg6gr",
          "author": "Eraser92",
          "body": "Why? It’s so unnecessary and ugly",
          "score": -6,
          "created_utc": 1737998855.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m9gspo0",
      "author": "bob69joe",
      "body": "The notch is a better design than the island. Gives more actually useable screen area.",
      "score": 1,
      "created_utc": 1737992232.0,
      "replies": [
        {
          "id": "m9gvdom",
          "author": "Aramis444",
          "body": "It’s basically identical. And it allows for an interesting way to provide information and shortcuts.",
          "score": 2,
          "created_utc": 1737993004.0,
          "replies": [
            {
              "id": "m9h3f5c",
              "author": "thisischemistry",
              "body": "The notch can do the same, the main difference between the two is a few useless pixels on the side. Make the notch dynamic in the same way as the island.",
              "score": 2,
              "created_utc": 1737995295.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m9gfz0g",
      "author": "lphartley",
      "body": "I wonder if the bezels will also be similar to notch iPhones.",
      "score": 1,
      "created_utc": 1737988277.0,
      "replies": []
    },
    {
      "id": "m9i5mjg",
      "author": "CoochieSnotSlurper",
      "body": "This wont sell well at that size",
      "score": 1,
      "created_utc": 1738005906.0,
      "replies": []
    },
    {
      "id": "m9i73da",
      "author": "Hoenigkuchenpferd",
      "body": "I so hope the camera app has the \"2x\" button for some digital zoom. The one-camera design looks great!",
      "score": 1,
      "created_utc": 1738006317.0,
      "replies": []
    },
    {
      "id": "m9ixrzp",
      "author": "mysecondaccountanon",
      "body": "Gosh I miss small phones, headphone jacks, and home buttons",
      "score": 1,
      "created_utc": 1738013804.0,
      "replies": []
    },
    {
      "id": "m9j2iz0",
      "author": "alisnd89",
      "body": "How are the cameras on these se comparable to which iPhone 🤔",
      "score": 1,
      "created_utc": 1738015126.0,
      "replies": []
    },
    {
      "id": "m9j8i0b",
      "author": "Josh_The_Joker",
      "body": "I bought (and still own) the 13 pro because I loved the ProMotion. I will be very sad to give it up, but not sure I can justify the increased cost of purchasing a replacement that still has that. This phone is likely going to be $550 or less and have pretty much everything I need outside of the 120hz. Think I’m gonna have to suck it up.",
      "score": 1,
      "created_utc": 1738016847.0,
      "replies": []
    },
    {
      "id": "m9jhiq1",
      "author": "Tired8281",
      "body": "It's so dynamic, it's not always there!",
      "score": 1,
      "created_utc": 1738019552.0,
      "replies": []
    },
    {
      "id": "m9lig1k",
      "author": "OptimizedEarl",
      "body": "I hate the Dynamic Island letting everyone know when I’m recording",
      "score": 1,
      "created_utc": 1738046006.0,
      "replies": []
    },
    {
      "id": "m9mpvmf",
      "author": "TheGameboy",
      "body": "No button, no deal for me. I don’t care about Touch ID or not, what I do care about it not having to do an arbitrary gesture to get my phone to do something. I’m 31 and I cannot grasp “swipe up from this area to do a thing” because every time I try on my wife’s iPhone 14, I hit the wrong area when I swipe. Plus, a notch/island makes full screen feel weird to me.",
      "score": 1,
      "created_utc": 1738070182.0,
      "replies": [
        {
          "id": "map52w6",
          "author": "CosmicPurrrs",
          "body": "31 isnt old my man",
          "score": 2,
          "created_utc": 1738564821.0,
          "replies": [
            {
              "id": "maq5ug7",
              "author": "TheGameboy",
              "body": "I just want physical buttons",
              "score": 1,
              "created_utc": 1738585916.0,
              "replies": [
                {
                  "id": "mashqdg",
                  "author": "CosmicPurrrs",
                  "body": "The only physical button you're missing is the home button. Wheres the problem? Get an android if you like pressing specific areas on a screen. But even they copied the iOS gestures. Ive used all three and much prefer swipping its so much faster. Even your se doesnt have a physical button its a touch sensitive button and the phones haptic engine vibrates to simulate a click wich has been the case since like the iPhone 7-8 iirc.",
                  "score": 2,
                  "created_utc": 1738611742.0,
                  "replies": [
                    {
                      "id": "masjdyf",
                      "author": "TheGameboy",
                      "body": "I’m aware, but it’s a dedicated space with a dedicated and predictable set of functions. I’m kind of locked in to the apple environment.",
                      "score": 2,
                      "created_utc": 1738612199.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m9my9z5",
      "author": "ShitImDelicious",
      "body": "Me and my SE 2 are scared to make this leap lol",
      "score": 1,
      "created_utc": 1738073209.0,
      "replies": []
    },
    {
      "id": "m9n5tyd",
      "author": "BurnTheAbaddon",
      "body": "I have an iPhone 12 Pro but this is one of the phones I actually want since it’s affordable lol",
      "score": 1,
      "created_utc": 1738075698.0,
      "replies": []
    },
    {
      "id": "m9rx0tu",
      "author": "SFanatic",
      "body": "15 Pro user here the dynamic island is bullshit. It’s just a permanent island that they sometimes have a black banner over to kind of hide it but it’s still perpetually there and it can’t possibly move because there’s an actual camera there. You can’t just move the camera sensor it’s a physical thing in the iPhone. It’s a static island. I hate this marketing.",
      "score": 1,
      "created_utc": 1738127732.0,
      "replies": []
    },
    {
      "id": "m9z20tp",
      "author": "None",
      "body": "The one camera lens on the back makes me happy to see.  I will get it to replace my 14 plus for sure.  Multiple camera lenses on the back of a phone give me the heebie jeebies… I’m weird",
      "score": 1,
      "created_utc": 1738221048.0,
      "replies": []
    },
    {
      "id": "makbgnf",
      "author": "Bknelly83",
      "body": "There is no way it's coming out with that deep camera ring. Apple would never do that.",
      "score": 1,
      "created_utc": 1738509477.0,
      "replies": [
        {
          "id": "map4zj6",
          "author": "CosmicPurrrs",
          "body": "You sure about that chief",
          "score": 1,
          "created_utc": 1738564771.0,
          "replies": [
            {
              "id": "mc6sx58",
              "author": "Bknelly83",
              "body": "Positive 🤣🤣",
              "score": 1,
              "created_utc": 1739284819.0,
              "replies": [
                {
                  "id": "mcaaxpl",
                  "author": "CosmicPurrrs",
                  "body": "Oh shit boys we have an apple leaker. Apple entered the chat and wants to know your location",
                  "score": 1,
                  "created_utc": 1739321331.0,
                  "replies": [
                    {
                      "id": "mcazorn",
                      "author": "Bknelly83",
                      "body": "Not a leaker, just assuming you saw the same picture as me today which Spigen dropped that doesn’t show this stupid quarter inch isolated camera tube. You know…..the same design that apple uses for every other model.",
                      "score": 1,
                      "created_utc": 1739329827.0,
                      "replies": [
                        {
                          "id": "mcb4ezt",
                          "author": "CosmicPurrrs",
                          "body": "Im just messing with you homie. I saw that picture like yesterday* where the fuck are you AT. Mfs is LATE",
                          "score": 1,
                          "created_utc": 1739331589.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mb5csv3",
      "author": "None",
      "body": "I think the notch is a win tbh.",
      "score": 1,
      "created_utc": 1738780106.0,
      "replies": []
    },
    {
      "id": "m9hy5lj",
      "author": "kiwi-kaiser",
      "body": "That's so weird and annoying from a developer perspective. Now we have another 7-8 years were we can't count on people having the Dynamic Island.",
      "score": 0,
      "created_utc": 1738003820.0,
      "replies": []
    },
    {
      "id": "m9gi6e9",
      "author": "None",
      "body": "Shit company farts out poop.\n\nMore news at 7.",
      "score": -13,
      "created_utc": 1737989007.0,
      "replies": []
    },
    {
      "id": "m9mao7l",
      "author": "fsfaith",
      "body": "Nothing matters if the price isn't right.",
      "score": 0,
      "created_utc": 1738063223.0,
      "replies": []
    },
    {
      "id": "m9inrxy",
      "author": "None",
      "body": "The horror! Shame, Apple, shame\n\n![gif](giphy|vX9WcCiWwUF7G|downsized)",
      "score": -1,
      "created_utc": 1738011018.0,
      "replies": []
    }
  ]
}