{
  "post": {
    "title": "macOS dropping support for AirPort/Time Capsule disk Time Machine backups next year",
    "author": "chrisdh79",
    "id": "1l82ukc",
    "score": 797,
    "created_utc": 1749572058.0,
    "selftext": "",
    "num_comments": 84,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l82ukc/macos_dropping_support_for_airporttime_capsule/"
  },
  "comments": [
    {
      "id": "mx1ksb0",
      "author": "_paag",
      "body": "I hope they don’t decide to axe Time Machine altogether. I use it with my NAS and find it to be a remarkable function.",
      "score": 316,
      "created_utc": 1749573521.0,
      "replies": [
        {
          "id": "mx1x84p",
          "author": "Trekintosh",
          "body": "Yeah Time Machine is the only built-in backup solution worth a darn ",
          "score": 155,
          "created_utc": 1749576940.0,
          "replies": [
            {
              "id": "mx20j2k",
              "author": "UVVmail",
              "body": "Which still to-date doesn't have a function to manually clean up old backups.",
              "score": 47,
              "created_utc": 1749577838.0,
              "replies": [
                {
                  "id": "mx2jygx",
                  "author": "Trekintosh",
                  "body": "Yeah, the fact that the best default option is still obnoxious is really a condemnation of all OS companies, isn’t it?",
                  "score": 30,
                  "created_utc": 1749583305.0,
                  "replies": []
                },
                {
                  "id": "mx3igvb",
                  "author": "Albanian-Nomad",
                  "body": "You can do it with terminal.",
                  "score": 7,
                  "created_utc": 1749593316.0,
                  "replies": [
                    {
                      "id": "mx5dxt9",
                      "author": "UVVmail",
                      "body": "I'm a long time Linux user. Of course I could do it via terminal if there was such an option.",
                      "score": -3,
                      "created_utc": 1749618086.0,
                      "replies": [
                        {
                          "id": "mx5f9zg",
                          "author": "Mistrblank",
                          "body": "There is",
                          "score": 8,
                          "created_utc": 1749618745.0,
                          "replies": [
                            {
                              "id": "mx5fu8p",
                              "author": "UVVmail",
                              "body": "You are probably talking about this approach https://apple.stackexchange.com/questions/281614/how-to-delete-tmutil-delete-all-old-backups-from-timemachine-keep-only-curre\nI did try it long ago, but don't remember already what didn't work and I gave up.",
                              "score": 1,
                              "created_utc": 1749619027.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mx2r7xp",
              "author": "Interesting_Ghosts",
              "body": "Carbon copy cloner is fairly inexpensive and it works great. It is much more reliable than Time Machine since you can verify backups and search them manually. \n\nAlso you can create bootable backups. Been using it for 10 years",
              "score": 15,
              "created_utc": 1749585394.0,
              "replies": [
                {
                  "id": "mx4f1u3",
                  "author": "Sevallis",
                  "body": "It's also what you want if you are trying to backup anything besides your internal disk.",
                  "score": 3,
                  "created_utc": 1749604305.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mx21k4f",
          "author": "0x831",
          "body": "Be very careful. I used to do this and noticed that Time Machine will *appear* to be working and doing what you expect but will silently corrupt network based backups. Something in the TM code doesn’t handle latency variations very well and will cause data corruption and it will not be reported. I retried with new drives and had the same problem. If it’s over a wired connection I think you’re less likely to run into a problem but don’t back up to a NAS over WiFi using TM. Someday you’ll regret it.",
          "score": 55,
          "created_utc": 1749578116.0,
          "replies": [
            {
              "id": "mx4mn2h",
              "author": "jonny55555",
              "body": "Yep, I stopped using Time Machine because the backup got corrupted constantly. I recall I was able to update the frame size or something for Wi-Fi which helped but it didn’t eliminate the problem.",
              "score": 1,
              "created_utc": 1749606969.0,
              "replies": []
            },
            {
              "id": "mxgnlvv",
              "author": "None",
              "body": "Happens to me, too. Absolutely zero trust in this shit, I stopped using it altogether after it failed on me 3 times like this.",
              "score": 1,
              "created_utc": 1749767038.0,
              "replies": []
            },
            {
              "id": "mx4765m",
              "author": "ryaaan89",
              "body": "Yeah, I have _never_ gotten network Time Machine backup to work correctly…",
              "score": 1,
              "created_utc": 1749601554.0,
              "replies": [
                {
                  "id": "mx5h7rg",
                  "author": "Mondernborefare",
                  "body": "What? It’s been reliable forever.",
                  "score": 3,
                  "created_utc": 1749619733.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mx4ilgg",
              "author": "shasen1235",
              "body": "But to my curious, Apple, a company that aims for simplicity more than anyone else. Would rather axe the function than properly fix it? I mean their SMB performance has been tanking and unreliable for ages and that may be the reason for TM over Wifi to fail. And what's their alternate solution for us? A USB drive?",
              "score": 1,
              "created_utc": 1749605554.0,
              "replies": [
                {
                  "id": "mx4vdpz",
                  "author": "sylfy",
                  "body": "Their alternative solution is iCloud backups. Which is a better solution for the average user.",
                  "score": 2,
                  "created_utc": 1749610130.0,
                  "replies": [
                    {
                      "id": "mx4z2jp",
                      "author": "shasen1235",
                      "body": "I'm not sure about this. iCloud is good for light backup like iPhone/iPad settings, photos and videos. But when it comes to full Mac backup especially like I have a 1TB MacBook, sending data this big will not only clog my bandwidth and a bigger pain when restoring.",
                      "score": 4,
                      "created_utc": 1749611572.0,
                      "replies": [
                        {
                          "id": "mx51x6y",
                          "author": "sylfy",
                          "body": "Fair enough, that’s true. Full system backups are probably not a consideration. iCloud backup works well when all your applications are installed from and managed through a centralised repository/package manager, like the App Store on iOS. \n\nFor people with lots of applications not installed through the App Store on MacOS (which is probably many people), this will require large application backups and restores.",
                          "score": 1,
                          "created_utc": 1749612728.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mx4rl3c",
                  "author": "0x831",
                  "body": "Yeah I suspect it is the underlying protocol or at least an interaction with it.",
                  "score": 1,
                  "created_utc": 1749608717.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mx22iaq",
          "author": "is-this-now",
          "body": "No fooling.  If their solution is back up to ICloud we’ll be paying for that the rest our lives and the prices will just creep up.",
          "score": 27,
          "created_utc": 1749578376.0,
          "replies": [
            {
              "id": "mx26oz9",
              "author": "TheSpatulaOfLove",
              "body": "This is one reason why I refuse to use cloud stuff for my personal items.   Local  only.",
              "score": 11,
              "created_utc": 1749579540.0,
              "replies": [
                {
                  "id": "mx3g35e",
                  "author": "taynt3d",
                  "body": "They can pry my local backups out of my cold dead hands. Even more true given 10T drives are so cheap now I just plug them in and out of a dock like they are USB sticks lol.",
                  "score": 6,
                  "created_utc": 1749592566.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mx26pwl",
          "author": "GeektimusPrime",
          "body": "Seems they are referring to those specific products, not the TimeMachine service. \n\nFTA:\n“For alternatives, network-attached storage (NAS) solutions like Synology offer a way to continue using Time Machine for wireless backups over the local network.”",
          "score": 9,
          "created_utc": 1749579548.0,
          "replies": [
            {
              "id": "mx26zyf",
              "author": "_paag",
              "body": "Indeed, but when companies start slashing functions, others follow. Hence my hope that they don’t follow with this.",
              "score": 2,
              "created_utc": 1749579625.0,
              "replies": [
                {
                  "id": "mx7xnxi",
                  "author": "JUYED-AWK-YACC",
                  "body": "This is just doom and gloom",
                  "score": 0,
                  "created_utc": 1749657561.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mx452i8",
          "author": "cronin1024",
          "body": "I think this message is good news, I think they’ve finally decided to make it better, and in doing so they realized they have to drop support of those really old products",
          "score": 2,
          "created_utc": 1749600812.0,
          "replies": []
        },
        {
          "id": "mx3jsby",
          "author": "Vladivostokorbust",
          "body": "Given the industry is totally committed to subscription based products, we’ll all be forced to icloud before long. While I have some backups on Google drive, and Amazon for photos, cause it’s free, i make sure everything is backed up locally 2x.",
          "score": 1,
          "created_utc": 1749593741.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx1qqco",
      "author": "LupusDeusMagnus",
      "body": "8 years of support after discontinuation isn’t that unusual, actually it might be unusual in that it’s actually uncommon to last this long.\n\nAlso some comments seem to be misunderstanding, they don’t appear to be dropping the software time capsule, just the discontinued AirDrop Time Capsule (a piece of hardware). You can still just buy a reliable affordable non Apple hard drive and setup backups there.",
      "score": 79,
      "created_utc": 1749575168.0,
      "replies": [
        {
          "id": "mx1zrqa",
          "author": "obi1kenobi1",
          "body": "8 years is just the time since the last piece of hardware was discontinued. Currently much older versions of the Time Capsule still work, I’m pretty sure even the first version from 2007 is supported. I’m assuming they’re doing this so that they don’t have to keep issuing security updates and can just say they’re done with the old AirPort hardware.\n\nThe part that worries me is that it says they’re dropping AirPort Disk, which is when you plug an external hard drive into the USB port on a normal AirPort base station. I thought that used a relatively basic file sharing protocol rather than anything proprietary, so I just hope that this is hardware-specific and won’t cause any issues with other NAS solutions. Removing Time Machine’s ability to back up over wifi would be a huge problem and break a ton of backup workflows.\n\nAlso it makes me wonder about the future of AirPlay support on the hardware. The last generation AirPort Express still has a niche following in the hi fi community since it’s a cheap and easy way to add AirPlay audio streaming to an old stereo that doesn’t have it built in. There’s no reason it shouldn’t continue to work indefinitely, but if they’re dropping features arbitrarily so that they can deprecate the product that would be a problem.",
          "score": 16,
          "created_utc": 1749577631.0,
          "replies": [
            {
              "id": "mx61oe4",
              "author": "gadgetboyj",
              "body": "AirPort Disk, like Time Machine on the Time Capsule/AirPort uses the AFP protocol for file sharing, which is what’s being removed. Any other NAS solutions that aren’t pretending to be a Time Capsule should already be using SMB and continue to work without issue.",
              "score": 3,
              "created_utc": 1749631415.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mx2yq72",
          "author": "KenUsimi",
          "body": "Got it, definitely misread. I was pissed i’d have to get new software and probably have to reformat my backup drive",
          "score": 2,
          "created_utc": 1749587488.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx1h2rn",
      "author": "Alphablaze98",
      "body": "Hopefully they come up with a replacement // solution to the void this will cause",
      "score": 46,
      "created_utc": 1749572463.0,
      "replies": [
        {
          "id": "mx1hkk3",
          "author": "bradrel",
          "body": "Lots of other NAS equipment on the market, I can't imagine Apple providing another hardware solution.",
          "score": 35,
          "created_utc": 1749572603.0,
          "replies": [
            {
              "id": "mx1lmyt",
              "author": "notfork",
              "body": "Not only that, I can set up my NAS to be a time machine, simple as one button. But really that is only there if I had a bunch of legacy machines(which I do not have) So for my one mac it gets backed up the same way as my other machines to the nas and offsite.",
              "score": 12,
              "created_utc": 1749573764.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mx1k33y",
          "author": "SportsterDriver",
          "body": "I've used Carbon Copy Cloner instead for years to make backups to external or network drives.",
          "score": 8,
          "created_utc": 1749573319.0,
          "replies": []
        },
        {
          "id": "mx1pads",
          "author": "VintageKofta",
          "body": "They do, a much more expensive subscription based iCloud backup. ",
          "score": 15,
          "created_utc": 1749574772.0,
          "replies": [
            {
              "id": "mx535w6",
              "author": "green_link",
              "body": "yup. this is what they want to push. subscription based cloud backup.",
              "score": 1,
              "created_utc": 1749613245.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mx1ha0r",
          "author": "None",
          "body": "[deleted]",
          "score": 14,
          "created_utc": 1749572520.0,
          "replies": [
            {
              "id": "mx2hkei",
              "author": "jcdoe",
              "body": "lol yup\n\nI just plug a usb drive into my Mac and it backs itself up",
              "score": 3,
              "created_utc": 1749582622.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mx4238o",
          "author": "elton_john_lennon",
          "body": "> solution to the void this will cause\n\nI don't think it will, since you can still use local storage to do the backup, it's just specifically Apple products that are getting axed, from what I understand from the article.",
          "score": 2,
          "created_utc": 1749599776.0,
          "replies": []
        },
        {
          "id": "mx1qych",
          "author": "truethug",
          "body": "iCloud only $10/month",
          "score": 0,
          "created_utc": 1749575229.0,
          "replies": [
            {
              "id": "mx2a2t5",
              "author": "Mxy2ptlk",
              "body": "Where’d you get that? I have 50GB of iCloud storage for 99 CENTS a month!",
              "score": -5,
              "created_utc": 1749580498.0,
              "replies": [
                {
                  "id": "mx2dwt3",
                  "author": "shofmon88",
                  "body": "You’re backing up an entire PC onto 50GB? ",
                  "score": 5,
                  "created_utc": 1749581583.0,
                  "replies": []
                },
                {
                  "id": "mx2d9s8",
                  "author": "truethug",
                  "body": "How big is your hard drive? And do you want to keep multiple versions of things like Time Machine does? 50gb runs out very quickly for backups.",
                  "score": 1,
                  "created_utc": 1749581403.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mx26a12",
          "author": "Mountain_Top802",
          "body": "They’re trying to push iCloud more.",
          "score": 0,
          "created_utc": 1749579424.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx2zw1h",
      "author": "Alan_Shutko",
      "body": "I suspect they're killing Time Machine over AFP. They switched to SMB 2 quite a while back, but I don't think the old AirPort/Time Capsule supported that.",
      "score": 10,
      "created_utc": 1749587815.0,
      "replies": []
    },
    {
      "id": "mx1iip8",
      "author": "nemuro87",
      "body": "10 bucks says they plan on using the icloud for this ",
      "score": 40,
      "created_utc": 1749572870.0,
      "replies": [
        {
          "id": "mx2ao98",
          "author": "__Dave_",
          "body": "The Time Machine backup software isn’t going anywhere, you can still use local/network storage for backups. They’re just dropping support for these specific products.",
          "score": 14,
          "created_utc": 1749580667.0,
          "replies": []
        },
        {
          "id": "mx1jrba",
          "author": "phoneacct696969",
          "body": "Guarantee the whole plan is to encourage these types of users to use subscription based iCloud.",
          "score": 9,
          "created_utc": 1749573224.0,
          "replies": [
            {
              "id": "mx1okmt",
              "author": "JakesInSpace",
              "body": "I feel like this is a discussion straight out of 2015.",
              "score": 11,
              "created_utc": 1749574579.0,
              "replies": [
                {
                  "id": "mx1xra3",
                  "author": "CicerosBalls",
                  "body": "I sincerely have no idea how backing your Mac up to iCloud is still rumor and theory in 2025",
                  "score": 2,
                  "created_utc": 1749577087.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mx20jab",
              "author": "BabyWrinkles",
              "body": "You guarantee that based on what, exactly?\n\nIs it not more likely that there’s some changes coming to Time Machine backups that won’t be supported by the decade old hardware that they’ve supported up to this point? Say, some new disk structure (AFP++ or something)?\n\nThey’re not discontinuing Time Machine, they’re just not supporting it in new software for hardware that’s not been sold in nearly a decade for software they’re releasing a decade later. That seems hella reasonable to me? \n\nIf you really don’t want to migrate from your decade old time capsule, just stick with MacOS 26. Otherwise, go buy a $500 Unifi UNAS Pro and slap a few disks in there and you’re good to keep your Time Machine backups going forward.",
              "score": 5,
              "created_utc": 1749577839.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mx2a3gn",
      "author": "Jmackles",
      "body": "I’m of the opinion that if it is an ecosystem locked thing like this that bricks dependent backups then the manufacturer should be compelled to open source the software so the end user can continue to self maintain or seek support with their existing tech/equipment elsewhere.",
      "score": 7,
      "created_utc": 1749580504.0,
      "replies": [
        {
          "id": "mx5lhm7",
          "author": "dyslexic__wizard",
          "body": "Uh, your opinion isn’t relevant because nothing is bricked…",
          "score": 5,
          "created_utc": 1749621982.0,
          "replies": [
            {
              "id": "mxfitdq",
              "author": "Jmackles",
              "body": "Okay. I disagree on the principal that I personally believe that if your device stops operating and the manufacturer has dropped support  for it, it’s is effectively bricked. And to pre empt your rebuttal I know this is industry standard and I hate it. This sort of thing is entirely what right to repair is about. There’s no reason why a third party specialist couldn’t maintain obsolete equipment well past the manufacturers support date. It’s not like The Library of Appleandria is getting burnt down and nobody can find the docs. Apple HAS the relevant information that they could disperse. They could even profit from it by making you purchase the schematics or firmware documentation through them. They could easily lead the world on how to bring back the veritable “Maytag Repairman” (AirTag repair man? Ok I’ll shut up). \n\nParticularly when it comes to system backups, the concept of which should be a no brainer when it comes to long therm support.",
              "score": 1,
              "created_utc": 1749754747.0,
              "replies": [
                {
                  "id": "mxfkknu",
                  "author": "dyslexic__wizard",
                  "body": "Just don’t update and it will continue to operate unless I misunderstand.",
                  "score": 1,
                  "created_utc": 1749755248.0,
                  "replies": [
                    {
                      "id": "mxfr51z",
                      "author": "Jmackles",
                      "body": "Am i misunderstanding? If support is ended it means if your operational equipment goes down (even if you didn’t update it) you have no resources or official assistance to resolve issues",
                      "score": 1,
                      "created_utc": 1749757133.0,
                      "replies": [
                        {
                          "id": "mxopfe8",
                          "author": "dyslexic__wizard",
                          "body": "Oh, I’m running 12 year old hardware, this wasn’t even a concern for me, what did you actually expect? This is amazing support for a product way beyond end of life?",
                          "score": 2,
                          "created_utc": 1749873258.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mx5ioob",
      "author": "bastetlives",
      "body": "And.. the price of an iCloud sub jumps 10 fold.",
      "score": 2,
      "created_utc": 1749620499.0,
      "replies": []
    },
    {
      "id": "mx5x96s",
      "author": "rossburton",
      "body": "I’m guessing this is because those older machines only support legacy Apple networking, whereas macOS really wants to just support CIFS?",
      "score": 2,
      "created_utc": 1749628733.0,
      "replies": []
    },
    {
      "id": "mx9hvdw",
      "author": "gargravarr2112",
      "body": "Are Apple actually *adding* features to MacOS these days? Being a Mac admin 2017-2019 I saw more features dropped than added.",
      "score": 2,
      "created_utc": 1749673608.0,
      "replies": []
    },
    {
      "id": "mxatlyo",
      "author": "artguy55",
      "body": "The enshitification is complete. I've already bought my last Apple product .",
      "score": 2,
      "created_utc": 1749689138.0,
      "replies": [
        {
          "id": "n0lrn5e",
          "author": "FezAndSmoking",
          "body": "That was a wise decision 15 years ago",
          "score": 1,
          "created_utc": 1751301870.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx31sa6",
      "author": "ixmntr",
      "body": "Hmmmm, I use the AirPort Express puck as a HomeKit device for audio. Does that mean they will be dead?",
      "score": 1,
      "created_utc": 1749588347.0,
      "replies": [
        {
          "id": "mx3ek79",
          "author": "paaldie",
          "body": "I am interested also.  I use one to power my outdoor speakers and control them through my iPhone.",
          "score": 1,
          "created_utc": 1749592096.0,
          "replies": [
            {
              "id": "mx621uw",
              "author": "gadgetboyj",
              "body": "For the moment, no, this change will not affect that functionality of it at all.",
              "score": 1,
              "created_utc": 1749631643.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mx620p4",
          "author": "gadgetboyj",
          "body": "For the moment, no, this change will not affect that functionality of it at all.",
          "score": 1,
          "created_utc": 1749631623.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx5qtp7",
      "author": "Kokophelli",
      "body": "Third party alternatives?",
      "score": 1,
      "created_utc": 1749624930.0,
      "replies": []
    },
    {
      "id": "mxg56ay",
      "author": "MeshModeler",
      "body": "Ive been using mine as a backup destination for years. Question, does this essentially make it a paperweight? can i use it for anything?",
      "score": 1,
      "created_utc": 1749761250.0,
      "replies": []
    },
    {
      "id": "mx2d4pm",
      "author": "eulynn34",
      "body": "I guess the end goal here is to move it to iCloud storage for which you pay a subscription fee?",
      "score": 1,
      "created_utc": 1749581364.0,
      "replies": []
    },
    {
      "id": "mx5vtio",
      "author": "llehsadam",
      "body": "Apple should probably clarify if Time Machine on external disks is being discontinued completely or just Time Capsule on Apple hardware.",
      "score": 0,
      "created_utc": 1749627867.0,
      "replies": []
    },
    {
      "id": "mx43t5m",
      "author": "TheModeratorWrangler",
      "body": "You will use iCloud and you will not enjoy it.",
      "score": -2,
      "created_utc": 1749600369.0,
      "replies": [
        {
          "id": "mx4ezmc",
          "author": "cape2cape",
          "body": "Or you just use Time Machine.",
          "score": 5,
          "created_utc": 1749604284.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx1i9ka",
      "author": "SaiyanRajat",
      "body": "If you are skilled enough, you'd already have a better solution. Then again, if you are skilled enough, you won't be using any of Apple's e-waste in the first place.",
      "score": -45,
      "created_utc": 1749572799.0,
      "replies": [
        {
          "id": "mx1r0km",
          "author": "LordBledisloe",
          "body": "How's the weather up there on your pedestal?\n\nIf you were skilled enough you wouldn't be socially insufferable.",
          "score": 15,
          "created_utc": 1749575246.0,
          "replies": []
        },
        {
          "id": "mx1ou1z",
          "author": "evadzs",
          "body": "This is a hot take with Microsoft about to e-waste a ton of EOL devices",
          "score": 4,
          "created_utc": 1749574649.0,
          "replies": []
        },
        {
          "id": "mx1xyvc",
          "author": "CicerosBalls",
          "body": "Yawwwwn",
          "score": 3,
          "created_utc": 1749577144.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mx2nte2",
      "author": "Rude_Citron9016",
      "body": "Headline misleading. 2027 not 2026",
      "score": -1,
      "created_utc": 1749584417.0,
      "replies": [
        {
          "id": "mx2x89l",
          "author": "Musicman1972",
          "body": "It states it will be macOS 27 which will be released later next year. Is that not the case?",
          "score": 2,
          "created_utc": 1749587071.0,
          "replies": [
            {
              "id": "mx30ulx",
              "author": "Rude_Citron9016",
              "body": "26 was just announced now and will be released in late 2025 through 2026.  Which is why they call it 26.  27 will be announced at wwdc in June 2026 and released in late 2026 through 2027.",
              "score": 1,
              "created_utc": 1749588086.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}