{
  "post": {
    "title": "Sony shows off Project Defiant, its first wireless fight stick for PS5 and PC",
    "author": "diacewrb",
    "id": "1l4ppun",
    "score": 845,
    "created_utc": 1749208179.0,
    "selftext": "",
    "num_comments": 139,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1l4ppun/sony_shows_off_project_defiant_its_first_wireless/"
  },
  "comments": [
    {
      "id": "mwb2j5i",
      "author": "Spartyjason",
      "body": "Fight stick.  I thought the title said “flight stick” and I thought to myself that’s the worst flight stick I’ve ever seen!",
      "score": 362,
      "created_utc": 1749213813.0,
      "replies": [
        {
          "id": "mwbo0hv",
          "author": "diemunkiesdie",
          "body": "I only realized it *didnt* say flight stick when I read your comment 😭",
          "score": 29,
          "created_utc": 1749220724.0,
          "replies": []
        },
        {
          "id": "mwc2xqd",
          "author": "Punman_5",
          "body": "Yea I was like HOTAS doesn’t stand for “Hands _Off_ Throttle And Stick”",
          "score": 9,
          "created_utc": 1749225007.0,
          "replies": []
        },
        {
          "id": "mwdelk8",
          "author": "Bigred2989-",
          "body": "The name doesn't help either, made me think of Project Wingman.",
          "score": 4,
          "created_utc": 1749238956.0,
          "replies": []
        },
        {
          "id": "mwbks29",
          "author": "seamonkey420",
          "body": "haha! me too!!!",
          "score": 1,
          "created_utc": 1749219775.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mwb0d71",
      "author": "Talkycoder",
      "body": "People here don't understand how good latency is on wireless nowadays (that and the article said it can be used wired). There can be little to no difference, and a good wireless can even outperform a mediocre wired.\n\nLatency is also extremely crucial in FPS games, yet large portions of tier 1 Valorant and CS2 pros use mice like the Logitech G Pro Wireless. In the past, it was all wired Zowie mice, but hardware improves and  times change.",
      "score": 203,
      "created_utc": 1749213020.0,
      "replies": [
        {
          "id": "mwbtm6w",
          "author": "Kajega",
          "body": "Not that I recommend the brand, but I use the Razer Basilisk V3 Pro and the wireless has been tested as faster than wired. Pretty cool that it's even possible",
          "score": 18,
          "created_utc": 1749222338.0,
          "replies": [
            {
              "id": "mwcfppi",
              "author": "lazava1390",
              "body": "Yeah at about double the price of the wired basilisk. You can get the normal wired for $40 on sale and they are usually always on sale.",
              "score": 1,
              "created_utc": 1749228715.0,
              "replies": [
                {
                  "id": "mwii0bo",
                  "author": "burningscarlet",
                  "body": "Similar price for viper Chinese wireless clones which work almost as well imo, like the ATK X1 nearlink",
                  "score": 5,
                  "created_utc": 1749314370.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwb49h1",
          "author": "lazy_tenno",
          "body": "I browse /r/pcmasterrace and /r/gaming sometimes and still astounded that in the year of our Lord of 2025 these group of people still exists (actually, not that surprised that i see TONS of people still use wired pheripherals on /r/battlestations and similar subreddits)\n\nAccording to my observations after reading several comments regarding wireless vs wired on those subreddits:\n\n- these people thought that wireless pheripherals are inferior to wired due to the massive input delay\n\n- these people thought that wireless pheripherals can be disconnected for no reason (just scroll in the comment section, you'll find one right away)\n\n- these people thought that they have to charge the wireless pheripherals every few hours, and they really hate to do it\n\nWhat baffles me is that, these group of people who thought that the wireless is inferior IS the same group of the average common PC gamers - who mostly plays single player and steer clear of competitive fps games. These average, common PC gamers COMPLAINS AS IF they will gain massive competitive disadvantage by using these wired pheripherals. If i drew venn diagrams of these groups of people, it won't make any sense at all.",
          "score": 23,
          "created_utc": 1749214426.0,
          "replies": [
            {
              "id": "mwbywfb",
              "author": "brett1081",
              "body": "There are a ton of people on PC master race that seem to think graphics cards are still less than $300. They seem to be a few years behind on multiple things.",
              "score": 48,
              "created_utc": 1749223860.0,
              "replies": [
                {
                  "id": "mwmemxp",
                  "author": "TheWillyBandit",
                  "body": "“I don’t understand why anyone would get a console over a PC” _checks prices of a GPU vs a console._",
                  "score": 9,
                  "created_utc": 1749368573.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwd1z32",
              "author": "xenwall",
              "body": "For competitive fighting games a big reason to have issues with wireless is that you show up to a system, play a set, and leave. There have been occurrences in the past where people have forgotten to unpair their controller from the console and messed up a later set that other people were playing. The fact that it can run wired (and presumably not have to worry about pairing) is that it allows for a smoother tournament experience.",
              "score": 10,
              "created_utc": 1749235138.0,
              "replies": []
            },
            {
              "id": "mwb99wp",
              "author": "randomIndividual21",
              "body": "Wireless is also expensive though. The wireless version of the mouse i wanted costs double at £80, and it doesn't help some peripheral like rgb keyboard is better with wire since the battery doesn't last long. They generally only last like 50 to 70 hour",
              "score": 15,
              "created_utc": 1749216138.0,
              "replies": [
                {
                  "id": "mwceb3j",
                  "author": "lazava1390",
                  "body": "Also a lot of RGB software flat out doesn’t work in wireless modes. You have to plug it in to get the same RGB controls and effects. My black ops 6 branded Corsair keyboard does that. I have to keep it plugged in for the effects.",
                  "score": 2,
                  "created_utc": 1749228311.0,
                  "replies": []
                },
                {
                  "id": "mwbj5vs",
                  "author": "lazy_tenno",
                  "body": "Is there any chance that your mouse is a logitech, razer, steelseries, or any other well known brand?\n\nI stopped using those brands because of the [omron switches they often use to cause double click issue in a matter of relatively short time](https://www.google.com/search?q=reddit+omron+double+click&oq=reddit+omron+double+click&gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIHCAEQIRigATIHCAIQIRigAdIBCDU3MDBqMGo0qAIBsAIB&sourceid=chrome-mobile&ie=UTF-8)\n\nI've been using cheap chinese brand mouse ever since because:\n\n1. AFAIK they never use omron switches,\n\n2. I've been using the very same chinese mouse since 2019 with no issues at all\n\n3. AFAIK there are no wireless version at twice the price of wired version on cheap chinese brand mouse.\n\nI'm sorry, but double the price just for the wireless version is down right extortion.\n\n\n>50 hours to 70 hours of keyboard battery life\n\nThat is good, no? Let's just say that im using the keyboard at home after work at 6pm to 9pm, or 10pm every day, that means\n\nThe battery will last approximately 12 to 23 days, depending on usage:\n\n12.5 to 17.5 days with 4h/day\n\n16.7 to 23.3 days with 3h/day\n\nThat means you just have to charge it per half a month, or per month at best.\n\nAnd average rgb gaming keyboard charging speed is just 3-4 hours...",
                  "score": 1,
                  "created_utc": 1749219290.0,
                  "replies": [
                    {
                      "id": "mwbpbq2",
                      "author": "recursivethought",
                      "body": "Counterpoints regarding my choices (I LOVE wireless everything, strick with wired for my main):\n\n-I'm using the same kb/mouse for work. It's gonna last me a week (70h batt / 11h use) - though tbh likely 10 since I don't actually use my PC for 11 full hours 7d a week.  \n-When the battery is drained, it's gonna happen mid-something-important.  \n-There is no benefit for me. I have a very large underdesk tray. The cables are routed through loose channels under the desk. I don't see my cables. The cables are neither visually nor functionally limiting in any way.  \n-My exisiting setup never needs any fiddling whatsoever.  If I don't do something every 10 (even 30) days, it keeps working. Guaranteed, every time.\n\nIn other words there is literally zero benefit to me going wireless.\n\nFun fact: my devices are actually wireless, I just keep the USB-C cable plugged in always. This is because I have other PCs (with USB-C cables available) that I move to when I need to do a maintenance session sometimes (Servers/Media/NVR/etc) plus like 2x/mo when I actually need to be in the office.\n\nSidenote: While I agree with you regarding Chinese keyboards, there is no Chinee mouse that mimics the functionality of a Logitech G502 for example (esp with G-Shift). It's a middle-ground between Naga and your typical mouse with back-forward thumb buttons. Not for everyone but if you want that you can't get it in a knockoff (yet, unfortunately). But when it happens I agree there's little downside to going that route.\n\nAnd the same argument I'm using for my mouse, some people may have specific needs for their keyboards that aren't met by Chinese ones. But those are fringe cases typically, nothing to get up in arms about in forums, to each their own.\n\nI will say that the whole wireless charging for a peripheral thing - when that's more commonplace and affordable, I would totally go that route personally. Less cables to route, fewer USB ports used, esp if people have their peripherals on top of their desk.",
                      "score": 7,
                      "created_utc": 1749221101.0,
                      "replies": []
                    },
                    {
                      "id": "mwcqq8d",
                      "author": "DJKGinHD",
                      "body": "I have a wireless keyboard and mouse. Logitech (I used to work at Best Buy and got a GREAT deal on them). Mouse uses 1 AA battery. Keyboard uses 2.\n\nIn the 3 years I've had them. I have changed the mouse battery 3 times and the keyboard battery twice. I use my computer about as much as you'd using the week. More on the weekends.",
                      "score": 3,
                      "created_utc": 1749231843.0,
                      "replies": []
                    },
                    {
                      "id": "mwd0g4i",
                      "author": "h3rpad3rp",
                      "body": ">   50 hours to 70 hours of keyboard battery life\n\n> That is good, no? Let's just say that im using the keyboard at home after work at 6pm to 9pm, or 10pm every day, that means\n\n\nWell, I have a wireless logitech k830 Keyboard/touchpad combo that I have been using for a home theater PC for about 10 years. I've literally charged it 4 times. Ever. It doesn't have RGB though, which is obviously the big power draw. If not for that keyboard, I would say that 50-70 hours is good. But since I've had this keyboard, 50-70 is only okay. I'm pretty sure I didn't charge the K830 for the first 5 years, it made no sense. \n\nThe switches Logitech uses definitely suck and start dbl clicking after awhile though... I've tried other brands, but I never seem to like them",
                      "score": 2,
                      "created_utc": 1749234680.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwebsev",
              "author": "Sta1nless_",
              "body": "Wireless needs battery change or charging. Wired doesn't. I don't care about a wireless mouse, it's gonna stay next to my computer anyway.",
              "score": 3,
              "created_utc": 1749249592.0,
              "replies": [
                {
                  "id": "mwgvzov",
                  "author": "robdrak",
                  "body": "Right? It doesn't matter if I have to charge it only occasionally. The fact I have to charge it at all is what I have a problem with. And the battery WILL degrade.",
                  "score": 1,
                  "created_utc": 1749292420.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwbmoa3",
              "author": "o8Stu",
              "body": "I play with wired peripherals so I don’t have to worry about batteries or recharging, ever.  That’s it.",
              "score": 2,
              "created_utc": 1749220335.0,
              "replies": [
                {
                  "id": "mwbpz0x",
                  "author": "lazy_tenno",
                  "body": "\n\nI put [adhesive cable clip](https://www.amazon.com/XHF-Adhesive-Management-Organizer-Ethernet/dp/B09X5FTR5C/ref=mp_s_a_1_2_sspa?adgrpid=113545103452&dib=eyJ2IjoiMSJ9.WlU59oOWuS2XSEcmHvejVjpxjIxRipkrwFs6PLMURyifJCn-J2XIQuiahhoJBEDXFWE9aJ6b2NAgCHmUTQWt60ehuyqjafRJkIF6OXGxp8DvP02JzkJ3_zDyJOnMp-yguUwxY2-MYf-7POVNxZeD3m8NDPEMHIw-PQV8GxntuyydzgoYH485On1okfjam-Ni7y_WlCHBeQuSEBa7Zk8R2w.Weq4KPE5QMi2d5pK-xszvURmirCT17Yg3behBGzMkxs&dib_tag=se&hvadid=673584996193&hvdev=m&hvlocphy=9220114&hvnetw=g&hvqmt=b&hvrand=16938967541418896965&hvtargid=kwd-884508551&hydadcr=2096_13649849&keywords=self+adhesive+cable+clips&mcid=f9142e3a9b9c3308bd99a960211fcd76&qid=1749220966&sr=8-2-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9waG9uZV9zZWFyY2hfYXRm&psc=1) under the edge of my pc desk so i can grab the charging cable to charge my mouse, which only need to be charged every 3 weeks (more or less), and will reach low to full battery in 3 hours.\n\n\nAnd the best part is: (seems like most people don't know about this yet)\n\n1. you can still use the mouse normally while charging. \n\n2. I can grab the charging cable then put it on the charging socket of my mouse in a matter of seconds. Yes! It IS that fast and easy!\n\n\n\n\n\n*> - these people thought that they have to charge the wireless pheripherals every few hours, and they really hate to do it*\n\n🤷‍♂️",
                  "score": -1,
                  "created_utc": 1749221289.0,
                  "replies": [
                    {
                      "id": "mwgub03",
                      "author": "Electric_Cat",
                      "body": "Neat, I never have to charge my mouse ever. Sounds like that still wins over charging it ever.",
                      "score": 3,
                      "created_utc": 1749291429.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwdlol0",
              "author": "NorCalAthlete",
              "body": "I bought a G502 wired and a light speed wireless. \n\nSince I use my computer for both work and gaming I was recharging it daily / plugging it back in every night. Got too annoying and I didn’t feel like shelling out $150 for the charging mousepad. \n\nThe lightspeed has been sitting in a box for a while now I’m just keeping it to use as a wired backup if/when the wired one fails.",
              "score": 1,
              "created_utc": 1749241111.0,
              "replies": []
            },
            {
              "id": "mwegv92",
              "author": "PocketNicks",
              "body": "I was playing Halo 2 and 3 at a fairly competitive rank with wireless controllers, usually around a 39-42 and half the time I was drinking, so probably would rank higher if I was more serious. Even way back then, the latency wasn't really noticeable for me.",
              "score": 1,
              "created_utc": 1749251349.0,
              "replies": []
            },
            {
              "id": "mwf1lnf",
              "author": "Strokeslahoma",
              "body": "I just don't like charging batteries ",
              "score": 1,
              "created_utc": 1749258910.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwga607",
          "author": "andres57",
          "body": "I wouldn't use wireless controller in LAN though. But yea if it offers to connect by cable is a pretty much non story then",
          "score": 3,
          "created_utc": 1749279165.0,
          "replies": []
        },
        {
          "id": "mwbk74v",
          "author": "TomAto42nd",
          "body": "Wireless has caused so much problems in Tournaments that it has interrupted games because people didn’t desync their controllers \n\nNobody plays wireless regardless of latency",
          "score": 2,
          "created_utc": 1749219601.0,
          "replies": []
        },
        {
          "id": "mwjq9g4",
          "author": "Informal-Resolve-831",
          "body": "I always wonder, how many people there’re, who REALLY need to care about the wireless latency?\n\nLike, there’re so many ways where you can improve, but if your main problem is really a latency then maybe you are a pro already.",
          "score": 1,
          "created_utc": 1749328564.0,
          "replies": []
        },
        {
          "id": "mwklp3o",
          "author": "KalaiProvenheim",
          "body": "Yeah\n\nThe only reason I’d use wired is if I don’t want to deal with re-pairing (I use a Pro Controller for both PC and iPad, and occasionally for the Switch LMAO)",
          "score": 1,
          "created_utc": 1749339457.0,
          "replies": []
        },
        {
          "id": "mwb3oxk",
          "author": "xsilas43",
          "body": "In fighting games even 1 frame of latency can make a difference. There's no way that stick is polling over 1000hz.",
          "score": -5,
          "created_utc": 1749214224.0,
          "replies": [
            {
              "id": "mwbkvsh",
              "author": "Streetperson12345",
              "body": "How is there no way? The basic run of the mill dualsense has the ability to poll 1000hz.\n\nWhy wouldn't the specialized, PlayStation branded, fight stick that's probably going to cost 2-3x as much as the dualsense have 1000hz polling rate?",
              "score": 28,
              "created_utc": 1749219805.0,
              "replies": []
            },
            {
              "id": "mwb5n3l",
              "author": "None",
              "body": "[deleted]",
              "score": 5,
              "created_utc": 1749214901.0,
              "replies": [
                {
                  "id": "mwbdhea",
                  "author": "magicvodi",
                  "body": " AFAIR PS/2 has worse latency because the bitrate is so bad. I think I saw it in this video, but I'm not 100% sure: https://youtu.be/7aXbh9VUB3U",
                  "score": 2,
                  "created_utc": 1749217514.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwbow5l",
              "author": "Rigman-",
              "body": "Most people buying wireless controllers aren’t trying to be competitive, they just want comfort. I play almost everything on wireless and have no problem having fun. The lack of wireless arcade sticks has been annoying for years, so it’s nice to finally see someone addressing it.\n\nI love using arcade sticks, but I hate running a long cable across my living room just to play. If that extra frame of input costs me a match, whatever. I’m here to enjoy myself, not win tournaments.",
              "score": 8,
              "created_utc": 1749220978.0,
              "replies": [
                {
                  "id": "mwc1r9t",
                  "author": "xsilas43",
                  "body": "Totally agree, if they can get it right it would be great.",
                  "score": 1,
                  "created_utc": 1749224673.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwbn5p2",
              "author": "thefallenfew",
              "body": "It’s a PS5 controller. Every PS5 controller is wireless. It’s an even playing field. If you’re not playing on this you’re using a DualSense. Everyone is working with the same latency.",
              "score": 2,
              "created_utc": 1749220478.0,
              "replies": [
                {
                  "id": "mwbxlri",
                  "author": "crazy_gambit",
                  "body": "I'm pretty sure you can play wired. You have to go into the menus and specifically enable it, but it can be done. Otherwise if you connect a cable you just charge the controller.",
                  "score": 8,
                  "created_utc": 1749223493.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mwb6kyj",
              "author": "NoisyGog",
              "body": "What on Earth do you think is pushing 1000fps? I’m not sure any game engine even polls that much",
              "score": -25,
              "created_utc": 1749215226.0,
              "replies": [
                {
                  "id": "mwb7e1x",
                  "author": "xsilas43",
                  "body": "Where did you get 1000fps? Fighting games usually run at 60fps and balance things around the frame time.\n\nA polling rate of 1000hz would be how often the controller polls for input. Which is standard for high quality gaming peripherals. Many even go above this now.",
                  "score": 13,
                  "created_utc": 1749215501.0,
                  "replies": [
                    {
                      "id": "mwbdd5x",
                      "author": "ExoticSalamander4",
                      "body": "your wording made it seem like you were saying all 1000hz would be necessary to not miss a frame, which would imply that the game was running at 1000fps. the actualconnection, which i'm sure you can draw so it seems odd that you're ignoring, is that you don't need to poll anywhere near 1000hz to not have an input delayed by a frame.\n\nif you had a 600hz input device there would be a 10% chance that an input would be delayed by a frame, assuming uniform distribution of input timing across a random frame. if that was 1000hz it would be about a 6% chance. obviously lower chance is better, but what % are you going to choose as a hill to die on?",
                      "score": -3,
                      "created_utc": 1749217475.0,
                      "replies": []
                    },
                    {
                      "id": "mwb9yi3",
                      "author": "NoisyGog",
                      "body": "> Where did you get 1000fps?\n\n> In fighting games even 1 frame of latency can make a difference. There's no way that stick is polling over 1000hz.\n\nThose two combined, suggest that you were making 1000fps claims.    \nIf you wanted less than a frame of delay, then let’s pull twice per frame, 120Hz.",
                      "score": -8,
                      "created_utc": 1749216362.0,
                      "replies": [
                        {
                          "id": "mwbcxly",
                          "author": "xsilas43",
                          "body": "120hz would be below even the cheapest wireless devices which typically poll at 125hz, and feel terrible to use.\n\nFighting games are locked to 60fps because they balance around frame times.\n\nA \"frame of delay\" would be depandant on the fps the game is running at, in fighting games case as they are locked to 60fps, this is 16.7ms.\n\nThe polling rate of a device is completely independent of any game however.",
                          "score": 9,
                          "created_utc": 1749217337.0,
                          "replies": [
                            {
                              "id": "mwbfxe3",
                              "author": "NoisyGog",
                              "body": "You realise you’re now responding to things YOU said, right?",
                              "score": -4,
                              "created_utc": 1749218287.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "mwc1w6v",
                          "author": "KanyeEast420",
                          "body": "He's not claiming that at all. Wireless device polling rate is not the same as display refresh rate. Just because they're both measured in Hz doesn't make them the same.",
                          "score": 2,
                          "created_utc": 1749224710.0,
                          "replies": [
                            {
                              "id": "mwd6qem",
                              "author": "NoisyGog",
                              "body": "> He's not claiming that at all. Wireless device polling rate is not the same as display refresh rate. Just because they're both measured in Hz doesn't make them the same.\n\nYou’ve just bought ANOTHER variable into it, they didn’t mention refresh rate.",
                              "score": 0,
                              "created_utc": 1749236561.0,
                              "replies": [
                                {
                                  "id": "mwd7rlg",
                                  "author": "KanyeEast420",
                                  "body": "Well, you're the one who brought up FPS to a polling rate conversation. You clearly didn't understand what OP was talking about. Also, why else would you bring up FPS? You're the one who's likely confusing polling rate with refresh rate, which is why I brought it up. It's OK to admit that you don't know things.",
                                  "score": 2,
                                  "created_utc": 1749236873.0,
                                  "replies": [
                                    {
                                      "id": "mwd9btk",
                                      "author": "NoisyGog",
                                      "body": "> Well, you're the one who brought up FPS to a polling rate conversation.\n\nNo, I am not. I was responding to the person that did.",
                                      "score": 0,
                                      "created_utc": 1749237349.0,
                                      "replies": [
                                        {
                                          "id": "mwdb581",
                                          "author": "KanyeEast420",
                                          "body": "Original Comment: \n\n>In fighting games even 1 frame of latency can make a difference. There's no way that stick is polling over 1000hz.\n\nYou responded with:\n\n>What on Earth do you think is pushing 1000fps? I’m not sure any game engine even polls that much\n\nSo it's clear you don't know what polling rate is, otherwise why would you bring up FPS? Polling rate for a gaming wireless mouse can go much higher than 1k Hz.",
                                          "score": 2,
                                          "created_utc": 1749237900.0,
                                          "replies": [
                                            {
                                              "id": "mwddian",
                                              "author": "NoisyGog",
                                              "body": "I know what polling rate is. I know what refresh rate is. I know what frame rate is. \n\nThe original comment is utter nonsensical gibberish. It’s a world salad.   \nWhy are you so invested in this? Go have a wank or something, fukkinell, kid.",
                                              "score": 0,
                                              "created_utc": 1749238623.0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mwbodce",
          "author": "Digital-Exploration",
          "body": "Outperform wired?",
          "score": 1,
          "created_utc": 1749220827.0,
          "replies": []
        },
        {
          "id": "mwbmudo",
          "author": "thefallenfew",
          "body": "I mean, literally every controller is wireless these days.",
          "score": 1,
          "created_utc": 1749220385.0,
          "replies": []
        },
        {
          "id": "mwb98c8",
          "author": "calpi",
          "body": "The only issue is when you get interference, or the battery starts running low. You can feel the drop in performance once a wireless mouse drops below 40%.\n\nThat said, the pro's far outweigh the cons, which is why I use a wireless mouse, and simply stop playing when I have to recharge.",
          "score": -1,
          "created_utc": 1749216123.0,
          "replies": []
        },
        {
          "id": "mwb5br8",
          "author": "shinitakunai",
          "body": "Battery failing at the wrong time is critical. Wired will always be better. For keyboard, mouse and ethernet.",
          "score": -7,
          "created_utc": 1749214794.0,
          "replies": [
            {
              "id": "mwb6wgo",
              "author": "Talkycoder",
              "body": "https://www.rtings.com/mouse/tools/table\n\nSort by raw performance and look how nearly the entirety of top performers are wireless.\n\nUnless you get angry and throw your device around all the time, the battery will not just 'give out'. In terms of recharging, the G Pro X Superlight 2 has an 90h battery life at 1000hz polling and 70h at 8000hz; that's while in constant movement by the way, not just when it's turned on. It takes an hour to charge fully from 0%.",
              "score": 9,
              "created_utc": 1749215336.0,
              "replies": [
                {
                  "id": "mwbc28f",
                  "author": "shinitakunai",
                  "body": "The hassle of having to charge it, and remembering to do so are already enough bad points.  \n  \n Unless you show me one that doesn't requires charging (or once per **year**) I am not convinced.",
                  "score": -8,
                  "created_utc": 1749217054.0,
                  "replies": [
                    {
                      "id": "mwbe4xi",
                      "author": "qa3rfqwef",
                      "body": "For a mouse, you can get the Powerplay mat. I haven't had to think about charging my mouse in years, and I've used it with a few different Logitech mice now. Obviously there's an upfront cost to that, which is only worth it if you want wireless but the charging thing really bothers you.\n\nThe freedom of not having a cable tugging in any way (and I mean just the physical feeling of a cable when moving the mouse) really can't be underestimated.\n\nAt the end of the day, these are optional features, and most will always have a wired mode of play anyway, so there's no real downside to going wireless.",
                      "score": 3,
                      "created_utc": 1749217723.0,
                      "replies": [
                        {
                          "id": "mwcyl5l",
                          "author": "Candle1ight",
                          "body": "I just went with a little magnetic stand, just have to remember to put it on the stand once a week when I'm done. A lot cheaper and I get to keep my big ass mouse pad.",
                          "score": 1,
                          "created_utc": 1749234119.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mwbh3wv",
                      "author": "Werespider",
                      "body": "You could just *plug it in when you're done with it*, then the battery is charging.",
                      "score": 4,
                      "created_utc": 1749218659.0,
                      "replies": [
                        {
                          "id": "mwbi0ei",
                          "author": "shinitakunai",
                          "body": "Last one I tried could not be plugged. That was 15 years ago though.",
                          "score": -5,
                          "created_utc": 1749218941.0,
                          "replies": [
                            {
                              "id": "mwbm6ah",
                              "author": "HYPERBOLE_TRAIN",
                              "body": "I think it’s funny that you are arguing a subject when your position is relying on stale (obsolete) experience. \n\nMy wireless mouse goes on a charging pedestal when I’m done playing. Even if I forget, it will go a week or two between charges. If I forget for 2 weeks and still want to play, I take the charging cable from the pedestal and attach it to the mouse and now it’s wired. \n\nYou do you but I’m living in 2025 where gaming is everything I dreamed about as a kid.",
                              "score": 2,
                              "created_utc": 1749220186.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "mwbdgdd",
                      "author": "None",
                      "body": "[deleted]",
                      "score": -4,
                      "created_utc": 1749217505.0,
                      "replies": [
                        {
                          "id": "mwbf1z8",
                          "author": "shinitakunai",
                          "body": "Ok you are a kid, end of discussion.",
                          "score": -1,
                          "created_utc": 1749218014.0,
                          "replies": [
                            {
                              "id": "mwbggwu",
                              "author": "Unoriginal1deas",
                              "body": "I’m nearly 30, it’s all preference and circumstances. People made good arguments and If you hate charging that much more power to ya.\n\nPersonally I prefer to game with my PC hooked up to the TV so wireless is more or less mandatory. Because the last thing I wanna do (again) is trip of. A cable and break my USB port. Plus when I’m done I can put my mouse/keyboard/gamepad/headset in my coffee table without missing a beat.\n\nBut if I was on a desk then honestly I couldn’t care less one way or another and TBH giving a shit at all  what controllers other people use feels weirdly gatekeepy and insecure.",
                              "score": 1,
                              "created_utc": 1749218457.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "mwbd7uk",
              "author": "None",
              "body": "[deleted]",
              "score": 2,
              "created_utc": 1749217428.0,
              "replies": [
                {
                  "id": "mwbek95",
                  "author": "shinitakunai",
                  "body": "I never play competitive games, for the record. I find it silly that someone must lose (you or the other player) so I stick to collaborative games or single player games. Story-driven specially.  \n  \nBut mostly for work. Explain to your director that you cannot continue the presentation of budgets and ebitda per month because your mouse just died. No thanks.  \n  \nConvenience for me means peace of mind, 1 more thing I don't have to keep on my head: recharging the mouse",
                  "score": -5,
                  "created_utc": 1749217860.0,
                  "replies": [
                    {
                      "id": "mwbhitm",
                      "author": "Atomickitten15",
                      "body": "The humble low battery indicator",
                      "score": 5,
                      "created_utc": 1749218790.0,
                      "replies": []
                    },
                    {
                      "id": "mwbnetu",
                      "author": "Rigman-",
                      "body": "Lol what? You’re literally replying to a post about a controller designed for a competitive genre, reacting to someone who brought up latency in a competitive game.\n\nYou’re actually stupid, having a bad day, or both.",
                      "score": 4,
                      "created_utc": 1749220552.0,
                      "replies": []
                    },
                    {
                      "id": "mwbk2b4",
                      "author": "pw_arrow",
                      "body": "Is this satire? You just plug the mouse in. Every popular superlight worth its price tag puts the dongle at the end of the charging cable, so you can easily swap to wired mode if need be. They all last at least a week as well, and those are ultralights; heavy wireless mice can last months.\n\nI'm not saying you're automatically an idiot to use wired - it's cheaper. But you're reaching really deep for reasons to rail against wireless here; mice are easily the peripheral that benefit the most from losing the wire since they need to physically move around so much. Charging is an annoyance and I'm not going to pretend it isn't, but you're _dramatically_ overstating the charging issue here.",
                      "score": 2,
                      "created_utc": 1749219562.0,
                      "replies": [
                        {
                          "id": "mwc0mz8",
                          "author": "shinitakunai",
                          "body": "Not satire, just my experience is a bit outdated and I am old.  \n  \nThe lack of patience of people on the internet is worrying.",
                          "score": 1,
                          "created_utc": 1749224354.0,
                          "replies": [
                            {
                              "id": "mwd2l13",
                              "author": "pw_arrow",
                              "body": "No, the conviction with which people on the internet say absurdly incorrect things is worrying.",
                              "score": 2,
                              "created_utc": 1749235320.0,
                              "replies": [
                                {
                                  "id": "mwdezef",
                                  "author": "shinitakunai",
                                  "body": "What part of personal preference is \"incorrect\"? just because it doesn't fit your tastes it doesn't makes it wrong. You need to accept other people preferences even if they are opposite to yours.",
                                  "score": 1,
                                  "created_utc": 1749239074.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwaufyg",
      "author": "Vegetable_Cup_6576",
      "body": "How important is wired/wireless for fighting games? If you’re playing online, is wired still a big difference?",
      "score": 30,
      "created_utc": 1749210686.0,
      "replies": [
        {
          "id": "mwb45yc",
          "author": "xForseen",
          "body": "It makes no difference. The ps5 controller actually has less latency over bluetooth. The problem with wireless is only for tournaments where they swap a lot of controller around on the same system.",
          "score": 34,
          "created_utc": 1749214392.0,
          "replies": [
            {
              "id": "mwbchbu",
              "author": "outdatedboat",
              "body": "I'm not super knowledgeable about wireless communication. But, wasn't a 2.4ghz wireless connection the \"less lag\" option compared to Bluetooth for a decent amount of time?\n\nOr am I just wrong about why 2.4ghz connections were used for \"gamer\" peripherals?\n\nOrrrr maybe Bluetooth has just gotten better.\n\nSomeone smarter than me, plz help.",
              "score": 4,
              "created_utc": 1749217190.0,
              "replies": [
                {
                  "id": "mwbhh31",
                  "author": "xForseen",
                  "body": "2.4 is usually as fast as a wire. Bluetooth ia usually slower. On the dualsense wired is slow though for some reason.",
                  "score": 8,
                  "created_utc": 1749218775.0,
                  "replies": [
                    {
                      "id": "mwc6wb5",
                      "author": "outdatedboat",
                      "body": "So dualsense is mostly an outlier for that? Because I'd imagine wired shouldn't ever be slower than wireless.\n\nWeird. I guess I have a rabbit hole to dive into",
                      "score": 3,
                      "created_utc": 1749226154.0,
                      "replies": [
                        {
                          "id": "mwdh8d7",
                          "author": "_I_AM_A_STRANGE_LOOP",
                          "body": "I’d guess offhand there might be a difference in default sample rates between protocols… otherwise yeah confusing!",
                          "score": 1,
                          "created_utc": 1749239757.0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "mwf69ac",
                      "author": "None",
                      "body": "Almost like they want you using wireless so they can record gyro data",
                      "score": 1,
                      "created_utc": 1749260685.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "mwn0qfq",
                  "author": "jc-from-sin",
                  "body": "Bluetooth is 2.4ghz. Yes, there is some protocol latency, but I'm guessing Sony doesn't use the bluetooth protocol 100% for their controller and instead taking some shortcuts.\n\nPlus it's implemented at the kernel level in a PS5 for the lowest of latency.",
                  "score": 1,
                  "created_utc": 1749381499.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwaw1jc",
          "author": "ScumbagScotsman",
          "body": "I know nothing about fighting games but pros in other games having been using wireless mice for years now and it doesn’t seem to be an issue.",
          "score": 27,
          "created_utc": 1749211342.0,
          "replies": []
        },
        {
          "id": "mwbv8c5",
          "author": "KCMmmmm",
          "body": "Wireless is generally disallowed in local tournaments.  Even PS5 pads usually need to be plugged in, set to use USB for information, and preferably deleted from system memory after use.  For casual at-home play, this is great.  For serious play, it misses the mark.",
          "score": 1,
          "created_utc": 1749222808.0,
          "replies": []
        },
        {
          "id": "mwav85v",
          "author": "None",
          "body": "[removed]",
          "score": -59,
          "created_utc": 1749211008.0,
          "replies": [
            {
              "id": "mwavori",
              "author": "SerenadeOfWater",
              "body": "Bro, who has the time to be like this?",
              "score": 39,
              "created_utc": 1749211196.0,
              "replies": []
            },
            {
              "id": "mwawegk",
              "author": "silencevincent",
              "body": "GayStation? Wtf. Are you twelve?",
              "score": 25,
              "created_utc": 1749211490.0,
              "replies": []
            },
            {
              "id": "mwawawo",
              "author": "summerofrain",
              "body": "Spotted the 15 year old.",
              "score": 12,
              "created_utc": 1749211450.0,
              "replies": []
            },
            {
              "id": "mway3sz",
              "author": "Drodriguez164",
              "body": "“Gaystation” that’s wild, like I felt 12 again reading that",
              "score": 12,
              "created_utc": 1749212160.0,
              "replies": []
            },
            {
              "id": "mwb01lo",
              "author": "leddhedd",
              "body": "Care to elaborate on any of those reasons or just blowing steam out of your ass?\n\nFor anyone else with more than 3 functioning brain cells, a wireless fight stick is almost certain to be fine",
              "score": 3,
              "created_utc": 1749212898.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mwb8dq5",
      "author": "PageOthePaige",
      "body": "Gonna respond to this from a different angle. It's really frustrating that Playstation locks its input protocols so heavily, only to release what are functionally the same versions of other products. To ship a product that's invariably going to be more expensive, more prone to failure, and less customizable than others on the market.  Needing to use funky adapters for fightsticks/pads/boxes on ps5 and xbox is disgraceful, especially when Nintendo of all groups is pretty much completely open.",
      "score": 17,
      "created_utc": 1749215836.0,
      "replies": [
        {
          "id": "mwo4cd2",
          "author": "NotanAlt23",
          "body": "\n>especially when Nintendo of all groups is pretty much completely open.\n\nHuh? You cant use any stick on the switch. They gotta be compatible or use an adapter just like a ps5.",
          "score": 2,
          "created_utc": 1749396289.0,
          "replies": [
            {
              "id": "mwo7rbc",
              "author": "PageOthePaige",
              "body": "The connectivity algorithm is a lot more open. Quality unlicensed third party controllers for the switch exist specifically because of that. Adapters are also cheap, with good relatively lossless ones being under 15 bucks, whereas a brook wingman will run a lot more and have less options. All of them still work on the switch 2. I tested the major ones. \n\n\nI realize \"pretty much\" is doing a lot of heavy lifting in my sentence, but it's nuts to me that it's easy to make 3rd party controllers for Nintendo and not the other two, when Nintendo is usually far crueller about locking down its tech and has more input variety. ",
              "score": 1,
              "created_utc": 1749397338.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mwbu6nv",
      "author": "badula-yama-yama",
      "body": "Wired as well right ?",
      "score": 3,
      "created_utc": 1749222502.0,
      "replies": []
    },
    {
      "id": "mwbf9rm",
      "author": "TheJedibugs",
      "body": "Flashbacks to the NES Advantage. \n\n*Sigh* — I should probably get back to the rest home. The nurses are probably looking for me by now.",
      "score": 5,
      "created_utc": 1749218081.0,
      "replies": []
    },
    {
      "id": "mwawqwj",
      "author": "Snoo_58305",
      "body": "Ooooo exciting. I’d like to try it",
      "score": 3,
      "created_utc": 1749211628.0,
      "replies": []
    },
    {
      "id": "mwbj2qu",
      "author": "bda22",
      "body": "aren't people just going to immediately put sanwa buttons in it?",
      "score": 4,
      "created_utc": 1749219263.0,
      "replies": [
        {
          "id": "mwe0xz2",
          "author": "Emberstone73",
          "body": "Yep. Even if these are good buttons, we're all used to Sanwa and Seimitsu anyway.\n\n\nIt's gonna clost $250 I'm sure. I'm gonna stick to my own.",
          "score": 1,
          "created_utc": 1749245906.0,
          "replies": [
            {
              "id": "mwjg1uv",
              "author": "endlessupending",
              "body": "The sanwa reed switch variant is GOAT. Makes regular sanwas feel like a cheap toy",
              "score": 1,
              "created_utc": 1749325174.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mwctlie",
      "author": "jijiglobe",
      "body": "As a tournament organizer I hate this direction simply because dealing with syncing/desyncing wireless controllers constantly is a huge pain…\n\nI understand the appeal though for sure, but I know I’m gonna start seeing people showing up to events with these.",
      "score": 2,
      "created_utc": 1749232655.0,
      "replies": [
        {
          "id": "mwhpfqs",
          "author": "iambiggzy",
          "body": "It uses a PS Link adapter so just pull it out",
          "score": 2,
          "created_utc": 1749305182.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mwb28j4",
      "author": "caiusto",
      "body": "For everyone concerned about latency, it also works wired if you want to, wireless is more for casuals that don't really care about that.",
      "score": 3,
      "created_utc": 1749213707.0,
      "replies": []
    },
    {
      "id": "mwb56ce",
      "author": "jamster126",
      "body": "Looks slick, 😍",
      "score": 1,
      "created_utc": 1749214742.0,
      "replies": []
    },
    {
      "id": "mwb2bnh",
      "author": "Flashjordan69",
      "body": "As long as they don’t drift Sony, right? RIGHT?",
      "score": -4,
      "created_utc": 1749213739.0,
      "replies": [
        {
          "id": "mwb9ven",
          "author": "BestieJules",
          "body": "it can't drift, levers use mouse switches.",
          "score": 16,
          "created_utc": 1749216335.0,
          "replies": [
            {
              "id": "mwbgdyn",
              "author": "ResponsibleQuiet6611",
              "body": "Well all of my ps1-ps3 dualshocks worked flawlessly and never drifted, but all of my ps5 controllers have drifted, one being brand new from Sony drifting out of the box, so if anyone can subvert your expectations when it comes to hardware it's modern Sony. ",
              "score": -15,
              "created_utc": 1749218431.0,
              "replies": [
                {
                  "id": "mwdprfx",
                  "author": "DoctorJunglist",
                  "body": "It's not an analogue joystick, so there can't be any drift. I've never heard of stick drift on an arcade stick.",
                  "score": 3,
                  "created_utc": 1749242350.0,
                  "replies": []
                },
                {
                  "id": "mwe0s75",
                  "author": "Emberstone73",
                  "body": "There can't be any drift. Arcade stick levers aren't analog; they use switches. If Sony does this correctly, then you should be able to replace the lever with a Sanwa or Seimitsu lever if yours breaks, too.\n\n\nSource: I mod arcade sticks and use a customized one myself for my own play.",
                  "score": 2,
                  "created_utc": 1749245853.0,
                  "replies": []
                },
                {
                  "id": "mwbus5e",
                  "author": "Flashjordan69",
                  "body": "Mine too, never a day’s problem with any of my controllers. The PS5 ones haven’t lasted 6 months.",
                  "score": -5,
                  "created_utc": 1749222677.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwarqci",
      "author": "None",
      "body": "[deleted]",
      "score": -16,
      "created_utc": 1749209532.0,
      "replies": []
    },
    {
      "id": "mwapo7e",
      "author": "Sarge626",
      "body": "Making it wireless kills most of the attention it could potentially get.",
      "score": -39,
      "created_utc": 1749208614.0,
      "replies": [
        {
          "id": "mwaslr1",
          "author": "ComplexAd420",
          "body": "If you read the article, they confirmed wired support",
          "score": 10,
          "created_utc": 1749209913.0,
          "replies": []
        },
        {
          "id": "mwasldo",
          "author": "ComplexAd420",
          "body": "If you read the article, they confirmed wired support",
          "score": 28,
          "created_utc": 1749209909.0,
          "replies": [
            {
              "id": "mwawe1m",
              "author": "verd493",
              "body": "These people don’t read man",
              "score": 25,
              "created_utc": 1749211485.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwaqz42",
          "author": "Scoop57",
          "body": "Why? You can still plug it in and play wired",
          "score": 12,
          "created_utc": 1749209196.0,
          "replies": []
        },
        {
          "id": "mwar40k",
          "author": "Thedrunkenchild",
          "body": "Why? Wireless peripherals these days can be on par with wired ones, the dualsense has maybe 1ms of added latency in wireless mode, I don’t think this being wireless is going to be a problem at all.",
          "score": 20,
          "created_utc": 1749209258.0,
          "replies": [
            {
              "id": "mwb2ovo",
              "author": "lazy_tenno",
              "body": "Exactly, pros in the sport scenes are using wireless peripherals as well. Optimum did some comparisons and it's almost negligible. If anyone claims that they can feel the increased delay on wireless, that only means two things: 1. They have an incredible, rare superhuman power. 2. Reverse placebo effect/expectation bias/conformation bias.\n https://m.youtube.com/watch?v=yy0xmcBg_IY&pp=0gcJCdgAo7VqN5tD\n\nAnd I can't believe that in the year of our Lord of 2025 there are group of people (especially on /r/pcmasterrace or /r/gaming sub) still thinking that wireless pheripherals is inferior.",
              "score": 9,
              "created_utc": 1749213871.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwarbyc",
          "author": "Buggyworm",
          "body": "Good wireless stuff has little to no penalty in latency, compared to wired",
          "score": 7,
          "created_utc": 1749209357.0,
          "replies": [
            {
              "id": "mwasyna",
              "author": "RGB3x3",
              "body": "Unless it's -125 ms latency, fighting game players aren't interested ",
              "score": -5,
              "created_utc": 1749210066.0,
              "replies": [
                {
                  "id": "mwaw0rd",
                  "author": "shuttlerooster",
                  "body": "That’s like 7 frames, there’s no way anything over 1 or 2 flies.",
                  "score": 3,
                  "created_utc": 1749211333.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mwau0mz",
          "author": "Aramis444",
          "body": "Imagine if Sony did all this work to target a market of just people who are ultra serious about fighting games. That would sell so many units! /s",
          "score": 4,
          "created_utc": 1749210511.0,
          "replies": []
        },
        {
          "id": "mwatcql",
          "author": "XuX24",
          "body": "Lol when I saw wireless I just knew the core audience was going to hate it. Latency is king.",
          "score": -11,
          "created_utc": 1749210232.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mwbdsyp",
      "author": "IT_techsupport",
      "body": "What a dumbass name.",
      "score": -5,
      "created_utc": 1749217618.0,
      "replies": []
    },
    {
      "id": "mwc8v5x",
      "author": "None",
      "body": "[deleted]",
      "score": -7,
      "created_utc": 1749226729.0,
      "replies": [
        {
          "id": "mwjdr9o",
          "author": "BicepsKing",
          "body": "So, have you googled “fight stick” yet",
          "score": 1,
          "created_utc": 1749324412.0,
          "replies": [
            {
              "id": "mwjkpu9",
              "author": "None",
              "body": "[deleted]",
              "score": 1,
              "created_utc": 1749326730.0,
              "replies": [
                {
                  "id": "mwjl53r",
                  "author": "BicepsKing",
                  "body": "Ignorance is bliss I Suppose",
                  "score": 1,
                  "created_utc": 1749326871.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwdc8rr",
      "author": "awakened_primate",
      "body": "Why the f are the R buttons on the left and the L on the right?!",
      "score": -2,
      "created_utc": 1749238233.0,
      "replies": [
        {
          "id": "mwe13zc",
          "author": "Emberstone73",
          "body": "Sticks have been built this way for decades unfortunately. I'm not sure what the original reasoning is, but it has to stay the same now.",
          "score": 4,
          "created_utc": 1749245961.0,
          "replies": [
            {
              "id": "mwfpzuy",
              "author": "pm-me-neurons",
              "body": "My best guess is that it had to do with the arcade layout for Street Fighter. In the arcade the top row of buttons from left to right is LP MP HP, and the bottom row is LK MK HK. When the game was originally ported to PlayStation consoles they mapped HP to R1 and HK to R2. So this stick and generally all others since follow the arcade layout with the top row as square triangle R1 and the bottom row as X Circle R2…with the left shoulder buttons to the right of them per tradition lol",
              "score": 4,
              "created_utc": 1749268678.0,
              "replies": [
                {
                  "id": "mwgi5e5",
                  "author": "Emberstone73",
                  "body": "That actually makes a ton of sense. I grew up in that era, but never played SF on the PS1. Thanks for pointing that out.",
                  "score": 2,
                  "created_utc": 1749283949.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "mwe6s3g",
      "author": "Excellent-Ad-7996",
      "body": "Too late, Ive been using my 8bitdo arcadestick with an adapter.",
      "score": -2,
      "created_utc": 1749247852.0,
      "replies": []
    },
    {
      "id": "mweta3n",
      "author": "electricfoxyboy",
      "body": "Ooooooooooooo. Don’t care. \n\nGive us a portable system, bring back the PS3 gui, force devs to have 60fps to release a game, and require fully functional games on disc.",
      "score": -3,
      "created_utc": 1749255815.0,
      "replies": []
    },
    {
      "id": "mwav19m",
      "author": "drc84",
      "body": "You won’t have time to pair this and then calibrate it to your liking at a tournament. No one will buy this.",
      "score": -25,
      "created_utc": 1749210929.0,
      "replies": [
        {
          "id": "mwaw8v7",
          "author": "Dragon_yum",
          "body": "I think you will find out the number people who go to gaming tournaments, let alone bring their own hardware is not as big as you think.",
          "score": 17,
          "created_utc": 1749211427.0,
          "replies": [
            {
              "id": "mwbdi9h",
              "author": "outdatedboat",
              "body": "I mean, very very few people who compete in fighting game tournaments, are showing up without their own controller/fight stick. That'd be like trying to compete in a bike race without a bike. Just hoping someone will have a spare to lend you.\n\nAnd for big tournaments with thousands of entrants, yeah having to constantly connect and disconnect for every set would be annoying.\n\nGood thing the article explicitly states that you can just connect a USB-C cable and make it a wired controller and avoid all that mess.",
              "score": 5,
              "created_utc": 1749217522.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "mwat7ns",
      "author": "xtoc1981",
      "body": "At this point, we just need to say this. Sony has become a 3th party company just like ms",
      "score": -28,
      "created_utc": 1749210172.0,
      "replies": [
        {
          "id": "mwaumcr",
          "author": "Weir99",
          "body": "Why does it \"need\" to be said? What is so important about your classification between \"3th\" and \"1th\" party companies that it needs to be shared?",
          "score": 16,
          "created_utc": 1749210760.0,
          "replies": [
            {
              "id": "mwauxev",
              "author": "xtoc1981",
              "body": "That the game world is changing. They want to make more money.  Its a shift.",
              "score": -18,
              "created_utc": 1749210886.0,
              "replies": [
                {
                  "id": "mwb0b38",
                  "author": "leddhedd",
                  "body": "No...it isn't.\nNothing about this indicates any more or less greed than Sony have been showing for the last 20 years",
                  "score": 11,
                  "created_utc": 1749212998.0,
                  "replies": [
                    {
                      "id": "mwbctp2",
                      "author": "xtoc1981",
                      "body": "It's still a shift in what they were doing the last years. Which makes me wondering, would sony try to rival Steam? Well at least ms seems tyring todo that.\n\nAlso the sony defends, while is the most garbage gaming company of the layoffs they did (even while making a huge amount of money) is insane.",
                      "score": -6,
                      "created_utc": 1749217301.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "mwauv5w",
          "author": "FlorydaMan",
          "body": "Thirth",
          "score": 11,
          "created_utc": 1749210860.0,
          "replies": [
            {
              "id": "mwawc59",
              "author": "Dragon_yum",
              "body": "Thirst",
              "score": 1,
              "created_utc": 1749211464.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mwax12e",
          "author": "drmirage809",
          "body": "Yeah, no. Not gonna happen anytime soon. Not with how many PlayStations they sell.",
          "score": 3,
          "created_utc": 1749211738.0,
          "replies": [
            {
              "id": "mwbczl6",
              "author": "xtoc1981",
              "body": "The thing is, they already are. It's not an opinion, but a fact. Almost any 1st party title is on  or is coming to pc",
              "score": 1,
              "created_utc": 1749217354.0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}