{
  "post": {
    "title": "Japanese Police Arrest Man Accused Of Selling Modded Nintendo Switches",
    "author": "a_Ninja_b0y",
    "id": "1i3ikzi",
    "score": 1053,
    "created_utc": 1737126979.0,
    "selftext": "",
    "num_comments": 92,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1i3ikzi/japanese_police_arrest_man_accused_of_selling/"
  },
  "comments": [
    {
      "id": "m7n0rfj",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Unihertz Jelly Max - the World’s Smallest 5G Smartphone!\n\n[Click here to enter!](https://www.reddit.com/r/gadgets/comments/1hfli5p/giveaway_unihertz_jelly_max_rgadgets_win_the/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1737126980.0,
      "replies": []
    },
    {
      "id": "m7n3gw2",
      "author": "MINKIN2",
      "body": ">\"...the rigged system, playing \"illegally\" obtained games was meant to be possible, and **Otobe has further been accused of selling 27 pirated games**. He's since admitted to the charges, according to the news report\"\n\nHe loaded the modded switches with games.",
      "score": 413,
      "created_utc": 1737127796.0,
      "replies": [
        {
          "id": "m7nbjqg",
          "author": "None",
          "body": "[deleted]",
          "score": 122,
          "created_utc": 1737130183.0,
          "replies": [
            {
              "id": "m7o1j8y",
              "author": "TechnoRedneck",
              "body": "Looking into that he was arrested under a law in Japan from 2019 called the Unfair Competition Prevention Act, which makes distributing edited video game save files illegal...",
              "score": 82,
              "created_utc": 1737137643.0,
              "replies": [
                {
                  "id": "m7orq3i",
                  "author": "FunctionalFun",
                  "body": "Nintendo unironically outsourcing their game security to Japanese police.",
                  "score": 88,
                  "created_utc": 1737145264.0,
                  "replies": [
                    {
                      "id": "m7qspyg",
                      "author": "ICC-u",
                      "body": "Every corporation tries it, Nintendo are just very successful. In the UK we're still at supermarkets trying to replace security guards with police.",
                      "score": 28,
                      "created_utc": 1737169705.0,
                      "replies": [
                        {
                          "id": "m7w6owm",
                          "author": "Strawbuddy",
                          "body": "In the US these are known as Walmart cops, often a specific patrol that answers the calls at Walmarts",
                          "score": 6,
                          "created_utc": 1737246049.0,
                          "replies": [
                            {
                              "id": "m7w9bpi",
                              "author": "ICC-u",
                              "body": "Does Walmart have to pay for them?",
                              "score": 1,
                              "created_utc": 1737246886.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "m7w65eg",
                          "author": "Sir_Earl_Jeffries",
                          "body": "In the states, they’re locking everything behind Perspex",
                          "score": 1,
                          "created_utc": 1737245879.0,
                          "replies": [
                            {
                              "id": "m7w99g6",
                              "author": "ICC-u",
                              "body": "That'll stop em",
                              "score": 2,
                              "created_utc": 1737246865.0,
                              "replies": [
                                {
                                  "id": "m85xs7l",
                                  "author": "isugimpy",
                                  "body": "From buying things, yep.  Walgreens is already complaining about lost revenue, because people don't want to spend 10 minutes waiting for an employee to come unlock the case in the extremely understaffed stores.  People just leave instead of buying what they wanted, and go somewhere that it isn't locked up.",
                                  "score": 5,
                                  "created_utc": 1737383556.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7rwduo",
                  "author": "Gene_Shaughts",
                  "body": "That’s out of its goddamn mind. I just recently downloaded a Witcher 3 save file because I can’t be assed to find the gear diagrams I want going into Blood and Wine and hurt zero people and caused 0 dollars in lost revenue; and that’s criminal in Japan?  They can eat shit. I understand that Pokémon games have competitive angles but christ, just ban them.",
                  "score": 13,
                  "created_utc": 1737189866.0,
                  "replies": [
                    {
                      "id": "m7s1vi4",
                      "author": "None",
                      "body": "This isn't the only law that is like that. Japan also has a law banning rental of videogames (Think blockbuster). So you cannot just buy and then rent your copy to people for money. You can lend them, you can sell them but not rent them.\n\n\nThis was attempted in the US also but Nintendo lost the case (IDK the details but the Judge sided with the rental business) and the only thing Nintendo succeeded on doing is suing Blockbuster for distribution of copyrighted material (manuals were reprinted and given to customers which is what violated the law) so Blockbuster had to start drawing their own manuals.",
                      "score": 12,
                      "created_utc": 1737193416.0,
                      "replies": [
                        {
                          "id": "m7s2sdd",
                          "author": "Gene_Shaughts",
                          "body": "Yeah, this is why Nintendo zealots irritate me. I like the creative output but literally every other facet is craven, bullying, and petty dogshit.",
                          "score": 14,
                          "created_utc": 1737194003.0,
                          "replies": [
                            {
                              "id": "m7s3ok7",
                              "author": "None",
                              "body": "I guess it depends but I disagree. Most of Nintendo's legal stuff is strict but understandable. Shutting down rom sites (piracy), Yuzu (Promotion of piracy), Bowser guy (He did same thing as the Japanese guy in the article, sold pirated material) and Etika Joy Cons (Bad taste because they were made in memory but it turned out to be a scam anyway).\n\nHonorable mentions is them buying the distribution rights to Super Hornio Bros porn movies to end it because it damaged Super Mario brand. Only Part 2 is recovered with Part 1 still being lost so technically Nintendo owns porn movies.  \n\n\nI think the only time Nintnedo is truly evil is NSO replacing Virtual Console and Youtube Partners thing they used to do.  I still miss Virtual Console:( NSO sucks ass and I hate those who defend the dumb gamepass scheme that they did with old games.",
                              "score": -7,
                              "created_utc": 1737194580.0,
                              "replies": [
                                {
                                  "id": "m7s8uow",
                                  "author": "Gene_Shaughts",
                                  "body": "All reasonable so I’ll retract the “**all** facets” bit. I’m still going to shit on Nintendo after a lot of money in games broke alongside the console. Sure, I bought the games but they were tied to hardware that isn’t usable anymore. Guess I’ll have to rebuy the games.  It’s better now but I get to stay mad about hundreds of dollars gone because a company decided “nah, that game is gone. Buy it again”.",
                                  "score": 6,
                                  "created_utc": 1737197795.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "m7um1zs",
                          "author": "Soakitincider",
                          "body": "I rented so many games as a kid.",
                          "score": 3,
                          "created_utc": 1737228221.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "m7q1fvd",
              "author": "d0ctorzaius",
              "body": "Was it Bill? I never trusted him or his PC",
              "score": 6,
              "created_utc": 1737159762.0,
              "replies": [
                {
                  "id": "m7qockq",
                  "author": "Seadawg365",
                  "body": "Now that's funny!!!",
                  "score": 2,
                  "created_utc": 1737168048.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7nx35p",
              "author": "None",
              "body": "Was he just selling .sav files or modified full roms?",
              "score": 1,
              "created_utc": 1737136370.0,
              "replies": [
                {
                  "id": "m7nyuxi",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 13,
                  "created_utc": 1737136871.0,
                  "replies": [
                    {
                      "id": "m7o8u4n",
                      "author": "boomchacle",
                      "body": "That’s such a dystopian law oh my lord",
                      "score": 28,
                      "created_utc": 1737139726.0,
                      "replies": []
                    },
                    {
                      "id": "m7wafc7",
                      "author": "Megamatt215",
                      "body": "Competitive pokemon is fucking cutthroat.",
                      "score": 1,
                      "created_utc": 1737247250.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7t9r37",
          "author": "TehBanzors",
          "body": "I'm pretty sure selling modified hardware is illegal in Japan, games included or not. They have different laws regarding copyright.",
          "score": 3,
          "created_utc": 1737213621.0,
          "replies": []
        },
        {
          "id": "m7xdnd9",
          "author": "doyouevennoscope",
          "body": "So that's how that guy on eBay providing modchip installations for \"flash backups only\" is still running. Hmm. Who knew piracy would get the ninjas on you.",
          "score": 2,
          "created_utc": 1737260305.0,
          "replies": []
        },
        {
          "id": "m7tw9dw",
          "author": "Suired",
          "body": "Every time. If you are too dumb to figure out how to get modded games, you don't need a molded console. It's not an untapped market, it's likely a honey trap set so the big N has undeniable proof that you provided the service. \n\nN can cry about nodded consoles, but that's mainly legal to do depending on the method. Once you install pirated games on them, or even mention how to install them, you're ninja fodder.",
          "score": 1,
          "created_utc": 1737220473.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7nbwic",
      "author": "bizzaro321",
      "body": "Software pirates rarely get arrested, but when they do it’s usually because they tried to sell the shit.",
      "score": 145,
      "created_utc": 1737130286.0,
      "replies": [
        {
          "id": "m7nr9te",
          "author": "BamBamSquad",
          "body": "There’s a difference between stealing something for personal use vs. actively trying to turn a profit off of other people’s creations.",
          "score": 44,
          "created_utc": 1737134703.0,
          "replies": [
            {
              "id": "m7psm4t",
              "author": "LSeww",
              "body": "and there's a difference between stealing and making a N+1st copy of something",
              "score": 17,
              "created_utc": 1737156745.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7nil99",
          "author": "Fickle_Competition33",
          "body": "Yes, videogame companies sort of turn a blind eye on piracy as they know many of those people would never buy the game and play it, so it is better to have them helping the game become more popular. But when you try to make money out of it us where they draw a line.",
          "score": 25,
          "created_utc": 1737132200.0,
          "replies": [
            {
              "id": "m7nmvyj",
              "author": "nullstring",
              "body": "I don't think that's why. They just have bigger fish to fry.",
              "score": 20,
              "created_utc": 1737133428.0,
              "replies": [
                {
                  "id": "m7nrcoi",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 6,
                  "created_utc": 1737134726.0,
                  "replies": [
                    {
                      "id": "m7o8wvv",
                      "author": "nullstring",
                      "body": "Isn't this guy right here the bigger fish? What do you mean?",
                      "score": 3,
                      "created_utc": 1737139747.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "m7ntcrj",
          "author": "ButterKnights2",
          "body": "Yeah no point to sue poor people, you won't get anything",
          "score": 4,
          "created_utc": 1737135304.0,
          "replies": [
            {
              "id": "m7pvfz5",
              "author": "bizzaro321",
              "body": "You’d be surprised by the people that get really into piracy. Lots of people play switch ROMs on $2000 gaming PCs, and there’s plenty of people running giant Plex servers out of their basement.",
              "score": 4,
              "created_utc": 1737157709.0,
              "replies": [
                {
                  "id": "m7rlweu",
                  "author": "themule0808",
                  "body": "Is it really stealing if you own all the streaming sites? I know people who like it because of the quality is better than streaming. But they still have all the networks and sites in paid subscriptions.",
                  "score": 1,
                  "created_utc": 1737183362.0,
                  "replies": [
                    {
                      "id": "m7s3znc",
                      "author": "trixel121",
                      "body": "in my head it all comes down to the age of the material and who would get paid.\n\n\ncreators deserve to make money, but most media is owned by a distributor. \n\nalso  if that shit got you paid a decade ago  or you're rich af stop being greedy",
                      "score": 3,
                      "created_utc": 1737194779.0,
                      "replies": []
                    },
                    {
                      "id": "m7w19ix",
                      "author": "bizzaro321",
                      "body": "Streaming contracts are written very carefully, it’s probably illegal but it’s not stealing. It’s just unauthorized use.",
                      "score": 1,
                      "created_utc": 1737244305.0,
                      "replies": [
                        {
                          "id": "m7w7cew",
                          "author": "themule0808",
                          "body": "Interesting.. not sure what that would mean. But sure they don't care to much about that",
                          "score": 1,
                          "created_utc": 1737246244.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7nzhng",
      "author": "rabidelectronics",
      "body": "I got banned from eBay in the mid oughts for selling modded Xboxes... 😬",
      "score": 35,
      "created_utc": 1737137056.0,
      "replies": [
        {
          "id": "m7s92sb",
          "author": "Any-Razzmatazz-8399",
          "body": "‘Mid oughts’ has to be the most unique way I’ve seen someone say 2000s haha",
          "score": 14,
          "created_utc": 1737197931.0,
          "replies": [
            {
              "id": "m7t71n0",
              "author": "rabidelectronics",
              "body": "perhaps part of its seeming uniqueness is because I spelled 'aughts' wrong... :(",
              "score": 7,
              "created_utc": 1737212724.0,
              "replies": []
            },
            {
              "id": "m7wnqi7",
              "author": "CalmRadBee",
              "body": "Pretty standard I thought?",
              "score": 3,
              "created_utc": 1737251728.0,
              "replies": [
                {
                  "id": "m7wod8n",
                  "author": "Any-Razzmatazz-8399",
                  "body": "Might be because I was born in the ‘mid oughts’ so ppl I talk to aren’t reminiscing about those days so I don’t hear it said",
                  "score": 1,
                  "created_utc": 1737251946.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "m7pd8x0",
          "author": "Le_Sadie",
          "body": "Goddamn those things are hard to mod; were you doing it yourself?",
          "score": 4,
          "created_utc": 1737151733.0,
          "replies": [
            {
              "id": "m7ph55q",
              "author": "lordraiden007",
              "body": "The original XBox was pretty easy to mod, it’s the X360 that was a pain.",
              "score": 15,
              "created_utc": 1737152956.0,
              "replies": []
            },
            {
              "id": "m7pdtvu",
              "author": "rabidelectronics",
              "body": "it's been so long, but I remember it being fairly easy to mod the original Xbox once the physical mod chips were released. I modded tons for both friends and bought them used to mod and sell on ebay or craigslis. Installed the modchip, new HDD, new OS, and FTP'd over tons of ISO files of games and emulators. was a fun time!",
              "score": 4,
              "created_utc": 1737151911.0,
              "replies": [
                {
                  "id": "m7perh3",
                  "author": "Le_Sadie",
                  "body": "I just did my ps3 and it was relatively easy so I looked into my 360 and was like noooope :) it involves taking the thing apart and like, soldering and shit. I thought you had to similarly take apart the original.",
                  "score": 3,
                  "created_utc": 1737152202.0,
                  "replies": [
                    {
                      "id": "m7pfgfp",
                      "author": "rabidelectronics",
                      "body": "you definitely had to take apart the original. needed to get hex allen wrench set, but as long as you had the right tools it was really not too bad. I am not sure if it still exists, but there was a website called Xbox Scene that had all the best tutorials, and once I got it down, it was pretty easy. I never ventured into the realm of the 360 so not sure what that process is like. but I did mod my ps3 back in the day and Wii as well. I have read up a lot on modding the Switch and I may finally give that a shot once the Switch 2 is out, just for fun. It has been many years since I have done anything like that.",
                      "score": 4,
                      "created_utc": 1737152421.0,
                      "replies": [
                        {
                          "id": "m7pgfc4",
                          "author": "Le_Sadie",
                          "body": "Yeah, I've done all my handhelds as well; the vita was so similar to the ps3 it helped me learn wtf I was doing a lot faster. I've been looking into the Switch too but it doesn't look like the old R4-style flashcarts are going to fly this time, lol. I also worry about how vigilant nintendo has gotten and online consequences. Sony doesn't give a shit about their ps3 or vita anymore but nintendo was still adding updates to the 3ds well after they decommissioned it to try to evade modders. They do NOT like their stuff messed with",
                          "score": 2,
                          "created_utc": 1737152729.0,
                          "replies": [
                            {
                              "id": "m7phge3",
                              "author": "rabidelectronics",
                              "body": "I never had a Vita but the PSP was a perfect little handheld emulator for a long time. I'm sure the Vita is even better. and yeah that's why I am holding off on messing with my Switch, but once I have the 2 which is confirmed backwards compatible both digital and physical, ain't got much to lose modding the Switch 1 it seems. Just won't use it online and see how it goes. I remember when I modded my PS3 and booted it up the first time, that feeling of success was so good haha. hope you have fun with it, I miss my PS3 sometimes!",
                              "score": 2,
                              "created_utc": 1737153056.0,
                              "replies": [
                                {
                                  "id": "m7piw2o",
                                  "author": "Le_Sadie",
                                  "body": "I actually modded it mainly to play ps2 games and omg, it was harder to figure out anything with that stupid classics player and Apollo and changing the .iso for compatibility than modding the system itself. But when I figured all THAT out, man, I have been playing games I've wanted to play since they came out and I couldn't afford them ever since~\n\nI modded my psp too (the worst part was turning back the version but it was otherwise easy) and a modded vita can emulate psp games too so I use that now. And yes, still play it all the time...the number of amazing games stuck on a system no one got is depressing",
                                  "score": 2,
                                  "created_utc": 1737153513.0,
                                  "replies": [
                                    {
                                      "id": "m7pocvo",
                                      "author": "rabidelectronics",
                                      "body": "haha you are bringing back memories! I definitely remember turning back the OS/firmware version and all that. PS2 is another system that I somehow never messed around with much despite its popularity and how common they were, but I know there are tons of classics that I missed. maybe if I ever get a steamdeck or other newer handheld console I will dive into those consoles that I missed. a friend of mine just got the Retroid Pocket 5 and I got to check that out and it seems great. He is mostly using it for Gamecube games since that was a console that he missed but always wanted to check out. We played a bunch of two player games the other night and it worked pretty flawlessly even docked on his tv. pretty rad!",
                                      "score": 2,
                                      "created_utc": 1737155311.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "m7r9lh7",
                  "author": "sebjapon",
                  "body": "FBI! Give us your name and location right now!",
                  "score": 1,
                  "created_utc": 1737176853.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7n2v9d",
      "author": "Jugales",
      "body": "Confession: When I was 12-13, my cousin and I would scam people out of Xbox Points by telling them we can get them into modded CoD lobbies, throw a bunch of slang at them like “key-volts” and have them believe we were ready to launch the server for $20 worth of points. When they paid, we blocked them. Now my cousin is a cop lmfao",
      "score": 162,
      "created_utc": 1737127616.0,
      "replies": [
        {
          "id": "m7n3p7w",
          "author": "permanentmarker1",
          "body": "That’s a pretty normal thing for cops to do as kids",
          "score": 195,
          "created_utc": 1737127866.0,
          "replies": [
            {
              "id": "m7n6l2c",
              "author": "Ok-Criticism6874",
              "body": "That and twist the heads off of kittens and be abused by their fathers.",
              "score": 88,
              "created_utc": 1737128733.0,
              "replies": [
                {
                  "id": "m7ndlhj",
                  "author": "AtariAtari",
                  "body": "Can’t have one without the other",
                  "score": 19,
                  "created_utc": 1737130776.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7n6yvx",
              "author": "Jugales",
              "body": "Karma got him when he scammed the wrong person, who then hacked his account. My cousin got the account back fast, but not before his gamertag was changed to something like “igivebeejays69” … He couldn’t change it for some time either. Sincerely one of the funniest moments of my life",
              "score": 31,
              "created_utc": 1737128847.0,
              "replies": []
            },
            {
              "id": "m7nor8z",
              "author": "Sellazard",
              "body": "Sometimes even as adults too, unfortunately",
              "score": 5,
              "created_utc": 1737133972.0,
              "replies": []
            },
            {
              "id": "m7nh8zj",
              "author": "carsonator40",
              "body": "Average Reddit comment on police",
              "score": -9,
              "created_utc": 1737131819.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7nn1tc",
          "author": "MVPizzle_Redux",
          "body": "We took someone’s 1600 Microsoft points and then told him to wrap his Xbox in a towel until the lights turned red. That would make him 10th prestige\n\n>keyvolts\n\noh my god bro lmaoooo this took me back",
          "score": 15,
          "created_utc": 1737133476.0,
          "replies": []
        },
        {
          "id": "m7nnzgm",
          "author": "Torva_Platebody",
          "body": "This happened to me and I specifically remember “key-volts” being mentioned. I figured out I got duped, then turned around and did the exact same thing to somebody else. Gotta keep the spirit going",
          "score": 6,
          "created_utc": 1737133749.0,
          "replies": []
        },
        {
          "id": "m7pkxbn",
          "author": "kingwi11",
          "body": "My friend who is a cop did that, but with Neopets",
          "score": 3,
          "created_utc": 1737154174.0,
          "replies": []
        },
        {
          "id": "m7n6a7c",
          "author": "Snake_eyes_12",
          "body": "I had a couple of \"friends\" who did the same thing growing up.  I cant say they became cops but one is a security guard for a casino so he's doing fine.  And the other one is actually not doing so well with life, but I haven't talked to him in a couple of years so not sure.",
          "score": 8,
          "created_utc": 1737128644.0,
          "replies": []
        },
        {
          "id": "m7rwvcf",
          "author": "co5mosk-read",
          "body": "it was key vault and still possible https://teapotlive.net/",
          "score": 2,
          "created_utc": 1737190179.0,
          "replies": []
        },
        {
          "id": "m7oe50x",
          "author": "Kitakitakita",
          "body": "Now he gets paid for breaking the law",
          "score": 4,
          "created_utc": 1737141264.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7ntjb2",
      "author": "joestaff",
      "body": "And Nintendo is safe for another day, phew.",
      "score": 11,
      "created_utc": 1737135356.0,
      "replies": []
    },
    {
      "id": "m7n5jkp",
      "author": "fernofry",
      "body": "I would say \"don't they have bigger crimes to worry about\" but its Japan, so probably not.",
      "score": 31,
      "created_utc": 1737128423.0,
      "replies": [
        {
          "id": "m7nacrw",
          "author": "LoogyHead",
          "body": "You’re not wrong, but that’s kind of a fallacy. “Shouldn’t address this unlawful act, focus on this instead”\n\nLots of issues worth addressing, big and small.\n\nIn this case I think it dumb to arrest for modding hardware. Full stop. If they can prove he was stealing from his customers, or putting them at risk of something maybe that’s worth it. Not against Nintendo though.",
          "score": 14,
          "created_utc": 1737129836.0,
          "replies": [
            {
              "id": "m7nbooo",
              "author": "bizzaro321",
              "body": "Don’t you know there’s only one guy who works for the government? He has to pick his priorities.\n\nETA: this guy wasn’t just modding consoles, he loaded them with Nintendo roms. Selling roms is a different beast than simply downloading them yourself. I don’t think he belongs in prison or anything like that but the details are important.",
              "score": 10,
              "created_utc": 1737130223.0,
              "replies": []
            }
          ]
        },
        {
          "id": "m7nbdzm",
          "author": "PMTittiesPlzAndThx",
          "body": "Keep in mind the yakuza once got caught smuggling nukes \n\nEdit: nuclear material not full on nukes",
          "score": 5,
          "created_utc": 1737130137.0,
          "replies": []
        },
        {
          "id": "m7o5a3m",
          "author": "Shiningc00",
          "body": "Japan is full of sexual crimes.",
          "score": 0,
          "created_utc": 1737138706.0,
          "replies": []
        },
        {
          "id": "m7qz1uk",
          "author": "None",
          "body": "I think you get a life sentence for this in Japan.",
          "score": 1,
          "created_utc": 1737172231.0,
          "replies": []
        }
      ]
    },
    {
      "id": "m7rlftc",
      "author": "TCsnowdream",
      "body": "🚨 🤖 🕺 \n\nNo More!!!",
      "score": 2,
      "created_utc": 1737183096.0,
      "replies": [
        {
          "id": "m7zyba7",
          "author": "blue2526",
          "body": "Love this ad in the movies.",
          "score": 2,
          "created_utc": 1737302518.0,
          "replies": [
            {
              "id": "m803oaq",
              "author": "TCsnowdream",
              "body": "I’m so glad someone got this reference.",
              "score": 2,
              "created_utc": 1737304051.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "m7pj7wo",
      "author": "gldoorii",
      "body": "Meanwhile modded handhelds with hundreds/thousands of games for sale all over eBay",
      "score": 3,
      "created_utc": 1737153619.0,
      "replies": []
    },
    {
      "id": "m7ncmcz",
      "author": "UltimateFuchbois",
      "body": "I hear Nintendo is taking 99% of his yearly income after a mandatory 25 year sentence",
      "score": 4,
      "created_utc": 1737130494.0,
      "replies": [
        {
          "id": "m7neu8u",
          "author": "---TheFierceDeity---",
          "body": "Whenever people bring up that guy, I don't feel any empathy. Like yeah thats a crazy sentence but the dude was specifically selling \"pirating software\", his words, that contained malicious malware hidden in it. Additionally he had the arrogance after initially being found guilty to *continue selling the malware riddled Switch pirating software* \n\nThis prompted the courts to be extra harsh with his sentencing\n\nAlso I do feel the need to point out: Nintendo don't control the fking courts, the Japanese Legal System handed down that sentence. Like it wasn't \"Nintendo Court\", it a real ass court who found him guilty of a real crime.",
          "score": -1,
          "created_utc": 1737131132.0,
          "replies": [
            {
              "id": "m7nrtkb",
              "author": "fullmetaljackass",
              "body": "> malicious malware \n\n. . .",
              "score": 5,
              "created_utc": 1737134863.0,
              "replies": [
                {
                  "id": "m7o037m",
                  "author": "None",
                  "body": "ATM machine",
                  "score": 2,
                  "created_utc": 1737137228.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "m7nmq9q",
              "author": "_RADIANTSUN_",
              "body": "> Additionally he had the arrogance after initially being found guilty to continue selling the malware riddled Switch pirating software\n\nI don't see this as an arrogance thing. I am guessing that this was just how he knew how to make money now. I imagine it's hard to just get a regular job and work as a store clerk or something if you were making decent bank selling software, even if it's illegal.",
              "score": -1,
              "created_utc": 1737133382.0,
              "replies": [
                {
                  "id": "m7npmcg",
                  "author": "---TheFierceDeity---",
                  "body": "But if you've being found *guilty* of a specifically crime and are awaiting sentencing, you don't go home and keep committing the crime.\n\nLike its just common sense that's gonna get you in deeper trouble",
                  "score": 8,
                  "created_utc": 1737134226.0,
                  "replies": [
                    {
                      "id": "m7nu5lg",
                      "author": "_RADIANTSUN_",
                      "body": "Ya but why would he be arrogant if he already got caught?\n\nSounds like a guy who both 1) should almost certainly know how bad the risk of reoffending was and 2) yet determined it's necessary to roll the dice again anyway... indicating how \"bad\" things must be, in order to choose to make such an obviously bad decision. Not that he made the bad decision because he's just arrogant and thought he could simply do it again.",
                      "score": 0,
                      "created_utc": 1737135535.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "m7t8l5z",
      "author": "drealph90",
      "body": "His mistake was advertising it for piracy and for selling the pirated games, if he had just sold them as unlocked for Homebrew he probably/maybe wouldn't have been arrested.",
      "score": 1,
      "created_utc": 1737213238.0,
      "replies": []
    },
    {
      "id": "m8jog1c",
      "author": "rnnd",
      "body": "You gotta be a brave man to do that in Japan. In Japan, modifying commercial software without permission is a crime.",
      "score": 1,
      "created_utc": 1737558523.0,
      "replies": []
    },
    {
      "id": "m7r16uq",
      "author": "vicsunus",
      "body": "Are these like Glock switches?",
      "score": 1,
      "created_utc": 1737173120.0,
      "replies": []
    },
    {
      "id": "m7nyoly",
      "author": "kclongest",
      "body": "Brother, doing that in the motherland you’re asking to get locked up",
      "score": -1,
      "created_utc": 1737136821.0,
      "replies": []
    },
    {
      "id": "m7nfhn5",
      "author": "DeusKether",
      "body": "Bro tried thirdworldmaxxing in Japan of all places 💀",
      "score": -6,
      "created_utc": 1737131318.0,
      "replies": []
    }
  ]
}