{
  "post": {
    "title": "Nintendo president acknowledges \"Switch 2 is priced relatively high\" compared to the original, says bundles will help \"get off to the same start we did with Nintendo Switch\"",
    "author": "a_Ninja_b0y",
    "id": "1klotxk",
    "score": 541,
    "created_utc": 1747150035.0,
    "selftext": "",
    "num_comments": 193,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1klotxk/nintendo_president_acknowledges_switch_2_is/"
  },
  "comments": [
    {
      "id": "ms3uztv",
      "author": "hardy_83",
      "body": "If you want to ease pricing, bring back Players Choice and make many swtich 1 games $30, but you won't of course.",
      "score": 395,
      "created_utc": 1747150386.0,
      "replies": [
        {
          "id": "ms3z81r",
          "author": "nmarf16",
          "body": "When they realized ports of Wii U games could go for $60, players choice died on the spot",
          "score": 188,
          "created_utc": 1747151606.0,
          "replies": [
            {
              "id": "ms43kji",
              "author": "koekienator89",
              "body": "The they realized Wii U ports for Switch2 could be $80 ",
              "score": 85,
              "created_utc": 1747152881.0,
              "replies": [
                {
                  "id": "ms43qfu",
                  "author": "nmarf16",
                  "body": "Pog capitalism 😎 lol",
                  "score": 16,
                  "created_utc": 1747152929.0,
                  "replies": []
                },
                {
                  "id": "ms5hy4o",
                  "author": "blueblurz94",
                  "body": "$110 if you’re Canadian",
                  "score": 6,
                  "created_utc": 1747167430.0,
                  "replies": [
                    {
                      "id": "ms5uzq0",
                      "author": "ovranka23",
                      "body": "110 CAD is just 80 USD. what's the difference ?",
                      "score": 9,
                      "created_utc": 1747171267.0,
                      "replies": [
                        {
                          "id": "msagpfr",
                          "author": "DiffeoMorpheus",
                          "body": "Cost of living and income in CAD are numerically comparable to cost of living and income in USD, so functionally it costs the consumer a larger fraction of their income in canada",
                          "score": 7,
                          "created_utc": 1747238428.0,
                          "replies": [
                            {
                              "id": "msh3hbg",
                              "author": "ArtOfWarfare",
                              "body": "A takeout pizza is $20 these days. I can get a Switch 2 game for the cost of four takeout pizzas. That’s the same as it was when games were $60 and a pizza was $15.",
                              "score": 1,
                              "created_utc": 1747327002.0,
                              "replies": []
                            },
                            {
                              "id": "msao3jn",
                              "author": "ovranka23",
                              "body": "Wow those are some first world complaints right there. Wait till you hear how much a percentage of their income a single game is, in most of Asia.",
                              "score": -8,
                              "created_utc": 1747240567.0,
                              "replies": [
                                {
                                  "id": "msat6os",
                                  "author": "DiffeoMorpheus",
                                  "body": "It's not a complaint - this is a fact, and similar considerations likely extend to other economies as well, but I don't have experience to speak about them. Chill, and take a few hours off reddit",
                                  "score": 7,
                                  "created_utc": 1747242016.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms4sk6j",
              "author": "Yogurt_Ph1r3",
              "body": "BotW is 70 dollars for the switch 2 edition.",
              "score": 8,
              "created_utc": 1747160076.0,
              "replies": [
                {
                  "id": "ms9ae10",
                  "author": "RhetoricalOrator",
                  "body": "I think I'd buy cheap on the resell market and then just pay the upgrade fee.",
                  "score": 1,
                  "created_utc": 1747225038.0,
                  "replies": [
                    {
                      "id": "ms9bntr",
                      "author": "Yogurt_Ph1r3",
                      "body": "Yeah, I don't think it's worth it to buy switch 2 editions unless you're VERY passionate about everything being on disk but even for BotW, your dlc is still not on cart",
                      "score": 2,
                      "created_utc": 1747225530.0,
                      "replies": [
                        {
                          "id": "mscal3g",
                          "author": "kungfungus",
                          "body": "Dlc thing is a fucking shit, I bought it already. Wtffffff",
                          "score": 1,
                          "created_utc": 1747257629.0,
                          "replies": [
                            {
                              "id": "msd3zmx",
                              "author": "Yogurt_Ph1r3",
                              "body": "If you have the dlc you don't have to rebuy it",
                              "score": 3,
                              "created_utc": 1747267402.0,
                              "replies": [
                                {
                                  "id": "msd485z",
                                  "author": "kungfungus",
                                  "body": "Ah, ok.",
                                  "score": 1,
                                  "created_utc": 1747267486.0,
                                  "replies": [
                                    {
                                      "id": "msd5nal",
                                      "author": "Yogurt_Ph1r3",
                                      "body": "Yeah, the Switch 2 Edition Cartridge just doesn't specifically have it on cart so if you don't have the dlc you have to buy and if you do you have to download it. Kind of a poor choice imo but not the end of the world.",
                                      "score": 1,
                                      "created_utc": 1747267982.0,
                                      "replies": [
                                        {
                                          "id": "msd5ut1",
                                          "author": "kungfungus",
                                          "body": "Agree",
                                          "score": 1,
                                          "created_utc": 1747268056.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms72hmv",
              "author": "ChubbyChew",
              "body": "I seem to recall when the switch was young all the yet to be ported games seemed to be absent on the Nintendo Shop.\n\nAnd i only recall it because before Pikmin got ported i saw it for a super low $20 and thought to myself, \"i should just grab it on the console its cheaper on\"\n\nNot being able to find it again after they announced the switch ports \"felt\" super shitty. (And what throws me off is i recall after the dust settled with the ports both versions were available again, dont recall how they price compared though)\n\nIt feels so bizarre but uniquely slimy that i dont think i couldve imagined it",
              "score": 1,
              "created_utc": 1747186099.0,
              "replies": []
            },
            {
              "id": "ms4uc3k",
              "author": "NoMoreVillains",
              "body": "You mean when they realized they might as well have been new games for the overwhelming number of Switch owners because Wii U only sold 13m total and Switch beat that in its first year, they priced them as such \n\nNot saying they couldn't have made them cheaper, but it was obvious why they were treated like new games",
              "score": -6,
              "created_utc": 1747160586.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms4dxab",
          "author": "cat_prophecy",
          "body": "Best I can do is sell you a 10 year old game for ~~$60~~ $70.",
          "score": 38,
          "created_utc": 1747155884.0,
          "replies": [
            {
              "id": "ms4r4y8",
              "author": "KryptCeeper",
              "body": "Oops sorry now its 80",
              "score": 21,
              "created_utc": 1747159665.0,
              "replies": [
                {
                  "id": "ms9ifrx",
                  "author": "nextfilmdirector",
                  "body": "Apple has entered the chat",
                  "score": 1,
                  "created_utc": 1747227995.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms47xdt",
          "author": "The-student-",
          "body": "It would reduce the value of their stand alone Switch 2 Edition of games, so they won't do it, because then they'd have to sell those new versions for $30 less.",
          "score": 7,
          "created_utc": 1747154161.0,
          "replies": []
        },
        {
          "id": "ms4jbqe",
          "author": "NotAPirateLawyer",
          "body": "Also, suing your competition based on widely-used game mechanics you somehow managed to secure a patent for, despite the mechanic being present in literally dozens of games for decades, is a bad look. Fuck Nintendo.",
          "score": 16,
          "created_utc": 1747157450.0,
          "replies": [
            {
              "id": "ms5dpmi",
              "author": "CycloneMonkey",
              "body": "This has nothing to do with the present conversation.",
              "score": 1,
              "created_utc": 1747166216.0,
              "replies": [
                {
                  "id": "ms5eezf",
                  "author": "NotAPirateLawyer",
                  "body": "Sure it does. It highlights that Nintendo is a predatory company that uses lawfare to stifle competition instead of developing a better product, much like the Switch 2, which is just a rehashed switch with barely improved specs and no OLED. You can be damned sure if the steam deck released a model with removable controllers, Nintendo would pitch a fit.",
                  "score": 1,
                  "created_utc": 1747166419.0,
                  "replies": [
                    {
                      "id": "ms67hko",
                      "author": "Natural-Detail3872",
                      "body": "The specs aren't barely improved. What a stupid thing to say. It's way more powerful than the original Switch is.",
                      "score": 7,
                      "created_utc": 1747175286.0,
                      "replies": []
                    },
                    {
                      "id": "ms5ivc0",
                      "author": "SsooooOriginal",
                      "body": "I get automatic downvotes every comment I have made about the lack of OLED. \n\n\nIt is insulting and clear to anyone with critical thought left that they WILL repeat dropping a refresh with the SAME upgrades! \n\n\nExcept by then the switch2 OLED will be at least $650, MMW.",
                      "score": 0,
                      "created_utc": 1747167691.0,
                      "replies": [
                        {
                          "id": "ms9ikxk",
                          "author": "nextfilmdirector",
                          "body": "Not defending the price gouging but not everybody wants an OLED display.",
                          "score": 2,
                          "created_utc": 1747228045.0,
                          "replies": [
                            {
                              "id": "msapbhm",
                              "author": "SsooooOriginal",
                              "body": "Why? What is bad about OLED vs the basic LED?",
                              "score": 3,
                              "created_utc": 1747240919.0,
                              "replies": [
                                {
                                  "id": "msdthb5",
                                  "author": "nextfilmdirector",
                                  "body": "Personally it feels too bright to my eyes and I'm always turning it down.  Granted I have an OLED TV and I enjoy movies and TV shows on them, but for some reason on a handheld it's just too much for me.",
                                  "score": 0,
                                  "created_utc": 1747276344.0,
                                  "replies": [
                                    {
                                      "id": "msdwoov",
                                      "author": "SsooooOriginal",
                                      "body": "There are brightness settings, fyi.",
                                      "score": 3,
                                      "created_utc": 1747277554.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms4ujvh",
              "author": "zennok",
              "body": "wot? explain por favor",
              "score": 1,
              "created_utc": 1747160647.0,
              "replies": [
                {
                  "id": "ms4vest",
                  "author": "val_tuesday",
                  "body": "I believe he is referring to Pal World getting sued because they ripped off Pokemon. Not sure on the details, I seem to remember the actual suit was for something kind of strange.",
                  "score": 1,
                  "created_utc": 1747160892.0,
                  "replies": [
                    {
                      "id": "ms59x3y",
                      "author": "NotAPirateLawyer",
                      "body": "They ripped off Pokemon in the same way digimon ripped off Pokemon, and the same way Pokemon ripped off tamagachi. In other words, vague inspiration and nothing more. Nintendo has sued on the basis of a ton of patent violations (not trademark violations), based on a slew of patents they filed only after Palworld had been released for over a year. Included in these absolutely ridiculous patent claims are mechanics such as: \"Aiming and capturing characters,\" \"Smoothly switching riding objects in a virtual environment,\" and \"Initiating conflict via launching one creature at another.\" If those sound incredibly broad and commonplace, that's because they are. Nintendo is using the patent system to try and shut down competition that is (rightfully) highlighting the inadequacy of their own titles.\n\nI say again: Fuck Nintendo.",
                      "score": 12,
                      "created_utc": 1747165117.0,
                      "replies": [
                        {
                          "id": "msacbdg",
                          "author": "LanaDelHeeey",
                          "body": "To be fair if you look at the 3d model comparisons, some of the palworld creatures are extremely suspiciously close down to weird design quirks that you basically wouldn’t see unless they ripped the model then edited it.",
                          "score": -5,
                          "created_utc": 1747237184.0,
                          "replies": [
                            {
                              "id": "msdwf7n",
                              "author": "LinuxMakavry",
                              "body": "That’s not at all related to what they’re suing for. They’re suing for capture mechanics, and they’re suing for riding a mount/gliding with a mount. And they’re suing them specifically in Japan because obviously those wouldn’t be upheld anywhere else.",
                              "score": 4,
                              "created_utc": 1747277453.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ms56nvn",
                      "author": "XORandom",
                      "body": "I think he was talking about the lawsuit against Colopl.",
                      "score": 1,
                      "created_utc": 1747164148.0,
                      "replies": []
                    },
                    {
                      "id": "ms5f5j8",
                      "author": "master2873",
                      "body": ">I seem to remember the actual suit was for something kind of strange.\n\nIt was for capturing monsters with a ball like object. Nintendo claims they own the patent, and only sued for a VERY small amount (I heard it was like a dollar, but never fact checked it myself) so they have evidence of them defending their patent so they don't lose it, but was all taken care of instead of going to court.",
                      "score": -3,
                      "created_utc": 1747166633.0,
                      "replies": [
                        {
                          "id": "ms622wf",
                          "author": "NotAPirateLawyer",
                          "body": "$66k, and them suing establishes case law in their favor that the patent is legitimate. That, plus Palworld has to cease and desist.",
                          "score": 5,
                          "created_utc": 1747173505.0,
                          "replies": [
                            {
                              "id": "ms636p6",
                              "author": "master2873",
                              "body": "AH! Okay, thanks for the update/correction.\n\nI should have clarified in my original comment as well, that I'm not exactly saying it was right of Nintendo to do that, was just trying to add to the convo.",
                              "score": 1,
                              "created_utc": 1747173859.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms6iiwb",
          "author": "Moreinius",
          "body": "Nintendo Selects for 20$ on Wii back in the days was a steal on every single one of them.",
          "score": 1,
          "created_utc": 1747179059.0,
          "replies": []
        },
        {
          "id": "ms6j583",
          "author": "Soulprism",
          "body": "Why? Fools and their money….",
          "score": 1,
          "created_utc": 1747179269.0,
          "replies": []
        },
        {
          "id": "msh3umb",
          "author": "ArtOfWarfare",
          "body": "They’re not $30, but they are a good deal cheaper now than they were 8 years ago via inflation.\n\nIn a sense the price has come down. Not in a constant dollar sense, but in a value of money sense.",
          "score": 1,
          "created_utc": 1747327112.0,
          "replies": []
        },
        {
          "id": "msuma6d",
          "author": "KirbyMace",
          "body": "Wait I thought the switch 1 games, digital and cartridge, were backwards compatible",
          "score": 1,
          "created_utc": 1747514270.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms48l8x",
      "author": "PeaceBull",
      "body": "The bundles only look like a good deal because you ALSO raised the prices of the games. \n\nIf Mario Kart was still $60 then you're only saving $10 on the switch 2 if you get the bundle and were planning on picking that game up.",
      "score": 155,
      "created_utc": 1747154357.0,
      "replies": [
        {
          "id": "ms4qipe",
          "author": "Django_Phett",
          "body": "Also, offer other game bundles at launch. I don't want Mario Cart and there's no pack-in games. They're charging for an interactive instruction manual for fuck's sake",
          "score": 43,
          "created_utc": 1747159487.0,
          "replies": []
        },
        {
          "id": "ms4mez2",
          "author": "LePouletMignon",
          "body": "The bundle is a shitty deal IMO. Games like Mario Kart are undoubtedly going to appreciate over time. No point in getting these games digitally when they will eventually hold zero value and cannot be resold.",
          "score": 2,
          "created_utc": 1747158326.0,
          "replies": [
            {
              "id": "ms4ttyx",
              "author": "skellez",
              "body": "Why would Mario Kart World, the likely best selling game of the system appreciate lol, Nintendo will still be selling for the next 15 years, and by then there will likely like 30m copies available for second hand lol",
              "score": 39,
              "created_utc": 1747160442.0,
              "replies": []
            },
            {
              "id": "ms4ssld",
              "author": "Yogurt_Ph1r3",
              "body": "Why would I ever sell Mario Kart lol? It's the perfect game to have digitally, it's the sort of game you want with you all the time.",
              "score": 20,
              "created_utc": 1747160144.0,
              "replies": [
                {
                  "id": "ms56yjw",
                  "author": "BridgemanBridgeman",
                  "body": "Yes the Nintendo game cartridges are so huge definitely can’t bring more than one with you at a time",
                  "score": 6,
                  "created_utc": 1747164234.0,
                  "replies": [
                    {
                      "id": "ms5dcls",
                      "author": "Yogurt_Ph1r3",
                      "body": "Not everyone wants to have a big ass carrying case they want to slip it into a bag.",
                      "score": 5,
                      "created_utc": 1747166113.0,
                      "replies": [
                        {
                          "id": "ms5e3vs",
                          "author": "BridgemanBridgeman",
                          "body": "I have a case for my Switch that has 10 or so little sleeves you can put cartridges into. You should use a case when bringing your Switch anywhere anyway, plastic is easily scratched or damaged.",
                          "score": 4,
                          "created_utc": 1747166330.0,
                          "replies": [
                            {
                              "id": "ms5emhh",
                              "author": "Yogurt_Ph1r3",
                              "body": "I have a screen protector. More than substantial enough especially since my console is primarily a home console I just sometimes take on the bus.",
                              "score": 2,
                              "created_utc": 1747166479.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms4rgyo",
              "author": "Elephunkitis",
              "body": "Hardly anyone sells that game though.",
              "score": 3,
              "created_utc": 1747159761.0,
              "replies": []
            },
            {
              "id": "ms55b3q",
              "author": "rnnd",
              "body": "You'll have to wait like 20-30 years for that. Mario kart world would probably sell like 60 million copies. They won't be rare at all.",
              "score": 3,
              "created_utc": 1747163749.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms4zlyv",
          "author": "rundownv2",
          "body": "They're STILL not a good deal compared to the switch one. Even if it was 80 dollar games, you'd have been spending a total of 380. Even with the deal here you're spending 500 bucks for the bundle. Still around a 30% increase.",
          "score": 2,
          "created_utc": 1747162085.0,
          "replies": []
        },
        {
          "id": "ms89gqt",
          "author": "HeftyArgument",
          "body": "Bundles in Australia cost the same as buying the two\nparts separately lol, the only deal is less packaging for the manufacturer.",
          "score": 1,
          "created_utc": 1747204805.0,
          "replies": []
        },
        {
          "id": "ms58mww",
          "author": "gman5852",
          "body": "So the bundle is still a good deal? Got it.",
          "score": 0,
          "created_utc": 1747164732.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms4bp6a",
      "author": "brumfield85",
      "body": "Imma pass on the S2 for now. The price seems too high for what you get imo.",
      "score": 42,
      "created_utc": 1747155251.0,
      "replies": [
        {
          "id": "msbv73i",
          "author": "this_guy_over_here_",
          "body": ">The price seems too high for what you get imo.\n\nThat's just Nintendo in a nutshell though.",
          "score": 5,
          "created_utc": 1747252961.0,
          "replies": [
            {
              "id": "mscb87h",
              "author": "brumfield85",
              "body": "100%",
              "score": 5,
              "created_utc": 1747257824.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms43pz0",
      "author": "kain459",
      "body": "How bout The SNES? I got the snes with Super Mario World + All Stars in one package.",
      "score": 18,
      "created_utc": 1747152925.0,
      "replies": [
        {
          "id": "ms4to2n",
          "author": "PM_ME_UR_SO",
          "body": "That was like 30 years ago though",
          "score": 2,
          "created_utc": 1747160396.0,
          "replies": [
            {
              "id": "ms5k5pd",
              "author": "master2873",
              "body": "The NES, Gameboy, SNES, Wii, and WiiU all came with pack in games. They were definitely hit and miss with including pack in games, and is definitely greed at this point. $450 for 5 year old tech, and trying to charge for a glorified interactive manual is WILD. There might be a couple of others that might have came with games, but my memory isn't perfect lol.\n\nHaving that extra free game packed in gets people's attention, and makes it easier to get them to be part of the ecosystem of the platform. Now, it's a SIGNIFICANTLY harder pill to swallow when trying to charge $80+ for a Mario Kart game, that will more than likely have DLC if it does well, making it cost that much more.\n\nI wouldn't mind having a Switch 2, but with prices and other anti consumer practices they're trying to pull, along with software rising in price ranges above $70, and companies that will abuse the Game Key Card function that nullifies Nintendo's plug in play aspect of the Switch, despite physical games for Switch still sell VERY well compared to other platforms, but it's hard to swallow that pill. It seems so weird to alinate so many of the users of the past console, while making it unaffordable for others during a horrible economic time, and requiring SD Express that's barely used, and very expensive, along with 20% price hikes on all accessories around using similar and removed tech from the Switch 1, and the new tech being used has been around of over 20 years.\n\nIt's just too much for those who don't make a whole lot.",
              "score": 1,
              "created_utc": 1747168054.0,
              "replies": [
                {
                  "id": "ms6x368",
                  "author": "AgencyBasic3003",
                  "body": "You are either very young or you forgot what games used to cost back then. The N64 did cost $400 in today‘s prices. They initially planned to make it even more expensive but due to the competition from Sony and Sega they had to lower the price. The originally announced price would have been $500 in today‘s prices.\n\nAnd then you want to buy games:\nSure (all prices adjusted for inflation)\n\nSuper Mario 64 would cost $120\nWave Race 64 would cost $130\nTurok would cost $150!\n\nAnd you need a Gamepack to be even able to save your games. Another $70-80.  A controller? $100.\n\nNowadays you can get a couple of indie games or free to play games in the store and have enough to play for a life time. Back then we could afford maybe 1-2 games and played the hell out of them.\n\nModern gamers sure don’t know how well they have it. When I was a child I wouldn’t even dare to dream about the possibilities we have nowadays.",
                  "score": -3,
                  "created_utc": 1747184179.0,
                  "replies": [
                    {
                      "id": "ms6zb10",
                      "author": "master2873",
                      "body": ">You are either very young or you forgot what games used to cost back then. The N64 did cost $400 in today‘s prices.\n\nNeither.\n\nIssue is those games cost as much as they did because they required specialized, expensive, and licensed Cartridges from Nintendo. Same goes for the SNES and NES. Nintendo used to always discount their hardware after a few years as well. They don't do this anymore, same with their games via \"Player's Choice\" and stopped that too.\n\nTrying to compare prices to modern games today doesn't exactly work since the price varied on the cartridge to begin with (or potential helper chips added too), and was so expensive for publishers, it could nearly bankrupt them. It really doesn't cost that much for  Switch carts compared to the N64 or the SNES. Switch carts should be much cheaper than specialized carts for the SNES or N64 with helper chips even, and digital releases are an option now too, which makes these price points further make no sense.\n\nNot to mention a majority of price increases have been because of greed. Especially with Xbox's case. There is no universe that anyone is ever going to convince me that Mario Kart World is worth more than $60. These companies keep making profit, and record profit when prices keep going up. That should tell people something.\n\nEdit: Yes, downvote instead of refute. Next thing I know, you'll be using the the price of Neo Geo AES/MVS games to try justifying these greedy price increases for modern games. There's a reason why they cost as much as they did, but let's ignore that to think there's a pointless point to be made...",
                      "score": 5,
                      "created_utc": 1747184961.0,
                      "replies": []
                    },
                    {
                      "id": "ms8d2uj",
                      "author": "BobbyDig8L",
                      "body": "To be fair when I bought Super Mario 64 with my N64 I got the whole game, they didn't come back asking for more money for extra bits, nor did I have to spend half a day updating it when I got home (or worse it was broken at release and needed an update to work properly at all).  Also all games were a cartridge that was mine forever I could sell it, or in my case I still have it and can still play it.  I am extremely skeptical if digital copies of games will work in 30 years, likely the service/server/company may no longer exist or have revoked your license due to some technicality or TOC condition.  \n\n\n\nOh and that $100 N64 controller would work FOREVER, my originals are all fine.  Meanwhile I think I've had stick drift and needed replacements for like 4 Switch controllers and a few XBOX Series controllers since I got it...\n\n  \nI agree that costs are probably still comparable, but what you get is not.  I can't help but feel ripped off in today's market compared to the past and it's just getting worse...",
                      "score": 1,
                      "created_utc": 1747206964.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms7idw1",
          "author": "CarretillaRoja",
          "body": "Best Nintendo games ever.",
          "score": 1,
          "created_utc": 1747191865.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms4ll8s",
      "author": "RobertdBanks",
      "body": "Worth pointing out:\n\n>And despite the Switch 2 launch, **Nintendo is actually forecasting a decline in profit for the coming fiscal year.** Furukawa says \"we expect the gross profit ratio to decline due to **Nintendo Switch 2 hardware having a lower profit margin than Nintendo Switch hardware.**\"\n\n>In other words, **despite the $150 price increase, Nintendo is actually making less money on each Switch 2 sold than it does on Switch 1 units.** That's not entirely shocking - the tech that powers Switch 1 is eight years old at this point - but it illustrates the challenges of pricing tech in 2025's global economy.",
      "score": 7,
      "created_utc": 1747158095.0,
      "replies": [
        {
          "id": "ms9ajdh",
          "author": "jcw99",
          "body": "The real comparison is the profit margin of the Switch 1 at launch Vs the Switch 2. 8 years of manufacturing optimisation/going from cutting edge to legacy mean the current Switch 1 margine is basically incomparable.",
          "score": 1,
          "created_utc": 1747225095.0,
          "replies": []
        },
        {
          "id": "msumqdd",
          "author": "KirbyMace",
          "body": "They never plan on the hardware being profitable, it’s the software that has the highest profit margin. The hardware costs taper off the years after resulting in higher margins. Their statements is just PR to make the increase seem better",
          "score": 1,
          "created_utc": 1747514419.0,
          "replies": [
            {
              "id": "msvrgru",
              "author": "RobertdBanks",
              "body": "Nintendo is the exception to this rule, they have always traditionally profited and relied on console sales as well. \n\nFrom google:\n\n>Nintendo's business model focuses on making a profit from console sales, unlike Microsoft and Sony who may sell at a loss. Nintendo achieves this through a strategy of lower-cost, casual-focused consoles and a strong focus on first-party game development. While Nintendo Switch sales have been a major revenue driver, recent earnings reports have shown a decline in revenue and profit due to factors like slowing Switch sales.",
              "score": 1,
              "created_utc": 1747529195.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms6tht5",
      "author": "CapnBloodbeard",
      "body": "The problem isn't just the high price of the games. \n\nIt's compounded by the fact that the price never drops..any other console, you could wait a year and get the game much cheaper.   \nPeople need to factor the high game price in",
      "score": 7,
      "created_utc": 1747182887.0,
      "replies": []
    },
    {
      "id": "ms3yhup",
      "author": "weegee19",
      "body": "The issue isn't even the console price, it's priced well enough given its mobile hardware, the dock and joycon tech. The games being a tad pricier is the sourspot.",
      "score": 35,
      "created_utc": 1747151394.0,
      "replies": [
        {
          "id": "ms490jj",
          "author": "The-student-",
          "body": "As now Xbox is following suit with $80USD, I imagine Sony will eventually as well. So likely the prices will just be the new normal (with the added \"cost\" in that Nintendo games do not go on sale often, and Switch 1 games remain as full MRSP).",
          "score": 17,
          "created_utc": 1747154481.0,
          "replies": [
            {
              "id": "ms4ama9",
              "author": "Knickerbottom",
              "body": "And we should all be pissed about that ",
              "score": 9,
              "created_utc": 1747154946.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms69gv1",
      "author": "sc00bs000",
      "body": "switch 2 is alot more expensive than s1, the games peripherals are also alot more expensive. They really need to read the room during a world wide cost of living crisis. I dont think it's going to do aswell as s1",
      "score": 5,
      "created_utc": 1747175960.0,
      "replies": []
    },
    {
      "id": "ms3ujjy",
      "author": "MultiMarcus",
      "body": "Well, they are talking about the continuity between the consoles and I think that’s a big deal. I probably wouldn’t be getting the switch 2 at launch if it wasn’t for being able to play all my old games, many of which I’ll be able to play at higher frame rates and resolutions.",
      "score": 25,
      "created_utc": 1747150255.0,
      "replies": [
        {
          "id": "ms3xryf",
          "author": "cbass817",
          "body": "If you wouldn't get it for lunch, would you get it for dinner?",
          "score": 9,
          "created_utc": 1747151187.0,
          "replies": [
            {
              "id": "ms4e3pb",
              "author": "MultiMarcus",
              "body": "God, I hate how Apple’s transcription thing always writes “launch” as “lunch” thanks for the correction!",
              "score": 3,
              "created_utc": 1747155936.0,
              "replies": [
                {
                  "id": "ms4ksn7",
                  "author": "cbass817",
                  "body": "I wasn't trying to correct you, I was just trying to be funny in a stupid way.",
                  "score": 3,
                  "created_utc": 1747157867.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms4h06t",
          "author": "Burnstryk",
          "body": "Don't you need to pay to get the upgraded switch 2 experience?",
          "score": 3,
          "created_utc": 1747156782.0,
          "replies": [
            {
              "id": "ms4hdlt",
              "author": "MultiMarcus",
              "body": "Depends on the game.",
              "score": 2,
              "created_utc": 1747156891.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms3ypih",
          "author": "SheepWolves",
          "body": "Xbox did it right where you could bring your xbox one games to the Xbox series s\\x and if there was a next gen enhanced updates, you'd get it free. Nintendo being ninitendo are charging people for switch 2 upgrades.",
          "score": 7,
          "created_utc": 1747151455.0,
          "replies": [
            {
              "id": "ms4evgv",
              "author": "MultiMarcus",
              "body": "Not for all games. Just ones with more “substantial” upgrades seemingly. A number of games seem to get free performance patches, probably mostly the ones people wouldn’t buy an upgrade for.",
              "score": 3,
              "created_utc": 1747156158.0,
              "replies": []
            },
            {
              "id": "ms48jgq",
              "author": "The-student-",
              "body": "In this case Nintendo are also \"being\" Sony, in charging for next-gen upgrades. Though Sony added the fee later on, rather than immediately.",
              "score": 7,
              "created_utc": 1747154342.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms3xovt",
          "author": "jacobpederson",
          "body": "[I wouldn't be so sure about that.](https://www.nintendo.com/us/gaming-systems/switch-2/transfer-guide/compatible-games/)  Notice that about 75% of the library hasn't been tested beyond \"game can be started\"  This is NOT backward compatibility, [this is emulation](https://www.youtube.com/watch?v=WVgUe3qSU9k).  Be prepared for issues.\n\nEdit: added source - didn't realize this wasn't well known.",
          "score": 3,
          "created_utc": 1747151162.0,
          "replies": [
            {
              "id": "ms40rn7",
              "author": "blackscales18",
              "body": "It's not even emulation, it's a wrapper like proton iirc",
              "score": 10,
              "created_utc": 1747152052.0,
              "replies": [
                {
                  "id": "ms57kc4",
                  "author": "jacobpederson",
                  "body": "Correct, but for simplification purposes it is more similar to emulation than to hardware compatibility.",
                  "score": 0,
                  "created_utc": 1747164411.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms42txz",
              "author": "gman5852",
              "body": "100% of the first party library can be ran. The only exception being labo VR which uses the physical dimensions of the Switch 1. It'd be silly to assume the random eshop games that haven't been hand ran yet are the magical exception.\n\nIt's also not emulation, that's already been officially confirmed.",
              "score": 11,
              "created_utc": 1747152663.0,
              "replies": [
                {
                  "id": "ms4bcu5",
                  "author": "jacobpederson",
                  "body": "[Lol no it hasn't; Just the opposite in fact.  ](https://www.youtube.com/watch?v=WVgUe3qSU9k)Of COURSE their first party stuff works - because they have tuned it to make absolutely sure that they work.  However, the first party stuff is about .01% of the library (122 vs 12k or so).  This stuff cannot be tested aside from the automated does it launch test - because the amount of labor to play 12k games front to back is absurd.  We won't know if it works until we have the system in hand and people start finding the issues.",
                  "score": 2,
                  "created_utc": 1747155155.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ms4t2nn",
              "author": "Yogurt_Ph1r3",
              "body": "This is crazy misleading.",
              "score": 2,
              "created_utc": 1747160225.0,
              "replies": []
            },
            {
              "id": "ms4eigj",
              "author": "MultiMarcus",
              "body": "Well, yeah, but I basically don’t have any games from third parties. I was aware of this issue, but I would much rather play multiplatform games on my PC which outperforms the switch 2 by quite a bit. To me the Switch and now Switch 2 are just Nintendo machines basically.",
              "score": 1,
              "created_utc": 1747156054.0,
              "replies": [
                {
                  "id": "ms57v51",
                  "author": "jacobpederson",
                  "body": "Yea me neither, but I am an edge case - a lot of folks use switch as a primary console.",
                  "score": 1,
                  "created_utc": 1747164498.0,
                  "replies": [
                    {
                      "id": "ms5j60v",
                      "author": "MultiMarcus",
                      "body": "Sure, that’s true but something we’ve learnt over the years is that in all likelihood most of the popular games that don’t have some technical hardware reason for not being compatible will be updated to be compatible with the Switch 2. Advanced majority of time spent in games is in a fairly short list of very popular titles and on the switch it’s primarily Nintendo titles which all seem to be okay with some peripheral requiring exceptions. There are also some third-party titles but I think most of them will at least get an update to function on the new console even if they don’t get a boost.",
                      "score": 1,
                      "created_utc": 1747167775.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms44j7h",
              "author": "Thedanielone29",
              "body": "People who think it’s emulation are a special type of smart. Nintendo can’t even make a better SNES emulator than the fan community but suddenly they were able to immediately make a switch 1 emulator that is able to launch all games with no issue? It’s one of those things where you just have to think for like three seconds to know it can’t be true",
              "score": -5,
              "created_utc": 1747153166.0,
              "replies": [
                {
                  "id": "ms495y6",
                  "author": "Dhiox",
                  "body": ">Nintendo can’t even make a better SNES emulator than the fan community\n\nCan't or won't? Nintendo employs talented engineers, they could outperform anything fan volunteers make if they dedicate the resources to it.",
                  "score": 4,
                  "created_utc": 1747154525.0,
                  "replies": []
                },
                {
                  "id": "ms4a538",
                  "author": "jacobpederson",
                  "body": "[It is emulation. ](https://www.youtube.com/watch?v=WVgUe3qSU9k)  This isn't conjecture at this point - Nintendo has openly confirmed this.  Even if you couldn't be bothered take a cursory glance at the combability list and notice something ain't right there :D",
                  "score": 2,
                  "created_utc": 1747154809.0,
                  "replies": [
                    {
                      "id": "ms4tfzb",
                      "author": "PSIwind",
                      "body": "MVG was spreading around information with a clickbait video saying Switch 2 BC would most likely not be happening and then he tries to go \"OH ACKSHUALLY\" with this once it was confirmed by Nintendo and how they do it. It's a mix of emulation and a wrapper, not fully emulation to begin with. He's annoying these days and continues to spread misinformation or not tell the whole story for revenue.",
                      "score": 1,
                      "created_utc": 1747160331.0,
                      "replies": []
                    },
                    {
                      "id": "ms4ilag",
                      "author": "Thedanielone29",
                      "body": "Do you know about WINE? Google what it stands for if you don’t. Translation layers are not emulation. Nintendo has confirmed Jack. I understand the steam deck is great for emulation, but are we really going to say it emulates every single game on there? I don’t think you really know what an emulator is.",
                      "score": -1,
                      "created_utc": 1747157242.0,
                      "replies": [
                        {
                          "id": "ms56u7k",
                          "author": "jacobpederson",
                          "body": "Correct - a translation is not quite the same thing as emulation, but for the purposes of how does it effect compatibility?  They are close enough to make no difference.  This isn't the kind of nearly perfect backwards compatibility that say PS2 to PS1 was (because PS2 had the PS1 CPU added on strictly for that purpose.   This isn't quite the doomsday scenario of 360 back compat either . . . at least the chips are from the same vendor and will share a lot of calls.",
                          "score": 1,
                          "created_utc": 1747164199.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms8a1gz",
          "author": "Eurynom0s",
          "body": "Honestly the main reason I preordered one is because who the fuck knows if our big demented president makes it cost $900 by the time there's a solid catalog of new Switch 2 specific games. ",
          "score": 1,
          "created_utc": 1747205144.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms412j1",
      "author": "OperativePiGuy",
      "body": "I would say I wish them the best, but I don't. I hope they get humbled a bit this generation.",
      "score": 25,
      "created_utc": 1747152141.0,
      "replies": [
        {
          "id": "ms497l4",
          "author": "The-student-",
          "body": "We will see. The quote from this article is actually the president saying they underestimated the console's demand - they thought it would be lower due to the high price, but it was a higher demand despite that.",
          "score": 16,
          "created_utc": 1747154538.0,
          "replies": [
            {
              "id": "ms49inj",
              "author": "OperativePiGuy",
              "body": "Cool, and yet I still hope they struggle.",
              "score": 5,
              "created_utc": 1747154629.0,
              "replies": [
                {
                  "id": "ms5792h",
                  "author": "BridgemanBridgeman",
                  "body": "For some reason one of the most delightful things about the Switch 2 release has been the salty salty reddit tears",
                  "score": -6,
                  "created_utc": 1747164319.0,
                  "replies": [
                    {
                      "id": "ms5cpnt",
                      "author": "OperativePiGuy",
                      "body": "For me it's watching all the apologists do mental gymnastics to avoid having to criticize their precious favorite videogame company. It's hilarious, as usual, with the Nintendo fanboys in particular. The insecurity is interesting to see.",
                      "score": 6,
                      "created_utc": 1747165929.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ms6irno",
              "author": "SweetCosmicPope",
              "body": "How much of that demand is being driven by scalpers, though?  The real test will be seeing how much money people are willing to shell out for a scalped Switch 2, and what the sales look like after the initial launch window closes.\n\nI'm in the same boat.  I actually don't have a problem with the cost of the switch 2 itself, but the price of games and some of the shady legal shit nintendo has been doing lately has me put off from wanting to buy one.  This will be the first Nintendo console EVER that I didn't get at launch.  I do suspect I'll get one at some point because they make some of my favorite games, but I'm not rushing out to get one and I'm taking the wait-and-see approach in hopes that they fail hard and have to course-correct.",
              "score": 2,
              "created_utc": 1747179141.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms4cfu7",
      "author": "Xero_id",
      "body": "It would be a fine business model to go high on the Switch 2 and keep games at same price as last gen but to go overly high on both in this economy is stupid. Switch 2 will sell really well but they would make more money by dropping it just $50",
      "score": 5,
      "created_utc": 1747155462.0,
      "replies": [
        {
          "id": "ms67hv8",
          "author": "AstronautGuy42",
          "body": "I think $450 is very fair for the console price. A lot has changed since 2020. Lower than $450 for what the Switch 2 offers isn’t realistic",
          "score": 3,
          "created_utc": 1747175289.0,
          "replies": []
        },
        {
          "id": "ms8a7y8",
          "author": "Eurynom0s",
          "body": "What they're not saying is the cost of the games and accessories is higher than they would have been because the big beautiful tariffs are eating their profit margins and the price of the console would have to be even higher if they didn't spread it around in everything else instead. ",
          "score": 1,
          "created_utc": 1747205252.0,
          "replies": [
            {
              "id": "msa4z7i",
              "author": "Xero_id",
              "body": "Nintendo was going $450 of console and $80 games without the tariffs, accessories may be more because of it but console and games are being sold at what they planned still.",
              "score": 2,
              "created_utc": 1747235065.0,
              "replies": [
                {
                  "id": "msa6d0p",
                  "author": "Eurynom0s",
                  "body": "Some amount of Trump tariffs was already baked into the pricing. That's why it took them so long to announce a price, to try to get a sense of how much they needed to add to the price to account for Trump inevitably increasing tariffs. They did get blindsided by the ridiculous shit right after their official reveal in April though.",
                  "score": 1,
                  "created_utc": 1747235470.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ms4454f",
      "author": "gman5852",
      "body": "The hardware being $450 is almost exactly what I expected, and I wasn't anticipating 120 fps capabilities or 4k/60fps. Zero complaints about hardware cost and honestly people that actually did their research prior haven't really complained either.\n\nIt's very interesting seeing everybody who actually followed the console predict $450 based purely on what the hardware was allegedly capable, see that it's actually outputting more than expected, and then get drowned out by the horde of people who never cared to begin with wanting to complain about the latest edrama.",
      "score": 14,
      "created_utc": 1747153050.0,
      "replies": [
        {
          "id": "ms4ah9s",
          "author": "nero40",
          "body": "The Switch 2 being $450 isn’t really the biggest problem here. As you say, it’s almost expected. It’s the game’s pricing that is the real problem. And it has been a problem since around halfway through the Switch lifecycle. Maybe not flame people for the wrong reasons.",
          "score": 10,
          "created_utc": 1747154905.0,
          "replies": [
            {
              "id": "ms4tp1e",
              "author": "Yogurt_Ph1r3",
              "body": "The game pricing if 80 is the exception is both expected and fine in America, as a Canadian I'm pissed though because they hiked the prices up 20 bucks instead of 10. 70 dollar games are 90 here but they appear to now be 100, which is a pill to swallow for any game I'm not 100% sure I want. I'll pay that for Mario, Zelda, Fire Emblem and Xenoblade but anything else? Not a chance in hell unless my job gets real better real quick.",
              "score": 3,
              "created_utc": 1747160403.0,
              "replies": []
            },
            {
              "id": "ms4kahp",
              "author": "Elon61",
              "body": "Why is the game pricing a problem? Because the internet decided so? \n\nNobody is entitled to buy a game at a discount, you do realise that? Or at 60$ rather than 80$.\n\nJust because nearly the entire rest of the industry decided that it’s the right move for them doesn’t mean Nintendo has to do the same.",
              "score": -2,
              "created_utc": 1747157725.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms487ls",
          "author": "The-student-",
          "body": "$450 is the higher end of reasonable expectations, I think a lot hoped they'd do $399 to really make it an appealing value, but $450 is still a reasonable price - especially when you consider they wouldn't have sold at a loss anyways.",
          "score": 3,
          "created_utc": 1747154246.0,
          "replies": [
            {
              "id": "ms4tzgy",
              "author": "PSIwind",
              "body": "if the Switch Pro were to come out, it would have been priced at either $350 like the OLED or $400. And if the Switch 2 kept the price, people would have seen its only $50-100 more than the Pro and go \"oh yeah thats a reasonable increase\". If we want to argue though, the Switch 2 is only $100 more than the OLED model, which is honestly a ripoff to buy unless you play a lot on handheld.",
              "score": 1,
              "created_utc": 1747160485.0,
              "replies": []
            },
            {
              "id": "ms4juzv",
              "author": "Elon61",
              "body": "Most people have no deeper understanding beyond the sticker price. Higher = bad and greedy company in their minds because they simply cannot imagine a “good” reason for the price increase. \n\nIt’s a plague across any community with a large enough following because you only have so many people who are dedicated enough and broadly knowledgeable enough to understand both the economic and technological reasons behind this. \n\nAnd for some reason they just don’t care enough to fix that gap, they’d rather keep whining.",
              "score": -1,
              "created_utc": 1747157602.0,
              "replies": [
                {
                  "id": "ms4u3bz",
                  "author": "Yogurt_Ph1r3",
                  "body": "There is no possible good reason for a price increase from a consumer POV. There are understandable and not greedy reasons the company may have that reduce the blow but there is objectively no reason to be happy about a higher sticker price for something you are going to buy unless you are also a stakeholder in the company selling the things",
                  "score": 0,
                  "created_utc": 1747160517.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms4akx0",
          "author": "DavidinCT",
          "body": "Here is the deal, someone was able to get the motherboard on YouTube and rip the CPU and GPU apart tell what they are.\n\nSpec wise the video is less than a RTX1050, and by the specs it is slower than an Xbox one X (10 year old consoles).  It's very old tech, not modern tech just lower spec'ed, it's OLD tech.\n\nIt's a HUGE bit slower than an Xbox Series S but, sure it's faster than the Switch 1 but, more expensive by like $150...\n\nTech wise, this just has a 1080p LCD display, this should be no more than $299-349 price range, $450, they are nuts.  They are making a lot of profit on this console.\n\nAnd a reminder that in Japan, it will be like $330 or something like that. What it should cost around the world.\n\n$450 with an OLED, I could see.... Nintendo is over charging for this console.\n\nEdit: here is the video...\n\n[https://www.youtube.com/watch?v=3pr\\_V8rtzrE](https://www.youtube.com/watch?v=3pr_V8rtzrE)",
          "score": -1,
          "created_utc": 1747154934.0,
          "replies": [
            {
              "id": "ms4lvjh",
              "author": "Elon61",
              "body": "It’s running a 4 year old architecture on the GPU side, it’s really not 10 year old lol. \n\nAsking for it to be 300$ really shows you have no idea what anything costs.",
              "score": 4,
              "created_utc": 1747158174.0,
              "replies": [
                {
                  "id": "msabi0f",
                  "author": "DavidinCT",
                  "body": "Let me correct myself, the RTX1050 was released on October 25, 2016, that is 9 almost 10 years ago.\n\nIt might be running a newer architecture but, comparably, PERFORMANCE WISE, it is less than a 9 1/2-year-old Nvidia card. Should I go over the AMD comparable specs to show how old the performance tech they are using is??????\n\nShows you how clueless you are here on true performance, Spec wise it's lower than a Series S, a lot lower (like by 1/3), and that is a $300 at retail console, the Switch 2 should be no more than $350 based on specs, performance, display and upgrade over the last console.\n\nAnd in Japan, they will be selling the Switch 2 for $330 (converted into to USD), about what it should be sold for....\n\nSure, it's faster than the Switch 1, it costs almost as much as a PS5 and Series X (if you include a game, it's the same price) and is not even in the same ballpark in performance numbers, not even 2/10ths of the performance.\n\nYour post shows you how much of a Nintendo fanboy you are, this console could be $700 and you would still justify it some way or another.\n\nI will stand by my statement; Nintendo is over charging for this console.... There are a lot of facts to back this up...\n\nSwitch 1 was a gloried cell phone processor that was 3-4 years old when released, the Switch 2 is following the same path.\n\nI like Nintendo games but, as a company, I hate them.  I am a true numbers guy, and performance is key, the Switch 2 is a joke for a release in 2025....\n\nDown vote away clueless fanboys...",
                  "score": -1,
                  "created_utc": 1747236950.0,
                  "replies": [
                    {
                      "id": "msfjz24",
                      "author": "Elon61",
                      "body": "It's funny that you link a video that explicitly states the technology used in T239 (Upgraded Ampere cores on samsung weird 8nm node), and also shows the most immediately comparable chip on the market is T234, which on a carrier board retailed for 300$, now 250$, which immediately throws all your clueless cost estimates out the window. there's only so much markup on a dev kit at that, nintendo could easily be paying just as much. Then on top of that chip Nintendo still needs to pay for everything else...\n\nStuff costs what it costs, just because you can't think any further than a benchmark score does not in \"fact\" mean the price should be lower. \n\n>  Down vote away clueless fanboys... \n\nHaving some self-awareness wouldn't hurt.",
                      "score": 0,
                      "created_utc": 1747308855.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ms4bws6",
          "author": "MixaLv",
          "body": "I'm still flabbergasted that Metroid Prime 4 aims for 4K 60fps, and I only believe it when I see it. 4K 3D games are a big task from a system that only draws 42W, the base PS5 is about 200W.",
          "score": 0,
          "created_utc": 1747155312.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms415xs",
      "author": "TheJasonaut",
      "body": "I'm pulling for you guys. 🙁🙏💰",
      "score": 2,
      "created_utc": 1747152169.0,
      "replies": []
    },
    {
      "id": "ms7pgnh",
      "author": "dinoooooooooos",
      "body": "Nope.",
      "score": 2,
      "created_utc": 1747194749.0,
      "replies": []
    },
    {
      "id": "ms7ulzw",
      "author": "Klezmer_Mesmerizer",
      "body": "Nope.",
      "score": 2,
      "created_utc": 1747196952.0,
      "replies": []
    },
    {
      "id": "mscz870",
      "author": "hamsterwheelin",
      "body": "Just going to wait a year on this one.  More titles will be out and worst case, pricing will be the same.  Literally no reason to be an early adopter.",
      "score": 2,
      "created_utc": 1747265772.0,
      "replies": []
    },
    {
      "id": "msk1x7i",
      "author": "Xanchush",
      "body": "Honestly, most of the games I play are on Steam. So I'm opting for the steam deck instead.",
      "score": 2,
      "created_utc": 1747361070.0,
      "replies": []
    },
    {
      "id": "ms46r0u",
      "author": "Pavillian",
      "body": "I wonder how the key carts are gonna go down with parents buying it for their kids. It needs the Internet now.",
      "score": 3,
      "created_utc": 1747153814.0,
      "replies": [
        {
          "id": "ms4usqy",
          "author": "Yogurt_Ph1r3",
          "body": "I don't think they're like cloud games, it needs the internet to download the game but I don't think it needs it to launch it.",
          "score": 3,
          "created_utc": 1747160716.0,
          "replies": []
        },
        {
          "id": "ms49oho",
          "author": "The-student-",
          "body": "I imagine parents mostly buy kids Nintendo games, which are all on the game card still. For third parties it's not significantly different than other consoles where the game needs to be installed from the disc prior to playing. If they bought the game for the car ride without setting up first, yeah that would be an issue.",
          "score": 2,
          "created_utc": 1747154676.0,
          "replies": [
            {
              "id": "ms4t8af",
              "author": "Raistlarn",
              "body": "If you live in a rural area then there is a significant difference between games that need to be installed from the disc with a small update and a game that needs to be completely downloaded then installed.  An example is I live in a rural area that only offers 10Mb (mega bits or 1.111MB) down at an affordable price.  A 150GB game (FF7 Rebirth) took a little over an hour to install from the disc and download the update.  The same game would have taken close to a week to download and install off the PSN, because I don't want to destroy the bandwidth for everyone else in the house.",
              "score": 1,
              "created_utc": 1747160270.0,
              "replies": []
            }
          ]
        },
        {
          "id": "ms4ccb5",
          "author": "Dhiox",
          "body": "You act like there internet isn't in literally every home now. Any family giving their kids a switch also has an internet connection",
          "score": -3,
          "created_utc": 1747155434.0,
          "replies": []
        },
        {
          "id": "ms5hoze",
          "author": "None",
          "body": "[removed]",
          "score": -1,
          "created_utc": 1747167358.0,
          "replies": [
            {
              "id": "ms5x8pv",
              "author": "Pavillian",
              "body": "don’t some people have data caps? Limits on how much they can download. Idk I could just see it being unfortunate for some.",
              "score": 1,
              "created_utc": 1747171993.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ms41g5b",
      "author": "matthra",
      "body": "I'm gonna wait to see how this turns out before I decide if I'm getting one. Like I could get one of the better steam deck competitors for that price and instantly have access to my entire steam library. \n\nNintendo is releasing this like they already have the market cornered, but this is not 2017. There are viable competitors, who are already in the market, and have a much better value proposition.",
      "score": 3,
      "created_utc": 1747152252.0,
      "replies": [
        {
          "id": "ms4c3d8",
          "author": "Dhiox",
          "body": ">Nintendo is releasing this like they already have the market cornered, but this is not 2017.\n\nTheir biggest competitor has sold 2% their total switch sales. They absolutely have the handheld market cornered.",
          "score": 11,
          "created_utc": 1747155363.0,
          "replies": []
        },
        {
          "id": "ms549ev",
          "author": "ninjapro98",
          "body": "Idk what world you’re in where Nintendo doesn’t have the handheld market cornered. Every other option is niche and for pc enthusiasts almost exclusively",
          "score": 5,
          "created_utc": 1747163443.0,
          "replies": []
        },
        {
          "id": "mscoagf",
          "author": "Lankpants",
          "body": "Why do people act like the Steam Deck is a competitor? It's a novelty. The Steam Deck has sold 4 million units. That is not competing with the Switch. The Switch sold more than 4 million units in Q4 2024, 7 years out from its release.\n\nIf that's competition for Nintendo's 150 million sales then I'm out here competing with Usain Bolt. The Switch is in a class of its own and the Steam Deck is way too niche to be viable competition. The Switch does have the market cornered, you are just part of a slightly different more niche market.",
          "score": 2,
          "created_utc": 1747262028.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms5byag",
      "author": "goldaxis",
      "body": "It's gonna sell out at launch like everything, then go on to sell half as much as the Switch 1. Mark this post.\n\nSource: 3DS enjoyer",
      "score": 2,
      "created_utc": 1747165709.0,
      "replies": []
    },
    {
      "id": "ms7qcji",
      "author": "JimBob-Joe",
      "body": "I was at walmart today and saw that Skyward Sword for the switch was $80 CAD. The original came out in 2011, and the switch port came out in 2021. \n\nI'd rather go buy 10 games for less than $100 on a steam sale. I could play them on my steam deck if I really want the portability.",
      "score": 2,
      "created_utc": 1747195128.0,
      "replies": []
    },
    {
      "id": "ms4ujz1",
      "author": "RhythmBlue",
      "body": "its like all about exclusive games to me.  500$ for mario kart, 570$ for mario kart and donkey kong a month after release?  it just doesnt seem worth it, and i really thought/think the switch 2 april video was just horrendous in terms of selling a console, to that end.   I mean, people seem to be buying the fuck out of it, but god it could have been a way better sell i think — just wondering why they arent promoting and/or making more games.  The switch 2 video just basically said 'hey yo dont buy this for a year'\n\nbundles seem like inconsequential compared to library",
      "score": 2,
      "created_utc": 1747160648.0,
      "replies": []
    },
    {
      "id": "ms7z58a",
      "author": "DontWreckYosef",
      "body": "If it weren’t for the preorders, I would have said that Switch 2 is setting up to be a WiiU style failure. Even at $500, I cannot believe how massive the demand is for a console that is lagging behind Sony for about the same price. GTA6 won’t even be on Switch 2. It’s a $500 Mario Kart and Donkey Kong machine, and as someone who has owned nothing but Nintendo consoles for 30 years, with a recession looming, I truly do not understand how the massive demand is justifiable.",
      "score": 1,
      "created_utc": 1747199122.0,
      "replies": []
    },
    {
      "id": "ms4hr0o",
      "author": "TheCrazedTank",
      "body": "Nintendo: Thank you for taking out a loan to buy the New Switch!\n\nOur AI Detection System says you have illegally modified the console. We aren’t sure if you actually did or not but we are bricking it regardless.\n\nIf this was in error please get bent and buy another console!",
      "score": 3,
      "created_utc": 1747157001.0,
      "replies": []
    },
    {
      "id": "ms4800g",
      "author": "Dalcz",
      "body": "Can’t they make a bundle with donkeykong too?",
      "score": 1,
      "created_utc": 1747154183.0,
      "replies": [
        {
          "id": "ms4ubzz",
          "author": "Yogurt_Ph1r3",
          "body": "Maybe they will, it won't be a launch bundle though because it's not a launch title.",
          "score": 1,
          "created_utc": 1747160586.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms7vxxc",
      "author": "Uncle_Hephaestus",
      "body": "idk between the price and the fact you don't seem to actually own the system. it feels like it might undersell the original in the over 18 age bracket",
      "score": 1,
      "created_utc": 1747197572.0,
      "replies": []
    },
    {
      "id": "ms816r1",
      "author": "NeuroXc",
      "body": "Just be careful not to acquire games from any source other than the official Nintendo Store ™️ since games from other sources may be pirated, and Nintendo now has the right to permanently disable your console if they detect pirated software.",
      "score": 1,
      "created_utc": 1747200167.0,
      "replies": []
    },
    {
      "id": "ms85vzm",
      "author": "MarroCaius",
      "body": "I'm waiting for the Pokemon 30th anniversary model that \"should\" launch next year.",
      "score": 1,
      "created_utc": 1747202732.0,
      "replies": []
    },
    {
      "id": "ms9m59n",
      "author": "Qix213",
      "body": "I doubt anything realistic will get them off to the same start.  Maybe if all the big Nintendo first party games are available at launch.  But that's not too realistic.\n\nOG Switch was a new and novel idea at the time.  A big change.  By definition, this will only be an incremental change.  That alone will make people decide if they need the new one or not.  And a high price will just help people decide to wait for the specific first party game they want to come out.",
      "score": 1,
      "created_utc": 1747229269.0,
      "replies": []
    },
    {
      "id": "msbstd3",
      "author": "podracer1138",
      "body": "I have loved my time with Nintendo And it's characters but the time has come to part ways.  I'll continue playing my current physical library but I can't continue with the new system due to pricing and product choices they have made. Instead I built a new computer and am enjoying the Oblivion remaster.",
      "score": 1,
      "created_utc": 1747252265.0,
      "replies": []
    },
    {
      "id": "msbybgu",
      "author": "CoyoteSingle5136",
      "body": "I hope it fuckin bombs",
      "score": 1,
      "created_utc": 1747253872.0,
      "replies": []
    },
    {
      "id": "msdypp1",
      "author": "ThunderEcho100",
      "body": "I miss 3ds",
      "score": 1,
      "created_utc": 1747278356.0,
      "replies": []
    },
    {
      "id": "msme8h5",
      "author": "tenebras_lux",
      "body": "It used to be that consoles were sold at a loss for the first couple of years with revenue coming from first party games and licensing, and then consoles turning a profit as technology improved.",
      "score": 1,
      "created_utc": 1747401971.0,
      "replies": []
    },
    {
      "id": "msq4kgk",
      "author": "Hattix",
      "body": "The Switch did well because, like the Wii, it was almost cheap enough to be an impulse buy and could do stuff nothing else could.\n\nThe Wii U failed so hard because, like the Switch 2, it was not cheap enough to be an impulse buy, didn't differentiate itself much from its predecessor and was competing in a crowded market with games at least as good or better on all sides.",
      "score": 1,
      "created_utc": 1747445491.0,
      "replies": []
    },
    {
      "id": "msym3jh",
      "author": "starhoppers",
      "body": "Not even gonna try to buy it.",
      "score": 1,
      "created_utc": 1747579344.0,
      "replies": []
    },
    {
      "id": "ms4qzl4",
      "author": "Live_Dog_2779",
      "body": "$450 and they will not have Hall Effect joy sticks. Gonna pass on this one.",
      "score": 1,
      "created_utc": 1747159623.0,
      "replies": []
    },
    {
      "id": "ms49guw",
      "author": "Knickerbottom",
      "body": "Maybe, but I sure as hell ain't buying that pile",
      "score": 1,
      "created_utc": 1747154614.0,
      "replies": []
    },
    {
      "id": "ms4evk2",
      "author": "Ditzy_Pooper",
      "body": "why mario doing this?",
      "score": 1,
      "created_utc": 1747156158.0,
      "replies": []
    },
    {
      "id": "ms5632j",
      "author": "SellingFirewood",
      "body": "I was going to buy one until they announced they would brick your device if you ran emulators on it or install any other mods even if only run locally. I really hope it doesn't become the norm.",
      "score": 1,
      "created_utc": 1747163978.0,
      "replies": []
    },
    {
      "id": "ms6be9b",
      "author": "None",
      "body": "I was around seven years old, probably in 2006, when I first experienced the internet. I had just started learning to write in school. My older brother already understood how computers worked, but I had no clue. One day, the internet guy came to our house to set it up. I just watched him quietly as he did his work. When he finished, he opened a browser. It was a blank white page with a search bar. He said, “It works now, you can search for anything,” and then left.\n\nI had no idea what that meant, but I was excited. My mom was sitting next to me. She also did not really know how to use a computer, but she helped set it up for us. I decided to try it out. I was really into Spider-Man at the time, like most kids, so I typed “Spider-Man” into the search bar. Nothing happened. I did not know I needed to add “www” and “.com” at the end.\n\nLater, my mom spoke on the phone with some people from her village. They told her about a website for their community that started with “www” and ended with “.com” and had the community name in the middle. She typed it in, and it worked. I was shocked. So I tried “www.spiderman.com” and it actually opened. The site had pictures and info from the movie company. I could not believe it. I started typing other things like “spider” or “school” with different endings just to see what would happen.\n\nThen my brother came and typed “Google.” That changed everything. Suddenly, we could search anything. Wikipedia came up. We learned so much. We also installed MSN Messenger and started doing video calls. That day felt magical. It was like a new world had opened right in front of me. This tool could answer anything. It felt unreal.\n\nAnd honestly, I feel that same excitement now with AI. The first time I used ChatGPT, I was amazed. It gave me the same feeling I had when I first saw the internet. Of course, ChatGPT back then was much simpler compared to now. But that sense of wonder, the feeling that this would change everything, was exactly the same. It still feels unbelievable what technology can do and make you feel wonder.",
      "score": 1,
      "created_utc": 1747176614.0,
      "replies": [
        {
          "id": "ms81i2u",
          "author": "MadeByHideoForHideo",
          "body": "The fuck did I just read?",
          "score": 1,
          "created_utc": 1747200331.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms6nnqt",
      "author": "nestcto",
      "body": "Sooo Brack Friday Bunduru?",
      "score": 1,
      "created_utc": 1747180809.0,
      "replies": []
    },
    {
      "id": "ms80gcv",
      "author": "sneeknstab",
      "body": "Got a switch 1 it was ok but the games are too expensive and a subscription to play online is kind of  bs imo,  \nI will stick to PC and steam. ",
      "score": 1,
      "created_utc": 1747199785.0,
      "replies": []
    },
    {
      "id": "ms82qqi",
      "author": "astro_plane",
      "body": "lol piss off",
      "score": 1,
      "created_utc": 1747200996.0,
      "replies": []
    },
    {
      "id": "msfy3lb",
      "author": "LazyBoyXD",
      "body": "It's ok. nintendo fanboi would buy 10 regardless",
      "score": 1,
      "created_utc": 1747314334.0,
      "replies": []
    },
    {
      "id": "ms4ll69",
      "author": "ChainLC",
      "body": "this has gamecube fail written all over it. they finally make a switch that will run as the switch 1 was supposed to, (still not as well as a pc with an emulator) and they want to charge you 50% more and tell you they will brick it if they detect any bad software on it. or maybe a corrupted update file is seen as a trigger to brick it? who knows? it's a brick now. good luck with your $500 brick.",
      "score": -1,
      "created_utc": 1747158094.0,
      "replies": []
    },
    {
      "id": "ms3xv5s",
      "author": "momlookimtrending",
      "body": "Nintendo is high price low quality overall.\n\n\nMost games on their store that's not produced for the Nintendo runs bad, prices are way too high for the products they offer, hardly any good discount.\n\n\nIt was good when it was the point between no console and an actual console, but now that the price is 500€ where I live, it's just better to buy a Xbox / Ps5 and get games for cheap that actually run well.\n\n\nEven modding the stock Nintendo Switch isn't worth it because games aren't even worth pirating.",
      "score": -10,
      "created_utc": 1747151212.0,
      "replies": [
        {
          "id": "ms47kj7",
          "author": "TheMegaMario1",
          "body": "I think most people, including you, memory hole the fact the original Switch was most of the time more expensive than its contemporaries. It only became the budget option when the PS5 and XSX released.\n\nAt least in the US it launched at 300, and the MSRP of a PS4 was 300 but often you could get it on deals for 200",
          "score": 2,
          "created_utc": 1747154055.0,
          "replies": [
            {
              "id": "ms4aksh",
              "author": "Lexmusea",
              "body": "I looked it up when I remembered this earlier and Sony (reportedly, I'm not from the US so this is based on an article) lowered the base PS4 price to $250 officially in February 2017, the month before the switch launched. \n\nWhich really puts Microsoft raising Xbox prices the month before switch 2 into perspective.",
              "score": 2,
              "created_utc": 1747154934.0,
              "replies": [
                {
                  "id": "ms4bdow",
                  "author": "TheMegaMario1",
                  "body": "Yeah I saw that too when looking it up, but it was a limited time deal to match black Friday pricing. Wouldn't be surprised if this follows a similar pattern and PS6/neXtbox is closer/higher than the PS5 Pro's price and makes the Switch 2 the bargain comparatively similar to last gen.",
                  "score": 1,
                  "created_utc": 1747155162.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ms42b7c",
          "author": "gman5852",
          "body": "It depends on your personal taste. Personally I've been using my gaming PC and PS5 less and less and my switch more. First party offerings imo are far better than the libraries of either right now.\n\nThird parties the Switch handles indies well and with the current collapse of the AAA industry, that's about all that's needed.",
          "score": 2,
          "created_utc": 1747152509.0,
          "replies": []
        },
        {
          "id": "ms46i2t",
          "author": "kevin15535",
          "body": "I've modded my nintendo switch OLED to be able to run emulators for past DS games, letting me run DS games with a beautiful OLED screen. Paired with a flip grip for the DS and its just a modern DS.",
          "score": 0,
          "created_utc": 1747153743.0,
          "replies": []
        },
        {
          "id": "ms4ulyb",
          "author": "Yogurt_Ph1r3",
          "body": "Their hardware, maybe. Their software, subjective but laughably bad take tbh.",
          "score": 0,
          "created_utc": 1747160663.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms5ep94",
      "author": "wolfman3412",
      "body": "I’m not interested in that bundle at that price, and I’m not interested at all if you can brick the system i paid like $800 for. Fuck that, Nintendo",
      "score": 0,
      "created_utc": 1747166501.0,
      "replies": []
    },
    {
      "id": "ms4bsh6",
      "author": "Flo_Evans",
      "body": "Seems like a Wii U situation to me. No real discernible difference, no hype, not sure why I would buy this.",
      "score": -3,
      "created_utc": 1747155277.0,
      "replies": []
    },
    {
      "id": "ms4wax0",
      "author": "Chemistry11",
      "body": "I like my Switch; I play it maybe once a week. I’m not really a gamer; I mostly play retro games. Couldn’t tell you the last time I played anything “new” (new to me and “new” are 2 different things. My most recent release I’m playing is Stray)\n\nELI5 - why would I want a Switch 2?",
      "score": 0,
      "created_utc": 1747161146.0,
      "replies": [
        {
          "id": "ms583ot",
          "author": "gman5852",
          "body": "In your case it's probably not super worth it. The Switch 1 is meeting your criteria well enough. The only thing going for switch 2 as far as retro games are concerned is the GameCube library, and that alone won't be worth it, especially at launch.",
          "score": 1,
          "created_utc": 1747164570.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms4evsp",
      "author": "calpi",
      "body": "Good luck, I didn't buy the switch at release because it was over priced too.",
      "score": 0,
      "created_utc": 1747156160.0,
      "replies": []
    },
    {
      "id": "ms4axli",
      "author": "DavidinCT",
      "body": "Give it 6 months the price will drop, no way would I pay $450+ for something with the specs it has....",
      "score": -4,
      "created_utc": 1747155034.0,
      "replies": []
    },
    {
      "id": "ms5uyub",
      "author": "Key-Leader8955",
      "body": "Nope don’t with Nintendo on their TOS update and bringing switches",
      "score": 0,
      "created_utc": 1747171259.0,
      "replies": [
        {
          "id": "ms6tol6",
          "author": "Kalpy97",
          "body": "You mean like sony?",
          "score": 1,
          "created_utc": 1747182954.0,
          "replies": []
        }
      ]
    },
    {
      "id": "ms63w9c",
      "author": "HurleysBadLuck",
      "body": "I’ll wait for the emulator or jailbreak.",
      "score": 0,
      "created_utc": 1747174092.0,
      "replies": []
    },
    {
      "id": "ms5arap",
      "author": "Chemical_Fix1151",
      "body": "No reason to buy any Nintendo product post-2005. Until they start putting out products with hardware capabilities that can compete with Xbox and PlayStation and start having those same games that are available on competing consoles then there really isn’t any good reason to own a Nintendo product. There are better handheld options available",
      "score": -4,
      "created_utc": 1747165364.0,
      "replies": []
    }
  ]
}