{
  "post": {
    "title": "Apple Vision Pro 2 with more comfortable strap and upgraded chip is coming later this year",
    "author": "BlueLightStruct",
    "id": "1lvrpuj",
    "score": 0,
    "created_utc": 1752088918.0,
    "selftext": "",
    "num_comments": 23,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1lvrpuj/apple_vision_pro_2_with_more_comfortable_strap/"
  },
  "comments": [
    {
      "id": "n28bry5",
      "author": "AutoModerator",
      "body": "\nWe have a giveaway running, be sure to enter in the post linked below for your chance to win a Luckeep X1 ebike!\n\n[https://www.reddit.com/r/gadgets/comments/1ltu5rz/luckeep_x_rgadgets_giveaway_win_a_brandnew/?)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gadgets) if you have any questions or concerns.*",
      "score": 1,
      "created_utc": 1752088918.0,
      "replies": []
    },
    {
      "id": "n28czpa",
      "author": "Yalkim",
      "body": "Oh yes that is what was wrong with AVP. An uncomfortable strap and a chip that is not upgraded. I am sure these changes will do wonders for the sales.",
      "score": 46,
      "created_utc": 1752089256.0,
      "replies": []
    },
    {
      "id": "n28fg7k",
      "author": "LITTLE-GUNTER",
      "body": "is there even a use case for this thing? or is it still just for setting timers and putting browser windows in front of your toilet?",
      "score": 21,
      "created_utc": 1752089931.0,
      "replies": [
        {
          "id": "n28kalm",
          "author": "DarthBuzzard",
          "body": "I think the best usecase at the moment is 180/360 video and volumetric photos. Anyone who has experienced this in a Vision Pro knows that this is going to be a major part of how humans view video/photos in the future, but would I spend $3500 just for that? No chance. \n\nI *would* say that the best usecase is Apple's Persona avatars since it's worlds better than a videocall, but you need another person to have a Vision Pro so... unlikely.\n\nThis is really just a lot of setup for a future where Apple can provide a consistent stream of immersive experiences solo or communal in a more affordable sleeker form factor. Whoever cracks shared viewing of live volumetric sports is going to open themselves to a multi-billion dollar sub-market.",
          "score": 2,
          "created_utc": 1752091274.0,
          "replies": []
        },
        {
          "id": "n28g3q5",
          "author": "superduperburger81",
          "body": "I use mine very regularly—mostly for a portable large screen to work/game off of. It’s a great companion for the Apple eco system. That said, I don’t generally recommend to people unless they have disposable income and won’t miss the money. \n\nThe comfort is one of the most complained about issues for a lot of people. Mine is pretty comfortable (but maybe because I’m just used to it. I’m curious to see what benefits the spec bump adds. I love using it when I travel / fly to watch movies.",
          "score": 8,
          "created_utc": 1752090114.0,
          "replies": [
            {
              "id": "n28jahk",
              "author": "w1n5t0nM1k3y",
              "body": "Seems like something like the [Big screen beyond](https://store.bigscreenvr.com/en-ca/products/bigscreen-beyond-2) would be a much more affordable option that could perform most of the same functions.",
              "score": 2,
              "created_utc": 1752090997.0,
              "replies": [
                {
                  "id": "n28lgii",
                  "author": "tiptuppington",
                  "body": "By the time you have all the equipment needed to run the Bigscreen, it ends up being about the same price. And that’s outside of the fact that there’s a BOATLOAD of functionalities that you’re getting with the Vision Pro that you’re not getting with the Bigscreen. Handtracking, mixed reality, eye tracking, foveated rendering, standalone functionality, etc. there’s not really any proper comparison between these two.",
                  "score": 10,
                  "created_utc": 1752091599.0,
                  "replies": [
                    {
                      "id": "n28qt56",
                      "author": "w1n5t0nM1k3y",
                      "body": "A lot of people interested in VR already own the hardware that you connect to it anyway so most of them wouldn't consider that an extra cost.",
                      "score": -1,
                      "created_utc": 1752093064.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "n28lc05",
                  "author": "superduperburger81",
                  "body": "BSB isn't compatible with Mac. Also requires a base station and being tethered to a PC which means it's not portable as a standalone device. So, no, it does not do most of what I wanted.",
                  "score": 10,
                  "created_utc": 1752091563.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "n28i39u",
          "author": "GrogRhodes",
          "body": "Multiple screen jobs. Low key pretty useful for traders on the move.",
          "score": -2,
          "created_utc": 1752090663.0,
          "replies": [
            {
              "id": "n28irbn",
              "author": "cheesenachos12",
              "body": "For 3k you could get some damn good monitors that you dont have to strap on your face though",
              "score": 2,
              "created_utc": 1752090849.0,
              "replies": [
                {
                  "id": "n28j86c",
                  "author": "GrogRhodes",
                  "body": "My b. I meant to include traveling as its situational. Hit reply too soon.  Carrying around folding monitors etc the bane of my existence.",
                  "score": 2,
                  "created_utc": 1752090979.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "n28odxp",
      "author": "narwhal_breeder",
      "body": "If it can't run Mac apps what's the point?\n\nApple is infuriating because they put some of their most exciting professional hardware behind artificial software limitations, so the only people who can work with it professionally don't actually need the extra horsepower. \n\nThe AVP would make an incredible software development device, but apple doesnt allow it for whatever reason. Instead all of Apples marketing material shows their $3499 standalone megadevice being used for.. email? and typesetting?",
      "score": 3,
      "created_utc": 1752092407.0,
      "replies": []
    },
    {
      "id": "n28z3zu",
      "author": "Sylanthra",
      "body": "I am sure the 10 people who are still using their Vision Pro will be thrilled.",
      "score": 3,
      "created_utc": 1752095337.0,
      "replies": []
    },
    {
      "id": "n28f4o9",
      "author": "nickl104",
      "body": "Only $4500",
      "score": 5,
      "created_utc": 1752089843.0,
      "replies": []
    },
    {
      "id": "n28l07m",
      "author": "led76",
      "body": "The outer screen should be the first thing they remove in a new version, right? I get that they aren’t able to redesign it for this release. \n\nMy question really is: is it universally agreed that the screen is a flop and clearly not worth it?",
      "score": 2,
      "created_utc": 1752091473.0,
      "replies": [
        {
          "id": "n3dhzv6",
          "author": "account312",
          "body": "I hope so.",
          "score": 1,
          "created_utc": 1752631425.0,
          "replies": []
        }
      ]
    },
    {
      "id": "n2y7vne",
      "author": "Dio44",
      "body": "Both owners of version 1 are elated",
      "score": 2,
      "created_utc": 1752435213.0,
      "replies": []
    },
    {
      "id": "n28j9m2",
      "author": "poopymcfarts",
      "body": "How many times do we have to teach you this lesson, old man??",
      "score": 3,
      "created_utc": 1752090990.0,
      "replies": []
    },
    {
      "id": "n2a36lw",
      "author": "BergaDev",
      "body": "I hope the new strap will work on the old one. I find the solo strap quite good for long days but do wish it was a bit better",
      "score": 1,
      "created_utc": 1752108124.0,
      "replies": []
    },
    {
      "id": "n2c2sii",
      "author": "Divingcat9",
      "body": "I might consider it if it will be with $50... before sale",
      "score": 1,
      "created_utc": 1752140550.0,
      "replies": []
    },
    {
      "id": "n2c5vy5",
      "author": "HansBooby",
      "body": "that’s their revision?  seriously",
      "score": 1,
      "created_utc": 1752142221.0,
      "replies": []
    },
    {
      "id": "n28iliy",
      "author": "Mastoraz",
      "body": "Use it everyday love this device. But releasing  new version with just a chipset upgrade and new strap, seems like a complete waste of time and effort. I don’t know why a lighter, cheaper version isn’t their priority first",
      "score": 0,
      "created_utc": 1752090804.0,
      "replies": []
    }
  ]
}