{
  "post": {
    "title": "According to Google’s own data, overheating issues with Tensor have proved to be the biggest reason for Pixel returns.",
    "author": "a_Ninja_b0y",
    "id": "1gn4xjo",
    "score": 680,
    "created_utc": 1731137729.0,
    "selftext": "",
    "num_comments": 46,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gn4xjo/according_to_googles_own_data_overheating_issues/"
  },
  "comments": [
    {
      "id": "lw7z8ae",
      "author": "kvothe5688",
      "body": "moved from pixel 6a to pixel 8 and overheating has gone significantly down.",
      "score": 103,
      "created_utc": 1731140426.0,
      "replies": [
        {
          "id": "lw8bwa2",
          "author": "HakimeHomewreckru",
          "body": "Just starting a WiFi hotspot on my 8a with Android Car/Waze/Spotify running is enough to overheat the phone.. need a dedicated usb fan in the car on long trips. Quite silly tbh.",
          "score": 45,
          "created_utc": 1731148919.0,
          "replies": [
            {
              "id": "lwaivgm",
              "author": "runed_golem",
              "body": "I have a pixel 8 and rarely have overheating issues. About the only time it starts to get toasty is when it's charging and either I'm playing a fairly demanding game on it.",
              "score": 6,
              "created_utc": 1731179440.0,
              "replies": []
            },
            {
              "id": "lwun8co",
              "author": "zzazzzz",
              "body": "you got it on a wireless charger thats integrated in your car?\n\nmany car wireless chargers absolutely fry phones.",
              "score": 1,
              "created_utc": 1731463282.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lwb1rl8",
          "author": "DocFreudstein",
          "body": "I have a 6a for work, and I can’t do a Google Meet session in my car without it overheating.",
          "score": 3,
          "created_utc": 1731185587.0,
          "replies": []
        },
        {
          "id": "lwb2hf5",
          "author": "None",
          "body": "Pixel 8 since launch and I use my phone heavily. I have never once had it overheat. I didn't even know it was possible.",
          "score": 2,
          "created_utc": 1731185823.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwbp5rf",
      "author": "Cirkelzaag",
      "body": "Returned my Google pixel 8 pro. I turned on the hotspot while charging and it started charging very slowly because it got too warm. Was a very easy decision to return. My Motorola phone was cheaper and better. Except for the camera I suppose. Though I like this camera.",
      "score": 12,
      "created_utc": 1731193454.0,
      "replies": []
    },
    {
      "id": "lw7x0u9",
      "author": "None",
      "body": "[removed]",
      "score": 16,
      "created_utc": 1731138986.0,
      "replies": [
        {
          "id": "lw8cwco",
          "author": "Adriene737",
          "body": "When I replaced my Pixel 4 XL (snapdragon) with a Pixel 6 Pro (tensor), I noticed my Pixel 6 would overheat in situations where my P4 was fine.\n\nLearned how to deal with it, but it's noticeable.",
          "score": 18,
          "created_utc": 1731149566.0,
          "replies": [
            {
              "id": "lw99d7c",
              "author": "Gripeaway",
              "body": "My wife's (Pixel 8) also heats up quite a bit but I'm still on Pixel 4 and have no issues, it's great.",
              "score": 2,
              "created_utc": 1731164640.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw9kn90",
      "author": "_RADIANTSUN_",
      "body": "I speak as someone who cherished a Pixel 4a for several years as my preferred daily driver over many other newer, more expensive phones:\n\nI hate the Pixel brand, it's a big failure and largely a shit follow up to the Nexus line. Rick Osterloh has no idea how to handle the development of a hardware brand. \n\nThis is not at all to say Nexus phones didn't have these problems, actually often they were way worse. I'm just saying, if you're gonna start making up-market phones priced like iPhones then you best not miss... And certainly NOWHERE close to as regularly, often and hugely as the Pixel hardware does. \n\nImagine a world where Google has an actually good Pixel hardware ecosystem... Yea keep imagining, keep dreaming, that is a fantasy.",
      "score": 17,
      "created_utc": 1731168458.0,
      "replies": [
        {
          "id": "lwacuob",
          "author": "Bakophman",
          "body": "Nah, it's a good phone. Pixel 9 Pro hasn't given me any issues and I don't personally care for any of the ecosystems offered by Apple or Google.",
          "score": 4,
          "created_utc": 1731177500.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lw95r1w",
      "author": "correctingStupid",
      "body": "Worst phone I ever bought. Why people continue to buy Google's phones boggles my mind. Do they just naturally think Google is the android equivalent to apple in quality?",
      "score": 39,
      "created_utc": 1731163338.0,
      "replies": [
        {
          "id": "lw9852a",
          "author": "Bakophman",
          "body": "I enjoy it for what I use it for. It doesn't overheat, the camera is great, and I'm having fun using Gemini. \n\nThere's nothing wrong with having either type of phone.",
          "score": 59,
          "created_utc": 1731164206.0,
          "replies": [
            {
              "id": "lw99mb2",
              "author": "Arikaido777",
              "body": "phone wars, like console wars, are cringe. just buy what you like 🤷‍♂️",
              "score": 42,
              "created_utc": 1731164730.0,
              "replies": [
                {
                  "id": "lwde3ny",
                  "author": "100GbE",
                  "body": "25 years ago, I remember caring about having the better mobile phone to my friends.\n\n\nVery cringe.",
                  "score": 3,
                  "created_utc": 1731217471.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lwaah3g",
          "author": "sourlor",
          "body": "I personally prefer android and Google phone provides the most barebone android experience. Samsung has too much bloatwar",
          "score": 15,
          "created_utc": 1731176748.0,
          "replies": []
        },
        {
          "id": "lw9a0kb",
          "author": "UnacceptableOrgasm",
          "body": "I've owned a Pixel, Pixel 2XL, and now have a Pixel 7 and they've all been fantastic phones.",
          "score": 23,
          "created_utc": 1731164871.0,
          "replies": []
        },
        {
          "id": "lw9dbw1",
          "author": "Thwitch",
          "body": "My Pixel 7 Pro has been my favorite phone Ive ever used",
          "score": 12,
          "created_utc": 1731166019.0,
          "replies": []
        },
        {
          "id": "lwbfb66",
          "author": "OhGoodLawd",
          "body": "Because some people have a different experience?\nMy pixel 6 only ever overheats if I use it in the sauna and was great value for money over the Samsung equivalent.\nBased on current experience, I'll definitely get another pixel when I upgrade.",
          "score": 3,
          "created_utc": 1731190056.0,
          "replies": []
        },
        {
          "id": "lwcgwjj",
          "author": "retirement_savings",
          "body": "Excellent camera, no bloatwear that you get with other android devices, reasonable prices.",
          "score": 3,
          "created_utc": 1731203431.0,
          "replies": []
        },
        {
          "id": "lwbzki6",
          "author": "Lurker_81",
          "body": ">Why people continue to buy Google's phones boggles my mind\n\nBest in class cameras, great software, hardware is solid, prices are usually reasonable. \n\nI've owned most generations of Pixels, and the Nexus devices before then. I've never had an issue with any of them, I've recommended them to friends and family, and now I know tons of people who have them and are super happy with them.",
          "score": 5,
          "created_utc": 1731197159.0,
          "replies": []
        },
        {
          "id": "lw9jlpa",
          "author": "zzazzzz",
          "body": "nah the pixel doesnt turn itself off when it gets a little cold so they still got a leg up on the iphone there",
          "score": 8,
          "created_utc": 1731168115.0,
          "replies": []
        },
        {
          "id": "lwajabs",
          "author": "runed_golem",
          "body": "I bought my pixel 8 because my other phone went down the highway at 60 mph and was utterly destroyed. And I was asked to get a refurbished one for <$400 which is a lot better than the $1000+ to replace the Samsung I had.",
          "score": 2,
          "created_utc": 1731179571.0,
          "replies": []
        },
        {
          "id": "lwcmce1",
          "author": "Berkut22",
          "body": "I buy it because I hate all the other Android makers out there. Except maybe Sony, but they're hard to find here, and even harder to find accessories. \n\nIf LG still made phones, I'd still be buying them.",
          "score": 1,
          "created_utc": 1731205492.0,
          "replies": []
        },
        {
          "id": "lxebv1s",
          "author": "alidan",
          "body": "I want an android phone, not android + whatever cancer they put on the phones as well\n\ngoogle is the only one that gives me stock android.",
          "score": 1,
          "created_utc": 1731739662.0,
          "replies": []
        },
        {
          "id": "lwayusr",
          "author": "Iva_bigun666",
          "body": "My 12 pro max is dogshit as well, what quality are you talking about?",
          "score": 1,
          "created_utc": 1731184640.0,
          "replies": []
        },
        {
          "id": "lw9zcpc",
          "author": "NO_SPACE_B4_COMMA",
          "body": "I hated my pixel 6 pro and it was the first time I upgraded early to get out of it. Nothing but issues.",
          "score": 0,
          "created_utc": 1731173207.0,
          "replies": []
        },
        {
          "id": "lwav0ht",
          "author": "Siyuen_Tea",
          "body": "I bought it figuring the people who make the software would know it best. Apparently not",
          "score": 0,
          "created_utc": 1731183377.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwai157",
      "author": "CheeseGraterFace",
      "body": "This is staggeringly unsurprising.",
      "score": 2,
      "created_utc": 1731179168.0,
      "replies": []
    },
    {
      "id": "lwai9ww",
      "author": "drunk_intern",
      "body": "I used a pixel 6 for 3 years. It broke down and I’m now using my wife’s old iPhone 13. While I do miss android and the camera. I certainly don’t miss the overheating one bit. It’s amazing how much easier it is to use a phone when it doesn’t feel like it will burn off your skin.",
      "score": 1,
      "created_utc": 1731179247.0,
      "replies": []
    },
    {
      "id": "lwautj4",
      "author": "Siyuen_Tea",
      "body": "I've had the pixel 8 pro for a year. Bluetooth crashes, hotspot will just say \" error\" and not work. The worst part is this all started the day after the warranty expired. Just my luck. \n\n\nId hoped it was a glitch. Reseted, factory reseted and Wi-Fi reseted. Resetting used to fix Bluetooth but not anymore. \n\n\nI had these issues with the Pixel 7 too but that was reasonable because I'd actually dropped the phone",
      "score": 1,
      "created_utc": 1731183313.0,
      "replies": [
        {
          "id": "lwcmn86",
          "author": "Berkut22",
          "body": "Side note ; If you bought the phone with a credit card (or used one to make the payments on it) you might have an extra year of warranty.",
          "score": 6,
          "created_utc": 1731205608.0,
          "replies": [
            {
              "id": "lwczcjz",
              "author": "Siyuen_Tea",
              "body": "What a clutch comment. Thank you",
              "score": 2,
              "created_utc": 1731210649.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lw9lz8y",
      "author": "carteblanc71",
      "body": "Overheating is a common issue with iPhone and Galaxy devices also.",
      "score": -8,
      "created_utc": 1731168896.0,
      "replies": [
        {
          "id": "lwa8nyq",
          "author": "cubert73",
          "body": "It is? I've had Galaxy S5, S8, S10, and now S23 and never had any issues with overheating. Doing a quick search, it doesn't seem to be a widespread issue, either.",
          "score": 9,
          "created_utc": 1731176168.0,
          "replies": []
        },
        {
          "id": "lwct6t5",
          "author": "carteblanc71",
          "body": "I recently purchased iPhone 15 thru Spectrum, and used it in my car for the first time with Google Map and Youtube Music at the same time for about 10 minutes, and it got so hot I had to disconnect it from my car.  It is crucial that I should be able to use them for hours on long trips without getting it overheated, so I returned it and purchase a Galaxy S24.  At first, the Galaxy S24 was overheating almost as much when I used it with those two apps, but I managed to lower the temperature by changing its settings to minimize the chance of overheating from Youtube tutorial video.  There were so many videos there teaching tricks to tweak the settings of iPhone and Galaxy devices to address the overheating issue.  I had to pay $50 of restocking fee when I returned the iPhone 15, although it was due to a legitimate reason.",
          "score": 1,
          "created_utc": 1731208158.0,
          "replies": []
        },
        {
          "id": "lwcahz0",
          "author": "facest",
          "body": "The only time I’ve had an iPhone overheat is if I leave it in the car, or if I’m watching videos in the sun for a long time where it’ll dim and slow down, but still work. Is overheating really that common?",
          "score": 1,
          "created_utc": 1731201097.0,
          "replies": []
        },
        {
          "id": "lwxq1ex",
          "author": "ComprehensiveWord201",
          "body": "It is not.",
          "score": 0,
          "created_utc": 1731514728.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lwfdqsa",
      "author": "Witram",
      "body": "Store employees at an at&t flat out told me not to get one when I said I was interested in a pixel phone a few months ago",
      "score": 0,
      "created_utc": 1731254411.0,
      "replies": []
    },
    {
      "id": "lw7xrnd",
      "author": "None",
      "body": "[deleted]",
      "score": -33,
      "created_utc": 1731139463.0,
      "replies": [
        {
          "id": "lw8f3fc",
          "author": "FlappyBored",
          "body": "You made your comment on the wrong phone brand . You have to make that comment about Apple or iPhone if you want to get upvoted for that here.",
          "score": -17,
          "created_utc": 1731150983.0,
          "replies": [
            {
              "id": "lw8kzat",
              "author": "TheBigOrange27",
              "body": "Haha apparently! My 7 pro died over the summer and Google wouldn't give any help. So after buying pixels since the first one I was a little salty. But considering 6's over heat, 7's over heat and looks like 8 and 9 also overheat leaving the brand is a safe bet. Got a one plus 12 now and they actually built cooling into it!",
              "score": 0,
              "created_utc": 1731154425.0,
              "replies": [
                {
                  "id": "lw95gyf",
                  "author": "HallucinatoryFrog",
                  "body": "Still rocking a Pixel 2XL.  Seems like one of the better models.",
                  "score": 2,
                  "created_utc": 1731163235.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}