{
  "post": {
    "title": "Sony Has the Problem Every Competitor Wants: Its Flagship Was Too Good to Follow",
    "author": "diacewrb",
    "id": "1gynyrv",
    "score": 938,
    "created_utc": 1732443828.0,
    "selftext": "",
    "num_comments": 133,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1gynyrv/sony_has_the_problem_every_competitor_wants_its/"
  },
  "comments": [
    {
      "id": "lyq8yvm",
      "author": "pmjm",
      "body": "Gerald Undone said the same thing a few days ago and everyone else seems to be jumping on that \"hot take\" now. \n\nIt's not that surprising, tbh. Apple sent shockwaves through the computing space with the M1. But M2 got a \"meh\" response. People are wowed by new baselines, not iterations.",
      "score": 529,
      "created_utc": 1732449904.0,
      "replies": [
        {
          "id": "lyt9jan",
          "author": "PocketNicks",
          "body": "People seem pretty jazzed about the M4.",
          "score": 151,
          "created_utc": 1732486936.0,
          "replies": [
            {
              "id": "lyteu6x",
              "author": "neobow2",
              "body": "Definitely, but the M1 came out 4 years ago. So it still took 4 years to get something that the average person MIGHT be jazzed about. Obviously the tech community is very impressed with the M4, but the average buyer I’m sure doesn’t really care",
              "score": 98,
              "created_utc": 1732488713.0,
              "replies": [
                {
                  "id": "lyv0ci0",
                  "author": "Expert-Ad4417",
                  "body": "I’m an average consumer and tech enthusiast. While impressed, I don’t really care. My m1 will run another 6 years. So the average buyer really doesn’t care.",
                  "score": 47,
                  "created_utc": 1732510697.0,
                  "replies": [
                    {
                      "id": "lyvjrb9",
                      "author": "TryingToBeReallyCool",
                      "body": "I don't think most average consumers understand how long a laptop can run with basic maintenance \n\nClean the fans every 6 months, re-paste every 1-2 years and a modern laptop will last you a decade plus easy and hardly drop off in performance",
                      "score": 21,
                      "created_utc": 1732521586.0,
                      "replies": [
                        {
                          "id": "lyvk12f",
                          "author": "watchme3",
                          "body": "lmao, im still using my 2018mbp and expect it to run me another 6 years and don t do any of that stuff",
                          "score": 22,
                          "created_utc": 1732521757.0,
                          "replies": [
                            {
                              "id": "lyvknac",
                              "author": "TryingToBeReallyCool",
                              "body": "At least clean the fans out, I've worked in electronics recycling and seen so many perfectly fine laptops tossed because the fans were filled with shit and it ended up killing the system a few years in. Many even worked after some basic work on them",
                              "score": 5,
                              "created_utc": 1732522151.0,
                              "replies": [
                                {
                                  "id": "lyxkien",
                                  "author": "AgentTin",
                                  "body": "Macbook air. No fans 🤘",
                                  "score": 6,
                                  "created_utc": 1732554404.0,
                                  "replies": [
                                    {
                                      "id": "lyxo1zn",
                                      "author": "SacredRose",
                                      "body": "Clogged up cooling fins on the heatblock don’t enhance the performance either. It might not be as bad as in an actively cooled system but it technically still has an effect on it.",
                                      "score": 5,
                                      "created_utc": 1732555494.0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lyvn4st",
                          "author": "RUB_MY_RHUBARB",
                          "body": "Repasting that often seems a little excessive. Wouldn't it be done as needed if running hot?",
                          "score": 14,
                          "created_utc": 1732523796.0,
                          "replies": [
                            {
                              "id": "lz0h0v5",
                              "author": "cowabungass",
                              "body": "Paste hardens and becomes a point of stress.  I've seen dead cpus because of paste hardening but still handling temps.",
                              "score": 1,
                              "created_utc": 1732588463.0,
                              "replies": []
                            },
                            {
                              "id": "lyw82lo",
                              "author": "Pluckytoon",
                              "body": "Doesn’t seem excessive to do it every year or so, that’s more preventing future issues. But fan cleaning is mandatory",
                              "score": 1,
                              "created_utc": 1732536841.0,
                              "replies": [
                                {
                                  "id": "lyy3cd0",
                                  "author": "Squirrel1693",
                                  "body": "Is this only for the cpu or gpu too?",
                                  "score": 1,
                                  "created_utc": 1732560178.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "lz13c52",
                          "author": "euxene",
                          "body": "running my awsome antique 2016 Asus laptop using it to stream my gaming rig with moonlight. mindblowing with the no latency",
                          "score": 1,
                          "created_utc": 1732597498.0,
                          "replies": [
                            {
                              "id": "lz142ov",
                              "author": "TryingToBeReallyCool",
                              "body": "I passed on my old 2016 razer blade to my brother recently with a reposted and fan cleaning and expect it to serve him well the next few years till he gets funds for something better. People underestimate the power, value, and longevity of older laptops",
                              "score": 1,
                              "created_utc": 1732597853.0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "lz77r27",
                          "author": "sirhecsivart",
                          "body": "I used a ThinkPad X230T from 2012 to 2021. I only upgraded for thunderbolt 3 and 32GB of RAM.",
                          "score": 1,
                          "created_utc": 1732685384.0,
                          "replies": []
                        },
                        {
                          "id": "lyvvwx3",
                          "author": "Taizan",
                          "body": "Yep. Still running a trusty T420 Thinkpad on the go. Unlike with Apple devices though I was able to upgrade CPU, RAM and SSD.",
                          "score": 0,
                          "created_utc": 1732529715.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lyv7xkz",
                  "author": "CosmicCreeperz",
                  "body": "Yeah I’m in the tech community and I’m not really impressed.  If it was really a big deal Apple would stop comparing new SoC performance to 2 generations ago.  It’s such dishonest but predictable marketing from them.",
                  "score": -1,
                  "created_utc": 1732514580.0,
                  "replies": [
                    {
                      "id": "lyvlxmw",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 11,
                      "created_utc": 1732522995.0,
                      "replies": [
                        {
                          "id": "lyvwf3s",
                          "author": "CosmicCreeperz",
                          "body": "The mini is a great little PC but useless for modern games at the $599 base price.  After the OS and other apps that take up space, you barely even fit BG3 on it and it’s full.  And 16GB unified memory is also not very useful for modern 3D games.\n\nBump it up to min decent gaming PC specs (32GB RAM and 1TB SSD) and you are at $1400, or 1600 for M4 Pro.  Which is absurd because 32GB RAM is $50 and 1TB SSD is < $80.  And you only getting half that incrementally anyway.\n\nI can certainly buy a similar gaming PC for less than that.  Not Ike that small… but who cares?\n\nAgain, amazingly small and the CPU is brilliant for the price, but not an equivalent system overall.\n\nAn M4 Max MBP, though?  Expensive as shit but the best laptop ever made, IMO.  Just not incrementally mindblowing from the last one…",
                          "score": 2,
                          "created_utc": 1732530045.0,
                          "replies": [
                            {
                              "id": "lyw5q64",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 3,
                              "created_utc": 1732535625.0,
                              "replies": [
                                {
                                  "id": "lyxodq1",
                                  "author": "CosmicCreeperz",
                                  "body": "More than a Mac mini? Obsolete in a year?  That part is silly.  If that were true then the mini is already obsolete…\n\nAn equivalent Nvidia card is $150.  And that’s not really equivalent since it also has 6Gb-ish of dedicated RAM and is about 10-15% faster on gaming benchmarks.  And that card is 5 years old.  So clearly not obsolete.\n\nThe “memory chips” are not higher end than standalone RAM.  They are embedded in the SoC, so are as a whole much cheaper for Apple to manufacture, etc than standalone sticks with their own PCB (and that’s how they get the performance - a good architecture and embedding in the chip package - not just the chips themselves).\n\nAnd I quoted a fast PCI-E SSD. But the mini M4s SSD isn’t even that fast.  Benchmarks have put the 256GB at like R 2000MB/s W 2900MB/s which is way below the Samsung 990’s 6000  / 7000. Apple’s RAM and SSD upgrades are almost entirely profit margin, everyone knows that, it’s the biggest complaint about Apple products, period.\n\nGo look this all up, your info is made up and incorrect without reference to the facts.  Or just think about it… if 256GB SSD + 16GB RAM WITH all of the rest of a computer is $600, how can adding ONLY 768GB SSD and 16GB RAM cost $800?   The true added BOM cost of those is maybe $100.\n\nAs I have said before - I think Apple’s SoC’s are great.  The MBP M series are the best laptops period when price is no object, and the mini is a great low end PC for its very specific use cases.  But comparing them to equivalent gaming PCs is absurd.  I have half a dozen Apple devices at home (as well as several x86 PCs or laptops).  But I am not a fanboy, I am a computer engineer who has been building hardware and software for 30 years.  I know how much these parts cost and how their performance compares beyond synthetic benchmarks and marketing.\n\nOh… and it’s easy to find a better gaming PC for $600.  SteamDeck OLED.  You also get 1TB RAM (ie actually useful) and a great display, with a battery.  Not going to match a mini on most productivity tasks but on gaming it’s about the same 3D performance and otherwise better for invisible reasons.",
                                  "score": 0,
                                  "created_utc": 1732555592.0,
                                  "replies": [
                                    {
                                      "id": "lyyv8ks",
                                      "author": "None",
                                      "body": "[deleted]",
                                      "score": 2,
                                      "created_utc": 1732568799.0,
                                      "replies": [
                                        {
                                          "id": "lyz5cgv",
                                          "author": "CosmicCreeperz",
                                          "body": "And i know your type, a non engineer Apple fanboy who never provides any facts or data with your opinions…\n\nI have said over and over AS A GAMING PC.  And I just gave you a trivial example AS A GAMING PC.  Only one part needed.\n\nThe base M4 mini is equivalent to a low end gaming PC FOR GAMING, so it’s trivial to match it.\n\n256GB Is not even useful as a gaming PC so there is no need for that comparison anyway.  It starts with 512GB or 1TB if you want to have more than a couple games on it.\n\nSo, 1TB M4 mini is $1000 - and I can find tons of much higher spec gaming PCs (with faster SSD) that way outperforms the mini on 3D games and/or higher resolutions.\n\nHere’s a an example reddit post… \n\nhttps://www.reddit.com/r/buildmeapc/comments/1be0gzo/best_pc_build_under_1000/?rdt=49945\n\nAnd a brief search for “best $1000 gaming PC” shows dozens of video and articles on Google of people building $1000 gaming PCs with 32GB RAM, 2TB SSD, and 12-16GB Nvidia or GPUs with almost 2x the 3D performance of the base M4.\n\nI even found a $600 PC on Best Buy that still had better GAMING specs ie 1TB SSD and a decent 6GB GPU.\n\nNot interested in a discussion of productivity tasks as I have repeatedly said the M4 is a great chip for that at the price.",
                                          "score": -1,
                                          "created_utc": 1732571894.0,
                                          "replies": [
                                            {
                                              "id": "lz1a0kh",
                                              "author": "None",
                                              "body": "[deleted]",
                                              "score": 1,
                                              "created_utc": 1732600849.0,
                                              "replies": [
                                                {
                                                  "id": "lz66gwq",
                                                  "author": "VirginRumAndCoke",
                                                  "body": "Gamerbrain has rotted the tech world.\n\nThere's a reason most tech veterans are stoked with the M4 Mac Mini. It's an uncharacteristic deal from Apple. If they just made drivers for an eGPU the thing would be unflappable for a long long time.\n\nDude cannot fathom use cases outside of gaming and benchmarks",
                                                  "score": 2,
                                                  "created_utc": 1732670174.0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lyv975n",
                      "author": "AuroraFinem",
                      "body": "Most people don’t upgrade every generation. The intention is do compare it to a typical person who might be looking to upgrade. I still use my 2019 MacBook Pro for anything I doing do on my desktop, it matters more to me performance compared to other options I might be considering or to my own machine, knowing it’s 20% faster than last years doesn’t matter because I’m not picking between it and last years and I’m not going to upgrade if I just did last year.",
                      "score": 8,
                      "created_utc": 1732515282.0,
                      "replies": [
                        {
                          "id": "lyv9xc9",
                          "author": "CosmicCreeperz",
                          "body": "The vast majority also don’t upgrade very expensive Macs every 2 years, so that’s not a very good point.  The M1 itself was only released in late 2020.",
                          "score": 1,
                          "created_utc": 1732515689.0,
                          "replies": [
                            {
                              "id": "lyvgndo",
                              "author": "Sassenasquatch",
                              "body": "Macs tend to be upgraded after way longer than other computers, too. I upgraded to an M1 from a 2013 MacBook which my daughter still uses. They’re notoriously long-lasting.",
                              "score": 4,
                              "created_utc": 1732519639.0,
                              "replies": [
                                {
                                  "id": "lyvur5f",
                                  "author": "CosmicCreeperz",
                                  "body": "Yep.  I had a 2013 Mac and upgraded to an M1.  The 2013 MBP was fine until they stopped supporting OS upgrades. And I developed on it.\n\nSo again… really not that impressed at the practical differences between M3 and M4.  Is it significantly faster than M1?  Yeah, no shit…",
                                  "score": 0,
                                  "created_utc": 1732528967.0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyugpgu",
              "author": "r31ya",
              "body": "Apple still benchmark M4 against M1 in some official benchmark panel.\n\nIt still a great chip mind you, but the improvement have slowed down and follow the standard performance development curve.",
              "score": 12,
              "created_utc": 1732502493.0,
              "replies": [
                {
                  "id": "lyv69tw",
                  "author": "QuickQuirk",
                  "body": "The m4 seems to be doing a bit better than previous gens when it comes to the GPU performance jump in gaming - that's what's got the reviewers exciting. It's more like an nvidia generational boost than a one year incremental.",
                  "score": 7,
                  "created_utc": 1732513691.0,
                  "replies": []
                },
                {
                  "id": "lyuhvm1",
                  "author": "PocketNicks",
                  "body": "The M1 is still a great chip with more than enough power for a typical user doing web browsing and word processing and other light to medium duty tasks. I remember MKBHD saying even he didn't feel the need to update to the M2 when it came out and he's a very rich tech YouTuber who uses the latest and greatest of everything.",
                  "score": 8,
                  "created_utc": 1732502946.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyvgojy",
              "author": "darti_me",
              "body": "People are elated at the M4 generation of products mainly because the new base RAM is now 16GB and the Mac value argument keeps getting stronger.",
              "score": 3,
              "created_utc": 1732519659.0,
              "replies": [
                {
                  "id": "lyvhrk7",
                  "author": "PocketNicks",
                  "body": "Also Apple claim they're focusing more on gaming now, but we've heard that before. So, grain of salt.",
                  "score": 1,
                  "created_utc": 1732520337.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lytdtpa",
              "author": "ArgumentImmediate715",
              "body": "I will be getting one next year, very jazzed",
              "score": 3,
              "created_utc": 1732488368.0,
              "replies": [
                {
                  "id": "lyu6j3b",
                  "author": "fievrejaune",
                  "body": "M1 was jazzy since getting rid of Intel just killed the heat. What a move. Brilliant.",
                  "score": 3,
                  "created_utc": 1732498641.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lywi05v",
              "author": "start_select",
              "body": "People get pretty jazzed watching me use any of my MacBook Pros from 2015-2020.\n\nIt’s all relative.  A super nice computer is a super nice computer.  Things don’t actually move that fast.",
              "score": 1,
              "created_utc": 1732541305.0,
              "replies": []
            },
            {
              "id": "lyz9uez",
              "author": "hosky2111",
              "body": "It's all relative. The hype over M4 comes in part from the appeal of the new Mac mini, the new 16gb ram base config, but also the fact that a lot of people bought the M1 macs. The gen-on-gen improvements since M3 aren't a revolution, but the cumulative upgrades since M1 are now enough to be very noticeable in regular workloads. It's the first M-series chip marketed towards M-series owners instead of just intel Mac owners, which changes the framing of the coverage.\n\nThe same will probably be true of the a1iii, even if the upgrades are similar to those between i and ii, people will suddenly be comparing a camera from 2021 to one from 2027, and so even if there aren't major improvements, having 6 year newer hardware and software will feel like a bigger leap.\n\nI also think they probably released the a9iii and a1ii in the wrong order - instead of the a9iii being positioned as \"a a1ii with global shutter\", the a1ii became \"the a9iii *without* global shutter\". Realistically they were never going to have the global shutter and high frame rate of the a9iii ***AND*** the resolution of the a1i given how recently the a9iii released, but people's expectations suddenly got lifted to an unreachable height. Meanwhile, the many ergonomic and software improvements added for the a9iii were basically taken for granted on the a1ii.",
              "score": 1,
              "created_utc": 1732573331.0,
              "replies": []
            },
            {
              "id": "lyvi20t",
              "author": "petersrin",
              "body": "My job upgraded one of our servers from an m1 to an me. We could run 1 instance with the m1 before hitting a bottleneck (obfuscating the actual tasks) and upon upgrade we were able to run 4 instances (we haven't needed more but it is probably capable). In a smaller box. I'm pretty jazzed except for the total lack of USB A. I get it, but I don't like it lol\n\nThat said, I held on to ps/2 ports for way too long as well...",
              "score": 1,
              "created_utc": 1732520522.0,
              "replies": []
            },
            {
              "id": "lywjk56",
              "author": "StarbeamII",
              "body": "M4 when it launched in an iPad it was something like 20% faster per-core (i.e. single thread) than the Intel/AMD desktop flagships (14900K/7950X), so it got a lot of well-deserved hype.",
              "score": 0,
              "created_utc": 1732541928.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyuaj27",
          "author": "helpnxt",
          "body": "I mean the M1 demonstrated that Apple can still push their boundaries a bit and people were excited with what might be unlocked, turns out nothing and then with the M2 it's just back to the yearly gradual speed increase that they will claim but give no actual proof on until people buy the product and run benchmarks.",
          "score": 5,
          "created_utc": 1732500126.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyup310",
      "author": "monsantobreath",
      "body": "Maybe perpetual excitement is an artificial concept born of modern marketing. If the tool does the job what's to get excited about? Why should you be excited for an iterative change?\n\nAn actual pro doesn't upgrade camera bodies like conspicuous consumer minded people get a new phone every year or two. The big change is worth excitement.\n\nReads like industry press speaking to the internal ideology of the producers and not the users.",
      "score": 29,
      "created_utc": 1732505775.0,
      "replies": []
    },
    {
      "id": "lyqrtu9",
      "author": "ringthree",
      "body": "I thought this was gonna be about the PS5.",
      "score": 149,
      "created_utc": 1732458459.0,
      "replies": [
        {
          "id": "lysdp7k",
          "author": "Virreinatos",
          "body": "It does kinda fits.\n\n\nPS4 was so solid people didn't migrate to PS5 as expected. They didn't see the point.\n\n\n\nEven today games still keep coming out for both 4 and 5 because the 4 player base is still so large. Which means a lot of AAA games aren't taking advantage of what the 5 can do because it doesn't make financial sense.",
          "score": 124,
          "created_utc": 1732477072.0,
          "replies": [
            {
              "id": "lytcf9z",
              "author": "vom-IT-coffin",
              "body": "A lot of it had to do with when the PS5 marketing blitz happened when it was released, covid and chip shortages led to people not being able to get one. Low growth led developers to focusing on both ps4 and ps5 for sales. Then when the hype dried up and ps5 became readily available people didn't have to switch because all the games were available on the old system. \n\nHad ps5 been able to supply the demand during the marketing campaigns when it came out, we likely wouldn't be at this point.",
              "score": 43,
              "created_utc": 1732487897.0,
              "replies": [
                {
                  "id": "lyv3zi0",
                  "author": "Eyebleedorange",
                  "body": "Hello, Han-Tyumi",
                  "score": 1,
                  "created_utc": 1732512501.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lysfckq",
              "author": "cbriggs4",
              "body": "Good point, but also didn’t help that they weren’t able to deliver enough units at their peak marketing hype.\n\nMakes me wonder how much that has affected the lackluster lineup of next-gen games. Must be hard to for a developer to fully commit to current gen tech when so many gamers are still active on previous gen consoles. Just my uneducated guess tho",
              "score": 40,
              "created_utc": 1732477582.0,
              "replies": []
            },
            {
              "id": "lyugwg5",
              "author": "r31ya",
              "body": "and right now, PS5 is solid enough many consider PS5pro to be unnecessary\n\nbut Sony is aware of this and position PS5Pro as \"premium option\" rather than replacement/upgrade.",
              "score": 9,
              "created_utc": 1732502567.0,
              "replies": []
            },
            {
              "id": "lyu6vk3",
              "author": "lmea14",
              "body": "It would help if there were actually some good exclusive games that made the purchase of a PS5 essential. It boggles the mind how this generation just seems to have been abandoned.",
              "score": 3,
              "created_utc": 1732498770.0,
              "replies": []
            },
            {
              "id": "lysfbnu",
              "author": "cbriggs4",
              "body": "Good point, but also didn’t help that they weren’t able to deliver enough units at their peak marketing hype.\n\nMakes me wonder how much that has affected the lackluster lineup of next-gen games. Must be hard to for a developer to fully commit to current gen tech when so many gamers are still active on previous gen consoles. Just my uneducated guess tho",
              "score": -1,
              "created_utc": 1732477574.0,
              "replies": [
                {
                  "id": "lysk3qc",
                  "author": "808scripture",
                  "body": "Huh, funny. Some other guy said the same thing…",
                  "score": 12,
                  "created_utc": 1732479029.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyvfgvy",
              "author": "cannypack",
              "body": "A game coming out on PS4 and PS5 does not automatically mean the PS5 version is not going to take full advantage of the hardware.  There are dozens and dozens of counter-examples, only a minority are in any way compromised, and I wish people would stop repeating this as though it's absolute fact.",
              "score": 1,
              "created_utc": 1732518912.0,
              "replies": [
                {
                  "id": "lz1dncj",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1732602848.0,
                  "replies": [
                    {
                      "id": "lz7j53r",
                      "author": "alibloomdido",
                      "body": "But still the difference between 60 and 120 fps is very noticeable.",
                      "score": 1,
                      "created_utc": 1732691667.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyspbiu",
              "author": "Gatlindragon",
              "body": "\n>Even today games still keep coming out for both 4 and 5 \n\nYeah, like Helldivers 2, Stellar Blade, FFVII Rebirth, Rise of the Ronin, Black Myth Wukong, Astrobot or Silent Hill 2, right?",
              "score": -7,
              "created_utc": 1732480631.0,
              "replies": [
                {
                  "id": "lysvu6h",
                  "author": "Suckage",
                  "body": "Conversely, there were some absolute bangers for the PS2 that released within a year of the PS4..",
                  "score": 1,
                  "created_utc": 1732482604.0,
                  "replies": [
                    {
                      "id": "lyt74yw",
                      "author": "Thirty2wo",
                      "body": "Examples?",
                      "score": 4,
                      "created_utc": 1732486139.0,
                      "replies": []
                    },
                    {
                      "id": "lyswfjm",
                      "author": "Gatlindragon",
                      "body": "You mean PS3?",
                      "score": 3,
                      "created_utc": 1732482787.0,
                      "replies": [
                        {
                          "id": "lyswss1",
                          "author": "Suckage",
                          "body": "Nope",
                          "score": 1,
                          "created_utc": 1732482899.0,
                          "replies": [
                            {
                              "id": "lysxiwd",
                              "author": "Gatlindragon",
                              "body": "So you mean bangers like FIFA 14 or PES2014?",
                              "score": 3,
                              "created_utc": 1732483107.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "lyswpgy",
                  "author": "Virreinatos",
                  "body": "I. . . never said ALL tripple A games come out for both. . . ",
                  "score": -1,
                  "created_utc": 1732482872.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lyq4wy0",
      "author": "None",
      "body": "[removed]",
      "score": 159,
      "created_utc": 1732447533.0,
      "replies": [
        {
          "id": "lyqbmzb",
          "author": "waltsnider1",
          "body": "I've used every flagship camera body and the best (for me/my shooting style) is the Panasonic Lumix line. I rarely see them mentioned and wanted to give them some love.",
          "score": 76,
          "created_utc": 1732451368.0,
          "replies": [
            {
              "id": "lyqh38h",
              "author": "geo_gan",
              "body": "You mean the micro four thirds or newer larger sensor ones? I’m still using GH4 myself",
              "score": 18,
              "created_utc": 1732454026.0,
              "replies": [
                {
                  "id": "lyv99sx",
                  "author": "_RADIANTSUN_",
                  "body": "I use a GH4 too! Based camera.",
                  "score": 3,
                  "created_utc": 1732515323.0,
                  "replies": []
                },
                {
                  "id": "lyqpo8j",
                  "author": "waltsnider1",
                  "body": "The 4:3. I haven't touched the larger sensor version yet. Maybe if I buy a new body in a couple lenses next year or something I will give it a shot.",
                  "score": 8,
                  "created_utc": 1732457622.0,
                  "replies": [
                    {
                      "id": "lyt50hw",
                      "author": "None",
                      "body": "[deleted]",
                      "score": 2,
                      "created_utc": 1732485446.0,
                      "replies": [
                        {
                          "id": "lytci4r",
                          "author": "speculatrix",
                          "body": "I keep hearing great things on r/Lumix\n\nIn tech you often find a plucky underdog who offers great value and the old school establishment look down on them, until one day they realise they've been complacent and losing their customers.",
                          "score": 4,
                          "created_utc": 1732487923.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "lyql9br",
              "author": "imashination",
              "body": "Same. Ive done sony and canon full frame over the years but the kit i keep for myself for fun is a Panasonic gx9 micro 4/3. 600mm of image stabilised reach in a lens the size of a can of coke? Yes please.",
              "score": 11,
              "created_utc": 1732455824.0,
              "replies": []
            },
            {
              "id": "lyuqobi",
              "author": "Egineeering",
              "body": "I love my Lumix m4/3 G100 with good lenses. It's the perfect size to bring anywhere.",
              "score": 3,
              "created_utc": 1732506421.0,
              "replies": []
            },
            {
              "id": "lyqqdtb",
              "author": "7107JJRRoo",
              "body": "Love my gh3 and my employer has a gh5 I use strictly for video.... Great stuff!\n\nFor stills though and sports photography I prefer my D500 over anything else I've tried.",
              "score": 4,
              "created_utc": 1732457903.0,
              "replies": []
            },
            {
              "id": "lywl89h",
              "author": "aircooledJenkins",
              "body": "Not at all the same class of camera but I've been using a Panasonic lumix dmc-tz1 for close to 20 years as my vacation point and shoot. This thing is bomb proof. I just hate the garbage battery life.",
              "score": 2,
              "created_utc": 1732542580.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyq6ibr",
          "author": "None",
          "body": "yep. i’m a sony boy through and through. had everything from an A55 now to an A1. \n\nCanon and Nikon are fucking amazing and have some way better features than my A1 and at least provide decent updates to their cameras throughout the years. \n\nSony falls behind HARD in that aspect.",
          "score": 8,
          "created_utc": 1732448496.0,
          "replies": []
        },
        {
          "id": "lyqchya",
          "author": "Plank_With_A_Nail_In",
          "body": "Sony still has the problem of bettering an already great device its irrelevant that the competition already has great devices too...though they could easily solve it by lowering its price then a great product becomes even better.\n\nSony are also basically unrivaled when it comes to sensors now no one is really close to the product stack they offer. One of my hobbies is Astro photography and there is realistically no other choice in sensors. The link below is to one of the top Astro camera manufacturers and all but one of their camera's uses Sony sensors.\n\nhttps://www.zwoastro.com/product-category/cameras/\n\nCanon, Nikon really aren't in the same class at all, Nikon don't even use their own sensors in their top cameras they are Sony sensors lol.",
          "score": 13,
          "created_utc": 1732451820.0,
          "replies": [
            {
              "id": "lyqov0g",
              "author": "roadmapdevout",
              "body": "The sensors are really not where the money is. The thing that makes a camera system is the lenses. That’s where most of the cost is for consumers. Nikon not making their own sensors isn’t a big deal.",
              "score": 17,
              "created_utc": 1732457298.0,
              "replies": [
                {
                  "id": "lyqp98x",
                  "author": "None",
                  "body": "So Sony with the biggest third party lens because they have there lens mount open is the best choice?",
                  "score": 1,
                  "created_utc": 1732457455.0,
                  "replies": [
                    {
                      "id": "lyqx7gv",
                      "author": "roadmapdevout",
                      "body": "Third party lenses can be plenty good, some of the best (or at least most expensive) come from companies that don’t make cameras, like the Sigma Art series or Zeiss. But Nikon and Canon are both extremely good lens manufacturers. if you want their glass you need to buy into their systems. And you’re usually getting the best value and high performance from one of the big three.\n\nThe L mount is more open than Sony’s. No full frame system is truly open source and you’ll almost always solely rely on first party lenses with any camera if you need autofocus, electronically controlled aperture or stabilisation.\n\nSony only collaborates more with third parties because they lag a little in their optics manufacturing and R&D.",
                      "score": 4,
                      "created_utc": 1732460427.0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "lyqska6",
                  "author": "Hugh_Jass_Clouds",
                  "body": "I wonder who makes the Nikon sensor...",
                  "score": -5,
                  "created_utc": 1732458733.0,
                  "replies": [
                    {
                      "id": "lyqub22",
                      "author": "macdara233",
                      "body": "The Z8 and Z9 sensors were designed by Nikon though.  They just offload the manufacture to others.",
                      "score": 6,
                      "created_utc": 1732459383.0,
                      "replies": [
                        {
                          "id": "lyqvwnz",
                          "author": "Hugh_Jass_Clouds",
                          "body": "Common practice. I've been out of the camera market weeds for a while now, but Sony used to make them at one point.",
                          "score": 1,
                          "created_utc": 1732459965.0,
                          "replies": [
                            {
                              "id": "lyqwrbc",
                              "author": "macdara233",
                              "body": "Yeah, Sony Semiconductor Solutions (which is independent of Sony’s camera division) makes sensors for a bunch of different camera companies who don’t have the facilities to make their own.  But usually it’s making sensors that have been designed or modified by the camera maker itself.",
                              "score": 7,
                              "created_utc": 1732460268.0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "lyqz1vp",
                      "author": "roadmapdevout",
                      "body": "Sensor manufacturer is not relevant to whether it’s a good camera. Sony makes them, but that doesn’t make Sony cameras better somehow.\n\nMost photographers are not thinking about their camera’s sensor very often. Once you reach acceptable image quality, the gains of one sensor over another might be interesting but they’re not strictly relevant to the work people are doing.\n\nMost photographers would still be very happy with a 5D mk iii and brand new cameras struggle to offer notable image quality gains over a D850.\n\nThe biggest change over the last few years is increased expectations for video, which is more of an issue for processing speed, storage and battery life, the sensors of 20 years ago could still produce excellent video in the right camera body.",
                      "score": 9,
                      "created_utc": 1732461078.0,
                      "replies": [
                        {
                          "id": "lysur3q",
                          "author": "mehum",
                          "body": "Yeah the sensor is effectively the film of yesteryear, which wasn’t even part of the camera back in the day. It definitely matters, but it’s only a single factor in an overall system, like judging a car by its tyres.",
                          "score": 1,
                          "created_utc": 1732482273.0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lyqbb9l",
          "author": "system3601",
          "body": "Sony is the worst out of the 3 in the eye of professional photographers.  This article is garbage.",
          "score": -18,
          "created_utc": 1732451193.0,
          "replies": [
            {
              "id": "lyqvbsh",
              "author": "roadmapdevout",
              "body": "Not really, a lot of pros use Sony, it’s pretty even competition for features, lenses.",
              "score": 4,
              "created_utc": 1732459756.0,
              "replies": []
            },
            {
              "id": "lyqjnhu",
              "author": "no-mad",
              "body": "Sony is the worst out of the three for how they treat their customers.",
              "score": 8,
              "created_utc": 1732455152.0,
              "replies": [
                {
                  "id": "lyqprlv",
                  "author": "system3601",
                  "body": "Totally agree",
                  "score": 2,
                  "created_utc": 1732457660.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "lyqdl8n",
              "author": "Usaidhello",
              "body": "Sony is the favorite for content creators. I guess that’s why this article is like that.",
              "score": 3,
              "created_utc": 1732452377.0,
              "replies": [
                {
                  "id": "lyqewmj",
                  "author": "system3601",
                  "body": "Canon is. By far.",
                  "score": 0,
                  "created_utc": 1732453017.0,
                  "replies": [
                    {
                      "id": "lyqm5h7",
                      "author": "AnimeMeansArt",
                      "body": "Is it? I thought most YouTubers/Vloggers use Sony because of the better auto focus",
                      "score": 6,
                      "created_utc": 1732456196.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "lyqj6q7",
          "author": "MoonOut_StarsInvite",
          "body": "Sony? I worked as a professional photographer and retoucher for years and I’ve literally *never* heard of anyone using Sony??? 🤣 So I can tell you that at least Canon and Nikon do in fact win out Sony at least.",
          "score": -22,
          "created_utc": 1732454953.0,
          "replies": [
            {
              "id": "lyqvidb",
              "author": "roadmapdevout",
              "body": "Sony’s share has been increasing for years now. They’ve benefited especially from the move to mirrorless, as they were the first to push hard on that change.",
              "score": 5,
              "created_utc": 1732459822.0,
              "replies": []
            },
            {
              "id": "lyujzdi",
              "author": "hertzsae",
              "body": "The Associated Press switched their photographers to Sony in 2020. I know some pros that are on Nikon and are only sticking with them thanks to their current inventory of lenses. Sony has made massive gains recently.",
              "score": 3,
              "created_utc": 1732503754.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyq6lsj",
      "author": "None",
      "body": "[removed]",
      "score": 51,
      "created_utc": 1732448552.0,
      "replies": [
        {
          "id": "lyqh8sp",
          "author": "None",
          "body": "[removed]",
          "score": 6,
          "created_utc": 1732454095.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyugu0p",
      "author": "None",
      "body": "As someone who's not into photography and cameras, can someone explain what advances and improves cameras? They still look look the same for the most part after all these years unlike the development of smartphones and things that have had changes easy to tell with the eye.\n\nI always had this idea in my head that cameras have always done their job well both digital and film.",
      "score": 36,
      "created_utc": 1732502542.0,
      "replies": [
        {
          "id": "lyupnpu",
          "author": "None",
          "body": "At this point, it's often just about improving performance and ease of use in more and more extreme conditions. Mostly in the areas of auto focus and low light performance. \n\nDo you *need* to have autofocus capable of tracking a ping pong ball and getting noise free shots from the other side of a dimly lit reception hall?\n\nNo... but professionals will gladly pay to have a higher performance ceiling and expand their range of operable conditions.",
          "score": 60,
          "created_utc": 1732506010.0,
          "replies": []
        },
        {
          "id": "lyuw70g",
          "author": "None",
          "body": "A camera sensor is a fancy analog to digital converter. When dealing with 50 million pixels outputting 14-bits, you got a damn huge amount of data that needs to be offloaded.    \nGeneral stats you see get better on camera's is how many megapixels, how many shots can be captured in a second, and how many shots the camera can fit in its buffer and offload to a memory card. \n\nPro bodies from sony, nikon, canon, are outputting at least 1.2GB of data per second. So ontop of the massive data being recorded, the camera is using each brands form of machine learning/AI assistance auto-focus to decide what the subject should be. Modern systems get better every model at tracking eyes, face, heads, birds, animals, trains, planes, and automobiles. \n\nEvery brand has their own proprietary SOC and allow firmware updates to adjust/improve autofocus algorithms, bug fixes, or straight up new features never seen before (Nikon's auto-capture was added to their flagship 2 years after release via firmware).  Unfortunately its known in the photography world that Sony and Canon will purposefully hold back improvements that could have been a firmware update and include it in the next physical body they release.",
          "score": 16,
          "created_utc": 1732508773.0,
          "replies": [
            {
              "id": "lyvavex",
              "author": "Noisyink",
              "body": "That Nikon detail is a fun fact, I didn't realise they were shipping big updates like that. Maybe I need to upgrade from my D700 and D7000 finally haha",
              "score": 2,
              "created_utc": 1732516229.0,
              "replies": [
                {
                  "id": "lyw6onj",
                  "author": "ZachMatthews",
                  "body": "I just bought a Z6iii where my last was a D600. The difference is astounding. This thing sees in the dark and the workflow side is much easier thanks to SnapBridge and Lightroom integration. The cameras all have wi-fi and Bluetooth now. And Z glass is excellent. ",
                  "score": 4,
                  "created_utc": 1732536133.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyuom4m",
          "author": "monsantobreath",
          "body": "The dslr basically established the baseline for digital camera ergonomics. Mirrorless has been more of a revolution toward video recording performance. Raw image quality hasn't really improved much in ten years. Many find the modern still photo lenses too sterile even and add the \"character\" of less perfect lenses in post. For video though they seem quite favoured.\n\nAnd for what it's worth still photo takers tend to find sony the worst at ergo, confusing menus, and uninspiring colour science.",
          "score": 13,
          "created_utc": 1732505584.0,
          "replies": [
            {
              "id": "lyv17qi",
              "author": "Gnochi",
              "body": "That said, mirrorless makes all those old lenses fun to use again, with WYSIWYG and metering and perfect (albeit manual) focusing capability and such. All you need is an adapter.",
              "score": 4,
              "created_utc": 1732511119.0,
              "replies": [
                {
                  "id": "lyv37my",
                  "author": "monsantobreath",
                  "body": "Well my Nikon dslr makes them fun to use as well. I'm not sure what mirrorless did to make them more fun. Nikon has used the F mount for decades and most dslrs could use lenses going back to 1977 without adapter. The Df uniquely could use the ones from even further back that normally needed to be modified.\n\nAs for wysiwyg I feel modern camera users use that as a crutch especially if shooting for pleasure.",
                  "score": 1,
                  "created_utc": 1732512106.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lyuupxk",
          "author": "SweatyInBed",
          "body": "In addition to other replies to you, different cameras have different capabilities on multiple facets. For video alone, this can include things like frame rate, resolutions, resolutions AT specific frame rates, color depth, record formats, outputs, color space workflows, etc.  I won’t bore you with the details, but some of these are crucial to success in the video landscape.",
          "score": 2,
          "created_utc": 1732508137.0,
          "replies": []
        },
        {
          "id": "lyv7j02",
          "author": "QuickQuirk",
          "body": "It's been slow ticking evolution over the past 15 years.\n\nDigital cameras leapt forwards by bounds the first few years, and now the improvements are pretty mild and incremental.\n\nThe megapixels are so high that most users don't care, and that's stagnated. (plus, adding more MP just slows down processing and needs more expensive storage.)\n\nThe technology has shrunk so much that now the size limitation is simply *ergonomics*, and the size is a product decision rather than a technical one (Is this camera going to have a huge grip to balance very large lenses, or will it be small enough to stuff in a jacket pocket?)\n\nCamera CPU speeds have increased so much that all cameras can shoot faster and longer bursts - even budget cameras exceed the flagships of 20 years ago.\n\nThe ISO/dynamic range is bumping up against the limitations of physics and material science, so you don't see much advancement there any more either.\n\nReally, the only thing left is around integrations with other apps, like direct upload to social media; AI features to 'improve' the photos you take (at which point, why not use an iphone?), and autofocus and ease of use. The last two are pretty decent, but not required for most photographers. And even then, the improvements are incremental. All cameras have phenomonal eye autofocus now; and very little skill is required to get sharp photo's of most subjects (I think this is great, as I have little skill :) ).  \n\nProfessionals are happy to pay for that slightly better autofocus performance so they nail the shot - but even a lot of them are perfectly happy with what they have.\n\nYou're right - Cameras have always done their job well, digital or film. The difference is that with older cameras, more skill was required to get the right exposure, the right focus, the right framing, the right moment in time. Now the camera does a lot of that for you, and is a lot more forgiving of mistakes.",
          "score": 1,
          "created_utc": 1732514359.0,
          "replies": [
            {
              "id": "lyvd0p8",
              "author": "DaviesSonSanchez",
              "body": "Just a small point with regards to AI: I only know how Sony uses it but they strictly use AI for auto focus and subject recognition. There's no AI improvement of images going on.",
              "score": 2,
              "created_utc": 1732517457.0,
              "replies": []
            }
          ]
        },
        {
          "id": "lyv8agz",
          "author": "amor_fatty",
          "body": "Mostly focusing and improvement in image quality under poor lighting conditions.",
          "score": 1,
          "created_utc": 1732514781.0,
          "replies": []
        },
        {
          "id": "lyvtmyw",
          "author": "quick_justice",
          "body": "There’s quite a few things.\n\nFor traditional mirror cameras - autofocus speed and quality, mostly important for dynamic shots like sports and wildlife. “Magic” autofocus is supposed to grab and track moving subject against any background, but we are quite far from that, so lot of room to improve. It also gets worse in the low light, and there’s speed of acquisition.\n\nBurst speed, both time between shots and quantity it can take before buffer is done.\n\nImage stabilisation both optical and electronic, which is partly on lens but has to be supported by the camera.\n\nSize and weight. Battery life.\n\nPicture quality itself - namely, photosensitivity, or rather amount of noise sensor generates in low light.\n\nFor mirrorless - for a while they were too lagging for dynamic subject, but now they are actually better, but they ones that are better are excruciatingly expensive. So cost here is a factor of improvement.\n\nEdit: to be clear none of it matters very much for an average tourist or a family guy who wants some family memories. They are also not a target audience.\n\nHowever if you are for example in a wildlife photography, even as a hobbyist you will be facing a lot of small fast moving targets in a low light and in difficult focus conditions - think a flock of finches moving through the branches at dawn. Even at this level every bit of innovation pays. \n\nIf you are in concert photography you might be looking at taking high quality photos of moving subjects in a very difficult light and so on.\n\nCameras now improve for these sort of things and there’s still a lot to do. For a vacation photos 10 years old DSLR will do fantastic job.",
          "score": 1,
          "created_utc": 1732528224.0,
          "replies": []
        }
      ]
    },
    {
      "id": "lyycqnl",
      "author": "EveryPixelMatters",
      "body": "This is a uninformative clickbait article so I’ve asked GPT for the differences between the A1 & a1 II:\n\nKey Upgrades in the Alpha 1 II:\n\n\t1.\tImage Sensor and Processing:\n\t•\tBoth models feature a 50.1 MP full-frame Exmor RS® stacked CMOS sensor. However, the Alpha 1 II benefits from an upgraded BIONZ XR® processor paired with a new AI processing unit. This enhances autofocus, subject recognition, and image quality, especially in high ISO ranges【11】【12】.\n\t2.\tAutofocus and AI Enhancements:\n\t•\tThe Alpha 1 II introduces Real-time Recognition AF with human pose estimation, which tracks a person’s head and torso more precisely. It also has a new “Auto” subject recognition mode that doesn’t require pre-selecting a subject type【11】【12】.\n\t3.\tImage Stabilization:\n\t•\tThe Alpha 1 II offers improved stabilization with up to 8.5 stops (center) compared to 5.5 stops in the original model, allowing for steadier handheld shooting【12】.\n\t4.\tContinuous Shooting:\n\t•\tBoth cameras achieve blackout-free shooting at 30 fps, but the Alpha 1 II adds a “Pre-Capture” feature, recording images up to one second before the shutter is pressed, and a speed boost for high-action moments【11】【12】.\n\t5.\tVideo Capabilities:\n\t•\tBoth support 8K/30p and 4K/120p recording with 10-bit 4:2:2 color. The Alpha 1 II includes a Dynamic Active Mode for more stable handheld video【12】.\n\t6.\tErgonomics and Usability:\n\t•\tThe Alpha 1 II features a redesigned grip, a 4-axis tilting LCD, and additional custom buttons for better handling. It also supports a dual-battery charger and compatibility with Sony’s latest accessories【11】【12】.\n\t7.\tConnectivity:\n\t•\tThe Alpha 1 II enhances workflow efficiency with support for 2.5GBASE-T Ethernet, faster data transfer options, and cloud integration with Adobe Lightroom and Google Drive【11】【12】.\n\t8.\tSustainability:\n\t•\tThe Alpha 1 II is the first in the series to feature eco-friendly packaging made from recycled materials【11】【12】.\n\nShared Features:\n\n\t•\tBoth cameras include high-speed electronic shutters, anti-distortion capabilities, and professional-grade video functionality, ensuring they remain excellent tools for hybrid photography and videography【11】【12】.\n\nThe Alpha 1 II launches in December 2024 at a price of approximately £6,300 or €7,500【11】. It’s designed to refine and expand upon the Alpha 1’s capabilities, making it a compelling choice for demanding professionals.",
      "score": 4,
      "created_utc": 1732563107.0,
      "replies": []
    },
    {
      "id": "lyzngws",
      "author": "davidjschloss",
      "body": "One of Sony's \"issues\"  is they have a camera for every niche. Want a 4k superstar with great low light? A7siii. Want a sports cam with global shutter? A9 III.  Aps-c cine? Fx30. Hollywood movie cam for James Cameron? Venice. \n\nMost companies have a flagship which is the best product they've made. But when you make great cameras in niches the flagship is less necessary. \n\nCanon and nikon too. The 76III does 85% of what the z9 does. Canon has all kinds of verticals. \n\nSource:I've worked in the camera journalism and pr world for decades.",
      "score": 2,
      "created_utc": 1732577972.0,
      "replies": []
    },
    {
      "id": "lyvgp0z",
      "author": "midz411",
      "body": "Too good to follow themselves maybe. they fell off.",
      "score": 1,
      "created_utc": 1732519667.0,
      "replies": []
    },
    {
      "id": "lz17eyv",
      "author": "mister2forme",
      "body": "I've tried moving to Sony, three times. Each time I just went back to Nikon.  They just take better pictures for me. I have a Z8 now and I have yet to find something it struggles in. The controls and menu system are more intuitive and it's damn comfortable to use. I know all the tech influencers are all about Sony, but that's actually a turn off for me.  If you gotta market a product that hard kinda thing. \n\n*Shrug* to each their own.",
      "score": 1,
      "created_utc": 1732599503.0,
      "replies": []
    },
    {
      "id": "lyvjq8x",
      "author": "SystemFolder",
      "body": "The shortage didn’t help either. I loved my PS4. I wanted to get a PS5, but couldn’t. I bought an Xbox Series X instead, and I have no plans to get a PS5 anymore.",
      "score": -3,
      "created_utc": 1732521568.0,
      "replies": [
        {
          "id": "lywp1ux",
          "author": "zebirke",
          "body": "Lol this is about cameras",
          "score": 7,
          "created_utc": 1732544049.0,
          "replies": []
        },
        {
          "id": "lyw9lui",
          "author": "jeff316",
          "body": "Can I ask why Xbox>PS5? Trying to decide myself",
          "score": 1,
          "created_utc": 1732537599.0,
          "replies": [
            {
              "id": "lyy36ta",
              "author": "SystemFolder",
              "body": "I wanted to get the *next-gen*, and now I have settled into my choice.",
              "score": 2,
              "created_utc": 1732560130.0,
              "replies": []
            },
            {
              "id": "lyz52tr",
              "author": "MagicTacoHuman",
              "body": "I’ll help you out. PS5 is way better. Don’t even think about it",
              "score": 2,
              "created_utc": 1732571811.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyz5iyg",
      "author": "unskilledplay",
      "body": "Nonsense. \n\nMy Leica film camera from the 1980s is one of just a few cameras I've owned that were never followed up with something better.\n\nThe Sony Alpha is missing a bunch of features that already exist elsewhere. There is no computational photography that you get on phones.\n\nMy phone can take a stream of data and identify the perfect frame where nobody is blinking in the group. I press the shutter once and it makes sure it gets the best shot. The Sony accomplishes this by shooting 30 frames a second and then making you scroll through dozens of photos to select the one you like. There's a btter way to do this.\n\nMy phone can use data from previous and subsequent frames to enhance an existing frame. Apple calls this night mode. I have to bust out Adobe tools and spend a good amount of manual effort to get the same effect with the Sony. The Sony does not do this well. It has \"pixel shift\" which is basically just upsampling.\n\nI still have to download photos and apply Lightroom presets to them. I can't have this all done automatically in camera. The Sony preset system is embarrassingly bad.\n\nThe Sony a1 ii isn't better than the a1 because the competition sucks. There's plenty of room to improve. Maybe more room than since the introduction of DSLRs in the early 2000s.",
      "score": 0,
      "created_utc": 1732571950.0,
      "replies": [
        {
          "id": "lz1o1eq",
          "author": "-knave1-",
          "body": "Professional photographers buy cameras because they get exactly what they capture with the device, not because the camera combines photos/uses AI to generate information\n\nPhotographers want the raw image and the ability to do the rest in post in order to capture the most detailed image possible. Then be able to use their creativity to create the feeling they want by cropping/editing, not just slap a filter on\n\nHaving said that, a lot of influencers and amateurs want cameras that act like phones, because of ease of access, but you can't really have both. \n\nFujifilm is to influencers what Sony is to professionals\n\nOne has amazing pre-built filters that help the photographer capture immediate Instagram-worthy photos(like a phone)\n\nThe other creates high quality images ready for processing and editing in post\n\nBoth are great and useful for different reasons, but to compare Sony's new camera models to your phone is just dumb",
          "score": 2,
          "created_utc": 1732609175.0,
          "replies": [
            {
              "id": "lz3b9ba",
              "author": "unskilledplay",
              "body": "I'm really into photography. I don't shoot professionally but I shoot a lot and a lot of people in my circle do this professionally. I personally know around a dozen professional photographers in my city. What you say applies to zero of them. All photojournalists and some other professionals would care a lot about this. I just don't know any.\n\n>Both are great and useful for different reasons, but to compare Sony's new camera models to your phone is just dumb\n\nRevisit this on the mark iv and eat your words.\n\n>One has amazing pre-built filters that help the photographer capture immediate Instagram-worthy photos(like a phone). The other creates high quality images ready for processing and editing in post\n\nI've owned two Fuji cameras. Sony alpha is the only non-analog camera I currently own. What you say is all untrue. I know someone who uses Sony presets and Sony's Creator's app to go from shot to share in little more than seconds. What you say is just marketing narrative.",
              "score": 1,
              "created_utc": 1732636922.0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "lyss03t",
      "author": "None",
      "body": "[deleted]",
      "score": -34,
      "created_utc": 1732481440.0,
      "replies": [
        {
          "id": "lysxeac",
          "author": "ionelp",
          "body": "If you are happy with what the phone camera gives you, you are not the target audience for flagship camera bodies. Don't take this as criticism, it's a simple observation.",
          "score": 47,
          "created_utc": 1732483072.0,
          "replies": [
            {
              "id": "lyukrrz",
              "author": "None",
              "body": "[deleted]",
              "score": -4,
              "created_utc": 1732504061.0,
              "replies": [
                {
                  "id": "lyv25x1",
                  "author": "kayak83",
                  "body": "The A9 has...flakey autofocus??\n\nA9 III was the release of global shutter btw,  not the II.  I assume that's just a typo.",
                  "score": 2,
                  "created_utc": 1732511586.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "lyt6fwm",
      "author": "noneofatyourbusiness",
      "body": "He wont even make the illegal order. Why so people believe the bluster and ignore the obvious",
      "score": -15,
      "created_utc": 1732485909.0,
      "replies": []
    },
    {
      "id": "lyvwyxx",
      "author": "joeyc923",
      "body": "I tried Sony but returned it, felt like a computer brick that took pictures. Soulless. Great AF performance though.",
      "score": -5,
      "created_utc": 1732530399.0,
      "replies": [
        {
          "id": "lyw0xgf",
          "author": "Shockandawenasty",
          "body": "Soulless? What do you mean?",
          "score": 4,
          "created_utc": 1732532867.0,
          "replies": [
            {
              "id": "lywhqyx",
              "author": "joeyc923",
              "body": "Lol the downvote brigade is out I see. By soulless I suppose I mean not very fun to use IMO. Didn't feel like a camera so much as a 'device.' The menu system is part of that although I think all of them have their issues.",
              "score": 2,
              "created_utc": 1732541200.0,
              "replies": [
                {
                  "id": "lywu4uv",
                  "author": "Shockandawenasty",
                  "body": "It’s just a weird statement to make about an object that is soulless haha. Okay, that makes more sense the way you explained it.",
                  "score": 2,
                  "created_utc": 1732545911.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "lywhjjm",
          "author": "ComradeDelter",
          "body": "Quite literally all digital cameras are computer bricks that take pictures haha",
          "score": 1,
          "created_utc": 1732541117.0,
          "replies": []
        }
      ]
    }
  ]
}