{
  "post": {
    "title": "This palm-sized mini PC features a flip-up display with Game Boy SP vibes | Packing a Ryzen 9 HX 370 APU with integrated Radeon 890M graphics under the hood",
    "author": "chrisdh79",
    "id": "1jexkpq",
    "score": 780,
    "created_utc": 1742392648.0,
    "selftext": "",
    "num_comments": 87,
    "subreddit": "gadgets",
    "url": "https://www.reddit.com/r/gadgets/comments/1jexkpq/this_palmsized_mini_pc_features_a_flipup_display/"
  },
  "comments": [
    {
      "id": "mimft9g",
      "author": "OrganicKeynesianBean",
      "body": "Looks fun. People meme on hardware like this, but I think it’s kinda neat.",
      "score": 186,
      "created_utc": 1742394165.0,
      "replies": [
        {
          "id": "mimhd9a",
          "author": "LLouG",
          "body": "The future could be amazing if we keep getting more stuff like that, imagine being able to emulate anything up to xbox360/ps3 or of even the generations after that in such a small device wherever you go.",
          "score": 83,
          "created_utc": 1742394650.0,
          "replies": [
            {
              "id": "min65cm",
              "author": "trickman01",
              "body": "Like a steam deck?",
              "score": 34,
              "created_utc": 1742402038.0,
              "replies": [
                {
                  "id": "minarzq",
                  "author": "JoviAMP",
                  "body": "The article says it has a 5\" screen, which is closer to my (4.7\") iPhone SE than it is to my (7\") Steam Deck.",
                  "score": 18,
                  "created_utc": 1742403372.0,
                  "replies": [
                    {
                      "id": "miotnyi",
                      "author": "NeWMH",
                      "body": "Yeah, but that’s because we actually want a larger screen on the steam deck",
                      "score": 4,
                      "created_utc": 1742419426.0,
                      "replies": [
                        {
                          "id": "mipenii",
                          "author": "trickman01",
                          "body": "Also the Steam Deck comes with everything you need to play games on the go.",
                          "score": 1,
                          "created_utc": 1742425996.0,
                          "replies": [
                            {
                              "id": "miplh1y",
                              "author": "None",
                              "body": "[deleted]",
                              "score": 5,
                              "created_utc": 1742428204.0,
                              "replies": [
                                {
                                  "id": "miplsy1",
                                  "author": "trickman01",
                                  "body": "Neither is the computer in the article.",
                                  "score": -1,
                                  "created_utc": 1742428312.0,
                                  "replies": []
                                },
                                {
                                  "id": "misjheh",
                                  "author": "None",
                                  "body": "[deleted]",
                                  "score": 0,
                                  "created_utc": 1742477503.0,
                                  "replies": [
                                    {
                                      "id": "mitnuvm",
                                      "author": "Gnulnori",
                                      "body": "The pockets on JNCOs should be sufficient.",
                                      "score": 3,
                                      "created_utc": 1742489705.0,
                                      "replies": [
                                        {
                                          "id": "mivbnhd",
                                          "author": "DGlen",
                                          "body": "Oh hell yeah I used to keep half my locker in the back pockets of those bad boys.",
                                          "score": 1,
                                          "created_utc": 1742506978.0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "mipuzet",
                  "author": "BLF402",
                  "body": "Or the very affordable miyoo mini",
                  "score": 2,
                  "created_utc": 1742431410.0,
                  "replies": []
                }
              ]
            },
            {
              "id": "mimq974",
              "author": "SlightShift",
              "body": "I’m thinking cyberdecks lol",
              "score": 11,
              "created_utc": 1742397367.0,
              "replies": []
            },
            {
              "id": "mimjvjk",
              "author": "Moist_Broccoli_1821",
              "body": "Already can. [iPod Human](https://youtu.be/Phbe8mEDMe4?feature=shared)",
              "score": 6,
              "created_utc": 1742395431.0,
              "replies": [
                {
                  "id": "minfr62",
                  "author": "happycabinsong",
                  "body": "holy shit I haven't thought about nigahiga in years, I wonder what he's up to now",
                  "score": 1,
                  "created_utc": 1742404792.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mingss9",
          "author": "trowayit",
          "body": "I use an ASUS ryzen 5 minipc as a linux plex/game/admin server.  There's been times where I've borked stuff bad enough that I've had to drag a monitor into the closet it sits in, just to fix something.  This would be nice for such an occasion.",
          "score": 9,
          "created_utc": 1742405088.0,
          "replies": [
            {
              "id": "misqfav",
              "author": "Lostndamaged",
              "body": "This will be handy dandy for my servers on film\n/ tv sets.  With the onboard touchscreen, I can design a custom ui in the software to do basic controls and not have to have an additional screen or keyboard.",
              "score": 1,
              "created_utc": 1742479803.0,
              "replies": []
            },
            {
              "id": "misy0k0",
              "author": "TheSmJ",
              "body": "I keep a old monitor with dead pixels connected to my server for this reason. I only need to power it on once a year or so when something goes sideways, but it makes those once in a blue moon visits to the server effortless and one less monitor out of the dump.",
              "score": 1,
              "created_utc": 1742482143.0,
              "replies": []
            },
            {
              "id": "miooi1f",
              "author": "TryingT0Wr1t3",
              "body": "GPD Pocket has HDMI and keyboard/touchpad as KVM. It's not cheap but is a small computer that can also do that.",
              "score": 1,
              "created_utc": 1742417877.0,
              "replies": [
                {
                  "id": "miop933",
                  "author": "trowayit",
                  "body": "Not clear on why I would connect a mini laptop to my mini PC just for the screen",
                  "score": 1,
                  "created_utc": 1742418096.0,
                  "replies": [
                    {
                      "id": "mipj1cm",
                      "author": "TryingT0Wr1t3",
                      "body": "Ah, I think I understand what you are saying, you mean you wanted this small monitor already in the server you have, not using this PC to access your other PC as a debug tool. Yeah, I see. There are some small monitors for this, for case mod, but there are small portable usb-c monitors too (and they are surprisingly cheap!)",
                      "score": 2,
                      "created_utc": 1742427412.0,
                      "replies": []
                    },
                    {
                      "id": "mipih56",
                      "author": "scsibusfault",
                      "body": "... For the reason you just complained about. The gpd is essentially a laptop that also works as a KVM in a pinch. \n\nSo if you already have one, you can plug it into a headless server and get (video + keyboard+ mouse) all in a single portable unit. \n\nYou obviously would not buy one solely to use as a monitor.",
                      "score": 1,
                      "created_utc": 1742427232.0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "minq8xm",
          "author": "atb12688",
          "body": "The 890m is roughly equivalent to a 1070 and is capable of ray tracing.  Integrated graphics is no longer the joke it once was.  You should be able to do quite a bit (especially with older titles which are apparently getting more play atm) with this APU assuming you have at least 16gb or RAM or even better, 32.",
          "score": 5,
          "created_utc": 1742407777.0,
          "replies": [
            {
              "id": "miq6uu3",
              "author": "Plank_With_A_Nail_In",
              "body": "WTF the 1070 is a ten year old GFX card.....10 year old performance is a joke lol.\n\n\nHardware community has gone really weird in the last year lol.",
              "score": -3,
              "created_utc": 1742435538.0,
              "replies": [
                {
                  "id": "miqgsl2",
                  "author": "Paksarra",
                  "body": "Keep in mind that most games don't target bleeding edge hardware anymore. The days of \"can it run Crysis?\" are long-gone; now it's \"will it run on a Steam Deck?\"\n\nOn top of that, a lot of people just play live service games these days. You don't need a $600+ video card to run Fortnite and Marvel Rivals.\n\nI was rather surprised to realize that my \"new\" desktop with a Raedon RX 5700 is already five years old; the only game I've had any issues with was trying out the Final Fantasy 16 demo and getting frame drops in heavy cutscenes on the default graphical settings. I just had to tweak the settings and I was good to finish the demo. (However, to be fair, I don't play a lot of new release AAAs.)",
                  "score": 5,
                  "created_utc": 1742439099.0,
                  "replies": []
                },
                {
                  "id": "mjistn4",
                  "author": "Dt2_0",
                  "body": "And yet the 1070 is still perfectly performant in most games at 1080p with lower quality settings. AAA games? Maybe not, but then again, lots of AAA games run on the Steam Deck.",
                  "score": 2,
                  "created_utc": 1742841328.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "mip3rsu",
          "author": "welsper59",
          "body": "Same. As long as it isn't too expensive (or perhaps has cheaper options) and my eyesight doesn't become terrible, I often do have interest in these things. I try to find whatever use I can for them, even if they aren't used that often. I still use my 3rd gen Surface Pro from time to time to do little work things or when I travel. Also this mini PC's 5\" screen isn't bad at all when you consider that's only a little smaller than most phones today. Just don't expect to use the screen for things that have small UI/fonts lol.",
          "score": 2,
          "created_utc": 1742422536.0,
          "replies": []
        },
        {
          "id": "mipgncd",
          "author": "rolfraikou",
          "body": "I've been seeing *so many* people buying those mini displays that show hardware stats, that are even close to the size of this display. So I could even see someone who rarely needed the built in display to be a main display, setting it on their desk within sight, using the built in display just for stats on temperatures and speed. And maybe you do need to take it on the go for some reason, you already have a display built in. Also, for troubleshooting if a external display were to stop working, your built in one should keep working.",
          "score": 2,
          "created_utc": 1742426638.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mimb6ja",
      "author": "chrisdh79",
      "body": "From the article: Mini PC brand Aoostar has launched the G-Flip 370, a palm-sized mini PC that, aside from its cool display, also packs some serious power under the hood. That's thanks to AMD's Ryzen AI 9 HX 370 APU at its heart, which boasts 12 Zen 5 cores and Radeon 890M integrated graphics. Aoostar says this setup can handle mainstream AAA games with ease. Gentler titles like League of Legends can even hit 90 fps at 4K.\n\nBut let's talk about the star of the show: that flip-up screen. At a modest 5 inches, the screen isn't exactly a cinematic experience, but it has a full-HD 1080p resolution and supports touch input. Aoostar touts it as perfect for system monitoring, quick tasks, or even catching up on your favorite shows. The screen is mounted on an aluminum alloy hinge, allowing it to tilt up to 65 degrees.\n\nIt's a clever addition, especially for a mini PC where space is all-important, since the goal is to cut down on the dimensions as much as possible. Screens are not typically a priority for PC makers when designing such compact devices.\n\nThat said, the integrated screen isn't the only way to experience the G-Flip 370's capabilities. Five inches just doesn't cut it for tasks like gaming, so the mini PC also comes equipped with HDMI 2.1 and Oculink ports for connecting to more impressive displays. At the same time, dual 2.5G Ethernet ports and Wi-Fi 7 support ensure lightning-fast connectivity, while a fingerprint scanner next to the flip-up screen adds a touch of convenience for quick logins.\n\nCooling is handled by a large vapor chamber and a single bottom-mounted fan, which should keep things running smoothly. And for those who like to tinker, the G-Flip 370 offers removable memory and two M.2 PCIe 4.0 slots for storage.\n\nAoostar hasn't announced pricing yet, but if past models are any indication, the G-Flip 370 could land around the $700 mark. Whether that's a steal or a stretch will depend on how much you value portability and that unique screen.",
      "score": 28,
      "created_utc": 1742392693.0,
      "replies": []
    },
    {
      "id": "mimtltn",
      "author": "A_Doormat",
      "body": "I love fun hardware like this.  \n\nSeems like they're getting closer to my ideal device. I am on call 24/7, 365, for critical infrastructure and I hate carrying around my damn laptop everywhere I go. I wish I had a more portable device I could have in my day bag or jacket pocket that would let me vpn/remote into my environment and begin troubleshooting if I am remote. \nSo far the closest thing I have is.....the steam deck lol. Not exactly a perfect solution!\n\nThis little guy would be great, provided I had a portable keyboard or something. A little beefier than I need, of course.",
      "score": 47,
      "created_utc": 1742398367.0,
      "replies": [
        {
          "id": "minp0ul",
          "author": "None",
          "body": "[removed]",
          "score": 11,
          "created_utc": 1742407425.0,
          "replies": [
            {
              "id": "mio682c",
              "author": "Woogies",
              "body": "I had a GPD Micro when I was doing field work. A bit pricey, but nearly the perfect device for that niche. Great IO and functionality. I kinda regret selling it actually...",
              "score": 5,
              "created_utc": 1742412424.0,
              "replies": []
            },
            {
              "id": "mip9jex",
              "author": "JustAnOrdinaryBloke",
              "body": "GPD WIN is pretty cool, but OneXPlayer is hella expensive.",
              "score": 2,
              "created_utc": 1742424377.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mimzcp5",
          "author": "nofuture09",
          "body": "Exaxtly this device is really useful",
          "score": 6,
          "created_utc": 1742400053.0,
          "replies": []
        },
        {
          "id": "mini06g",
          "author": "TooStrangeForWeird",
          "body": "I just use my phone with moonlight. It's not great for \"big\" stuff but it works really well for the little things.",
          "score": 3,
          "created_utc": 1742405428.0,
          "replies": []
        },
        {
          "id": "minx4jg",
          "author": "Yankee831",
          "body": "Did you ever dual boot your steam deck? When my work pc went out I was using my steam deck as my main pc. Only issue is startup is a little weird though I believe there’s ways around that. I recently got a pair of Xreal glasses for a portable screen and plan on using it for editing when on the road. Pretty compact setup for me the glasses have finally got there where this is my ideal setup till steam deck 2 comes out.",
          "score": 2,
          "created_utc": 1742409781.0,
          "replies": []
        },
        {
          "id": "miomai8",
          "author": "parisidiot",
          "body": "an ipad mini with keyboard wouldn't work better?",
          "score": 2,
          "created_utc": 1742417239.0,
          "replies": []
        },
        {
          "id": "mip283v",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1742422048.0,
          "replies": [
            {
              "id": "miq71e0",
              "author": "Plank_With_A_Nail_In",
              "body": "Why don't you use a small laptop instead?",
              "score": 1,
              "created_utc": 1742435601.0,
              "replies": []
            }
          ]
        },
        {
          "id": "minf7tz",
          "author": "None",
          "body": "[deleted]",
          "score": 2,
          "created_utc": 1742404640.0,
          "replies": [
            {
              "id": "mini6v3",
              "author": "TooStrangeForWeird",
              "body": "Aside from some super cheap thin clients, I don't think I've ever seen one of these without wifi, I'm pretty sure it's gonna have it. \n\nYou can always add a USB one, but I'm pretty sure it's gonna have one anyways.",
              "score": 6,
              "created_utc": 1742405482.0,
              "replies": [
                {
                  "id": "minj5ts",
                  "author": "None",
                  "body": "[deleted]",
                  "score": 1,
                  "created_utc": 1742405758.0,
                  "replies": [
                    {
                      "id": "mipm1dy",
                      "author": "TooStrangeForWeird",
                      "body": "Found it: \n\n>It also comes with a standard WiFi 7 wireless network card\n\nhttps://aoostar.com/blogs/news/aoostar-g-filp-the-first-ai370-mini-pc-with-removable-memory\n\nIt's even wifi 7!",
                      "score": 2,
                      "created_utc": 1742428388.0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "minv0ji",
              "author": "qtx",
              "body": "Pretty much every single minipc out there, even the super duper $100 or less ones have built in Wifi. It's literally a chip so cheap they will put it on anything.",
              "score": 2,
              "created_utc": 1742409162.0,
              "replies": []
            },
            {
              "id": "miofxt5",
              "author": "albhed",
              "body": "Doesn't it say \"Wi-Fi 7 support\" on the article?",
              "score": 1,
              "created_utc": 1742415401.0,
              "replies": []
            }
          ]
        },
        {
          "id": "mip7t0c",
          "author": "Just_Browsing_XXX",
          "body": "Don't forget it needs a power supply too.",
          "score": 1,
          "created_utc": 1742423821.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miner19",
      "author": "green_link",
      "body": "how is that 'gameboy SP vibes'? the screen flips up. the SP unfolds. the SP is a clamshell design. this is not.",
      "score": 21,
      "created_utc": 1742404508.0,
      "replies": [
        {
          "id": "mio7v2u",
          "author": "None",
          "body": "[deleted]",
          "score": 3,
          "created_utc": 1742412901.0,
          "replies": [
            {
              "id": "miou1f8",
              "author": "joestaff",
              "body": "Also there are Linux handhelds literally designed to look like the Gameboy SP, namely the Anbernic RG35XX-SP",
              "score": 6,
              "created_utc": 1742419539.0,
              "replies": []
            },
            {
              "id": "miroqv3",
              "author": "nero40",
              "body": "Still doesn’t explain how the writer came into the thoughts of how this has GBA SP vibes.",
              "score": 2,
              "created_utc": 1742463434.0,
              "replies": []
            }
          ]
        },
        {
          "id": "miq9ja1",
          "author": "void_const",
          "body": "This is what passes for journalism these days apparently",
          "score": 3,
          "created_utc": 1742436465.0,
          "replies": []
        },
        {
          "id": "mip505u",
          "author": "welsper59",
          "body": "I think it's in reference to general shell aesthetic and design. If you reversed that screen so that it'd be on the inside, it's effectively a fat looking SP. A fatter base and the hinge area being thick and visible when closed.",
          "score": 2,
          "created_utc": 1742422924.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mimn5b9",
      "author": "DavidBevi",
      "body": "This will make for a terrific media center + console",
      "score": 8,
      "created_utc": 1742396430.0,
      "replies": [
        {
          "id": "mipi98h",
          "author": "pusmottob",
          "body": "It’s more powerful than my work laptop.",
          "score": 2,
          "created_utc": 1742427160.0,
          "replies": []
        },
        {
          "id": "miqqcd9",
          "author": "Yankee831",
          "body": "Great use case!",
          "score": 2,
          "created_utc": 1742443023.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mimc0sy",
      "author": "Wiknetti",
      "body": "![gif](giphy|OCMGLUo7d5jJ6)",
      "score": 16,
      "created_utc": 1742392968.0,
      "replies": []
    },
    {
      "id": "min3ico",
      "author": "Deamane",
      "body": "He's just a little guy.",
      "score": 4,
      "created_utc": 1742401270.0,
      "replies": [
        {
          "id": "miqqqnd",
          "author": "Yankee831",
          "body": "Pretty sure it only has female ports ;)",
          "score": 1,
          "created_utc": 1742443198.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mimgprg",
      "author": "redzaku0079",
      "body": "Touch screen? It could make an interesting htpc. It's no originae, but it looks like it can get the job done.",
      "score": 3,
      "created_utc": 1742394446.0,
      "replies": []
    },
    {
      "id": "mincr92",
      "author": "Ok_Door_8082",
      "body": "Saying “Can I watch a lil TV before I leave” has a whole new meaning.",
      "score": 3,
      "created_utc": 1742403940.0,
      "replies": [
        {
          "id": "mio4vaj",
          "author": "Jadodkn",
          "body": "Found the guy who is too young to have seen “portable tv/radios” with their 2 inch screen.",
          "score": 3,
          "created_utc": 1742412030.0,
          "replies": []
        }
      ]
    },
    {
      "id": "minbvni",
      "author": "Misterpanda13",
      "body": "Can I play Crysis on it?",
      "score": 2,
      "created_utc": 1742403686.0,
      "replies": []
    },
    {
      "id": "mio0415",
      "author": "Ok-Seaworthiness4488",
      "body": "Wow, imagine if it could also make phone calls...",
      "score": 2,
      "created_utc": 1742410644.0,
      "replies": []
    },
    {
      "id": "mip4pmm",
      "author": "MisterDonutTW",
      "body": "It's cool, but I can't think of anything that it would actually be useful for",
      "score": 2,
      "created_utc": 1742422832.0,
      "replies": []
    },
    {
      "id": "miodc5t",
      "author": "Chezni19",
      "body": "~~this thing is $1000 though~~\n\nedit:  Maybe not?\n\nit seems cool otherwise but was not expecting that price for a 5-inch thing",
      "score": 4,
      "created_utc": 1742414647.0,
      "replies": [
        {
          "id": "miph6zv",
          "author": "Grimreap32",
          "body": "No... the article says expected price is around $700",
          "score": 2,
          "created_utc": 1742426814.0,
          "replies": [
            {
              "id": "miphk5g",
              "author": "Chezni19",
              "body": "o ok, I saw it for sale at:\n\nhttps://minixpc.com/products/aoostar-g-flip-370-mini-pc-ryzen-ai-9-hx-370-zen5-12-core-5-1ghz-ai-optimized-for-3d-creative-work?variant=44978602836202\n\nand I thought that was the price\n\nI made an edit",
              "score": 2,
              "created_utc": 1742426934.0,
              "replies": [
                {
                  "id": "mipicgv",
                  "author": "Grimreap32",
                  "body": "Understandable. That's just a placeholder. Tech companies do it all the time. For example, when the 5090's were on pre-pre-order some tech sites had them listed as $9,999",
                  "score": 3,
                  "created_utc": 1742427190.0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "miooj08",
          "author": "PKEZ",
          "body": "Where do they show the price?",
          "score": 1,
          "created_utc": 1742417885.0,
          "replies": []
        }
      ]
    },
    {
      "id": "mio2qpn",
      "author": "AtomicSymphonic_2nd",
      "body": "This looks like something I would see in a Ghost In The Shell or other Cyberpunk anime… maybe Evangelion?",
      "score": 1,
      "created_utc": 1742411408.0,
      "replies": []
    },
    {
      "id": "mio7a4k",
      "author": "Supermkcay",
      "body": "Interesting",
      "score": 1,
      "created_utc": 1742412730.0,
      "replies": []
    },
    {
      "id": "mip3g2z",
      "author": "jaykstah",
      "body": "I can't say with confidence that I would use something like this often enough to justify a purchase but this is exactly the type of fun form factors of devices I love to have around just to play with every once in a while. Pretty cool little device. Still kinda mind blown that we have computers this small able to crank out some AAA titles",
      "score": 1,
      "created_utc": 1742422432.0,
      "replies": []
    },
    {
      "id": "miq6lrq",
      "author": "Plank_With_A_Nail_In",
      "body": "4 USB ports, needs 8 to go on my telescope shame as the screen would be fairly useful for initial setup outside wouldn't need to bring my laptop.",
      "score": 1,
      "created_utc": 1742435451.0,
      "replies": []
    },
    {
      "id": "miq93na",
      "author": "Content_Geologist420",
      "body": "Be so great for MLB Power Pros",
      "score": 1,
      "created_utc": 1742436316.0,
      "replies": []
    },
    {
      "id": "miq9by8",
      "author": "void_const",
      "body": "Useless gimmick",
      "score": 1,
      "created_utc": 1742436396.0,
      "replies": []
    },
    {
      "id": "miqq07h",
      "author": "Kills_Alone",
      "body": "Kinda looks like a miniature printer.",
      "score": 1,
      "created_utc": 1742442873.0,
      "replies": []
    },
    {
      "id": "mirolsp",
      "author": "nero40",
      "body": "> it flips open in a manner reminiscent of the Game Boy Advance SP \n\nThis is a stretch. \n\nPC looks nice though.",
      "score": 1,
      "created_utc": 1742463344.0,
      "replies": []
    },
    {
      "id": "mimgrzw",
      "author": "None",
      "body": "[deleted]",
      "score": 1,
      "created_utc": 1742394466.0,
      "replies": [
        {
          "id": "miml88g",
          "author": "SurreptitiousSyrup",
          "body": "They said the screen is 5 in.",
          "score": 7,
          "created_utc": 1742395852.0,
          "replies": []
        }
      ]
    },
    {
      "id": "miorq3r",
      "author": "2roK",
      "body": "For $700 no thanks",
      "score": 1,
      "created_utc": 1742418837.0,
      "replies": [
        {
          "id": "miqqt9i",
          "author": "Yankee831",
          "body": "Jesus what specs for $ do you demand!?!?",
          "score": 5,
          "created_utc": 1742443231.0,
          "replies": []
        }
      ]
    },
    {
      "id": "minq4jv",
      "author": "anonnnnn462",
      "body": "I think it’s a great idea - might get one if they aren’t too expensive",
      "score": 1,
      "created_utc": 1742407741.0,
      "replies": []
    },
    {
      "id": "miq0lu0",
      "author": "sh0cked",
      "body": "The display flips up the wrong way. This is asking to get dusty, scratched, and broken. Should have folded up the other way with the screen starting facing down.",
      "score": 1,
      "created_utc": 1742433356.0,
      "replies": []
    },
    {
      "id": "mip2ycn",
      "author": "jimmytime903",
      "body": "I really only see this being used by two types of people.\n\n1. Parents/car modifiers who want back seat screens for the kids/homies.\n1. People who think they're above laptops. (and I guess want to carry a keyboard with them everywhere)",
      "score": -2,
      "created_utc": 1742422277.0,
      "replies": []
    },
    {
      "id": "min1m20",
      "author": "chamullerousa",
      "body": "Fun idea but I feel like this is just barely missing the mark. Why not use the smart phone form factor and just make it a little thicker? We are already accustomed to that and you could use the extra thickness for ports and battery.",
      "score": -5,
      "created_utc": 1742400716.0,
      "replies": [
        {
          "id": "minxvcg",
          "author": "Yankee831",
          "body": "Nah, how is a phone better? Like set your phone on a table with a bunch of cords plugged in and now I have to look straight down at it… it’s a pc not a cordless device, it’s meant to be plugged into a monitor and be used with peripherals not as phone.",
          "score": 3,
          "created_utc": 1742409997.0,
          "replies": [
            {
              "id": "minzu8q",
              "author": "chamullerousa",
              "body": "The phone screen would be the portable viewing option. Bluetooth for keyboard and mouse. No ports required. Plus fewer moving parts to fail. When you are at a desk with external monitor then you’re plugging in peripherals and not using the integrated display. Also the form factor is way more portable than this almost cube. Even the foldable phone form factor would be a good option. Samsung DeX is heading in the right direction but it isn’t being invested in enough.",
              "score": -1,
              "created_utc": 1742410566.0,
              "replies": [
                {
                  "id": "mio3rab",
                  "author": "Yankee831",
                  "body": "It has a screen. So now it needs a kick stand to be viewed? You hold a phone in your hand you don’t hold this in your hands. Phones are not meant to be used on a table they’re meant to be held. Laying your phone down on a table is not as good as a screen that pops up on a hinge. \n\nThe screen is small and not meant as the primary form factor. This is meant to be connected to a screen so ports unless you’re going to be using wireless screen tech which is not common. \n\nOnce again it’s meant to be hooked up to a screen and a keyboard/mouse. Sure you can use Bluetooth but it’s still going to need a screen. A brick with a flat screen misses the mark way more than this does. Your device creates more issues with no gain. What’s the benefit to being a slab?",
                  "score": 3,
                  "created_utc": 1742411703.0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}